{
    "remaining_requests": 42359,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SoundOriginal-Desktop-Computer-Motherboard-Supply/dp/B074891DJP",
    "body": {
        "name": "SoundOriginal Refit Desktop Computer Case Motherboard Power Supply Reset HDD Button Switch (63inch 160cm)",
        "price": "$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SoundOriginal-Desktop-Computer-Motherboard-Supply/dp/B074891DJP",
        "soldBy": {
            "sellerID": "AU6OSKX1QDMNX",
            "name": "SoundOriginal Electronics",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AU6OSKX1QDMNX&asin=B074891DJP&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41L9RNVSaML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41u178h34eL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41K6C9-aYxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41G0TRQYJTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uluEwW0iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-4kBSKPAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 ROQ27CbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: SoundOriginal",
            "link": "https://www.amazon.com/SoundOriginal/b/ref=bl_dp_s_web_21468505011?ie=UTF8&node=21468505011&field-lbr_brands_browse-bin=SoundOriginal"
        },
        "brand": "SoundOriginal",
        "merchantInfo": "SoundOriginal Electronics",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 694,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Computer power button: Making Power Computer much easier. Located computer in a hard to reach area , this is a convenient switch on the desk and hitting it rather than bend down to turn the computer on",
            "Motherboard power switch: There Are Two Buttons on the Switch. One is power button in the center and the other is a reset button.",
            "There Is a Metal Sleeve over the cable that sits nicely in the card-slot cover to prevent the cable from being accidentally pulled or disconnected from the main board.",
            "HDD LED lights in the switch. They're solid blue when it's on, and flicker pieces of red when your computer is loading or doing something memory intensive. The amount of red even seems to correspond with how much strain your computer is under, so it's easy to tell if your computer is off or just sleeping when you return",
            "Sometimes it's the small parts that can make a big difference. Replace your burnt out LEDs and worn out switches with this handy ATX front bezel wire kit. The five-piece kit comes with two switches (Power, Reset) and three LEDs (Power, Hard Drive Activity, Sleep). Each switch and LED is clearly labeled to make installation easy. Make sure your computer still looks and works as great as the day you bought it with this replacement kit."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Internal Power Supplies",
                "link": "https://www.amazon.com/Power-Supplies-Computer-Accessories/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1161760"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "SoundOriginal"
            },
            {
                "name": "Item model number",
                "value": "‎4328509341"
            },
            {
                "name": "Item Weight",
                "value": "80 Grams"
            },
            {
                "name": "Product Dimensions",
                "value": "‎6.9 x 4.5 x 1.1 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎6.9 x 4.5 x 1.1 inches"
            },
            {
                "name": "Color",
                "value": "Green"
            },
            {
                "name": "Manufacturer",
                "value": "‎SoundOriginal Factory"
            },
            {
                "name": "ASIN",
                "value": "‎B074891DJP"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎July 25, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 694 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#367 in Computer Power Supplies"
            },
            {
                "name": "Case Type",
                "value": "Desktop"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "商务"
            },
            {
                "name": "Material",
                "value": "Metal"
            },
            {
                "name": "Light Color",
                "value": "红色"
            },
            {
                "name": "Hard Disk Form Factor",
                "value": "3.5 Inches"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "Fan Count",
                "value": "2"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Desktop PC motherboard power reset switch, momentary switch button, fits most desktop computer host cases with front panel button. More convenience and more easy to power on your PC if it's not located in an easy-to-reach place or your Desktop Computer Case does not work anymore.Simple to install - just check your motherboard's website for a manual on where to connect it, or simply remove the front panel connectors one by one, replacing them with those provided by the switch.With this power switch connected there's no need to go fumbling under desk to turn on PC. Suitable Occasion: Household, Office, Hotel, Internet Bar,etc.The button is great with adhesive sticky pads on the bottom, a hard drive activity light.Suitable Occasion: Household, Office, Hotel, Internet Bar,etc.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/9f617304-4e02-45a9-9ed6-98360cdb6480.__CR0,0,300,650_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/ed1da521-a244-490f-9b29-044022304c6a.__CR0,0,300,650_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Replace your burnt out LEDs and worn out switches with this handy ATX front bezel wire kit. The five-piece kit comes with two switches (Power, Reset) and three LEDs (Power, Hard Drive Activity, Sleep). Each switch and LED is clearly labeled to make installation easy. Make sure your computer still looks and works as great as the day you bought it with this replacement kit. PC ATX Power Reset Switch Cable Design : H.D.D LED, Power LED+, Power LED-, Reset SW, Power SW LED Number : 2,Power LED Color : Blue Cable Length : 160cm / 63\"",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/338d22e1-f266-40bf-8a9d-386015df3b0e.__CR0,0,300,650_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/sc/fca7db45-c51b-4a0a-a22a-693f8a624957.__CR0,0,300,650_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "PC ATX Power Reset Switch Cable;Design : H.D.D LED, Power LED+, Power LED-, Reset SW, Power SW LED Number : 2; Power LED Color : Blue",
                "media_link": []
            },
            {
                "media_text": "Desktop PC motherboard ATX power reset switch cable, red green LED indicator, momentary switch button, fits most desktop computer host cases with front panel button. fits most desktop computer and Office, Internet bar, etc host cases with front panel button.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/656f5d0a-50f9-426d-975f-99dd72fb8d97.__CR0,16,1024,633_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/9f617304-4e02-45a9-9ed6-98360cdb6480.__CR0,0,300,650_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/ed1da521-a244-490f-9b29-044022304c6a.__CR0,0,300,650_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/338d22e1-f266-40bf-8a9d-386015df3b0e.__CR0,0,300,650_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/fca7db45-c51b-4a0a-a22a-693f8a624957.__CR0,0,300,650_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michael MillhouseMichael Millhouse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBBQKD5A4STBQYL2LYVRUXFTVIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VIC537GZ8IA0?ASIN=B074891DJP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Works GREAT, but beware the QC",
                "reviewText": "This little button/LED works GREAT for either a \"remote computer control on your desk\", or as I am using it... a workbench motherboard testing setup.But BEWARE! This was not a big deal for me personally, but I had to immediately take it apart and find out why the \"powerSW\" jumper wasn't working (PC would not come on). Turned out the yellow side of the little pushbutton switch in the middle had come off the switch. It LOOKED connected because of the black shrinkwrap, but had somehow came off inside. Four screws (under the little rubber pads). Five minutes with a multimeter and solder station had it going again.This little thing is MUCH nicer and safer than poking around the mobo with a small screwdriver to do boots and resets. Also nice for seeing the HDD activity if troubleshooting a hard drive problem.The little PCI bracket would be nice if you are using this to put a power/reset button on your desk. This has a blue glowing ring to show power, and a little red LED that shows HDD activity. This one doesn't have the USB or audio connections I have seen on others, so I find it more suitable for a testbench than an actual remote button at a workstation.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71F3rS6yDSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zBiq8DRVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JMay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHACQ5A463DQ2ZPAVG6HRHU2GPPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDOWJ6NOCU130?ASIN=B074891DJP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2020",
                "reviewTitle": "5.0 out of 5 stars If you have a broken power switch, then this is for you!!!",
                "reviewText": "I had built a rackmount Plex Server and had recently upgraded it from an older FX process to a Ryzen 7. It is a tight fit in there with the wiring and I think I may have damaged the power switch some how, or it just began to fail as it is a pretty crappy and cheap switch on a Rosewill 4U case.So that is how I began my search and stumbled across this thing. I saw other options on Amazon with provided a switch and that was about it. I wanted something that could be external as it is rackmounted. This was just as cheap as other options and fit the bill perfectly. Some reviews think this thing is ugly, I don't necessarily agree, but it also comes with double sided tape so you could stick up under a desk if needed. But the quality CANNOT be beat!!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDM3GTGLU527LDCF2R5D2YWVJ5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XJ153J1PWYWL?ASIN=B074891DJP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2020",
                "reviewTitle": "4.0 out of 5 stars Pretty good with a few annoying quirks",
                "reviewText": "UPDATED 9/16/2020 (Update is at the end of the review )Well, I am one of those financially deprived people who has an old PC case that was not super high quality when it was new and eventually the wires for the front panel buttons became broken and my reset button ceased to function. It crossed my mind to take the soldering iron to it but these things are tiny and my eyesight isn't what it used to be and my hands are not steady and these things were never really meant to be repaired anyway so I figured I'd look and see what was available on Amazon to replace a dead (dying) front panel. I knew it would just be a matter of time before the power button also stopped working so I was hoping I could find an all in one solution for it. Luckily, I found this. There are fancier options that have USB ports and front panel audio built in and I was tempted but I haven't had front panel audio or front panel USB since I bought this case (because the wires were bulky and annoying to deal with when cleaning fans and I cut them off). So this seemed perfect and the price was very appealing. When it arrived it was easy enough to install it. At first I had the polarity reversed on the HDD light but the plug is marked for polarity if you look closely. I don't even particularly need an HDD light and don't care much for blinky flashy things anyway. I find them annoying and distracting. Which is why there is nothing that lights up on my computer. It's just a plain black box and that's exactly how I like it. So anyway, the main power led for this is blue so it isn't super annoying. But the whole button lights up and it could be bright and distracting at the right angle. My desk is a bit higher than some so it is at an angle with my eyes that isn't terribly noticeable. I did consider not plugging any of the LEDs in though, TBH. The HDD light is quite a bit more likely to bother some people. It's red and it's large and it's bright and it blinks every time the drive accesses (obviously). Which honestly makes me think I'll end up just unplugging the HDD light and leaving the rest as they are. The main con I have found with this is the cord could be a little longer. They obviously intended for this to be appealing to people who wanted to place their power/reset button at a distance from their PC but it would have been just about perfect for me if the cord was about a foot longer. The problem is that I have a few obstacles in the way and the cord needs to be routed around them and that takes up some of the length. A slightly less bothersome flaw is that the case of this thing is not just plain black. Which would have made it a bit less obnoxious looking sitting on my desk. Instead it is mostly black with large red plastic bumps on the case. One of them has \"Golden Field\" written on it in large black letters. Which none of this was unexpected. You can see all of this in the Amazon pictures. I'm just saying. If it was all black (preferably flat black instead of shiny black) it would have been a better aesthetic. That said, if I actually had a can of black spraypaint, I could fix this easily enough. Another annoying flaw is that the reset button is very small and flush mounted so you cannot press it without really working at it. You almost have to literally pick the thing up and turn it at the right angle and press the reset button with your fingernail. I guess it's to prevent accidental resets but it hinders the functionality of it. If you're the type who actually uses your reset button on a regular basis, this can get a bit tiresome. I might (probably will) superglue some kind of a bump on the top of the button to make it easier to press without fighting with it every single time. The final minor issue I have is the slot cover that you route the cable through in the back of your PC case (while it is nice that it's included and it is a nice, clean way to get the cable out of the case) is bare metal silver, which probably will clash with most PC cases. My PC case is all black and this is the only bare metal silver thing on it so it's a bit ugly. Though I could (I suppose) simply paint it or modify one of my own slot covers to serve the same function and use it instead. Overall, for the money, this is a nice solution for people who just need something that works and doesn't cost a lot and it's great not having to get up to use the power or reset buttons. I would complain a lot more if it costed more. UPDATE - 9/16/2020 One final thing that I feel is worth mentioning on this review is the (perceived) quality of the actual wires inside. While the cable that runs from the button into your case seems relatively thick, the end of the cable where the wires come out to be connected to the motherboard shows that (possibly/likely) they skimped a bit on the quality of these wires. They look (and feel) exceptionally thin, which generally does not tend to bode well for the longevity of any wire. Particularly if it is likely that it was produced to be of minimal quality and maximum profitability, which this probably was (I could be wrong). Anyway, this was what happened with the original power and reset buttons on my NZXT case. The wires they were connected with were also not originally of the best quality (just from the look and feel of them) and over the years, the normal process of handling these wires while taking the PC apart for cleaning and putting it back together took it's toll on them and caused breaks inside. And they obviously had very few strands in there to begin with. That said, the original wires did last about 7 years and I would say I probably moved them around and handled them more than the average person would (most people probably do not clean their PC fans as often as I do). Anyway, these wires on this button will likely not be moved too much because they go straight from the motherboard to the back of the case and out. At least I hope I will not find myself hooking and unhooking them often. Because if I do, I suspect they would not hold up that well. All that said, it is still a nine dollar (US dollars) product so most people will probably be perfectly fine with it if they get a couple of years out of it (I wonder if most people even keep a PC longer than that these days). Honestly, you could not go too far wrong ordering several of these and keeping the backups in case you do have problems with reliability. The overall functionality of the product is that good. And also, I have found that the lights on this unit don't bother me as much as I thought they would and have found the HDD light to be more useful than I expected. I would still say it would be too bright if it was sitting at an angle where it would tend to \"beam\" the light right at you.END UPDATE",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allan Randall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWZDAXVB3ZLJZK6M3C34DESKJNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BC1ONXJ075N9?ASIN=B074891DJP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2018",
                "reviewTitle": "5.0 out of 5 stars Easier Install than Replacing Old Switch in the Case",
                "reviewText": "Power switch arrived in good shape. Glad installing it was quick and easy, because I needed several tries to find the \"sweet spot\" in the old switch that would power the PC. The wire leads on this switch are clearly marked which made it easier to match the right wire to pins on motherboard. Thus, it was easier to install than expected. Placed switch on my desk, immediately under the monitor's power switch. Cable is long enough that I have more options to move it elsewhere. As the switch it self does not become part of the case, I avoided the considerable hassle of removing the case side and front covers, optical drives, and whatever else blocked access to the old switch. My big fingers might not have managed installing a standard replacement switch in the case, as there is very little clearance between the top of the drive bay and the old power switch in the case. I'm very happy with it, indeed!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xavier GreyXavier Grey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEFEC4VJ32HXXSE6EAPYGPLOYGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15SSE3LER90GR?ASIN=B074891DJP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2021",
                "reviewTitle": "5.0 out of 5 stars Well Made",
                "reviewText": "I bought 2 different switches for a conversion of a dell case to an upgraded system. The switch on the case will not work with other motherboards. This switch was ideal. It work perfectly. It has a long cord plus a slot covered with a cut slot so the cord can be anchored and still allows for 2.5 ft (76.2 cm) of reach from the back of the case. Since I am using an mATX board I anchored the internal portion of cord with a zip tie to keep it from resting on the RAM (2666 Mhz gets hot). When the computer is off the light on the switch / button is out, when in standby mode it blinks slowly, the button changes color and blinks with a changing tempo to give an indication of how much your system is being taxed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71oFOuIZ+VL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81ViAE3nWZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Arnold",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5HNE2ZYZM65BHTULDOER33JN6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DBIREDS27YAO?ASIN=B074891DJP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2021",
                "reviewTitle": "5.0 out of 5 stars Works well",
                "reviewText": "I have a great Centurion case but was considering getting rid of it on my next build because of the broken plastic container housing the power switch assembly. The switch is functional and quite attractive with the led lights. It anchors through a case slot for pci cards and hooks up in such a way you will not pull the wires out. You might want to be sure you have a slot which you can use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "coolspot",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 15, 2020",
                "reviewTitle": "Works Great!",
                "reviewText": "After after 8 months, this this works great... I'm using it in arcade cabinet to power on a PC that is located at the bottom of the cabinet easily.I wish the cable were longer, but it'll do.Quality is good.If the button is exposed (i.e. not in a cabinet like mine), the LED maybe distracting - it's pretty bright, just disconnect the HDD light if that is an issue.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stu S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2020",
                "reviewTitle": "exactly as described",
                "reviewText": "works like a charm. knowing the pins on your motherboard is helpful, My case originally used a plug that did all of the switches at once so I had a bit of guess work to get all of the functions working but that is not the fault of the button...all the wires attached are clearly labelled and easy to work with. Would buy again without thinking twice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "blammo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 30, 2020",
                "reviewTitle": "A good solution for my arcade cabinet",
                "reviewText": "Works pretty good for a remote switch.+1 for being solidly built+1 bright led for power on.+1 cable is long enough for most application.+1 the connectors are well labeled.+1 for coming with an adapter plate to hold the cable the (not for SFF application though)+1 for including 2x tape for mounting.-1 for not having a quick connect for when you need to do some maintenance on the PC.-1 for not having the cable come from underneath the button rather than on the side for flush mount applications",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2021",
                "reviewTitle": "Exactly as describes and arrived quick!",
                "reviewText": "Great little button, my case button broke and this was a replacement before it retires instead of doing a full case swap.The button is sturdy and has a blue LED light. It has a metal bracket for the back panel of your case so you can securely mount the cord to the case without fear of pulling the cord or anything out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2022",
                "reviewTitle": "Does what it’s supposed to.",
                "reviewText": "The media could not be loaded. Does what it’s supposed to. Each lead on the switch tells you where it goes. If you have the pin assignments for your motherboard it’s easy enough to do. Pins for Dell XPS 8300.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711lPVFrPgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/511WB9k6bSL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/C1DEMLl7OvL.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}