{
    "remaining_requests": 42449,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Raidmax-Hybrid-ATX12V-EPS12V-RX-730SS/dp/B0055EIIXW",
    "body": {
        "name": "Raidmax Hybrid 2 RX-730SS 730W PC Power Supply SLI Crossfire Ready ATX12V V2.2 / EPS12V Modular Power Supply PC PSU Computer Power Supply Gaming",
        "price": "$54.99",
        "originalPrice": "$54.99",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Raidmax-Hybrid-ATX12V-EPS12V-RX-730SS/dp/B0055EIIXW",
        "soldBy": {
            "sellerID": "A3NIDMGMVJS8PZ",
            "name": "NOVA SHOP",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3NIDMGMVJS8PZ&asin=B0055EIIXW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQ2N743T"
        ],
        "asinVariationValues": [
            {
                "asin": "B000TYN2PC",
                "variationName": "Size",
                "variationValue": "",
                "price": "$44.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41PncRDomJL._SS36_.jpg"
            },
            {
                "asin": "B0055EIIXW",
                "variationName": "Size",
                "variationValue": "",
                "price": "$54.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51TwVE3wo3L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "17",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51TwVE3wo3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51vCuNLjcuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pgJzJAVUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411R M-sy0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51x6X1iyhWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OclZR26-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4196yKn84UL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Raidmax Store",
            "link": "https://www.amazon.com/stores/Raidmax/page/56D6DE7E-E5D7-4A2E-B02F-D534B91733C1?ref_=ast_bln"
        },
        "brand": "Raidmax",
        "merchantInfo": "Sold by NOVA SHOP and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 331,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "FREE delivery February 24 - March 1",
            "Or fastest delivery February 24 - 27"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Large 135mm Silent LED Fan - Our 730W power supply PC has a large 135mm blue LED fan which provides excellent cooling performance and a cool blue glow. This ensures good heat dissipation while keeping the power supply quiet and reliable.",
            "Stable & Reliable - Dual 12V output circuits provide added system stability, ensuring reliability and longevity, even during heavy use. This means you can rely on your PC to perform at its best without any hiccups or crashes.",
            "Durable and Sleek - The high-grade black mesh-wrapped cabling and durable black stain finish not only give your PC a sleek and professional look, but also protect your cables from damage.",
            "Maximum Airflow - The computer power supply Hexflo honeycomb cutouts allow for maximum airflow, ensuring that your system stays cool even during intense gaming or video editing sessions.",
            "Modular PSU Design - The power supply modular cable design provides easy installation to customize your cable setup to your specific needs, minimizing clutter and making cable management a breeze."
        ],
        "description": "Raidmax Hybrid RX-730SS 730W ATX12V/ EPS12V Power Supply",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17923671011"
            },
            {
                "name": "Internal Power Supplies",
                "link": "https://www.amazon.com/Power-Supplies-Computer-Accessories/b?ie=UTF8&node=1161760"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.2 x 5.9 x 3.4 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.2 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Raidmax"
            },
            {
                "name": "ASIN",
                "value": "B0055EIIXW"
            },
            {
                "name": "Item model number",
                "value": "RX-730SS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 331 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#993 in Computer Power Supplies"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "April 8, 2011"
            },
            {
                "name": "Model Name",
                "value": "hybrid"
            },
            {
                "name": "Brand",
                "value": "Raidmax"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "Connector Type",
                "value": "Floppy, Molex, SATA"
            },
            {
                "name": "Output Wattage",
                "value": "730 Watts"
            },
            {
                "name": "Form Factor",
                "value": "Micro ATX"
            },
            {
                "name": "Wattage",
                "value": "730 watts"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.2 x 5.9 x 3.4 inches"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jon Kerr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5L55GIYPDROVZEJFVAGYSYSVIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VO8GTUUNW6X6?ASIN=B0055EIIXW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2012",
                "reviewTitle": "5.0 out of 5 stars Good Value",
                "reviewText": "I know there are a lot of bad reviews on this product, mainly stating it is a re-badged 500 watt no name supply. I disagree. We use it to power a Dual Xeon X5150 server with 6 300 GB Ultra320 SCSI Hard Drives, and when I check the power levels, even with a multi-meter, they are fine. Just to run the processors, a 500 watt supply is a minimum, and then 6 SCSI hard drives... This is a performer. Granted, a blue light is not really a requirement for a server, but it looks nice in its modified full tower case, and there's a button to turn it off.Hybrid simply means the motherboard power cord is NOT modular. There are plenty of extra cables for SATA and 6 and 8 pin video card connectors. The EPS12V connector is a 4+4, and worked fine for our needs. If you need a second EPS12V connector, simply buy it separate and connect it to a molex connector like we did. The main 20+4 connector was plenty long enough to reach from a bottom mount PSU to the top of a EEB (basically an E-ATX) motherboard and had enough slack to feel safe.I will be buying a few more, as we recently got awarded a contract and need to build 17 more servers.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7AR6TY2J23DCSZW4LDXSBNB4BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H8Z7SZFCAYG9?ASIN=B0055EIIXW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Raidmax Hybrid 2 RX-730SS 730W PC Power Supply",
                "reviewText": "ok so this Raidmax company deserve a review. i bought a Raidmax power supply 530W almost 10 years ago (2014), up until now it still work perfectly. Recently i decided new mother board, new CPU, and i also wanted a new power supply. After a thoroughly research just to found out that a new power supply now a day is over $100, i decided to give Raidmax another chance and bought the Raidmax Hybrid 730W. There is no regret. Beside the main power, everything else are modular. it works the way it supposed to be, fan runs with no noise. Dont know how much power have left, but i have one hard drive, one DVD drive, 3 RGB fans, and an old video card. enought said, being un-brand name does not mean that they are not good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vaporizer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHO5KTLBKSBUDMCX2TRTKHAGGGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DU5KMHNXY5RH?ASIN=B0055EIIXW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2013",
                "reviewTitle": "4.0 out of 5 stars Problem with 5v rail after a year...out of warranty now...but maybe...",
                "reviewText": "READ This First!!!!!!UPDATE AGAIN (July 25 2014): The 5v rail is starting to fail. The 5v voltage has dropped to about 4.7v causing problems with DVD internal writer NOT reading and writing dvds. I took me a while to figure this out!!! The only way to get the voltage back up was to disconnect some devices internally such as a couple of RAID hard drives and VOILA the dvd writer started functioning properly again!!!...and no, it is not the dvd writer, as I have tried 3 of them with the same results. I will have to replace this PSU and it has only a 1 year Warranty and so I am screwed unless Raidmax makes an exception. What do you know as I mentioned below it takes time for some defects to appear and the day has come. Sadly I shall NOT be buying this brand ever again if Raidmax blows me off. Get it together Raidmax, I had to disconnect my RAID HD's (two HD's)..Ironic isn't it? Some raid-max...Bah! SO FAR AFTER THIS message Raidmax has NOT blown me off....Maybe all is right with the world...I talked to Raidmax tech support and he extended my warranty and told me simply to send Amazon invoice to rma@raidmax.com...We shall see if indeed they send me another...Of course i have to pay shipping to them and he recommended USPS which he thinks will cost me about 10 dollars...Thankyou all for reading this.In the past I had this to say:It is quiet. It has a cool blue color which you can turn off. It worked right away (I tested it first with a Fluke digital multimeter) and my system is very stable. It is not blowing out warm air which is good. The only reason I did not LOVE it or give it 5 stars is that the 12v rail read 12.67v to 12.74v either in the BIOS or with monitoring software in windows. However with my trusty voltmeter the reading was lower and within spec. Usually the voltage is around 12.1 or 12.2. Tolerance is supposed to be 5%. I am NOT really worried about it because the motherboard has its own voltage regulator onboard as all decent motherboards do. My system is an I5 unlocked processor overclocked from 2.8 to 3.3 GHz. I have 2 gigs of dual channel ddr3 memory (2 sticks 1gig each) and ONE video card, the NVidia GeForce GTS 250. The MOBO is the Gigabyte P55A-UD4P. I have 2 small 150GB SATA 1 in Raid array 0, therefore double in capacity and seen as one 300 Gig HD. I have one DVD writer and finally Windows 7 Ultimate 32 bit. I play WOW religiously with no issues. No blue screens and no problems of any kind with this power supply and 530W is all I need. I recommend it for medium systems. If you have a kick ass system get 650W or more PSU's.UPDATE: The psu fan is starting to get noisy when it warms up, and I have used this computer very little. The fan has a sort of whining sound, not too loud, but loud enough to be annoying...The power supply still does NOT appear to be getting hot (not used for gaming at this time) and it is now January 2014 and it still functions so that's good!!! It doesn't seem to matter WHO you buy from as I had a flagship modular 750 Corsair PSU go south after 2 years. It all boils down to good capacitors and semiconductors such as diodes and voltage regulator ic's, amount of current draw, overload protection and no cold solder joints for any power supply to last. Sometimes defects takes years to surface so its hard to say how reliable any power supply will last. I have seen PSU's last for many years as long as its not overloaded and the fan does not fail. So, so far so good with this one except for the whining fan lol.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BlackLotus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXZZIUW2BYYJJVWRNUFKZTLQCCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14NJHFIUZLL2K?ASIN=B0055EIIXW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2013",
                "reviewTitle": "5.0 out of 5 stars Great PSU",
                "reviewText": "This PSU is great for any typical build. I am very pleased with it and it powers my computer quite well. I haven't had any issues with it. It supplies the power I need and everything works as it should.It's not too heavy nor is it light - the right heft I'd say for this wattage and such. It's a good black - some PSU's are more gray or such - who knows why. I didn't do any electrical testing on it - others have so I'll trust this delivers what it says. None of my components are fried. It does have a blue light but yes you can turn it off. I was initially going to leave it off, but my case has a blue LED fan on the front that is a huge pain to remove so I just left it. I also let this glow blue - might as well go big with blue shining out my case from all directions!The semi-modular design - I think this is wonderful. I'll address this since people seem to complain about it. Yes, the CPU and mobo cables aren't detachable. Honestly how does this matter with your cabling? You HAVE to use those for any computer I've ever built, so they will always be present. The second thing is the cables plug into a bundle of cables coming out - and not into the PSU housing itself. Once again - who cares? I think it's easier this way - you can move around a bit more and it has a retaining clip to keep them all neat anyhow. Go spend double or triple if you really need the fully modular design.The only complaint is the fact the black cable sleeving is chintzy and mine pulled down some on certain cables. Not a huge deal, I can put them back pretty snug for a pretty clean look.Overall though this PSU delivers the power I need, adds some nice flair to my build, and provides me the cabling options I need to keep my build well vented.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Tough Customerson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGZ6P2YDISOXVAOQP3KP2RFJJYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM11RM2ZEMQZ3?ASIN=B0055EIIXW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars So far so good! However not COMPLETELY modular! The description made me think otherwise...",
                "reviewText": "So far so good! However not COMPLETELY modular! The description made me think otherwise... however I can look past this since it seems to be working good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fiction Fan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 7, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Excellent!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kieseyhow",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 1, 2012",
                "reviewTitle": "Raidmax Hybrid RX-530SS 530W PSU; powerful, quiet, efficient, excellent finish quality.",
                "reviewText": "Excellent choice for the workstation and high-end business system. These save power for the business and media server systems as the PSU is not too powerful and thus wastes energy. I found the finish more than adequate for clear case and modified systems. The modular design is more than adequate and the cooling design is exceptional and almost completely silent, thus an excellent choice for media servers. I have already bought more than one for my customers and they are very satisfied. I chose this PSU after careful research and weighing the performance, capabilities, and price for what I needed. I have to say for where I used it, I find it necessary to rate it with FIVE STARS.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tyler",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 26, 2018",
                "reviewTitle": "Five Stars",
                "reviewText": "Was nervous but needed it for a budget build. Has worked very well!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$57.99",
                "sellerName": "Raidmax Tech",
                "sellerRating": "4.5"
            }
        ]
    }
}