{
    "remaining_requests": 42401,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Apevia-ATX-PR600W-Prestige-Certified-Compliance/dp/B07NWZQX1J",
    "body": {
        "name": "Apevia ATX-PR600W Prestige 600W 80+ Gold Certified, RoHS Compliance, Active PFC ATX Gaming Power Supply",
        "price": "$51.99",
        "originalPrice": "",
        "rawPrice": 51.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Apevia-ATX-PR600W-Prestige-Certified-Compliance/dp/B07NWZQX1J",
        "soldBy": {
            "sellerID": "AEHA1AAWZIC3L",
            "name": "Apevia",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AEHA1AAWZIC3L&asin=B07NWZQX1J&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415DzqgyM9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41K2I4-0WmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tcPu4vY L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xMEFSsn8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ps0X6yrQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yYQkpoISL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Apevia Store",
            "link": "https://www.amazon.com/stores/APEVIA/page/F16AED52-6375-40EF-B734-2D2B425F0378?ref_=ast_bln"
        },
        "brand": "APEVIA",
        "merchantInfo": "Apevia",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1165,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Supports Dual/Quad/multi-core CPUs. Supports single 12V output for higher power usage",
            "Dc to DC converter design, provides superior dynamic response, greater system stability and maximizes the 12V DC rail output",
            "Multi-gpu technologies supported; 6 pin and 8 pin PCI-E connectors support all GPU platforms. Built in 1 x auto-thermally controlled black 135mm fan",
            "Connectors: 1 x 20/24pin main power, 1 x 4/8pin 12V, 2 x PCI 6+2pin, 4 x SATA, 4 x peripheral. All protections",
            "Apevia ATX-PR600W Prestige 600W 80+ Gold Certified, RoHS Compliance, Active PFC ATX Gaming Power Supply, 3 Year Warranty"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17923671011"
            },
            {
                "name": "Internal Power Supplies",
                "link": "https://www.amazon.com/Power-Supplies-Computer-Accessories/b?ie=UTF8&node=1161760"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Apevia"
            },
            {
                "name": "Series",
                "value": "‎prestige"
            },
            {
                "name": "Item model number",
                "value": "‎ATX-RP600W"
            },
            {
                "name": "Item Weight",
                "value": "4.5 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎6.2 x 5.9 x 3.4 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "6.2 x 5.9 x 3.4 inches"
            },
            {
                "name": "Manufacturer",
                "value": "‎Apevia Corp"
            },
            {
                "name": "ASIN",
                "value": "‎B07NWZQX1J"
            },
            {
                "name": "Date First Available",
                "value": "‎February 19, 2019"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,165 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#57 in Computer Power Supplies"
            },
            {
                "name": "Model Name",
                "value": "prestige"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "Connector Type",
                "value": "atx,pci,pci-e,sata"
            },
            {
                "name": "Output Wattage",
                "value": "600 Watts"
            },
            {
                "name": "Form Factor",
                "value": "ATX"
            },
            {
                "name": "Wattage",
                "value": "600 watts"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Apevia’s Prestige line of power supplies brings great power and efficiency to your computer system. 80+ Gold certified, and designed for elegant form and function, they bring it to life. Supporting the 12v2.3 standard and single rail setup, it’s updated for modern platforms. Boasting a 135mm silent black fan, it keeps everything inside cool. The Prestige line also uses Active PFC, with a 99% factor correction, boosting performance and saving energy. No toggle switch included, the power supply automatically switches between 110V and 230V depending on the power grid its attached to. ROHS certified. 600W Power with 13.5cm black fan80+ Gold & ROHS certifiedHigh stability with 5% tolerance of 5V, 3.3V & 12V outputHigh quality components and housingUniversal AC input by active PFC (99%PF Typical)Package contentsHeavy-duty protections, including OVP (Over Voltage Protection), OPP (Over Power Protection), SCP (Short Circuit Protection) ‍IMPORTANT: The power supply will not power on simply by connecting the power cord to both the power supply and wall outlet. Ensure that all the power supply cables are properly connected to the PC for it to power on. IMPORTANT: The 8pin CPU connector can be split apart to become a 4+4 connector by pushing one end of the 4pin down and the other end of the 4pin up for motherboards that require a 4pin power connector. IMPORTANT: The 8pin PCI-E GPU connector can be split apart to become a 6+2 connector by pushing one end of the 6pin down and the other end of the 2pin up for graphics cards that require a 6pin power connector. IMPORTANT: The 24pin motherboard connector can be split apart to become a 20+4 connector by pushing one end of the 20pin down and the other end of the 4pin up for motherboards that require a 20pin power connector",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/900a845a-f81a-46e4-bb20-fb20659de6bb.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/45e1ea00-a888-41c9-821a-182983e38913.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/900a845a-f81a-46e4-bb20-fb20659de6bb.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13c52adb-0a32-496e-95f2-8566a9dc82a6.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b1f68488-043d-42a9-8bc9-a72da53bb62b.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c9c62db-82dc-43fc-9bcb-5f0a5a976a18.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1b9ceeb-2697-4f9e-ad12-9a663579551f.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bryce Fullerton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPQRXIE7W6ODX3IUZDGFF3AIZIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19M9O9RPWH3IL?ASIN=B07NWZQX1J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Runs perfect!",
                "reviewText": "Im fairly new to building pc’s and this power supply was perfect for what I need at a decent price! It runs pretty quiet and is very easy to install! No problems have seemed to arise and it runs just fine!I would definitely recommend this power supply!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VanceVance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYP6BBVBVVZQ6UZYZRXEWNWRQAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J87B2GTSAFZE?ASIN=B07NWZQX1J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great power for first build",
                "reviewText": "The Apevia ATX-PR600W Prestige 600W power supply is a game-changer for my gaming setup, especially considering my compact mini case. Its 80+ Gold certification ensures energy efficiency, a crucial factor for a smaller build where every watt counts. This not only reduces electricity costs but also minimizes heat output, contributing to a cooler and more stable system.The Active Power Factor Correction (PFC) is a standout feature, delivering enhanced efficiency and stability even in the limited space of a mini case. It's reassuring to know that my components are receiving a consistent and clean power supply, crucial for the demanding requirements of gaming.Installation was a breeze, and the modular design played a significant role in managing cables effectively within the confines of a mini case. The compact size of the power supply itself is a perfect fit, ensuring it doesn't encroach on valuable space or impede airflow.During extensive gaming sessions, the Apevia Prestige 600W maintained a quiet operation, efficiently dissipating heat without causing any disturbances. The build quality is impressive, instilling confidence in its ability to handle the rigors of gaming, even in a compact setup.Overall, the Apevia ATX-PR600W is not just a powerhouse but a perfect fit for those with mini cases. It seamlessly combines power, efficiency, and compact design, making it an ideal choice for gamers looking to maximize performance without compromising on space. This power supply has undoubtedly elevated my gaming experience in a smaller form factor.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719ojfZ6d-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71gJ8X5E7yL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHOHM7QLFVYXVB4EFSBCXKQGNFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E9Q4U2CLWLNL?ASIN=B07NWZQX1J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Cheap budget C tier rated PSU.",
                "reviewText": "Works great for the price, I hate all the extra unneeded cables, but didn’t want to pay the price for fully modular. Amazing product for the price point, best price to performance for a 600watt gem.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joshua OuztsJoshua Ouzts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC5WPEGXKQ5GWKG2GV7JWB5EWEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V7V2GDO4EE6I?ASIN=B07NWZQX1J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 29, 2020",
                "reviewTitle": "4.0 out of 5 stars Ordered, Arrived, Installed, Working as intended.",
                "reviewText": "Included photo is PSU, atop my system, half way through install during a small break to google how to run the wires properly through my case to maximize airflow, if such a thing even existed.I'm a relative noob when it comes to building pc's and what not, so having an important part like this go out on my second pc had me pretty scared to screw around with it. This fit my price range, and had that gold certification on it unlike a bunch of others i had looked at, so i went ahead and bought it. It came, and i dropped it into my system without issue, and had no problems booting right up and resuming use. There are way too many wires for my build, so all of that extra was moderately difficult to find a place for inside my moderately small case, but with some careful thought, and creative use of a few of the holes intended for running cable anyway, coupled with some double twisted Floral wire used to stiffen and support some of the longer, more intrusive extra cables i managed to make it all fit inside safely, albeit it's not very pretty. My case is mostly closed off anyway, excluding some breathing holes on one side so that's not important to me anyway. The sound it puts out is on par if not more quiet than the previous 500w EVGA - br i had in it, so that's pretty nice. I don't know enough nor have the proper tools to check wether or not its outputting what it claims on the box, so i can't vouch for that aspect, but So far, after 3 days of constant use, and all that, Everything seems to be working as intended.I procrastinated and compared power supplies for 2 weeks because i don't know jack about how to choose one that's not a scam or a piece of shizzle that'll arrive busted, or end up burnt out or broken after a week, so ordering this one was an excercise in fear and doubt. All those industry specific words in the listing mean nothing to me, and the only thing i knew coming into this buy was that anything with the word gaming in the title is usually overpriced simply because they tacked that word on at the end. There's no such thing as a 'Gaming' anything. All tech -can- be used for gaming, and nothing is built with only gaming in mind as its intended use. It's a sales tactic. That being said, This Gaming power supply was not overpriced when compared to similar units, the quality of it is on par with everything else i compared to that wasn't obviously a cheap piece of crap, and it even came with an instruction booklet that wasn't written in broken english that included data sheets, and charts listing all of the statistics affiliated with this power supply. (The last one i bought for a different build was english, but was unreadable and had no information at all aside from what was on the box/sticker besides our power supply strong. you make big play, have many fun etc)I tried to make this review as friendly as possible to those people like me that have little clue how to choose a power supply when theirs stops working, and they skip googling for info and ideas, and head straight to amazon on a mission to fix their machine and get everything back up and running.Tl;Dr- Worth it. Would reccomend. Solid performance, easy to install, Quality wiring, Quiet fan, A little too much extra wire length, but not so much that it's unmanagable, works as advertised, and provides stats within booklet for those that would care to have them. 7/10. i withheld 1 point because nothing is perfect, and another 2 points because it was mailed to me as just a power supply shelf box with shipping information labels attatched, and was not taped shut or protected in any way from the elements aside from the discretion of UPS. (i guess im fortunate that my UPS guy was having a good day, and chose to be gentle with my delivery.)",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71VmQ2MRwmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Warren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT6TJXYFKZ6CBI365XBSL2AGEZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VRJ4CU3S49Z5?ASIN=B07NWZQX1J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2020",
                "reviewTitle": "5.0 out of 5 stars Seems to be a great PSU",
                "reviewText": "No issues at all with this power supply. I'm not stressing it by any stretch of the imagination, having used it on a B550/Ryzen 5 3400G system (integrated graphics.) But the owner of this system will likely purchase a discreet GPU down the road, so the extra wattage is nice to have.I've got good hearing and I can't hear it at all when the system is running, even when doing a stress test for extended periods. It's quiet, stays cool, and at 80 GOLD rating should be good and efficient. That's about all I can ask for in a power supply.Some Googling suggest this unit is made by Andyson. The shape of the fan grill on Andyson PSUs is unique, and this is the same as other Andyson PSUs, so I have every reason to believe this is made by them. But PSU manufacturer isn't everything as they generally build to whatever the customer specifies. That said, I haven't witnessed anything that would lead me to believe they cheaped out on this unit.Certainly not the best power supply out there (it does feel a bit lightweight), but very well might be the best one out there for the price at the time I'm writing this.Some people gripe about the colored wires (often described as ketchup/mustard,) I actually prefer them because I can tell at a glance which wire is which. For example when troubleshooting PCs or power supplies, I often jump the PSU turn on wire to get the PSU to start without a motherboard attached. Without color coding, it'd be near impossible to find that wire (it's green) on a 24-pin connector without the hassle of Googling a diagram. To each their own, but I think the sleeved cables on this unit are pretty awesome and high quality.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ron wall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE62ORLUE4JVKFW5PZLHHGKAN4XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CON4XWUL3ZII?ASIN=B07NWZQX1J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Good product",
                "reviewText": "Exact match and works great. Its a great power supply and isnt expensive",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan A Ramirez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5GIPEELUFN2YH2PQIEEVFXMA7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSXMLQARC9JY4?ASIN=B07NWZQX1J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Worked as described!",
                "reviewText": "My PSU popped and needed a replacement. So far so good! 2 weeks in after installing this one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruce M. Walker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 30, 2023",
                "reviewTitle": "An excellent supply with great components - quietly handles the load",
                "reviewText": "I bought this originally to use as an external GPU power source to use with a refurb OptiPlex build but when that turned out to have a bad mobo I re-used the supply in a build from the ground up with all new parts. This went into a budget CoolerMaster case. I'm driving a Gigabyte B550M DS3H AC mobo with a Ryzen 5 5600, and a Radeon RX 6650 XT GPU.The supply powers this stuff with ease and the fan is generally whisper quiet. Under heavy load it blows more heat of course but keeps on running rock solid.I like the PSU's braided cable covers and the general quality of all connectors, cables and components.I have no complaints.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hannoc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2024",
                "reviewTitle": "Not reliable, random shutdowns",
                "reviewText": "I must have got a faulty unit as this PSU isn't reliable, power shuts off seemingly at random. My PC is a new build and 600w well exceeds my powers need, after days bench tests and troubleshooting the only solution to my random shutdown problem was to swap out the PSU. I will be returning it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$60.40",
                "sellerName": "Triplenet Pricing INC",
                "sellerRating": "4"
            },
            {
                "price": "$66.29",
                "sellerName": "VirVentures",
                "sellerRating": "4.5"
            },
            {
                "price": "$67.41",
                "sellerName": "Hot Deals 4 Less®",
                "sellerRating": "4.5"
            }
        ]
    }
}