{
    "remaining_requests": 11514,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Medela-Breast-Nipples-Collars-without/dp/B001V9EVCM",
    "body": {
        "name": "Medela Medium Flow Feeding & Storage Bottles, 3 Pack of 8 Ounce Bottle with Nipple, Lids, Wide Base Collars, and Travel Caps, Made Without BPA",
        "price": "$15.32",
        "originalPrice": "$23.79",
        "rawPrice": 15.32,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Medela-Breast-Nipples-Collars-without/dp/B001V9EVCM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "45",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41gnDHQKSJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61r2mH1FH9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61UjqZTqSJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CsSooHdgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PtO K3DWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QdSGcbXlL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Medela Store",
            "link": "https://www.amazon.com/stores/Medela/page/F8C01666-6E5D-4C31-BF3F-9F6B06D26829?ref_=ast_bln"
        },
        "brand": "Medela",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 9040,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 20 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "COMPATIBILITY: Can be used as a milk storage bottle.",
            "CUSTOMIZED FLOW OPTIONS: Each bottle comes with a silicone nipple. Available in two different sizes: 5oz / 150ml with Slow (S) flow or 8oz / 250ml with Medium (M) flow. Spare nipples can be purchased separately.",
            "VERSATILE CAPS FOR LEAK-PROOF STORAGE: Included disc and collar caps transform this bottle into a storage device, ensuring leak-proof storage in the fridge.",
            "CLEANING AND SANITIZING: The nipple and the bottle can be cleaned in the dishwasher (top rack only) and sanitized with our Quick Clean Micro-Steam Bag.",
            "Includes (3) each of bottles, wide based medium-flow nipples, collars, solid lids and caps.",
            "MADE WITHOUT BPA: Our feeding bottles are made without harmful BPA and are shatterproof for the highest safety."
        ],
        "description": "Medela’s feeding bottles with teats are compatible with our traditional pumps. These bottles and teats are dishwasher safe and can be sanitized with our Quick Clean Micro-Steam Bags. They also include screw-on lids that are leak-proof for safe storage, travel, and freezing. All our products are made without BPA.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Feeding",
                "link": "https://www.amazon.com/baby-feeding-highchair-bottle-bibs/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166777011"
            },
            {
                "name": "Bottle-Feeding",
                "link": "https://www.amazon.com/Bottle-Feeding/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166779011"
            },
            {
                "name": "Bottles",
                "link": "https://www.amazon.com/Baby-Bottles/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎2.76 x 8.58 x 9.06 inches"
            },
            {
                "name": "Item model number",
                "value": "‎87132"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Target gender",
                "value": "‎Unisex"
            },
            {
                "name": "Minimum weight recommendation",
                "value": "‎1 Pounds"
            },
            {
                "name": "Maximum weight recommendation",
                "value": "‎96 Pounds"
            },
            {
                "name": "Material Type",
                "value": "‎BPA Free"
            },
            {
                "name": "Material free",
                "value": "‎BPA Free"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Style",
                "value": "‎Set 2"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Dishwasher safe",
                "value": "‎No"
            },
            {
                "name": "Bottle nipple type",
                "value": "‎Medium Flow Nipple"
            },
            {
                "name": "Bottle type",
                "value": "‎Standard Bottle"
            },
            {
                "name": "Is portable",
                "value": "‎No"
            },
            {
                "name": "Item Weight",
                "value": "204 Grams"
            },
            {
                "name": "Country/Region of origin",
                "value": "‎China"
            },
            {
                "name": "ASIN",
                "value": "B001V9EVCM"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 9,040 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,410 in Baby (See Top 100 in Baby) #41 in Baby Bottles"
            },
            {
                "name": "Brand",
                "value": "Medela"
            },
            {
                "name": "Color",
                "value": "Translucent"
            },
            {
                "name": "Material Type Free",
                "value": "BPA Free"
            },
            {
                "name": "Bottle Nipple Type",
                "value": "Medium Flow Nipple"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Karina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM6CUOSKYAKNOXPLHRRZ6SGOVHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NOHVATG9KRYA?ASIN=B001V9EVCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "5.0 out of 5 stars A Reliable Companion for Busy Moms: Medela 8 oz Baby Bottle",
                "reviewText": "As a mother of 3, I've embarked on a journey filled with choices, and one of the most crucial decisions I've made is choosing the right baby bottle for my little one. After extensive research and recommendations from fellow moms, I decided to go with the Medela 8 oz baby bottle, and I must say, it has been a wise choice.Design and ErgonomicsThe first thing that struck me about the Medela 8 oz baby bottle was its thoughtful design. It's not just a bottle; it's a complete feeding system. The bottle is ergonomically shaped, making it easy to hold and feed my baby comfortably. The wide base ensures stability, reducing the chances of accidental spills, which is a lifesaver during those late-night feedings when you're half-asleep.Materials and SafetySafety is paramount when it comes to baby products, and the Medela bottle doesn't disappoint. It's made from BPA-free materials, assuring me that my baby is not exposed to harmful chemicals. The bottle's clear plastic makes it easy to monitor the milk's temperature and check for any residue, ensuring a clean and hygienic feeding experience.Ease of UseThe Medela 8 oz bottle features a hassle-free assembly and disassembly process. The wide neck of the bottle makes it easy to pour breast milk or formula without spilling a drop. It's also compatible with Medela breast pumps, which simplifies the pumping and feeding process, making it a seamless experience for both mom and baby.Anti-Colic FeaturesOne of the standout features of this bottle is its anti-colic venting system. My baby is prone to gas and colic, but I noticed a significant reduction in discomfort and fussiness after switching to the Medela bottle. The venting system allows for a consistent flow of milk, preventing air from entering the nipple and causing gas.Cleaning and MaintenanceKeeping the bottle clean is a breeze. It's dishwasher-safe, and the simple design means no tiny parts to scrub. This is a huge plus for busy moms like me who don't have the luxury of spending hours on bottle maintenance.Value for MoneyWhile the Medela baby bottle is not the cheapest option on the market, the peace of mind it provides in terms of safety, convenience, and reduced colic is well worth the investment. It's a product that will last through multiple feedings and babies, making it a good long-term investment.ConclusionIn summary, the Medela baby bottle has been a dependable companion on my journey through motherhood. Its thoughtful design, safety features, ease of use, and anti-colic properties make it a top-notch choice for feeding your little one. While it may be slightly pricier than some alternatives, the peace of mind and convenience it offers are well worth the investment. If you're a busy mom looking for a reliable and safe baby bottle, the Medela bottle should be at the top of your list.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LECLERC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG66MK2SPLJNSIJ4C7Y4UZC3BOXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26T42NELXHDM2?ASIN=B001V9EVCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2019",
                "reviewTitle": "5.0 out of 5 stars A Must Have For Nursing Babies!",
                "reviewText": "My baby nursed for several months but eventually I had to go back to work, which meant that I had to pump breast milk for her. I tried several bottles but she refused all of them except for these ones. I don’t know what it is that she didn’t like about the others but she took to medela nipples with no problem.We’ve used them for several months now and they’ve hold up well. The size is perfect and the flow is too. At the beginning I had problems where the nipples would collapse when she starts sucking but I fixed that by loosening the cap a little bit- it lets a bit of air through, which fixes the problem. Once I’m done pumping, I put it in the bottle and put it in fringe. When it comes meal time, I simply take it out, attach the nipple and feed it to the baby. Ive even brought it with me to the movie theatres!Be aware though that they can leak sometimes if the collar isn’t screwed on tightly enough. Other than that though, they work great. They’re easy to clean too, I usually put them on the top rack of my dishwasher. The heat can cause the plastic to get cloudy over time, though so I try to wash it by hand whenever I can. A little bit of dish soap and hot water is all you need. A bottle brush cleaner is optional but highly recommended if you want to clean it more quickly and easily.To summarize, these bottles are convenient. I like them. In fact, we ended up getting another set for storage purposes so that we could switch between the different ones. You can find these at Target but they’re cheaper on Amazon - $12.85 for a pack of 3 (they go on sale sometimes).",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJOFOXMF5DLSY2QLTQJQGWERCJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QC460RJYZ98X?ASIN=B001V9EVCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Basic and effective",
                "reviewText": "These do the job. They’re sturdy and easy to clean",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGCTHHC2GAS7TOU266X7GUGIUHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R43Q6QYJ84VGD?ASIN=B001V9EVCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars The best product on the market!",
                "reviewText": "We will forever and ever use Medela. Our kids absolutely love their bubbas. Recommend for all breast fed babies.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chanté RayChanté Ray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKETSNBGW7CSH3LEKQ3XX4YT7JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3J73TQ2EBGCPD?ASIN=B001V9EVCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Great size",
                "reviewText": "I was looking for larger bottles to accommodate my milk while pumping. These bottles are perfect to collect all my milk at once so I don’t have to stop mid-session and switch bottles (which often times compromises my flow) because I produce more than 5 ounces on each side during one session.They are easy to clean. I like that they come with their own nipples and caps as well. So you could actually go straight from pump to baby just by attaching the nipple. No more losing milk as you transfer because we all know that every drop counts.Genuine Medela bottles for any Medela pumps perfectly; hand pumps and electric.My only negative is that they are a little wider than the standard 5oz Medela bottles so they don’t fit it the bottle stands easily. You have to give them a good push and I worry that the bottles might pop out causing my milk to spill. So I don’t use the stands much with these because I WILL cry over spilled milk!I am thinking about buying another set for when I go back to work and to keep in my diaper bag with my hand pump as well.Definitely recommend! If you are considering these and are pumping exclusively, they are a MUST BUY!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714uGk1Q62L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Huan Li",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMT2UAIK5D4GHWVINK2RFA5ERJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HYVBNBXBOB8?ASIN=B001V9EVCM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "4.0 out of 5 stars Medela",
                "reviewText": "I love Medela bottles! I can feed my little one right after pumping or store them without having to switch bottles. However the package I received this time doesn’t come with the lid at all…",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtney Whitworth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNPPXZQN5PC2U3SJZ6M3E4POOKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V29R55ODCL4I?ASIN=B001V9EVCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for storage and feeding!",
                "reviewText": "I’m tandem nursing with a toddler and baby so I needed the BIG bottles instead of the 4-5oz max small size bottles for when I DO pump. I usually get about 5-6 oz and these are great. The storage caps do not leak and they did come with nipples as well. My little one only takes evenflo nipples and because the bottles are a “standard” size neck, my evenflo nipples & collars fit without leaking as well. I also was able to use a Dr Browns nipple & collar without leaks or other issues if you and your little one need to switch nipples/styles.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane Rocks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUGOZJE4OWYNJPQYGWARFJ2P6XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MFHMPR8IQAG5?ASIN=B001V9EVCM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Great sturdy bottle",
                "reviewText": "I have been using Medela bottles for 11 years, and they are great. I love that they are wide and light weight so easy for baby to grip, but sturdy enough that the plastic doesn’t bend but holds a solid shape. Bonus, they screw straight on to my Medela pump making it easy to got straight from pumping to the fridge for storage.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blanca GamboaBlanca Gamboa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 25, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "The media could not be loaded. Muy buena marca las tetinas son muy suaves y a mí bebé le gustó 🍼",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61gKmQyTGtL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/D1en0 zEnFL.mp4"
                }
            },
            {
                "reviewerName": "dnf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 4, 2020",
                "reviewTitle": "Perfect",
                "reviewText": "My baby love the bottle size, not too big for him",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francesca SuomiFrancesca Suomi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on May 21, 2019",
                "reviewTitle": "Set medela, completo!",
                "reviewText": "Ho comprato questo set della Medela perché mi servivano:- dei Biberon grandi per la mia piccola compatibili con il tiralatte swing della Medela (già in mio possesso)- delle tettarelle con “medium flow”- dei cappucci da viaggio (per coprire le tettarelle)Alla consegna (sempre puntuale), la scatola conteneva:- 3 biberon da 250ml- 3 cappucci da viaggio- 3 tettarelle- 3 tappi.Posso confermare la bontà dei prodotti Medela, precisi nella misura delle quantità (provato con la bilancia al contrario di altri prodotti concorrenti), le tettarelle piacciono molto alla mia piccola, ed i tappi sono utili per conservare il latte. Non sono economicissimi, ma sono validi. Consigliati!Un consiglio alla Medela: sarebbe utile avare la possibilità di comprare solo i cappucci dai viaggio dei Biberon, perché anche con il Biberon da 150ml (quindi quando non è ancora necessario l’acquisto di biberon più grandi) si ha la necessità di coprire le tettarelle in caso di uscita con i piccoli.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o1KKpKIML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61+LWtxP2zL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ar3nqCvFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bea y Juanjo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on May 30, 2017",
                "reviewTitle": "Pack super completo",
                "reviewText": "Calidad medela y unidades suficientes para tener una rotacion normal durante meses. Los complementamos con los dos biberones de 180ml q compramos antes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon カスタマー",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on October 21, 2017",
                "reviewTitle": "ミルクが増えたらこちらに切り替え",
                "reviewText": "五ヶ月を過ぎて一回のミルク量が200mlになったのでこちらに切り替えましたが、とても使いやすかったです。",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}