{
    "remaining_requests": 11512,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Comotomo-Natural-Bottle-Green-Ounces/dp/B004C053BA",
    "body": {
        "name": "Comotomo Baby Bottle, Green, 5 oz",
        "price": "$12.99",
        "originalPrice": "$14.99",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Comotomo-Natural-Bottle-Green-Ounces/dp/B004C053BA",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CFQKFG6L"
        ],
        "asinVariationValues": [
            {
                "asin": "B004C053BA",
                "variationName": "Color",
                "variationValue": "Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31yAPIabxwL._SS36_.jpg"
            },
            {
                "asin": "B004C053AG",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31+W-XDyKTL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31t0l-4CiAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/413o7392cNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1KK6tg shL.png"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3846ef83-014c-4b4d-90f9-020dbb14d4cf/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3d6bb9e4-4e52-49e2-b6fb-3f4c61a3be1d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/fcdf5401-f286-53d3-be70-8e017e21c7fd/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/df987a33-2c90-5488-afae-b8b814eefba7/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5a17c445-ff3d-4533-9f57-81712813f77b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7cfb9b0c-8278-44d4-839d-a1d291d4c318/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd7215c8-4349-49a0-80dc-4edd7bc69c1f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a52b4e42-ee80-4065-9a9a-de8715dcecc5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eaf957ac-300c-4ea3-a47a-0fbd4fdf6cfc/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 9,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Comotomo Store",
            "link": "https://www.amazon.com/stores/Comotomo/page/5D175214-2754-432F-8D97-2074A244091E?ref_=ast_bln"
        },
        "brand": "Comotomo",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 18265,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 17. Order within 5 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Silicone",
            "Imported",
            "Comotomo baby bottles are deisgned to most closely mimic breastfeeding to reduce bottle rejection",
            "Ultra wide neck design allows easy cleaning by hand without a brush",
            "Safe in microwave, boiling water, dishwashers and sterilizers. The 5oz bottle comes with a slow flow nipple suitable for newborns up to 3 months",
            "Nipple and body is made of 100 percent safe hygienic medical grade silicone",
            "Dual anti colic vents prevent unwanted air intake and reduce colic. Maximum temperature for bottle- 180 degree celsius"
        ],
        "description": "Product Description Comotomo Silicone Baby Bottles feature an innovative and sensible design to most closely mimic natural breastfeeding. The naturally shaped, soft, silicone nipples are ideal for babies who have trouble transitioning from nursing to bottle-feeding. Your little one will love to hold onto the skin-like, soft and squeezable body that is like no other bottle in the world. These BPA-free baby bottles also feature a wide-neck design for brushless, stress-free, cleaning. They are equipped with truly innovative vents designed to prevent colic while completely eliminating annoying leaks. See why parents call Comotomo bottles “a game changer”! *5oz bottles come equipped with Slow Flow nipples (0-3 months), and 8oz bottles come equipped with Medium Flow nipples (3-6 months). Faster flows available separately. From the Manufacturer Comotomo Baby Bottles feature innovative and sensible design to most closely mimic natural breastfeeding. Our naturally shaped, soft, silicone nipples are ideal for babies who have trouble transitioning from nursing to bottle-feeding. Your little one will love to hold onto the skin-like, soft and squeezable body that is like no other bottle in the world. And you will fall in love with our wide-neck design for brushless, stress-free, cleaning bliss. Our bottles are equipped with truly innovative vents that are smartly designed to prevent colic, while completely eliminating annoying leaks. They are quite possibly the most thoughtful bottles ever made. 150ml/5oz bottles come with truly slow flow nipples (1 hole) designed for newborns up-to 3 months.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Feeding",
                "link": "https://www.amazon.com/baby-feeding-highchair-bottle-bibs/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166777011"
            },
            {
                "name": "Bottle-Feeding",
                "link": "https://www.amazon.com/Bottle-Feeding/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166779011"
            },
            {
                "name": "Bottles",
                "link": "https://www.amazon.com/Baby-Bottles/b/ref=dp_bc_aui_C_4?ie=UTF8&node=166781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎2.56 x 2.56 x 5.12 inches"
            },
            {
                "name": "Item model number",
                "value": "‎150G"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Target gender",
                "value": "‎Unisex"
            },
            {
                "name": "Material Type",
                "value": "‎Silicone"
            },
            {
                "name": "Material Composition",
                "value": "‎100% Silicone"
            },
            {
                "name": "Material free",
                "value": "‎BPS Free, Phthalates Free, BPA Free, Nitrosamines Free, Lead Free"
            },
            {
                "name": "Care instructions",
                "value": "‎Safe in microwave, boiling water, dishwashers and sterilizers."
            },
            {
                "name": "Additional product features",
                "value": "‎Prevent Nipple Confusion, Mimics Breastfeeding, Wide-neck, Anti-colic, Dishwasher Safe"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Style",
                "value": "‎5 Ounce"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Maximum indoor range",
                "value": "‎10 A/W"
            },
            {
                "name": "Dishwasher safe",
                "value": "‎Yes"
            },
            {
                "name": "Bottle nipple type",
                "value": "‎Vented"
            },
            {
                "name": "Bottle type",
                "value": "‎Anti-Colic Bottle"
            },
            {
                "name": "Is portable",
                "value": "‎No"
            },
            {
                "name": "Item Weight",
                "value": "113 Grams"
            },
            {
                "name": "Country/Region of origin",
                "value": "‎Korea, Republic of"
            },
            {
                "name": "ASIN",
                "value": "B004C053BA"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 18,265 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,847 in Baby (See Top 100 in Baby) #50 in Baby Bottles"
            },
            {
                "name": "Brand",
                "value": "Comotomo"
            },
            {
                "name": "Color",
                "value": "Green"
            },
            {
                "name": "Material Type Free",
                "value": "BPS Free, Phthalates Free, BPA Free, Nitrosamines Free, Lead Free"
            },
            {
                "name": "Bottle Nipple Type",
                "value": "Vented"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/065171de-10eb-4f85-9767-7613ef652626.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5a225391-7cbc-4efa-ad4e-594f9b98011e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/470564ae-753e-44af-935e-8a99dc98fa9f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6370bd5f-d662-48a7-aae4-053be62642ad.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/63e21369-0780-4fc1-86dc-f08ef022396e.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Butterfly2418",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUXC2S5K7KEAYZ7GGONJUQAM7EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UYC8V2QC5UOB?ASIN=B004C053BA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2011",
                "reviewTitle": "5.0 out of 5 stars BEST BOTTLE EVER",
                "reviewText": "This is an amazing bottle. SO perfect. My son is tongue tied and can not latch very good on a bottle or breast. Due to this I have stuck to breastfeeding but it is a fight at every feed. Now I am going back to work but no bottle worked on him. I tried everything as I had left over bottles from my 2 year old. Then a friend who had the same issues let me try a COMO TOMO bottle. It took him less than 30 seconds to latch on and he normally takes 1-2 minutes just to latch onto the breast. I was amazed. What makes his latching even harder is his tongue tie, he can't extend his tongue and this bottle nipple is shorter so it helps him. I have looked high and low for a shorter nipple, this bottle does the trick. It should be called boobttle. They only bad thing is it is pricey and you can only get it online at Amazon. I can't wait until it is sold in a bigger store or somewhere like Buy Buy Baby or Baby Hugs. This bottle never leaked for me and it was easy to put together. (Tommee Tippee and Advent Leaked for me) It was hard to read the volume but when turned to the light you can see it. The smaller bottle comes with a nipple that is 0-3 months so you will need to purchase more nipples once the baby is bigger. But the next bottle size does come with a nipple for 3-6 months. This was not explained on Amazon or on the bottle itself. It would be nice to know what size the nipples are with a label or explaination on the packageing.Pros:* My baby loves it.* Easy to hold for baby and parent* Soft like a breast* Easy to clean* Easy to put together* No leaks* Cool looking* Shorter Nipple* Option to get more nipples in slower or faster flowCons:* Pricey* Not in Stores (so you have to wait for it to ship)* Hard to read volume* Wish they had more neutral ring colors (but green is good)",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KristinaKristina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOT6I7HODHICCTSMSUEVRZDHTEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A6Q8ZHWMEX48?ASIN=B004C053BA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing bottles",
                "reviewText": "I have absolutely zero complaints about these bottles. I did a ton of research on bottles when I had my firstborn and decided on these. I have no regrets. They are dishwasher, boil, and microwave safe. The anticolic vents work well and ythe bottle itself is flexible silicone so if the vents are blocked the bottle decompresses to prevent negative pressure build up associated with bellyaches. The nipple shape is highly recommended for all babies and mimics the actual breast for babies that nurse as well. Additionally, there are all kids of accessories you can buy to use your bottles even longer (I.e. flat covers in place of for snack storage, nipple flow varieties of slow, medium, and fast, sippy cup nipples, and straws). I’ve used the same set for two babies, and they still look brand new.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RMl8GJmVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWBO7STVE4LCM6AFSLQFHO2UF2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNO7N9CTYHYH9?ASIN=B004C053BA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2018",
                "reviewTitle": "5.0 out of 5 stars soft mound design of the Comotomo bottles makes for an easy transition. Cleaning is also simple",
                "reviewText": "Nipple confusion is a big worry for many parents. For breastfeeding moms who want some freedom from feeding every three to four hours or having to pump at work, the wide, soft mound design of the Comotomo bottles makes for an easy transition. Cleaning is also simple, thanks to the wide neck that accommodates a dish sponge and BPA-free material that makes the bottles dishwasher safe.Pros• Wide nipple mound for easy latching• Wide neck makes it easy to hand-wash• BPA- and phthalate-free, 100 percent medical-grade silicone is safe to boil, put in dishwasher or microwaveCons• Hard to read measurement markings• Tips over easily• Nipple color turns cloudy over timeBottom LineThe soft, silicone material and wide, naturally shaped design of the Comotomo bottles helps prevent nipple confusion, making it easier to switch between bottle and breastfeeding.FeaturesIt’s common for breastfeeding moms to worry about whether baby is getting enough milk and gaining the recommended amount of weight, so finding a bottle that makes feeding simpler is key to easing anxiety. With my first son, I alternated between Philips Avent and Comotomo bottles and had no major problems. But when I tried introducing a Philips bottle to my daughter, Athena, when she was around 3 months old—to give myself a little freedom (she eats five times a day and still wakes up for a nightly feeding!)—she had a hard time latching on to the bottle’s smaller mound. So I tried the Comotomo bottle, and after taking a little time to get used to it, she was able to latch on and successfully release the milk.I think the Comotomo’s wide, soft mound and pliable nipple makes it easier for babies to transition from breast to bottle, since it more closely mimics a natural breast than most other bottles on the market. It also helps that the bottle is made of the same soft silicone material as the nipple, so her little hands can easily squeeze and hold onto it, just like she’s used to doing with my breast.At first, I was nervous that Athena might reject the breast if she started feeding from a bottle, but she’s been going back and forth pretty easily for about two months now with no issues. Still, as a precaution that my pediatrician recommended, I always angle her in more of a seated position for bottle-feeding so that the milk doesn’t come out too easily. I wouldn’t want her to start thinking that the breast is too much work by comparison.The Comotomo bottle comes with a slow-flow nipple for 0 to 3 months, but you can buy replacement nipples in slow, medium (3 to 6 months), fast (6+ months) and variable (6+ months) flow. The flow size isn’t labeled on the nipple itself, but the nipple hole changes depending on the size so once you open the package and start using them you’ll have to remember which is which—slow flow has one hole, medium has two holes, fast has three and variable has a Y-cut.Like the mound, the neck is also designed wider than other bottles, which makes it really easy to clean. No need to use a bottle brush—you can just reach in with a regular dish sponge. And since the bottles are free of BPA, phthalates and PVC, and made with medical-grade silicone, I can boil them and put them in the top rack of the dishwasher without worrying about them releasing any icky chemicals.PerformanceI have the green Comotomo bottles in both the 5- and 8-ounce sizes, and they’ve held up well, especially since I already used them with my son 18 months ago. The screw top is pretty leak proof, so you can toss it into a diaper bag and not worry about spills. I did have an issue with one of the tops on the bottle being screwed on so tightly that I couldn’t get it off (I blame my husband for that one!) and we had to throw it away. Otherwise, we’ve had no issues with the quality other than occasionally noticing a very subtle soap smell inside the bottle after washing. The Comotomo website says that may happen; they recommend sterilizing the bottles in boiling water for five minutes with a tiny bit of baking soda and then letting them air-dry (open side up) in a well-ventilated area.There are also anti-colic vents on the side of the nipple designed to help baby suck in less air, resulting in less gas, indigestion and spit-up. I can’t say I really noticed a difference when my son switched between bottle brands, but my daughter seems to have the same amount of burps and gas whether she breastfeeds or uses the Comotomo bottles, so I’m going to assume it works.One other thing I noticed is that over time the nipple changes from clear to cloudy with repeated washings. The good thing is it doesn’t affect the performance, but it just perpetually looks a little worse for the wear.DesignThe wide mound, rounded edges and lime green color on the screw top make this bottle nice to look at, and the silicone material makes it easy for baby to grip and hold onto.Since the silicone material is a bit opaque, I’ve found that the measurement markings on the bottle are hard to read (especially during nighttime feedings). To see how much Athena has consumed or whether she’s finished the bottle, I have to take it from her and hold it up for a closer look. Also, the soft material makes the bottle a little unstable when standing upright, as I learned the hard way when I accidentally knocked it over before screwing on the top, resulting in some spilled breast milk.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana Silberstein",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 27, 2023",
                "reviewTitle": "Botellas brbe",
                "reviewText": "Buenísimas y tiene accedorios",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 15, 2023",
                "reviewTitle": "Super bonito y no confunden el agarre.",
                "reviewText": "Me encanto el material porque esta ligero, facilisimo de lavar, es bonito y lo mejor es la mamila que esta bastante amplia y la boquita de mi bebe se abria casi como al pecho. No tuve ningun problema de confusión en el agarre ni le dio colicos. El flujo esta muy lento, mi bebe si se desesperaba y si le tuve que abrir un poco mas con un alfiler esterilizado, pero supongo que eso depende de cada bebe, prefiero eso a que haya estado muy rapido.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 27, 2022",
                "reviewTitle": "Very satisfied with this bottle",
                "reviewText": "I was skeptical to buy this bottle but I must say it was a good decision. My 7 week old daughter decided that she no longer wanted to feed from the Dr. Brown bottles and only wanted to breastfeed. I introduced this bottle and she loved it. It's soft and squishy and mimicks the feel of a breast and the nipple is very soft and flexible. I still breastfeed most of the time but I can also get things done and have someone else bottle feed her. It is pricey, but overall it's a really good bottle and did the trick. Will be buying the 8oz one as well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephany",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 16, 2021",
                "reviewTitle": "Excelente",
                "reviewText": "Antes usaba la marca Dr. Brown’s y me iba bien, pero a la hora de lavar los biberones no era nada práctico ya que contiene demasiadas piezas y era demasiado tardado, ahora que uso comotomo mi bebé lo ama y es súper fácil de lavarse, están increíbles y su diseño sin duda es innovador y muy bonitoActualización: Estoy por cumplir los 3 meses desde que compré este biberón y puedo decir que para el día al día esta un poco incómodo ya que por la noche al preparar el biberón es complicado lograr ver los números de las onzas, ya que son completamente transparentes y a pesar de no llevar tanto tiempo utilizándolo ya se comienza a hacer amarillo, me parece que es lo que pasa con todos los biberones pero este se me ha echo demasiado pronto a que se comience a mancharse ya que no llevo ni 3 meses de uso. Para su precio creo que podría ser mejor mucho mejor.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ritu sharmaritu sharma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 19, 2023",
                "reviewTitle": "One of the best baby bottles",
                "reviewText": "The media could not be loaded. One of the best baby bottles in market, babies can easily latch and it gives breastfeeding feeling to babies due to its shape, also there is no problem of gas bcoz of 2 anticholinergic vents, value for money product",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51zhgjQBbpL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/C1HDQZIRRQL.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}