{
    "remaining_requests": 11460,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tinukim-iFeed-Ounce-Feeding-Bottle/dp/B01MFDBWQN",
    "body": {
        "name": "iFeed 9 Ounce Self Feeding Baby Bottle with Tube - Handless Anti-Colic Nursing System, Pink - 2-Pack",
        "price": "$16.99",
        "originalPrice": "$26.99",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tinukim-iFeed-Ounce-Feeding-Bottle/dp/B01MFDBWQN",
        "soldBy": {
            "sellerID": "A2SGX0GALB1AWB",
            "name": "Coolkidz",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2SGX0GALB1AWB&asin=B01MFDBWQN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09KYLGYLT"
        ],
        "asinVariationValues": [
            {
                "asin": "B01MPY6W4X",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Ipjm7Pz1L._SS36_.jpg"
            },
            {
                "asin": "B01MFDBWQN",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41P4sA0DdvL._SS36_.jpg"
            },
            {
                "asin": "B07FK464WV",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31rk6SVkcuL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41eatBYDloL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41e46UvEc3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/314ugxU2NyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oupPfbqTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41I3EqaG1PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514hQUIVHSL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Tinukim Store",
            "link": "https://www.amazon.com/stores/Tinukim/page/C91ED775-38C7-4D71-A427-EA078073D7E4?ref_=ast_bln"
        },
        "brand": "Tinukim",
        "merchantInfo": "Coolkidz",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 6001,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 20 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SOFT LATCH-ON NIPPLE: The Tinukim iFeed Self-Feeding Baby Bottle with Tube - Anti-Colic Nursing System promotes proper latch, reduces nursing spills, and mimics natural breastfeeding—perfect for babies and moms who want to switch between breastfeeding and bottle feeding",
            "LEAK-FREE VENTING TECHNOLOGY: Reduces air build-up associated with colic; also helps reduce gassiness, ear infection, and spit-up",
            "PORTABLE & EASY TO USE: Features a wide mouth, rounded edges, and clearly marked measurements for ease of use, and easy fill-up and cleanup. Portable set includes: 2 bottles, 2 adaptors, 2 disks, 2 nipples, 4 cap rings, 2 (6.5\") tubes, 2 tubes (11.5\"), 2 nipple covers, and 1 tube cleaning brush",
            "NON-TOXIC DESIGN: Made with high-quality silicone—free of BPAs, phthalates, PVC, and lead",
            "DURABLE CONSTRUCTION: Safe to use in microwaves, freezers, dishwashers, boiling water and sterilizers; heat resistant up to 392˚F"
        ],
        "description": "The Tinukim iFeed Self-Feeding Baby Bottle with Tube - Anti-Colic Nursing System is an ingenious, handless feeding system designed to let you comfortably feed your little one in an upright position.This no-hands feeding device is tailor-made for babies 3 months and up and their busy, on-the-go families.Say goodbye to inconvenient feeding times/situations and to dropped bottles, and feed your baby anywhere on the go—while baby is in the carrier, carriage, stroller, or car seat. The controlled, air-flow design allows baby to easily regulate and manage feed pacing and flow amount. The Tinukim iFeed Handless Nursing System is a portable, two-pack set that contains:2 bottles, 2 adaptors, 2 disks, 2 nipples, 4 cap rings, 2 (6.5\") tubes, 2 (11.5\") tubes, 2 nipple covers, and 1 tube cleaning brush. Baby bottles are available in two sizes: 4 oz. and 9 oz. and three colors: Blue, Pink, and White. Limited one-year manufacturer’s warranty. Imported.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Feeding",
                "link": "https://www.amazon.com/baby-feeding-highchair-bottle-bibs/b?ie=UTF8&node=166777011"
            },
            {
                "name": "Bottle-Feeding",
                "link": "https://www.amazon.com/Bottle-Feeding/b?ie=UTF8&node=166779011"
            },
            {
                "name": "Bottles",
                "link": "https://www.amazon.com/Baby-Bottles/b?ie=UTF8&node=166781011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎2.6 x 6.4 x 8.75 inches"
            },
            {
                "name": "Item model number",
                "value": "‎TFSB80303P"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Number Of Items",
                "value": "‎2"
            },
            {
                "name": "Style",
                "value": "‎9 Ounce"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Dishwasher safe",
                "value": "‎Yes"
            },
            {
                "name": "Bottle nipple type",
                "value": "‎Vented"
            },
            {
                "name": "Bottle type",
                "value": "‎Anti-Colic Bottle"
            },
            {
                "name": "Item Weight",
                "value": "‎6.7 ounces"
            },
            {
                "name": "ASIN",
                "value": "B01MFDBWQN"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 6,001 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,646 in Baby (See Top 100 in Baby) #172 in Baby Bottles"
            },
            {
                "name": "Brand",
                "value": "Tinukim"
            },
            {
                "name": "Color",
                "value": "Pink"
            },
            {
                "name": "Bottle Nipple Type",
                "value": "Vented"
            },
            {
                "name": "Capacity",
                "value": "9 Ounces"
            },
            {
                "name": "Bottle Type",
                "value": "Anti-Colic Bottle"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "queens princess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECER5FAHXYZF6GGUIYOJLFCTMIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UJKD0NCVLL5H?ASIN=B01MFDBWQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars The easy use and very affordable",
                "reviewText": "I love the bottle haven't been able to use it yet cause he is still too young to use it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnnieQ14AnnieQ14",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAYIO3PQD5QCWBZDGGETIG4QQZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X7G8Q3Q0QSYW?ASIN=B01MFDBWQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 2, 2018",
                "reviewTitle": "5.0 out of 5 stars Saved our sanity! No more propping bottles!",
                "reviewText": "SAVED MY LIFE. And my ears. My 4th baby girl is my most stubborn and hard headed baby. When she’s hungry (which is often) she will let us know and it isn’t pleasant. She’s a yeller. She is 4 months old and car rides and walks have been nothing but anxiety-filled escapades. We had started to ensure we had what we called the “car baba” before any trip, short or long. But holding it propping the bottle wasn’t always easy or doable, and we were all losing our minds. This bottle has saved us! I can’t even begin to explain the difference from propping or holding a bottle to the ease of this. She had no nipple confusion between this, breastfeeding, pacifier, and her other bottle. She took to it easily and she even holds onto the tube or the top mouth piece and can generally get it back into her mouth if she accidentally pulls it out of her mouth. It doesn’t leak if it does come out of her mouth and just hangs around. It’s easy to assemble (there are pictures, so not sure where the confusion is for assembly if you get the insert), and easy to clean.The ONLY negative I can see is what someone else mentioned regarding the lack of a clip or something that could hold the top tubing and nipple so it isn’t just loose and hanging. But, like the other reviewer, we just lightly wrap it around the top. Not a deal breaker by any means, but future design of the bottle should incorporate this to max out its potential as the best bottle ever. We do only use this when we go on walks or car rides. Otherwise, I nurse her or use her other bottle while holding her.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/710zAl22OML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia Re Miami",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWTJR5J32QLF74DXQAIRUBAMP2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NQ0G616IE73O?ASIN=B01MFDBWQN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2021",
                "reviewTitle": "3.0 out of 5 stars Love it but Not for 5 or less months old",
                "reviewText": "This is a great idea, still needs some improvement but it does the work. Keep in eye on your baby as it might happen to get stuck or get a bubble if your baby stops suctioning, that’s why I waited for my baby to be older and be able to burp on her own, because they might get some air flowing in between. Normally I have to start the bottle from the straw and then connect it to the nipple otherwise she will get frustrated because it take a few for the milk to get to the nipple. Cleaning is a little complicated but not impossible y just let the hot water run through for a while and then use the cleaning tool they give u. I really like it and use it a lot specially when I have a lot of work to do. Don’t use it at night when sleeping, you do not want to fall asleep and have an accident or have your baby shocking with the tube around their necks. Be careful.Overall I do like it and use it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Omgenius",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFFBXTVUKSNVC2RU7CXRFAKQWGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TKML6PYTJ3ZC?ASIN=B01MFDBWQN",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "1.0 out of 5 stars gimmick",
                "reviewText": "While the concept is fantastic, the execution falls short. The issue lies in the milk not staying in the straw, demanding constant suction. Using this could result in your baby ingesting excessive air, potentially leading to uncomfortable gas issues. It's crucial to be aware of this drawback to ensure your baby's feeding experience is both effective and comfortable.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda WadeAmanda Wade",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTODVOO4F2EI5VAQR5WWSF535PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VQ7OYIQRWM0C?ASIN=B01MFDBWQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 14, 2018",
                "reviewTitle": "5.0 out of 5 stars Ease of the bottle, my sons liking to the bottle.",
                "reviewText": "I purchased this initially because the Podee bottle was out of stock everywhere and the people that did have it wanted 5 times the amount it was sold for in stores. When I purchased it I did so knowing I’m a breast feeding mom and my son needs to be pace fed. I paid for rush shipping got it in 2 days and immediately tried it. Now before I get into that let me tell you I also ordered the turn any bottle into a Podee bottle.The Tinukim bottle, super easy to set up and clean. My son took to it immediately. The hoses are easy to assemble and clean as well. They are a little flimsy but I actually found that to be quite nice for my son. Not to easy that my son isn’t working for his mean but not to hard that he ends up with a stomach full of gas and crying giving up because it’s to much work. Although it’s a bottle he isn’t detoured from being breast fed because now he’s being fed properly by the bottle and not by one that constantly leaks or drips into his mouth.I absolutely love this bottle! I do wish I had a 4 ounce one because it’s just to big to be honest he only eats 2 ounces at a time right now. But he will grow into it.The Podee kit in comparison there is none. That podee setup sucks. It’s to hard for my son to get any milk out of. He cries and gets mad. I tried it to help him and it’s so much resistance it’s impossible to say that mimics pace feeding. More like starvation! The hoses are so hard to clean they don’t have any give or forgiveness. Disconnecting the hoses takes the jaws of life and it’s annoying. The nipple is way to hard and the whole is huge still not helpful for a child.Winner by a long run is the tinukim bottle.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/712NLJSf2sL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nadiya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4TTM2QEBGEKBOGOWGBKY32D5VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSEG81X43WQA7?ASIN=B01MFDBWQN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Does the job",
                "reviewText": "In theory this is an amazing invention, however its tedious to wash after every use. I purchased this for when we’re traveling and I’m unable to hold my l.o bottle, so i don’t use it daily for each feeding. I would imagine that the tube insersts wont hold much roughhandling/washing and will frey. That being said my kiddo is 8 months old, refuses to hold her bottle, so this is a lifesaver for toad trips but since she is already 8 months, shes able to pull off the tubes. Happened once already. But i love it. Saves my sanity on road trips.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AzizibelAzizibel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYLHMR4WG4N4L4A42ODQIXR2HFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R393ZGDMT6R7JM?ASIN=B01MFDBWQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2019",
                "reviewTitle": "5.0 out of 5 stars Start the bottle for baby until milk is in nipple.",
                "reviewText": "The media could not be loaded. I used it the same day it was delivered. I needed this and it worked for me perfectly. At first glance it seems intimidating-maybe complicated, but there were instructions on paper on how to assemble it. I still have many (14) other normal bottles. I bought the “two pack,” for when I’m busy, nothing beats holding your baby in your arms and feeding her/him. Sometimes mommy is just too busy. Only difficulty I have with this bottle is the numbers, I cannot freaking see it, I need to measure 6 ounces of water and I cannot see the six, I’m pissed off about that, they should put the numbers in color, they just etched it in the bottle. Other bottles use white paint for the markings so we can clearly see the numbers, so we don’t get frustrated bending down- feeling the imprint- putting it to the light-etc- that frustrated me.One more thing, I suck up the milk into the nipple before putting it in her mouth, starting it for her, clearing any air trapped in straw.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/6191EG7Ad1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61NY4fpRaDL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/184ae1ae-5518-4060-aace-a452d737994d/default.jobtemplate.mp4.480.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}