{
    "remaining_requests": 45517,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Compatible-Computers-External-Expandable-Storage/dp/B09XQM6K6Q",
    "body": {
        "name": "iPhone Flash Drives 1TB, 3.0 USB Memory Drive 1000GB Photo Stick Compatible with Mobile Phone & Computers, External Expandable Memory Storage Drive Take More Photos & Videos(Pink)",
        "price": "$23.99",
        "originalPrice": "",
        "rawPrice": 23.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Compatible-Computers-External-Expandable-Storage/dp/B09XQM6K6Q",
        "soldBy": {
            "sellerID": "ASMAUBY2ZTIJO",
            "name": "The new new",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ASMAUBY2ZTIJO&asin=B09XQM6K6Q&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09YXRF6TT"
        ],
        "asinVariationValues": [
            {
                "asin": "B09FKX4NB7",
                "variationName": "Color",
                "variationValue": "blue",
                "price": "$23.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41gOrukMAsL._SS36_.jpg"
            },
            {
                "asin": "B09WK7TJJL",
                "variationName": "Color",
                "variationValue": "gold",
                "price": "$23.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ok-jTFweL._SS36_.jpg"
            },
            {
                "asin": "B09XQM6K6Q",
                "variationName": "Color",
                "variationValue": "pink",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ZHV8JifLL._SS36_.jpg"
            },
            {
                "asin": "B09CKNHN2D",
                "variationName": "Color",
                "variationValue": "red",
                "price": "$23.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41uzsorrSqL._SS36_.jpg"
            },
            {
                "asin": "B09Q5R8T59",
                "variationName": "Color",
                "variationValue": "silver",
                "price": "$23.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51MSlCfp9cL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ZHV8JifLL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51AsalY2yZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Tnsy7XQtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-7YxRSM7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PwszRoa2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UZ0q5rElL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61nV-yL3KZL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: pangukaitiandi",
            "link": "https://www.amazon.com/pangukaitiandi/b/ref=bl_dp_s_web_58790917011?ie=UTF8&node=58790917011&field-lbr_brands_browse-bin=pangukaitiandi"
        },
        "brand": "pangukaitiandi",
        "merchantInfo": "The new new",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 2641,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 18 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Are you tired of storing warnings on your mobile phone? Are you also worried about the lack of internal storage?",
            "It is a USB flash drive with three connectors that can transfer files for all products. Multifunctional, small and large capacity storage is the first memory in the world that can transmit three connectors",
            "flash disk 1000GB you don't have to pay extra for additional storage, just insert it and enjoy the extra space of the device. flash drives are excellent solutions for transferring files, videos and pictures back and forth from the Phone and as well as computers",
            "connectors work in most cases. USB 3.0 connectors can easily move content between devices. Flash stores also include encryption software for password- protected files, so you can share content while keeping sensitive files secure",
            "Compact equipment is suitable for almost anywhere. Store your favorite movies or TV programs from your computer on an flash drive and watch them anywhere and anytime. (compatible with the Phone) interface and license chip to ensure compatibility with any device 100Zs without annoying error messages"
        ],
        "description": "Do you want to make your Phone more convenient? Are you tired of your Phone running out of memory? Do you want to keep enough Phone memory during your trip? Never lose important documents, videos, photos again thanks to large and reliable Phone USB flash drives. When it comes to backing up your important documents or easily transporting files, one of the safest and easiest ways to do so with is a Phone flash drive. Smaller and more compact than a portable hard drive and easy to use without WiFi, unlike the Cloud or other online storage systems, Phone photo stick continue to be a preferred method of storage and backup for many computer and smartphone users. Phone memory stick because of their size, making it easy to carry with us anytime. Phone flash drives can plug directly into a Phone, Tablet and Computer, acting as additional storage for photos, videos and your music library. Because of the flash drive’s compact case, these Phone flash drive can go with you while you travel or on your daily commute. Phone usb flash drive can make it easy to transport private documents or any files that you want to easily share without creating an online backup system. Flash drives are integral when it comes to backing up your smartphone media. Whether its photos, videos or other types of media, these drives will not only allow you to back up and protect your precious data, they also act as extra storage so you never run out. USB flash drives are optimized for Phone but will work with and/or can be compatible with Android and Windows operating systems as well. All of our picks utilize plug and play technology allowing for fast and easy transfers, have secure data encryption technology ensuring privacy for all your data across all platforms and have specially designed apps to allow easy saving and transferring of data. Please Note If necessary, please remove your phone case before use. Because the phone case will affect the connection between the phone and the usb flash drive. Even if you insert the usb drive into the phone, the usb drive may not be recognized by the phone. After using the usb flash drive, please make sure to turn off the apps related to the usb flash drive, and then unplug the usb flash drive gently, so that the files in the usb flash drive will not be damaged. Please check the description and pictures of the product details page carefully before using the usb flash drive. If you have any questions, please find us immediately for help. If the product cannot keep the original date of the photo, please connect the Phone flash drive to the computer and format it as“EXFAT” . (Please download the highest version of the App 1.4.6)",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "pangukaitiandi"
            },
            {
                "name": "Item Weight",
                "value": "‎0.001 ounces"
            },
            {
                "name": "Color",
                "value": "‎pink"
            },
            {
                "name": "Manufacturer",
                "value": "‎pangukaitiandi"
            },
            {
                "name": "ASIN",
                "value": "‎B09XQM6K6Q"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎April 12, 2022"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 2,641 ratings 3.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "1000 GB"
            },
            {
                "name": "Hardware Interface",
                "value": "Memory Stick, USB"
            },
            {
                "name": "Special Feature",
                "value": "Compact"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Vintagechick67",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSF7GOLI5EBCO3YQECLOTU2DEOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLMT274BMSIGF?ASIN=B09XQM6K6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars iPhone Flash Drives 1TB, 3.0 USB Memory Drive",
                "reviewText": "I recently purchased the iPhone Flash Drive with 1TB storage capacity, and it has proven to be a game-changer in managing my phone's storage and preserving precious memories. Here's my comprehensive review based on my experience:Pros:Ample Storage Capacity:The 1TB storage capacity is more than generous, providing ample space to store a vast collection of photos, videos, and other files. This has significantly alleviated the worry of running out of space on my iPhone.Effortless Data Transfer:The 3.0 USB interface ensures fast and efficient data transfer between my iPhone and laptop. I use it primarily for transferring large videos, allowing me to edit them on my laptop and free up space on my phone for continued recording and photography.Versatility Across Devices:The flash drive is compatible with mobile phones, making it a versatile solution for various devices. This feature is particularly handy for those who use multiple devices in their daily routine.Easy Backup and Organization:The flash drive enables easy backup of photos and videos, providing a convenient way to organize and secure memories. It's a practical solution for those who want to ensure their files are backed up without relying solely on cloud storage.Lifesaver for Storage Management:This flash drive has been a lifesaver in managing my phone's storage. The ability to transfer and store large files has allowed me to optimize my phone's performance and keep it running smoothly.Gift-Worthy:The product's utility and high storage capacity make it an excellent gift choice. I plan to purchase one for my husband and consider giving some as Christmas presents to my grandkids, knowing it will be a useful and appreciated gift.Cons:Bulky Design:The size of the flash drive might be considered a bit bulky, especially when connected to the phone. However, the trade-off for the large storage capacity is justifiable for many users. This is a minor issue as it does not stay on your phone.Overall Impression:The iPhone Flash Drive with 1TB storage has exceeded my expectations. It has become an indispensable tool for managing my iPhone storage effectively. The ease of data transfer, versatility across devices, and the ample storage capacity make it a standout product in its category.I highly recommend this flash drive to anyone looking for a reliable solution to expand their iPhone storage, especially if they frequently deal with large files like videos. It's not just a practical tool for personal use but also a thoughtful and useful gift for loved ones. I look forward to sharing the convenience of this flash drive with my family during the upcoming holiday season.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "makayla samuels",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCTZIJJ7XLW7VB43YHBV2BY72WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDI18KBCGGXDU?ASIN=B09XQM6K6Q",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "1.0 out of 5 stars This thing sucks!",
                "reviewText": "It says I have to use the app to extract videos from the flash drive, but it says to “select “ the item but it doesn’t give me the option to download it, but I lets me ring it over to the external storage but it doesn’t show up when I go to my gallery in my iPhone 14plusThen I try to extract again! It doesn’t wanna process at all it just stayed at \"0%\"waste of money!!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mia Lim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPCP7GYVMM7CRBVKS3POICBD6ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSY7K38TRMPJN?ASIN=B09XQM6K6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for people who need storage",
                "reviewText": "My sister in law loved it. She just had a baby and was running out of space and had no computer or other source to save the memory. So just having the app and being able to upload it was perfect to save the milestones.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTND6CAHU423DGKBNHKWUPQFM4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RDWZGFRFN5YG?ASIN=B09XQM6K6Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Great amount of storage",
                "reviewText": "1TB Thumb drive is great to have. Especially on vacations where pics and vids on the phone mount up and there's no way to offload them via cell or internet.It requires downloading an APP to use which I wasn't thrilled about. The APP is made by a country in China and everyone knows that's an open door to spying/tracking on your phone...ie YOU.My only real gripe with the Drive is that it requires USB 3.0 or faster to operate with a Card Reader. Finding a Card Reader that has that ability isn't hard..the problem comes when you want to transfer your phone files to something like a lap top or desk top. Now you need a laptop or desktop that has a USB 3.0 port and many of us with computers 3 or more years old don't have them.It's just a lot of extra steps to get something to work that should be simple plug-n-play. Which is an inconvenience.But all in all...the 1TB Drive is great to have and I like it. I just need to get a viewer/storage device that can communicate with it so I can clear off the drive once it fills up.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Otto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRZSRAPRMWSYIEJKH5KI2ZE3REA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PVLYU8NCILBJ?ASIN=B09XQM6K6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Works with an I 14",
                "reviewText": "Easy instructions. Storage lots of photos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KC2010",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5B746GEBENIOXAIATAZ5GGXR4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXX8C1Z6TUO1T?ASIN=B09XQM6K6Q",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "3.0 out of 5 stars Didn't back up recent photos",
                "reviewText": "I had high hopes to backup my iPhone photos, but this only backed up certain ones. It backed up nothing from the past year. I waited a week and did another back up, and this time it didn't add any new photos and still did not back up anything from the last year.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maximina Rodriguez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGNINZHHHJC2NGADM7UJ4WZNT6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZMC8HQ3QRMKE?ASIN=B09XQM6K6Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars awesome",
                "reviewText": "it works perfectly 50% of my photos went on it from my phone. It gave me space on my phone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRLAMNGQXYUXFTLP7YY6RKQICTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HH5C5ZMQQ4EW?ASIN=B09XQM6K6Q",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "1.0 out of 5 stars Sketchy app/privacy concerns",
                "reviewText": "I assumed this was something like an actual just usb drive I could plug into my phone and use immediately and directly. But you need an app w it and everything is stored in the app and it’s super sketchy and has sketchy privacy policies and poor reviews for the app on apple too.Not to mention was extremely slow and tedious to use as you transfer all the photos through the app, and the usb part is incompatible with Mac - waste of my time and money. Very disappointed and will be returning asap",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. CESAR ARREDONDO MEDRANO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 9, 2023",
                "reviewTitle": "Muy funcional",
                "reviewText": "Buen articulo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. FELIX SANCHEZ HERNANDEZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 9, 2023",
                "reviewTitle": "Calificación de dispositivo",
                "reviewText": "Buen producto práctico y fácil de usar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jum",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 8, 2024",
                "reviewTitle": "Great storage device!",
                "reviewText": "Purchased this to back up iPhone on to and had no issues at all. Highly recommend if you don’t have a computer or laptop to back up on.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Fryer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 26, 2024",
                "reviewTitle": "Phone Drive",
                "reviewText": "Great for keeping photos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesús Muñoz Orozco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 21, 2023",
                "reviewTitle": "Muy difícil instalar",
                "reviewText": "Es muy difícil instalarlo porque hay que bajar una aplicación y todo está en inglés yo soy de la tercera edad y no sé inglés gracias",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}