{
    "remaining_requests": 45393,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Kingwin-Optimized-Controls-Provide-Longevity/dp/B00TZR3E70",
    "body": {
        "name": "Kingwin Hard Drive Power Switch Module for 2.5 inch/3.5 inch SATA HDD/SSD. Optimized for SSD, Power On or Off HDDs as Wish, Controls up to Six HDDs, and Provide Longevity to Your Hard Drives",
        "price": "$25.99",
        "originalPrice": "$29.99",
        "rawPrice": 25.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Kingwin-Optimized-Controls-Provide-Longevity/dp/B00TZR3E70",
        "soldBy": {
            "sellerID": "A1W36NGWLHYVQ3",
            "name": "KWI-Kingwin",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1W36NGWLHYVQ3&asin=B00TZR3E70&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41msbKdvKZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41l5imEEmwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UX3MCjAAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gItOf6KoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512lAEdZAgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UdXHXYArL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZlDigGNDL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71b5To0qF8L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71b5To0qF8L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Kingwin Store",
            "link": "https://www.amazon.com/stores/KWI-Kingwin/page/406C6879-B720-45C1-A696-580BD4F41551?ref_=ast_bln"
        },
        "brand": "KWI-Kingwin",
        "merchantInfo": "KWI-Kingwin",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 226,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 4 hrs 21 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Power Switch to Control up to 6 HDD",
            "Power ON/OFF HDDs that are not in use",
            "Reduce energy & extend HDD life",
            "Blue LED Indicator for HDD working status",
            "Two sets of input power supply cable",
            "Six pieces output power supply cable",
            "All metal material",
            "Fits 5.25″ drive bay"
        ],
        "description": "King win HDD Power Switch Module, 6 Switches for 5.25\"",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "I/O Port Cards",
                "link": "https://www.amazon.com/Network-I-O-Port-Cards/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3012291011"
            },
            {
                "name": "USB Port Cards",
                "link": "https://www.amazon.com/Internal-USB-Port-Cards/b/ref=dp_bc_aui_C_6?ie=UTF8&node=229185"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "‎Kingwin"
            },
            {
                "name": "Item model number",
                "value": "‎HDD-PS6"
            },
            {
                "name": "Hardware Platform",
                "value": "‎Sata"
            },
            {
                "name": "Operating System",
                "value": "‎Windows OS XP, Vista, 7, 8, 8.1 and 10"
            },
            {
                "name": "Item Weight",
                "value": "‎9.2 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.86 x 1.57 x 5.51 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎5.86 x 1.57 x 5.51 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎KWI Technology Inc./Kingwin"
            },
            {
                "name": "ASIN",
                "value": "‎B00TZR3E70"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎March 1, 2015"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 226 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#46 in Internal USB Port Cards"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "God is a refuge for us (Psalms 62:8)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB3QYMPVU2SDHMJLRLIXSNYRJLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JVJG87J25DOF?ASIN=B00TZR3E70",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2015",
                "reviewTitle": "5.0 out of 5 stars works great for my situation",
                "reviewText": "The seller was Amazon. I paid 30 bucks.I am using this to toggle between 2 drives (a solid state drive SSD, and a regular hard drive HDD). I have Windows XP on one, and Windows 10 on the other. It is much easier for me to control what Operating System boots-up by using this power switch module, than it is to change my BIOS settings each time I boot (or attempting to create partitions, which I tried to do but was unsuccessful).The installation was easy, and the instructions are fine. After popping off both sides of my desktop case and the front panel, I removed one of the 5.25\" drive bay protectors from my PC case. The module comes with 6-8 screws. I inserted two and screwed them down on both sides. Great fit.There are 2 sets of power cables: two 4-pin molex male connectors (one on each side), and two 15-pin SATA input power Y-cables (one on each side). You only need to use one set of these for power (either both molex, or both SATA). I used the 2 molex connectors. I initially connected only 1 molex connector, and later decided to connect them both, because that's what the instructions said. I suspect, but am not sure, that one power connector may power switches 1-3, and the other may power switches 4-6, but I didn't test that. I can say that when I only had one power connector attached that all LED lights on the front glowed when the buttons were pressed.At first boot with only one power cable attached, I got a error about master boot record. I rebooted and it went away. Then I decided to attach the second molex power connector. No error messages after multiple boots.I have my BIOS set to boot to the Windows 10 drive first, and the Windows XP drive second (if the first drive fails). That means if I swap power from one drive to another, my PC will always boot to one OS or the other...without me having to make more BIOS changes.If you look at the photo on Amazon (the one that shows the cables), you'll see 6 white connectors that look like fan cables. That's deceptive. Those connectors plug into the module itself. The other end of those connectors plug into your SSD/HDD power receptacle. Most of the connectors that go to your SSD/HDD are labeled with numbers...the shortest cables do not have a number on them, but it's easy to tell what they are.My PC case is a Zalman Z9 Plus System Cabinet - Mid-tower. Lots of room. I had no problem installing the module, and the cables were long enough for me. No complaints.The LED lights on the front under the buttons glow blue.The module does exactly what I need it to do. It beats the alternative, which was to leave the side of my PC case open and swap power cables as needed (or reset boot order in my BIOS whenever I wanted to use the other OS). I'm happy with my purchase.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Max Grodty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIONO2H63E4XXSHPKN7YGL2PG2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EEGORXN1KYR3?ASIN=B00TZR3E70",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2017",
                "reviewTitle": "5.0 out of 5 stars Turn Hard Drives off and on individually - But Be Careful!",
                "reviewText": "The KIngwin HDD Power Switch Module is a well designed, solidly built product. This device, mounted in an extra DVD drive bay, allows you to have multiple separate computers operating in one single case. This offers the benefits of saving power on unused drives, prevents applications on one HDD from interfering with other applications on other drives, and prevents accidental erasure of a drive while adding a new operating system. The cables are pre-attached and long enough to reach the farthest places in a large case.In my instance, I operate a ProTools recording system that uses its own mixing board, sound card, etc.on a high powered computer. Due to the complexity of the software and all its plug-ins it is recommended to operate ProTools on a single computer all by itself. By using the Kingwin HDD Power Switch Module I can run a Windows XP computer for all my legacy software on one solid state drive, my Windows7 recording computer on another SSD, and another Win7 SSD drive for all of my other stuff - one at a time without interfering with each other. All 3 SSD's share a single large HDD data drive which is left on all the time. It's very convenient (and space saving).I have the pushbuttons on the front clearly labeled so that I know which drive is which. I turn on the one drive that I want to use and turn off the others, then boot up the computer. When I'm finished, I allow the drive to shut down completely during reboot, then turn it off and switch the other one on while the computer is re-booting. Works perfectly.Be CAREFUL and DO NOT push these buttons while the computer is running. I fried my motherboard by carelessly pushing on off buttons for the hard drives. To be sure this never happens to you, ALWAYS POWER DOWN first before switching hard drive configurations.I have been trying to solve this problem for years and the Kingwin HDD Power Switch Module does it for me. It will simplify things greatly. If you operate a complex computer, try one and be careful with it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2GKDLFZKE4NBXWGJHTXA4WNB5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R235DY9CUZTT5X?ASIN=B00TZR3E70",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2015",
                "reviewTitle": "4.0 out of 5 stars HDD Power Switching made easy",
                "reviewText": "Works well.LED's Are brightThe Power to drives are 6 Serial ATA Power connectors.. most common drives that support ACHI hot swapping.Each power connector is Labeled 1 2 3 4 5 6 which corresponds to the numbers on the face of the unit next to each button in small printThe cables you see with the 4Pin headers are to plug the Power connectors into the back of the unit.The 4 Molex connectors are used to plug the Power from 2 Sata Power connectors that would come from your power supply. OR I am guessing you might be able to use 4 Molex connectors from your Power Supply and use the Sata to Molex Splitter to older Molex drives BUT that splits 1 to 2 so your either would be turning off 2 drives if you hooked both to 1 or you would have 1 dangling which would look awful - better If you NEED Molex to just get a 15-Pin Serial ATA Male to LP4 Female Power Cable adapter .Pack of 6 Aleratec SATA to LP4 Molex Power Adapter Cable, 6 Inches 6-Pack Or C2G / Cables To Go 10149 15-Pin Serial ATA Male to LP4 Female Power Cable -6-Inch The unit did not fit tight in my tool-less Corsair 500R case but I was able to remove the clips from the case and just screw it into the holes to hold it in place.I am using the unit to keep older Archive drives OFF unless I need them.. It could be used to have mulitple OS drives BUT you would have to pick the boot drive BEFORE turning the computer on, since the Boot Os drive would not be Hot Swappable. After you boot though you could turn on any drive you wanted..",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "User",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 3, 2024",
                "reviewTitle": "Alles bestens",
                "reviewText": "Funktioniert besser als gedacht, die Installation ist sehr einfach.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2021",
                "reviewTitle": "Extremely Well Made Product",
                "reviewText": "Finally, a product made by an American Company! It is very well designed and made of good materials - more expensive than the competition, but well worth the extra cost in my opinion. The cabling was - frankly - impressive - clearly made by professionals, and they even have a number on each cable end, so you don't have to do any cable tracing. This product is going to last me for 25 years. My only tiny quibble is the indicator lights are extremely bright - they probably could have gotten away with a quarter as bright - but, on the other hand, it impresses the kids.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe Rivers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 17, 2021",
                "reviewTitle": "Buen producto",
                "reviewText": "LO tengo instalado en 2 maquinas y me ha funcionado excelente, sin problemas. Solo me gustaria que le pusiesen una cubierta para evitar presionar los botones por accidente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rajul Bansal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 24, 2017",
                "reviewTitle": "build quality is good.",
                "reviewText": "Very expensive for the work that it does. However, build quality is good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 9, 2021",
                "reviewTitle": "Excelente",
                "reviewText": "Es un excelente producto, me funcionó perfecto, tengo 1 mes usándolo y es justo lo que esperaba!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}