{
    "remaining_requests": 45466,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-Basics-256GB-Ultra-Flash/dp/B0B61DGG18",
    "body": {
        "name": "Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive, Black",
        "price": "$17.99",
        "originalPrice": "$23.83",
        "rawPrice": 17.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-Basics-256GB-Ultra-Flash/dp/B0B61DGG18",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B61J2PCV"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B6148YKN",
                "variationName": "Size",
                "variationValue": "128 GB",
                "price": "$11.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0B61DGG18",
                "variationName": "Size",
                "variationValue": "256GB",
                "price": "$17.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31aOwoPekOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ELCPQVCGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wGjGedljL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vUKID3 UL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61 iUmlxUyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bxjlWGWWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ge RdLn5L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91YayEzm9yL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/616c9XCo3DL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Amazon Basics Store",
            "link": "https://www.amazon.com/stores/AmazonBasics/page/947C6949-CF8E-4BD3-914A-B411DD3E4433?ref_=ast_bln"
        },
        "brand": "AmazonBasics",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 9579,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 18 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "256GB ultra fast USB 3.1 flash drive with high-speed transmission; read speeds up to 130MB/s",
            "Store videos, photos, and songs; 256 GB capacity = 64,000 12MP photos or 978 minutes 1080P video recording",
            "Note: Actual storage capacity shown by a device's OS may be less than the capacity indicated on the product label due to different measurement standards. The available storage capacity is higher than 230GB.",
            "15x faster than USB 2.0 drives; USB 3.1 Gen 1 / USB 3.0 port required on host devices to achieve optimal read/write speed; Backwards compatible with USB 2.0 host devices at lower speed. Read speed up to 130Mbps and write speed up to 30Mbps are based on internal tests conducted under controlled conditions , Actual read/write speeds also vary depending on devices used, transfer files size, types and other factors",
            "Stylish appearance,retractable, telescopic design with key hole",
            "High-quality NAND FLASH flash memory chips can effectively protect your data security",
            "Note: No integrated LED light indicator",
            "Note: FAT32 is the factory default drive format which is read/write compatible with Windows and Mac OS. If you are transferring a file size over 4GB, please reformat the drive to exFAT or NTFS."
        ],
        "description": "An Amazon Brand",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1292110011"
            },
            {
                "name": "USB Flash Drives",
                "link": "https://www.amazon.com/USB-Flash-Drives-Storage-Add-Ons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3151491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Amazon Basics"
            },
            {
                "name": "Item model number",
                "value": "‎LS21USB256G1"
            },
            {
                "name": "Item Weight",
                "value": "‎0.32 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.24 x 0.79 x 0.53 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎2.24 x 0.79 x 0.53 inches"
            },
            {
                "name": "Color",
                "value": "‎Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎Amazon"
            },
            {
                "name": "ASIN",
                "value": "‎B0B61DGG18"
            },
            {
                "name": "Country of Origin",
                "value": "‎Taiwan"
            },
            {
                "name": "Date First Available",
                "value": "‎November 14, 2022"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 9,579 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#271 in Our Brands (See Top 100 in Our Brands) #2 in USB Flash Drives"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "256 GB"
            },
            {
                "name": "Hardware Interface",
                "value": "USB 3.0, USB 2.0"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight"
            },
            {
                "name": "Read Speed",
                "value": "130 Megabytes Per Second"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BeachTV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQDLDJELET426THR3K3A65Z2T3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FA8NG258MF9H?ASIN=B0B61DGG18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Your Portable Data Powerhouse",
                "reviewText": "In the age of digital dominance, having a reliable and efficient storage solution is paramount. Enter the Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive, a portable data powerhouse that promises to securely store and transfer your important files. Join me as we explore the design, speed, durability, and overall value of this compact storage device that holds the key to your digital world.The design of the Amazon Basics USB Flash Drive is sleek and straightforward, prioritizing functionality and ease of use. Its compact size makes it highly portable, allowing you to conveniently carry it in your pocket or attach it to a keychain. The protective cap safeguards the USB connector when not in use, minimizing the risk of damage or dirt accumulation. While it may not boast extravagant aesthetics, the focus on simplicity and practicality is evident in the design.When it comes to speed, the Amazon Basics USB Flash Drive shines brightly. With USB 3.1 technology, it offers ultra-fast data transfer rates, ensuring that you can quickly move large files between devices. Whether you're backing up important documents, transferring media files, or working with high-resolution images, this flash drive accelerates the process, saving you valuable time. Say goodbye to sluggish transfers and embrace the swiftness of the digital age.Durability is an essential factor to consider in any storage device, and the Amazon Basics USB Flash Drive holds up well under everyday use. Constructed with sturdy materials, it can withstand the occasional bumps and jostles of daily life. The protective cap adds an extra layer of defense, preventing dust and debris from compromising its performance. While it's always wise to handle any electronic device with care, this flash drive can withstand the rigors of typical usage scenarios.In terms of value, the Amazon Basics USB Flash Drive delivers solid performance at an affordable price. With a generous storage capacity of 256GB, you'll have ample space to store your important files, photos, videos, and more. Its high-speed data transfer capabilities ensure efficient workflows, making it a valuable tool for students, professionals, and anyone in need of portable storage. Considering its reliability, speed, and capacity, this flash drive offers excellent value for money.While the Amazon Basics USB Flash Drive ticks many boxes, it's important to note that the design may not appeal to those seeking a more visually striking or unique storage device. Additionally, the absence of additional security features, such as encryption or password protection, may be a drawback for users handling sensitive information. It's advisable to consider your specific needs and preferences to ensure this flash drive aligns with your requirements.:The Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive offers a reliable and efficient storage solution for all your digital needs. Its sleek design, blazing-fast transfer speeds, and durability make it a practical choice for on-the-go professionals, students, and tech-savvy individuals. With its ample storage capacity, this flash drive becomes a trustworthy companion, freeing up space on your devices and providing peace of mind. Embrace the convenience and reliability of the Amazon Basics USB Flash Drive and unlock the power of portable data storage.",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AndrewAndrew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR3J6BNJN5S5RRXGCFEQNPPVNYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OINM4L4UNUU5?ASIN=B0B61DGG18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "5.0 out of 5 stars 128GB Ultra Fast USB 3.1 Flash Drive - Amazon Basics",
                "reviewText": "In the digital age, where time is of the essence and efficiency is key, the Amazon Basics 128GB Ultra Fast USB 3.1 Flash Drive emerges as a reliable solution for swift data storage and transfer. This review delves into the merits of this flash drive, highlighting its speed and performance.Right from the outset, the Amazon Basics Ultra Fast Flash Drive captures attention with its promise of speed. The USB 3.1 technology it employs sets the stage for an impressive data transfer experience, making it suitable for a range of applications, from simple file transfers to more complex tasks like archiving.One of the standout features of this flash drive is its remarkable data transfer speeds, reaching up to 10 Gbps. This speed represents a significant leap forward from the more conventional USB 2.0 drives, delivering nearly ten times the velocity. Whether you're moving large multimedia files or essential documents, the Amazon Basics Ultra Fast Flash Drive completes the task in the blink of an eye.Beyond speed, the flash drive's usability shines. Its plug-and-play functionality ensures easy integration with a variety of devices, eliminating the need for intricate setups or additional software installations. This user-friendly design caters to a diverse user base, from tech-savvy professionals to those seeking straightforward solutions.Quality isn't compromised for the sake of speed. The Amazon Basics Ultra Fast Flash Drive maintains the integrity of your data during transfers, ensuring that your files, images, and documents retain their original quality. This attribute makes it a versatile tool for both personal and professional use.In terms of efficiency, the flash drive's rapid data transfer becomes a significant time-saver. Whether you're a student needing quick access to study materials, a photographer transferring high-resolution images, or a business professional exchanging important files, the Amazon Basics Ultra Fast Flash Drive streamlines your workflow and optimizes productivity.To conclude, the Amazon Basics 128GB Ultra Fast USB 3.1 Flash Drive is more than just a storage device; it's a testament to the ever-evolving technology landscape. As technology continues to advance, tools like this flash drive bridge the gap between speed and reliability, catering to the demands of today's fast-paced world.While this review provides an overview of the flash drive's potential, it's important to remember that individual experiences may vary. Nonetheless, the Amazon Basics Ultra Fast Flash Drive sets a promising standard for what modern data storage and transfer solutions can achieve.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+mZVmyMaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+mZVmyMaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFAOOTX4XUADNNMYRYSAZRDDBFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMIL702U57XAO?ASIN=B0B61DGG18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Temporary Storage Solution",
                "reviewText": "After I began editing down large amounts of video footage into usable material I realized I needed an immediate solution so work could continue without me having to get a brand new storage drive for my computer. I purchased a few of these sticks and suddenly I can store over a terabyte of data.Easy to use plug and play functionality, does what it says on the box, and has pretty fast write and read speeds. Am I going to upgrade my work PC in the future to support multiple heavy duty storage drives? Yep. Do I have to spend hundreds of dollars doing it right this moment? No!Worth noting, this was the second high capacity flash drive I tried. Won't mention the other brand, but it was garbage. Write/read speeds were abysmal, and its true storage capacity was much less than it stated on the packaging. Also was around the same price as one of these. Save yourself the time and hassle and just grab as many of these little guys as you need for your data storage needs.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ajg3",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2024",
                "reviewTitle": "Great",
                "reviewText": "This is a really nice usb! Very happy with its read/write speed. So far it’s great!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V.Suganya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 29, 2024",
                "reviewTitle": "Amazon Basic Universal Service Bus 128gb (3.1)",
                "reviewText": "In the age of digital dominance, having a reliable and efficient storage solution is paramount. Enter the Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive, a portable data powerhouse that promises to securely store and transfer your important files. Join me as we explore the design, speed, durability, and overall value of this compact storage device that holds the key to your digital world. The design of the Amazon Basics USB Flash Drive is sleek and straightforward, prioritizing functionality and ease of use. Its compact size makes it highly portable, allowing you to conveniently carry it in your pocket or attach it to a keychain. The protective cap safeguards the USB connector when not in use, minimizing the risk of damage or dirt accumulation. While it may not boast extravagant aesthetics, the focus on simplicity and practicality is evident in the design. When it comes to speed, the Amazon Basics USB Flash Drive shines brightly. With USB 3.1 technology, it offers ultra-fast data transfer rates, ensuring that you can quickly move large files between devices. Whether you're backing up important documents, transferring media files, or working with high-resolution images, this flash drive accelerates the process, saving you valuable time. Say goodbye to sluggish transfers and embrace the swiftness of the digital age. Durability is an essential factor to consider in any storage device, and the Amazon Basics USB Flash Drive holds up well under everyday use. Constructed with sturdy materials, it can withstand the occasional bumps and jostles of daily life. The protective cap adds an extra layer of defense, preventing dust and debris from compromising its performance. While it's always wise to handle any electronic device with care, this flash drive can withstand the rigors of typical usage scenarios. In terms of value, the Amazon Basics USB Flash Drive delivers solid performance at an affordable price. With a generous storage capacity of 256GB, you'll have ample space to store your important files, photos, videos, and more. Its high-speed data transfer capabilities ensure efficient workflows, making it a valuable tool for students, professionals, and anyone in need of portable storage. Considering its reliability, speed, and capacity, this flash drive offers excellent value for money. While the Amazon Basics USB Flash Drive ticks many boxes, it's important to note that the design may not appeal to those seeking a more visually striking or unique storage device. Additionally, the absence of additional security features, such as encryption or password protection, may be a drawback for users handling sensitive information. It's advisable to consider your specific needs and preferences to ensure this flash drive aligns with your requirements.: The Amazon Basics 256GB Ultra Fast USB 3.1 Flash Drive offers a reliable and efficient storage solution for all your digital needs. Its sleek design, blazing-fast transfer speeds, and durability make it a practical choice for on-the-go professionals, students, and tech-savvy individuals. With its ample storage capacity, this flash drive becomes a trustworthy companion, freeing up space on your devices and providing peace of mind. Embrace the convenience and reliability of the Amazon Basics USB Flash Drive and unlock the power of portable data storage.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Docpatch_06",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 29, 2024",
                "reviewTitle": "Très bonne clé",
                "reviewText": "Toute simple. Elle fait ce qu’on lui demande. Un bon rapport qualité prix",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RFP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 25, 2024",
                "reviewTitle": "Memoria económica",
                "reviewText": "Los productos de marca blanca de Amazon siempre son una garantía de calidad, puede que no ofrezcan el mejor resultado, pero no serán malos. En este caso tenemos una memoria de 256gb fabricada en Taiwán. El embalaje es muy sencillo, estando la memoria encajada en un pequeño blíster de plástico blanco, que a su vez esta insertado en una cajita de cartón, todo ocupando muy poco y relativamente minimalista. El acabado del pendrive es de plástico pero bien rematado y aunque está hecha de materiales sencillos y baratos, se siente de calidad. En este aspecto no hay pega. La memoria es retráctil, teniendo un botón deslizante que al presionar y mover hacia delante asoma el conector USB y presionando el botón hacia atrás oculta el conector USB. Como se habrá visto en las fotos este conector es de tipo USB-A. No he tenido ningún problema de sobrecalentamiento. En cuanto a las velocidades USB 3.1, la velocidad de lectura es elevada, no así la de escritura. Normalmente inicia la escritura a una velocidad relativamente elevada, pero tras unos 10-15 segundos decae de forma notoria. En fin, por el precio no está mal. No es de una calidad y prestaciones excepcionales, pero por apenas 20€ a finales del 2023 tienes 256gb, que da para bastante.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luca SecciLuca Secci",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 22, 2024",
                "reviewTitle": "Storage di qualità, ottimo prezzo",
                "reviewText": "Amazon Basics ancora una volta propone un ottimo oggetto ad un ottimo prezzo. Avevo bisogno di una chiavetta USB dalle ottime prestazione e con una capacità di notevoli dimensioni. Questa chiavetta fa tutto questo e ad un ottimo prezzo. Difatti supporta il protocollo usb 3.1 e ci permette operazioni di lettura e scrittura grandi velocità consentendo così lo scambio di dati in maniera veloce. Inoltre è molto solida e sembra destinata a durare nel tempo.Prodotto TOP!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ursAj9Z5L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61lNAJviLoL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}