{
    "remaining_requests": 45108,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Silicon-Power-Portable-External-Waterproof/dp/B00KF4E83G",
    "body": {
        "name": "Silicon Power 2TB Rugged Portable External Hard Drive Armor A80, Waterproof USB 3.0 for PC, Mac, Xbox and PS4, Blue",
        "price": "$74.99",
        "originalPrice": "",
        "rawPrice": 74.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Silicon-Power-Portable-External-Waterproof/dp/B00KF4E83G",
        "soldBy": {
            "sellerID": "A25SITGFW0OQJA",
            "name": "Silicon Power USA Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A25SITGFW0OQJA&asin=B00KF4E83G&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41l6OTAvZOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41qynC5cfiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Ygzd0NB2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VCMpgEB3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516qbIVVrdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51IXgQMklEL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71gymqV8BjS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1p2I4om9sS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SP Silicon Power Store",
            "link": "https://www.amazon.com/stores/SPSiliconPower/page/E524BFD5-6C66-41F6-9C0F-997EB4A22A45?ref_=ast_bln"
        },
        "brand": "SPSiliconPower",
        "merchantInfo": "Silicon Power USA Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 641,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Wednesday, February 14. Order within 17 hrs 26 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Work with Ideal for gaming enthusiasts Xbox One, Xbox 360, PS4, PS4 Pro and PS4 Slim (PS4 System Software version 4.50 or higher).",
            "Military-grade shockproof and IPX7 waterproof protection. Sturdy aluminum casing enables high pressure-resistant function to withstand up to 300 kg of force.",
            "Cable storage design for simple cable carrying.",
            "USB 3.1 Gen 1 interface, backward compatible with USB 3.0/USB 2.0",
            "3 year manufacturer warranty. (Please register your product via SP official website to get the complete manufacturer warranty services, product support and more.)"
        ],
        "description": "Military-grade Shockproof, IPX7 Waterproof and Pressure-resistant Protections Armor A80 incorporates heavy-duty aluminum casing, interior rubber sealing and internal suspension system which altogether assure rigid protections against any unexpected situations such as rain, liquid-spillage or accidental drops.Cable-carry design The innovative slot design is especially equipped for simple cable carrying and storing by which you can easily stick the cable to the drive.Sturdy and Stylish Metallic Casing Armor A80 is equipped with the aluminum exterior which can not only provide strong protection against outer pressure but also show the trendy look that complements your fashion style on-the-go.Ultra-fast Transfer Speed SuperSpeed USB 3.0 interface enables blazing-fast speed performance to quickly transfer large files including HD videos, high-resolution photos and great numbers of documents in seconds.3-year Warranty The Armor A80 is backed by a 3-year warranty that guarantees complete services and technical support.Box Contains 1 x Silicon Power Armor A80 External Hard Drive 2 x USB 3.0 Cable (107 mm & 550 mm)",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Data Storage",
                "link": "https://www.amazon.com/Memory-Cards-External-Storage/b?ie=UTF8&node=1292110011"
            },
            {
                "name": "External Hard Drives",
                "link": "https://www.amazon.com/External-Hard-Drives-Storage-Add-Ons/b?ie=UTF8&node=595048"
            }
        ],
        "productInformation": [
            {
                "name": "Hard Drive",
                "value": "‎2 TB Portable"
            },
            {
                "name": "Brand",
                "value": "SP Silicon Power"
            },
            {
                "name": "Series",
                "value": "‎Armor A80"
            },
            {
                "name": "Item model number",
                "value": "‎SP020TBPHDA80S3B"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC, Mac"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 10/8.1/8/7/Vista/XP, Mac OS 10.5.x, Linux 2.6.x"
            },
            {
                "name": "Item Weight",
                "value": "‎10.3 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.5 x 3.7 x 0.7 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎5.5 x 3.7 x 0.7 inches"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Flash Memory Size",
                "value": "‎2"
            },
            {
                "name": "Hard Drive Interface",
                "value": "‎USB 3.1"
            },
            {
                "name": "Manufacturer",
                "value": "‎Silicon Power"
            },
            {
                "name": "ASIN",
                "value": "‎B00KF4E83G"
            },
            {
                "name": "Country of Origin",
                "value": "‎Taiwan"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎May 19, 2014"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 641 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#722 in External Hard Drives"
            },
            {
                "name": "Digital Storage Capacity",
                "value": "2 TB"
            },
            {
                "name": "Hard Disk Interface",
                "value": "USB 3.1"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Special Feature",
                "value": "Shock Resistant"
            },
            {
                "name": "Hard Disk Form Factor",
                "value": "2.5 Inches"
            },
            {
                "name": "Hard Disk Description",
                "value": "Portable"
            },
            {
                "name": "Compatible Devices",
                "value": "Gaming Console"
            },
            {
                "name": "Installation Type",
                "value": "External Hard Drive"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mike T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSOR7C6WFVDRD2YGO7YQ72GRS4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35JRK7NA7YZP0?ASIN=B00KF4E83G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2015",
                "reviewTitle": "5.0 out of 5 stars Durable, Fast, Convenient, Quality Drive at a Reasonable Price",
                "reviewText": "I went shopping to replace an old drive that had died, hoping to find something more durable from the same brand. I found this one instead. It offered better features in roughly the same price range. Though I hesitated, because I didn't recognize the brand, I'm very glad I made the purchase. I am very impressed with this drive. It is fast, durable, and travels well.I've not yet dropped it or gotten it wet, but I generally treat my external hard drives more roughly than I probably should. They are my link between multiple computers in different locations, so I carry them around from place to place, transferring them to and from backpacks, briefcases, and other bags without much care for cushioning. This drive always plugs in and is instantly recognized, on both my Mac and PC.It also comes with two cables. A short one fits inside a compartment on one side of the drive and goes everywhere you take the drive. I like this, because it means there's not separate cable to pack. The longer one is useful if you don't want to drive directly alongside you computer, but it has to be carried separately. There is also an rubber cover that protects the USB port.I've already recommended this drive to friends, and I'm recommending it here. If it holds up as well and long as I think it will, Silicon Power drives will probably become our new hard drives of choice across the board.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bucuros",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6A77VLMPKGGTOEHLTLMB75M4DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F7FMVF78AVSK?ASIN=B00KF4E83G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2020",
                "reviewTitle": "5.0 out of 5 stars Solid hard drive",
                "reviewText": "I've bought 3 of these (a 1 TB version and two of the 2 TB versions). After so many failures with WD and Seagate hard drives, I decided I needed something more \"sturdy.\" I've dropped one of these a couple of times on my hardwood floors (just a couple of feet from coffee table height) and unlike my earlier WD and Seagate hard drives, these little guys kept trucking along. I've been using 2 of these for the past 5 years and 1 of these for the past 4 years and none of my 3 have yet to fail. I'm sure that they will fail one of these days (that's what all hard drives do eventually), so that's why I duplicate my backups among these 3 hard drives (with more backups in the cloud just in case). I use the 1 TB version as a time capsule backup for my Mac and the other two 2 TB hard drives get used for long term backup, all encrypted of course (my files are duplicated on both so that when one hard drive fails, I still have a backup for my backup). Yes, I am paranoid about my data.I am surprised by all of these reviews that complain about losing a ton of data because their hard drive failed one day. Of course your hard drive will eventually fail. You have to have a backup for your backup because all hard drives will eventually fail at some point. If you don't have a backup for your backup, you are playing with fire! Remember, it's not a question of whether your hard drive will fail, but rather, it's a question of when.Anyways, to make a long story short, these suckers seem a good bit more reliable than my prior experiences with those cheap Western Digital and Seagate drives.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff B. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7TZMPSEDMP2ZJ6LWBGLXEPYY7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R246F8HQZRPLUS?ASIN=B00KF4E83G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2014",
                "reviewTitle": "5.0 out of 5 stars Great drive, very tough, very fast, contains both cables. Can't beat it!",
                "reviewText": "Many people have written about the drive characteristics of this wonderful device, so I won't. I'll simply say that this drive absolutely rocks in all aspects. Very rugged, and the cable plugs into the device in a VERY solid, snug, reliable manner, as it uses the full sized USB connectors on both ends. The shorter cable can be stored on the device, which is extremely handy. It does come with both lengths of cable - thanks for that!Long story short, I have no complaints at all. The only little thing is that the surface is a little slick - I'd prefer a non-slip cover to the gorgeous blue anodized metal cover. And it is gorgeous! I get comments on it all the time. The design and appearance belies the toughness of this little beauty. Don't let this scare you off - it's just a little less \"grippy\" than I would prefer. No big deal unless you are using it while literally hanging 40 feet off the ground.Great drive, very tough, very fast, contains both cables. Can't beat it!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad Hutchinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFDLICGKMDQRQVGVXZOHPWT2Y3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I0MIFTE551LT?ASIN=B00KF4E83G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2014",
                "reviewTitle": "5.0 out of 5 stars Excellent hard drive with no issues so far",
                "reviewText": "Purchased this to mirror my Seagate 5TB 3.5\" desktop external hard drive which has about 1 TB of data on it. There were two concerns I had when deciding whether to get this drive or not and both were unwarranted. One thing I was worried about was cooling capabilities since this has no type of fan or way to keep cool, but this drive stays cooler than any other external hard drive I have owned. If I am transferring things from my Seagate drive to this or vice versa the Seagate drive heats up to a toasty 95 degF while the Silicon Power never goes above 80 degF. I've had the Silicon Power drive connected at work for 8+ hours a day for the past week and it has never gotten hot yet. Another worry I had was that the USB cable in the product photo looks ridiculously short (it is) but when it arrived I found out the drive comes with another USB cable that is about 3 feet long as well. The short USB stays in the notch on the side of the drive for times when you don't want to carry around the longer cable. Small size, waterproof, dropproof, stays cool, and works with no issues so far I have no complaints.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tahir Raines",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY5AQHWQR3XOFNF3IC6UW4WUSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LK1VOP2E1FAD?ASIN=B00KF4E83G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazingly durable",
                "reviewText": "This is a fantastic external hard drive and I am sorry it's no longer available to buy. Out of the silicon power hard drives I've had, this alone has kept up with quality without a decrease in performance despite me banging it way more than the several others I bought throughout the years.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara D. G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6N3FYBO5P6NI7A3ST3RV63PSVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4GDDSN7XR78J?ASIN=B00KF4E83G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 14, 2016",
                "reviewTitle": "5.0 out of 5 stars Furiously Fast and Fine Featured!",
                "reviewText": "I plan to take this as a storage device for my photos as a companion to my laptop when we visit another country known for extremely high humidity, bad roads, sandy beaches and very wet conditions during the rainy season, and it is small, compact, and rugged. It is also my backup drive the rest of the time. Before you start loading all your files on it, be sure to check to see how it has been formatted. If it is a FAT 32, reformat it to NTFS so you can have the greater USB 3 speed. (Right click and choose Properties - General - File system to see) Incredibly fast! I love the attached cable for use on the road, but it comes with a longer one as well. To keep it clean, I LOGICally bought a portable EVA hard drive case just for extra protection from backpack lint and sand.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SAMPECH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 22, 2018",
                "reviewTitle": "EXCELENTE PRODUCTO",
                "reviewText": "Lo compre pues necesitaba mas espacio de almacenamiento y seguridad en el respaldo de la información y resultoperfecto aunque he ocupado mas de un 1TB la búsqueda de información es rápida y fluida, me gusta sus dos cables que traeel largo es útil para pc de escritorio y el corto muy útil y estético para uso en una lap top, se siente fuerte y resistente la tapa de laentrada usb se siente que sella muy bien, lo recomiendo ampliamente para los que buscan espacio en memoria, fluides en los archivos y sobre todo presentación pues el diseño es elegante, un accesorio que lo complementa de maravilla es el Drive Logic DL-64 Portable EVA Hard Drive...queda a la perfección y útil para guardar el cable largo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BDS1953",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 21, 2018",
                "reviewTitle": "Good, solid, reliable drives.",
                "reviewText": "Disk included a very short USB3 connector seen in the photo as well as a longer 18\" cord. The short cord would not be long enough to plug into my PC to transfer data regardless but would be OK for a laptop. I haven't had time to load it up yet though. I bought this as a companion to my Armor A30 which has been very good so far. There is an exe file on the disk to take you to the warranty registration site.Update: I have had this drive for a year and it continues to work great. We loaded a pile of movies/music/photos on it for portable use and also to plug directly into our Bluray player.Further update: I have purchased another 1TB drive this time as a Christmas gift which I preloaded with several MP4 movies for our grandkids. Update: Drive still works fine after 5+ years.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 2, 2023",
                "reviewTitle": "fast writing",
                "reviewText": "I only have it for 2 weeks so far so good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriaan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 7, 2023",
                "reviewTitle": "A robust external HDD.",
                "reviewText": "I needed a safe and secure HDD to store my laptop backups on and this device provides all that I want in a HDD.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 27, 2016",
                "reviewTitle": "AMAZING HARD DRIVE!",
                "reviewText": "After experiencing a hard drive failure with a cheap WD hard drive earlier in the year, I wanted make sure my next hard drive was going to be one that I could store my data on confidently. This lead me to this Silicon Power A80 external drive. When it came in earlier today I was blown away by how amazing its design and build quality is. Some of the cool design features on this are its usb cord slot which keeps the transfer cord snug next to your hard drive at all times. This was amazing for me since I always travel with my hard drives and I found myself always rummaging through a bunch of cords to find the proper USB cord. On the other side of the drive is the USB slot itself which has a waterproofing cover which certainly supports the company's claims that this device is waterproof.This drive is also really fast comparing to other drives I've used. I just transferred around 110GB and it only took about 15 minutes.Overall, I'm really impressed and have a lot of confidence in this hard drive. Based on how my experience continues with this drive in the coming months I can 100% see myself buying more of these.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}