{
    "remaining_requests": 48217,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Certified-Refurbished-Kindle-2022-release/dp/B09JRPMQ58",
    "body": {
        "name": "Certified Refurbished Amazon Fire HD 8 tablet, 8” HD Display, 32 GB, 30% faster processor, designed for portable entertainment, (2022 release), Black",
        "price": "$54.99",
        "originalPrice": "$84.99",
        "rawPrice": 54.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Certified-Refurbished-Kindle-2022-release/dp/B09JRPMQ58",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C9145Z6G"
        ],
        "asinVariationValues": [
            {
                "asin": "B09JRPMQ58",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01sdb5RX04L._SS36_.jpg"
            },
            {
                "asin": "B09JRXP2MS",
                "variationName": "Color",
                "variationValue": "Denim",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01gl0Fe+UCL._SS36_.jpg"
            },
            {
                "asin": "B09JS5X7DZ",
                "variationName": "Color",
                "variationValue": "Rose",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01xyc7bkoEL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "6",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bK9IB6pNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ctbG4VroL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Q-27FwEOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51y2gcezz8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Jk2XfxFaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51znPaBDROL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-AiskMchL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 403,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 6 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "A Certified Refurbished Fire HD 8 tablet (2022 release) is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device. Certified Refurbished Amazon devices may be packaged in generic Amazon-branded boxes.",
            "Enhanced performance - Updated hexa-core processor for more responsive performance (up to 30% faster than previous gen Fire HD 8).",
            "All day battery life - Up to 13 hours of reading, browsing the web, watching videos, and listening to music at home and on-the-go.",
            "Stream or download your favorite shows and movies from Prime Video, Netflix, Disney+, and HBO. Enjoy your favorite content from Facebook, Hulu, Instagram, TikTok, and more through Amazon’s Appstore (Google Play not supported. Subscription for some apps required).",
            "Fire HD 8 offers 8\" HD display and 2 GB RAM. Choose from 32GB or 64GB (up to 1TB of expandable storage via microSD card). New design is thinner and lighter than previous gen. Screen made with strengthened aluminosilicate glass. As measured in tumble tests, Fire HD 8 is twice as durable as Apple iPad mini (2021).",
            "Stay connected with family and friends - ask Alexa to make video calls to friends and family or download apps like Zoom.",
            "Do more with Alexa - Ask Alexa to listen to music, get news and weather, update shopping lists, and set reminders. Control your smart home, or ask Alexa to make video calls to friends and family with apps like Zoom.",
            "Amazon Kids offers easy-to-use parental controls on Fire tablets. Subscribe to Amazon Kids+ for access to thousands of books, popular apps and games, videos, songs, Audible books, and more."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Display",
                "value": "8” high-definition touchscreen; 1280 x 800 resolution at 189 ppi, HD video playback, with IPS (in-plane switching) technology"
            },
            {
                "name": "Size",
                "value": "7.94” x 5.40” x 0.37” (201.90mm x 137.34 mm x 9.60 mm)"
            },
            {
                "name": "Weight",
                "value": "11.88 ounces (337 grams) Actual size and weight may vary by configuration and manufacturing process"
            },
            {
                "name": "CPU & RAM",
                "value": "Hexa-core 2.0 GHz with 2 GB of RAM"
            },
            {
                "name": "Storage",
                "value": "32 GB (25.2 GB available to user) or 64 GB (54.5 GB available to user) of internal storage. Add microSD slot for up to 1 TB of additional storage. Some apps may require that they are installed on internal storage. App or feature updates may impact available storage."
            },
            {
                "name": "Battery life",
                "value": "Up to 13 hours of reading, browsing the web, watching videos, and listening to music. Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content. Certain software features or apps may reduce battery life."
            },
            {
                "name": "Charge time",
                "value": "Fully charge in under 5 hours using the USB-C cable and 5W power adapter included in the box. Fully charge in under 3 hours with 9W adapter (sold separately), and under 2.5 hours with 15W adapter and USB type C to C cable (adapter and cable sold separately)"
            },
            {
                "name": "wifi connectivity",
                "value": "Dual-band wifi. Supports public and private wifi networks or hotspots that use the dual-band 802.11a/b/g/n/ac standards with support for security standard of WEP, WPA3 OWE, WPA/WPA2/WPA3 Personal and WPA/WPA2/WPA3 Enterprise. Wi-Fi 6 (802.11 ax) is currently not supported."
            },
            {
                "name": "Ports",
                "value": "USB-C (2.0) connector for charging; microSD slot for external storage."
            },
            {
                "name": "Audio",
                "value": "3.5 mm stereo jack and integrated speakers; external volume controls"
            },
            {
                "name": "Sensors",
                "value": "Accelerometer, ambient light sensor"
            },
            {
                "name": "Camera specs",
                "value": "2 MP front-facing and 2 MP rear-facing cameras with 720p HD video recording"
            },
            {
                "name": "Localization services",
                "value": "Location-based services via wifi"
            },
            {
                "name": "Available colors",
                "value": "Black, Denim, Rose"
            },
            {
                "name": "Bluetooth",
                "value": "Built-in Bluetooth 5.2 with support for A2DP compatible stereo headphones, speakers, microphone, and LE accessories support"
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility. • VoiceView screen reader enables access for customers who are blind or visually impaired. • Screen Magnifier enables customers to zoom in/out, and pan around the screen. • Tap to Alexa enables access to Alexa via touch, instead of speech, through on-screen tiles or a keyboard, including the ability to save your favorite actions. • Switch Access enables access for customers who have motor impairments, and are unable to touch the screen, via compatible Bluetooth devices. • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Fire tablet Accessibility features also include settings for Closed Captioning, Font Size, Display Size, High Contrast Text, Color Inversion, Color Correction, and Convert Stereo to Mono audio. (Captions are not available for all content.)"
            },
            {
                "name": "Warranty and service",
                "value": "90-day limited warranty and service included. and service included. This device receives the same limited warranty as a new device. Learn more about Certified Refurbished Amazon devices. Use of Kindle tablet is subject to Amazon's Conditions of Use and these terms."
            },
            {
                "name": "Included in the box",
                "value": "Fire HD 8 tablet, USB-C (2.0) cable, 5W power adapter, and Quick Start Guide"
            },
            {
                "name": "Generation",
                "value": "12th generation - 2022 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire tablet, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Blen Michael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7SWUKYKZ2Z2G2CUDDRC5Y5NVMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U00AKTSU8XIK?ASIN=B09JRPMQ58",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Real HD screen",
                "reviewText": "A very good tablet. I returned the 7 and got this one to see if this one was better,day and night. Bigger and real HD screen. I use it now every day. The battery life is acceptable too. The only drawback is Amazon misses so many apps that I wish they had.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justin Nethercutt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHS47JEDQR4SGTQEJKAHEJEQHWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12E5C5CQW7FL0?ASIN=B09JRPMQ58",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Buy!",
                "reviewText": "I was very pleased with this tablet! Looks brand new and runs great. Would definitely buy again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L. Meyers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHRQU5CEZSJD33VJ27AYJQ3MHUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R302KMWJ0V66PJ?ASIN=B09JRPMQ58",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Great tablet!",
                "reviewText": "I mounted it on my spin cycle and it works great for watching spin classes! Easy to use and it pretty much connected itself.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter Mihelis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL5YHZYS6DTEKCQP65TBURZJBEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJY2Z8Z7KZ6SV?ASIN=B09JRPMQ58",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Not bad but...",
                "reviewText": "For the price, it's fine. Comes pre-loaded with apps you cannot remove or uninstall. You cant download from Google play so unless the Amazon app store has what you want, you're out of luck. Also, it's really slow.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Georgiana Jean",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXX7P2NXLEPXGJLTZAU75KVTL2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R290K5JU6G7YHC?ASIN=B09JRPMQ58",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars These are perfect for Mama's with young kids!",
                "reviewText": "I can't recommend this product enough! You'd never know that it wasn't brand new and that it's a refurbished product.I got this for my soon to be 3-year-old sons Christmas. I've been using it and setting it up for him and have had no issues whatsoever. This was an awesome choice for a first tablet for him because it was half the price of the kids fire 7, and there are tons of kids cases on Amazon that you can purchase to turn it into a bigger version of the kids Fire 7 except bigger and for a fraction of the price.I always buy my kids fire tablets, my 17-year old and 14-year-old kids also got fire tablets for Christmas as their first devices when they were 3 and 6 and they loved them.They really are a perfect choice for kids who are a little younger. I don't see the point in buying an expensive tablet for a toddler or young child when these work just as well and I actually prefer them for kids for several reasons, not least of which is Kids+ and the ability to link everything with my Amazon account so easily. We can access their Kindle books, the shows they like to watch on prime, and everything else. I like the parental controls as well. It's just a really seamless experience for a first tablet or device for a child. I can set limits and enforce quiet hours while still having something portable to take on errands and trips and for his limited screen time at home. He loves to play learning games on my phone and read books on my Kindle as well as watch Monster Jam and dirt bike kids videos on YouTube and watch his shows. So I know he'll be so excited to unwrap his gifts on Christmas morning to find that Santa has brought him the \"big phone\" he asked for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gayle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKB3W6WS3CJIHJJNJUBJGG63NGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RICI1ZVZ9L2P6?ASIN=B09JRPMQ58",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars So far so good",
                "reviewText": "Ordered this to play slot games on. It looks like a new tablet, no scratches etc. packaged carefully. No problems so far. For the money I believe I got a good deal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Babz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR3HEFBJC47OIJ7MDFP7XBQ6X5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL71WM2UI53CB?ASIN=B09JRPMQ58",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "1.0 out of 5 stars NO STAR EARNED! LOUSY Customer Care and FAULTY product! HELP",
                "reviewText": "TOTAL Malfunctioning device. Returned and have had NO RESPONSE from Amazon. I am VERY disappointed in lack of response. Finding any HELP is non existent. All I have now is a charge on my CC for the device, case and screen protector. All returned with label provided, and a proof of delivery statement.DEFINITELY what I cannot afford on a fixed income. HELP",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ron Doyle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2BIJCEX55KBLNKC2FDUGTPH62A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I2U9C38IB408?ASIN=B09JRPMQ58",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "Bought for a Christmas gift for daughter she loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}