{
    "remaining_requests": 48196,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fire-Tablet-7/dp/B07FKR6KXF",
    "body": {
        "name": "Fire 7 tablet, 7\" display, 16 GB, (2019 release), Black",
        "price": "$25.56",
        "originalPrice": "",
        "rawPrice": 25.56,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fire-Tablet-7/dp/B07FKR6KXF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07N8VFFNS"
        ],
        "asinVariationValues": [
            {
                "asin": "B07FKR6KXF",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Jf2WSLlyL._SS36_.jpg"
            },
            {
                "asin": "B07HZQBBKL",
                "variationName": "Color",
                "variationValue": "Plum",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21AMAOJaAEL._SS36_.jpg"
            },
            {
                "asin": "B07HZHCDQG",
                "variationName": "Color",
                "variationValue": "Sage",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21zb6iFssKL._SS36_.jpg"
            },
            {
                "asin": "B07HZHJGY7",
                "variationName": "Color",
                "variationValue": "Twilight Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21touYZh2QL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 9 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wY L okXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41NL0pbMneL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/614wVPzh-eS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wnK5m1vfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61QJXpSm52S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DsfGxzdJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51q3FuWbaFL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 252147,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 5 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "7\" IPS display; 16 or 32 GB of internal storage (add up to 512 GB with microSD)",
            "Faster 1.3 GHz quad-core processor",
            "Up to 7 hours of reading, browsing the web, watching video, and listening to music",
            "Hands-free with Alexa, including on/off toggle",
            "1 GB of RAM",
            "2 MP front and rear-facing cameras with 720p HD video recording",
            "Stay on track – Check email, make video calls, update shopping lists, and set reminders. Use your favorite apps like Zoom, Outlook, and OneNote",
            "90-day limited warranty",
            "Enjoy your favorite apps like Netflix, Facebook, Hulu, Instagram, TikTok, and more through Amazon’s Appstore (Google Play not supported)"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Display",
                "value": "7” touchscreen, 1024 x 600 resolution at 171 ppi, SD video playback, with IPS (in-plane switching) technology and advanced polarizing filter"
            },
            {
                "name": "Size",
                "value": "7.6” x 4.5” x 0.4” (192 x 115 x 9.6 mm)"
            },
            {
                "name": "Weight",
                "value": "10.1 ounces (286 grams) Actual size and weight may vary by configuration and manufacturing process."
            },
            {
                "name": "CPU & RAM",
                "value": "Quad-Core 1.3 GHz with 1 GB of RAM"
            },
            {
                "name": "Storage",
                "value": "16 GB (9.4 GB available to user) or 32 GB (23.6 GB available to user) of internal storage. Add microSD card for up to 512 GB of additional storage. Some apps may require that they are installed on internal storage. App or feature updates may impact available storage."
            },
            {
                "name": "Battery life",
                "value": "Up to 7 hours of reading, browsing the web, watching video, and listening to music. Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content. Certain software features or apps may reduce battery life."
            },
            {
                "name": "Charge time",
                "value": "Fully charges in approximately 4 hours using the micro-USB power adapter included in the box."
            },
            {
                "name": "Processor",
                "value": "MediaTek 8163"
            },
            {
                "name": "Wifi connectivity",
                "value": "Single-antenna dual-band wifi. Supports public and private wifi networks or hotspots that use the dual-band 802.11a, 802.11b, 802.11g, or 802.11n standard with support for WEP, WPA, and WPA2 security using password authentication; does not support connecting to ad-hoc (or peer-to-peer) wifi networks. WiFi 6 (802.11 ax) is not currently supported."
            },
            {
                "name": "4G connectivity",
                "value": "N/A"
            },
            {
                "name": "Ports",
                "value": "USB 2.0 (micro-B connector) to connect to a PC/Macintosh computer, or to charge your device with the included power adapter; microSD slot for external storage"
            },
            {
                "name": "Audio",
                "value": "3.5 mm stereo jack and integrated speaker"
            },
            {
                "name": "Sensors",
                "value": "Accelerometer"
            },
            {
                "name": "Camera specs",
                "value": "2 MP front and rear-facing cameras with 720p HD video recording"
            },
            {
                "name": "Location services",
                "value": "Location-based services via wifi"
            },
            {
                "name": "Available colors",
                "value": "Black, Twilight Blue, Plum, Sage"
            },
            {
                "name": "Additional features",
                "value": "External volume controls, built-in Bluetooth with support for A2DP compatible stereo headphones, speakers, microphone, and LE accessories support"
            },
            {
                "name": "Accessibility features",
                "value": "VoiceView screen reader enables access to the vast majority of Fire tablet features for users who are blind or visually impaired using text-to-speech or a connected refreshable braille display. Screen magnifier enables viewers to zoom in and out, and pan around the screen. Fire tablets also include accessibility settings for Closed Captioning, Font Size, High Contrast Text, Color Inversion, Color Correction, and Convert Stereo to Mono audio. (Captions are not available for all content). Learn more about it here"
            },
            {
                "name": "Warranty and service",
                "value": "90-day Limited Warranty and service included. Optional 1-Year, 2-Year and 3-Year Extended Warranty available for U.S. customers sold separately. Use of Fire 7 tablet is subject to Amazon's Condition of Use and these terms."
            },
            {
                "name": "Included in the box",
                "value": "Fire 7 tablet, USB 2.0 cable, 5W power adapter, and Quick Start Guide"
            },
            {
                "name": "Generation",
                "value": "9th generation - 2019 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "bcbeads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOFDZ2SASUPURJHF4NTICTLSBPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36ALPBAMCQP4J?ASIN=B07FKR6KXF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2021",
                "reviewTitle": "5.0 out of 5 stars It is a joy to use.",
                "reviewText": "I got this new Fire 7 9th generation KIndle to replace my original 5th generation model which has been behaving weirdly and annoyingly lately. So far, all is good. It boots up fast, it doesn't randomly decide I have not read a book that I am currently halfway through, and refuse to open to the last page I read. It does not give me messages that my internal storage is low, even though I have basically nothing there except what came pre-installed; and I put in a 32 gig SD card which has tons of space on it. So I was getting more annoyed by the day with the old Fire. This new one, I have not even put an SD card in it, as I got one with the 32 gig storage capacity. When I look at the storage in the new model, almost none of it is used, even with all the junk that comes pre-installed. I may not ever add an SD card, if it keeps working properly without it. It seems to work the same way as the older model, with regard to turning pages, going to the hoe page, flipping to the store to buy a book, I am not happy with the \"upgrade\" in the software that was plopped into the old one, and which came with the new one. I find it a little harder to actually find what I am looking for in my library with the new supposedly easier program. But I guess I will live with it. I give the touch screen 4 stars because it is either too sensitive or not sensitive enough, and that may just be my fingers. No touch screen works right for me, never mind the device. I do not use Alexa, have no idea hay it is good for, and don't plan to learn. But I gave the same model Fire to a friend who loves Alexa and uses it constantly, and says it works great. So I am happy that it is a useful feature for someone.All in all, I think KIndle is the best thing. Ten years ago I moved to Ghana, and the only book store in my town is a backpacker used book store, that runs heavy with romance novels and scifi in German. I was buying books from Amazon when I visited family in the US, and carrying them back, an incredible waste of weight in my luggage which could be put to better use. I started chatting up a KIndle user in the airport one day, and got my first black and white, KIndle, the one with the physical keyboard, as soon as I got to my sister's house some 18 hours later. It is a joy to have something so light weight, so easy to turn the pages, so easy to buy new books. I appreciate it more as the years go by and the arthritis in my thumbs and wrists gets worse, and holding an actual book becomes painful. So for many reasons I am a great fan of the Kindle. I like that I can get movies and TV series via Amazon Prime, and the screen on the Kindle Fire is excellent, clear, with good color and contrast.. So if you are still wondering whether it is better to buy the Kindle Fire, or just download the reading app on your cell phone, get the Fire. The price is excellent.And by the way, I have friends who have the Kids version of Kindle Fire, and it seems to be a war horse, gets dropped, lays on the floor, gets fought over by siblings, has a ton of educational stuff on it, and some clever games that promote learning skills like sequencing. For 2 year olds, there are all kinds of things with basic preschool material available. And I actually think using the device promotes hand-eye coordination. So yes! Go Kindle!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JAS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI3RAP4MNGQ4J75FJOEKPXE2XAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U05JM2TT19BZ?ASIN=B07FKR6KXF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2019",
                "reviewTitle": "5.0 out of 5 stars Awesome Product!!!",
                "reviewText": "First and foremost, FOR THIS PRICE is a great product!! Unbeatable, I must say; it's a lot more that you can expect!! I am surprised this thing is such a high quality product for just few bucks (I bought mine on eBay for $39,99, but later I found it's the same price here at Amazon).AMAZON x100: It is true its operation is 100% based on a Amazon environment, and that its Android OS is a special version (with some limitations); however I use Amazon store and services a lot, so that does not bother me at all. The inconveniences that are annoying for me I have overcome them satisfactorily...TRILLIONS OF ICONS: For example there are tons of Amazon App icons in the main screen that I don't use, and the app they belong to cannot be uninstalled (or at least I haven't found the way to do it). Well you can stop their services so they don't use tablet's resources, and occupy less memory and space that way; but the icons are still there. Also, they are not allowed to be stored in a folder (by long pressing each icon) so you have to deal with that bunch of icons in the main screen, which is very annoying (to my liking). But today I finally discovered a TRICK ;) to store them in a folder (Yeah!), so goodbye to those disturbing icons that I don't use (I just see 1 folder). My screen is already clean now, and only with the Apps that \"I\" use.AMAZON'S ANDROID: As for the OS limitations, the only one I could not overcome is that I have an annual subscription to Norton antivirus, and I have it installed on my Desktop, Laptop and Smartphone; unfortunately it cannot be installed on Fire 7 (9th gen). Today I contacted Norton technical support and they confirmed it; they say it cannot be installed due to the version of Android that Amazon uses on their tablets, which is limited and also different, with a very specific configuration that meets their tablets. Well instead I installed a free anitvirus that is going well for now (hope it protects me enough).STORAGE: As in every smartphone or tablet, internal memory is a concern of all of us (it quickly gets full); and this Fire 7 is not the exception. However it has 10.63GB for user's available internal storage (of 16GB it comes with) and I still have 8GB and something FREE, but this is because I use a 32GB MicroSD (it accepts up to 512GB) and configured all apps to store things over there. This is a good advice for all smartphone/tablet users. Oh yes, also Amazon gives you 5GB for Free in their cloud for you to store your stuff (pics, docs, music, or whatever you want). That's space you won't use in your Fire's storage so that's a nice gift.BATTERY: The battery life is awesome; what I've tested so far it gave me about 8 hours while Spotify downloaded my entire playlists for offline use. After that I gave it the second charge and have it playing music for about 5 continue hrs and the battery still has 70% remaining.SPAM: There's something that bothers me a bit which is the advertising of Amazon stuff when I unlock the screen. I haven't found how to stop it so after various attempts to get rid of it I ended up accepting to live with it. I just swipe my finger from the bottom of the screen and advertising is quickly gone.KEYBOARD: It can be set in several languages (well that's standard; I just downloaded the Spanish dictionary so it checks my spelling), but something that I liked is that it includes the Swipe method of \"writing\" (you enter words by sliding a finger from the first letter to the last; you lift only between words). I love that method and have used it in my smartphones for years now so I'm glad I found it here too.MORE TO COME: I'm so excited with my new Fire that I want to explore more functions, for example Alexa, and more other stuff that comes with the tablet. I will find the time for that later, but for now, I am very happy with what I've got.MY CONCLUSION: I am 200% satisfied with this product, I think it works sensational, at a very satisfactory speed. It plays my Spotify and MP3s playlists without problem, pairing it with my JBL Flip 4 speaker was fast and easy (and it sounds spectacular), the WiFi works perfectly, the email configuration was super fast and without problems, etc etc etc. What a good product!! And for this price, even better!!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}