{
    "remaining_requests": 48234,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-new-Fire-HD-8-tablet/dp/B099Z8HLHT",
    "body": {
        "name": "Amazon Fire HD 8 tablet, 8” HD Display, 32 GB, 30% faster processor, designed for portable entertainment, (2022 release), Black",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/All-new-Fire-HD-8-tablet/dp/B099Z8HLHT",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B9J49SDJ"
        ],
        "asinVariationValues": [
            {
                "asin": "B099Z8HLHT",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01sdb5RX04L._SS36_.jpg"
            },
            {
                "asin": "B09BG6BRQG",
                "variationName": "Color",
                "variationValue": "Denim",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01gl0Fe+UCL._SS36_.jpg"
            },
            {
                "asin": "B09BG5PGC3",
                "variationName": "Color",
                "variationValue": "Rose",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01xyc7bkoEL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "2",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bK9IB6pNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ctbG4VroL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Q-27FwEOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51y2gcezz8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Jk2XfxFaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51znPaBDROL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-AiskMchL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 12681,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "Enhanced performance - Updated hexa-core processor for more responsive performance (up to 30% faster than previous gen Fire HD 8).",
            "All day battery life - Up to 13 hours of reading, browsing the web, watching videos, and listening to music at home and on-the-go.",
            "Stream or download your favorite shows and movies from Prime Video, Netflix, Disney+, and HBO. Enjoy your favorite content from Facebook, Hulu, Instagram, TikTok, and more through Amazon’s Appstore (Google Play not supported. Subscription for some apps required).",
            "Fire HD 8 offers 8\" HD display and 2 GB RAM. Choose from 32GB or 64GB (up to 1TB of expandable storage via microSD card). New design is thinner and lighter than previous gen. Screen made with strengthened aluminosilicate glass. As measured in tumble tests, Fire HD 8 is twice as durable as Apple iPad mini (2021).",
            "Stay connected with family and friends - ask Alexa to make video calls to friends and family or download apps like Zoom.",
            "Do more with Alexa - Ask Alexa to listen to music, get news and weather, update shopping lists, and set reminders. Control your smart home, or ask Alexa to make video calls to friends and family with apps like Zoom.",
            "Amazon Kids offers easy-to-use parental controls on Fire tablets. Subscribe to Amazon Kids+ for access to thousands of books, popular apps and games, videos, songs, Audible books, and more."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Display",
                "value": "8” high-definition touchscreen; 1280 x 800 resolution at 189 ppi, HD video playback, with IPS (in-plane switching) technology"
            },
            {
                "name": "Size",
                "value": "7.94” x 5.40” x 0.37” (201.90mm x 137.34 mm x 9.60 mm)"
            },
            {
                "name": "Weight",
                "value": "11.88 ounces (337 grams) Actual size and weight may vary by configuration and manufacturing process"
            },
            {
                "name": "CPU & RAM",
                "value": "Hexa-core 2.0 GHz with 2 GB of RAM"
            },
            {
                "name": "Storage",
                "value": "32 GB (25.2 GB available to user) or 64 GB (54.5 GB available to user) of internal storage. Add microSD slot for up to 1 TB of additional storage. Some apps may require that they are installed on internal storage. App or feature updates may impact available storage."
            },
            {
                "name": "Battery life",
                "value": "Up to 13 hours of reading, browsing the web, watching videos, and listening to music. Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content. Certain software features or apps may reduce battery life."
            },
            {
                "name": "Charge time",
                "value": "Fully charge in under 5 hours using the USB-C cable and 5W power adapter included in the box. Fully charge in under 3 hours with 9W adapter (sold separately), and under 2.5 hours with 15W adapter and USB type C to C cable (adapter and cable sold separately)"
            },
            {
                "name": "wifi connectivity",
                "value": "Dual-band wifi. Supports public and private wifi networks or hotspots that use the dual-band 802.11a/b/g/n/ac standards with support for security standard of WEP, WPA3 OWE, WPA/WPA2/WPA3 Personal and WPA/WPA2/WPA3 Enterprise. Wi-Fi 6 (802.11 ax) is currently not supported."
            },
            {
                "name": "Ports",
                "value": "USB-C (2.0) connector for charging; microSD slot for external storage."
            },
            {
                "name": "Audio",
                "value": "3.5 mm stereo jack and integrated speakers; external volume controls"
            },
            {
                "name": "Sensors",
                "value": "Accelerometer, ambient light sensor"
            },
            {
                "name": "Camera specs",
                "value": "2 MP front-facing and 2 MP rear-facing cameras with 720p HD video recording"
            },
            {
                "name": "Localization services",
                "value": "Location-based services via wifi"
            },
            {
                "name": "Available colors",
                "value": "Black, Denim, Rose"
            },
            {
                "name": "Bluetooth",
                "value": "Built-in Bluetooth 5.2 with support for A2DP compatible stereo headphones, speakers, microphone, and LE accessories support"
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility. • VoiceView screen reader enables access for customers who are blind or visually impaired. • Screen Magnifier enables customers to zoom in/out, and pan around the screen. • Tap to Alexa enables access to Alexa via touch, instead of speech, through on-screen tiles or a keyboard, including the ability to save your favorite actions. • Switch Access enables access for customers who have motor impairments, and are unable to touch the screen, via compatible Bluetooth devices. • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Fire tablet Accessibility features also include settings for Closed Captioning, Font Size, Display Size, High Contrast Text, Color Inversion, Color Correction, and Convert Stereo to Mono audio. (Captions are not available for all content.)"
            },
            {
                "name": "Warranty and service",
                "value": "90-day limited warranty and service included. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Fire HD 8 tablet is subject to Amazon's Conditions of Use and these terms."
            },
            {
                "name": "Included in the box",
                "value": "Fire HD 8 tablet, USB-C (2.0) cable, 5W power adapter, and Quick Start Guide"
            },
            {
                "name": "Generation",
                "value": "12th generation - 2022 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire tablet, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "pngwen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2LEAEGO66VWAMZVTQOGG2XZUUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NZWUCWU6FXXR?ASIN=B099Z8HLHT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect Tablet eReader!",
                "reviewText": "I bought this to be an inexpensive eReader with a little bit of web browsing capabilities. This is definitely what this device is for. The screen is very comfortable for reading. I can read PDFs and Kindle books plus browse the web. It also streams videos and music like a champ. If that's what you are after, you can't go wrong!The tablet is not terribly powerful, but I think that is part of why the battery lasts so long. This would be a poor choice for gaming. But then, what do you expect at this price point?",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan Rozanski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKKJ6X4DQIJHCNYII4T25JZWGXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R131GPQS22LZ5C?ASIN=B099Z8HLHT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Device for the Price. Resolution very Clear.",
                "reviewText": "This device is much better that the 7\" non-HD graphics. It is not the fastest tablet (but not painstakingly slow by any means), but the price is not steep either. The HD display makes a huge different over the non-HD display. I returned it only because I felt that I was never really going to use it. Found that I am just not a tablet person and prefert PC Laptops.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amelia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYYH3OVBTMTHOM3DKNAAFBSC6OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13WAUTFIYXARF?ASIN=B099Z8HLHT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars For the price, a pretty powerful little tablet.",
                "reviewText": "I got this during a black Friday sale so it was even cheaper! Honestly, for the price of it you cannot go wrong. I can browse the internet and plug it into a sound system to stream some music if I'd like, I can watch some TV shows on it and primarily I can read! I got it to read both Kindle Unlimited and through the Libby app from my library and it is great! I love that you can change the color of the screen for nighttime and the battery lasts quite long so during a flight I can get some reading in. The screen is nicely adjustable with the brightness, allowing me to have it super bright if it's day but not blinding when the plane lights go out. You have to taper your expectations because it will not be super fast or anything, but that's what you get for a sub $100 tablet. For that price though, it's impressive and pretty powerful!",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StephanieStephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX2Z5MHU534F6QN446JLSQKZ4VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XO25W6AX3X07?ASIN=B099Z8HLHT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice enough but not impressed with the ad free option.",
                "reviewText": "This tablet is a good value for the money spent. It's fast and durable, though you really should buy a case and screen protector in order to keep it from getting damaged.I would love to see Amazon make these fire tablets with an antivirus application built in. It's nearly impossible to find a decent antivirus app for these tablets.Dislikes:You can't access Google play services or apps on fire tablets. You're able to download popular apps like Facebook, Instagram, Pinterest, Netflix, etc but there have been several apps that I've searched for and can't find on here.Heads up to those spending extra to have their fire tablet without lock screen ads: I spent the extra $15-$20 to get this tablet WITHOUT lock screen ads but every single day (sometimes 2-3 times per day) I have random movies, shows, books and apps appear at the top of my home screen under something labeled \"Discover\" (see photo .) In order to get rid of them you have to long press each one and click on the option 'Not Interested'. There are anywhere from 10-20 of these and it's extremely annoying. While there are no ads on the lock screen I believe this is Amazon's way of advertising on these tablets even though we've paid extra to not see the advertising. I've had another fire tablet WITH lock screen ads and this never, ever happened.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61uBZYz6ojL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ksheil",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5IR4KRYC7USNBIY5I5FBW4C2BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5EMGYD8KQD8C?ASIN=B099Z8HLHT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazon Fire HD 8 tablet",
                "reviewText": "This is my second Kindle and I'm very happy with it. It has a nice solid, sturdy feel in the hand. The screen is bright with screen images that are crisp and clear. The touch screen is very responsive. Great for reading, playing games, visiting social media sites, it's easy to download and watch videos and access email. Battery life is decent. All in all a very good tablet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMQXHEIWDUFRJOXG5MPM7GILZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R56EE57JYMULE?ASIN=B099Z8HLHT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Your All-in-One Entertainment Companion - Amazon Fire HD 8 Tablet Offers Endless Possibilities",
                "reviewText": "The Amazon Fire HD 8 tablet is a versatile and feature-rich device that redefines your entertainment experience. With its vibrant display, powerful performance, and extensive content library, this tablet becomes your go-to device for everything from streaming movies to reading books and staying connected with friends and family.The standout feature of the Amazon Fire HD 8 tablet is its brilliant 8-inch HD display. The vibrant colors and sharp resolution make videos, photos, and e-books come to life, offering an immersive viewing experience. Whether you're catching up on your favorite shows, browsing the web, or enjoying an e-book, the display ensures stunning visuals that keep you engaged.The tablet's performance is impressive, thanks to its quad-core processor and 2GB of RAM. Apps load quickly, and multitasking becomes a breeze, allowing you to seamlessly switch between different tasks without any lag. The Fire HD 8 tablet delivers smooth performance, making it perfect for gaming, streaming, and everyday productivity.Amazon Fire HD 8 offers access to a vast library of content through the Amazon Appstore. With popular apps like Netflix, Prime Video, Spotify, and more available at your fingertips, you can enjoy endless hours of entertainment. Additionally, with an Amazon Prime membership, you gain access to thousands of movies, TV shows, e-books, and magazines, further enhancing your content options.The tablet is designed with family-friendly features in mind. Amazon FreeTime allows you to create personalized profiles for kids, offering age-appropriate content and parental controls. With FreeTime Unlimited, kids get access to thousands of games, apps, and educational content, making the Fire HD 8 tablet an excellent device for the whole family.The Fire HD 8 tablet offers hands-free functionality with Alexa integration. With just your voice, you can control your tablet, play music, set reminders, check the weather, and more. Alexa becomes your virtual assistant, allowing you to access information and perform tasks with ease, making your daily life more convenient and efficient.Battery life is a strength of the Amazon Fire HD 8 tablet. With up to 12 hours of mixed-use battery life, you can enjoy extended periods of entertainment, web browsing, and productivity without worrying about running out of power. The tablet's battery performance ensures that it stays powered up throughout your day.The tablet's design is sleek and portable. Its lightweight construction makes it easy to carry around, making it ideal for on-the-go use. The durable build ensures that it can handle everyday use and travel without compromising its performance.In conclusion, the Amazon Fire HD 8 tablet is an exceptional all-in-one entertainment companion. With its vibrant display, powerful performance, extensive content library, and family-friendly features, this tablet offers endless possibilities for entertainment and productivity. Whether you're watching movies, reading e-books, or staying connected, the Fire HD 8 tablet becomes an essential part of your daily life. Experience the convenience and joy of the Amazon Fire HD 8 tablet and unlock a world of entertainment and productivity at your fingertips.",
                "reviewVotes": "96 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Staci C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5PDOSAQMO4SOGH3BJ357FAPRHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VG0AUNJHY3GX?ASIN=B099Z8HLHT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Versatile and user friendly",
                "reviewText": "Bought this for my 82-year-old mother. This is the second one I have purchased for her. She literally wore the first one out. She is an avid reader but does not want anything too bulky to carry. This is the perfect size and weight and is friendly enough for her to use. This item gets a big thumbs up in my book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}