{
    "remaining_requests": 47969,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-Galaxy-10-5in-Included-Tablet/dp/B07K2KCL8H",
    "body": {
        "name": "Samsung Galaxy Tab S4 10.5in (S Pen Included) 64GB, Wi-Fi Tablet - Gray (Renewed)",
        "price": "$139.99 - $119.98",
        "originalPrice": "$139.99",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-Galaxy-10-5in-Included-Tablet/dp/B07K2KCL8H",
        "soldBy": {
            "sellerID": "A3G98SNOIH3F0G",
            "name": "PDI Mobile",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3G98SNOIH3F0G&asin=B07K2KCL8H&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07MQJSQPV"
        ],
        "asinVariationValues": [
            {
                "asin": "B07K2FQJFR",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WH0Mb1rzL._SS36_.jpg"
            },
            {
                "asin": "B07K2KCL8H",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Nm-S28V-L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Nm-S28V-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51SnneOI cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tQJicRoGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/316FZhIZBcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21Ext-U5zzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31M4RnUpLNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21nA8N7YwrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Always Less Than Apple LLC",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 415,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 25 mins",
            "FREE delivery Friday, February 16.",
            "Or fastest delivery Tuesday, February 13. Order within 18 hrs 25 mins."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "Qualcomm Snapdragon 835 MSM8998 2.35GHz 8-Core Processor - Android 8.0 Oreo Operating System",
            "10.5\" Multi-Touch WQXGA Super AMOLED Display (2560 x 1600) with included S Pen",
            "Wi-Fi and Bluetooth 5.0 Connectivity - 8MP Front and 13MP Rear Camera with Flash and 8x Digital Zoom"
        ],
        "description": "Your Samsung experience just got better with the sleek and stylish Samsung Galaxy Tab S4 10.5\" Tablet. This dynamic tablet provides the best experience across multiple platforms and allows you to explore, work and watch your favorite shows on a clear and stunningly brilliant 10.5\" Multi-Touch WQXGA Super AMOLED Display (2560 x 1600). Read clearly even in bright sunlight, or keep watching what you love late into the night with a blue light filter that’s easy on the eyes. Do it all on a sleek metal frame that’s comfortable to hold. With up to 16 hours of video playback, you can power through movies, games, emails and more without stopping to recharge. Dolby Atmos surrounds you in sound, giving you a true cinematic experience. Plus, quad speakers tuned by AKG deliver true-to-life audio quality.The 256GB of built-in storage makes room for everything, from your go-to shows to your favorite memories. Plus, add a microSD card to expand your memory up to 400GB so you can keep more of your apps, photos and videos with you. Capture the perfect shot with the 13MP rear-facing camera with flash, and with the 8MP front-facing camera, your best side looks even better in video chats with friends and family. Use the integrated facial recognition and iris scanner to unlock your tablet quickly with just a look. Enhance your imagination with the included S Pen which allows you to personalize messages with GIFs and jot down ideas without unlocking your tablet. The included S Pen translates, clips, magnifies, and never needs charging. Finally, the Galaxy Tab S4 is loaded with the Android 8.0 Oreo Operating System which offers a user-friendly interface.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computers & Tablets",
                "link": "https://www.amazon.com/Computers-Tablets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13896617011"
            },
            {
                "name": "Tablets",
                "link": "https://www.amazon.com/Tablets/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1232597011"
            }
        ],
        "productInformation": [
            {
                "name": "Memory Storage Capacity",
                "value": "64 GB"
            },
            {
                "name": "Operating System",
                "value": "Android O"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "4 GB"
            },
            {
                "name": "Generation",
                "value": "Android 8"
            },
            {
                "name": "Chipset Brand",
                "value": "Qualcomm"
            },
            {
                "name": "Hardware Interface",
                "value": "MicroSD, Bluetooth 5"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "Integrated HD Graphics"
            },
            {
                "name": "Screen Resolution",
                "value": "2560 x 1600 pixels"
            },
            {
                "name": "Memory Slots Available",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Unknown"
            },
            {
                "name": "Card Description",
                "value": "Integrated"
            },
            {
                "name": "Battery Life",
                "value": "16 Hours"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Ion"
            },
            {
                "name": "Lithium Battery Energy Content",
                "value": "15 Watt Hours"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Maximum Webcam Image Resolution",
                "value": "287 Pixels"
            },
            {
                "name": "Wireless Communication Technology",
                "value": "Bluetooth, Wi-Fi"
            },
            {
                "name": "Cellular Technology",
                "value": "4G"
            },
            {
                "name": "Total USB Ports",
                "value": "1"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Wireless Type",
                "value": "Bluetooth, 802.11bgn, 802.11a"
            },
            {
                "name": "Screen Size",
                "value": "10.5 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "2560 x 1600"
            },
            {
                "name": "Display Type",
                "value": "LED"
            },
            {
                "name": "CPU Manufacturer",
                "value": "Qualcomm"
            },
            {
                "name": "CPU Speed",
                "value": "2.35 GHz"
            },
            {
                "name": "Processor Description",
                "value": "Qualcomm Snapdragon"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 415 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#432 in Amazon Renewed (See Top 100 in Amazon Renewed) #41 in Renewed Tablets #127 in Renewed Computers & Accessories #200 in Computer Tablets"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Series",
                "value": "Samsung Galaxy Tab S4"
            },
            {
                "name": "Year",
                "value": "2018"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Included Components",
                "value": "tablet"
            },
            {
                "name": "Model Number",
                "value": "SM-T830NZAAXAR"
            },
            {
                "name": "Item Weight",
                "value": "17 Ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "6.5\"L x 9.85\"W x 0.3\"Th"
            },
            {
                "name": "Warranty Description",
                "value": "90 days limited warranty"
            },
            {
                "name": "Warranty Type",
                "value": "Limited"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Model Name",
                "value": "Samsung Galaxy Tab S4"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bruce Gilliland",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWZOWCDROOSPY2ZDBTP2GJ7DF6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PQDXX0LJQFVZ?ASIN=B07K2KCL8H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2020",
                "reviewTitle": "5.0 out of 5 stars Very Good Tablet That Will Get a Lot of Use",
                "reviewText": "Executive Summary: This is a very good tablet that will get a lot of use. It came with no blemishes or problems. It came with some unexpected extras. It's too early to address some longer-term issues others have mentioned. I think this will prove to be a good investment. My one major concern is battery life, how long on a charge.Although I had ordered a Wifi-only tablet, the one I received was an AT&T branded tablet. A sticker on the top says \"Qualcom 4G.\" Of course, there was no SIM card. (The SIM card would go in the same tray as an SD micro card.) Since I already have an AT&T cell phone plan, I could easily add this tablet to my plan. However, I doubt I will at this time. I can easily use my phone's hotspot capability to get internet access when I can't get Wifi. But having the flexibility is nice.As an added touch, the tablet came with a screen protector sheet already installed. Only a couple of small bubbles, probably better than I would do. And I saw no blemishes anywhere on the screen or back.The specifications say the tablet comes with Android 8, but my tablet had already been upgraded to Android 9. As a 2-year-old tablet, I am not sure if I can get Android 10. I was able to get a new Android security update installed.Unlike some other buyers, my tablet and accessories came in the original retail box inside a larger box with a lot of padding around the smaller box. And it came about three days earlier than Amazon had originally predicted. That was nice. The AC adapter and cable appeared to be new, still sealed in plastic. It did take a few hours to charge the tablet. It had only 7% charge when I first plugged it up. (But my iPad also takes several hours to fully charge, so I think the Samsung charges in a reasonable time.) In one timed test, it took just over 5 hours to go from 24% to 94%.In what I consider normal use for me, the Samsung S4 went from 96% to 22% in just over 26 hours, and 8 of those was while I slept. I’m reasonably sure this is less operational time than I get from my iPad. I had the battery mode set on Optimized which gives better performance. There are a couple of other options for better battery life. The battery usage page showed the screen was on for almost 8.4 hours. Interestingly, I found a setting where I can limit the maximum charge to 85% to “protect the battery.” But that could mean charging more frequently. After charging the tablet, I switched to the medium power mode. The tablet lasted 42 hours, 16 more than before. The screen time was just over 8 hours, slightly less than the first test. I could not tell any difference in performance, so it makes sense to use a more efficient power mode if battery life is a concern.I have an Android phone. Apparently, my apps and some data had been uploaded to Google Drive (which I didn't recall doing). As a result, more than 140 apps were automatically installed to my tablet. It did take a while, but faster than having to download them from the App Store. It even brought over my wallpaper. Of course, I had to go through each app to log in where needed. All the apps work as intended. I had to organize my apps into groups. That part did not come over from my phone. But overall, setup went quickly. I had downloaded the manual for the tablet from the Samsung website. It helped with the setup and testing of features. Apparently the OS upgrade to Android 9 changed a few things from how the manual describes them.One app I use regularly did not install. It was not available from the App Store. Apparently, the developer hasn't made an Android tablet version. A couple of apps did not come over, but I know that they are no longer available even though they still work on my phone. I uninstalled several apps that I don't need on this tablet. The tablet came with a few AT&T apps, but one I use regularly on my phone so that is good. There are a number of Samsung apps, but I am not using them at this time, except for the built-in calendar, clock, contacts and calculator.A few new apps I added came with messages from the app store that they might not be compatible with the Samsung. So far, they all work. But apparently not every Android app is designed to work with tablets, or with Samsung's format.I have a number of the same apps on my phone, this tablet, and on my 2-year-old iPad. The slightly different screen dimensions on the Samsung, compared with the iPad, make for some differences in how apps and data display. A lot of apps display larger on the Samsung than on the iPad. Some of it is likely the differences between the Android and iOS versions of the apps. Overall, I enjoy using the apps with the larger displays. Disney+ looks great on the app.The multi-window feature was one I was looking forward to using. However, the instructions in the manual apparently are for Android 8. Android 9 and/or Samsung had changed the rules so that the manual instructions did not match Settings. Fortunately, an internet search found better instructions on how to access the feature. (In the Recent Apps mode, tap and hold on the icon at the top of the desired app, then select the split screen or popup window option.) Not all apps support the multi-window feature, and I need to experiment more with it.The Samsung screen has a slightly higher resolution (2560x1600) versus my iPad (2048x1536) and about 4 square inches more of screen size. The Samsung screen is a 1/4 inch narrower than the iPad but more than an inch taller in portrait mode. The Samsung weight is only about 1/2 ounce more than my iPad. With the case, the Samsung weighs 1.68 lb. vs. 1.43 lb. for the iPad with case.The tablet has what appears to be glass on the back, so some type of case is probably a good idea. I got a case with no keyboard. One benefit is that the screen turns off when the case is closed and turns back on when the case is opened. That means I don't have to press the power button and swipe across the screen to access the home page. Of course, additional security measures would have to be done if used.At this point, I have used 30GB of the 64GB built-in storage, 13.3GB used by apps. I had an unused 256GB micro SD card. So I pre-installed my music files from my PC before inserting the card into the tablet. It appears that a few of my apps installed their large data files onto the SD card, saving space on the internal storage. One thing missing from the shipping box was the little key to open the card tray. Fortunately, I still had the one from my phone. It worked fine. The hole is small so you would need a very thin paper clip if you don't have the removal key.I have not done any speed tests, but the Samsung S4 seems to be fast, faster than my phone, as fast if not more so than my iPad, and very much faster than an old 2014 Samsung tablet being replaced by this one. It starts up quickly. Screen changes are quick. It is responsive to touches. I have not implemented any of the additional security measures, so a swipe across the screen brings up the home page.The screen switches between portrait and landscape quickly. The table boots only in portrait, but once it starts, it goes to landscape immediately if I have the tablet oriented that way. It starts in landscape when I press the power button and the tablet is in landscape orientation.I already had a small Bluetooth keyboard (Fintie brand) I had gotten for my old tablet. It paired quickly with this tablet. If I am in a text field, and turn on the keyboard, it immediately replaces the on-screen keyboard. I am typing this review with the keyboard. However, I like the Samsung on-screen keyboard, especially when in landscape mode. It is definitely better, and more useful, than the iPad keyboard.I have played with the S-Pen a little. Trying to translate my poor penmanship makes it not worth the time for extensive note taking. I have not tested any drawing and mark-up features. As far as I can tell, the pen works as designed.I'm no audiophile, but the sound from the 4 speakers seems good. It's better than my earphones, but better earphones might help. When I plugged in my earphones, the last song I had played started automatically. That's fine, but I think that feature can be turned off. I have not tried my wireless bluetooth earbuds yet.It's hard for me to address photo quality, but the test shots I did were more than satisfactory to me. The selfie I took with the tablet is certainly better than the one I took with my phone the other day. A national review published in 2018 had little praise for the cameras. The first time I used the camera, it offered to store my photos on the SD card, which I did. But I doubt I would make this my main camera. The phone is just too much easier, and always is with me. Plus, I have a DSLR for serious shooting. I did notice that because my phone photos are backed up to Google, I can see them on the tablet. That's handy.There are metal contacts on one side for use with the Samsung keyboard ($150) or its docking/charging station. The keyboard is too expensive. The problem with the dock is that the tablet doesn't work with a case on. You have to choose between a case or the dock, or constantly remove the tablet from the case. Not worth it.I have not tried some of the built-in Samsung features such as Bixby, Daily Board and DeX. I'm not sure I really need them. I am retired, so this will never be a work device. Plus, my PC still works fine for heavy duty work. But this tablet, like my iPad, gives me a lot of flexibility so that I am not tied to the PC.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV422XDPSNBXWSZSDXBVPRL32KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26Y4WIKY8C03V?ASIN=B07K2KCL8H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2020",
                "reviewTitle": "5.0 out of 5 stars An all-around great tablet",
                "reviewText": "This is a great tablet. I've owned several tablets over the years of varying Brands and I always stick with Samsung. The S4 is very powerful, the screen and Graphics are amazing, and the processor handles all of my apps. I am not a gamer so I cannot speak on game performance, but I am a musician and this handles my music software including the connecting of USB MIDI keyboard controller with no problem at all. I'm also very impressed with the sound and speaker quality of this tablet. The s-pen it's also a great accessory to have. As to the feel of the tablet, I will admit that it is a bit heavy but considering the processor and battery size and screen size it's a fair trade-off. I can comfortably hold it while reading for watching movies. And although it is a bit pricey I feel that it's comparable to other tablets of similar performance on the market. I did not buy the keyboard made for the tablet as I felt it was just way over priced especially considering it's limited functions. I did, however purchase an inexpensive Bluetooth keyboard that links perfectly with it and works fine. So if you're looking for a tablet that will give you great performance, Graphics, and storage, I recommend spending the few extra bucks and getting this tablet.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joshua Zwez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGZWDHL42JKDRFWGWGPMVJGNPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NTA9HSM0C81D?ASIN=B07K2KCL8H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice tablet. I'm",
                "reviewText": "Really nice condition. I'm going to return as I got the Verizon enabled one and I just wanted wifi.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF25XTTTUDFPDWFMEA2N4LVQEMZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M30D2OOAVTZR?ASIN=B07K2KCL8H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 1, 2023",
                "reviewTitle": "5.0 out of 5 stars just as advertised",
                "reviewText": "bought this to replace my kids' old, cracked Tab S4 - this is exactly what they advertise- a refurbished tab. looks great, you can see some very minor screen wear and tear but that was expected, battery seems to be fine after a few hours of them playing with it, great value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "awais",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB25OGT5AMP7S3TNLHXEE2JTHWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PUH85D96XZBM?ASIN=B07K2KCL8H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Exceeded my expectation for a renewed product",
                "reviewText": "The tablet arrived in amazing condition. slight scratches on the back but hardly noticeable. arrives with S pen. Performance is excellent and screen quality is great. been using this heavily for more than 3 months. no complaints at all. And the customer service is great as well. I had some issues with duties but they were resolved by the company amicably.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV6MTXVBN6GPVSRXWNM4UZFJ2BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGP0Q8LPXSSHC?ASIN=B07K2KCL8H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2021",
                "reviewTitle": "5.0 out of 5 stars I love it",
                "reviewText": "This is the second time that I have purchased a refurbished Tab S (the first was a S1) and both times I have been rewarded with an excellent tablet at an agreeable price. The display, as with the original S1, is gorgeous, but with an updated processor and more memory, this think flies. I didn't think I would be a big fan of the S Pen, but it really adds to the experience. Especially when editing test. This tablet also was the last S tablet with an earphone jack. Can't imagine not having one. I will say though that the volume and quality of the sound coming through this tablet's speakers is great too. Can't think of any negatives.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AzJazz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZ3CPVRHS6UTV4SWFA3YOOXYKGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H9MTPNKWI9UN?ASIN=B07K2KCL8H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Replaced our Samsung Galaxy Tab S2, nice upgrade",
                "reviewText": "Our Samsung Galaxy Tab S2 was getting a bit long in tooth. The overall user experience was getting too sluggish, and it had basically become unusable.I picked up this refurbished Galaxy Tab S4, and it has been working great. The UX is snappy again, and no real issues as far as responsiveness or operability. Our tablet is useful again!Battery life has been very good overall.I only have two cons:1) It is getting to be end-of-life for this tablet, so there may not be any more updates. The tablet I received was a T-Mobile SM-T837T with a locked bootloader (and unrootable), so I am at T-Mobile's mercy for future updates. Android 9 is very usable, though - so hopefully this won't be an issue in the long-term.2) There aren't any good inexpensive options for a case+keyboard for this tablet. I tried many, and most are terrible. In the end, I had to purchase a refurbished Samsung Tab S4 EJ-FT830UBEGUJ for $50. I guess that's still a lot better than the $150 Samsung list price, so I'm happy? :-D",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYXHQBBUOV542A6C3T73CMVHSNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YOGCHHG01SOG?ASIN=B07K2KCL8H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Packaging",
                "reviewText": "I like the product and would purchase again but more care when packaging. It could have used more bubble wrap or styrofoam to prevent it from sliding around in the box. It was an electronic gadget so lack of extra packaging made it ice cold when removed from the box…. I do recommend the product that being said.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}