{
    "remaining_requests": 48186,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-powerful-octa-core-processor-lockscreen/dp/B0B2SFTGQ6",
    "body": {
        "name": "Amazon Fire Max 11 tablet, vivid 11” display, all-in-one for streaming, reading, and gaming, 14-hour battery life, optional stylus and keyboard, 128 GB, Gray, without lockscreen ads",
        "price": "$279.99",
        "originalPrice": "$279.99",
        "rawPrice": 279.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-powerful-octa-core-processor-lockscreen/dp/B0B2SFTGQ6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C2ZPQGSP"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C1WHPPKH",
                "variationName": "DigitalStorageCapacity",
                "variationValue": "64 GB",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B2SFTGQ6",
                "variationName": "DigitalStorageCapacity",
                "variationValue": "128 GB",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "OfferType",
                "variationValue": "With Lockscreen Ads",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B2SFTGQ6",
                "variationName": "OfferType",
                "variationValue": "Without Lockscreen Ads",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B2SFTGQ6",
                "variationName": "Style",
                "variationValue": "Amazon Fire Max 11",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Productivity Bundle with Keyboard and Stylus",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41GLtmwdrvL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DYMmhsr4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51292ny91JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uUqlcN27L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sppnxTB6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512ddIeM76L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516N4JxdRiL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 5528,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 6 hrs",
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Saturday, February 17. Order within 6 hrs"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "BIGGER, BRILLIANT, BEAUTIFUL — Vivid 11“ screen with 2.4 million pixels (2000 x 1200 resolution) lets you see every detail of your favorite movies, TV shows, and games. Certified for low blue light.",
            "MAX PERFORMANCE — Built with a powerful octa-core processor, 4 GB memory, and Wi-Fi 6 for fast streaming, responsive gaming, and quick multitasking.",
            "THIN AND LIGHT — Sleek aluminum design is also durable. It has strengthened glass and is 3 times as durable as the iPad 10.9-inch (10th generation) as measured in tumble tests.",
            "ALL-DAY ENTERTAINMENT — With 14-hour battery life, maximize your downtime for reading, browsing the web, watching videos, and listening to music at home and on-the-go. Save your favorites with 64 or 128 GB storage, and expand to up to 1 TB with micro-SD card (sold separately).",
            "VERSATILE FOR WORK AND PLAY — Optional Fire Max 11 Keyboard Case and/or Made for Amazon Stylus Pen (sold separately). Try Microsoft 365 Personal for 3 months (auto renews for $6.99/month after free trial, eligibility and terms apply).",
            "CLEAR COMMUNICATION — The 8 MP camera makes for clear calls to friends and family on Zoom.",
            "GREAT FOR FAMILIES — Amazon Kids offers easy-to-use parental controls on Fire tablets. Subscribe to Amazon Kids+ for access to thousands of books, popular apps and games, videos, songs, Audible books, and more (subscription rates apply).",
            "SMART-HOME READY — Ask Alexa for help with anything from recipes to jokes, or use the smart home dashboard to control your connected devices at a touch. Show Mode turns Fire Max 11 into a smart display."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Display",
                "value": "2000 x 1200 TÜV Rheinland for low blue light certified (213 PPI)."
            },
            {
                "name": "Size",
                "value": "10.2” x 6.44” x 0.3” (259.1mm x 163.7mm x 7.5mm)"
            },
            {
                "name": "Weight",
                "value": "17.28 oz (490g) Actual size and weight may vary by configuration and manufacturing process"
            },
            {
                "name": "CPU & RAM",
                "value": "Octa-core processor - MTK8188J - 2x Arm Cortex-A78 up to 2.2Ghz and 6xArm Cortex A55 up to 2Ghz. 4 GB RAM"
            },
            {
                "name": "Storage",
                "value": "64 GB (54.20 GB available to user) or 128 GB (115 GB available to user) of internal storage. Add micro-SD slot for up to 1 TB of additional storage. Some apps may require that they are installed on internal storage. App or feature updates may impact available storage."
            },
            {
                "name": "Battery Life",
                "value": "Up to 14 hours of reading, browsing the web, watching videos, and listening to music. Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content. Certain software features or apps may reduce battery life."
            },
            {
                "name": "Charge Time",
                "value": "Fully charge in under 4.2 hours with USB-C cable and 9W power adapter included in the box. Fully charge in under 3.5 hours with 15W adapter and USB type C to C cable (adapter and cable sold separately)."
            },
            {
                "name": "wifi Connectivity",
                "value": "Dual-band wifi. Wi-Fi 6 (802.11 ax) is supported. Supports public and private wifi networks or hotspots that use the dual-band 802.11a/b/g/n/ac/ax standards with support for security standard of WEP, WPA3 OWE, WPA/WPA2/WPA3 Personal and WPA/WPA2/WPA3 Enterprise."
            },
            {
                "name": "Ports",
                "value": "USB-C (2.0) connector for charging and audio; micro-SD slot for external storage."
            },
            {
                "name": "Audio",
                "value": "USB-C audio, integrated speakers; external volume controls."
            },
            {
                "name": "Sensors",
                "value": "Accelerometer, ambient light sensor, hall sensor, fingerprint sensor."
            },
            {
                "name": "Camera Specs",
                "value": "8 MP front and back-facing with 1080p HD video recording and rear auto-focus"
            },
            {
                "name": "Printing",
                "value": "Printing documents to a nearby wifi enabled printer is supported. Learn more here."
            },
            {
                "name": "Microphone",
                "value": "2 built-in microphones"
            },
            {
                "name": "Certifications",
                "value": "Fire Max 11 has received the following certifications: ENERGY STAR Carbon Trust TÜV-Rheinland for low blue light USI2.0 for stylus protocol"
            },
            {
                "name": "Location Services",
                "value": "Location-based services via wifi."
            },
            {
                "name": "Available Colors",
                "value": "Gray"
            },
            {
                "name": "Bluetooth",
                "value": "Built-in Bluetooth 5.3 with support for A2DP compatible stereo headphones, speakers, microphone, and LE accessories support."
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility. • VoiceView screen reader enables access for customers who are blind or visually impaired. • Screen Magnifier enables customers to zoom in/out, and pan around the screen. • Tap to Alexa enables access to Alexa via touch, instead of speech, through on-screen tiles or a keyboard, including the ability to save your favorite actions. • Switch Access enables access for customers who have motor impairments, and are unable to touch the screen, via compatible Bluetooth devices. • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Fire tablet Accessibility features also include settings for Closed Captioning, Font Size, Display Size, High Contrast Text, Color Inversion, Color Correction, and Convert Stereo to Mono audio. (Captions are not available for all content.)"
            },
            {
                "name": "**Alexa Privacy Features",
                "value": "Alexa and Fire HD 10 are designed to protect your privacy. For example, you can view and delete your voice recordings or use the Alexa Hands-Free Mode on/off toggle at any time."
            },
            {
                "name": "Warranty & service",
                "value": "1-year limited warranty and service included. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Fire Max 11 tablet is subject to Amazon's Conditions of Use and these terms."
            },
            {
                "name": "Included in the Box",
                "value": "Fire Max 11 tablet, USB-C (2.0) cable, 9W power adapter, SD-card ejection pin, and Quick Start Guide."
            },
            {
                "name": "Generation",
                "value": "13th generation - 2023 release."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire tablet, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ski9",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBJA3YWUUXZPIWS2CEAGKVPIM7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZN0SIEF94NLY?ASIN=B0B2SFTGQ6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Great productivity device",
                "reviewText": "I got the productivity bundle and I am super pleased. I needed something to take notes with in classes, that also had a touch screen for drawing, and this is great for that. (Amazon app store has OneNote and Squid and both are great for notes with this.) In my experience it DOES matter which app you use with the pen because a paint app I tried worked but was slow (so I blame the app, since OneNote and Squid are fine). There is also a fairly new open source app called Saber that seems great (I still need to experiment with that one -- available on F-Droid). I'm thinking that some of the professional reviews (on other web sites) got an early or different version of the pen because the harsh criticisms of it do not match my experience. It works great.This is my 2nd Fire tablet, and I like it so much better than my first one, Fire 8 HD from 2017. I wasn't unhappy with the old tablet when I got it (because I got it on sale for a great price) but I just almost never used it because the screen was so unpleasant and stressful to look at, plus the device was annoyingly slow. Not so with this new tablet -- I am very pleased with the screen quality, and the speed is good for how I'm using it.The pen and keyboard are also awesome. I wasn't sure at first whether I liked the aspect ratio/shape of the tablet but actually it makes sense. The longer shape allows for nearly full-sized key spacing on the keyboard while not causing the tablet to be unnecessarily large and heavy, as it would be with the iPad's aspect ratio. Someone said they prefer the snap-in clamshell keyboard that is available for the 10, but I much prefer this thin-and-light keyboard (didn't have the 10 but considered it and looked at pics of its keyboard). It is super easy and fast to pull off and snap on the keyboard and it does not need batteries. At home (where I have \"real\" laptops) I use the tablet mostly without the keyboard, and half of the keyboard case stays on it, protecting the back and the camera, and giving the tablet a nice non-slip feel, plus I can use the fold-out stand. I don't use it on my lap at school, and at home I use a lap desk so I don't mind that I can't put it directly in my lap. Really, I have no complaints at all about this setup.Well, maybe I can complain a little about Fire OS but it is mostly okay. I would hate it for a phone but it is fine for a tablet. And it is much improved over what I had on my old Fire, especially the settings (I like to have control and info). I put Google Play on my previous Fire but I'm not sure I will do so on this one. I mean I have an Android phone that has things I'd like from the Play store, like my calculator collection and bank apps and whatnot. I don't need to replicate that on this tablet. I've installed F-Droid so I can still easily put a bunch of nice apps on it. I have a Linux terminal app (Termux) and will probably install a Linux distro with desktop which will further expand the usability. Plus I have a Microsoft 360 subscription from work and it is nice to have an app for that on this tablet too. It has the most critical work apps like Zoom and Teams and Office and Outlook. So it already has what I really need on a tablet. Oh, and Kindle, of course. I think in the past it was almost necessary to side-load Google Play but the Amazon App Store is better now, at least for a tablet.I paid to get rid of the ads (I value discounts a lot, but aesthetics even more) and now this tablet is a pleasure to use. And soooo much less expensive than a similar setup would have been from Apple.",
                "reviewVotes": "102 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francois",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXE62M6PRQCAKH6WFJUG3AMVYMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TCRH9SXDJC0D?ASIN=B0B2SFTGQ6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazon Fire Max 11 Tablet: Unleashing Power, Versatility, and Affordability! Review:",
                "reviewText": "I recently got my hands on the Amazon Fire Max 11 tablet, and I must say it has exceeded my expectations in terms of power, versatility, and affordability. This tablet packs a punch with its impressive features, making it a solid choice for both work and entertainment purposes.First and foremost, the Fire Max 11 tablet is powered by an octa-core processor, providing a smooth and responsive user experience. Whether you're multitasking, streaming HD videos, or playing graphics-intensive games, this tablet can handle it all without breaking a sweat. The performance is truly remarkable, especially considering its refreshingly affordable price tag.With 4 GB of RAM, the Fire Max 11 ensures seamless multitasking and effortless switching between apps. I found it capable of handling multiple applications simultaneously, allowing me to be productive and efficient. Whether I was browsing the web, editing documents, or checking my emails, the tablet kept up with my demands effortlessly.The 14-hour battery life of the Fire Max 11 tablet is truly impressive. I was able to use it extensively throughout the day without worrying about running out of power. This longevity is perfect for long flights, road trips, or even a full day of work without needing to reach for the charger.In terms of storage, the Fire Max 11 tablet offers a generous 64 GB capacity, providing ample space for apps, games, documents, and media files. If you find yourself needing more space, there's also the option to expand it with a microSD card. Having this flexibility is great for storing large files or downloading your favorite movies and TV shows for offline viewing.The design of the Fire Max 11 tablet is sleek and modern, with a stylish gray finish that gives it a premium look. The 11-inch display is vibrant and sharp, making it a joy to consume content, whether you're reading ebooks, watching movies, or browsing social media. The tablet's size strikes a good balance between portability and a comfortable viewing experience.One of the standout features of the Fire Max 11 tablet is its integration with Amazon services. It seamlessly connects with Alexa, allowing you to control your smart home devices, ask questions, set reminders, and much more using just your voice. This hands-free functionality adds convenience to your daily life, making the tablet a versatile companion.Overall, the Amazon Fire Max 11 tablet delivers exceptional value for its price. With its powerful octa-core processor, ample RAM, impressive battery life, and generous storage capacity, it offers a well-rounded user experience for both work and entertainment. If you're looking for a reliable tablet that won't break the bank, the Fire Max 11 is an excellent choice.Pros:1. Powerful octa-core processor for smooth performance.2. Ample 4 GB RAM for seamless multitasking.3. Impressive 14-hour battery life for all-day usage.4. Generous 64 GB storage capacity with the option to expand.5. Stylish design and vibrant 11-inch display.6. Integration with Amazon services and hands-free Alexa functionality.Cons:1. Limited access to Google Play Store (Amazon's own app store is available but with a more limited selection).2. May not be suitable for users who heavily rely on Google services.In conclusion, the Amazon Fire Max 11 tablet is a fantastic choice for anyone seeking a powerful, versatile, and refreshingly affordable tablet. It offers an exceptional user experience, making it an excellent investment for both personal and professional use.",
                "reviewVotes": "177 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}