{
    "remaining_requests": 48207,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Apple-2022-10-9-inch-iPad-Wi-Fi/dp/B0BJLCL22Y",
    "body": {
        "name": "Apple iPad (10th Generation): with A14 Bionic chip, 10.9-inch Liquid Retina Display, 64GB, Wi-Fi 6, 12MP front/12MP Back Camera, Touch ID, All-Day Battery Life – Yellow",
        "price": "$349.00$321.08$349.00",
        "originalPrice": "$449.00",
        "rawPrice": 349.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Apple-2022-10-9-inch-iPad-Wi-Fi/dp/B0BJLCL22Y",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CMXMNNCH"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BJLXMVMV",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11s-WE1J8yL._SS36_.jpg"
            },
            {
                "asin": "B0BJLT98Q7",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11BtlDw3XeL._SS36_.jpg"
            },
            {
                "asin": "B0BJLCWFNM",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01DLNekvtdL._SS36_.jpg"
            },
            {
                "asin": "B0BJLCL22Y",
                "variationName": "Color",
                "variationValue": "Yellow",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11v0M5o+nGL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31UIXWqIELL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31a l73cwDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ezh2ptHJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ebtnxi3ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31WsxOelqJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31EHaUNMLBL.jpg",
            "https://m.media-amazon.com/images/I/81PAndwoTGL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/55bec2d7-e9aa-4e86-b5f8-32afbdd9c0df/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2285d762-c18f-43d1-b533-a3b351d6a6b3/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Apple Store",
            "link": "https://www.amazon.com/stores/Apple/page/77D9E1F7-0337-4282-9DB6-B6B8FB2DC98D?ref_=ast_bln"
        },
        "brand": "Apple",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 9807,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 8 hrs 3 mins",
            "FREE delivery Friday, February 16. Order within 1 hr 48 mins",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tomorrow, February 12. Order within 8 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "EPEAT products are assessed against criteria including energy use and have a reduced sustainability impact across their lifecycle. GOLD"
        },
        "features": [
            "WHY IPAD — Colorfully reimagined and more versatile than ever, iPad is great for the things you do every day. With an all-screen design, 10.9-inch Liquid Retina display, powerful A14 Bionic chip, superfast Wi-Fi, and four gorgeous colors, iPad delivers a powerful way to create, stay connected, and get things done.",
            "IPADOS + APPS — iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. iPad comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store.",
            "FAST WI-FI CONNECTIVITY — Wi-Fi 6 gives you fast access to your files, uploads, and downloads, and lets you seamlessly stream your favorite shows.",
            "PERFORMANCE AND STORAGE — The A14 Bionic chip delivers power and performance for any activity. And with all-day battery life, iPad is perfect for playing immersive games and editing photos and videos. Choose from 64GB or 256GB storage options.",
            "APPLE PENCIL AND MAGIC KEYBOARD FOLIO — With Apple Pencil (1st generation), iPad transforms into an immersive drawing canvas and the world’s best note‑taking device. The Magic Keyboard Folio features a versatile two-piece design with a detachable keyboard and a protective back panel that both attach magnetically to iPad. Accessories sold separately.",
            "10.9-INCH LIQUID RETINA DISPLAY — The gorgeous Liquid Retina display is an amazing way to watch movies or draw your next masterpiece. True Tone adjusts the display to the color temperature of the room to make viewing comfortable in any light.",
            "UNLOCK AND PAY WITH TOUCH ID — Touch ID is built into the top button, so you can use your fingerprint to unlock your iPad, sign in to apps, and make payments securely with Apple Pay.",
            "ADVANCED CAMERAS — iPad features a landscape 12MP Ultra Wide front camera that supports Center Stage for videoconferencing and selfies. Shoot 4K video or photos with the 12MP Wide back camera, then edit right on your iPad.",
            "LEGAL DISCLAIMERS — This is a summary of the main product features."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Apple"
            },
            {
                "name": "Model Name",
                "value": "iPad"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "64 GB"
            },
            {
                "name": "Screen Size",
                "value": "10.9 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "2360 x 1640 Pixels"
            },
            {
                "name": "Display",
                "value": "10.9-inch Liquid Retina display with True Tone"
            },
            {
                "name": "Capacity",
                "value": "64GB, 256GB"
            },
            {
                "name": "Chip",
                "value": "A14 Bionic chip, 6-core CPU, 4-core graphics, 16-core Neural Engine"
            },
            {
                "name": "Camera and Video",
                "value": "12MP Wide camera with Smart HDR 3 and 4K video at 24 fps, 25 fps, 30 fps, or 60 fps"
            },
            {
                "name": "Front Camera",
                "value": "Landscape 12MP Ultra Wide front camera with Center Stage and Smart HDR 3"
            },
            {
                "name": "Battery Life",
                "value": "Up to 10 hours of surfing the web on Wi‑Fi or watching video, Up to 9 hours of surfing the web using cellular data network, Charging via USB-C to computer system or power adapter"
            },
            {
                "name": "Connector",
                "value": "USB-C"
            },
            {
                "name": "In the Box",
                "value": "iPad, USB-C Charge Cable (1 meter), 20W USB-C Power Adapter"
            },
            {
                "name": "Height",
                "value": "9.79 inches (248.6 mm)"
            },
            {
                "name": "Width",
                "value": "7.07 inches (179.5 mm)"
            },
            {
                "name": "Depth",
                "value": "0.28 inch (7 mm)"
            },
            {
                "name": "Weight",
                "value": "1.05 pounds (477 grams) Wi-Fi model; 1.06 pounds (481 grams) Wi-Fi + Cellular model"
            },
            {
                "name": "Apple Pencil",
                "value": "Works with Apple Pencil (1st generation) using USB-C to Apple Pencil Adapter - sold separately"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Isa28",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAIPCVLKKNADVM752VJKRUO7BTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2015SJND7G7V9?ASIN=B0BJLCL22Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars elegance and sophistication, it is truly beautiful.",
                "reviewText": "The 10th generation Apple iPad is a masterpiece of modern technology, a perfect fusion of power, style and versatility. Since I started using it, it has revolutionized the way I work and connect.The first thing that blew me away was its stunning 10.9-inch Liquid Retina display. The images are so sharp and the colors so vibrant that every viewing is an experience in itself. Whether watching movies, editing photos or simply browsing the web, the quality of the screen makes every activity more enjoyable.At the heart of the iPad is the A14 Bionic chip, which delivers exceptional speed and performance. The efficiency of this chip is evident in everything I do, from effortless multitasking to the smooth operation of demanding apps and games. It's an incredibly powerful work tool that handles all my computing needs with ease.The Wi-Fi 6 connectivity is another outstanding feature, providing a fast and reliable internet connection. This is essential for my workflow and entertainment, ensuring I am always connected with the best possible speed.The 12MP cameras, both front and rear, are surprisingly good for a device in its class. Video conferencing is clearer and the photos I take are of great quality, making it a versatile tool for communication and content creation.The Security and convenience are guaranteed with Touch ID. It's fast, reliable and adds a hassle-free layer of protection. And, of course, the battery life is phenomenal. I can go all day using it without worrying about recharging it, which is a huge relief in my busy daily life.Lastly, the blue color design is simply beautiful. It's sleek, modern and stands out among other devices, adding a touch of personal style to my iPad experience.In summary, the 10th generation Apple iPad is an exceptional device that combines power, beauty and versatility. It's more than a tablet; it's a daily companion that enriches every aspect of my digital life.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lefty Grove",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAQPT4ROEGIJRO3ABN54GCKXKRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LT0YUY4JTESC?ASIN=B0BJLCL22Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Value!",
                "reviewText": "This refurbished 10th generation IPAD was a fantastic buy at about $450. It has made all the difference in using my piano app, and it has all the features and most of the capabilities of a good laptop. Heartily recommended!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "This iPad is great I was thinking between this one or the 9th generation but I got what I want fast internet and it work for any type of jobThis iPad is great I was thinking between this one or the 9th generation but I got what I want fast internet and it work for any type of job",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY5DFVUOW4XIPDUHKB3OPMFMHCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WDB62865VAYU?ASIN=B0BJLCL22Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Acceptable value",
                "reviewText": "I like that That this device work for diffrent activities I but it mostly for my sister but I use it for diffrent type of work like school pdf and those things it was a big changer for me cause I don’t got a laptop and this works as a laptop you can do similar job in this device and is don’t take long to access a private access work page as other divides so this is a great investment it don’t cost as much as a laptop is a bit cheaper but it give you the same kind of work.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51xLvM5KtzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChadChad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDQR5QSGA4YGLW523CNE3B63IBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL7MIZM2LU37F?ASIN=B0BJLCL22Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing step up from our old iPad.",
                "reviewText": "The Apple iPad (10th Generation): with A14 Bionic chip, 10.9-inch Liquid Retina Display, 64GB, Wi-Fi I bought is such a huge step up from the last iPad we had. Screen response is fast, app load quick and the battery stays charged all day without issues even when watching/streaming video. I went with the blue and it looks really nice.Step up was so easy using my iPhone and it came with the outlet plug and cable to charge it. What I really love is it comes with USB-C instead of the lightning cable. I hated the lightning cable as they always seemed to stop working and on some of our iPads for the kids they don't plug in properly and you have to do some crazy warping of the cable to get it to connect and charge. After about 9 months of using this iPad 10th gen I haven't had any charging or cable issues. So happy about that.The first thing I recommend no matter if you're an adult or it is a gift for a child is getting a screen protector and case put on from day one. It will save you so much anguish if anything happens like a cat knocking it off the coffee table for instance haha.The performance and display are breathtaking when coming from an older generation and the camera is so much better. I've used mine for work, vacationing and giving the kids something to do. We got it on sale, super happy with this Apple iPad 10th gen and would definitely buy again.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61JApCYp20L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61n0KNLwAHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717RN0taa6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Henry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMH6XOOGFH26I72OTGHKIMJTQQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UGK5AJ6IF5OP?ASIN=B0BJLCL22Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars As usual, a great product!",
                "reviewText": "This is my fifth iPad and, so far, the best one, yet! It's taking me a little bit to get used to, but, it's not too hard to figure out. The screen is pretty amazing, really bright if you want it to be. I like that the bezels are smaller, I find that the older I get the more real estate my eyes need. Getting rid of the \"Home\" button has taken a little bit to get used to, but, I'm getting there. The speed of the processor is really fast, I've played a few games on it, but, nothing very intense, although, I doubt it would strain this processor. I already had the Apple Pencil 1, for my sixth generation iPad and it works even better on this iPad. I will say that if something happens to my 1st generation pencil, I will probably go to the usb-c pencil, just so I won't have to use an adapter. I did have a little issue getting my stuff transferred from my old iPad, but, that could've been user error. So far, I have no complaints to report, but, I will update if I find any.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPSZCLADKR7Y7ZTQ4CRBWIJB6BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33ZJYUOVMGEQH?ASIN=B0BJLCL22Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great iPad for Browsing",
                "reviewText": "These are great for you basic browsing and streaming. I use mine to look up information while laying in bed or watching youtube. Battery life is pretty good as i only have to charge it about once a week with light use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}