{
    "remaining_requests": 48236,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon_Fire_HD_10/dp/B0BHZT5S12",
    "body": {
        "name": "All-new Amazon Fire HD 10 tablet, built for relaxation, 10.1\" vibrant Full HD screen, octa-core processor, 3 GB RAM, latest model (2023 release), 32 GB, Black",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Amazon_Fire_HD_10/dp/B0BHZT5S12",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CFYQHFMG"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BHZT5S12",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11rxDrS2AqL._SS36_.jpg"
            },
            {
                "asin": "B0BL5WZ6HF",
                "variationName": "Color",
                "variationValue": "Lilac",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/110wOk7s91L._SS36_.jpg"
            },
            {
                "asin": "B0BL5XPDR6",
                "variationName": "Color",
                "variationValue": "Ocean",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11xsfIhf7rL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "2",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/416AUkIziVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31E5PDbLiGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MtpRiBABL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gGeQiSPeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KAwxDvwnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41F7TLf8FrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bBRIv65ML.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2707,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Recycled Content Certification for Electrical and Electronic Equipment products have at least 10-50% recycled content, based on product type and environmental impact."
        },
        "features": [
            "Do what you love, uninterrupted — 25% faster performance than the previous generation and 3 GB RAM are ideal for seamless streaming, reading, and gaming.",
            "High-def entertainment — A 10.1\" 1080p Full HD display brings brilliant color to all your shows and games. Binge watch longer with 13-hour battery, 32 or 64 GB of storage, and up to 1 TB expandable storage with micro-SD card (sold separately).",
            "Thin, light, durable — Tap into entertainment from anywhere with a lightweight, durable design and strengthened glass made from aluminosilicate glass. As measured in a tumble test, Fire HD 10 is 2.7 times as durable as the Samsung Galaxy Tab A8 (2022).",
            "Stay up to speed — Use the 5 MP front-facing camera to Zoom with family and friends, or create content for social apps like Instagram and TikTok.",
            "Ready when inspiration strikes — With 4,096 levels of pressure sensitivity, the Made for Amazon Stylus Pen (sold separately) offers a natural writing experience that responds to your handwriting. Use it to write, sketch in apps like OneNote, and more.",
            "Family friendly — Amazon Kids offers easy-to-use parental controls on Fire tablets. Subscribe to Amazon Kids+ for access to thousands of books, popular apps and games, videos, songs, Audible books, and more.",
            "\"Alexa, read my last book.\" — Ask Alexa to help with anything from recipes to jokes to reading, or to control your smart home devices.",
            "Designed for sustainability – This device is made from 12% recycled materials. 98% of this device packaging is made of wood fiber-based materials from responsibly managed forests or recycled sources."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Display",
                "value": "Brilliant 10.1” 1080p display (1920 x 1200) with over 2 million pixels (224 ppi), for bright, vivid image quality. Screen strengthened with aluminosilicate glass."
            },
            {
                "name": "Size",
                "value": "9.69” x 6.49” x 0.34” (246mm x 164.8mm x 8.6mm)"
            },
            {
                "name": "Weight",
                "value": "15.29 oz (433.6g) Actual size and weight may vary by configuration and manufacturing process"
            },
            {
                "name": "CPU & RAM",
                "value": "Octa-core processor - 2x Arm Cortex-A76 up to 2.05 Ghz and 6x Arm Cortex A55 up to 2Ghz 3 GB RAM"
            },
            {
                "name": "Storage",
                "value": "32 GB (24 GB available to user) or 64 GB (54.3 GB available to user) of internal storage. Add micro-SD slot for up to 1 TB of additional storage. Some apps may require that they are installed on internal storage. App or feature updates may impact available storage."
            },
            {
                "name": "Battery Life",
                "value": "Up to 13 hours of reading, browsing the web, watching videos, and listening to music. Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content. Certain software features or apps may reduce battery life."
            },
            {
                "name": "Charge Time",
                "value": "Fully charge in under 4 hours with USB-C cable and 9W power adapter included in the box. Fully charge in under 3 hours with 15W adapter and USB type C to C cable (adapter and cable sold separately)."
            },
            {
                "name": "wifi Connectivity",
                "value": "Dual-band wifi. Supports public and private wifi networks or hotspots that use the dual-band 802.11a/b/g/n/ac standards with support for security standard of WEP, WPA3 OWE, WPA/WPA2/WPA3 Personal and WPA/WPA2/WPA3 Enterprise. Wi-Fi 6 (802.11 ax) is currently not supported."
            },
            {
                "name": "Ports",
                "value": "USB-C (2.0) connector for charging; micro-SD slot for external storage"
            },
            {
                "name": "Audio",
                "value": "3.5 mm stereo jack, dual integrated speakers; external volume controls"
            },
            {
                "name": "Sensors",
                "value": "Accelerometer, ambient light sensor"
            },
            {
                "name": "Camera Specs",
                "value": "5 MP front and rear-facing cameras with 1080p HD video recording"
            },
            {
                "name": "Printing",
                "value": "Printing documents to a nearby wifi enabled printer is supported. Learn more here"
            },
            {
                "name": "Microphone",
                "value": "1 built-in microphone"
            },
            {
                "name": "Certifications",
                "value": "Fire HD 10 has received the following certifications: ENERGY STAR USI2.0 for stylus protocol Recycled Content Certification for Electrical and Electronic Equipment (RCCEEE)"
            },
            {
                "name": "Location Services",
                "value": "Location-based services via wifi"
            },
            {
                "name": "Available Colors",
                "value": "Black, Lilac, Ocean"
            },
            {
                "name": "Bluetooth",
                "value": "Built-in Bluetooth 5.3 with support for A2DP compatible stereo headphones, speakers, microphone, and LE accessories support"
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility. • VoiceView screen reader enables access for customers who are blind or visually impaired. • Screen Magnifier enables customers to zoom in/out, and pan around the screen. • Tap to Alexa enables access to Alexa via touch, instead of speech, through on-screen tiles or a keyboard, including the ability to save your favorite actions. • Switch Access enables access for customers who have motor impairments, and are unable to touch the screen, via compatible Bluetooth devices. • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Fire tablet Accessibility features also include settings for Closed Captioning, Font Size, Display Size, High Contrast Text, Color Inversion, Color Correction, and Convert Stereo to Mono audio. (Captions are not available for all content.)"
            },
            {
                "name": "Alexa Privacy Features",
                "value": "Alexa and Fire HD 10 are designed to protect your privacy. For example, you can view and delete your voice recordings or use the Alexa Hands-Free Mode on/off toggle at any time."
            },
            {
                "name": "Warranty & service",
                "value": "1-year limited warranty and service included. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Fire HD 10 tablet is subject to Amazon's Conditions of Use and these terms."
            },
            {
                "name": "Included in the Box",
                "value": "Fire HD 10 tablet, USB-C (2.0) cable, 9W power adapter, and Quick Start Guide"
            },
            {
                "name": "Generation",
                "value": "13th generation - 2023 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire tablet, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "P. Maertens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUCN5FT73S7UR2ANK4WVIVW5CKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8EBWFXRXEGIW?ASIN=B0BHZT5S12",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars VALUE+++",
                "reviewText": "Bought to replace a Fire HD tablet bought in 2014 because the battery is so weak. This new version is much faster, larger viewing area, lighter and much more versatile . Price is about 75% less than the old version. Sound and picture are simply wonderful. At this price point you are getting great value and quality entertainment. I bought WITH adds but honestly they're unintrusive. The case that fits this model is very handy also. We use for reading, FF, videos and music mostly. Very pleased and definitely recommend.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIA7ORKM54G4JYZLSGJGJXIOLOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HND0IV5C7HTF?ASIN=B0BHZT5S12",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect for Children!",
                "reviewText": "My wife and I have bought these every year for our younger children for the past few years. It’s not about the price because they’re priced very well. But they’re perfect all the way around from Performance, Ease of Use, Design, the biggest feature is my wife and I can monitor everything they do on the with ease anytime of the day which is perfect for us. Because you never know what’s in videos these days or what kind of scams are out there.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MoniqueH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFULA5CLL5QMZDGIEXF2VP62DTYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S09OI7Q9Z232?ASIN=B0BHZT5S12",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent quality tablet for an affordable price",
                "reviewText": "I bought this tablet for my nieces and nephews and it was a great buy. They required it for school. So far it has functioned without any problems. The screen quality is great and the battery life is also amazing. They have been able to download educational and amusement apps and have truly enjoyed their tablets. It made an excellent and valuable Christmas gift. At this price, this quality is unbeatable. Of course, when purchasing this kind of electronics, you worry about them being delivered in one piece. All tablets were received in new tip-top condition, with no scratches or broken pieces. I have always trusted this brand and I have never been disappointed. Easy 5 stars for me.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Observer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUYZ356XDW4N67RWYRNI3S5QTZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AR016UUAB416?ASIN=B0BHZT5S12",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Great hardware compromised by the custom OS",
                "reviewText": "This is a great little tablet as long as you don't want to use YouTube, or are a \"light\" YouTube user.I got this for my wife and she is a big YouTube consumer.For her, the hard stop is that when using the poor youtube app that is available through the prime store, she can't view the live chats.I've put off too long to return it, so I'll probably just figure out how to hack it and install the official Google Play store, then the official YouTube app.But the hardware itself is above par. Great battery life, beautiful crisp, responsive touch screen.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXV7DYJNYQPBUFVZ25PI6UKPSZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E0IASB73VPBM?ASIN=B0BHZT5S12",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars This is absolutely so perfect, set up is easy, I highly recommend. Get it! The price is right!",
                "reviewText": "Can I say OH MY GOSH! I've been and still am and avid iPad user, but this device surely rivals it. I got one for my husband, and set up is a breeze, downloading is a breeze. Everything is such a breeze. The price is so on point for us billions of people who can't drop 1K on a new iPad every 5 years. This is so easy to use and set up. Most apps are there that are add on's. I think this would make a wonderful gift for anybody and everybody for any and all holidays. I also bought the case for protection, which is always a must! He just breezes through this, and it certainly is easier on the eyes than looking at the cell phone. Thank you Amazon!",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Callicott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVFOYBCBBEACO2VARKDZTVRMOTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKZ039ZVI9FP0?ASIN=B0BHZT5S12",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Update: Best $100 tablet you can get once you install Play Store",
                "reviewText": "At one time I had like an $800 iPad Pro that I mostly used as a Treadmill screen and it was overkill so I sold it and bought this. For my use case which is mostly watching Youtube or Netflix on a Treadmill it's great. These tablets go on sale a lot so I would caveat that its worth it to me when its on sale (eg ~$100 with no ads). Very lightweight and thin, I was surprised. They probably could have made it feel more premium with an aluminum body but plastic is fine, it still feels solid. Picture quality is very good for the price and it's also a lot snappier than I expected. My kids have older Kindle 8's and they are painfully slow to me so it was a nice surprise. Kindles btw are great for kids especially if you pay for their game/app subscription.The only thing that annoys me about Kindle fires is the app store is pretty worthless. I might side-load the Play store at some point to install the NFL app so I can watch games, otherwise its fine for what I am doing which is watching videos on Netflix, Prime or YouTube.If you need an all purpose tablet that you use in lieu of a computer then something like an iPad Pro is the way to go. If you are literally just using a tablet to watch videos bc you don't want to watch them on a 6 inch phone screen then this is perfect for that.UPDATE:I finally decided to try to install the Play Store, turns out it was not as much of a pain as I thought it would be. Lots of tutorials on the web on how to do it. I had it installed in like 5 minutes and that just unlocked so much more stuff. I could install the real YouTube app plus some other apps I wanted. I even installed Call of Duty mobile which to my surprise actually plays really well. I can't believe I got all this for $100, I imagine in time it will even get cheaper as Amazon tends to run a lot of discounts on their products.",
                "reviewVotes": "183 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL4YZCHJPDZHDK6A7O3JRMFKGEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OJLCT6M23DJX?ASIN=B0BHZT5S12",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Our favorite tablet",
                "reviewText": "We originally ordered the smaller tablet for the smaller children to use but we had to return them because they were too small and not as easy to use with our fingers. So we ended up going back with the larger tablet that we had purchased once before, and had no problems with in the past. This is our favorite tablet. Our next plans is to order the upgrade 12.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Rocco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6QRL5BFFYUXSDAIGKSNQOX4B2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33X704S13NMSK?ASIN=B0BHZT5S12",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing device for the price point.",
                "reviewText": "I have enjoyed the previous generation of this table for a few years. The only problem I had with it was that sometimes it loaded videos too slowly. But everything else about the tablet was fine. This latest update is faster and has a remarkablybeautiful picture. I’m not disappointed!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}