{
    "remaining_requests": 48178,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-Official-Site-Fire-HD-8-Pro-Tablet-8-inch-Display-2022-release/dp/B099Z93WD9",
    "body": {
        "name": "Amazon Fire HD 8 Plus tablet, 8” HD Display, 32 GB, 30% faster processor, 3GB RAM, wireless charging, (2022 release), Gray",
        "price": "$74.99$63.91",
        "originalPrice": "$119.99",
        "rawPrice": 74.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-Official-Site-Fire-HD-8-Pro-Tablet-8-inch-Display-2022-release/dp/B099Z93WD9",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B9J49GLL"
        ],
        "asinVariationValues": [
            {
                "asin": "B099Z93WD9",
                "variationName": "DigitalStorageCapacity",
                "variationValue": "32 GB",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09BG5P9JH",
                "variationName": "DigitalStorageCapacity",
                "variationValue": "64 GB",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B099Z93WD9",
                "variationName": "OfferType",
                "variationValue": "Lockscreen Ad-Supported",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B82Y1HP9",
                "variationName": "OfferType",
                "variationValue": "Without Lockscreen Ads",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lexut53-L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41OC1zbyQHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41szYY6qV0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4166YjKN2PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41llGDwPKwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Q-27FwEOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51k89YyWi1L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3210,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 5 hrs 58 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 5 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "Fire HD 8 Plus offers everything you get with a Fire HD 8 and more - wireless charging, 9W power adapter, 3 GB RAM, 2 MP front-facing and 5 MP rear-facing cameras. New design is thinner and lighter than previous gen and has a screen made with strengthened aluminosilicate glass. As measured in tumble tests, Fire HD 8 Plus is twice as durable as Apple iPad mini (2021).",
            "Fast and responsive - Enhanced hexa-core processor for more responsive performance (up to 30% faster than previous gen Fire HD 8 Plus) so you can get more done. Check email, tackle your to-do lists, browse the web, and more.",
            "Use Show Mode to transform your tablet into an immersive, full-screen Alexa experience, optimized for visibility across the room. To go hands-free with Alexa, just ask Alexa to show news, check the weather, view camera feeds, make a video call, set alarms, control your smart home or play your favorite videos and music, and much more.",
            "Great for on-the-go - Up to 13 hours of reading, browsing the web, watching videos, and listening to music. Hassle-free wireless charging dock (dock not included) offers easy charging anywhere. Choose from 32GB or 64GB (up to 1TB of expandable storage via microSD card).",
            "Relax and unwind with your favorite content from Netflix, Facebook, Hulu, Instagram, TikTok, and more through Amazon’s Appstore (Google Play not supported. Subscription for some apps required).",
            "Stay connected with friends and family - Ask Alexa to make video calls or download apps like Zoom.",
            "Great for the whole family - Amazon Kids offers easy-to-use parental controls on Fire tablets. Subscribe to Amazon Kids+ for access to thousands of books, popular apps and games, videos, songs, Audible books, and more."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Display",
                "value": "8” high-definition touchscreen; 1280 x 800 resolution at 189 ppi, HD video playback, with IPS (in-plane switching) technology"
            },
            {
                "name": "Size",
                "value": "7.94” x 5.40” x 0.37” (201.90mm x 137.34 mm x 9.60 mm)"
            },
            {
                "name": "Weight",
                "value": "12.06 ounces (342 grams). Actual size and weight may vary by configuration and manufacturing process"
            },
            {
                "name": "CPU & RAM",
                "value": "Hexa-core 2.0 GHz with 3 GB of RAM"
            },
            {
                "name": "Storage",
                "value": "32 GB (25.2 GB available to user) or 64 GB (54.5 GB available to user) of internal storage. Add microSD slot for up to 1 TB of additional storage. Some apps may require that they are installed on internal storage. App or feature updates may impact available storage."
            },
            {
                "name": "Battery",
                "value": "All-day battery life - Up to 13 hours of reading, browsing the web, watching videos, and listening to music. Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content. Certain software features or apps may reduce battery life."
            },
            {
                "name": "Charge time",
                "value": "Fully charge in approximately 3 hours with 9W power adapter included in the box. Fully charges in approximately 3 hours using the 10W ANGREAT wireless charging dock (sold separately)."
            },
            {
                "name": "Wireless charging",
                "value": "Fire HD 8 Plus is compatible with Qi-certified wireless chargers. Check if your wireless charger is compatible with Fire HD 10 Plus."
            },
            {
                "name": "wifi connectivity",
                "value": "Dual-band wifi. Supports public and private wifi networks or hotspots that use the dual-band 802.11a/b/g/n/ac standards with support for security standard of WEP, WPA3 OWE, WPA/WPA2/WPA3 Personal and WPA/WPA2/WPA3 Enterprise. Wi-Fi 6 (802.11 ax) is currently not supported."
            },
            {
                "name": "Ports",
                "value": "USB-C (2.0) connector for charging; microSD slot for external storage."
            },
            {
                "name": "Audio",
                "value": "3.5 mm stereo jack and integrated speakers; external volume controls"
            },
            {
                "name": "Sensors",
                "value": "Accelerometer, ambient light sensor"
            },
            {
                "name": "Camera specs",
                "value": "2 MP front-facing with 720p HD video recording and 5 MP rear-facing with 1080p HD video recording"
            },
            {
                "name": "Location Services",
                "value": "Location-based services via wifi"
            },
            {
                "name": "Available colors",
                "value": "Gray"
            },
            {
                "name": "Bluetooth",
                "value": "Built-in Bluetooth 5.2 with support for A2DP compatible stereo headphones, speakers, microphone, and LE accessories support"
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility. • VoiceView screen reader enables access for customers who are blind or visually impaired. • Screen Magnifier enables customers to zoom in/out, and pan around the screen. • Tap to Alexa enables access to Alexa via touch, instead of speech, through on-screen tiles or a keyboard, including the ability to save your favorite actions. • Switch Access enables access for customers who have motor impairments, and are unable to touch the screen, via compatible Bluetooth devices. • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Fire tablet Accessibility features also include settings for Closed Captioning, Font Size, Display Size, High Contrast Text, Color Inversion, Color Correction, and Convert Stereo to Mono audio. (Captions are not available for all content.)"
            },
            {
                "name": "Warranty and service",
                "value": "90-day limited warranty and service included. Optional 1-year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Fire HD 8 tablet is subject to Amazon's Conditions of Use and these terms."
            },
            {
                "name": "Included in the box",
                "value": "Fire HD 8 Plus tablet, USB-C (2.0) cable, 9W power adapter, and Quick Start Guide"
            },
            {
                "name": "Generation",
                "value": "12th generation - 2022 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire tablet, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dennis Nguyen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKULKYW2N7QNZVLH3K3RQACNYNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R344621W7HXASV?ASIN=B099Z93WD9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2023",
                "reviewTitle": "5.0 out of 5 stars One of the best tablets for the price",
                "reviewText": "I already own multiple iPads and higher end Android tablets. Why did I end up buying the Amazon Fire HD 8 Plus and give it a 5 star rating?This tablet simply exceeded my expectations.I was in the market for a smaller lighter tablet to read books and manga. As good as my other tablets are, they are not easy to hold for multiple hours of reading. Holding a metal and glass tablet with a 10.6 inch screen gets tiring over a few hours.The screen on this Amazon tablet is more than adequate for reading books from the Kindle app. This is near perfect for manga since the screen size is similar to paper manga. Images and text appear nice and clear.Installing the Google Play store was easy. I need apps like Google Home, Keep, Drive, and GBoard. YouTube works just fine.My use case is rather easy to handle. I let my kids test this tablet. If it can keep up with my kids, then it can handle what I need a tablet for.When I handed this off to my kids, they just went overboard on games. They couldn't find all of the games they play in the Amazon shop store, so I'll be referencing some games from the Google Play store.Roblox is a popular app for my kids. The overall performance was good. It really depends on which game they are playing from Roblox. Piggy ran well. Broken Bones was very jittery but playable. Yeet-a-friend plays well if you disable some of the extra options for the game itself. Cookie Swirl C World is playable, but was not the smoothest. Spray Paint played well. Spider also played well. Random OBEEs splayed well.Here is the pattern I noticed with Roblox. If the game supports a large lobby, then there is a greater chance that the game runs a bit slower. I noticed that the large lobby games are running a bit slow, but my kids didn't care. They were still happily playing and winning without issues.Granny Chapter 1 and 2 play well.Gacha Life and Gacha Club ran well.Among Us ran well.They were playing more games, but I couldn't keep up with their long list.Overall, this tablet can run games well enough. It won't be as smooth as a higher end tablet, but I didn't notice any random crashes. My kids would have definitely complained about it. If you are considering this tablet for your kids to play games, you need to consider which games they are playing.Surprisingly TikTok worked well. When swiping through videos, it may take a second to load before it plays. I don't notice that issue on my other tablets. After the initial pause, the videos play well.Since reading and productivity were my main concern, it's a 5 star tablet for the price. Games are just the icing on the cake. Since I don't play them often it would not have been a concern for me. Now I have another device to hand off to my kids in those just in case situations.",
                "reviewVotes": "94 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Esser",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNJV4AV7KGKVX6WMEX2CXJ6EFNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EIPMFCK9Q9WN?ASIN=B099Z93WD9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars No one needs more tablet than this!",
                "reviewText": "At least if, like me, you use your tablet as your main source for consuming various media such as books, magazines, newspapers, movies, music, podcasts, the Fire HD 8+ is really the perfect tablet for you. I would definitely add that its performance is more than satisfactory for simple tasks like writing emails or drafting documents in general, or if you want to review and comment on PDFs or text documents. The caveat, as with all Fire TV tablets, is of course the limited availability of apps in the Amazon App Store when it comes to productivity, but I have to say that the features of this tablet completely make up for it. The screen quality is absolutely comparable to much more expensive devices on the market, the sound quality even when listening to music is quite impressive for a sub-$100 tablet, the responsiveness of the touchscreen is absolutely acceptable, and the processor speed is excellent for moving image consumption.The limited storage capacity can easily be made up for with a memory card that allows you to add up to 256 GB.The size of the Fire 8 is also perfect for me, it's absolutely enough for good readability, it's also more than enough if I have to write emails, and also very good if I want to watch films or series on the go.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH44NUWTUMTY7356AEGVLGG4FQJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2297KCF8KDDGX?ASIN=B099Z93WD9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Next Generation improvements",
                "reviewText": "I had the previous Amazon Fire HD 8 Plus tablet. It suited my needs quite well. I made an upgrade as my previous model was operating slowly. My fault for only having the 32GB. This newest model has a very clear and crisp screen. It offers great viewing for all the streaming services. Battery life seems to be better. I had no complaints about the previous model. You can easily get 9 to 10 hours of streaming both video and music and browse Amazon, X and watch an hour of You-Tube. The email set-up is very easy. I went with the newer model Amazon Fire HD 8 Plus tablet, because I love the charging stand that is designed for this model. You get a lot of great features at an affordable price.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}