{
    "remaining_requests": 48230,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/2021-Apple-10-2-inch-iPad-Wi-Fi/dp/B09G9CJM1Z",
    "body": {
        "name": "Apple iPad (9th Generation): with A13 Bionic chip, 10.2-inch Retina Display, 64GB, Wi-Fi, 12MP front/8MP Back Camera, Touch ID, All-Day Battery Life – Silver",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/2021-Apple-10-2-inch-iPad-Wi-Fi/dp/B09G9CJM1Z",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09G9Z8FWK"
        ],
        "asinVariationValues": [
            {
                "asin": "B09G9CJM1Z",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01avJEALMpL._SS36_.jpg"
            },
            {
                "asin": "B09G9FPHY6",
                "variationName": "Color",
                "variationValue": "Space Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/11vt8NrQIVL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "5",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Sl-1fQs9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31UAFd85x7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31He7DvgYAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51t1SNQB5mL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417hgJ0dZtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31DxQ-0EN8L.jpg",
            "https://m.media-amazon.com/images/I/A1uoEPwKZDL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2285d762-c18f-43d1-b533-a3b351d6a6b3/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Apple Store",
            "link": "https://www.amazon.com/stores/Apple/page/77D9E1F7-0337-4282-9DB6-B6B8FB2DC98D?ref_=ast_bln"
        },
        "brand": "Apple",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 58777,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": true,
            "details": "EPEAT products are assessed against criteria including energy use and have a reduced sustainability impact across their lifecycle. GOLD"
        },
        "features": [
            "WHY IPAD — All the essentials in the most affordable iPad, with a beautiful 10.2-inch Retina display, powerful A13 Bionic chip, and an Ultra Wide front camera with Center Stage. Work, play, create, learn, stay connected, and more.",
            "IPADOS + APPS — iPadOS makes iPad more productive, intuitive, and versatile. With iPadOS, run multiple apps at once, use Apple Pencil to write in any text field with Scribble, and edit and share photos. iPad comes with essential apps like Safari, Messages, and Keynote, with over a million more apps available on the App Store.",
            "FAST WI-FI CONNECTIVITY — Fast Wi-Fi keeps you connected at home, work, school, or wherever you go with your iPad.",
            "PERFORMANCE AND STORAGE — The A13 Bionic chip gives you the graphics performance you need. And with all-day battery life, iPad is perfect for playing immersive games and more. Choose from 64GB or 256GB storage options.",
            "APPLE PENCIL AND SMART KEYBOARD — Apple Pencil (1st generation) transforms iPad into an immersive drawing canvas and the world’s best note‑taking device. The Smart Keyboard features a comfortable typing experience and folds into a slim, lightweight cover for protection. Accessories sold separately",
            "10.2-INCH RETINA DISPLAY — With incredible detail and vivid colors, it’s perfect for watching movies or drawing your next masterpiece. True Tone adjusts the display to the color temperature of the room to make viewing comfortable in any light.",
            "UNLOCK AND PAY WITH TOUCH ID — Touch ID is built into the top button, so you can use your fingerprint to unlock your iPad, sign in to apps, and make payments securely with Apple Pay.",
            "FRONT AND BACK CAMERAS — iPad features a 12MP Ultra Wide front camera that supports Center Stage for videoconferencing and selfies. The 8MP Wide back camera is perfect for capturing photos, 1080p HD video, and scanning documents.",
            "LEGAL DISCLAIMERS — This is a summary of the main product features."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Apple"
            },
            {
                "name": "Model Name",
                "value": "iPad"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "64 GB"
            },
            {
                "name": "Screen Size",
                "value": "10.2 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "2160x1620 Pixels"
            },
            {
                "name": "Display",
                "value": "10.2‑inch Retina display"
            },
            {
                "name": "Capacity",
                "value": "64GB, 256GB"
            },
            {
                "name": "Chip",
                "value": "A13 Bionic chip with 64-bit architecture and Neural Engine"
            },
            {
                "name": "Camera and Video",
                "value": "12MP Ultra Wide front camera with Center Stage, HDR and 1080p HD video"
            },
            {
                "name": "Front Camera",
                "value": "8MP Wide camera with HDR"
            },
            {
                "name": "Battery Life",
                "value": "Up to 10 hours of surﬁng the web on Wi‑Fi, watching video, or listening to music."
            },
            {
                "name": "Connector",
                "value": "Lightning"
            },
            {
                "name": "In the Box",
                "value": "iPad, USB-C to Lightning Cable, 20W USB-C Power Adapter"
            },
            {
                "name": "Height",
                "value": "9.8 inches (250.6 mm)"
            },
            {
                "name": "Width",
                "value": "6.8 inches (174.1 mm)"
            },
            {
                "name": "Depth",
                "value": "0.29 inch (7.5 mm)"
            },
            {
                "name": "Weight",
                "value": "1.07 pounds (487 grams) Wi-Fi model/1.09 pounds (498 grams) Wi-Fi + Cellular model"
            },
            {
                "name": "Apple Pencil",
                "value": "Works with Apple Pencil (1st generation)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michelle Mabry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWJ7AYKLBU4T3M4O2QF7BTMR3KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23WFAZD8SL3M6?ASIN=B09G9CJM1Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Value!",
                "reviewText": "The Apple iPad 9th generation is a stellar device that seamlessly blends performance and versatility. Its A13 Bionic chip ensures smooth operation, whether multitasking, gaming, or handling productivity tasks. The 10.2-inch Retina display is vivid and sharp, providing an immersive visual experience.The iPad's compatibility with the Apple Pencil and Smart Keyboard enhances its functionality, making it a powerful tool for creativity and productivity alike. The updated front camera with Center Stage is a standout feature for video calls, automatically adjusting to keep you centered.With iPadOS, the user interface is intuitive, and access to the App Store opens up a world of applications. The build quality is excellent, and the battery life is commendable, ensuring the iPad remains a reliable companion throughout the day. The 9th generation iPad strikes a fantastic balance between performance, affordability, and the robust Apple ecosystem. It's a versatile tablet that caters to a wide range of users.",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "umesh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUPR6NGHUPEMLAHJ5ADE2O5HZDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OE8U5TOFAJGW?ASIN=B09G9CJM1Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars A Stellar Blend of Power and Portability - Apple iPad 9th Gen",
                "reviewText": "From the moment I unboxed the Apple iPad 9th Generation, I knew it was something special. The sleek design and the brilliant 10.2-inch Retina display immediately caught my eye, promising a world of vibrant colors and sharp visuals that didn't disappoint.Performance-wise, the A13 Bionic chip with Neural Engine is a powerhouse. It handles multitasking with ease, whether I'm editing 4K videos, playing graphics-intensive games, or jumping between dozens of tabs on Safari. The efficiency and speed are simply unmatched at this price point.What truly sets the iPad 9th Gen apart is its user-friendly interface. iPadOS is intuitive, making it accessible for both tech-savvy individuals and those who might not be as familiar with modern gadgets. The added support for the 1st generation Apple Pencil and Smart Keyboard expands its functionality, seamlessly transitioning the device from a consumption powerhouse to a creative and productivity workhorse.Battery life is another area where the iPad shines. Even with heavy use, I consistently get through a full day without reaching for the charger. It's reassuring to know I can rely on my device throughout the day, whether I'm working remotely or lounging at home.The front and back cameras are more than adequate for video calls and general photography. The Center Stage feature on the front camera is particularly impressive, keeping me in view even as I move around during video calls.Accessibility features also deserve a mention. With VoiceOver, AssistiveTouch, and other built-in tools, Apple continues to ensure that their devices can be used by everyone, which is commendable.In conclusion, the Apple iPad 9th Generation is a triumph of technology. It balances performance, ease of use, and affordability in a way that's hard to find elsewhere. Whether you're a student, a professional, or someone looking for a reliable entertainment device, the iPad 9th Gen is an excellent choice that won't let you down.",
                "reviewVotes": "165 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lil-Jens Studio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZVEG67G2FYM6PKXF4SVDD25IVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R378WDI1PMOLVQ?ASIN=B09G9CJM1Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent features, does everything needed and more.",
                "reviewText": "Best value overall in the Apple iPad lineup. You can pay more but for the average user, this model has the most bang for the buck. Super easy set up and integration with other Apple products. Only thing that could be better is the battery life. Under steady use, it does not last quite as long as advertised. On the positive side, it recharges faster from the \"low battery\" warning level than my my iPhone or my Macbook Pro ever have.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daisy Gutierrez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJAPWULT3SL4265JM53467JVPOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F9HLE8HODGJU?ASIN=B09G9CJM1Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars iPad 9th generation",
                "reviewText": "It’s really good and it is a medium size but everything works well no problem with it, but besides that when I try to click photos and try to delete stuff from there it makes me double click but overall the iPad is good. I will update later. :)",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rhys Charbonneau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCWYW43LVFXOCJ2GNSMFVCZYYXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSU678BPKJBMQ?ASIN=B09G9CJM1Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Surprisingly Great! An Affordable and Comparable Option",
                "reviewText": "I'm the kind of person who prefers to have newer versions of products, but decided to give this one as a gift to someone who has never used an Apple product. This model was affordable and only a couple of years old, so I thought it would still fair pretty well for what this person wanted to use it for. Let me just say, this product blew my expectations right out of the water. It works extremely well! It's not slow, laggy, or constantly freezing/crashing. It works well with the first-generation Apple Pencil, connects easily via Bluetooth, and has great touch-screen sensation. It easily runs the Procreate and Canva apps and is able to keep other apps in the background without issue. I am very pleasantly surprised about this, as I was expecting a cheap, old product. If you are looking for an iPad to use for art/graphic design or are a student looking for an affordable option, this one is definitely for you!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETUJZXKFNYG375PPJ65CIW2ATNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV89I8SGVJ8KH?ASIN=B09G9CJM1Z",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars If you just want a basic iPad for a great price, this is it",
                "reviewText": "As my review title says - If you just want a basic iPad for a great price, this is it - while it lasts! Although the 9th gen iPad has an older design with a larger bezel and TouchID home button, it still works great as a basic tablet to do simple things. The most common activities - browsing the internet, checking email, chatting through Facetime, reading news, and playing basic arcade games - do not require you to have the latest, greatest, and more expensive iPads when this one can do it all without compromise or a reduction in experience.The fact that the current pricing is $80 under MSRP makes it a steal; at this price, I don't see why one would buy some inferior tablet from other brands when a genuine Apple iPad can be had for under $250! But of course, this price can only last so long, so if you want a basic but high-quality, fully functioning tablet, you can't go wrong here.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edgar Troncoso",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI6T3ICS3342UPZQHOMYI7B5TBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25Q14TUKX3X8U?ASIN=B09G9CJM1Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Reasonably priced and super functional!",
                "reviewText": "I've bought this iPad model twice – first for myself and recently for my fiancée, who's absolutely thrilled with it. As a musician, she finds it incredibly useful for writing and reading music. The size is just right, especially for those of us with less than perfect eyesight. It's been a great choice for both of us.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Desertdoglady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBHFGGWDVVZD5Q3UXMWRP25ODTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CWFO8WFPAFIY?ASIN=B09G9CJM1Z",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect for our needs",
                "reviewText": "This iPad makes it so much easier to read than my iPhone. Easy to order and shipping was quick!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria da Glória Pereira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 12, 2023",
                "reviewTitle": "Produtos maravilhosos",
                "reviewText": "Gosto muito dos produtos da Eletrolux.Recomendo e este site também.Obrigada",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucas L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 3, 2022",
                "reviewTitle": "Ele é realmente incrível (2 meses de uso)",
                "reviewText": "Review de uso por 2 meses:- A tela dele é muito linda, macia ao toque, ele é rápido, é leve, é grande mas confortável. Ótimo pra estudar, pra ver série, fazer pesquisa. Os 64 GB de espaço dá pra usar tranquilo por muito tempo sem precisar apagar arquivos. Eu substituí o meu iPad Air 1ª Geração de 2014 com 16 GB de espaço que usei desde 2014 mesmo, e a diferença pra esse modelo aqui é ABSURDA!- A bateria dura bastante. Como eu uso muito o iPad, eu tenho que recarregá-lo a cada 2 dias. Isso porque eu uso Instagram, Twitter, Podcasts, HBO Max, Prime Video, YouTube e aplicativos de notas para estudo na faculdade (além de pesquisas no Safari). O sistema diz que eu tenho uma média de 7h de uso diário. O recarregamento é muito rápido, vai de 10% a 100% em 40min~1h. Isso pra mim é rápido. Só recarrego novamente 2 dias depois. Pra mim dá muita segurança de que não me deixa na mão.- Eu não tenho a Apple Pencil porque é MUITO cara, então comprei uma da GooJoDoq 12ª geração no Al1expr3ss, foi 94 reais, e ela é perfeita! É perfeito pra escrever. Única coisa que só a Apple Pencil tem é a sensibilidade de pressão. Quem for artista ou tiver objetivo de um iPad para desenho, talvez a falta de sensor de pressão para a caneta GooJoDoq faça diferença, então terá que comprar a Apple Pencil mesmo. Para mim, não faz diferença e a caneta é realmente MUITO boa.- A câmera é boa, mas tem um filtro típico da Apple que não me agrada muito, deixa a cara um pouco lavada. Porém a tecnologia de Palco Central e desfoque do fundo nativo são realmente muito bons. Dá um aspecto mais profissional em ligações por vídeos. Os microfones também são excelentes, dando opções para isolamento de voz, que retira todo o ruído em volta e foca só na sua voz. É incrível isso.- Um ponto negativo desse iPad é o sensor de pressão digital não ser muito rápido e só funcionar com a tela acordada. Então você tem que apertar um botão pra ligar a tela e então colocar o dedo no sensor pra desbloquear. É uma inconveniência, que dentro de todas as qualidades desse iPad eu acho que é só um grão na areia.- Por fim, eu paguei 2700 em Março/2022, pela loja Tech Play Store. Recomendo a loja, a entrega foi rápida e o iPad é realmente novo, lacrado, com garantia oficial no site da Apple.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luiz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 23, 2022",
                "reviewTitle": "Ótimo produto e excelente custo-benefício",
                "reviewText": "Ótimo produto, original, com excelente desempenho e qualidade, como quaisquer outros produtos da Apple. Preço muito mais em conta que outros vendedores, inclusive com relação ao próprio site da marca. A transportadora superou as expectativas na entrega, chegando bem antes do prazo estabelecido (o que demorou foi quando passou para os Correios, mas, mesmo assim, chegou rápido).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rodrigo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 10, 2022",
                "reviewTitle": "O melhor do mercado",
                "reviewText": "Não adianta querer alegar que os produtos da apple não oferecem um bom custo benefício pelo valor mais alto praticado nos seus produtos. A idéia de benefício nesse caso vai além do quesito hardware e praticidade de uso, atingindo também pós venda e motivos intangíveis como marca e respeito pelo seus consumidores, pelos quais, a apple sempre oferece o melhor possível ao consumidor final.Vim de um ipad de 32gb de 6a geração, o qual nunca me deixou na mão em mais de 3 anos de uso mesmo após inúmeras atualizacões de ios e várias quedas sem ao menos trincar a tela (claro com um case decente). Adquiri este de 9a geração com 64gb de ram, e de cara 3 pontos devem ser destacados: mais memória de armazenamento, melhor processador, o que garante mais velocidades em tudo que eu fazia antes, desde textos, até processos multi tarefas, e, por último, melhor tempo de bateria, que no meu caso, não carrego todos os dias, uso em torno de 4 horas por dia, mais umas 2 horas de meu filho, o que garante quase dois dias de uso sem carregar. No mais, mesmo ano após ano, sem mudanças drásticas no design, um ipad continua sendo algo muito útil, nada a reclamar, como amante de tecnologia, recomendo o produto, apesar de caro, é uma ferramenta durável, ao contrário de modelos mais baratos.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 19, 2023",
                "reviewTitle": "Parou de funcionar",
                "reviewText": "Gostei demais do produto. Chegou direitinho e funcionava bem até que um dia não ligou mais (semana passada). Fará 2 anos em fevereiro de 2024. Sempre tive muito cuidado ao usá-lo e guardá-lo. Vou ter que levar na assistência para saber o que houve porque até agora estou sem entender.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}