{
    "remaining_requests": 48219,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fire-7-Tablet/dp/B096WKKK2K",
    "body": {
        "name": "Amazon Fire 7 tablet, 7” display, read and watch, under $60 with 10-hour battery life, (2022 release), 16 GB, Black",
        "price": "$59.99",
        "originalPrice": "",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fire-7-Tablet/dp/B096WKKK2K",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09Z3L87SV"
        ],
        "asinVariationValues": [
            {
                "asin": "B096WKKK2K",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01a0ZBWUqtS._SS36_.jpg"
            },
            {
                "asin": "B096WJQNZ4",
                "variationName": "Color",
                "variationValue": "Denim",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/015UZ4rpIcL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51b-2oWvYDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/411BHhrQ78L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51odwkClSTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51R8ht-6rlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Iu4YMW ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513Q6sGq uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nWdmTQ1kL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 14367,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 6 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "Entertainment in the palm of your hands - With 7\" touchscreen display, 2 GB RAM and quad-core processor, choose between 16/32 GB storage and download books, shows or movies to keep your downtime going.",
            "Big library, small tablet, more fun - Unwind with your favorite apps like Kindle, Netflix, Spotify and more through Amazon’s Appstore (Google Play not supported. Subscription fees may apply).",
            "Pocket-sized entertainment hub - Enjoy up to 10 hours of reading, browsing the web, watching videos and listening to music at home or on-the-go. Expand storage to up to 1 TB with micro-SD card (sold separately).",
            "Say hello & go hands-free - Ask Alexa to make video calls to friends and family with Zoom or to check your Instagram or TikTok feeds. Alexa can also help find you a recipe, get you updates on weather, and more.",
            "Built for the whole family to enjoy - Amazon Kids offers easy-to-use parental controls on Fire tablets. Subscribe to Amazon Kids+ for access to thousands of books, popular apps and games, videos, songs, Audible books, and more."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Display",
                "value": "7” touchscreen, 1024 x600 resolution at 171 ppi, SD video playback, with IPS (in-plane switching) technology."
            },
            {
                "name": "Size",
                "value": "7.11” x 4.63” x 0.38” (180.68 mm x 117.59 mm x 9.67 mm)"
            },
            {
                "name": "Weight",
                "value": "9.9 ounces (282 grams). Actual size and weight may vary by configuration and manufacturing process."
            },
            {
                "name": "CPU & RAM",
                "value": "Quad-Core 2.0 GHz with 2 GB of RAM"
            },
            {
                "name": "Storage",
                "value": "16 GB (9.5 GB available to user) or 32 GB (25 GB available to user) of internal storage. Add microSD card for up to 1 TB of additional storage. Some apps may require that they are installed on internal storage. App or feature updates may impact available storage."
            },
            {
                "name": "Battery life",
                "value": "Up to 10 hours of reading, browsing the web, watching video, and listening to music. Battery life will vary based on device settings, usage, and other factors such as web browsing and downloading content. Certain software features or apps may reduce battery life."
            },
            {
                "name": "Charge time",
                "value": "Fully charges in approximately 4 hours using the USB-C power adapter included in the box."
            },
            {
                "name": "Wifi connectivity",
                "value": "Single-antenna dual-band wifi. Supports public and private wifi networks or hotspots that use the dual-band 802.11a, 802.11b, 802.11g, or 802.11n standard with support for WEP, WPA, and WPA2 security using password authentication; does not support connecting to ad-hoc (or peer-to-peer) wifi networks. WiFi 6 (802.11 ax) is not currently supported."
            },
            {
                "name": "4G connectivity",
                "value": "N/A"
            },
            {
                "name": "Ports",
                "value": "USB-C to connect to a PC/Macintosh computer, or to charge your device with the included power adapter; microSD slot for external storage"
            },
            {
                "name": "Audio",
                "value": "3.5 mm stereo jack and integrated speaker"
            },
            {
                "name": "Sensors",
                "value": "Accelerometer"
            },
            {
                "name": "Camera specs",
                "value": "2 MP front and rear-facing cameras with 720p HD video recording"
            },
            {
                "name": "Location services",
                "value": "Location-based services via wifi"
            },
            {
                "name": "Available colors",
                "value": "Black, Denim, and Rose"
            },
            {
                "name": "Additional features",
                "value": "External volume controls, built-in Bluetooth with support for A2DP compatible stereo headphones, speakers, microphone, and LE accessories support"
            },
            {
                "name": "Accessibility features",
                "value": "To enable features that personalize Alexa to your abilities, go to Settings → Accessibility. • VoiceView screen reader enables access for customers who are blind or visually impaired. • Screen Magnifier enables customers to zoom in/out, and pan around the screen. • Tap to Alexa enables access to Alexa via touch, instead of speech, through on-screen tiles or a keyboard, including the ability to save your favorite actions. • Switch Access enables access for customers who have motor impairments, and are unable to touch the screen, via compatible Bluetooth devices. • Kindle Read Aloud will have Alexa read your Kindle books aloud. • Fire tablet Accessibility features also include settings for Closed Captioning, Font Size, Display Size, High Contrast Text, Color Inversion, Color Correction, and Convert Stereo to Mono audio. (Captions are not available for all content.)"
            },
            {
                "name": "Warranty and service",
                "value": "90-day limited warranty and service included. Optional 1 year, 2-year, and 3-year extended warranty available for U.S. customers sold separately. Use of Fire 7 tablet is subject to Amazon's Conditions of Use and these terms."
            },
            {
                "name": "Included in the box",
                "value": "Fire 7 tablet, USB-C, 5W power adapter, and Quick Start Guide"
            },
            {
                "name": "Generation",
                "value": "12th generation - 2022 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire tablet, visit Manage Your Content and Devices for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Yalal Besereni",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4PA2JDHXJ6SYSKLOTP7LKLY7IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23UNF6KOMBCDT?ASIN=B096WKKK2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Compact and budget-friendly device",
                "reviewText": "The Amazon Fire 7 Tablet is a compact and budget-friendly device that offers impressive features for its price point. The tablet boasts a 7-inch display with vivid colors and good viewing angles, making it suitable for reading, browsing, and watching videos. Although the resolution is not the highest among tablets, it still delivers a satisfactory visual experience.In terms of performance, the Fire 7 Tablet may not rival high-end models, but it handles everyday tasks smoothly. It's equipped with a quad-core processor and 1GB of RAM, which is sufficient for web browsing, social media, and light gaming. For casual users and those seeking a simple and reliable device, the performance of the Fire 7 Tablet is adequate.One standout feature of the Fire 7 Tablet is its integration with Amazon services. It seamlessly connects to the Amazon ecosystem, providing easy access to Prime Video, Kindle books, and Alexa. This integration enhances the overall user experience for those who are already invested in Amazon's platform.The battery life of the Fire 7 Tablet is commendable, offering decent usage time on a single charge. This makes it suitable for on-the-go use, whether for entertainment or productivity purposes. Additionally, the compact size and lightweight design make it convenient to carry around, fitting easily into bags or backpacks.While the storage capacity of the Fire 7 Tablet may be limited, the option to expand it using a microSD card provides flexibility for storing more content. This is particularly beneficial for users who consume a lot of media or download apps frequently.The user interface is intuitive and straightforward, catering to users of all ages. The device's accessibility features make it a practical choice for individuals who may require additional support or assistance while using a tablet.Overall, the Amazon Fire 7 Tablet presents a compelling value proposition for those seeking an affordable and functional device. Its seamless integration with Amazon services, respectable performance for everyday use, and portability make it an attractive option for budget-conscious consumers or those looking for a secondary tablet for specific tasks. While it may not compete with premium tablets in terms of specifications, its affordability and reliability make it a commendable choice for many users.I hope you find this review helpful! Let me know if there's anything else I can assist you with.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gloria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3XDIFEKHENHB3YFJ2GFJQFFJQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37YESC7E1ONYI?ASIN=B096WKKK2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Price was good",
                "reviewText": "Amazon Fire 7 tablet, 7” display, read and watch, under $60 with 10-hour battery life, (2022 release), 16 GB, Is GREAT !! It is so much faster than my old Amazon Fire 7 tablet (2015 Addition) that I got Dec 2019 for a Christmas gift. My first one died completely , first it would lock up, then shut down and not come back on for a few hours at first , then for a day , then not at all. I read books every night and when traveling & play card games too. If this one lasts as long as the first one (5 years), I will be very pleased. the size is just right and is slightly lighter in weight than the old one & 1/2 inch shorter. When I turn it on there is no waiting for it all to come up on screen .It downloads new books & card games really fast. Does everything I want .",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David S. Drobner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBZLZ2AVIP2HGJHTCEH7GLQWQJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIOORRVUFN9N0?ASIN=B096WKKK2K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect kindle book reader; all else secondary",
                "reviewText": "I snagged this latest 12 th gen 7” fire tablet at one of amazons sales $39 in late 2023. The latest chip and 2 gigs RAM makes a real difference compared to a 7” fire I had a couple or so years ago. Last one was basically useless, slow, crashed, and the book reader could not even smoothly do page curl turns. BUT THIS ONE IS DIFFERENT. IF YOU ARE A BOOK READER I ASSURE YOU THERE’S A LOT TO LOVE HERE. (and see one more surprising positive below in my update). The kindle app is flawless and almost snappy on this device. Page turning page curls are smooth and totally free of stutter or lock up like the earlier generation. It has a LOT of nits of brightness - surprisingly VERY bright even for my somewhat older eyes. Making text a bit larger is great (if your vision can use that help) and the screen resolution is totally fine for reading text, no issues at all even though it seemed like it’s a bit lower resolution in its specs. I leave it full brightness and still the battery lasts forever. Given a choice of the e-ink kindle costing much more, and this tablet (I have both) this little 7” fire tablet is FAR SUPERIOR FOR BOOK READING THAN THE e-ink tablet: it is more responsive, agile in changing text size, and lots of nits of brightness for easy reading. If you buy it ONLY as a dedicated book reader, and especially if you get the $39 price - it’s a steal and an incredibly under recognized useful budget reading tablet. Scale of 1-10 as a book reader I give it a 10. No question. More pros: surprisingly solid feel, no bending or creaking- really feels solid in the hand. Not too heavy but it’s not like so paper light that it feels flimsy. I recommend you get a case however cheap, because it is a little slippery to hold. Current OS on it is reasonably responsive and has not once ever crashed. Ok now some practical comparisons. As a tablet it is maybe a 4 on that same scale of 1 to 10: it is not super fast opening apps, the selection of fire available apps is poor, and you should accept that this is not a high end android or apple tablet. Yet, several streaming apps work flawlessly and you can watch media on it but the screen is a little washed out on color and lower resolution when your eyes compare to a high end tablet, or iPhone or 4k TV. The silk browser does work, just not super fast. The USB C charging port (!) was a splendid surprise, and the files app built into the OS let’s you surf a USB flash drive you can plus into that USB port which is surprising and kind of really cool FOR A THIRTY NINE DOLLAR TABLET! I did find that USB 3.0 maybe 3.1 works plugged into the USB C port but not USB 3.2. Last note: it has a standard headphone jack. Streaming audio including Spotify through headphones gives very very good sound. Shockingly the OS is sophisticated enough that you can plug a USB C to 3.5 mm female headphone adapter and plug headphones into that and it DOES stream the sound that way to headphones too. Sound quality seems identical either way. Portable, fun, great book reader, quite competent on card game apps and streaming apps including Netflix, Amazon prime, HULU, Disney, other free streamers like Crackle and Pluto and more; long lasting battery life, quite solid, lots of fun and so budget priced that if these capabilities sound appealing just buy the thing you will love it. Great toy to add to the small electronics fun gadgets in our lives. Update 11 22 23: one more positive to note: surprising but absolutely true: just discovered that Facebook's Messenger app will handle video calling and the result is extremely good - even shockingly good; sharp image, no dropped frames, perfect clean sound quality. Years ago it would have been impossible to imagine an inexpensive tablet gadget that could do video calls like that; yet, here we are. Outstanding!",
                "reviewVotes": "113 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}