{
    "remaining_requests": 48195,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lenovo-Tab-P11-2nd-Gen/dp/B0BYPHT8BK",
    "body": {
        "name": "Lenovo Tab P11 (2nd Gen) - 2023 - Tablet - Long Battery Life - 11.5\" LCD - Front 8MP & Rear 13MP Camera - 4GB Memory - 128GB Storage - Android 12L or Later",
        "price": "$209.99",
        "originalPrice": "$238.00",
        "rawPrice": 209.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lenovo-Tab-P11-2nd-Gen/dp/B0BYPHT8BK",
        "soldBy": {
            "sellerID": "A3DG6X8R7E7914",
            "name": "Mega Deals & Savings",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3DG6X8R7E7914&asin=B0BYPHT8BK&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C7SP1XF6"
        ],
        "asinVariationValues": [
            {
                "asin": "B09B17DVYR",
                "variationName": "Size",
                "variationValue": "P11",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09B195RP1",
                "variationName": "Size",
                "variationValue": "P11 | Keyboard",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09B1BYJJK",
                "variationName": "Size",
                "variationValue": "P11 | Keyboard + Pen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BYPHT8BK",
                "variationName": "Size",
                "variationValue": "P11 (2nd Gen)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BYPGZ49D",
                "variationName": "Size",
                "variationValue": "P11 (2nd Gen) + Keybrd & Pen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BYPHT8BK",
                "variationName": "PatternName",
                "variationValue": "Tablet",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CRR1Q1M2",
                "variationName": "PatternName",
                "variationValue": "Tablet + Multi-Gigabit Cable",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CSYB4TTB",
                "variationName": "PatternName",
                "variationValue": "Tablet + i5-12600KF Processor",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41GrzEZ9bVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31ezxbR-pHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21AxJPUVJfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31lTP7 1LyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61QY1iOS-sL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lU5623BML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41F-GWWvH9L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Lenovo Store",
            "link": "https://www.amazon.com/stores/LENOVO/page/2C6395BA-C701-4025-9D7E-BAE1BD647EEE?ref_=ast_bln"
        },
        "brand": "LENOVO",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1638,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 3 hrs 31 mins",
            "FREE delivery Friday, February 16. Order within 5 hrs 1 min",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Tuesday, February 13. Order within 5 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Get Drawn In: Get drawn deeper into the story in 1080p full-HD with an expansive 11.5” 2K display",
            "Less buffer, faster fragging: Game with Xbox Cloud Gaming (Xbox Cloud Gaming Subscription Required) on an octa-core processor for fast, responsive game play.",
            "Split the view. Double the efficiency: Work on two apps simultaneously with the split-screen on mode on Android 12L",
            "Binge-watch longer between charges: Stay on the move all day while binge-watching for up to 10 hours with the long-lasting 7700amh battery.",
            "Rediscover deep focus reading: Get into deep focus reading more easily with the Reading Mode, now more immersive and easier on the eyes with mono and grayscale modes so you feel like you’re reading on paper"
        ],
        "description": "Experience first-class multimedia and fun with the Lenovo Tab P11 (2nd Gen). This Android tablet features a large, 11-inch screen with 2K resolution. You'll enjoy beautiful video in the IPS LCD touch display and great audio through quad speakers with user-facing stereo tuned by Dolby Atmos. Inside, you'll find a powerful octa-core chip, 4GB + 128GB memory. Plus, this slim and lightweight tablet delivers epic battery life in an aluminum-alloy design with a dual-tone finish available in an elegant slate grey color. Running the Android 12L operating system, the Tab P11 tablet offers Bluetooth and Wi-Fi wireless connectivity and a USB Type-C 2.0 port for data transfer and charging. You can also use the USB-C port to attach a compatible headset. Use the front or rear camera to take photos or enjoy a family video chat – this Android tablet comes with a dual microphone array and quad speakers, so you'll experience crisp, clear video and sound. You can even log in quickly and easily with Face Unlock.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computers & Tablets",
                "link": "https://www.amazon.com/Computers-Tablets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13896617011"
            },
            {
                "name": "Tablets",
                "link": "https://www.amazon.com/Tablets/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1232597011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎11.5"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎2000 x 1200"
            },
            {
                "name": "Chipset Brand",
                "value": "‎ARM"
            },
            {
                "name": "Card Description",
                "value": "‎Integrated"
            },
            {
                "name": "Brand",
                "value": "Lenovo"
            },
            {
                "name": "Series",
                "value": "‎Tab P11 (2nd Gen)"
            },
            {
                "name": "Item model number",
                "value": "‎ZABF0057US"
            },
            {
                "name": "Operating System",
                "value": "‎Android 12"
            },
            {
                "name": "Item Weight",
                "value": "‎1.96 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎10.59 x 6.67 x 0.29 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎10.59 x 6.67 x 0.29 inches"
            },
            {
                "name": "Color",
                "value": "‎Gray"
            },
            {
                "name": "Rear Webcam Resolution",
                "value": "‎13 MP"
            },
            {
                "name": "Processor Brand",
                "value": "‎MediaTek"
            },
            {
                "name": "Flash Memory Size",
                "value": "‎128 GB"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "ASIN",
                "value": "B0BYPHT8BK"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,638 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,604 in Electronics (See Top 100 in Electronics) #228 in Computer Tablets"
            },
            {
                "name": "Date First Available",
                "value": "March 16, 2023"
            },
            {
                "name": "Model Name",
                "value": "Tab P11 (2nd Gen)"
            },
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Screen Size",
                "value": "11.5"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "2000 x 1200"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Thom M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERUABSDRGPCIVZ2PEMNTQSGU2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF8VG0MPE84SO?ASIN=B0BYPHT8BK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2022",
                "reviewTitle": "5.0 out of 5 stars Fast & Brilliant Display",
                "reviewText": "I bought this to replace my Amazon Fire HD8 Plus. That is/was a great tablet but my old eyes were finding it more difficult to see the smaller display.I did a lot of research before selecting this Tab 11 Plus. I had considered several of the Samsung tablets but the value and features of this exactly met my needs.I think everyone else has covered all the technical aspects of this tablet already. The action of tablet when switching between screens and apps is snappy fast. The screen brightness can be adjusted so that is super bright for viewing in direct sunlight. I particularly love that when setting up the tablet it will not only sync with your Google account but I was able to pair it with my Samsung phone and automatically copy all of the apps from my phone to the tablet. That saved a lot of manual download time.I did come with a bit of bloatware preinstalled (mostly games) but they were very easy to uninstall. All you have to do is hold your finger on an app that you want to get rid of and when the app window opens just select \"app info\" and if you can get rid of it the \"Uninstall\" option will appear.The tablet definitely has a solid and sturdy feel and is easy to hold.If you want all the deep nuts and bolts reviews on the tablet, then look at some of the other extensive reviews. There are also some excellent YouTube reviews on the tablet. Many make comparisons between the Tab 11 Plus and other comparable tablets.Update 10/31/2022: For a little over a month I have been experiencing an odd pair of things with the tablet. It will randomly restart with no user input. A Google search said to make sure that if it is a case, the enclosure is not touching the power switch. Mine is well clear of the switch and when it is restarting I am not holding it so there is no way there is any pressure on the switch. It will also randomly terminate an app and return to the home page while I am viewing something.Lenovo provides a troubleshooting tree at their support site for this problem and I have done everything, including a couple of factory resets and both problems remain. I haven't been able to identify any user action that would cause these things and they just seem to happen.When I went to the Lenovo site and looked at the items I have registered there it indicated that I still had 635 days remaining on my warranty. When I started chatting with them on the support site they looked up the serial number and it indicated that the tablet had been sold in Poland and they only provided warranty repair service for items sold in the USA. They recommended I go back to the Amazon support site to resolve the issue.I cannot say enough about Amazon support. I used the Chat function and Patrick looked up all of the information and told me it should definitely be covered under the manufacturer's warranty. He then took my phone number so he could call me back once he had personally talked to Lenovo warranty support. After he explained the situation to them, he dialed me in on a conference call and everything was straightened out. Lenovo sent me a FedEx return label for either repair or replacement.BTW, everything else on the tablet is still perfect. The screen quality is excellent as is the sound. Everything about the tablet is zippy fast and a real pleasure to use, other than getting momentarily bumped out or having to re-open an app and try to find where I was when it terminated. That is not always easy depending on the app you are using.UPDATE 11/11/22 I sent the tablet in for warranty repair over a week ago and it is still in processing. The last update I received from the Lenovo repair website was that the tablet repair is on a \"Hold\" and that the damage was not covered under warranty. I can't figure out what they are referring to when they state \"damage\". The tablet is in pristine condition and it is a problem with functionality. It has to be something in the actual Android operating system since nothing is physically broken or damaged and I just experience the occasional restart while using the tablet. I guess we will see what the resolution is.UPDATE 11/20/2022: The damage done to the tablet was during the return shipping. I received a pre-paid FedEx return label from Lenovo. I took it to the local FedEx counter at Walgreen's and they packaged it for me there in a padded envelope that I was skeptical would provide adequate protection. I voiced my concern and was told it would be OK. It arrived at the Lenovo repair center with a cracked screen. Since the FedEx label was generated by Lenovo, I couldn't claim damages with FedEx (my direct claim was denied). I contacted Lenovo and they have been fantastic in handling the situation so far. The repair cost to replace the screen was not much less than purchasing a new tablet which is what I had already done thinking that FedEx would cover the damage. Lenovo customer service wasn't aware that I had already replaced my tablet and after getting the details of how the shipping was handled, offered to send me a replacement tablet before they had even settled with FedEx. I let them know that I already had the new tablet in hand and they said after they reviewed all of my invoices (original purchase and the replacement) along with the photos I had taken of the front and back of the tablet before taking it to FedEx, they would give me a direct payment to my bank. Everyone at Lenovo customer service has been fantastic in the handling of this issue. The tablet itself is great and comparable to or better than higher cost tablets from other manufacturers.",
                "reviewVotes": "151 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tamara's Trinket's",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5WP57UHW62SDHUJZYC3IHGBITA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNY6RN6R3HDWP?ASIN=B0BYPHT8BK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars LOVE this! Just what I needed!!",
                "reviewText": "WOW! This has done even better than I had hoped!! I got it as a replacement! My old one was CHEAP, and was getting harder & harder to turn on and off! So, I got another type, but the battery was SO bad, it wouldn't even last 4-6 HOURS!! That was NOT acceptable!! So, I found this one, and the reviews were great, so I went for it! GREAT laptop!! I use it mostly at gigs, where I play guitar and sing! I keep my songs, lyrics, and chords on it in case I forget!! And I'm not that young anymore, so I need it more and more it seems!! LMAO But, so far it's AWESOME! I used to have to charge it between gigs!! But, this one?!? WOW! I've used it for 3 gigs so far and STILL Have battery life! LOVE that! And it's SOOOO easy to use! Just like an Android phone! And the apps work great! Easy to move around! WAY easier than my last one! I'd HIGHLE recommend this!! It has a great look, nice BIG size, easy to use, lovely graphics! It's just overall a GREAT product! A+! Thanks much!! I so needed this!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larry HerreraLarry Herrera",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJR7TXJTZW3ITQGQM4C7XT3TUFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQOH0KR6JQG7?ASIN=B0BYPHT8BK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2022",
                "reviewTitle": "4.0 out of 5 stars If your an adult spend the extra money for the Samsung FE perfect for a kid though",
                "reviewText": "I have both the the Samsung FE with 8g ram and this Levono tablet with 4g of Ram. Both are good but if your an adult spend the extra money and get the FE with the extra 4g of ram plus twice the storage space. The Samsung is bigger, noticeably bigger, much much faster (4g more Ram) and of course the Samsung has an OLED 8K screen Vs this which is not 8k. With that said this IS a nice device and IS worth the money especially if your buying it for a child. It is plenty fast though does lag noticeably during installs of software updates. It does have a beautiful screen and does look really good doing sports , TV shows or games though I only play Clash of Clans on this device. It does have a bunch of pre-installed apps/games for kids which is great if you have children. However if your have teens or your kids are grown like mine there is no way to get rid of these apps as they are part of the system software. Which is very annoying and a waste of space. This device also comes installed with Android 11 and will not work until you go thru the process of updating the system software to Android 12. On the Samsung the system software told me it had to update to 12 plus do 2 other software updates before it ever allowed me to log onto my Google account and begin the setup. This device tried to setup and hung three different times before I did a system reset and fought me the entire time trying to upgrade to Android 12 but once I was able to do that aside from the install lag due to less ram I was able to get the device set up and all my apps set up. I put DirectTV Stream on here and yes I have watched Football and other Live action sports on this device it looks great no lag however this thing is too small to watch TV on regularly. Then again I am spoiled I bought both these devices to replace a 18.4 inch Galaxyview tablet and a 12.6 inch tablet that I watched sports on regularly plus my TV. IF your going to watch sports regularly on multiple devices spend the 1k and get the Samsung 8 which has a 14.6 inch screen. For the money it is a solid buy considering I really just bought this to just stop playing Clash of Clans on my phone (I am 47 and hate squinting at small screens.) If I had younger kids I'd buy this in a second it is super light, inexpensive, the foam case (bought separately on amazon for 20 bucks) seems to offer plenty of protection , and just big enough to do video without ruining someone's eyes but not big enough to be awkward for smaller hands.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ovs63JrfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. C. Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAKP24G2IL6QRC6YYE5YFTMZBZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ4JS8B4N5CDE?ASIN=B0BYPHT8BK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Best tablet for the price range",
                "reviewText": "Great screen quality. Fast processing of videos. Light weight.Good camera quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AndreAndre",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYNZTAU2W7BLCUQFEFEBAABIHKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FLIPN0Z7MVD6?ASIN=B0BYPHT8BK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Really like this thing.",
                "reviewText": "I can't comment on how it compares to other similar devices, but with that aside... I really like it! Had it now for over a month. The tablet performs well. I REALLY like Android 12L and the performance mode it has (mirrors a desktop display). I mostly use it for emails, some simple graphic designing, and Google Docs and Meets. Case and keyboard is really great too. Very sturdy. I would definitely recommend this for people looking for an affordable travel computer device. I would not recommend this as your primary device. I have a desktop that I primarily use for a bulk of work tasks.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BotrADXFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luis Fernando Pérez Fabela",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 12, 2024",
                "reviewTitle": "Excelente opcion",
                "reviewText": "Tablet con una pantalla muy colorida y brillante a pesar de ser IPS.Estupenda construcción, aunque si consideraría comprar desde el primer día una funda protectora.Un desempeño mas que adecuado para el procesador, nunca se ha detenido ni ralentizado.El sistema operativo es muy parecido al de Motorola, asea bastante limpio, lo que ayuda a su desempeño.Magnifico sonido, La señal de wifi la capta muy bien en toda la casa.Estaba indeciso entre esta y la A9+ de Samsung pero la compre en oferta (4400 mx), ademas de contar con una carga un poco mas rápida (20W) que la Samsung (15w); una mejor pantalla y un poco mas grande con mejores ángulos de visión.Lo que si consideraría a mejorar seria que le hubieran puesto al menos 6gb de RAM, fuera de esto no he encontrado ninguna otra queja.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 7, 2024",
                "reviewTitle": "Excelente",
                "reviewText": "Excelente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rick gage",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2023",
                "reviewTitle": "Great tablet for light work.",
                "reviewText": "This is my second Lenovo tablet. Lots of storage at 128GB. Very good operating system. Woks well for me. Lenovo needs to offer longer updates. The tablet has Android 12 but 14 is out now. Still nice tablet and battery lasts all day.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 1, 2023",
                "reviewTitle": "Comprar en Amazon es confiar",
                "reviewText": "Muy buen producto y el envío a tiempo..muy contento",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yvon blanchetteyvon blanchette",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 28, 2023",
                "reviewTitle": "Lenovo ma tablette 🤗",
                "reviewText": "Pour les voyages ce sera fantastique, je suis très contante présentement.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71KTuWuwvGL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$209.00",
                "sellerName": "Mega Deals & Savings",
                "sellerRating": "5"
            },
            {
                "price": "$234.00",
                "sellerName": "Deer Island",
                "sellerRating": "5"
            }
        ]
    }
}