{
    "remaining_requests": 48166,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MEBERRY-Tablet-Android-Screen-Keyboard/dp/B0CD2C4C5S",
    "body": {
        "name": "MEBERRY Tablet Android 13 2K Screen Tablet 10.36 Inch, Tablet 16GB RAM + 256GB ROM + TF 1TB / 2000 x 1200 Pixels / 5G WiFi / 8600 mAh / 5MP + 13MP,Tablet with Mouse and Keyboard Black",
        "price": "$169.99",
        "originalPrice": "$169.99",
        "rawPrice": 169.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MEBERRY-Tablet-Android-Screen-Keyboard/dp/B0CD2C4C5S",
        "soldBy": {
            "sellerID": "A114PUJ75J49GL",
            "name": "MEBERRY- Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A114PUJ75J49GL&asin=B0CD2C4C5S&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNRS64VZ"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CD2C4C5S",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51-l3YxKEOL._SS36_.jpg"
            },
            {
                "asin": "B0CGDZT23N",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51VIzBWVpRL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $26 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51-l3YxKEOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51N0SE40mwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512LaTCuFWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CvZk3giUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DZu4cem4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51S7MlWmmdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZlYcoptiL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: MEBERRY",
            "link": "https://www.amazon.com/MEBERRY/b/ref=bl_dp_s_web_24420371011?ie=UTF8&node=24420371011&field-lbr_brands_browse-bin=MEBERRY"
        },
        "brand": "MEBERRY",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 2311,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 5 hrs 56 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Android 13 & OCTA-CORE】M7 Android 13 tablet runs smoother. Equipped with a powerful octa-core CPU, 16 GB (8 GB RAM + 8 GB RAM extension) of RAM and a maximum main frequency of 2.0 GHz to launch apps faster and handle various tasks with ease. And for smooth operation in games, music playback, video playback and web browsing. Higher overall performance.",
            "【16GB RAM + 256GB ROM + TF 1TB】Android 13 tablet offers 16GB RAM (8GB RAM + 8GB RAM extension) and 256GB ROM, and supports all brands of micro-rosd/TF cards from 4GB to 1TB.Enables fast file downloads and plenty of storage space, so you no longer worry about storing photos；Google GMS certification supports browsing and downloading all apps on Google Play, providing a convenient and fast experience.",
            "【2K screen & 8600mAh】 The 10.36-inch tablet has a 2K HD screen with a resolution of 2000 x 1200. The tablet automatically adjusts the screen brightness and backlight and actively filters blue light. It provides the user with high-resolution visual effects and prevents eye fatigue during prolonged viewing. The tablet is equipped with a high-capacity 8600 mAh battery, which provides sufficient power and a long service life.",
            "【5G Wi-Fi & Bluetooth 5.0 & 5MP + 13MP】 The tablet supports 5G Wi-Fi for a faster and more stable network connection. Connect Bluetooth devices such as Bluetooth headphones, Bluetooth keyboards, etc. via Bluetooth 5.0 so that your tablet can transfer files and audio stably and quickly. The tablet has stereo speakers for an immersive audiovisual experience. The 5 megapixel camera on the front and the 13 megapixel camera on the back ensure clear photos.",
            "【Lifetime product warranty and 24-hour customer service】This tablet can be used with a variety of office software through Google, making it an ideal companion for your study and work. We provide lifetime technical support and lifetime warranty.MEBERRY focuses on customer service. If you have any questions, please contact us immediately, our customer service will reply you within 24 hours after you contact us. We also provide different solutions for different needs of customers and propose solutions that satisfy customers."
        ],
        "description": "productsBrand: MEBERRYSystem: Android 13Processor: OCTA-CORE 2.0 GHzMemory capacityRAM: 16GBRom: 256GBMemory card: Expandable up to 1TBDisplay:Screen type: IPSScreen size: 10.36 inchResolution: 2000 × 1200 pixelsCamera:Front camera: 5 MPRear camera: 13 MPWiFi/BluetoothBluetooth: 5.0WIFI: 5.0 G/2.4 G, 802.11a/b/g/n/acBatteryBattery: 8600 mAhUsage time: 6-8 hoursPackage contents1 * Tablet1 * Mouse1 * Keyboard1 * Charger1 * Type-C1 * Protective Case1 * Protective film1 * OTG Adapter1 * User's Manual1 * Card Removal Pin IMPORTANT: It is recommended to charge the M7 Tablet for at least 8 hours before using it for the first time to better manage and optimize the battery for future use.MEBERRY offers a lifetime warranty.If you encounter any problems during use, please remember to contact us anytime through Amazon.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computers & Tablets",
                "link": "https://www.amazon.com/Computers-Tablets/b?ie=UTF8&node=13896617011"
            },
            {
                "name": "Tablets",
                "link": "https://www.amazon.com/Tablets/b?ie=UTF8&node=1232597011"
            }
        ],
        "productInformation": [
            {
                "name": "Memory Storage Capacity",
                "value": "128 GB"
            },
            {
                "name": "Operating System",
                "value": "Android 13"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "16 GB"
            },
            {
                "name": "Generation",
                "value": "Android 13"
            },
            {
                "name": "Special Feature",
                "value": "Stereo Speakers"
            },
            {
                "name": "Hardware Interface",
                "value": "USB Type C"
            },
            {
                "name": "Screen Resolution",
                "value": "2000x1200"
            },
            {
                "name": "Memory Slots Available",
                "value": "1"
            },
            {
                "name": "Human Interface Input",
                "value": "Mouse, Keyboard"
            },
            {
                "name": "Card Description",
                "value": "Integrated"
            },
            {
                "name": "Other camera features",
                "value": "Rear, Front"
            },
            {
                "name": "Maximum Webcam Image Resolution",
                "value": "13 MP"
            },
            {
                "name": "Wireless Communication Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Cellular Technology",
                "value": "4G"
            },
            {
                "name": "Total USB Ports",
                "value": "1"
            },
            {
                "name": "Screen Size",
                "value": "10.36 Inches"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "2000*1200 Pixels"
            },
            {
                "name": "Display Type",
                "value": "LCD"
            },
            {
                "name": "CPU Manufacturer",
                "value": "MT8183"
            },
            {
                "name": "CPU Model Number",
                "value": "MT8183"
            },
            {
                "name": "CPU Speed",
                "value": "2 GHz"
            },
            {
                "name": "Processor Description",
                "value": "ARM Cortex"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 2,311 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#173,680 in Electronics (See Top 100 in Electronics) #2,581 in Computer Tablets"
            },
            {
                "name": "Brand",
                "value": "MEBERRY"
            },
            {
                "name": "Series",
                "value": "M7"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Included Components",
                "value": "1 * Tablet 1 * Mouse 1 * Keyboard 1 * Charger 1 * Type-C 1 * Protective Case 1 * Protective film 1 * OTG Adapter 1 * User's Manual 1 * Card Removal Pin"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "25\"L x 18\"W x 5\"Th"
            },
            {
                "name": "Warranty Description",
                "value": "2 years"
            },
            {
                "name": "Model Name",
                "value": "M7"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CASSANDRA R TAYLORCASSANDRA R TAYLOR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXVXIZLYLLPX63B7HFEPZOLZZGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPECLQHCSVMRQ?ASIN=B0CD2C4C5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2021",
                "reviewTitle": "5.0 out of 5 stars Best Tablet Purchase I have made",
                "reviewText": "(Photo is screenshot of factory installed programs)This may be the most positive review I have ever written. I can’t praise this tablet enough. First of all, the customer service is incredibly responsive. I dutifully submitted my registration for the warranty and included a question in my email. The next day, I received a personal email confirming my warranty registration as well as the answer to my question. I have been curious about a couple other issues (nothing important) and again, the response has been the next business day. I have tried to contact customer service with other purchases and frequently never get a response or get one a month later, when the response is no longer relevant. Such quick and personal responses are rare, extremely valuable and are included at no extra cost with this purchase.I really wanted to replace my old 9.7 Samsung Tab A which is 5 almost 6 years old and only has 16 GB of internal memory. It had become very frustrating because I could no longer sync my tablet with my phone. In my experience, Samsung products don’t break, so I had trouble justifying the purchase of a new tablet with more internal memory because my Samsung still worked. In addition, I have really liked the size of the 9.7 and was reluctant to replace it because I was afraid that a 10.1-inch tablet would be so much bigger. I’m pleased to report that this MEBERRY Tablet is not that much bigger than my 9.7. Interestingly, even though this tablet has a bigger screen, it is lighter in weight than my Samsung (by 20 grams) and does not have the bloatware that Samsung insists on loading into their tablet. It probably does not need to be said, but this tablet costs much less than a comparable Samsung.I am impressed with the sensitivity of the keyboard. I had a Bluetooth keyboard with my first Samsung tablet (10 years ago) and it was painful to use. I would hit a key … wait for the letter image on the screen, hit another key … wait for the image. This keyboard reaction is immediate. It is just like typing on a computer keyboard or a laptop. It was noted in another review, that it would have been nice to have the keyboard plug into the tablet for power. You do have to charge the tablet and the keyboard separately, with 2 different charging plugs. The tablet uses a Type C, the keyboard use the old type of Android plug. I checked to see whether the keyboard will work while it is plugged in and charging. The answer is yes.I am a little disappointed that the mouse is not Bluetooth, but there are so many perks with this tablet that the mouse issue is irrelevant. I do appreciate the USB dongle. My Bluetooth mouse connected flawlessly and works well with the keyboard. The USB dongle is great with thumb drives to input and output data as well as any USB accessories. Yes, I did hook up the accompanying mouse and it worked just fine.The battery holds its charge all day. I am very impressed with how quickly the tablet recharges. I have started to recharge the tablet in the evening when it gets below 20%. Even while using it, it recharges speedily.I just thought I’d check and see how the dictating works in Microsoft Word app. Seems to work great. I am pleased to have this option because Microsoft Office on my PC does not allow dictating unless you have an Office 365 Subscription. Since I don’t use office that often, I have never felt the need to pay a monthly fee for its use.One of the questions I had before I purchased, was whether the SD card could be formatted for adoptable storage, i.e., able to use the SD card as internal storage. My answer is: I think so. When I inserted my SD card, the tablet table requested how it was to be used, internal storage or removable storage. I chose the internal storage option. I was able to move some files over to the SD card, but the process didn’t seem that different from what I had been doing with my Samsung. In other words, not all apps could be moved to the SD card, just the ones I had downloaded. I’m glad to have the 64 GB of internal storage.Finally, I found this tablet to be an incredibly good purchase. I have been using it daily for the past 7 days, trying to test every function I could imagine. I believe this tablet is as good as a Samsung with more accessories and half the cost. I recommend it highly. If it falls apart or stops working, I will update this review. However, so far, I could not be more impressed.",
                "reviewVotes": "59 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61v08C5q1GL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexx LeVasseur",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAXDJOS5U4CRTN2Y2BDK2F5XTXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21F8K1OEA79WY?ASIN=B0CD2C4C5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2021",
                "reviewTitle": "5.0 out of 5 stars Nice tablet and good customer service",
                "reviewText": "UPDATE 1-16-21: I heard back quickly from the manufacturer regarding my challenges with my desire to mirror my cell phone. They explained that the tablet does not have the capacity/storage space like my phone. They suggested only downloading the apps I use consistently. Although that still does not explain why the tablet was not showing any of the apps (short of 3) on the desktop but was showing them in the settings menu, the fact that the company actually cared enough to respond is something rare these days. For that reason I have updated my rating to a 5 star because the tablet works well and the customer service is great. They are also saying the newest version, the M8, comes out tomorrow and they will be shipping me that newest version at no cost to me. Apparently their warranty claim is true. I was debating between this tablet and one other one, glad I chose this one!Original Rating 3 stars 1-13-21: I like this tablet but had thought I was buying an Android tablet that could marry up to my Samsung Galaxy Note 8 phone so that I had all the same apps, etc. However, when I followed the steps to accomplish this data transfer it did transfer over but the apps could not be seen on the main screen. I could go into settings, apps, show all apps, find the app and open it but that was a total PITA. Oddly, it did show 2 out of my 84 apps on the screen so I am unsure why two worked properly and the remaining 82 did not. I did call into the help line listed for the product, which was Amazon themselves vs the manufacturer and the rep tried his best to figure out why the apps were not showing up on my screen but were indeed downloaded to the tablet. After several attempts at \"lets try this now\" he was never able to figure it out so we ended up rebooting the tablet to the initial manufacturers setup. Since he could not figure it out he just explained that he was unsure why it would not work properly and told me I would need to download each app separately at this point....all 84!! Ugh! I did not want to do that because I wanted all my apps to be mirrored as I was seeing them on my phone. By downloading the apps individually I had to start over in every app doing setup, etc. Also, for any gaming apps I had to start back over rather than build on the level I am in my phone. Since the tablet is not DOA Amazon will only say \"oh well....good luck\" and will not exchange for one that will download properly.For those reading this that are thinking perhaps the tablet is not supposed to sync up with an Android phone, the tablet actually instructs you to do this during set up. Very frustrating. If the device instructs you to marry up/sync with your current Android device then it should. I also expected Amazon support to recognize that this was a flaw, and perhaps a flaw in this particular unit, so I should be able to have a new one shipped to me and ship this one back. However, again, on this particular unit I was told if it's not DOA then tough....deal with any shortcomings it may have.However, with all that being said, although the tablet does not operate as promised, it is still a decent tablet for the money.....but for what I wanted it for I am saddened that it won't cooperate as they stated it would, hence why I knocked 2 stars off in my rating. If the manufacturer, or someone with the appropriate skill level and knowledge of this tablet, would contact me and see if we can do something to get it to work properly I will gladly change my rating to a 5 star, however, at this point I cannot in good conscience give it that rating when others may be looking at this tablet for the same purpose I was, which is a larger version of my cell phone.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}