{
    "remaining_requests": 47279,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TECKNET-Bluetooth-Wireless-Mouse-BM308/dp/B07C2NL5HK",
    "body": {
        "name": "TECKNET Bluetooth Mouse, 3200 DPI Computer Mouse, 2-Year Battery Wireless Mouse 6 Adjustable DPI, 6 Buttons Compatible with Laptop/Windows/Computer",
        "price": "$13.99",
        "originalPrice": "$19.99",
        "rawPrice": 13.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TECKNET-Bluetooth-Wireless-Mouse-BM308/dp/B07C2NL5HK",
        "soldBy": {
            "sellerID": "A5Z18193C8GGZ",
            "name": "YOUREE Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A5Z18193C8GGZ&asin=B07C2NL5HK&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07FCHTPJ4"
        ],
        "asinVariationValues": [
            {
                "asin": "B07C2NL5HK",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$13.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31uZFytQwcL._SS36_.jpg"
            },
            {
                "asin": "B07FVJCPRZ",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31I0CQzYJtL._SS36_.jpg"
            },
            {
                "asin": "B000Q7V0W4",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31sunVL47oL._SS36_.jpg"
            },
            {
                "asin": "B0BCK2HZ9V",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31cftpNF1qL._SS36_.jpg"
            },
            {
                "asin": "B07C3TDGPW",
                "variationName": "Color",
                "variationValue": "Purple",
                "price": "$14.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31l9g-DZYQL._SS36_.jpg"
            },
            {
                "asin": "B07FVBYTNP",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "$14.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/312txhGxtQL._SS36_.jpg"
            },
            {
                "asin": "B0BCJZXTYV",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/21guCgI62mL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "400",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31uZFytQwcL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41oEL6LF0qL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nFnEYeEpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41T6VPxYEDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4190tRYdOOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DMBvDpM9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71TbZ6ReRTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/039be39c-37c8-41b7-af7d-54730faaed22/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bdfa567-a047-40fe-921e-6c6ea66c86fa/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a641a8f-ca06-427a-a4b0-f46bc6c3f66b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ef1cccd-792d-41b1-a670-1704557c6aab/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c379994e-97b4-41a7-b6ee-0edb172a2660/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/020ef7c0-178d-4902-9e88-dd1f31b87e12/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the TECKNET Store",
            "link": "https://www.amazon.com/stores/Tecknet/page/336C1DB5-3B3F-4E43-8058-0668D7B57F88?ref_=ast_bln"
        },
        "brand": "Tecknet",
        "merchantInfo": "YOUREE Direct",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 17177,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 2 hrs 43 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "6 DPI and 6 Buttons: TECKNET bluetooth mouse has 3200/2400/2000/1600/1200/800DPI. Six efficient buttons and six adjustable DPI levels that allow you to freely control the mouse speed. Connects directly to Bluetooth-enabled device laptop computer or PC without the need for a receiver.",
            "TruWave Technology: The accuracy of TruWave means you'll enjoy smoother tracking on almost any surface. With its wireless bluetooth connection and TruWave technology, it works almost anywhere, from a café to a park bench. You can even use the TECKNET bluetooth wireless mouse on smooth material surfaces.",
            "Ergonomic Design: The ergonomic design and soft rubber grip perfect to fit your hand for a comfortable grip while reducing wrist fatigue caused by long working hours. The compact size makes it easy to take with you whether you use your computer at home, at work or anywhere else.",
            "Comfortable and Durable: TECKNET computer mouse is made of skin-friendly, super durable wireless mouse with perfect performance on 10,000,000 clicks keystroke test! If you have problems with product, please contact us to solve it for you.",
            "Long Battery Life: TECKNET bluetooth mouse for laptop can up to 24-month battery Life. It takes only 2 AA battery but NOT INCLUDED.",
            "Wide Compatibility: TECKNET bluetooth mouse compatible with Windows (Win 11, Win 10, Win 8.1, Win 8, 2003, 2000, XP, VISTA, etc)Suitable for desktop, laptop, PC, MacBook, Chromebook and other devices. (Please note: The side buttons DO NOT work for Mac OS devices due to compatibility issues. Other Buttons function normally)",
            "36 MONTHS SUPPORT: If you encounter any problems in using the product, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2.8 x 1.7 x 4.4 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.52 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07C2NL5HK"
            },
            {
                "name": "Item model number",
                "value": "8541666472"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 17,177 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#42 in Computer Mice"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 27, 2017"
            },
            {
                "name": "Manufacturer",
                "value": "TECKNET"
            },
            {
                "name": "Brand",
                "value": "TECKNET"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Ergonomic Design"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page High Sensitivity Precise Control Make alternating screens easier, ensuring smoother and more reactive responses. Tracks on Any Surface You'll enjoy smoother tracking on almost any surface. Ergonomic Design TECKNET bluetooth mouse has a contoured shape and soft rubber grips to reduce 30% muscular strain. Bluetooth 5.0 Bluetooth 5.0 allows for a reliable connection of up to 15 meters. Next page 1 6-Level DPI Adjustment 2 TruWave technology 3 Ergonomic Design 4 15m Connection Distance",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6987b68d-6936-4963-b385-2811fdc4214e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bdfd812e-7e6c-4cd2-b761-c25b54e727b2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e4f198b-b4e9-4faf-8519-0ea8ebfba35d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3d0655f1-7764-44ac-99f2-26262b713c00.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/266eb74c-3588-4992-94f6-14d6e5cd5fdd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fe29db41-7b98-4d50-973a-fa82c2d6ebe0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9d7c4238-cb05-4a5f-9e0c-4fefd06dcc37.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7729352e-d3c0-44bc-8a9a-f0b48391e642.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Greg Moore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7LNLHSS3QVMV4BURVNMW6XC4HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNAFXMO3EACAW?ASIN=B07C2NL5HK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Who would have thought....",
                "reviewText": "I'm a hard core fan of Logitech mice. My primary mouse is an MX Master 3 and I love it. On my gaming laptop I was using a Targus bluetooth 'travel' mouse, I've had it for many years and its worked well but the clip on back top of the mouse slides back for the batteries access, broke. So I needed a new mouse.Since I wanted an inexpensive mouse that I could use on any of the devices I have that use bluetooth and I wanted it battery powered. How many of you have had a rechargeable device fail when you needed it and then had to wait, sometimes hours, for whatever to recharge when it would have taken seconds to replace the batteries. So I saw this mouse, it was very inexpensive (compared to Logitech or other name brands) and it had a LOT of reviews and had all the things I wanted, so I bought it.So here's the good:- I have large hands and while a little smaller than a full size mouse it's a nice size in my opinion. Not as small as the Targus but not as big as the MX Master 3.- it was very easy to pair with Windows 11 (games only) and my MacBook Pro (mostly work)- the dpi is very easy to adjust and easy to see the effect.- the scroll button work well and is quiet but there is tactile feed back.- the mouse buttons are easy to press and quiet.- the sleep mode works well and I don't know if I'll get 24 months.- 36 month warranty on a $14 mouse. impressive.The maybe not so good:- There is no mouse software for the device. This is good and maybe not so good. I haven't really decided but to be honest I usually don't use it much when it is provided.- The top shell is all one piece and there is a slit cut for the right and left buttons and space for the scroll wheel. I'm not sure if this is good or bad but it is different from every other mouse I have. I guess time will tell.The Bad & the Ugly:- I have not experienced anything that I would label as such.Other observations:- The battery compartment is on the bottom of the mouse.- it had a nice weight. there are no weight adjustments like I've seen on gaming mice but I've never owned a mouse that like that so....- Its worked well for the Steam games that I've played.- The purple is a nice shade and beats the heck out of yet another dark gray/gray/silver mouse.This is a far far better mouse than I ever expected. I would recommend this to anyone with the caveat that these are initial impressions after only a few hours of use and my opinions, over time, may vary.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John M. Hammer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6NXMOEOIIPCL6QRQODTF2EZWNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLBMX1B3HJSHX?ASIN=B07C2NL5HK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2015",
                "reviewTitle": "5.0 out of 5 stars Review of TeckNet BM306 Bluetooth Wireless Mouse (Replaced by: New Model BT5.0 Mouse)",
                "reviewText": "For some reason, Technet is still using this same listing on Amazon that used to be for their discontinued BM306 mouse for this fairly new model, the EWM01308 (it will be identified by your computer’s Bluetooth module as “BT5.0 Mouse”). The old BM306 was a good value, this mouse is about the same price but even better. It is a little larger, has better heft because it uses two AA batteries instead of just one, there are six DPI settings instead of three, and the color of the side buttons is an undistracting black instead of red. It tracks smoothly, the buttons are slightly noisy but all work well (fully compatible with my Mac and the BetterTouchTool driver software I use), the scroll wheel is smooth and fairly quiet but has nice tactile stops. I can’t comment on the battery life yet. I especially like that the mouse generates basic Button 3, Button 4 etc. values instead of the buttons being hard-coded for Page Up, Page Down, etc. as are Logitech and many other mice because the basic Button X values make using third-party mouse drivers much easier. This mouse is a great upgrade relative to the old BM306 and at the current price of between $11 and $16 depending on what color you choose and what discounts are currently being offered, it is a fantastic value. If Technet revised this mouse again I hope they add a third thumb button and a tilting scroll wheel but it’s quite nice as it is.Below is my old review of the BM306 from about 6 years ago:————— ————— —————Over the last 25 years I've owned a bunch of mice and and similar input devices ranging in quality from the crappy hockey puck that shipped with the first iMacs to some really nice Logitech units. I currently spend most of my time using an Apple Magic Mouse supplemented by an Apple Magic Trackpad and sometimes an Apple Bluetooth Mighty Mouse.Recently I've been playing some games and while the input devices I have were working OK I really wanted a few more buttons and physical buttons rather than just a touch surface over one big button. I gave some thought to pulling out one of my old Logitech MX1000 mice, which are really great, but while wireless they rely on a base station that has to be plugged into AC and a USB port, neither of which I wanted to bother with. I looked at Logitech's current offerings and all the mice I like use a unifying receiver which fits into a USB port and I didn't want to dedicate a USB port for this purpose.Just browsing mice on Amazon I saw this one, the TeckNet BM306. Bluetooth, 5 buttons (left click, right click, scroll wheel/middle click, and a pair of thumb buttons), a scroll wheel, and it seemed to be normal size, i.e. not huge but not made to be especially portable/tiny, either. The price caught my eye, too: Under thirteen bucks. The reviews were mixed but I decided to give it a try.The tracking is smooth and it works on my bare desk, my mouse pad, my thigh, and the arm of my leather lounge chair. I didn't spend time testing it on other surfaces such as mirrors; why would I ever want to use it on a mirror? All the buttons click and register with a good feel but a bit more volume than you might desire if using it in a shared space.The tracking speed, even at the lowest resolution, is faster than my Magic Mouse but tolerable so I don't have to adjust system settings every time I pick up the TeckNet mouse or resort to third-party drivers which allow tracking speed to be set on a device-by-device basis. I'll never use the button on the mouse to change the resolution but for those who find that useful you press that button once and the resolution changes and then the button flashes between one and three times to tell you which resolution setting you just changed to. If this were a function I was going to use I would prefer a slide selector on the bottom of the mouse rather than a button on the top with a flashing light indicator whose meaning has to be memorized.The scroll wheel works very nicely with a perceptible but smooth click as it rotates. Nothing's as good as scrolling with a touch surface but as physical scroll wheels go the one on this mouse is fine. I liked the scroll wheel tilt/left-right scroll/left-right buttons on my Logitech MX1000 mice but if I wanted more buttons I guess I would have looked at some other mouse instead of the BM306.I have a bit of third-party software on my Mac called BetterTouchTool which allows me to assign pretty much whatever functions I like to my mouse buttons. By default, the thumb buttons are back and forward which, in a web browser, will take you to your previous page or the reverse. I prefer to have them work as page down and page up in most applications (although it barely matters since I'm only using this mouse for a few games). Something like USB Overdrive would allow even more customization but BetterTouchTool is good enough for my current purposes and I have it running all the time for other functions, anyway.I wish the thumb buttons were a muted silver or black because the mouse is very professional-looking except for those red buttons on the side. A very minor quibble to be sure but the mouse would look less cheap with a different color choice on these parts.I haven't owned this mouse long enough to verify the claimed battery life but the mouse has three progressive, automatic, and very aggressive sleep modes so I wouldn't be surprised if a single AA battery were to last 15 months. I use rechargeable batteries so it will be a bit shorter for me but as long as it lasts a few weeks I'll be satisfied. In fact, I wish I could disable or at least adjust the mouse's power-saving behavior because while it wakes up with a click and reconnects to my Mac in just a second or three I'd rather that it not go into sleep mode in the time it takes me to walk to the bathroom, do number one, and walk back to my office. This is the only real complaint I have with the mouse and it's a very minor issue. I imagine that it might be more of an issue for users of non-Mac computers which tend to have less reliable communication with Bluetooth devices and I think that's likely the cause of the connection issues reported in most of the low-scoring reviews here. Less aggressive activation of power-saving sleep modes would probably eliminate most of these complaints.At this price I'm quite satisfied with my purchase. The mouse is a great value and if you can live with the infrared rather than a laser, it has enough buttons for your needs, you're right-handed, and you don't have baby or gargantua hands; it's well worth a try especially with Amazon's guarantee backing up your purchase.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dennis Voorhees",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXMG6AXVGVWE2U7AHJQC77Q2FOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DEA7E0WQ8EOE?ASIN=B07C2NL5HK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "4.0 out of 5 stars Works Well, great price.",
                "reviewText": "For various reasons, I've purchased a couple computer mice this year. None cost more than 20 dollars, and they were Bluetooth/wifi capable mice. Both failed to connect on Bluetooth after several months. I like BT, my laptop computer is capable of it, and it doesn't eat up a port like Wifi. I shopped on Amazon and found this mouse. The price was right, it took 2 AA batteries, and they are rated for 6 months or more. The extra weight feels solid in my hand. I've had this about a month and am very pleased with it. It's very responsive and the Bluetooth connected quickly and flawlessly.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert K. Sischka",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH32PEKTOGN6I6IQIUFBQ7HG67VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YRL8KJYTSV1N?ASIN=B07C2NL5HK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic for the price!",
                "reviewText": "I needed a mouse for my new work laptop and prefer bluetooth as I don't like dealing with an RF receiver, which blocks a possibly needed USB port. Found this one on a lightning deal, read the reviews, and felt it worth a try for less than $10, which is quite a bit less than some brand names out there. It arrived promptly and Win 11 recognized it almost immediately after I pushed the 'pair' button on the bottom of the mouse. It has good size and weight and, so far, has been working perfectly: scroll wheel works well and right and left clicking are easy and response is immediate. There was no special software for the mouse to be downloaded; however, I rarely have even bothered to look when there is, generally sticking to the 'generic' settings, where you can make most basic changes within the OS software (both Windows and MacOS) for general operation. I like replaceable batteries since you don't have to worry about the mouse quitting on you in the middle of a project and having to track down a charger cord and a place to plug it in. They say the batteries will last for up to 36 months.....I'll be happy if they go half that long. Remember to register with the seller to get a 3 year warranty, too! Recommended.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Vanwissen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 24, 2023",
                "reviewTitle": "Nice mouse",
                "reviewText": "Seems to be working perfectly",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deepak RahejaDeepak Raheja",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 10, 2023",
                "reviewTitle": "WORST MOUSE WITH WORST SELLER I HAVE CONTACTED ON AMAZON.",
                "reviewText": "not comfortable not complete product delivered.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61v99RX-SjL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "N. Helps",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 31, 2021",
                "reviewTitle": "Great product for the price",
                "reviewText": "This is not the cheapest or (by a long shot) the most expensive wireless mouse, but I think it is very good value. It arrived quickly in frustration free packaging that was easy to open. The mouse is wrapped in bubble wrap in the cardboard box and that does make it easy to access. Apart from the mouse you get an instruction leaflet with basic information in several languages and a warranty card (24 months, which is good to see). This is Bluetooth only, so no usb dongle to plug in (main reason I bought it, since don’t want to tie up USB ports). Two AA batteries inserted (I used NiMH, which work fine) then turn it on and press the bind button while the laptop was searching for new devices. The laptop found it almost immediately and the mouse was ready to use in seconds. The mouse feels solidly made with quiet buttons that need little pressure and a really responsive scroll wheel. As others have mentioned, the mouse is quite heavy with the two AA batteries, but this is no bad thing and it sits nicely in the hand, so still easy to move on the glide pads. The surface of the mouse feels smooth but not like cheap plastic. Early days, but so far it works perfectly. I leave it powered up and it goes to sleep between uses. Just press a button and it comes to life again when the computer is woken back up or started up from being turned off. I cannot fault it yet and I am very happy with it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Touhid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 13, 2019",
                "reviewTitle": "overall works nicely",
                "reviewText": "The back and forward button only work while browsing internet. These two buttons do not work in Microsoft apps such as word",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "Tracks well",
                "reviewText": "Instant BT recognition with my older MacBook Pro. Tracks well; sleep mode sometimes needs a reconnection. Otherwise, it's nice to not have a USB port taken up with a wifi connecter--straight Bluetooth, so JUST the mouse and nothing else.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}