{
    "remaining_requests": 47280,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-Anywhere-Wireless-Mouse-Rechargeable/dp/B075Y8ZVBB",
    "body": {
        "name": "Logitech MX Anywhere 2 Wireless Mouse – Use On Any Surface, Hyper-Fast Scrolling, Rechargeable, for Apple Mac or Microsoft Windows Computers and laptops, Meteorite",
        "price": "$58.99$50.99",
        "originalPrice": "$79.99",
        "rawPrice": 58.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-Anywhere-Wireless-Mouse-Rechargeable/dp/B075Y8ZVBB",
        "soldBy": {
            "sellerID": "AC9E7J2BK3P81",
            "name": "Montre Le Trajet Inc.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AC9E7J2BK3P81&asin=B075Y8ZVBB&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UXXMN3XAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31uFbOjthCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kGeRimcEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31yhC3s5VhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41x NcdNXeL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71QLEN0brtL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1w8SbH+8OL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "Sold by PNR Sales and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 2236,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 2 hrs 43 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "CROSS-COMPUTER CONTROL - Game-changing capacity to navigate seamlessly on three computers.",
            "DUAL CONNECTIVITY - Use with up to three Windows or Mac computers and laptops via included Unifying receiver or Bluetooth Smart wireless technology",
            "WORKS ANYWHERE - 4000-dpi Darkfield sensor tracks flawlessly virtually anywhere, even on glass",
            "HYPER-FAST SCROLLING - Scroll through long documents or web pages faster and easier. Or press the wheel and shift to click-to-click mode for precise navigation",
            "RECHARGABLE BATTERY - Up to 70 days of power on a single charge, and one minute of charging gives you up to one hour of use; Battery: rechargeable Li-Po (500 mAh) battery."
        ],
        "description": "Portable precision anywhere you work. Your job doesn't just happen in a room with your name on the door. It happens in coffee shops, airplane seats, hotel rooms and off-site meetings. The compact and powerful MX anywhere 2 Works everywhere you do and on virtually any surface-even glass",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Item model number",
                "value": "‎910-005229"
            },
            {
                "name": "Hardware Platform",
                "value": "‎Laptop, PC"
            },
            {
                "name": "Item Weight",
                "value": "‎3.68 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.4 x 1.4 x 3.9 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎2.4 x 1.4 x 3.9 inches"
            },
            {
                "name": "Color",
                "value": "Meteorite"
            },
            {
                "name": "Power Source",
                "value": "‎Battery Powered"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Manufacturer",
                "value": "‎Logitech"
            },
            {
                "name": "ASIN",
                "value": "‎B075Y8ZVBB"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎September 25, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 2,236 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,945 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #360 in Computer Mice #531 in Climate Pledge Friendly: Computers"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Bluetooth"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB7TDGZAASLRE4W2NP3I5DJ5P3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JBEF7VJM2CJL?ASIN=B075Y8ZVBB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Works on any surfacew",
                "reviewText": "This mouse is great. It fits well in my hand. The key feature is that it works on our granite countertop where I use my computer. Other mice just don't track well on that surface. I like that it is rechargeable so we don't need to buy batteries.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnnaAnna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAJ3XU7ZSYFNZH2XUI4U76QP4PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BW8OD1Z2XETN?ASIN=B075Y8ZVBB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2021",
                "reviewTitle": "5.0 out of 5 stars So Far, So Good",
                "reviewText": "Second Edit as of July 8, 2021: I had a hard drive from an old laptop hooked up via an HDD dock, and while looking through the files, the mouse was having *serious* lag issues. I can confirm it's the mouse itself because the trackpad had absolutely no issues whatsoever. The issue also went away when I turned the HDD dock off and disconnected it from my laptop. Right now, it's working right as rain with no issues.Not a major issue, but incredibly annoying and time consuming, as I have to wait several seconds at a time for the cursor to reach the spot that I need.(Note: This could potentially be attributed to the hard drive in question being full and well over a decade old.)Edit as of June 22, 2021: The mouse is still working perfectly. No issues to speak of and I just got the \"critical battery level\" message today. I fully charged the battery when I first received it (April 24, 2021), so it has lasted an approximate total of 59 days. This is after having used it nearly every day for up to 10 hours a day. If you don't use your mouse nearly as much, I imagine you will be able to stretch the time between each charge.Definitely worth what I paid.Original Review: I previously used the AA-battery powered Logitech M325. Just a cheap little $20ish mouse that has lasted about 7 years (purchased it back in 2014 I believe), but just recently developed the dreaded double-clicking issue; it was beginning to drive me nuts. I had already been looking to upgrade to a rechargeable mouse in order to save myself the trouble of going through a multitude of external batteries - though the batteries always lasted several months at a time.Obviously a rechargeable version is going to be a little more spendy, but I wasn't exactly interested in spending $80 on the newest version of this mouse, especially if I ended up not liking it. I figured an older model that was $30 cheaper, and still has essentially the same functions/features, would be a better alternative.Just got it today (April 24, 2021) and first impressions so far are pretty great. No trouble plugging it in to charge, it feels great in your hand, and operation is very smooth. It feels nicely built, very solid - definitely not cheap at all. Feels exactly as I would expect a $50 mouse to feel.Logitech also has a program you can download to your computer to get more out of your new device. Very intuitive and user-friendly, and you can better monitor the battery life of the mouse.However, I do have one or two small gripes with this mouse.- My M325 had an internal storage slot for the USB connector so that I wouldn't have to leave it attached to my laptop, or have it loose in my travel bag. The MX has a *slightly* more low-profile USB connector, but no internal slot to store it. Not a huge issue, but just a little creature-comfort that I'm going to miss.- The only instructions that came with the mouse were in the form of a sticker on the bottom of the mouse. It took a few minutes of dinking around on Logitech's website to figure out how to actually connect the mouse to my laptop. Though once it did connect, I haven't had any issues whatsoever.(note: I am using the USB connector, NOT bluetooth)- Clicking the scroll wheel will switch between two different scrolling modes, and they will feel different. I prefer feeling the wheel \"click\" as I scroll, but the clicks on this mouse feel a bit clunky. It's not terrible, it definitely does not detract from the performance of the mouse, it's just a tactile thing that I'm not a big fan of.Overall though, it's a great little mouse so far and I am definitely very happy with it's performance out of the box. I'll be interested to see how it holds up once it's been in use for x amount of weeks/months/years.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81+Ue3yOXcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Im0nti4kL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81V8FVHRvkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81dn8EDfyoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81kZJq07DyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91MDogGyVpL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKVT4QCJSQC23S6RPIDZVOV23TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VNO4GL2NBW7X?ASIN=B075Y8ZVBB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2019",
                "reviewTitle": "5.0 out of 5 stars Great all-rounder, especially when you don't have a desk/mouse pad.",
                "reviewText": "I got this to use as a mouse to swap between various computers/projects/in-progress builds especially while troubleshooting. My primary day-to-day mouse is the wireless G602 (technically a 'gaming' mouse, but I use it for productivity and general tasks), which I love so much I have one for home and office. But it really could not track well when I found myself working with the couch, my pant leg, my other hand etc. as my mouse surface. So really I bought this hoping it would do what it says on the tin and work anywhere.Pros:- Better tracking, consistency, and accuracy than any other mouse I've tried (MX Master 2S, M385, M325, G602).- Somewhat subjective, but I find it very comfortable, which isn't a given for me (hence buying two of the same mouse as mentioned above). It's on the smaller side, but still very solid.- Recognized and started working immediately by multiple computers without any fuss using the receiver. So far with Windows 10, Server 2016/2019, Windows 8.1, and even in the bios with the receiver plugged into the USB port on a wired keyboard (K70). Very much plug and play in my use cases.Cons:- The USB receiver is small. Not the standard 'small' of most receivers, some how even smaller. It protrudes about 50% as much as the G602 receiver. That said it does have a tactile groove/notch so I suspect this would be a non-issue if I could stop biting my fingernails for a day or two...Other notes/can't comment yet:- Size: I find the size to be a good happy medium for something intended to be at least somewhat portable. I wouldn't want it in my pocket all day, but could definitely keep it there getting from A to B.- Charging/Battery: there is no replaceable battery but it charges with the ubiquitous micro USB. Can't speak to the durability of the charge port and I haven't done a stamina test on a full charge.The things it does well--tracking on arbitrary and difficult surfaces--were my top priorities. Overall I'm very pleased with the mouse so far.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIT7D2KXLSEYQPY6EVN7CNEDFNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E0CUVKWCVB5F?ASIN=B075Y8ZVBB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2022",
                "reviewTitle": "5.0 out of 5 stars My Favorite Mouse!",
                "reviewText": "Too much Mac trackpad, my fingers and hands needed something more ergo (or at least, a change).This mouse is nice. Works on any surface, and is bluetooth. (It comes with a dongle, but why use one additional part, when zero will do just fine?)Note that the MX2 has SEVEN buttons, but they reduce this on the MX3 to five. On the MX3, the scroll wheel no longer clicks side-to side. By default, this is set to pan left and right ... it's useful on the default setting, but can be customized.(Logitech claims one more button, but this is the \"scroll wheel shift,\" not really a button.)You will probably want to install \"Logitech Options\" to get all the features. This is basically essential on the Mac, otherwise the scroll wheel will scroll the opposite direction from every other mouse you have used.(That's actually Apple's fault, but the Logitech software fixes this.)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gustavo S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 23, 2019",
                "reviewTitle": "Buen producto",
                "reviewText": "buen producto, llego a tiempo, he tenido fallas de configuración en mi lap top, es liviano, sin embrago el costo es mucho a comparación con el nuevo modelo que esta con mas funciones.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michaela Bass",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2020",
                "reviewTitle": "Repeat Purchase I love it so Much!",
                "reviewText": "This is a fantastic mouse that I have purchased before. The features are convenient and efficient and I love that the mouse is rechargable to save using disposable batteries. The charging cable is easy to take with you and the mouse holds a charge for weeks even with using it 7-10 hours daily. I expect this mouse will last several years just as the one I purchased 4 years ago did.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jaune",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 28, 2020",
                "reviewTitle": "Incredible mouse",
                "reviewText": "I really like this mouse. The last one I had was connected through a dongle which destroyed my usb port . This one has Bluetooth. battery life is amazing I haven't even charged since I got it and it's still going. Size wise it's kinda small but ergo is great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tyrone H.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 7, 2021",
                "reviewTitle": "No complaints from my boss",
                "reviewText": "Bought this at the request of my boss, he wanted an upgrade to the wireless logitech mouse he was using. He's not tech saavy in the slightest and is resistant to change, but he'd mentioned ages ago about not liking having to replace the batteries in his mouse. So I got him this one with a built-in rechargeable battery; looks the same as his old mouse, just a bit sleeker and more functional.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher Soriano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 23, 2020",
                "reviewTitle": "The names says it all.. MX ANYWHERE 2 LOGITECH... 100% no regrets",
                "reviewText": "I've been using MX Anywhere 2 for days and honestly I'm speechless the response of the mouse motion is superb no delays. The Bluetooth connection is fast easy to set up, fast connection on changing device from my PC to my iPad and I also tried it on my iPhone x. What I love the most is the mouse wheel because you can click it to go infinite scrolling for long pages and click it again to go back to a regular scrolling. The clicks are not that loud and not that hard to press or click, hand angle comfort dose not strain my hand for long hours of use. Budget wise compared to MX Anywhere 2s this is a must-have and they have the same functions as well. But if you do have a budget for the MX Anywhere 2S id go for it, but if not you won't regret choosing MX ANYWHERE 2 100% legit no regrets. Happy using it recommend this to my friends and family members.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$57.88",
                "sellerName": "AAA-Shop",
                "sellerRating": "4.5"
            },
            {
                "price": "$73.54",
                "sellerName": "OneDealOutlet Online",
                "sellerRating": "4"
            },
            {
                "price": "$73.99",
                "sellerName": "PRODUCTS 360",
                "sellerRating": "4.5"
            }
        ]
    }
}