{
    "remaining_requests": 47289,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bluetooth-Rechargeable-Wireless-Notebook-Laptop/dp/B07KNQRQ3P",
    "body": {
        "name": "Rechargeable Wireless Mouse for MacBook Pro/ Air,Bluetooth Mouse for Laptop/PC/Mac/iPad pro/Computer",
        "price": "$11.88",
        "originalPrice": "$12.69",
        "rawPrice": 11.88,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bluetooth-Rechargeable-Wireless-Notebook-Laptop/dp/B07KNQRQ3P",
        "soldBy": {
            "sellerID": "AIIZELO7KIU61",
            "name": "ZERU",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AIIZELO7KIU61&asin=B07KNQRQ3P&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B15L74B3"
        ],
        "asinVariationValues": [
            {
                "asin": "B08DTSTWVV",
                "variationName": "Color",
                "variationValue": "BT blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ckpQgw03S._SS36_.jpg"
            },
            {
                "asin": "B07P6JYF34",
                "variationName": "Color",
                "variationValue": "BT pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31YJFKiB4bL._SS36_.jpg"
            },
            {
                "asin": "B07K7QJNQ1",
                "variationName": "Color",
                "variationValue": "BT yellow",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41pzBs42xsL._SS36_.jpg"
            },
            {
                "asin": "B07L6MMFPJ",
                "variationName": "Color",
                "variationValue": "Gray",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41pXc1SQ9kL._SS36_.jpg"
            },
            {
                "asin": "B07P7MT5F1",
                "variationName": "Color",
                "variationValue": "Gray＋White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41M9trM-u3L._SS36_.jpg"
            },
            {
                "asin": "B07K273XVV",
                "variationName": "Color",
                "variationValue": "Rose Gold",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41EPGHT1MXL._SS36_.jpg"
            },
            {
                "asin": "B07KNS34ZD",
                "variationName": "Color",
                "variationValue": "Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/412YH-lSUdL._SS36_.jpg"
            },
            {
                "asin": "B07L6N1NTY",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31QeRUvwUIL._SS36_.jpg"
            },
            {
                "asin": "B07KNQRQ3P",
                "variationName": "Color",
                "variationValue": "black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41IKU2+pRKS._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "200",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41IKU2 pRKS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51bZUaPH3 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Glplxq1FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31LAcctDYSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zxQp2iJLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41awCeyuyzL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: ZERU",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=ZERU"
        },
        "brand": "ZERU",
        "merchantInfo": "ZERU",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 26892,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 2 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[BEST COMPATIBLE BLUETOOTH 4.0 CHIP] - Compatible with more than 99% Bluetooth devices. Connect Pad 10.2 2019, Pad 9.7 Inch 2018, Pad 9.7 2017, Pad Pro 12.9\" / 11.0\" / 10.5\"/ 9.7\", Pad Air 10.5 / Air 2, Pad mini 5/ 4, Phone 11 Pro Max, Phone 11 Pro, Phone 11, Phone Xs Max etc.( Note: Updated System to PadOS 13 and iOS 13 or above, and Turn on the ¡°Assistive Touch¡± ) PC, Macbook pro air 2012/¡­2017/2018/2019 laptop, notebook, Mac OS; Support Win7 Win8 Win10 Linux OS X or Android tablet.",
            "【Skin-Friendly for Comfort】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. The sturdy anti-slip rubber scroll wheel ensures that your hand will not slip when scrolling.",
            "【Rechargeable Optical Wireless Mouse】Built-in durable 450mAh lithium rechargeable battery can last up to 500 hours after fully charged, and standby time is super long with auto sleep and wake mode. Easily recharged through the included USB cable, no need to change the battery.",
            "【NOISE FREE】Quiet click sound when pressing buttons, which makes you away from worrying about bothering others, especially at home while other family members having rest, so that you can stay focused on your work.",
            "QUALITY GUARANTEE: One year quality warranty for this bluetooth mouse from ZERU"
        ],
        "description": "1 Support Devices Including:Windows、Android、macbook Series Pad Series ( Note: Updated System to Pad OS 13 or Above and Turn on the “Assistive Touch”You need to open the function of “AssistiveTouch” with the following steps to set it: Setting - Accessibility - AssistiveTouch )New Pad 10.2 2019, Pad 9.7 Inch 2018, Pad 9.7 2017, Pad Pro 12.9\" / 11.0\" / 10.5\" / 9.7\", Pad Air 10.5 / Air 2, Pad mini 5/ 4.Phone Series ( Note: Updated System to iOS * Bluetooth version: Bluetooth 4.0* Photoelectric resolution: 3 adjustable DPI level (1000 / 1200 / 1600DPI)How to use the Bluetooth mouse:1. Charge for 2 hours before first use，the blue light is on when charging, the blue light is automatically extinguished when fully charged，pairing open the Bluetooth mouse (switch to \"on\"position), press the black circle \"Bluetooth connection button\"More than 3 seconds.2. Turn on the computer Bluetooth or toward the Bluetooth signal in the bottom right corner of the computer screen. Right click to select \"add device\", then the Bluetooth will enter the search state. (Note: Bluetooth normally has a Bluetooth logo in the lower right corner of the computer, if it normally starts.)3. Wait for the computer to search interface into the Bluetooth device, the Bluetooth computer can search a mouse shape icon or \"Bluetooth Mouse\", that is the Bluetooth mouse, and then click next to start the match, the pairing is successful mouse begin work.Note!!√ If your device does not have Bluetooth, you need to install the Bluetooth adapter first.√ If you do not use the mouse for a long time, turn off the \"ON / OFF\" switch.√ In order to save battery life, please do not charge the mouse when there is electricity.√ Rarely occurs on the mouse connection problem, if the connection is not on the deletion of the current Bluetooth driver, and download the correct Bluetooth",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4 x 2.3 x 0.04 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.04 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07KNQRQ3P"
            },
            {
                "name": "Item model number",
                "value": "ZE689"
            },
            {
                "name": "Batteries",
                "value": "1 A batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 26,892 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#24 in Computer Mice"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "November 18, 2018"
            },
            {
                "name": "Manufacturer",
                "value": "ZERU"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "ZERU"
            },
            {
                "name": "Color",
                "value": "black"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Portable, Rechargeable, Soundless, LED Lights"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Trevor Holmes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENUFRGQDQJU55KZGF2NPFTZHXQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NXW3DGNP5HSP?ASIN=B07KNQRQ3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2022",
                "reviewTitle": "5.0 out of 5 stars Works beautifully with Fire HD10",
                "reviewText": "Summary: if you're looking to convert a Fire tablet to a laptop substitute, add the Fintie keyboard case and this mouse and you're there.Pros: highly compatible with Amazon Fire HD10, absolutely painless to set up and use, rechargeable, responsive (with easily adjustable resolution/cursor speed), and small enough to carry with you without difficulty.Cons: will somebody please implement drag and drop? Thank you!Unknowns: durability? But it worked out of the box, which is more than I can say for (ahem) Amazon's Choice in this category.I've been using a wireless mouse with my laptop for a couple of years now. My primary use is wordprocessing; I do some of my work on a Fire HD 10/Fintie keyboard combo, but was missing the mouse. This little rodent arrived the other day, and on the basis of about eight hours' work with it, I'm in love.It arrived in a box that looked as if it had been stepped on, but despite the complete lack of padding inside the shipping carton, the mouse in its manufacturer's box was undamaged. It was already charged, and paired with the Fire HD immediately. It works with every piece of software I've tried on the Fire HD (MS Office, Mobisystems OfficeSuite and File Kommander, Outlook, Silk browser, Zoom, Dropbox, etc.) without a glitch. The only feature that doesn't seem to be implemented in MS-Word or OfficeSuite is drag and drop--otherwise, it's no different from using the mouse with a full-featured laptop office package. I haven't used it for gaming, so can't really speak to performance at that level, but as far as ordinary point-and-click mousing around goes, its response time isn't noticeably different from what I see on my desktop with a wired mouse.Design is good. I have a touch of carpal tunnel in my right wrist, and the flat profile has not aggravated it the way some of the humpier mice have done. The two buttons have a nice distinct tactile click that's quiet enough that it shouldn't disturb anyone else in the room. The scroll wheel is relatively small, about half the size of the wheel on my other mice, but in use the difference isn't noticeable. One nice feature is a small switch located between the buttons, just aft of the wheel, that allows you to choose among three levels of resolution (i.e., to speed up the cursor or slow it down), very useful in a highly portable setup, where you're likely using the arm of a chair as your mouse pad and don't have much room to maneuver the mouse. This switch is out of the way until you need it, but when you do it's very easy to adjust. The on-off switch and pair buttons are on the sole of the mouse, where you expect to find them--no surprises or problems with either. There's supposed to be a sleep mode, but I haven't noticed it in action, so either it's not there or it works so well as to be completely unobtrusive. Finally, the thing is rechargeable, via a mini-USB port on the front, and an included (short) cable; the instructions give specifics on charging parameters, nothing unusual there except a note to make sure it's turned on while charging. No idea what that's about, but I missed it the first time through so passing it along here. Per the docs, it should hold a charge for a long time, but I haven't used it long enough to notice. It seems to reach full charge in a couple of hours, signaled by a light on top changing from red to blue. All in all, this mouse has been designed to work without demanding much attention from the user (which is the point of design, isn't it?). I couldn't be happier with it.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Polly Mertens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET5VHZNFTKK6YFWVVG6TPOXAEJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO7WPVQMNUT6W?ASIN=B07KNQRQ3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars great little mouse!",
                "reviewText": "I bought this one after a previous bluetooth mouse was dropped and stopped working. I'm glad it did - this one is much better! The other one looked almost exactly like it, so much so I thought I ordered same product. This one is more solid - just built better. It charges better, feels higher quality than my last one. Just wanted to say I'm glad that one died and I got this one. light weight, works well, feels like it will last a good long time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JeepGirl78",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESDOW6GULJLQSIXYQM3ALP3I6ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R313EWGWNB1M2C?ASIN=B07KNQRQ3P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2022",
                "reviewTitle": "4.0 out of 5 stars UPDATED! Great little mouse - pros and cons after several months of use",
                "reviewText": "UPDATE 1/18/23: After using for several months, the laser has suddenly started moving on its own. This actually creates a lot of issues for me because it moves the mouse pointer on me, and can cause me to completely mess up whatever I'm working on. I'm really disappointed, because everything else about the mouse is (was) so perfect for me.I actually love this mouse. I'm picky about my mouse, so therefore not too easy to please. I don't want all of the extra buttons, I want it to be quiet, and I want it to be ergonomic or at least feel comfortable in my hand. I work from home and I'm on my computer nearly 24/7, so again, I'm picky.This mouse is great, especially for the price. I had zero issues connecting it, it's quiet, it's sleek, and it's comfy. It doesn't have any \"frills,\" which is perfect for me. Please just let me scroll and click - that's all I want LOL. Easy. I have used this mouse now for several months, so I feel like now is a fair time to leave a review.My only complaints so far with this mouse are as follows:1. It doesn't last as long as I'd like.2. **This is my BIGGEST issue.** You get absolutely NO notice of when the mouse is about to die. There are no red lights on the mouse itself. There is no indication or notification that pops up on your screen. NOTHING. The mouse just DIES. When this happens, I thank GOD that I still have my wired mouse connected, and I just switch over to it while charging this mouse. But not everyone wants to keep two mice on their desks. And it would be nice to get some kind of a warning that you're about to lose your mouse... If that can be fixed, this would be a 5-star mouse, with a price that can't be beat!",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fredrik Nyman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO7TJA2YBGNJI6WFJBJQPGNQ7LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B0YFH4X75R7Q?ASIN=B07KNQRQ3P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Works with everything",
                "reviewText": "I've bought several of these over the years - for my PC, for my Mac, for my Playstation 5. Couldn't be happier -- it's comfortable, works great, and unlike e.g. the Microsoft Bluetooth Mouse, it works with everything! And each charge lasts for a long time, AND you can use it wirelessly while charging!It should be noted that this mouse has had a few iterations over the years. The most recent one I bought (December 2023) supports both Bluetooth 3.2 and Bluetooth 5.0. If you're using it with a Playstation 5, make sure you pick \"Bluetooth 3.2 Mouse\" when you pair it; the PS5 doesn't seem to support Bluetooth 5.0.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NH Disappointed",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 26, 2023",
                "reviewTitle": "Fake. Doesn't work.",
                "reviewText": "Does not work. Doesn't even seem real. Our family had a lot of fun pointing out the different parts that looked like toy car wheels, Lego pieces, or empty bits of plastic. Other than that, though, no fun as it will never work.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on July 30, 2023",
                "reviewTitle": "does not work at all",
                "reviewText": "does not work at all",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 13, 2024",
                "reviewTitle": "Doesn't Work",
                "reviewText": "The mouse doesn't work on any smooth surfaces. It's completely useless as a wireless mouse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.88",
                "sellerName": "ZERU",
                "sellerRating": "4.5"
            }
        ]
    }
}