{
    "remaining_requests": 47250,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Corsair-Wireless-Slipstream-Technology-Certified/dp/B082LVNJ4W",
    "body": {
        "name": "Corsair Dark Core RGB Pro SE, FPS/MOBA Gaming Mouse with SLIPSTREAM Technology, Black, Backlit RGB LED, 18000 DPI, Optical, Qi wireless charging certified",
        "price": "$79.99",
        "originalPrice": "$99.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Corsair-Wireless-Slipstream-Technology-Certified/dp/B082LVNJ4W",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41S0Q1AjqWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51fgt5l5VeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xWuFxPn8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51aCqZbpShL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514CXxFW4oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51g99KNL-QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51telr6PObL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1ec58e9f-a2d3-46ed-a49a-3b3364191607/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f9001953-36b3-4f7c-8122-a2db02510bce/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7bd0b777-2083-4945-83fa-522a7939a56a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2a83f276-77fe-4ab5-b3ee-32612a5a8607/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f2a247e2-26fb-4540-a485-9e82eb0b1352/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b92faa19-03a9-4aec-872d-d3c47b87c8f9/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Corsair Store",
            "link": "https://www.amazon.com/stores/Corsair/page/A8559A65-3FF5-4A92-A08B-15F699944A8E?ref_=ast_bln"
        },
        "brand": "Corsair",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2053,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 36 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Three ways to connect: sub-1ms SLIPSTREAM WIRELESS technology, low-latency Bluetooth wireless technology, or USB wired.",
            "Play with pinpoint accuracy and precision thanks to a custom PixArt PAW3392 native 18, 000 DPI optical sensor, optimized for wireless mice with extremely low power consumption and customizable in 1 DPI resolution steps.",
            "Hyper-polling technology communicates with your PC at up to 2, 000Hz, twice the speed of standard gaming mice, ensuring blazingly fast response times.",
            "Charges with an easy-to-use, reversible USB-C connector, or wirelessly with any Qi-compatible charging device such as the CORSAIR MM1000 mouse pad.",
            "Comfortable contoured shape with two included interchangeable side grips for a tailored fit.",
            "Nine-zonedynamic RGB backlighting, including an integrated light bar with five individually addressable RGB LEDs, offers near endless customization of colors and lighting effects.",
            "Get an in-game advantage with eight buttons, fully programmable with custom macros and button remaps.",
            "Up to 50 hours of continuous battery-powered wireless gaming, or plug in for wired mode to continue gameplay while charging.",
            "High-performance Omron switches rated for more than 50 million clicks",
            "Powerful CORSAIR iCUE software lets you assign macros, adjust polling rate, customize RGB lighting effects synchronized across all of your iCUE-compatible devices, and much more."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Corsair"
            },
            {
                "name": "Series",
                "value": "‎DARK CORE RGB PRO SE Wireless Gaming Mouse"
            },
            {
                "name": "Item model number",
                "value": "‎CH-9315511-NA"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Item Weight",
                "value": "‎5 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5 x 3.5 x 1.69 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎5 x 3.5 x 1.69 inches"
            },
            {
                "name": "Color",
                "value": "Multicolor"
            },
            {
                "name": "Power Source",
                "value": "‎Battery Powered"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Ion batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎CORSAIR"
            },
            {
                "name": "ASIN",
                "value": "‎B082LVNJ4W"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎April 7, 2020"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,053 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,409 in Video Games (See Top 100 in Video Games) #182 in PC Gaming Mice #392 in Computer Mice"
            },
            {
                "name": "Connectivity Technology",
                "value": "VGA"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Programmable Buttons, LED Lights"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Dynamic RGB Backlighting Nine-zone dynamic RGB backlighting, including an integrated light bar with four individually addressable RGB LEDs. Pinpoint Accuracy & Precision Equipped with an 18,000 DPI custom PixArt PAW3392 optical sensor, optimised for wireless with extremely low power consumption, and customisable in 1 DPI resolution steps. Qi Wireless Charging Charge wirelessly with any Qi-compatible charging device such as the CORSAIR MM1000 mouse pad.",
                "media_link": []
            },
            {
                "media_text": "Get a Grip Comfortable contoured shape with two included interchangeable side grips.",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "\"The DARK CORE RGB PRO SE is a great match for me - it fits comfortably in my hand and is one less wire for me to worry about on my desk while gaming.\" TeosGame, Professional Streamer",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c81f4e69-d4d5-4c61-86aa-5f80655e87a4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/13eb5b30-824e-4118-8f23-67ef8797c446.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f31d02b6-2bfe-4664-b168-a3117a23125a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02b024d3-05b4-457d-9d5f-03c5be0778a0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5000a250-d96a-4495-b389-4ec634700f02.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b045385a-8f00-42e1-bdb5-650ac1427ade.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6326156a-0073-461c-bf48-139f06ad5707.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6e3b77cf-2b2c-4396-9d66-7d9acc11fe71.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c81f4e69-d4d5-4c61-86aa-5f80655e87a4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5AHEZFGA52R26INILCEVSTG3HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C93RJY0HVITF?ASIN=B082LVNJ4W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2022",
                "reviewTitle": "5.0 out of 5 stars The Best Wireless heavy gaming mouse for large hands.",
                "reviewText": "First things first. I needed a large mouse for large hands and I finally stumbled upon this gem of a mouse that feels like it was made for me. (I was using a G502 previously and found it to be to small). So I decided to buy it and found out that it sold out literally everywhere at my place. So I had it shipped to my country through Amazon Global standard shipping(through Aramex) . Arrived a week early and was well packaged but the box had to opened for a customs check. No items were missing , so good.The mouse is really well built and is a bit on the heavier side but I like my mice heavy. The ergonomics are really perfect for large hands (hand size: 19.5x10cm) and the included pinky rest is a lifesaver for both gaming and work. The mouse feet are really smooth, in fact too smooth that I had to lower my sensitivity lol. All buttons can be customized with Corsair iCUE quick and easy and if you need macros that can be done within the software as well. Some features can be saved to the mouse on-board memory profiles (up to 3) so you do not need the software all the time. RGB is bright and beautiful. The outer body has a textured plastic that is miles better than rubber.Wireless : Corsair slipstream is truly an achievement and I found no difference in performance when using the mouse in both wired and wireless mode. iCUE is only required for the pairing the mouse and the dongle. After that you can turn the software off if needed. I've had some lag (that goes away after 5-10 secs) when trying to use the mouse after the computer starts up or awakens from sleep mode however this is a standard phenomena that occurs with all wireless mice. The mouse is a breeze to use without wires. (the included wire is too stiff and can push the mouse on a flat surface if it gets coiled)Battery and charging: Battery life is average. Mouse lasts for about 9-10hrs with all lights turned on and takes about 2-3 hrs to fully charge. Wireless charging is OK , it takes a bit of time but its really well implemented and mouse lights up white to let you know it it is charging wirelessly with any Qi certified charger. Note: There is no percentage indicator letting you know how much battery is left even in software unfortunately.Miscellaneous issues : I have heard of issues of accidental right click and mushy switches in some reviews. At least in my unit , I haven't had such experiences....yet. (will update if any occurs).Cons: The Corsair iCUE software is a pain to use and it literally crashes my PC when trying to game. Button mapping although easy to do gets ages to save in the software and I finally decided just to save it to the onboard profile instead. Also one major problem I found - If you have a low end PC and you also have other corsair peripherals such a s a Corsair keyboard , the software forces you to save multiple (unnecessary) profiles to both software and onboard memory of BOTH keyboard and mouse to function properly. If it is not done it causes a lot of software glitches and unresponsiveness of keys on the keyboard and DPI buttons on the mouse. Also if you uninstall iCUE with keyboard and mouse connected , It will take away the RGB of both devices for some reason. There is also a bug that says 'your profiles are not saved , go to device settings to save' even if I saved the profile to mouse multiple times. The profiles will work but it is an annoyance to see that pop up again. I strongly recommend you disable the software after you have done all your mapping, wireless and macros if you are on a low end device.Verdict: Overall the best ergonomic mouse that I have laid my hands on. They don't make mice like these anymore after most \"pro's\" switched to ultralightweight mice. Good modular support and ease of use. Only held back by the horrible iCUE software. (P.S -pretty much all mouse software have some issues...although my review thrashes iCUE , I just want you to know that no software is perfect even if it is from Logitech or Razer , it is just a matter of getting used to it until they fix it ).I recommend this mouse.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shira",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED46OZK7HYOH4T2Z2WP6GHQK7TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22E902VWA8P97?ASIN=B082LVNJ4W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Game Changer for a Clumsy Gamer (Like Me)",
                "reviewText": "Let me start by saying I'm not the most coordinated person. Tripping over shoelaces is basically an Olympic sport for me, so you can imagine the carnage my mouse used to endure. Wired cords were death traps, tangled messes that sent my cursor flying off into oblivion mid-raid. Enter the Corsair Dark Core RGB Pro SE: wireless freedom and pinpoint accuracy in a sleek, comfy package.This mouse is a game-changer (literally). The wireless connection is rock-solid, no lag or jitters even during the most intense boss battles. And the sensor? Razor sharp! I can headshot gnomes from across the map now, which is definitely a confidence booster (and probably annoys my teammates, but hey, winning!). Plus, the Qi charging is a godsend. No more fumbling with cables, just plop it on the charging pad and boom, ready to go for another round.So, if you're a fellow klutz like me, or just someone who appreciates a top-notch gaming mouse, do yourself a favor and check out the Corsair Dark Core RGB Pro SE. It's a game-changer, even for the most butter-fingered adventurers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WilzardWilzard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCZTQ3PORY245SZ5AHX4FE273EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RJG9ZCKX5ELY?ASIN=B082LVNJ4W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great hardware, buggy software.",
                "reviewText": "After about a year of use I can confirm that the mouse is great! Customizable grip, battery lasts for a long time, button placement is ergonomic and all of the buttons feel nice. It has nice uniform lighting, comes with a long braided cord, the mouse glides smooth, the cord and mouse are USB-C, and the dongle easily fits inside the mouse so your won't lose it while traveling. It also feels great with any grip type, loose, claw, fingertip, natural, etc., and the overall weight and balance feel superb, as well as the material around the mouse. It works great for long gaming sessions or twelve hours of office work. You can code macros to help with Excel tasks, open a specific app, or have a different set-up for each game you play. Overall the hardware engineering that went into the mouse is 11/10, and the components are durable. That being said...The only downside is that Corsair can't or won't fix the bug that's been in their software since it was created in 2018. It just doesn't play nice with any version of Windows consistently. Four people in my house all have different hardware and software configurations, and we've experienced this bug with multiple PCs and laptops for over five years now. When you boot your PC iCue sometimes won't load at all or won't detect some or all of the Corsair hardware. Mouse, keyboard, mousepad, RAM, fans, AIO cooler, headset etc. The only way to fix it is to reboot the PC or hope that unpluging and repluging in the device works. This not only affects lighting, but fan and pump settings, keyboard and mouse bindings, and general operation of the device. Sometimes the mouse won't even work, because the software won't detect it. Dozens of My friends have had this issue. It happens at least once a week on Windows 10 and 11. Doesn't matter what hardware you have, and no amount of troubleshooting fixes it. Corsair is the only option if you want a centralized, single program controlling all of your devices. RAZER products are borderline garbage at this point and typically breakdown within six to eight months of regular use, and their software is basically bloatware that data mines your PC constantly. Logitech makes hardware that lasts seemingly an eternity, but their software is lacking options, confusing and dated. So when Corsair's software works you've got the best of the best with a mostly user friendly interface. Choose your poison I guess. I wish they'd fix the heart of their ecosystem instead of sinking millions a month into making new products that'll all have the same problem, but this is your best option overall.I've been repairing, testing, and building PC's components and peripherals since the 90's, so I still get very much hands on with RAZER, Logitech, and Corsair products for work and personal use. From replacing semiconductor components and capacitors to resoldering replacement switches and diodes, to fixing software bugs when possible. Corsair uses high grade components for their hardware, and their hardware engineers seem to be top notch from the work that I've seen. In my experience, they're the best.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712PiBqib0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VszKq6yKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71h7g6gupML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81MIFCujMqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eliazibe Martins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 22, 2023",
                "reviewTitle": "Ótimo",
                "reviewText": "Sensacional! além de ergonômico, tem o peso perfeito para precisão e iluminação sem igual... facil de trocar as aletas laterais e com detalhes de qualidade altíssima.. junto com o cabo de carregamento que também é de altíssima qualidade.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emmanuel G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 9, 2020",
                "reviewTitle": "El mejor mouse inalámbrico de alto rendimiento del mercado",
                "reviewText": "Es un excelente mouse inalámbrico, la calidad de los materiales se ve y se siente, es un poco más pesado que otros mouse inalámbricos pero un par de días te acostumbras a el, mi tipo de agarre es de palma y me resulta muy cómodo por el tamaño, la forma y el peso. La iluminación RGB es bastante brillante y se ve muy bien, puedes configurarla a tu gusto o apagarla si lo deseas y cuenta con perfiles seleccionables en los que puedes configurar la iluminación, los dpi las acciones de los botones y demás de acuerdo a tu gusto, excelente para videojuegos y también para trabajo y productividad pues puede conectarse mediante Slipstream de Corsair usando el receptor USB incluido cuando buscas el máximo rendimiento, o por Bluetooth que te permite un poco más de duración de la batería y un gran desempeño para trabajar en tu dispositivo. No tengo ninguna queja, es un dispositivo excelente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "An19Bu 2",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 22, 2021",
                "reviewTitle": "Great mouse",
                "reviewText": "Great mouse but it is a little heavy and the buttons take more effort to click than the logitech G502. This is a wider mouse than the G502. The wireless charging works well. Using this as my general mouse and the G502 for gaming, which suits my style more.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J*******",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on July 9, 2020",
                "reviewTitle": "Great product!",
                "reviewText": "Great product that meets all of my requirements! Only issue is the sensor had to be calibrated for whichever surface you are using(mousepad/tabletop). Kinda troublesome if you do not have a portable mousepad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rodrigo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 6, 2022",
                "reviewTitle": "Seu unico defeito é ser caro.",
                "reviewText": "Acho que R$350 taria muito bem pago em um produto como esse, mas é BR ne ..",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}