{
    "remaining_requests": 47215,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Glorious-Model-Wireless-Gaming-Mouse/dp/B098RDJZFM",
    "body": {
        "name": "Glorious Model O Wireless Gaming Mouse - Superlight, 69g Honeycomb Design, RGB, Ambidextrous, Lag Free 2.4GHz Wireless, Up to 71 Hours Battery - Matte White",
        "price": "$79.99",
        "originalPrice": "$79.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Glorious-Model-Wireless-Gaming-Mouse/dp/B098RDJZFM",
        "soldBy": {
            "sellerID": "A1DYE0JBXZTW6W",
            "name": "Glorious PC Gaming",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1DYE0JBXZTW6W&asin=B098RDJZFM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTGC2S26"
        ],
        "asinVariationValues": [
            {
                "asin": "B098RDFP3J",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41b7vIniCvL._SS36_.jpg"
            },
            {
                "asin": "B098RDJZFM",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/419CMLEvoYL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lFMOZt-9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21BBQ6WEW-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21M1FaH7dtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21wEXTOIhlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31rqCHjkgUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Jza1Bo6tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B1hrztFecgS.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/683200de-0544-40c4-aba1-c19ae58af58e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98ac4914-5368-473e-b469-105a29cb3f16/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dcb25fe7-1065-443b-b4b7-777e40fb4149/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2d7b0cf-cd0d-40e7-a62b-67799f4238fb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/37095973-3a1b-46bc-9eba-4fb347894859/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36324eb4-eb92-49ed-bf2a-b08190872dc0/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71RtrghT4NL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81hiyxIxV6L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Glorious Store",
            "link": "https://www.amazon.com/stores/Glorious/page/6670C145-CED1-4AB2-B341-B5FE0B26B2D6?ref_=ast_bln"
        },
        "brand": "Glorious",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4472,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 30 mins",
            "FREE delivery Friday, February 16. Order within 2 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Lightning fast: Built with 2.4GHz wireless connectivity, the Model O Wireless has the lowest wireless latency of any mouse in its class. Get blazing-fast 1ms latency with a strong and stable connection, for super consistent performance.",
            "Customizable RGB: Choose from 16.8M possible colours, quickly adjustable without software using mouse buttons. Deeply customize it in Glorious CORE, to make it match the rest of your desktop.",
            "Battery life: Model O Wireless has the highest battery life of any mouse in its class. You get up to 71 hours* of playtime in wireless mode, and you can play while charging, using the ultra-flexible USB-C Ascended paracord charging cable (*with RGB off).",
            "Optimized for competitive gaming: Pinpoint precision with 400 IPS tracking speed, 19,000 Max DPI and up to 1,000Hz polling rate. The proprietary BAMF Senor gives you unrivalled performance, with lower power draw, for long wireless gaming sessions.",
            "Built to last: Model O Wireless' honeycomb design helps create the ultimate wireless lightweight mouse, without sacrifcing durability. State of the art Omron switches with 20M clicks in them, and top tier build quality makes the Model O Wireless built to last."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Mice",
                "link": "https://www.amazon.com/PC-Gaming-Mice/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402052011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5 x 2.6 x 1.48 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.4 ounces"
            },
            {
                "name": "ASIN",
                "value": "B098RDJZFM"
            },
            {
                "name": "Item model number",
                "value": "GLO-MS-OW-MW"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,472 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,027 in Video Games (See Top 100 in Video Games) #210 in PC Gaming Mice"
            },
            {
                "name": "Date First Available",
                "value": "July 6, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "Glorious"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "Glorious"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Connectivity Technology",
                "value": "2.4GHz Wireless"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Model O Wireless - The original superlight wireless mouse An ambidextrous 6-button lightweight wireless gaming mouse, with 69g honeycomb design, 2.4GHz wireless technology and pixel perfect tracking. Model O Wireless is the perfect gaming mouse for FPS, MOBA, MMO, Battle Royale and other competitive games.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce267cf8-2de3-40d7-a104-e132cf7f12b1.__CR0,0,1464,600_PT0_SX1464_V1___.png"
                ]
            },
            {
                "media_text": "Previous page DURABLE HONEYCOMB SHELL The Honeycomb Shell achieves a feather-light weight while maintaining ultra-durable strength. PROPRIETARY BAMF SENSOR With 2.4GHz technology, the BAMF Sensor gives you perfect control with the lowest wireless latency. BUILT FOR PLAYING Enjoy up to 71-hours* of uninterrupted wireless gameplay on a single charge. (*RGB off) ROUNDED EDGES NEVER SNAG 100% pure Virgin PTFE mouse skates, giving you perfect control even at the highest speeds. DOWNLOAD GLORIOUS CORE Change RGB, DPI, Lift-Off Distance, and map the 6 buttons to your own liking with intuitive software Next page 1 69G LIGHTWEIGHT DESIGN 2 NEXT-GEN WIRELESS 3 71 HOURS OF BATTERY LIFE 4 PREMIUM MOUSE SKATES 5 CUSTOMIZE EVERYTHING",
                "media_link": []
            },
            {
                "media_text": "COMPLETE YOUR DESKTOP WITH GLORIOUS GEAR Ascend your battlestation with a premium gaming keyboard that takes you to another dimension, or pick up the mousepad used by the pros, to make your new mouse even more effective. Get Yours! GMMK 2: THE MVP OF KEYBOARDS Complete your desktop with the GMMK 2. This keyboard combines premium-grade components and striking aesthetics for the most bang for your buck. The GMMK 2 raises the bar, not the cost. Get Yours! THE #1 MOUSEPAD FOR SPEED & CONTROL Get the Glorious Elements Mousepad to finalize your order. Used by pros and enthusiasts around the world, and famous for its extremely smooth surface, to give your mouse an exceptional glide. Get Yours! DON'T SWEAT IT Lightweight, anti-slip grip tape for Glorious gaming mice. Pre-cut for easy application. Shapes apply to both wired and wireless versions of our V1 mouse models. Not compatible with any V2 mice. Get Yours! EXTRA FAST G-FLOATS MOUSE FEET Swap the Model O and Model O-'s (Minus) PTFE feet with porcelain G-Floats for the fastest mouse glide possible. Get Yours!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fa47708e-b4ca-4b0d-90f2-9d09263f7eb8.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce267cf8-2de3-40d7-a104-e132cf7f12b1.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/327ab07d-bb9e-449e-a1c8-441052f7224e.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67d4ba68-bc67-4af5-96f1-d43c3ac66c91.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d949f695-1adb-4822-a437-cae5490109d3.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7df4782-0bd0-4b6f-b27a-e6e79a86e026.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4af9e28b-adc5-4cf7-a1c8-7dd3057f8897.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4c717d0-29f9-484e-a5e2-dee3321011a9.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de6ea8f3-5c29-4a2e-b81b-7006d8c4a2ec.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/765647e6-0b66-4610-ae00-0cb59e77491e.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/439d1c74-a03f-40b6-b3e0-5a7cf1a283f7.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/702638b0-474d-4d68-a413-cf066686011f.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c785af9c-6692-4264-9bfa-c0ad046cbb92.__CR0,0,1464,600_PT0_SX1464_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "L. Daddino",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHACESY5NRZBELV3ONDTNDTB6RZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3551NL6FQORAY?ASIN=B098RDJZFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Mouse but get the Pro",
                "reviewText": "This is a review of the “Model D Wireless” gaming mouse from Glorious. This review will be split into 6 parts: SHAPE (how comfortable the mouse’s shape is to hold), BUILD QUALITY (how strong the mouse is built), QUALITY-CONTROL (the margin of error between copies of the mouse), CLICKS (how good the buttons feel to press), GLIDE (how fast the mouse can move on your mousepad), and finally WEIGHT (how much the mouse weighs)Starting off we have shape; the shape of the Model D is a large ergonomic shape with side buttons only on the left side. For this reason, this mouse is meant for people who have medium – large hand sizes and are right-handed. If you are left-handed, I strongly recommend not getting this mouse. If you are right-handed, however the mouse shape feels amazing for palm and claw grip. For me I use a claw grip and this mouse is awesome!Next up the build quality and quality control; the build quality of this mouse is mostly good besides for a little side-play on the clicks and some side button wobble. The mouse does last a while (I’ve been using it for 1 year at the time of making this review) and I haven’t had any big build quality issues. The quality control of Glorious mice has always been lousy according to popular mouse reviewers, but after looking around, asking people and watching other reviews, I think the quality control of the mouse is pretty good.Now to review clicks, glide and weight. The Glorious Model D’s clicks are on the heavier side but they are still easy to repeatedly click. The Model D uses an Omron®️ Mechanical Switches Rated For 20 Million Clicks. The glide is *okay* its not super-fast but it’s not too slow either. If you are a fan of faster mouse feet I think you would be better off buying “after market” mouse feet. The Model D’s weight is 70 grams and is pretty light but recently, mice have been getting below 50 grams easily. The weight is still good though!Onto the final question, “Would I recommend this mouse?” and the answer is surprisingly “no.” However, it’s not because the mouse is bad, in fact the mouse is great, but I would not recommend it because Glorious has made a new mouse called the “Model D 2 pro” which is a lighter version of the model D. If you’re thinking about getting a new Glorious mouse I’d just say get the Model D 2 pro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5T476QZHYHUNV75BNE7DRO4PMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W02844V3Q42E?ASIN=B098RDJZFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2022",
                "reviewTitle": "5.0 out of 5 stars If you cant afford the Logi Superlight or Razer ultimate, Get this mouse",
                "reviewText": "TLDR: Fantastic mouse for the money. Good RGB, Program could be better, great feel, good battery life.-If you can’t afford or just can’t bring yourself to justify a $150 mouse like a superlight or viper ultimate id highly recommend the Model O wireless.Pros:-Good color and quality-Battery life-USB-C charging-Comfortable feel-Great buttons-Good RGB-Good Program for customizationCons:-It’s a con and a Note IMPORTANT!!!! DO NOT USE THE “MODEL O” PROGRAM!!! For whatever reason it doesn’t work 90% of the time and it’s a well-known issue HOWEVER USE THE “Glorious Core” program off their website and this mouse works just fine!-I hate to say it but there’s really no cons to the mouse, if there is it’s a personal and opinion based one, objectively there’s nothing wrong with the mouse.The Long:For better understanding of my review id like to preface that I’m a full-time video editor and I do play games heavily too. I’m also not the richest person so when I buy something I’m looking for what makes sense for the money and value. I searched for months for reviews between the top three mice in the game and industry and those are the Logitech Superlight, the Razor ultimate and this the model O. Now when I saw the price tags at the time respectively $150~, $120-100, $80~ I just couldn’t financially bring myself to spend over $100 BEFORE tax and shipping on a mouse I just couldn’t justify it. I spent $98 total for this mouse and online all the reviews put it in the same class with the “best gamming mouse ever made” the superlight. And I mean from my analysis its literally the competitor like if you compared a GT mustang to a Challenger and Charger classed cars respectively it would come to user preference. Any complaints on this mouse were nit picky at best about, 3-5 grams of weight (something I highly doubt a regular person would ever notice) or the specific “things” it comes with. I mean the superlight gets hated on for not having USB-C. So, here’s my honest opinion from what I can deduce.-----If you have the money and simply just want the best thing to say you have it, then buy a super light, if you want that but in Razer for some reason for their awful program that takes over you computer? Then buy the ultimate. BUT! If you’re a “normal” person who can’t justify spending over $100 on a mouse, then this is the bets you’ll ever do. The fact that its sub 100 and is in the same class ass the other two means something! I daily this thing and I went from an old cool master to a razor viper to this and I fell in love. For refence I have big meaty hands and the only downside is that for right-handed people the right side where your pinky rests is thinner then a viper so it took some time for me to get used to a “hour glass shaped” mouse. For $80 at the time, you get beautiful RGB, I do like it I mostly keep my turned off because it saves a bit of battery life as I use mine all day every day, the color of the mouse is a nice “matt” white, so it has this premium look to it like the color and texture they choose is beautiful. The clicks and center wheel are fantastic. As far as I can tell its light weight. I don’t personally notice the honeycomb so that’s a personal preference miles may vary. It comes with the charging cable that’s long enough to act as the mouse cable if you need to charge while you play and it’s a braided line so its almost like its not there HOWEVER you wont even use it long! Because this is USB-C it charges in a matter of minutes. I’m not joking, if my mouse gets to 30% ish ill plug it in and no lie walk away to get water come back it’ll be at 50% ill maybe google something watch one video or que for a match and it’ll be at 100% like its insane and as to why Logitech doesn’t use USB-C I can’t for the life of me understand its so useful. The Dongle it comes with is good quality and I usually leave it plugged in on my desk so when I need to charge ill just unplug the dongle and plug the remote in and done. The program is what sold this for me. Now, throw back to my previous note the “model o” standalone program just dose not work. No one knows why and it’s been an issue for years, the “glorious core” program works perfectly fine and recognizes the mouse with no issues and has plenty of customization. Some specifics, you can move your DPI sliders you get 5 I believe, and they can be color coded to what ever colors you like I usually set my blue to 2000 DPI and just keep it there but you can set them where you like and depending on what your doing you can adjust the DPI on the mouse and the color under the mouse will indicate which DPI setting its on. You can adjust the color brightness in increments which is insane to me I’ve never seen RGB where the brightness is a slider!! And the best part you can separate the RGB from the mouse “plugged in” or not, let me explain. If the mouse is plugged in you can tell the program what percentage of RGB brightness you’d like it to be and if its unplugged what you’d like it to be for example when my mouse is un plugged I have it set to 0% (again I run mine all day so I like to keep the RGB off ) but, I have it set to 60% when plugged in so while its off when I’m using it the second I plug the mouse in to charge the RGB kicks on. I just think its super cool, you can set it for battery life to if the battery gets to low you can have it adjust the RGB. As for battery life it works for days without charging. I haven’t killed it yet but I also frequently forget to turn it off, the mouse does have a setting for sleep mode so if you don’t use it for a while it “sleeps” itself saving your battery life this is annoying if your in game and don’t move for a while you have to jiggle the mouse to get it to turn back on BUT this setting can be adjusted or turned off so no worries! Again, with me frequently forgetting to turn it off ill only have to charge it maybe every 3 days at the worst. The longest I’ve gone is 5 days no charge. Again, that’s someone using it all day every day and then when I need to charge it I usually find a coinvent spot like if I need to go to the bathroom or make food that’s when ill charge it and its always done when I come back it’s like charging isn’t even an issue that I’ve ever noticed, I’ve never been annoyed by it.",
                "reviewVotes": "63 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chance Young",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG5RQ56PG5BBTBV63TEXOWFJKEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PHIV6TWJLVTP?ASIN=B098RDJZFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great value mouse for everyday gaming.",
                "reviewText": "I recently purchased the Glorious Model O 2 gaming mouse for my son, and it has proven to be a stellar investment. From the moment he unwrapped it, the sleek and lightweight design caught his eye, and the matte finish provided a comfortable grip for extended gaming sessions.The performance of the Model O 2 is nothing short of impressive. The Pixart sensor delivers precise tracking, and the low-latency response ensures that every movement is translated accurately on the screen. The customizable DPI settings allow my son to tailor the sensitivity to his gaming style, whether he's engaging in fast-paced action or requiring pinpoint accuracy.The honeycomb shell not only contributes to the mouse's lightweight feel but also adds a unique aesthetic that appeals to gamers. The gliding experience is smooth and effortless, thanks to the high-quality PTFE skates on the bottom of the mouse.Customization is a strong suit of the Glorious Model O 2. The RGB lighting options are vibrant and can be personalized to match his gaming setup. The programmable buttons and the user-friendly software make it easy for my son to create profiles tailored to different games.Durability is also a key factor, and the build quality of the Model O 2 doesn't disappoint. The mouse feels robust and well-built, with the assurance that it can withstand the rigors of intense gaming.Overall, the Glorious Model O 2 gaming mouse has been a hit with my son. Its combination of performance, customization, and sleek design makes it an excellent choice for any gamer, and I'm pleased with the value it has added to his gaming experience. I would highly recommend it to others in search of a top-notch gaming mouse.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samuel f.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 23, 2023",
                "reviewTitle": "Dejó de funcionar",
                "reviewText": "Duro 1 mes y medio, es ridículo, ya no puedo optar por garantía con Amazon, y de un momento a otro dejo de funcionar",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nicolas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 30, 2023",
                "reviewTitle": "Muito bom",
                "reviewText": "Entrega veio de fora, sem taxas e tudo certo. Em relação ao mouse, um produto de excelente qualidade, gostei bastante da pegada e a bateria não tem uma duração muito alta, mas para meu uso é boa.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LorenaLorena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 1, 2023",
                "reviewTitle": "Mouse leve e muito confortável",
                "reviewText": "Já tive diversos mouses, o meu último sendo um G502 Hero, e o Model D realmente se mostrou superior a todos os outros produtos que já utilizei. Extremamente leve, muito bonito, fácil de configurar e realmente ergonômico, sendo muito confortável mesmo após horas em frente ao PC. Também preciso destacar a rapidez da entrega, que me surpreendeu demais. Em menos de uma semana eu recebi o mouse, sem pagar nenhum imposto ou taxa adicional por isso. O mouse é bem grandinho, pareceu muito maior do que eu esperava. A conexão wireless é perfeita, sem lags e a bateria dura um tempo razoável. Em geral um excelente produto e um ótimo serviço da Glorious e da DHL com a entrega rápida.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61gKLVUXsTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ICG+5IIUL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "pj",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2022",
                "reviewTitle": "that my grandson likes it at Christmas",
                "reviewText": "Christmas present by request for my grandson",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Armando",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 17, 2022",
                "reviewTitle": "Perfecto",
                "reviewText": "A pesar de que la marca tiene bastante hate yo te puedo decir que llegó en perfecto estado, es un mouse bien armado, si lo quieren agarrar de martillo obviamente se va a romper, excelente sensor se nota la modificación de Glorious al pixart, muy ligero y tiene los mejores gskates, slides o como los conozcas del mercado, vengo del razer viper ultimate y tambien abandone el logitech g pro por ser demasiado orientado a palm, en cuanto a software tiene mas personalizacion que otros softwares, por ejemplo el debounce time puede ser bajado a 0 para que te de doble click, el rgb, los macros, practicamente todo y no me ha dado problemas como synapse, definitivamente mi main mouse,",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}