{
    "remaining_requests": 47181,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trackball-Rechargeable-Adjustable-Connection-Compatible/dp/B0BR7KX422",
    "body": {
        "name": "Nulea M505B Wireless Trackball Mouse, Rechargeable Ergonomic RGB Rollerball Mouse, Easy Index Finger Control with 5 Adjustable DPI, 3 Device Connection for PC, Laptop, iPad, Mac, Windows, Android",
        "price": "$35.99$35.99",
        "originalPrice": "",
        "rawPrice": 35.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trackball-Rechargeable-Adjustable-Connection-Compatible/dp/B0BR7KX422",
        "soldBy": {
            "sellerID": "A3S8UGBBYS4T5P",
            "name": "Nulea Direct",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3S8UGBBYS4T5P&asin=B0BR7KX422&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $4 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31fP8KmY7QL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51JG7aaUI L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fnzUmb6QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EpAp3eP4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 AX2g 9FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cbReNp-bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51C2gyAxIrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Nulea Store",
            "link": "https://www.amazon.com/stores/Nulea/page/9A5A7783-BE52-47EE-84BD-B6B60AEFAC62?ref_=ast_bln"
        },
        "brand": "Nulea",
        "merchantInfo": "Nulea Direct",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 249,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 4 hrs 25 mins",
            "FREE pickup Friday, February 16",
            "Or fastest pickup Wednesday, February 14. Order within 4 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ergonomic Design for Comfort: Nulea M505 trackball mouse is designed to fit your hand perfectly, reducing muscle stress and promoting comfort. The 44mm index finger trackball enhances cursor control and reduces arm stiffness, making it an effective solution for treating wrist pain.",
            "Precise Tracking with Adjustable DPI: With 5 different DPI modes, the trackball mouse allows you to adjust cursor movement for superior accuracy and control. You can easily switch between DPI modes using the button located at the bottom of the mouse.",
            "Perfect for Small Work Spaces: The smooth index finger trackball allows you to navigate your cursor on practically any surface, making it ideal for small workspaces. Whether you're working at a cluttered desk or on a couch or bed, Nulea trackball mouse can boost your efficiency.",
            "Long-Lasting Battery: Our ergonomic mouse features a built-in rechargeable battery that lasts up to 90 days on a single full charge. You can use our mouse for extended periods without worrying about charging it.",
            "RGB Effect：The index finger trackball mouse comes equipped with an RGB effect that adds a pop of color to your setup. You can turn the light off/on by Long pressing the left and right button for three seconds."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "6.97 x 4.45 x 2.64 inches"
            },
            {
                "name": "Item Weight",
                "value": "11.7 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0BR7KX422"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 249 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#194 in Computer Mice"
            },
            {
                "name": "Date First Available",
                "value": "April 29, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Nulea"
            },
            {
                "name": "Brand",
                "value": "Nulea"
            },
            {
                "name": "Color",
                "value": "RGB Backlight"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Wi-Fi"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic Design"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Trackball"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "MEASURE YOUR HAND, CHOOSE THE RIGHT MOUSE M505 is ideally suited for individuals with medium to large-sized hands.",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "How to charge the mouse and know its charging state? 1.Use the provided USB-C to USB-A charging cable to charge the mouse.The low battery and charging indicator is in the slit of the scroll wheel 2.The charging indicator shows red during charging and turns green when fully charged. How to wake up the mouse? 1.In wireless connection mode, the M505 mouse enters sleep mode 30 minutes after you last used the mouse. 2.lf you need to use the mouse, you can wake it up by clicking the key.（scrolling the trackball or moving the mouse will not wake up the mouse） How to reprogram mouse buttons? 1. All keys are not programmable. 2. Forward/Backward buttons are not compatible with MAC OS. How to adjust the DPI of the mouse? The mouse has 5 DPI settings, 200/400/800//1200/1600, which can be easily switched by clicking the DPI button below the scroll wheel. Where is the 2.4G USB Receiver for wireless connection? The 2.4G USB Receiver is stored at the bottom of the mouse.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ff5a3219-189a-4719-b627-338491157b12.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acad9eec-3846-43da-ba9e-6ce367366813.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4adcd948-89fd-4218-9f7a-45121263f65f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/791267d1-a30b-4ba1-a599-3a6f034423cf.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/221993f2-d6b4-446f-9acc-e59f9acd9cad.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2bff701c-c9a5-43f8-be74-6d15fc3176d8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2e78f8d7-bde3-4d0b-8482-f7c2cb61fdae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a64b8802-2dea-455d-b5e8-606bef21cfc9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/47ed8c55-fb05-4986-8941-babb5ef9e043.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ccc3bb71-54f6-487f-9f26-e64bdc7bf986.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Railings proRailings pro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHVI7TZCBSLY56YZDNACHVSWILQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKLUPKPCVAJDI?ASIN=B0BR7KX422",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Quality mouse with a smooth, solid, satisfying feel",
                "reviewText": "I've been using an elcom thumb trackball mouse for a couple of years. I was \"underwhelmed\" when I got that one, as it has a very cheap, jankety feel to it. This one, the Nulea, is what I was hoping for when I ordered the elecom. The Nulea has a very solid feel, the trackball is insanely smooth and satisfying to use. The buttons have a very solid click (my elcom will audibly click sometimes, without registering on the computer. Very annoying.) It has a nice matte finish to it. I imagine that'll probably wear through fairly quickly, but it sure looks and feels nice while it's new.Even though it took me a couple of times to get used to, I prefer the index finger location for the trackball, as it feels easier for me for fine motor skills.It pairs nicely with my PC and my iPad via Bluetooth. I haven't tried the dongle, I'd rather not have that hanging up on my computer bag when I put my computer away. So far, it seems that I won't have to. Yay!The only thing that I am not impressed with is the scroll wheel with the iPad. It seems to vary in speed as you scroll through content (perhaps in relation to what you scroll through? I haven't figured that out yet). I'll be spinning it as fast as I can and the page I'm on will be barely crawling by, then it will suddenly lurch forward at a speed you would expect, then return to it's turtle pace, seemingly randomly.I've only used it for a short time on my PC, but the scroll wheel seems to behave perfectly on it.It came charged, I have not had to charge it yet. Nice not to have to put batteries in it.Packaging was really nice, I typically don't care about that much, but unboxing this thing made me think that it was going to be high quality. I have not been disappointed.I love the size of the trackball, but I kinda wish the whole mouse were smaller. It is reasonably comfortable, but I'd like to take it with me sometimes, and it is huge. There is palm support engineered into the back of this thing. It seems to me that they could have eliminated that by chopping 2\" or so off of the back and allowed your palm to rest on the desk, then made the whole mouse 1/2-3/4\" shorter, vertically. But, maybe they tried that and this felt significantly better? If your not packing it in your computer bag, it's fine as it is.Bottom line, even with my minor gripes, this is my favorite mouse to date. This thing is solid and is very satisfying to use!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wSp2LywpL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rita Scheidt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXJM6ETA2UXAWUDRMQ7OJ2Q6N5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4NC0UWUC1XR6?ASIN=B0BR7KX422",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Initial impressions - Very Impressed",
                "reviewText": "So using this trackball for the first 10 minutes and I'm extremely impressed. Im coming from an Elecom HUGE wireless model and this trackball blows that one out of the water.Pro's:Build quality. It feels VERY sturdy. Especially compared to the cheap feeling of the Elecom plastic. (i dropped my Elecom HUGE off my bed one time onto carpeted floor and 2 buttons snapped off.) The plastic case has an extremely comfortable almost soft rubber finish coating on it. Hard to describe but doesn't feel like its plastic. Ball is extremely smooth. Ball pops out easily but doesnt fall out holding it upside down. I'll go as far to say its the smoothest trackball movement I've ever used. And i've been using trackballs for over 20 years.Button layout / Triggers / Scroll wheel - The buttons are quiet but not completely inaudible. Scross wheel is smooth with a good tension as to not accidentally scroll when not intending to.Non programmable buttons. With my Elecom HUGE you could program the buttons but most the time they didn't work correctly in almost all applications, making the extra buttons useless for me.Ease of installation. Plug N play using the USB dongle. Also paired right up to my phone.Auto off feature. Mouse turns off after 30 minutes of inactivity. Wish this time was a little shorter say maybe 10-15 minutes but not a deal breaker.DPI settings. The 5 different DPI modes allow for extreme precision if needed and fast enough to zoom all over my ultrawide monitor with ease.PRICE. This is by far the most affordable trackball I've ever bought and the features/build quality/feel is better than almost every trackball I've ever used.Con's:Even if you turn off the light, it still lights up when moving the ball, but it's very dim so not a huge deal.That's all I can think of for now.__________________________________________________________________I'll update this review with battery life once I reach a point where I'll need to recharge it.If you're looking for an affordable wireless fingertip style trackball, this is a no-brainer. Im debating buying a couple just to have as backups they're so affordable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "j-roc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 17, 2023",
                "reviewTitle": "An Excellent Product",
                "reviewText": "I have been using this trackball mouse for about a month. I bought the style with the ball on top rather than on the side, which gives me the option of operating the ball with any finger or my thumb. (I find the type with the side ball to be uncomfortable for the thumb.) The buttons and the scroll wheel are perfectly located for comfort and ease of use. The cursor control is fast and accurate. An advantage of a trackball is that it remains stationary, which is ideal when there is a limited area beside the keyboard, such as on a small or crowded desk or on a shelf. Being stationary, I can plug it in to recharge it even while in use. The product arrived promptly. I highly recommend this product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Silvio Kelz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 17, 2023",
                "reviewTitle": "Sehr gute Haptik",
                "reviewText": "Liegt gut in der Hand und sehr genau.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Balika HernandezBalika Hernandez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 30, 2023",
                "reviewTitle": "Il faut un temps d’adaptation",
                "reviewText": "Il m’a fallu quelques jours pour m’adapter à la souris, habitué au souris basique qu’il faut bouger pour faire remuer le curseur sur l’écran celle ci n’a pas besoin d’être bougé, il suffit de s’aider de la boule roule pour orienter le curseur. J’avais également l’habitude de me servir de mon index pour manipuler la roulette sur celle ci c’est le pouce. Je ne pourrais pas dire si c’est mieux ou non qu’une souris basique, tout est une question de goût mais c’est très différent. Son autonomie est excellente, pratiquement 1 mois sans la recharger. Elle se connecte facilement en Bluetooth.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ptJxekMbL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/6114-u7BcTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o7zbyh2hL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61GDzZ07-SL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dhez27tTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matteo ZacchignaMatteo Zacchigna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 14, 2023",
                "reviewTitle": "Un gran ratón (en todos los sentidos), me ha encantado",
                "reviewText": "The media could not be loaded. La presentación de este producto es correcta y elegante, se trata de una caja de cartón con fondo blanco, el nombre de la marca que es Nulea y la foto del ratón, nada más verla me trasmite buenas sensaciones.En su interior se encuentra:- El ratón.- Un manual de instrucciones.- Una tarjeta de agradecimiento.- Un cable de carga usb tipo A (el normal)- Usb tipo C.En cuanto comienzo a ver el ratón noto como es realmente grande, para que te hagas una idea, mide 3 veces más que un ratón normal y corriente, de hecho al verlo, lo primero que pienso es que no voy a ser capaz de mover un ratón tan grande pero al apoyar la mano en el es cuando ocurre la magia.Este ratón es totalmente ergonómico, al poner mi mano encima, encuentro todo en su sitio, el pulgar cae justo en el botón de la parte izquierda, al lado de la ruleta y por debajo de los dos botones configurables, el dedo indice, cae justo encima de la bola y el dedo corazón (el medio) cae justo encima del botón principal, mientras que anular y meñique, descansas sobre la parte lateral.Es cierto, que al principio el tener que desplazarme con el indice y no moviendo el ratón como tal se me hacia raro, en mas de una ocasión movía el ratón, pero al cabo de unas horas siento todo el movimiento muy natural como si realmente el ratón fuese una prolongación de mis manos.Sin lugar a dudas, una vez que te acostumbras a utilizar este ratón va a cambiar totalmente tu forma de trabajar sobre todo noto como mi muñeca se siente totalmente descansada no obstante haga sesiones de horas y horas de trabajo.En cuanto a la conexión de este ratón con el ordenador, puede conectarse a través del pincho usb (que es un receptor de la señal del ratón), o de bluetooth. El pincho usb se encuentra escondido en la parte baja del ratón, y se puede cambiar de conexión con un botón que también está en la parte baja.La precisión de este ratón es muy buena, y además este producto permite modificar los DPI, aunque yo con los dpi, mas bajo es cuando me he encontrado con más comodidad ya que bajo mi punto de vista este es un ratón para trabajar y no para jugar, ya que probé a jugar con este ratón pero no me siento cómodo.El ratón tiene unos led, que se colorean al rededor de la bola, que por cierto se puede quitar, pues esto le da un acabado muy bonito, de verdad este producto me ha encantado.La batería es interna y se carga mediante cable usb tipo c, tarda unas 2 horas y en mi prueba tarde unas 2 semanas para descargarla, que han sido aproximadamente unas 20 horas de uso.La relación calidad precio me parece totalmente correcta y acertada, es un gran producto que funciona muy bien y que es bonito y fiable, además cuida de tu muñeca que es algo imprescindible para los que trabajamos horas y horas delante de un ordenador.Espero te haya sido útil.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61jSdqNeWVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61OrUUfmdUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51xlqKSPoPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61bGQM8R3WL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61qdYHu9GEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61hi0xZidfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MNBkXGPHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61iZm2KIqBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61KynTtM8pL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61obdyxB4dL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ZCNCtU8kL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/G1E1VMnpWOL.mp4"
                }
            },
            {
                "reviewerName": "Egidio Messito",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on June 7, 2023",
                "reviewTitle": "miglior trackball che ho",
                "reviewText": "il migliore tra i miei trackball. Super smooth and the plastic is silky, setosa molto bella al tatto. La ball è molto molto fluida perfetta per mac OS o windows 11",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$45.99",
                "sellerName": "Nulea Direct",
                "sellerRating": "5"
            }
        ]
    }
}