{
    "remaining_requests": 47221,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/EVGA-Customizable-Profiles-Ergonomic-903-W1-17GR-KR/dp/B08VTQQDXH",
    "body": {
        "name": "EVGA X17 Gaming Mouse, Wired, Grey, Customizable, 16,000 DPI, 5 Profiles, 10 Buttons, Ergonomic 903-W1-17GR-KR",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/EVGA-Customizable-Profiles-Ergonomic-903-W1-17GR-KR/dp/B08VTQQDXH",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41A4PfCrDVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41u3lQLfoUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FimLgi2XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415t1KpT0QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SKTBWU wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41l2lylBXXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vmHDDMgCL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1YGI2USUSL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1YGI2USUSL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the EVGA Store",
            "link": "https://www.amazon.com/stores/EVGA/page/F3029F7A-6B99-483C-A7DE-92C7C6057C6B?ref_=ast_bln"
        },
        "brand": "EVGA",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 264,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The world's first triple sensor mouse. Using dual LOD sensors, paired with a Pixart 3389 optical sensor",
            "USB2.0 High-Speed 32-bit Arm Cortex-M33 core microprocessor, supporting a native 8K Hz report rate. Eight times the standard 1K Hz on competing gaming mice for faster response time and precise movements",
            "Quick Responding Mechanism allowing the left and right buttons to be more sensitive and react more rapidly",
            "5 customizable onboard profiles with on the fly DPI settings allow you to take your mouse anywhere",
            "Ergonomic Design with Sniper Button"
        ],
        "description": "EVGA X17 Gaming Mouse, Wired, Grey, Customizable, 16,000 DPI, 5 Profiles, 10 Buttons, Ergonomic 903-W1-17GR-KR.",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Mice",
                "link": "https://www.amazon.com/PC-Gaming-Mice/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402052011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "EVGA"
            },
            {
                "name": "Item model number",
                "value": "‎903-W1-17GR-KR"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Item Weight",
                "value": "‎8 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎4.83 x 2.77 x 1.75 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎4.83 x 2.77 x 1.75 inches"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Power Source",
                "value": "‎Corded Electric"
            },
            {
                "name": "Manufacturer",
                "value": "‎EVGA"
            },
            {
                "name": "ASIN",
                "value": "‎B08VTQQDXH"
            },
            {
                "name": "Date First Available",
                "value": "‎February 3, 2021"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 264 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,606 in Video Games (See Top 100 in Video Games) #908 in PC Gaming Mice"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired, USB"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic Design"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/bf58f61a-cb1c-483e-839d-a102ac988db4.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2bda3e8e-a794-4cd3-a62d-4aa98f204e53.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5920ae00-ad66-4559-b17f-75859531d367.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/30d2b7e8-2076-4433-821f-4e22bb42a476.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b4a2fdc5-b117-4189-8030-d26a09877b69.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "E. E. Mort",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAVK7O5YGVDRHGXZR75TSDSAKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB5R1LKWIVDBK?ASIN=B08VTQQDXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Sleeper of a hit -",
                "reviewText": "Fantastic mouse for the price - literally fantastic find. Build quality, surface textures, weight and design - everything about this mouse looks high end. I don't understand at all how these have not gotten more attention (but glad they haven't - haha). Cord is even a very nice braided one (and I have the wireless version as well - equally great). Would take this over the Logitech G502 x1000 I do miss that slightly velvety texture my Death Adder and Mionix had (but then, that finish is never that durable either - so not really a bad thing that the EVGA doesn't have it) and the EVGA's plastic does have a nice micro-texture to it (reminds me of high end pbt keycaps tbh) and some really sturdy rubber grips that make the mouse a joy to use - and the EVGA's shape is even more comfortable in hand (much more so than the G502, and even more than my older Mionix (or Death Adder).",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYVOSXZJTUZNSU3FBOVYATA4MYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R4HFFU2Q6V5I?ASIN=B08VTQQDXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2021",
                "reviewTitle": "5.0 out of 5 stars Hard as Heck to Get Working.... But AMAZING Once You Fix it! (THIS REVIEW CONTAINS THE SOLUTION)",
                "reviewText": "Be prepared for all this... Would probably be a good idea to get yourself a bag of popcorn or some other snack for this lengthy readthrough, haha.So basically, this mouse arrives without the buttons bound to what you desire, and is set to 1000hz polling rate by default. The problem is that if you happen to have the latest Windows 10 Updates (that started deploying in like March or April 2021), the EVGA Unleash RGB X17/20 software does not work....at all...no matter what... This is due to the software not detecting the mouse on newer versions of Windows, as the mouse's firmware needs to be updated...via the software that isn't working... But once the mouse's firmware is updated, the system will then detect the mouse and the app will magically start working- no joke.But due to those newer builds of Windows having updated versions of Microsoft .NET Framework, you cannot easily get the app's Firmware Updater (in the \"Program Files (x86)\\EVGA\\Unleash RGB\\FWUpdate\" folder to work... And it also won't automatically happen in the Unleash RGB x17/20 RGB software since the software won't launch.... So essentially, you have to have access to a dang computer that's running an older version of Windows 10 (or any other, older versions of Windows as they may potentially still work; I imagine this is due to those older Win10 builds having older versions of Microsoft .NET Framework built-in). Luckily enough, I had a spare laptop that was running a version of Windows 10 from about a year ago. I installed EVGA Unleash RGB X17/20 and it actually opened fine, without any issues! Just after opening, it instantly detected the mouse this time and immediately asked me to update the mouse'sfirmware. I did, and then waited for it to finish... After it was done, I changed it to 8,000hz polling rate, hit \"Apply\" and then \"Save,\" and then unplugged the mouse and plugged it back into my primary PC. I used it to reinstall the EVGA Unleash RGB X17/20 software (as I had uninstalled it prior), and it this time the software opened immediately as it detected the mouse with the newer firmware installed.So all in all, the setup for this mouse was super dang annoying... But once I got it working- my god. It's fantastically good! I previously had a Logitech G502 for like...ever lol; but then switched to a Viper 8K.... But I really started missing the G502's design and so I snagged this EVGA X17 as it's shaped similarly and isn't ambidextrous like the Viper 8K. And man, do I love this freaking mouse now! 8,000hz Polling Rate; 7 extra buttons that can be changed to any key or recorded macros; beautiful exterior coloring (in the grey model, which is what I choose); three sensors in the bottom (I imagine for increased tracking with more accuracy); lightweight (that can also be made heavier with the included weight set); and a non-ambidextrous shape that feels better and more tangible in my right hand with my odd mouse grip lol.Overall, this mouse is AMAZING. BUT, it's only amazing WHEN YOU GET IT WORKING. If you're thinking about upgrading to an 8,000hz polling rate mouse, definitely snag this one if you're not used to an ambidextrous mouse. But aside from that, Razer mice also run this crazy software/services in the background of your computer at all times that waste a bit too many resources if you don't know how to close them out/stop them. So if you're into computer performance whilst gaming, then this EVGA mouse would definitely take the cake!Okay, wow... Sorry for writing so much... I hope this helps someone out in the future!Take care everyone who got this far in the read lol *high five*",
                "reviewVotes": "200 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raynor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI2H67P5TVABOELQ5J5PUXR2U2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I48SG0V2U413?ASIN=B08VTQQDXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2022",
                "reviewTitle": "5.0 out of 5 stars I can't believe I got this at the price I paid for it.",
                "reviewText": "I have owned various products by EVGA over the years and all of them have been really great products. This mouse is no different. To top it off, I got it for around $25 when it's normally around $80. It fits my hand really good. The RGB isn't over done. At the lowest setting my cursor can zoom across the monitor or I can slow it down almost to a very controlled crawl. I can't attest to how it is while gaming. I've grown up using controllers and find it difficult to use keyboard and mouse. This also means that I can't tell you how well the extra features work. However, it does what I need it to do really well and is a solid build.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John F Yurick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM6BKK22V2EXKQC7XFWHVWFASCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVXD5XH98ULEL?ASIN=B08VTQQDXH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Good Solid Mouse, just be aware of the scroll button",
                "reviewText": "My only complaint is that the scroll button doesn't always \"engage\", meaning that if you scroll up or down, you can feel it not gripping the inside mechanism. That takes away any sort of precision with the mouse scroll as to get it to \"engage\" you have to literally fling it either up or down for it to register.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge Rojas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXLJ4ZQ3DP3UZTIV7L6UECOADDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R127FFO4EOYB3B?ASIN=B08VTQQDXH",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2022",
                "reviewTitle": "1.0 out of 5 stars Comfortable and great performance bud bad quality",
                "reviewText": "If not for the build quality, this mouse deserves 5 stars. Its performance is on par or better with any other mouse i had in the past from other brands like logitech or razer.I really enjoyed how smooth and precise it maps hand movement, it is great for precision gaming.Sandly it lasted 10 months of very light usage (i usually work on my macbook and only use my pc few hours the weekend) and the scroll weel is free-spinning and not working at all!It is a great product, but it's quality is just way too bad. I am using my 7 years old logitech as a replacement right now and it is still in perfect condition!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKPGQ6EGNFLTVDV5NOQBFPK2ABA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PS1LTM7SGCBI?ASIN=B08VTQQDXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Great deal at 25usd, would pay 50 if I needed another mouse",
                "reviewText": "Comes with removable weights, great packaging and adjustable rgb lighting. Little smaller then a razer blackadder or my asus gladius mouse but works fine for my size L hands. XL hands might need to use the \"claw\" grip technique. The forward/back buttons are large so that's a thing. Might update in a year or so.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan Carlos Aria Botero",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOPD3AEI4XUEI2B3EP2VHJ2XIXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NAICDDY8Q0KI?ASIN=B08VTQQDXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars No son los mejores pero es lo mas comodo y lujoso para su precio.",
                "reviewText": "El empaque fue asomobroso, su presentacion me gusto bastante, es bien comodo el mouse evga x17 alambrico, de lo mejor que se puede ofrecer por ese precio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZJ3RFNEW24FGVNPCHPS573N2FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LGZMN3YE0PHH?ASIN=B08VTQQDXH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 7, 2023",
                "reviewTitle": "3.0 out of 5 stars Poorly designed scroll wheel, will fail early",
                "reviewText": "The Good - this mouse feels good in the hand, wasn't that expensive when I bought it, the software kind of sucks, but works well enough to get it configured.The Bad - the scroll wheel is the weak spot in this mouse. I'd noticed my mouse wasn't consistently scrolling recently, and when I searched, I found several hits one of which took me to the EVGA forums where there's been an on-going discussion about this mouse dating back to 2021 where the symptom is that the mouse button/scroll stops working.Sadly, I bought this mouse about 3-4 months ago, and now the wheel is starting to fail. This is the second EVGA mouse that I've purchased that has failed after 4-6 months (The other was an X-15 MMO mouse). I've had other brands of mice that lasted a year or longer without having issues like this.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arseny Tolmachev",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on August 16, 2023",
                "reviewTitle": "1か月でマウスホイールが壊れた。",
                "reviewText": "1カ月の使い方でボタンから色がはがれた挙句、マウスホイールが完全に壊れた。お勧めしない。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luke Watts",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 1, 2022",
                "reviewTitle": "Avoid this mouse",
                "reviewText": "Scroll wheel didn't work. Mouse is a waste of money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Florian Sommer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 12, 2021",
                "reviewTitle": "EVGA X17 Gaming Mouse",
                "reviewText": "Am Anfang guter Eindruck aber nach wenigen Wochen löst sich die Beschichtung auf und Blättert ab.Nach 10 Monaten war das Mausrad defekt und wurde erstattet.Wer gute Grafikkarten baut, baut nicht zwingend gute ander Sachen.....",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 10, 2023",
                "reviewTitle": "Was ok... for a year.",
                "reviewText": "Was happy with this mouse. Got it on sale. 1 year later the mouse wheel broke... everything else works, but useless without the mouse wheel. Upon googling this product + mouse wheel... I see a few comments online about mouse wheel issues...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eddy Niebuhr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 16, 2021",
                "reviewTitle": "Great all around mouse.",
                "reviewText": "Not much to dislike. Build quality is top notch. I haven't tried too many, but this is the best mouse I've ever owned.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}