{
    "remaining_requests": 47237,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Redragon-M602-Ergonomic-High-Precision-Programmable/dp/B011HMDZ0Q",
    "body": {
        "name": "Redragon M602 RGB Wired Gaming Mouse RGB Spectrum Backlit Ergonomic Mouse Griffin Programmable with 7 Backlight Modes up to 7200 DPI for Windows PC Gamers (Black)",
        "price": "$19.99$19.99",
        "originalPrice": "$25.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Redragon-M602-Ergonomic-High-Precision-Programmable/dp/B011HMDZ0Q",
        "soldBy": {
            "sellerID": "A2N5Q13T20FFT2",
            "name": "Redragon zone",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2N5Q13T20FFT2&asin=B011HMDZ0Q&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07VHHPJBV"
        ],
        "asinVariationValues": [
            {
                "asin": "B011HMDZ0Q",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41yY041rT7L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31eDL3BIhVL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31QOGAqr2cL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/4156Lr3S9lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sjaeTPH4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ukmmMicSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41suceQNtzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413g v6ADZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71K9kHPbvQL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bf01ffa2-f3ff-4450-9b15-610943aac67e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e71f524-f557-408f-968d-2b87ee6f9d81/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/36adbe63-656f-45c1-ab0b-46055409c8d0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6084193e-1d6a-4645-889b-5345ad18079f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88fabcb4-fbfe-47a9-ad4e-8d68429337b6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/830733a4-bbbd-4bf4-830b-87ab33e4aa6f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Redragon Store",
            "link": "https://www.amazon.com/stores/REDRAGON/page/C9D23970-BAEE-41FD-9E1B-F6B3A3B895ED?ref_=ast_bln"
        },
        "brand": "REDRAGON",
        "merchantInfo": "Redragon zone",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 30763,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 4 hrs 34 mins",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 13. Order within 4 hrs 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WIRED GAMING MOUSE; built for Gaming Computers - Ergonomic Redragon M602-RGB “Griffin” RGB Backlit Gaming PC Mouse up to 7200 DPI (user adjustable 800/1200/1600/2400/7200 DPI), 10G acceleration. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability and extreme responsiveness, giving you an even greater edge over your competition",
            "RGB BACKLIT MMO PROGRAMMABLE PC GAMING MOUSE; 7 MMO user programmable buttons, 5 Memory Profiles each with distinct LED color option for quick identification. 7 different backlight modes. (Backlight can be disabled) The Redragon M602-RGB Gaming Mouse offers you total personalization for your Gaming Computer and Gaming Laptop",
            "ERGONOMIC GAMER MOUSE; Delivering an extremely comfortable and precise experience for Computer Games. The ergonomic shape of the Redragon M602-RGB PC Gaming Mouse is built for comfort, fits naturally in your hand, the buttons are tuned to reduce click fatigue",
            "HIGH-END PC GAMING MOUSE FEATURES; The Redragon M602-RGB Mouse features; Built-in Weight Tuning for the right balance, Anti-Skid Scroll Wheel, Durable smooth TEFLON feet pads for ultimate gaming control. 7 programmable buttons. Total 8 buttons. The Mouse works great with Redragon Gaming Mousepads & Keyboards. Comes with 6 foot, 3mm strong high-speed braided fiber cable and a gold-plated corrosion free USB connector for a reliable connection",
            "PC GAMING MOUSE COMPATIBILITY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS support Works well with all major Gaming Computers Brands and Gaming Laptops"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Mice",
                "link": "https://www.amazon.com/PC-Gaming-Mice/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402052011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.92 x 2.87 x 1.57 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.6 ounces"
            },
            {
                "name": "ASIN",
                "value": "B011HMDZ0Q"
            },
            {
                "name": "Item model number",
                "value": "M602"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 30,763 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#848 in Video Games (See Top 100 in Video Games) #45 in PC Gaming Mice"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 21, 2015"
            },
            {
                "name": "Manufacturer",
                "value": "Redragon"
            },
            {
                "name": "Brand",
                "value": "Redragon"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Special Feature",
                "value": "Programmable Buttons, LED Lights"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/d650d291-f1b5-4112-bfc2-7c0647c78531.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/63960a7a-1260-434c-8386-31e5957abc11.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/d3cf3e50-3d28-4b4d-986b-d86bb90bdcfd.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/76e06b53-8ad0-437c-b8c1-fbe15c074830.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a592f155-a39c-4986-8cdf-9a7e96f415db.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Emmanuel Derrick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHGN3YADNVYKUI5JU36JW3MCUWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NN2U4ZUQ6AB5?ASIN=B011HMDZ0Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Redragon M602: A Gamer's Delight!",
                "reviewText": "The Redragon M602 RGB Wired Gaming Mouse has exceeded my expectations in every way. Its sleek black design, coupled with RGB Spectrum Backlighting, adds a cool and dynamic vibe to my gaming setup. The ergonomic design ensures a comfortable grip during extended gaming sessions.The seven customizable backlight modes are a fantastic touch, allowing me to personalize my mouse to match my mood or gaming environment. The Griffin Programmable feature adds an extra layer of versatility, providing quick access to essential commands.The precision of the mouse is outstanding, with a DPI range up to 7200, catering to various gaming needs. The responsiveness and accuracy make it a reliable companion for competitive gaming.Overall, the Redragon M602 is a stellar gaming mouse that combines style, functionality, and customization. It's a must-have for Windows PC gamers, earning a well-deserved 5 stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSMJBVUDLXH7EPFUKPRQ5FCVH3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5X0ZMYIAN6G4?ASIN=B011HMDZ0Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2021",
                "reviewTitle": "5.0 out of 5 stars Great for its price. Similar to devices that cost 3-5x the price.",
                "reviewText": "Just ordered a second one of this model after owning my first one for a year now. I have a cat that particularly loves destroying my mouse cords. Irony aside, I think it's a jealously thing. My original purchase of this was to be a cheaper replacement for my Razr Naga which costs 4x the price, yet this mouse was barely a step down - only lacking the macro keys but gaining the full RGB lights instead of just the only green that old Razr model had. The RGB on this mouse is pretty good, good enough that I like to keep it on the flowing rainbow setting to match my similar effect on the Red Dragon mechanical macro keyboard that I bought a few months after this mouse because I was impressed with the brand quality.Ergonomically it's great. Perfectly shaped large enough that you won't get hand cramps if using the device for extended periods of time. It handles with enough accuracy for 99.99% of people and only tournament ranking professionals would have reason to complain.My only negative point on this mouse is that multiple buttons are too easy to press on accident. It shouldn't be much of an issue for most people, but the side buttons stick out quite far, and it's very easy to press those back/forward buttons when first moving your hand onto the device. But once you've got a grip on it, that stops being a problem and instead a possible benefit, as those 2 side buttons are very easy to press when you want to. The top buttons that control the RGB and DPI suffer from much the same issue. Very easy to accidentally touch them and change the settings accidently. Yet once you hand is on the device, they're not in the way and you're unlikely to accidentally press either button.Build quality it's solid, and amazing for the price. It's notably not as well built as the $80 Razr mouse that I replaced with it, but the difference is small enough that I'd even consider them to be solidly in the same range of mid-cost device.As a side complaint, I'm annoyed that both of the aforementioned pointing devices, especially the $80 Razr one, do not have detachable and replaceable USB cords. I shouldn't have to buy a new device entirely just because the cord is damaged, yet a majority of mice on the market do not have swappable cords. Red Dragon definitely gets a pass on their purposefully cost-cutting design, but it's much more annoying on a luxury like the Naga.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQZJ6XIWAR3S4WVVG54X5U4OZAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UR5RSFKM64E1?ASIN=B011HMDZ0Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2022",
                "reviewTitle": "5.0 out of 5 stars Redragon Gaming Mouse beats all the other gaming mice",
                "reviewText": "Redragon Gaming Mouse Beats Other Gaming Mice To start off with, I think that the Redragon gaming mouse is one of the best mice as of right now. I have owned this mouse for about 3 years and it is just as good as brand new. When looking at the price of this mouse compared to other gaming mice, this is cheaper, durable, longer-lasting, and has most of the features as the other expensive mice have. I would most certainly recommend any interested buyers looking for a gaming mouse to buy this product. First and foremost, I think that the Redragon gaming mouse is one of the best mice as of right now because it’s cheap and affordable. When looking for a desktop gaming mouse, you should always research and look for other products that might be similar, less expensive, and easier to use especially when it comes to gaming mice. One of the popular gaming mice that is competing against the redragon mice in the market as of right now would be the glorious model o. This mouse comes around $100 in the market and functions similarly to the redragon mouse. The redragon mouse comes in around $20 as of now due to inflation as well. There isn’t much of a difference between the two mice besides the shape, size, and price. Paying $80 more isn’t worth it if most of the controls, and key features function the same way. Some of the key features that the glorious model o can do as well as the redragon gaming mouse are drag click, butterfly click, has the same amount of sensitivity, and DPI. The main difference between these two desktop gaming mice is that the glorious model “o” feels much lighter and sturdier. The redragon mouse feels a little bit heavier however, it is a decent size for any beginners or experienced gamers. It also has side palm grips for you to keep your thumb, ring finger, and pinky finger on support giving you the most comfortable experience as well. Some of the features that both mice can do that interested buyers would look forward to is having the mouse double click, drag click, and butterfly click. Furthermore, this mouse is very comfortable and durable for a long period of time. The gaming mouse's texture is matte which makes the gaming experience even better. There are also side buttons to change the RGB color or lighting to whichever settings you’d prefer with 7-8 different color options. All of these features are adjustable just by downloading the app or software if needed. After owning this product for 3 years, I have not felt the need to buy another mouse yet at all because of how well-made it is. However, despite all of the pros mentioned, there are always a few flaws or cons since nothing is perfect. One of the cons I experienced by owning this product would be that when gaming, some of the clicks on the redragon gaming mouse don’t register due to how big it is. Even though it is recommended to have lighter-weight desktop mice when gaming, it makes it harder to click while having some clicks not register. Over the past 3 years of owning this product, I have noticed that there is also a solution to fixing this problem. I have improved my gaming skills and it has made clicking faster and much easier for me. I would most definitely recommend this product to gamers who are at least experienced a little bit and have fast clicking hands to enjoy the full experience.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Gama",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 3, 2024",
                "reviewTitle": "É simplesmente Reddragon",
                "reviewText": "Valeu cada centavo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pedro L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 28, 2023",
                "reviewTitle": "Es justo lo que quería. Y con su app está muy bien el manejo",
                "reviewText": "The media could not be loaded. Me parece muy bien. Y por el precio es lo que buscaba.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/A1IouXC2r6L.mp4"
                }
            },
            {
                "reviewerName": "Ashton Baloca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2023",
                "reviewTitle": "Unleash Your Gaming Potential!",
                "reviewText": "The Redragon M602 RGB Wired Gaming Mouse is an absolute game-changer that has taken my gaming experience to new heights. With its exceptional features, ergonomic design, and stunning RGB lighting, this mouse deserves every bit of its glowing 5-star rating.First and foremost, the precision and responsiveness of the Redragon M602 are truly outstanding. The mouse boasts an impressive DPI range of up to 7200, allowing for seamless cursor movements and smooth tracking even in the most intense gaming sessions. Whether I'm playing fast-paced shooters or engaging in meticulous strategy games, the M602 delivers accurate and consistent performance, giving me a competitive edge.The ergonomic design of this mouse is a godsend for extended gaming sessions. It fits perfectly in my hand, providing optimal comfort and reducing strain and fatigue. The textured grip on the sides ensures a secure and slip-free hold, allowing for precise control during intense gameplay. Even during marathon gaming sessions, I never experienced any discomfort or cramping, thanks to the thoughtful design of the M602.One standout feature of the Redragon M602 is its mesmerizing RGB lighting. The customizable spectrum backlighting offers a breathtaking visual experience. With seven vivid backlight modes to choose from, including pulsating colors and dynamic effects, the mouse adds an extra layer of immersion to my gaming setup. The lighting effects can be easily adjusted using the intuitive software, allowing me to personalize the mouse's appearance to match my gaming ambiance.Customizability is taken to another level with the Griffin software. The M602 offers programmable buttons that can be tailored to suit my gaming preferences. Assigning macros and shortcuts to these buttons has streamlined my gameplay, granting me quick access to essential commands and actions. The intuitive software interface makes customization a breeze, catering to both novice and experienced gamers alike.Durability is another area where the Redragon M602 shines. The build quality is exceptional, with a robust construction that feels solid and reliable. This mouse is built to withstand the rigors of gaming, ensuring long-lasting performance and durability. The quality materials used in its construction instill confidence, knowing that the M602 can handle the demands of even the most intense gaming sessions.The Redragon M602 also offers compatibility with various Windows operating systems, ensuring widespread accessibility for gamers. Whether I'm using Windows 7, 8, 10, or newer, the M602 seamlessly integrates with my system without any issues, providing a hassle-free experience.In conclusion, the Redragon M602 RGB Wired Gaming Mouse is a game-changer in every sense. Its exceptional precision, ergonomic design, stunning RGB lighting, and programmable features make it an essential companion for any avid gamer. With this mouse, I've achieved new levels of performance and immersion, and I can confidently say it's a must-have for PC gamers. Five stars all the way!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Damjan Draksic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 4, 2022",
                "reviewTitle": "Good gaming mouse",
                "reviewText": "Good price, no problems.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marco Ghizzoni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 18, 2022",
                "reviewTitle": "Mouse per gaming e utilizzo classico",
                "reviewText": "Ottimo prodotto, leggero e maneggevole, va bene sia per gaming che per utilizzo normale",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}