{
    "remaining_requests": 47301,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-Master-Wireless-Mouse-Rechargeable/dp/B071YZJ1G1",
    "body": {
        "name": "Logitech MX Master 2S Wireless Mouse - Hyper-Fast Scrolling, Ergonomic, Rechargeable, Control 3 Computers, Graphite",
        "price": "$66.19",
        "originalPrice": "$99.99",
        "rawPrice": 66.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-Master-Wireless-Mouse-Rechargeable/dp/B071YZJ1G1",
        "soldBy": {
            "sellerID": "A3387LRGJP817D",
            "name": "Robert`s Fojjer",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3387LRGJP817D&asin=B071YZJ1G1&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CKS7Z112"
        ],
        "asinVariationValues": [
            {
                "asin": "B071YZJ1G1",
                "variationName": "Modelname",
                "variationValue": "2017 Model",
                "price": "$66.19",
                "variationImageURL": ""
            },
            {
                "asin": "B0C4XXH2FV",
                "variationName": "Modelname",
                "variationValue": "2023 Model",
                "price": "$69.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Vm-fTI2AL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41NMKNpfIvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41k rBEwNcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nMxAJmuDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hGGepo7IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Q1MYyTL L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GAfYQdQrL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/a977de6e-1dab-5eef-b819-f36618be3fcd/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/aeeff78e-ee86-4a56-9acf-3d3511a74a37/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c3974937-285f-4bfd-ab10-efb669f802b4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/24e0e718-5587-4888-a9c6-7e75be901ce7/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8857e2a0-7e80-42a7-9f0e-b84bcb6f1875/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ef93d64c-e77e-4023-9c7e-b77271cfede1/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A13KyoPRvnL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91jR0W5GPSL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "Ships from and sold by AAA-Shop.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 16155,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 2 hrs 48 mins",
            "FREE delivery February 15 - 20.",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 48 mins."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "Cross computer control: Game changing capacity to navigate seamlessly on 3 computers, and copy paste text, images, and files from 1 to the other using Logitech flow",
            "Dual connectivity: Use with upto 3 Windows or Mac computers via included Unifying receiver or Bluetooth Smart wireless technology. Gesture button- Yes",
            "Advanced ergonomic design: Perfectly sculpted, hand crafted shape supports your hand and wrist in a comfortable, natural position",
            "Auto shift scrolling: Speed adaptive scroll wheel auto shifts on the fly from click to click to hyper fast scrolling",
            "Rechargable battery: Upto 70 days of power on a single charge"
        ],
        "description": "The ultimate precision mouse for power users. Harness the power of Logitech Flow and seamlessly move content between three computers. Scroll through documents and web pages faster and easier with the speed adaptive scroll wheel. Powers up for an entire day in just three minutes. A sculpted, hand crafted shape ensures comfortable hand and wrist support. System Requirements: Required: Bluetooth low energy technologyWindows 8 or laterMac OS X 10.10 or later|Required: Available USB port Windows 10 or later Windows 8 Windows 7Mac OS X 10.10 or later|Internet connection for software download USB port or Bluetooth low energy technology.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Wireless Type",
                "value": "‎Bluetooth"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Series",
                "value": "‎2017 Model"
            },
            {
                "name": "Item model number",
                "value": "‎2017 Model"
            },
            {
                "name": "Hardware Platform",
                "value": "‎Laptop, PC"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 8, Windows 10"
            },
            {
                "name": "Item Weight",
                "value": "‎5.1 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.9 x 3.37 x 4.9 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎1.9 x 3.37 x 4.9 inches"
            },
            {
                "name": "Color",
                "value": "Graphite"
            },
            {
                "name": "Rear Webcam Resolution",
                "value": "‎4000 MP"
            },
            {
                "name": "Power Source",
                "value": "‎Battery Powered"
            },
            {
                "name": "Batteries",
                "value": "‎1 CR123A batteries required. (included)"
            },
            {
                "name": "Manufacturer",
                "value": "‎Logitech"
            },
            {
                "name": "ASIN",
                "value": "‎B071YZJ1G1"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎May 10, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 16,155 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,308 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #74 in Computer Mice #167 in Climate Pledge Friendly: Computers"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, Bluetooth, USB"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Ergonomic Design, Rechargeable"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Y. WangY. Wang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZZURKYSVGYT53XSNBL7GVIL4GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMWALNVUSFFWM?ASIN=B071YZJ1G1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 2, 2018",
                "reviewTitle": "5.0 out of 5 stars The best mouse I've ever used",
                "reviewText": "I have owned the previous MX Master for over two years. It was amazing in pretty much every respect. Over time it got scratched up from being in my travel bag so when the new version came out, I jumped on it. I've had no regrets since. It's everything the original version offered plus more.The MX Master 2S is overall unchanged physically. Same button placement, same shape, same size. The only identifiable thing are the new colors. The previous black+bronze was nice but curious color choice - a bit steampunk if you ask me. The new color options, blue, white, and black on graphite (my choice) is a more traditional color for peripherals.In terms of buttons, it's the same as the previous model - two main buttons on top, scroll wheel that acts as a third button and a wheel lock button to freespin the wheel when you need it. The main two top buttons feel clickier or crisper than my previous mouse. I don't know if Logitech changed the mechanism or my old mouse is just worn out. However the more tactile feel is a welcome change. The free spin button is something unique that I have not seen on any other mouse. Normally the wheel is a friction wheel offering bumpy tactile feel. This is useful for precise scrolling. When you click the center button, the mouse releases the friction of the mouse and allows it to free spin. This is immensely useful if you need to scroll quickly for large spreadsheets, documents, or webpages. I am a photographer and designer and having free spin is great for changing brush sizes, brush hardness, opacity, and other options in photo editing programs.There is also a horizontal scroll wheel and two buttons on the thumb. Admittedly I barely ever use the thumb scroll but it's a useful wheel to have to assign it to creative uses. The two forward and backward buttons unfortunately haven't changed at all. Most people complained about the size and shape of these. It's hard to touch-press them unless you're very used to the mouse. This has not changed at all. These buttons really need to be larger.Finally there is a hidden \"gesture\" button on thumb pad underneath the soft rubber. You push down to switch between windows in Windows 10. Alternatively you can assign this to something more useful. I almost never use it since I alt-tab everything. If you didn't know this button was there you would probably miss it. It is well hidden and the press down is awkward. Either way, it's an extra button you can use creatively.Overall the mouse design is excellent. The size is perfect and the slightly slanted wedge design is great to save your wrists from carpal tunnel injury over long time use. This is SIGNIFICANTLY better than a traditional flat mouse (I'm looking at you Apple Magic Mouse). While it's not a perfectly vertical mouse, it's large enough for your hands to cup it naturally and pivot on your wrist bone for more precise movements with less pain.My favorite feature is the multi-system switch button. On the bottom there is a button to switch between 3 systems. Previously there was a separate connect button that Logitech smartly did away with. Now there is just one button, press once to switch between 1, 2, or 3, and hold down to put the mouse in search/connect mode for a new device. This feature is simply amazing. I have a desktop, a laptop, and my fiance has a laptop. We all have each system assigned to a number. Simply one press will let you seamlessly switch between systems. There is no lag. There is no delay. There is no reconnect. Once you've paired it, you never have to do it again. The mouse works with Logitech's universal dongle as well as bluetooth. Honestly bluetooth is all you ever really need. I have the dongle on my desktop and just use bluetooth on the two other laptops. This is by far the BEST FEATURE of this mouse. I don't need to buy extra mice for other systems, I just take the same mouse with me.The mouse also works on pretty much every surface I've tried it on. I have a black table and several mice have given up working on it. They work for a bit but loose their way. I've tried this on really dark furniture, mouse pads, and even glass. It takes all surfaces like a champ!The second best feature is the battery. I have used other wireless mice such as Razr, other Logitech, and Apple. The batteries for these mice area lacking in battery life. Nothing is worse than working or playing a game and the battery dies mid-way. Typically those batteries last a few days at best. The MX Master 2S WILL LAST YOU WEEKS. I got mine two weeks ago and I still haven't charged it since. If it does die, it will prompt you on screen and you can charge while you continue working.Overall this is the best wireless mouse I've ever used. I would not hesitate to buy it. It is a bit pricey though, for good reason. If you can find it on sale, DEFINITELY buy! You won't look back!If this review helped, or managed to get this far, why not give me me a like? Thanks :)",
                "reviewVotes": "59 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/512Uev0PKrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/512zPJWjSNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61x9wt27lQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ed TECH warrior ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB3AWRAJR3XZ2XBXA33LNHA54NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROEFABA0WR6HP?ASIN=B071YZJ1G1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great buy",
                "reviewText": "The Logitech MX Master 2S is one of the best wireless mice on the market, and for good reason. It is packed with features that make it ideal for productivity and creativity, including:Hyper-fast scrolling: The MX Master 2S features a unique hyper-fast scroll wheel that allows you to scroll through long documents and web pages with a flick of your finger.Ergonomic design: The MX Master 2S is designed to fit comfortably in your hand, even after long hours of use. It features a thumb rest, contoured shape, and soft-touch coating.Multi-device control: The MX Master 2S can be paired with up to three devices, and you can easily switch between them with the press of a button. This makes it ideal for multitasking and working across multiple computers.Long battery life: The MX Master 2S can last up to 70 days on a single charge, so you don't have to worry about running out of battery power in the middle of the day.In addition to these features, the MX Master 2S also has a number of other features that make it a great choice for power users, such as:Customizable buttons: You can customize the buttons on the MX Master 2S to perform your favorite shortcuts and commands.Gesture support: The MX Master 2S supports a variety of gestures, which can be used to control your computer and applications in new and innovative ways.Darkfield tracking: The MX Master 2S can track on virtually any surface, including glass, so you can use it anywhere.Overall, the Logitech MX Master 2S is an excellent wireless mouse for productivity and creativity. It is packed with features that make it easy to use and customize, and it is very comfortable to use for long periods of time.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7XO376URXXCSK332KEPQOX4CKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M0N839LF98VS?ASIN=B071YZJ1G1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2019",
                "reviewTitle": "5.0 out of 5 stars My favorite mouse",
                "reviewText": "I have been using an original MX Master (which I’ll call MXM for brevity) at the office for the past three years and it is by far my favorite mouse, until the MX Master 2 (though for my uses they are largely the same).Scroll wheels on mice have been a real pain for me in the past, it seems like scroll wheels on every mouse I’ve used prior to the MXM were junk. They were always janky where clicks wouldn’t register, or scrolling just wasn’t smooth. I was talking with a guy at work a few years ago about this and he let me test-drive his MXM for an hour and I loved it, so I immediately purchased one.I have used it with zero problems for the last few years, and I’m still addicted to quickly scrolling through web pages, code files, spreadsheets, etc by using the smooth-as-butter quick scrolling feature. For me the scroll wheel alone is worth the price, but of course it has plenty of other really useful features.At home I was using an MX Anywhere mouse because I travel frequently, so the smaller form-factor is nice. However, it does feel a bit too cramped and when I use it I miss the ergonomics and smooth scrolling. I finally decided to get another MX Master (this one being the MX Master 2). I don’t know why I didn’t buy this sooner!It’s basically the same as the original MXM with a few added features. The MXM 2 supports “Flow” software which allows you to seamlessly use the mouse across multiple computers (up to three) without having to manually change the connection on the bottom of the mouse. You can also copy and paste files across multiple computers, provided you copy/paste by using the mouse itself rather than keyboard shortcuts. The MXM 2 also supports higher resolution (up to 4,000 DPI) and longer battery life.The thumb gesture button on the MXM 2 does feel a slight bit mushier than the original but for me it's easier to click. I see a lot of people complaining about the forward/back thumb buttons being set too far back making them uncomfortable to use, but I have adapted to using them a bit differently. Rather than pulling my thumb back and searching for the correct button I simply keep my thumb in its natural position and rock it up/down, letting the side of my thumb hit the buttons. It only took me a short time to get used to doing it this way, but it feels completely natural.This mouse is super comfortable to use all day long. It is a bit on the larger side so if you have smaller hands then it might not be ideal for you.The MXM really does work on every surface I’ve tested on. My coffee table has a glass top and no other mouse works fluidly on it, except the MXM series.I don’t do much PC gaming outside of playing Civ, which doesn’t require twitch accuracy, but I’ve heard a number of people say it’s not an ideal gaming mouse. I will take their word for it, so if you’re looking for a gaming mouse then I’d do a little more searching around. That being said, for productivity it works flawlessly.Finally, if you have an original MXM and it’s still working well for you then I don’t think it’s worth upgrading unless something like Flow is something you will find really useful.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liliana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2023",
                "reviewTitle": "Works wonderfully",
                "reviewText": "Amazing product. Got this for my brother as he recently built a computer but didn’t have enough money for a new mouse. He said it’s amazing but didn’t come with the right connector but that was an easy fix !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 2, 2023",
                "reviewTitle": "Mouse",
                "reviewText": "Muito bom, fácil uso e realmente ajuda em muito na navegação. Produto atende as características técnicas esperadas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikola",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 9, 2023",
                "reviewTitle": "Excellent mouse with plenty of customizable buttons",
                "reviewText": "I use this mouse daily and it's wonderful. Paired with the Logitech app that allows you to customize what the buttons do and their res[ective sensitivities, you get the feeling that this mouse can do it all. The battery life after a full charge lasts me weeks. Since it is in a slightly more favourable ergonomic position—but far from vertical—I noticed that my wrist doesn't hurt anymore, which is a huge plus.One thing that I do not like is the location of the horizontal scroll wheel. I have large hands and I feel as if the button could have been placed more forward on the mouse. I find that every time I reach for the horizontal scroll wheel, I overshoot it and have to move my thumb back. I can't seem to ever get it on the first try.Overall, a great mouse with tons of customization",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pranay Yadav",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 20, 2024",
                "reviewTitle": "Great Mouse",
                "reviewText": "Works really well. The tracking is nice and works on multiple surfaces I checked on. The mouse is a little heavy but that works well with the good tracking as the mouse feels good in your hand, more natural than an ultra-light mouse.The buttons are satisfying but not very silent. The extra keys are easy to program and useful. The horizontal scrolling wheel is extremely useful. The vertical scrolling wheel is satisfying and the best I've used so far (second only to the Surface Mouse). The flick to scroll function on the main scroll wheel works well.The push to press button in the thumb part of the mouse is not the easiest to press. It takes a bit of effort and an odd angle with your thumb which makes the gestures a little less seamless.One of the side buttons is hard to press but that's useful as you don't end up clicking it by mistake. I still would have liked better shaped buttons on the side.The software is good (but a little heavy) and the drag and drop feature across computers is really useful. However, it doesn't save your settings on the mouse so you have to modify it and setup on each computer.Charging is extremely fast and the cable (despite micro-USB) is really nice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelo D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 7, 2023",
                "reviewTitle": "Great, but no USB C",
                "reviewText": "Great mouse, only downside is lack of USB C as this is the slightly older model. Otherwise there’s very little difference between this and the 3",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$66.19",
                "sellerName": "ShopSmart Deals",
                "sellerRating": "5"
            },
            {
                "price": "$66.82",
                "sellerName": "Slam-Dunk",
                "sellerRating": "5"
            },
            {
                "price": "$67.50",
                "sellerName": "Priority Sales Inc",
                "sellerRating": "4.5"
            }
        ]
    }
}