{
    "remaining_requests": 47187,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ZLOT-Vertical-Wireless-Ergonomic-Adjustable/dp/B07VS7QKYN",
    "body": {
        "name": "ZLOT Vertical Wireless Mouse,2.4G USB Optical Ergonomic Mice with 3 Adjustable DPI 1000/1600/2400 and 6 Buttons for Laptop, PC, Computer, Desktop, Black",
        "price": "$17.99",
        "originalPrice": "",
        "rawPrice": 17.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ZLOT-Vertical-Wireless-Ergonomic-Adjustable/dp/B07VS7QKYN",
        "soldBy": {
            "sellerID": "A3JHW2VNJ6PWG8",
            "name": "PEWOEN",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3JHW2VNJ6PWG8&asin=B07VS7QKYN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08Q8KTWNF"
        ],
        "asinVariationValues": [
            {
                "asin": "B07T3PFWCB",
                "variationName": "Color",
                "variationValue": "Wired for Game",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WF3JDCjEL._SS36_.jpg"
            },
            {
                "asin": "B07MZB4MYL",
                "variationName": "Color",
                "variationValue": "Wired-Programmable",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41NOdk0LznL._SS36_.jpg"
            },
            {
                "asin": "B07VS7QKYN",
                "variationName": "Color",
                "variationValue": "Wireless for Office",
                "price": "$17.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31PbJpnOnFL._SS36_.jpg"
            },
            {
                "asin": "B07Q1J9KTQ",
                "variationName": "Color",
                "variationValue": "Wireless-Rechargeable",
                "price": "$18.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41o5ePg-NdL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31PbJpnOnFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41N1lq6pnyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413NaQ4zmaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Q-WYEaufL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gP6J232RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417blGlJpQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sgmuQAkkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: ZLOT",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=ZLOT"
        },
        "brand": "ZLOT",
        "merchantInfo": "PEWOEN",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2516,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35. Order within 2 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ergonomic Vertical Design.Unlike those traditional ones which strain wrist and arm over time, causing great pain. The vertical design provides better support for your forearm minimizing wrist pain that can come from twisting.",
            "Added Forward-Back buttons (Only Used for Windows)provide convenience when webpage browsing; the superior choice for internet surfers, gamers and people who work at length at the computer.",
            "Widely Compatible with Windows 2000/ME/XP（x64）/Vista/7/8/10/Mac OS X（over V10.4)/Linux.(The Forward-Back thumb buttons are not recognized on the Mac OS X).",
            "Kindly Note: The USB receiver is inserted in the battery compartment of the mouse; 1 AA battery required but not included.No lights on both sides of the mouse,just blue decorative strips.Please peel off the transparent protective film on the bottom of the mouse before use.This is a right-handed mouse.",
            "Warranty & Support: Follow the platform's return policy, we provide the full technical support after selling and any questions about the product, feel freely to contact us."
        ],
        "description": "Specification:Button number：6 buttonsTracking System: opticalConnection Mode: 2.4G USBEffective distance: 10mWorking voltage/current: 3V/4mASize: 4.33 * 2.83 * 2.95 (in)Item weight: 100gDPI Levels: 1000-1600-2400Polling Rate: 250HzSystem requirementsWindows2000/ME/XP（x64）/Vista/7/8/10/Mac OS X（over V10.4)/Linux.(The Forward-Back thumb buttons are not recognized on the Mac OS X.)An available USB portPackage includes:Mouse x1 USB Receiver x1 Instructions x1(The USB receiver is inserted in the battery compartment of the mouse)(1 AA battery required but not included) What to do if the mouse has no response?1.According to the positive and negative sign, please install it in the battery box correctly.2.Please try to replace the receiver with an USB interface.3.Make sure the power switch at the bottom of the mouse is “on”position.4.Try to restart the computer.5.Press the left、middle、right key when the power is on, and put the receiver into the computer, waiting for 5 seconds, and then you could rematch code successfully.6.If it is still unsuccessful, please contact us for technical assistance.Note: When matching code, please make sure that the power switch has been turned on and the distance between the mouse and receiver is limited in 30CM.",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Mice",
                "link": "https://www.amazon.com/PC-Gaming-Mice/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402052011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "4.33 x 2.83 x 2.95 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.53 ounces"
            },
            {
                "name": "ASIN",
                "value": "B07VS7QKYN"
            },
            {
                "name": "Item model number",
                "value": "19F35A"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,516 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,725 in Video Games (See Top 100 in Video Games) #230 in Mac Gaming Mice #1,147 in PC Gaming Mice"
            },
            {
                "name": "Date First Available",
                "value": "July 27, 2019"
            },
            {
                "name": "Manufacturer",
                "value": "ZLOT Master"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "ZLOT"
            },
            {
                "name": "Color",
                "value": "Wireless for Office"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless, USB"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Steven G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5CXJ54VQ4HXTSYC7CZ4BLYENEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V44LGK6EKUS0?ASIN=B07VS7QKYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Mouse For The Price",
                "reviewText": "Absolutely love this mouse! It's easy to use and feels great in hand. The clicking noise is just right— not too loud. The precision is impressive, making it an ideal choice for any task, especially for programmers with all the essential buttons to streamline your workflow. Outstanding value for the price. Without a doubt, I'd purchase another from this brand. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5T2VXVQ5L6YSQ2LFH7NI74GE5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MMQZB8MEY0U?ASIN=B07VS7QKYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2020",
                "reviewTitle": "5.0 out of 5 stars Incredible value! As a decades long PC gamer, I am thoroughly impressed.",
                "reviewText": "I LOVE this mouse. It has replaced my Evoluent Ergonomic mouse as a daily driver (for work - software developer). It's almost replaced my Logitech G604/G602 for gaming (World of Warcraft). I expect it to fully replace my gaming mouse once I re-learn all the muscle memory. If you're a parent looking for a cheap mouse for your kid, you can't go wrong with this one.I wasn't expecting much at this price point, but this mouse is a great option for anybody. It feels good in my large hand, doesn't stress my wrist at all. Cursor tracks great with default settings on lowest sensitivity. Had to download the software from a Chinese website (thank you Google Translate!), but once I got it installed, it's all in English. I was able to re-map the D-stick to numpad keys, which I then keybind in World of Warcraft. It took all of an hour and replaced my old Logitech G602 when it died at a bad time. I'm currently using this to tank mythic+ WoW dungeons, using the D-stick for many core abilities. Much more than I expected for $30, and still the only ergonomic mouse I can find with enough buttons to be useful for WoW.The Cons:* The directional stick ... isn't actually one. It doesn't show up in Windows as an actual directional stick (like an Xbox/PS controller would - with an X and Y axis). Rather, it's just 4 buttons (WASD). For my purposes, this is fine (I want it to just trigger buttons) but still feel I'd be better off with just 5 buttons than the \"D stick that isn't actually a D stick\". Maybe this can be changed in the software and I just didn't dig deep enough? As other reviewers point out, the \"dead zone\" of this D stick makes it feel a bit cumbersome.* The RGB color settings are quite limited. Personally, I don't use any of that. But if you want a super fancy customizable RGB mouse, this isn't the one for you (also, expect to pay at least double).* The software is definitely not nearly as pretty as the Logitech equivalent. Functionally it's comparable (macros, key rebinds, change DPI settings), just not quite as polished. Honestly this didn't bother me at all (I figured it out easy enough), and the mouse will function just fine without the software. You only need the software if you want to customize what each button does. Once that's done, the settings are actually saved to the mouse's internal memory, so you never need the software again!* The button right underneath the scroll wheel is a bit tricky to reach. That's probably by design (the default is for this to change cursor speed/DPI). I have re-bound it to my \"Taunt\" ability in WoW, and sometimes it's hard to reach in the heat of the moment. I am slowly re-leaning how to press it with the underside of my middle finger knuckle which is actually very comfortable/ergonomic.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2D5NLYGDA4TRCOKPT5WYZQVBJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ9L33XVDLP6O?ASIN=B07VS7QKYN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 8, 2022",
                "reviewTitle": "4.0 out of 5 stars Helpful, useful, but not perfect",
                "reviewText": "So i got this mouse because 1 my old mouse ive been using for years and i guess it is at a point where the sweat from my hands got into it causing malfunctions and two, since im getting a new mouse i wanted it to be new.This is one of the only mice of its kind you can find, vertical, and has a thumb stick on the top.And yes, it is a new experience and I like it overall. But theres a few complaints i have.First, and the biggest complaint i have, is the fact the software has macro features. Those are considered cheating. You can simply not use them, but say you are a streamer and you have the driver open to tweak shortcuts and what not, the macros are not even hidden. A viewer can simply report you and the very fact you have these options available would be cause for a ban, your only hope is to ask the game devs to trust you in not using them.My second complaint is that the joystick does not register diagonally. So if up is for W, down S, left A, right D, you cannot push it up and to the right to register a W and a D. It is one or the other. But that isnt really a huge problem for me, you may think that it would be better to just be a D pad, but the joystick is alot easier to use in my opinion. For example, i am playing a FPS game. For me, using the scroll wheel to switch weapons is too difficult so I usually set the switch weapon keybind to one of the side buttons. Well with this mouse, i can set the switch weapon to up on the joystick, and it is so much smoother. In a situation where you need to switch to a pistol, you have no time to waste in feeling the side buttons and pressing the right one, you have no time to take your trigger finger off of the left click to use the scroll wheel. With this, i can simply lift my thumb and push the joystick forward and be ready to shoot before the switching animation is over.Another complaint i have is the scroll wheel itself. It is like the design of the wheel is too long on certain spots, and those grooves will rub against the chassis making it hard to scroll.Other than that? It has been a great new experience and for a pretty cheap price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX4Q77WTLDCTTEK4672R25EX5EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZC3MKM6JUJWD?ASIN=B07VS7QKYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Doesn’t get any better",
                "reviewText": "I love this ergonomic mouse a lot and I play a lot of games and using this mouse my wrist never even gets sore ever. It even has a joy stick on top easy to use when you are flying them planes. And it has RGB lights on the bottom on both sides and the dpi is awesome you can set it up for your speed and it has dpi lights so you know what dpi you are set to. I use it so much i ware it out and I do buy the same mouse and when I ware it out again I’ll buy it again unless it’s still under warranty if not I’ll buy another one and if you are a gamer I highly recommend this mouse you will not regret buying this mouse.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Berta Blanch Lazaro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 13, 2020",
                "reviewTitle": "very satisfied with purchase",
                "reviewText": "I just recently found out about vertical mice, and since I've had wrist pain for a long time decide to try this one and so far I am really happy with it. Good grip, usb rechargable (and it even works while charging). It takes a bit to get used to, but once you got it works really well. Would recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel RamirezDaniel Ramirez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 20, 2022",
                "reviewTitle": "Excelente producto funciona en Windows y Mac además es muy preciso y cómodo",
                "reviewText": "Me gusto la ergonómico que es y no me gusto el precio",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61UhUwTOKaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61DEBxp80FL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 7, 2022",
                "reviewTitle": "Comodo",
                "reviewText": "Muy cómodo, buena calidad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Felipe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 5, 2021",
                "reviewTitle": "Para manos pequeñas, tal vez.",
                "reviewText": "El sonido del del click es relativamente alto, no está pensado para manos grandes y, como yo apuntaba alguien por ahí, percibo un tema con el desplazamiento. Tenía cierta expectativa con este mouse, pues tengo otro de esta misma marca (alámbric, T-60), el cual me parece excelente, aunque buscaba algo más \"ergonómico\". Bueno, quizá espere demasiado.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 16, 2021",
                "reviewTitle": "Comfortable for small hands",
                "reviewText": "I've struggled to find a suitable ergonomic mouse as a person with small hands who plays a lot of games, particularly FPSes. This mouse fits my hands (just over 6in) exceptionally well (note, I think this would be uncomfortable with larger hands!). My biggest complaint is that the left-hand buttons are a bit of a stretch, however that makes them harder to bump, which I appreciate. Otherwise this is the most comfortable mouse I may have have ever used! It's surprisingly good for gaming (much better than I thought) and I find my hands being in less pain means I'm holding less tension and therefore moving better in game, too. One downside is that the software is a bit of a pain to get as there's not an obvious source to download, and it ships with a CD-ROM.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}