{
    "remaining_requests": 47169,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mouse-Motorcycle-Beverly-Cleary/dp/0380709244",
    "body": {
        "name": "The Mouse and the Motorcycle",
        "price": "$5.09 $1.07",
        "originalPrice": "$9.99",
        "rawPrice": 5.09,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mouse-Motorcycle-Beverly-Cleary/dp/0380709244",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "80",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51q6UlEfEsL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51wBcOM6UrL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Beverly Cleary",
            "link": "https://www.amazon.com/Beverly-Cleary/e/B000AQ44W4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by glenthebookseller.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 4501,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Amazon.com Review \"Pb-pb-b-b-b. Pb-pb-b-b-b.\" With these magic vocables, Ralph the mouse revs up a dream come true--his very own motorcycle. Living in a knothole in a hotel room, young Ralph has seen plenty of families come and go, some more generous with their crumbs than others. But when young Keith and his parents check in to the hotel, Ralph gets his first chance to check out. He has always fantasized about venturing beyond the second floor, maybe even outside. Curiosity overcomes caution, and Ralph must have a go at Keith's toy motorcycle. Soon, the headstrong mouse finds himself in a pickle, when all he wanted was to ride a motorcycle. Lucky for him, the boy understands how it is. When he discovers Ralph in his thwarted attempt to abscond with the toy bike, Keith generously encourages the rodent to ride. He even teaches him the simple trick of starting the motorcycle: \"You have to make a noise... pb-pb-b-b-b.\" The subsequent situations Ralph motors into require quick thinking and grownup-sized courage. The team of Beverly Cleary and Louis Darling has been a great favorite for decades, introducing young chapter readers to Ramona, Beezus, Henry, and of course Ralph the mouse. (Ages 8 and older) --Emilie Coulter Review One might know that if Beverly Cleary were to invent a mouse, it would be a down-to-earth, boyish mouse with a proclivity for getting into scrapes. A good story! — Chicago Tribune From the Back Cover Born to Ride!Ralph is not like the other mice at the Mountain View Inn. He is always looking for adventure. So when a young guest named Keith arrives with a shiny miniature motorcycle, it's Ralph's lucky day. Right away, Ralph knows that the motorcycle is special—made to be ridden by an adventurous mouse. And once a mouse can ride a motorcycle . . . almost anything can happen! About the Author Beverly Cleary is one of America's most beloved authors. As a child, she struggled with reading and writing. But by third grade, after spending much time in her public library in Portland, Oregon, she found her skills had greatly improved. Before long, her school librarian was saying that she should write children's books when she grew up.Instead she became a librarian. When a young boy asked her, \"Where are the books about kids like us?\" she remembered her teacher's encouragement and was inspired to write the books she'd longed to read but couldn't find when she was younger. She based her funny stories on her own neighborhood experiences and the sort of children she knew. And so, the Klickitat Street gang was born!Mrs. Cleary's books have earned her many prestigious awards, including the American Library Association's Laura Ingalls Wilder Award, presented to her in recognition of her lasting contribution to children's literature. Dear Mr. Henshaw won the Newbery Medal, and Ramona Quimby, Age 8 and Ramona and Her Father have been named Newbery Honor Books. Her characters, including Beezus and Ramona Quimby, Henry Huggins, and Ralph, the motorcycle-riding mouse, have delighted children for generations.Jaqueline Rogers has been a professional children's book illustrator for more than twenty years and has worked on nearly one hundred children's books. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 2 hrs 23 mins",
            "$3.98 delivery Thursday, February 22."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this imaginative adventure from Newbery Medal–winning author Beverly Cleary, a young mouse named Ralph is thrown into a world of excitement when a boy and his shiny toy motorcycle check in to the Mountain View Inn.When the ever-curious Ralph spots Keith's red toy motorcycle, he vows to ride it. So when Keith leaves the bike unattended in his room one day, Ralph makes his move. But with all this freedom (and speed!) come a lot of obstacles. Whether dodging a rowdy terrier or keeping his nosy cousins away from his new wheels, Ralph has a lot going on! And with a pal like Keith always looking out for him, there's nothing this little mouse can't handle.This timeless classic now features a foreword written by New York Times bestselling author Kate DiCamillo, as well as an exclusive interview with Beverly Cleary herself. The Mouse and the Motorcycle is perfect for independent reading or for shared reading at home or in a classroom. This fun story is the first of a trilogy, along with Runaway Ralph and Ralph S. Mouse, all inspired by the author's hope to create appealing books for boys and girls—and by the sight of her son playing with toy cars. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0380709244"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ HarperCollins; Reissue edition (June 15, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 176 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780380709243"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0380709243"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 5 - 9 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 860L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 4.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.12 x 0.42 x 7.62 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,196 in Books (See Top 100 in Books) #5 in Children's Mouse & Rodent Books #44 in Children's Classics #57 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 4,501 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Celebrate D.E.A.R. Day all year long!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/d67fe201-cf4a-47e7-90ce-941d14cbefeb._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/da57ba65-8f43-403b-8bff-42230249a013._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/4371d19b-d54a-4e70-9397-a2352f90fe99._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/d67fe201-cf4a-47e7-90ce-941d14cbefeb._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/da57ba65-8f43-403b-8bff-42230249a013._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/4371d19b-d54a-4e70-9397-a2352f90fe99._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Erin Foster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPGVGIJWCD2C3ZI5FSOCEJXNPEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UFGCZMPH19JA?ASIN=0380709244",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Childhood book",
                "reviewText": "I read this book as a child, so when I found it for my son I was so excited that he would be able to read the same book, the price is great and love that it's a smaller paperback version of the large one I read as a kid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris MoweryChris Mowery",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECQD4LN6AX5SAXUHGDKHMLTTOLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZB8T93AQ66NJ?ASIN=0380709244",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Great 1st Chapter Book!",
                "reviewText": "My 7 year old wanted to read his first solo chapter book and this one was great. Print size etc is perfect and even has some little illustrations. Only issue is some of the words are outdated based on when it was written but to be expected based on its age!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712NsMyAtdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Wfm1DWOJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71kw3Xf0H-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandericka Murphy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFYFZ77UQNLCFWCDCNYMS5J4QIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EM3Y4OYDEVUQ?ASIN=0380709244",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful",
                "reviewText": "Amazing Book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher A Trumbull",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYAGS7H7MW6MSFJW5XZHYVSYHCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGYHCDV7OEWIF?ASIN=0380709244",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars good job",
                "reviewText": "Item in good shape, as described, timely delivery, good job.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jana Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX2TCH2TQH6ZTT3PNK4AO35PO3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IPIL5Q3P0RI2?ASIN=0380709244",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 22, 2022",
                "reviewTitle": "4.0 out of 5 stars A Portal Back to Childhood",
                "reviewText": "The Mouse and the Motorcycle is a portal back to the feelings and interpretations of childhood. It follows the adventurous young mouse, Ralph and his escapades around the faded Mountain View Inn. The book opens with Ralph’s view from his mouse hole of a new guest of Room 215. The daring Ralph’s attention is fixed on the guest’s beautiful toy motorcycle. When the guest, a young boy named Keith, becomes friends with Ralph and learns of his longing to ride the machine, he loans Ralph the motorcycle to zoom around the halls at night. The rest of the book follows Ralph as he takes risks and makes mistakes many humans would find shockingly similar to our own experiences. Beverly Cleary’s genius insight into the feelings of all children shines through in this lighthearted and exciting book.Part of the relatable aspects of the book is its nostalgic setting. The Mountain View Inn rests too far off the highway for the average exhausted roadtripper. It was once a heart of tourism, but its glamor has faded into a quiet and worn refuge deep in the California foothills. Mrs. Cleary’s familiar descriptions create the illusion that the reader is at the hotel with Ralph and Kieth. In a show of her genius, we the readers only see as much of the hotel as Ralph can see. For most of the book we linger in Room 215 and Ralph’s family’s mouse hole within the walls of Room 215. In one exciting chapter, we get to explore the hall as Ralph enjoys a night ride. The rumored downstairs is finally revealed at the end of the book as Ralph ventures down the elevator in a quest to find an aspirin for Kieth.Though the setting lays the scene for a sweet summer story, the amazingly relatable characters brought to life by Beverly Cleary are what have kept this book a classic. Once again, the reader feels as if they have met all these characters somewhere before, from Ralph’s worrisome mother to Matt the bellboy. Ralph’s headstrong personality drives the plot. His adventures are why we love him, but they also get him into trouble. Ralph makes mistakes and is hurt by the consequences in ways every human has felt. Despite his faults, it’s impossible not to be immediately drawn to Ralph because of his unshakeable confidence. A chapter I found hilariously true was Chapter 8: A Family Reunion. The aunts are silly, the uncles are booming, and the cousins are rambunctious. Ralph is unsure of what to say when giggling aunts come up and exclaim “Look how big you are now!” Even unnamed characters such as the lazy summer maid and a grumpy man who has to take his unruly dog out every night are obviously thought through.In conclusion, The Mouse and the Motorcycle is a beautiful book, full of imagination, familiar descriptions and lifelike characters. I couldn’t stop feeling amazed at how accurately Mrs. Cleary framed the experiences of every American child in one creative, captivating book. If you don’t read it as a child, please do as an adult. There’s a good reason why Beverly Cleary’s name is famous in American literature.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESH3TA44OUYPZCKCCC3BK4U4H4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PQSU8KMWZTTC?ASIN=0380709244",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars My Great Grandson loved it",
                "reviewText": "Great book came in excellent condition",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason  martinez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV3FXW6LG2EYPPDCQOBQ44E5MGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2STK1B6TZBP2Q?ASIN=0380709244",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Classic",
                "reviewText": "Great read for my 8 yr old",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sue Rae Buck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJKCR4NIQSSJRGD35PZQTCALXQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZSUT1AX9OAW6?ASIN=0380709244",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Kevin and Ralph!",
                "reviewText": "The Mose and the Motorcycle by Beverly Clearly is the first in the series in which Kevin meets a mouse named Ralph. This was a great read and wonderful characters. Last time I read this book, I was 12!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TrekkerTrekker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 14, 2019",
                "reviewTitle": "Tema diferente de um assunto manjado",
                "reviewText": "Livro interessante. A autora tem vasta coleção de livros infantis. Para o público infanto-juvenil que quer treinar sua leitura em inglês é uma boa pedida. Recomendo!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HLJHThR5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JvF",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 21, 2024",
                "reviewTitle": "Loved",
                "reviewText": "I bought this as a gift for a little girl, who loves motorbikes. Her granddad rides one ( a Harley Davison)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JammieB22",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 7, 2017",
                "reviewTitle": "Good story. Quality used copy.",
                "reviewText": "Ok, it's a story I read a long time ago but it's still a good one. It's funny and pacy with lots of opportunities for discussion. Good quality used copy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Myrna Pilgram",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on December 19, 2019",
                "reviewTitle": "Classic book for boys",
                "reviewText": "Mouse and the MotorcycleMy grandson enjoyed this story. He could relate to the boy and the mouse. Great vocabulary challenge too!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tanvi T",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 31, 2015",
                "reviewTitle": "Five Stars",
                "reviewText": "A very different kind of motorcycle book which was fun to read even for an adult.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}