{
    "remaining_requests": 47218,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-M525-Wireless-Mouse-Micro-Precision/dp/B005KSAHZU",
    "body": {
        "name": "Logitech M525 Wireless Mouse – Long 3 Year Battery Life, Ergonomic Shape for Right or Left Hand Use, Micro-Precision Scroll Wheel, and USB Unifying Receiver for Computers and Laptops, Black/Gray",
        "price": "$29.95",
        "originalPrice": "",
        "rawPrice": 29.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-M525-Wireless-Mouse-Micro-Precision/dp/B005KSAHZU",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B006MCDUZM"
        ],
        "asinVariationValues": [
            {
                "asin": "B005KSAHZU",
                "variationName": "Color",
                "variationValue": "Black/Gray",
                "price": "$29.95",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Jo5RpWPWL._SS36_.jpg"
            },
            {
                "asin": "B005KSAO6C",
                "variationName": "Color",
                "variationValue": "Green/Gold",
                "price": "$98.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/31lWPD3d6uL._SS36_.jpg"
            },
            {
                "asin": "B005KSAJXK",
                "variationName": "Color",
                "variationValue": "Navy/grey",
                "price": "$29.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41wSI0LxYUL._SS36_.jpg"
            },
            {
                "asin": "B005KSAOKI",
                "variationName": "Color",
                "variationValue": "Red/Black",
                "price": "$28.50",
                "variationImageURL": "https://m.media-amazon.com/images/I/31VFmNn9AsL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Jo5RpWPWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41QycR7RGBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31DojHmVmlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AYq4E0fLL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1G5+9K7OUS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1aZk29n20L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "Sold by Phone-Zone and Fulfilled by Amazon. Sold by Phone-Zone and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 29387,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35. Order within 2 hrs 30 mins",
            "FREE delivery February 24 - March 1 on orders shipped by Amazon over $35",
            "Or fastest delivery February 23 - 27"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "ERGONOMIC SHAPE - Ergonomically shaped design and soft rubber grips conform to your hand to be naturally comfortable and the compact size makes it easy to take with you wherever you use your computer at home, at work or anywhere else, USB receiver is stored inside the mouse where the batteries are located",
            "Interface: USB receiver. Mouse Dimensions (height x width x depth)-4.00 x 2.24 x 1.51 inches. Receiver Dimensions (height x width x depth)-0.57 x 0.74 x 0.24 inches",
            "CONVENIENT CONTROLS - Easy-to-reach Back/Forward buttons makes moving quickly between documents or browsing your favorite Web sites a breeze",
            "MICRO-PRECISE SCROLL WHEEL - With more grooves per millimeter, our new scroll wheel gives you the ultimate navigation experience",
            "LONG BATTERY LIFE - 3 year battery life and smart sleep mode help you go longer between battery changes",
            "PLUG'N'PLAY CONNECTION - Nano-sized Logitech wireless unifying receiver stays in your computer plug it in, forget it, even add compatible wireless devices without multiple USB receivers"
        ],
        "description": "Product Description With micro-precise scrolling, ultra-smooth cursor control and super-long-and-reliable battery power, the compact Logitech Wireles Mouse M525 screams control—and personal style in your choice of sweet color combinations. From the Manufacturer Features Enlarge Blue/Grey Red/Black Green/Gold White/Red Enlarge Enlarge Enlarge Enlarge Logitech Wireless Mouse m525 (Black/Grey) Precision performance meets personal styleControl freaks, rejoice. With micro-precise scrolling, ultra-smooth cursor control and super-long-and-reliable battery power, this compact wireless mouse screams control—and personal style in your choice of five sweet color combinations. Enlarge Improved scroll control Innovative Micro-precision scroll wheel puts more control under your finger with more grooves per millimeter Faster, easier web navigation and scrolling through long web pages Tilt wheel lets you move backward and forward on the web, just like a swipe* Long-lasting power 3 full years of battery life means you almost never need to change batteries** On-Off switch and smart sleep mode save power Battery indicator light eliminates surprises Enlarge Hand-friendly design Ergonomic shape and soft rubber grips conform to your hand and feel naturally comfortable Compact size is easy to take with you from home to work or anywhere you use your computer Enlarge Versatile USB wireless receiver Unifying receiver connects up to 6 Unifying-compatible devices. Learn more> Add a keyboard or switch between mice without changing receivers or filling up all your USB ports So tiny it can stay in your laptop wherever you go Logitech Advanced Optical Tracking Laser-grade precision even on smooth, glossy surfaces that challenge standard optical mice Uses less power so your battery lasts longer *Tilt wheel will not support backward/forward on Mac computers but will support Dashboard, Exposé or Spaces (when you select in System Preferences). ** Battery life may vary based on user and computing conditions. Visit Logitech.com/MouseBattery for more information about the way we test the battery life of mice. Compatibility Package ContentsMouse Logitech Unifying receiver Two AA batteries User documentation 3-year limited hardware warranty Works withWindows XP, Windows Vista or Windows 7 Mac OS X 10.5 or later Linux kernel 2.6+ USB port Internet access Wireless Mouse m525 Noteworthy Features • Precision scroll/tilt wheel for easier web navigation* • 3-year battery life** • Comfortable ergonomic shape • Soft rubber grips • Compact desk and travel size • Logitech Unifying receiver connects multiple compatible wireless devices • Advanced optical technology for smooth, multi-surface tracking Logitech Wireless Mouse M310 Full Size Logitech Wireless Mouse M525 Compact Enlarge For a full-size wireless mouse in juicy colors, check out the Logitech Wireless Mouse M310. CompareWhich Logitech Wireless Mouse is right for you? What to look for Portable Mice Full-Size Mice Good Better Best Wireless Mouse M305 Wireless Mouse M525 Marathon Mouse M705 Anywhere Mouse MX Wireless Mouse M310 Wireless Mouse M510 Couch Mouse M515 Performance Mouse MX Connection Strength The higher the signal strength, the more reliable your connection will be. Especially important in busy wireless environments like airports. 2.4 GHz 2.4 GHz 2.4 GHz 2.4 GHz 2.4 GHz 2.4 GHz 2.4 GHz 2.4 GHz Tracking Quality Look for smooth, precise cursor control. The higher the quality, the easier it is to navigate documents and web pages. The best also work on more surfaces, including glass. High-definition optical sensor Advanced optical sensor for multi-surface tracking Laser Sensor Also works on glass Laser Sensor Laser Sensor Also works on couch, blankets, etc. Also works on glass Power Management Stay more productive and eliminate hassles with longer periods between battery changes or a rechargeable mouse. 1 AA battery (6 months max. battery life) 2 AA batteries (3 years max. battery life) 2 AA batteries (3 years max. battery life) 2 AA batteries (6 months max. battery life) 1 AA battery (12 months max. battery life) 2 AA batteries (2 years max. battery life) 2 AA batteries (2 years max. battery life) Rechargeable Wireless Receiver The receiver stays in your computer for cordless mouse control. The smaller the receiver (from standard to nano size), the more convenient it is. The Unifying receiver also lets you add compatible Unifying devices like a wireless keyboard. Nano size receiver Unifying receiver connects up to 6 Unifying-compatible devices Unifying receiver connects up to 6 Unifying-compatible devices Unifying receiver connects up to 6 Unifying-compatible devices Nano size receiver Unifying receiver connects up to 6 Unifying-compatible devices Unifying receiver connects up to 6 Unifying-compatible devices Unifying receiver connects up to 6 Unifying-compatible devices Scrolling Performance Scroll through long documents and web pages without having to drag the scroll bar. Performance ranges from fast to hyper-fast. Create The Combo That Works For YouLogitech has a range of products that you can connect via a single, tiny Unifying receiver you leave plugged in to your notebook. Mix. Match. Unify. Now you can create your perfect laptop workstation, wherever you work.Logitech Wireless Illuminated Keyboard k800 With laser-etched, backlit keys you can see easily in any light, a sleek look, and comfortable, fluid typing, Logitech Wireless Illuminated Keyboard k800 delivers a brilliant typing experience-day or night.Logitech Wireless Solar Keyboard k750 Battery hassles are a thing of the past with the solar-powered Logitech Wireless Solar Keyboard k750. The keyboard charges itself with any light, including the one on your desk.Logitech Wireless Touch Keyboard k400 Get wireless control of your laptop—even when you're connecting it to your TV. You can control your laptop without getting up from the couch thanks to the 10-meter (33 feet) wireless range. The large 3.5-inch, built-in touchpad with multi-touch navigation makes vertical and horizontal scrolling intuitive. Setup is simple, too.Logitech Wireless Desktop mk710 Where comfort and productivity go hand-in-hand. Up to three-year battery life for both keyboard and mouse practically eliminates the need to replace batteries.* * Keyboard battery life calculation based on an estimated two million keystrokes/year in an office environment. User experience may vary. Mouse battery life may vary based on user and computing conditions.Logitech Wireless Number Pad n305 Logitech Wireless Number Pad n305 gives you convenient number entry for notebooks. Up to three years of battery life and a wireless receiver you leave plugged in means it's always ready. .Sensor Resolution: 1000",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Average Battery Life (in hours)",
                "value": "‎36 months"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Series",
                "value": "‎M525 Wireless Mouse"
            },
            {
                "name": "Item model number",
                "value": "‎910-002696"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC, Mac"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 10, 11 or later, Chrome OS, macOS 10.5 or later"
            },
            {
                "name": "Item Weight",
                "value": "‎0.16 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎8.27 x 2.28 x 7.09 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎8.27 x 2.28 x 7.09 inches"
            },
            {
                "name": "Color",
                "value": "Black/Gray"
            },
            {
                "name": "Power Source",
                "value": "‎Battery Powered"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Manufacturer",
                "value": "‎Logitech"
            },
            {
                "name": "ASIN",
                "value": "‎B005KSAHZU"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎September 5, 2011"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 29,387 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,540 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #94 in Computer Mice #806 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, USB"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic Design"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Wireless Mouse M525 Control Meets Style Control freaks, your mouse is ready. With micro-precise scrolling, ultra-smooth cursor control and super-long-and-reliable battery power, this compact wireless mouse screams control—and personal style in your choice of sweet color combinations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2cfa5e4a-38cc-406f-bc0f-2a57255d5e03.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Micro-precise scroll wheel With more grooves per millimeter, our scroll wheel gives you the ultimate navigation experience. It makes scrolling through long web pages faster and easier. Ergonomic shape The design and soft rubber grips conform to your hand to be naturally comfortable. The compact size makes it easy to take with you wherever you use your computer—at home, at work, or anywhere. 3-year battery life* With ultra-long-lasting battery power, you can practically forget about changing batteries. Plus, the smart sleep mode saves power, while an indicator light eliminates surprises. Logitech advanced optical technology The laser-grade optical sensor delivers super-precise tracking—even on challenging smooth, glossy surfaces. All while using less power so you get longer battery life and more convenience. Unifying wireless connection Plug the tiny Logitech Unifying receiver into your computer’s USB port and leave it there. Add up to five more Unifying devices, like a Logitech wireless keyboard, using a single receiver. Page back/forward To make surfing your favorite websites easier, you can move the tilt wheel left or right to move backward or forward while you’re surfing the Web.",
                "media_link": []
            },
            {
                "media_text": "Compare Wireless Mice No Flow control No No Easy switching No Advanced Optical Laser-grade tracking ✔ 36 months Max battery life 12 months Micro-precise Hyperfast scrolling No USB Wireless connection Bluetooth No Flow control No No Easy switching No Advanced Optical Laser-grade tracking Advanced Optical 36 months Max battery life 36 months Micro-precise Hyperfast scrolling ✔ USB Wireless connection USB No Flow control No No Easy switching No Advanced Optical Laser-grade tracking Precision Optical 36 months Max battery life 24 months Micro-precise Hyperfast scrolling ✔ USB Wireless connection USB/Bluetooth No Flow control 3 computers No Easy switching 3 devices Advanced Optical Laser-grade tracking ✔ 36 months Max battery life Rechargeable Micro-precise Hyperfast scrolling ✔ USB Wireless connection USB/Bluetooth",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/c691177e-02a3-4c6c-8336-d9c9090efd19._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2cfa5e4a-38cc-406f-bc0f-2a57255d5e03.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c27a1a97-7a8f-4911-93d1-cb45b5821274._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d1ed965e-b595-495f-841d-a8700460452e._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/09572374-f49d-4c49-80af-0d61c24b309b._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e9766df1-4925-4911-9d8d-fad1595c9a7e._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dcdb0824-d986-449c-ae77-68a0012ebed5._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e979bb2e-2e32-4901-9a6d-085843bd435b._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2cad1734-61e2-47c4-bdab-810c317b52b6._CR0,0,1464,600_PT0_SX1464__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84a89ba1-9f9f-48f6-b5cc-6b0db273f166.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0d6a87ec-0b8f-4712-9cbf-fd7fe1baaf71.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f16f38c7-b88d-42b5-a2f9-0b7d23124efb.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ae9f99d-c330-4172-90f6-19db876bf8d2.__CR0,0,488,700_PT0_SX488_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Damian Marynski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7U2UVSJLR7RR7LBSR6V5XDV5PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTOKIHHQQZTMW?ASIN=B005KSAHZU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2014",
                "reviewTitle": "5.0 out of 5 stars Needed a wireless mouse for traveling",
                "reviewText": "Amazon provides tons of choices when it comes to the wireless computer mouse. However, not all can compete with the Logitech M525. It came down to Logitech M525 and Logitech Anywhere Mouse MX. I took the time to compare the two mouse, but the difference was slight. On the chart provided by Logitech the Anywhere Mouse MX is better than the M525, but I guess it is to the persons preference what they are looking to gain from the mouse. When doing the research I took the following categories into consideration before buying.Travel, Battery Life, Compatibility with Windows & Mac, Mini USB, and Multi Surface Tracking.TravelingMost of the time I am on the road for my company, and I needed a mouse that will fit my needs. The M525 is perfect when it comes to the mini USB. There is no need to take out the USB when putting the laptop into the sleeve of the travel bag.The design of M525 is small and compact so it can be taken anywhere. I was worried that since this is not a full size wireless mouse that my hand will be too big for the mouse, but it is ok fit.I picked M525 over Anywhere Mouse MX because it has better battery life, price difference, and the reviews. I was not looking for advanced mouse, just a simple mouse that I can grab and go.I guess the only drawback that I did not realize is that the M525 does not support backwards and forward on Mac computers.Pro*Small*3 Full years of battery life (depending on usage)*Battery light indicator*Multi surface*Works with Windows XP, Windows Vista, Windows 7 & 8, Mac, & Linux (I have tested & can confirm that it works great with Windows Vista, Windows 7, Windows 8 and Mac Book Pro)*Awesome designs*Comes with 2 AA batteries* Amazing optical tracking! The cursor does not run away.Cons*Does not support backwards and forward on Mac computers*Not the best comfort fit for your hand, since its smaller*M525 requires 2 AA batteries so if you are used to M305 which only requires 1 AA battery that might be a drawback for you.* Scroll wheel. I wish it had resistance not just smooth scrolling",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYSPVJGI5256K2K7DRAY75UYLKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O967NW9PW5OM?ASIN=B005KSAHZU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2012",
                "reviewTitle": "5.0 out of 5 stars M525... excellent portable / compact mouse",
                "reviewText": "Logitech is known for their outstanding products, and this mouse appears to be rugged, stylish, and very functional!Its a bit smaller than my M510 and not quite as \"comfortable\", but being compact, I expect it to feel a bit different than a full-size mouse. It definitely feels better than the M305 or M505The stripes on the side add a touch of style, but they are \"slick\"... I would rather have the rubberized grip full-length of the sides, rather than in front and behind the stripe.Scroll wheel is very smooth and \"light\" touch... rather then feeling the \"deep clicks\" of the scroll on the M510 or M310, this one is very sensitive and can easily scroll \"fast\". The texture of the scroll wheel is very nice and grips well for vertical or horizontal scrolling.There are no \"forward/back\" buttons on the left side of the mouse, like the M510/710, but I knew that before ordering... no biggie, but you'd think Logitech would make those standard on all but their most basic lines.Mouse is very responsive and works on pretty much any smooth surface (at least any I've tried so far).Battery compartment is easy to open (release button on bottom of mouse), and the batteries (included, but not Duracell like normally included with Logitech devices) install easily. There is also a storage slot for the nano receiver... but most people will just leave it plugged into the computer/laptop. Syncing the device was a breeze... plugged in the receiver and after a few seconds, it recognized this mouse, as well as my M510 and K350 keyboard, which were both in the same room. Selection of devices to sync with was a breeze... click and go.All in all, a great mouse for travel with my laptop, and I won't have to worry about batteries for at least a couple of years, even if I forget to turn it off before tossing it into the bag. I would have preferred a satin finish, rather than the shiny/slick finish, but that is just a matter of preference... does not affect function and does not appear to show finger-prints like you'd expect a shiny finish to do.UPDATE:I've been using this mouse for nearly a year, and suddenly it stopped working. After some troubleshooting on my own, I found the Unified Receiver to be the fault. I contacted Logitech, and after speaking with them for only 3-4 minutes, they shipped out a new Unified Receiver! FANTASTIC customer service dept.! The new receiver arrived in a couple of days, and my mouse is happily scooting and scrolling along again!",
                "reviewVotes": "169 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNUZPIKDKDEQAXHW4PUVTGQRYUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24K8LZHXU3H03?ASIN=B005KSAHZU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice mouse, perfectly symmetric for a left or right hand use",
                "reviewText": "I am on a computer all day long and know what a good mouse feels like. This is a good mouse, and is very responsive and a good value for the money. Definitely get the free logitech software that lets you assign the buttons that will really speed up your workflow for copying and pasting or doing any repetitive activity. Works well with my full-size Logitech keyboard. Lastly, I really like the unifying receiver and allows you to easily set it up to use any combination of keyboard and mouse on any computer. Here’s an example of useful scenario. I have two mice programmed to the same receiver. If my child is working on their computer and they need some assistance from me, I just have an extra mouse that I can use to control their computer so I don’t have to pass the miles back-and-forth between two people. Particularly useful if you connect the computer to a television allowing either of you to control the cursor with your own mouse",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eckart Keller",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 21, 2023",
                "reviewTitle": "Sehr gut, aber nicht preiswert",
                "reviewText": "Dennoch würde ich sie wieder kaufen, weil mich Haptik und Stromverbrauch überzeugen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Osprey4027",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 9, 2023",
                "reviewTitle": "I love these little Logitech mice!",
                "reviewText": "Had Logitech V450 Nano for about 15 years, used it almost daily (including numerous accidents - falling off desks, having water spilt on him) and alas, he has moved to the mouse house in the sky now.So pleased I managed to find this one - the same shape and weight! Works just the same, simple three buttons (left, right, middle one scrolls and clicks). Battery life is excellent. Nice and solid little mouse (I have small hands so this is great). The dongle fits inside it for when travelling. And the red colour makes it stand out so it doesn't get pinched when visiting the office. Highly recommended.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Dupuis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on April 14, 2021",
                "reviewTitle": "Bonne souris agréable à utiliser.",
                "reviewText": "Bonne souris agréable à utiliser et qui est peut être encore plus réactive et précise avec une bécane INTEL qu'avec une bécane AMD.J'en avais acheté une verte neuve qui fonctionne toujours parfaitement et celle ci fonctionne tout aussi bien qu'elle.Très satisfait de mon achat. A voir pour la fiabilité, ce que ça va donner mais pour le moment, que de la satisfaction.2 précisions pour finir : les piles (2 piles R6) dure normalement longtemps (si on ne prend pas des piles ordinaires pas cher) et la diode indiquant la mise sous tension de la souris ainsi que le niveau d'usure des piles est très pratique.Cordialement.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 19, 2020",
                "reviewTitle": "Qualità",
                "reviewText": "Molto funzionale",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pilpoil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 16, 2020",
                "reviewTitle": "Souris Logitech M 525",
                "reviewText": "Souris en remplacement de la mienneJ'en suis satisfait,mais très chère comparé a beaucoup de version ou modéle",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}