{
    "remaining_requests": 47321,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-B100-Corded-Mouse-Computers/dp/B003L62T7W",
    "body": {
        "name": "Logitech B100 Corded Mouse, Wired USB Mouse for Computers and Laptops, Right or Left Hand Use - Black",
        "price": "$7.99$7.99",
        "originalPrice": "$10.79",
        "rawPrice": 7.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-B100-Corded-Mouse-Computers/dp/B003L62T7W",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BVZZ36ZL"
        ],
        "asinVariationValues": [
            {
                "asin": "B003L62T7W",
                "variationName": "Size",
                "variationValue": "1 Count (Pack of 1)",
                "price": "$7.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CFXJZQ1G",
                "variationName": "Size",
                "variationValue": "1 Count (Pack of 2)",
                "price": "$15.98",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31iFF1KbkpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41BiqsbCTgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41G D cn4kL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41k1ZhnJAHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41UGnPy7OwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CosphaqlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31KIVFAq3ML.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81CZMcq9xTL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81CZMcq9xTL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 37171,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 2 hrs 52 mins",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 13. Order within 2 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "A comfortable, ambidextrous shape feels good in either hand, so you feel more comfortable as you work-even at the end of the day.",
            "With 800 DPI sensitivity, you'll get precise cursor control so you can edit documents and navigate the web more efficiently.",
            "Side-to-side scrolling Plus zoom lets you instantly zoom in or out and scroll horizontally and vertically. Perfect for working with spreadsheets and presentations.*",
            "Zero setup with flexible connectivity means you just plug it into your USB or PS/2 port-it works right out of the box. Scrolling: Line-by-line scrolling | Scroll Wheel: Yes, optical",
            "This mouse is built by logitech-the mouse experts. It comes with the quality and design We've built into more than a billion mice, more than any other manufacturer.",
            "Works With Chromebook - The Works With Chromebook badge signifies products that are certified to meet Chromebook compatibility standards, to provide you with a seamless experience.",
            "Cable length: 180 cm",
            "Compatibility: Windows 7, 8, 10 or later macOS 10.5 or later. ChromeOS, Certified Works With Chromebook 1T. Linux Kernel 2.6+"
        ],
        "description": "The B100 Optical Combo mouse. An office basic with built-in quality. A comfortable, ambidextrous shape feels good in either hand, so you feel more comfortable as you work—even at the end of the day. With 800 dpi sensitivity, you'll get precise cursor control so you can edit documents and navigate the web more efficiently. Zero setup means you just plug it into your USB port—it works right out of the box. This mouse is built by logitech—the mouse experts. It comes with the quality and design We've built into more than a billion mice, more than any other manufacturer. This product has been certified by Logitech to meet Google's compatibility standards. Google is neither responsible for the operation of this product nor its compliance with any applicable or other safety requirements. This product is serviced and supported exclusively by Logitech in accordance with the terms and conditions of the product. Please contact Logitech directly for technical support and customer service.\" Chromebook and the \"Works With Chromebook\" badge are trademarks of Google LLC.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "1.49 x 2.44 x 4.44 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.84 ounces"
            },
            {
                "name": "ASIN",
                "value": "B003L62T7W"
            },
            {
                "name": "Item model number",
                "value": "910-001439"
            },
            {
                "name": "National Stock Number",
                "value": "7025-01-631-8822"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 37,171 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#938 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #13 in Computer Mice #117 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 8, 2010"
            },
            {
                "name": "Department",
                "value": "Computer Hardware, Supplies & Data Storage"
            },
            {
                "name": "Manufacturer",
                "value": "Logitech"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Connectivity Technology",
                "value": "PS/2, USB"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic Design"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "This product has been certified by Logitech to meet Google's compatibility standards. Google is neither responsible for the operation of this product nor its compliance with any applicable or other safety requirements. This product is serviced and supported exclusively by Logitech in accordance with the terms and conditions of the product. Chromebook and the \"Works With Chromebook\" badge are trademarks of Google LLC. Logitech B100 Optical USB Mouse An office essential from the mouse experts Get more done. And feel better doing it. B100 brings you Logitech design quality in a sculpted, ambidextrous shape that feels good in either hand. So you feel more comfortable as you work—even at the end of the day. With 800 dpi sensitivity, you’ll get precise cursor control to edit documents and navigate the Web more efficiently. Comfortable ambidextrous shape Precision 1000 dpi sensor Vertical and horizontal scrolling plus zoom Plug-and-play USB cord connection Quality design by Logitech, the mouse experts Works with Windows, Mac and Linux operating systems",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/46690270-70dd-4d9e-9e76-69da481e6736._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2196a97d-a21a-43ee-97fa-fcdab471d692.__CR0,0,700,350_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "Features Comfortable shape for either hand Right handed? Left handed? Either way, the contoured shape supports your hand in all-day comfort. And the mouse buttons and scroll wheel put comfortable control right at your fingertips. Precise cursor control With an 800 dpi optical sensor, you’ve got the cursor control you need to quickly and accurately point, highlight, cut and paste. Versatile scrolling plus zoom Scrolling plus zoom lets you instantly zoom in or out and scroll horizontally and vertically. Perfect for working with spreadsheets and presentations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/3d8d95fa-6d6f-40da-94ac-3abe8f8f1ea6._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9c25b4ba-550b-410e-b30d-12faa292162d._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/869290a6-f0ee-4bae-bded-2061aa8a444b._SL300__.jpg"
                ]
            },
            {
                "media_text": "Zero setup Works right out of the box — just plug it into your USB port and you're ready for business. Built-in Logitech quality B100 comes with the quality and design Logitech has built into more than a billion mice, more than any other manufacturer.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2ca092e6-6c1b-406a-8b16-2d01ccec5ef7._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/76695b2e-f4f3-48f5-9a9e-4684e345936f._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/46690270-70dd-4d9e-9e76-69da481e6736._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2196a97d-a21a-43ee-97fa-fcdab471d692.__CR0,0,700,350_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3d8d95fa-6d6f-40da-94ac-3abe8f8f1ea6._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9c25b4ba-550b-410e-b30d-12faa292162d._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/869290a6-f0ee-4bae-bded-2061aa8a444b._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2ca092e6-6c1b-406a-8b16-2d01ccec5ef7._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/76695b2e-f4f3-48f5-9a9e-4684e345936f._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kriss",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE77LM3LY4OKGJ5KP2KTHZIVOCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NA56EXDFGP93?ASIN=B003L62T7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2017",
                "reviewTitle": "5.0 out of 5 stars Basic, simple mouse that works beautifully, replacing my old broken mouse without a problem",
                "reviewText": "This mouse was purchased very recently out of necessity. The mouse that had come along with my desktop was finally on its last legs after about five years of use (hey, if it worked fine, why replace it?) and subsequently died completely right after I'd placed the order for this one. Good thing I was proactive and went hunting when the old one started having issues!This little guy fit all the criteria I had when shopping and after about a week of use is performing every bit as well and comfortably as the last one! I like how it's simple and basic, much like my old one. It's a good size for my hand and is nicely shaped (I hate those ergonomic mice that are built short and tall) so it's comfortable to use and feels nice to the touch, all smooth plastic. The buttons work nicely, the wheel scrolls smoothly and only makes a mild clicking, and it has a USB cable (I'm not a fan of wireless mice; they seem less reliable and require more maintenance in my experience). Plus, I was able to get mine for like $5 which was very nice! I was only after a basic, reliable computer mouse to replace my broken one and this one fits the bill! I've used it extensively since it arrived at my door and works wonderfully! My only qualm is that I would have liked for the cord to be a little longer, just to have enough slack to be extra safe, but so far it fits in with my current desktop setup so I won't complain.If you're in the market for a basic, corded mouse that operates smoothly and is comfortable to use, I highly recommend! It's nothing fancy, but it is responsive, comfortable, and I can't find any point of contention with it or its performance. I'm just glad such a simple corded is even still in production! Logitech has always made products I find to be useful and reliable, so I felt confident buying a mouse made by the company.I'll update this review in a few months time (or sooner, if there's a problem) just as a check in on its longevity and functionality over time!Update as of January 24th, 2018Everything is still working wonderfully after almost half a year of use!Update as of July 12th, 2018Still working perfectly almost a year in!Update as of January 2019My mouse began to do this strange thing where it'd simaltaneously right click as I left clicked, which caused me to accidentally select random parts of the right click menu while using my computer. Nothing I did corrected the issue in a way that would keep me using the mouse, so it is put to rest after about 18 months of daily use.The issue stopped when I switched my left click and right click controls to the opposite buttons, but as I am right handed, this was awkward, so I bought a new mouse. My only guess as to why this happened was that the components of the mouse where worn; there's not a super clear distinction between the left and right buttons (there's a single piece of plastic over the two that's just been cut down the middle) so perhaps wear and tear caused some warping that makes it so pressure on the left button side causes the mouse's sensors to feel like the right side is clicking.",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Kent",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPH7RKDJRMTZE3I3FVADSQKGODA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H4XYGT1FD3B1?ASIN=B003L62T7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "Excellent wired mouse and great price!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosie1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRSMZTPKBVXIIQ5GTETAYZCWGIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW555LSUM3KS3?ASIN=B003L62T7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfortable",
                "reviewText": "Nice and no need for batteries. Plug right in and wala!!!! Works fine no issues.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikki Jonczak",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVHNNOXHGCO5TCQAILTOPVPFU5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3869R6PAOHYZV?ASIN=B003L62T7W",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Didn't last long",
                "reviewText": "It is a great price and the reason I got it. It is just plug and go, which is always nice. It is smaller and I like that as I have some hands. Works well. I dropped it a star as I have had it 3 months and the wheel stopped working. I only use in a couple times a week at that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2S7GBWVSELFFHVAUZB3KOQI4TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2503E7HZ9NJ78?ASIN=B003L62T7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Quiet and fits hand nicely",
                "reviewText": "Just what I wanted for use with my laptop. I like to sit on the couch with the mouse on a cushion next to me while surfing. This muse fills the bill. I don't hear any clicking sounds, it works great off the cushions, and is comfortable and has been very reliable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVDLCDGBN5E2KFPTUNIDTSXQLYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCDZAE2V0YSGX?ASIN=B003L62T7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great inexpensive mouse that holds up",
                "reviewText": "Over the past decade I've purchased 5 of these mice. They all still function and are little workhorses. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Will Wagner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7OOVRM2UHXW3SXFHIO5KDPSWRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L7UT1LM1DLBV?ASIN=B003L62T7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Very nice cheap mouse! But also a brand name! Logitech!",
                "reviewText": "Great mouse, corded, and has 2 buttons and a roll wheel that has a small amount of feedback, unlike more expensive models that have a smooth scrolling wheel, which I hate. I want to know the wheel is moving. Wheel is also a mouse button. Mouse buttons have a quiet click, but I like hearing the feedback. The red led eye on the bottom tracks very well, and is immediate. No slowness or sluggish response. I prefer corded mice, so I never have to replace batteries. It just runs! I am using this on a Mac, so just letting you know it is Mac compatible, or also for use on a PC in Windows. Great mouse, I may go ahead and get me 2 more, just as backups, since this kind of hard to get anymore for this price!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SomberMoose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG4GWHHJHAMCQ4UQIJLSJKJVKBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLSDYRRXK1B0F?ASIN=B003L62T7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Sometimes you need a corded mouse",
                "reviewText": "I am a retired tech support person. My tech support career began before computer mice, not to mention cordless mice, even existed.As much as I love wireless technologies, I am also aware that sometimes they fail. And when they do, sometimes the only path to recovery is by way of a wired technology. I bought this mouse for those times. I have had two instances recently of helping friends recover failed computers, and in both cases, a wired mouse was a necessary tool.I don't intend to use this mouse everyday, but when I do use it, it feels good and works well. And it may be biased thinking on my part, but I believe I can see and feel the difference between the immediate response of a wired mouse, and a slight, miniscule lag of the wireless mouse. At any rate, I am very happy with this purchase, and it is very inexpensive insurance against those times when wireless fails.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sooraj Sharma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 14, 2024",
                "reviewTitle": "Overall great purchase, would defiantly consider this brand again in the future.",
                "reviewText": "Mouse is great for the price i loved it honestly definitely considering it again to buy if ever needed.plastic is of very good quality and very easy to hold in my hands comfortably for long hours. I use it for blender(3d software) and it works great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 9, 2023",
                "reviewTitle": "Mouse x ufficio",
                "reviewText": "Funzona bene ad un prezzo ottimo, consigliato",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco Márquez Sánchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 16, 2023",
                "reviewTitle": "Sencillez y eficacia",
                "reviewText": "Este modelo de ratón es muy recomendable por varias razones: por disponer de cable (lo que garantiza su funcionamiento siempre), su sencillez y precio asequible. He utilizado en otras ocasiones modelos inalámbricos, más sofisticados y caros, y siempre han fallado. Logitech es garantía de calidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BruteR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 17, 2023",
                "reviewTitle": "Good",
                "reviewText": "Good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francis W Milne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 21, 2021",
                "reviewTitle": "Dependable unit",
                "reviewText": "Useful backup for wireless mouse",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}