{
    "remaining_requests": 47157,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SteelSeries-Rival-600-Gaming-Mouse/dp/B078LJ6RPK",
    "body": {
        "name": "SteelSeries Rival 600 Gaming Mouse - 12,000 CPI TrueMove3Plus Dual Optical Sensor - 0.5 Lift-off Distance - Weight System - RGB Lighting,black",
        "price": "$33.99$30.00$33.99",
        "originalPrice": "$59.99",
        "rawPrice": 33.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SteelSeries-Rival-600-Gaming-Mouse/dp/B078LJ6RPK",
        "soldBy": {
            "sellerID": "A3ULK995NAZ7K2",
            "name": "adelphia",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3ULK995NAZ7K2&asin=B078LJ6RPK&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31ADNjr2yxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/312x9B-nK L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31DtaFNcm0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Up3JiX0FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31VqjxM2c-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/817fSt60zTL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13dc0128-8be1-4575-ac7f-39e9c341919d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c175c741-ddc7-4152-a64e-416398876398/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b40dc48-e53d-4a15-bcbf-707b06f57106/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/46361320-38a2-43fc-8280-ef69a04e92c1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6f107de9-fa8e-4c77-a48a-28d482d72b47/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0e37d1ec-6ce1-45d3-a5f5-39c9d242658a/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71yaTBswgXL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91vsiQjt9lL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SteelSeries Store",
            "link": "https://www.amazon.com/stores/SteelSeries/page/D4BCEF25-4932-416B-A862-A764B2DC9BE6?ref_=ast_bln"
        },
        "brand": "SteelSeries",
        "merchantInfo": "Sold by Toyarcade and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4720,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 1 hr 21 mins",
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 21 mins",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 13. Order within 1 hr 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Exclusive true move 3 12,000 cpi, 350 ips optical 1 to 1 tracking esports sensor",
            "The world's lowest and most accurate lift off distance; Cable length 2 meter; 6.5 foot",
            "256 center of gravity weight tuning configurations; Lift off distance: Customizable, 0.5 millimeter, 2 millimeter",
            "Split trigger 60 million click mechanical switches",
            "Revolutionary silicone side grips for increased grip and durability",
            "Premium magnetic wrist rest – Provides full palm support and comfort"
        ],
        "description": "The rival 600 introduces gamers to the world's most advanced dual sensor system, truemove3+. The truemove3 optical sensor delivers true 1 to 1 tracking, while a dedicated optical depth sensor achieves gaming's lowest and most accurate lift off distance detection. The rival 600 features an exclusive custom center of gravity tuning system with 256 weight configurations and a customizable range from 96g to 128g, ensuring the perfect weight and balance for everyone. Low latency performance is delivered by the powerful 32-bit arm processor and 60 million click mechanical switches and durable silicone side grips guarantee lifelong durability. The rival 600 was engineered for professional esports athletes and a must have for competitive gaming. specificationssensor systemsensor system: Steel series truemove3+ dual sensor systemprimary sensor: True move 3 optical gaming sensorsecondary sensor: Depth sensing linear optical detectioncpi: 100–12000 in 100 cpi incrementsips: 350+, on steel series Qck surfacesacceleration: 50ghardware acceleration: None (zero hardware acceleration) lift off distance: Customizable, 0.5–2 mmdesignTop material: Black soft touchcore construction: Fiber reinforced plasticShape: Ergonomic, right handedgrip style: Universalnumber of buttons: 7switch type: Steel series switch, rated for 60 million clicksillumination: 8 rgb zones, independently controlledweight: 96 g / 3.3 ounces without cable. Customizable up to 128 g / 4.5 ounceslength: 131 mm / 5.2 incheswidth: 62 mm (front), 62 mm (middle), 69 mm (back)/ 2.4 inches (front), 2.4 inches (middle), 2.7 inches (back) height: 27 mm (front), 43 mm (back)/ 1.1 inches (front), 1.7 inches (back) cable type: Detachable, soft rubbercable length: 2 m / 6.5 ft.compatibilityos: Windows, mac, and Linux. USB port requiredsoftware: Steel series engine 3.11.10, for windows (7 or newer) and mac osx (10.8 or newer).",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Mice",
                "link": "https://www.amazon.com/PC-Gaming-Mice/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402052011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "SteelSeries"
            },
            {
                "name": "Item model number",
                "value": "‎62446"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Operating System",
                "value": "‎Linux"
            },
            {
                "name": "Item Weight",
                "value": "‎4.9 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.7 x 5.16 x 1.73 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎2.7 x 5.16 x 1.73 inches"
            },
            {
                "name": "Color",
                "value": "black"
            },
            {
                "name": "Power Source",
                "value": "‎Corded Electric"
            },
            {
                "name": "Batteries",
                "value": "‎2 AA batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎SteelSeries APS"
            },
            {
                "name": "ASIN",
                "value": "‎B078LJ6RPK"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎January 10, 2018"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,720 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,596 in Video Games (See Top 100 in Video Games) #84 in PC Gaming Mice"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Special Feature",
                "value": "Foldable"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "RIVAL 600 2 sensors for next-level precision Never again have unnecessary movement when you pick up and put down your mouse. The new dual sensor system combines true 1-to-1 tracking with breakthrough state-of-the art lift off distance detection. For the first time ever, you are in complete control - even on lift off.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/f7e6dbdb-b454-4ad8-9a95-4dc20384b5e7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page Perfect weight and balance Includes moveable weights for the widest range of weight customization on any gaming mouse. 60 million click mechanical switches The revolutionary reinforced split-trigger design delivers the best clicks in gaming. Durable silicone side grips Featuring a unique silicone compound to allow for increased grip and durability. Next page 1 WEIGHTS 2 SWITCHES 3 GRIPS",
                "media_link": []
            },
            {
                "media_text": "Powerful 32-bit ARM processor The 32-bit ARM processor delivers low-latency performance and allows you to save CPI and lift off sensor settings, custom lighting effects, button keybinds and full macros on-board for software-free use at LAN events and tournaments.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bada09ae-484a-4c1c-9f25-2b9fa5ab393c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Specifications Sensor SteelSeries TrueMove3+ Dual Sensor System, Primary Sensor: TrueMove 3 Optical Gaming Sensor, Secondary Sensor: Depth Sensing Linear Optical Detection, CPI: 100–12000 in 100 CPI Increments, IPS: 350+ on SteelSeries QcK surfaces, Acceleration: 50G, Hardware Acceleration: None, Lift Off Distance: Customizable 0.5–2 mm Weight 96 g / 3.3 ounces without cable, Customizable up to 128 g / 4.5 ounces Illumination 8 independently controlled RGB zones Size Length: 131 mm / 5.2 inches, Width: 62 mm (front) 62 mm (middle) 69 mm (back) / 2.4 inches (front) 2.4 inches (middle) 2.7 inches (back), Height: 27 mm (front) 43 mm (back) / 1.1 inches (front) 1.7 inches (back) Design Top Material: Black Soft Touch, Core Construction: Fiber Reinforced Plastic, Shape: Ergonomic Right-Handed, Buttons: 7",
                "media_link": []
            },
            {
                "media_text": "SteelSeries Headsets The most premium headsets in gaming. Every Arctis headset comes with our flagship audio drivers, a Discord-certified ClearCast mic, and extraordinary comfort. Learn more SteelSeries Keyboards Every SteelSeries keyboard is built to last. Our top gaming keyboards feature industry-leading mechanical switches, per-key RGB illumination, and are all compatible with PC and Mac. Learn more SteelSeries QcK Mousepads Designed for performance and durability, SteelSeries' best-selling mousepads come in a wide variety of styles and sizes, so everyone can find a mousepad perfectly suited to their needs. Learn more",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/f7e6dbdb-b454-4ad8-9a95-4dc20384b5e7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6551bf3a-0187-4ce9-817c-b73382c02a3c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e692e199-db25-4a93-808f-83400352125c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bc6e14b3-c99d-4624-92ff-1e7bca2d1876.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7a08b22f-2810-4b31-9d21-0ab35da21671.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bada09ae-484a-4c1c-9f25-2b9fa5ab393c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e2f9e535-70ff-4e2d-b26a-c2fcbbc804ea.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4e6b759-ffd6-40a9-b5d0-bccf5c6340f9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2645cde4-8eba-4d03-9908-d7b4655976cc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2d25ef83-571c-43a9-b72f-88babfcabdc6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BetterthanBatman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV3IHH6YES6Z4IC5M7XCT6YYFUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIKK85W2630I3?ASIN=B078LJ6RPK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 20, 2018",
                "reviewTitle": "5.0 out of 5 stars GREAT MOUSE FOR FPS (OVERWATCH)",
                "reviewText": "I purchased the Rival 600 a few days ago, I've had it for a couple of days now and wow. I am using this mouse to play Overwatch, CSGO and Battle Field One -- My in game accuracy has in-fact improved, (from 45% hit average to 52%) is an understatement. The tracking is smooth and accurate and the lift off distance sensor works great for me because I don't have the desk space needed to play so I often have to lift my mouse to reposition.I specifically bought this mouse because I have been using the Razer Naga for years now for all my gaming needs. Lately, I've been really into OW and playing Widow and McCree often -- in most matches I did fine but when I faced other GOOD Widows I noticed I'd get beat to a shot by mere milliseconds and my ping is fairly low (30ms on average) and play on a 144hz monitor. I was beginning to think my reflexes just weren't good enough.. Then a friend of mine suggested I get a mouse for FPS games -- (like wth is the difference is what I thought) he teased me about using a MOBA mouse for FPS -- long story short I figured I'd give it a shot. I looked at a ton of reviews on gaming mice and the Rival 600 caught my attention, so I bought. It is worth every cent -- it just feels much more accurate. To be fair if you suck at FPS it won't make you good via magic but it can help you improve a bit if you know what you are doing already, that is MY OPINION.The only issues I've had with the mouse is that the lift off sensor is TOO sensitive. After calibrating the mouse to my pad, I simply set the liftoff sensor to the lowest lift distance possible -- and low behold there are dips and bumps on my pad that I hadn't even noticed before. When the sensor would hit these dips and bumps the mouse would stop responding. At first I thought the mouse was defective and was about to return it but after reading thru a few forum posts on this issue I simply increased the lift off distance a bit and the problem went way.***EDIT***This is the the third product every I buy from SteelSeries, the first product was a wired USB headset that sounded prettty decent, was cheap and broke within a few weeks. I tossed that and carried on. However, recently I found a review for their Artic PRO + DAC headset -- I was sold by the aluminum design (as my previous headset was plastic and broke really easily). Plus I am a bit of an audiophile, meaning I can appreciate good sound equipment (like I hate hate sound bars) and this headset is one of the first HIFI certified \"gaming\" headset. So I bought it.. and feel in love with it -- it was a bit pricey but I am enjoying it. And now the Rival 600 is my new favorite mouse for FPS (I still like the NAGA for FFXIV).SteelSeries is on a roll with me atm with their products, if only they made a competitor to the Razer Tartarus.. I'd buy that in a heart beat -- I recently purchased the Razer Tartarus v2 (I own two others) and it's so buggy and their software sucks -- problem is very few companies make these keypads and most of them are terrible. So SteelSeries make one.. please :P",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Markus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYGRGBJ4TDQM5IH7PHAN7UCMJJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39F4CAUQD7UU6?ASIN=B078LJ6RPK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars SteelSeries Rival 600",
                "reviewText": "Ive had two of these and they work perfectly everytime! The color changing options are awesome! You can change the color of different regions on the mouse which is cool. They also include little weights which i use to make my mouse feel a little more comfortable. The clickers sound and feel awesome and it feels very durable! I definitely recommend this mouse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPEGDPKJVFRJQNGDZQ6Y6HNXX7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R44LPJMGGHO5G?ASIN=B078LJ6RPK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2018",
                "reviewTitle": "5.0 out of 5 stars Rival 600 is the most fantastic mouse I have ever put my oversized hands on",
                "reviewText": "Rival 600 is the most fantastic mouse I have ever put my oversized hands on. It immediately felt great and it just molded to my hand so well. The sensors felt very snappy. And my aim is 10x more precise than with any corsair and razer mouse I've used. The rgb looks nice. The software wasn't difficult to navigate for me and hasn't seemed bloated or made computer sluggish. It's a near perfect mouse in every way and has immediately made me better at the games I love. The R+L clicks on the front are a separate piece of plastic from the body, meaning your fingers resting will be less likely to accidentally hold the buttons down. (had this problem with corsair glaive and m65.) scroll wheel is easiest scroll wheel click I've felt. The list just goes on. As long as the mouse lasts a long time, it's the best. Time will tell, but right now I'm gushing about it every day. Screaming my love for this mouse from the rooftops.ConsNo braided cable, it's rubber and it sticks. (the cable detaches and you can connect braided micro USB, I've done it.)Side buttons took a little getting used to over the corsair glaive.The finish feels slippery but has not proven to be a problem in game.",
                "reviewVotes": "89 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNF3XQQGBNODRVD4V2Z3JJUVHCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34ANE42BOMRBY?ASIN=B078LJ6RPK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Steel.",
                "reviewText": "I have had zero issues with any Steel Series product I’ve had, good tech and worth every penny.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WokJockey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7BBQ6KQA3KHCM56BX5KOERMEUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MR324ZQR08MZ?ASIN=B078LJ6RPK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2020",
                "reviewTitle": "4.0 out of 5 stars The Best Mouse(FOR ME) but rough start",
                "reviewText": "I got this mouse in a bundle for around $200 w/Arctis Pro Headset (no DAC) along w/Doom Eternal Certificate.TL;DR:Best mouse among all my other models for my natural palm grip.Best click feel EVER. (idc if \"Best\" is already implied)But the USB cable was DOA. (real reason for 4 stars) :CThis is compared to Corsair Harpoon RGB, Razer Mamba Wireless/Deathadder Elite v1, SteelSeries Rival 3, Logitech G402(Hyprion Fury), EQEOVGA D10Disclaimer:Everybody grips their mouse differently, and through their application and experiences they may prefer alternatives. (I've tried the Anker vertical mouse, not fit for my daily use)Also this is a review written after 2 weeks worth of use (avg. 3~5 hr. daily), not that long of usage/wear.History:I've started with Logitech G5, then the G502(old school 2005 ver.), but the biggest complaint was the weight and unnatural griping/design for me (couldn't get used to it for years) then I've tried the Razer series Deathadder Elite v1 & Mamba Wireless. (very similar but the both Razer's off-center \"ergo\" hump was not comfortable or natural for long periods. I thought that was the best the industry can offer. Until I decided to try other mouses. The Corsair Harpoon RGB was perfect for my palm but designed for claw grip therefore straining after awhile. Then I gave G402 Hyperion Fury a try (love the glide-ability (better mouse feet) and control(good weight!)) and palm gripping feels a bit better(strange, since G502 is a similar shape) but the left-click switch is more centered (more for claw/fingertip grip clicking). The SteelSeries Rival 3 was a great feel for my natural palm grip, but it is smaller and I find my bottom palm dragging on the mousepad. Then the EQEOVGA D10(Glorious O/D clone) was perfect in almost every way, except the mouse feet(kinda draggy) with the contrasting lightweight kinda throws me off a bit.Initial Review:The Rival 600 from the first several minutes was from joy to frustration, since the box-opening experience was wonderfully presented. But then realizing the included mouse Micro-USB cable was non-functional. (plugging in another was fine, but what if I don't have a repository of cables? speaking from other consumers standpoint)Also having to find a light but long enough Micro USB cable for a mouse was also frustrating.The 8 Zone RGB and Mouse management software (SteelEngine 3) is great. Pretty and simple.I don't bother with the weights, so I don't have an issue with the side-grip parts falling off(for now)Also they are magnetized so they should stay in place if not dropped/demagnetized.The dark meat of this review:When functional, the mouse feels natural and comfortable right away for my natural palm grip. Meaning, when immediately placed on mouse (unlike Logitech or Razer) I didn't need to adjust my grip at all.This mouse in its entirety is capable for me to naturally grip, hold, then manipulate without my rear palm to drag/touch the mouse pad. While able to keep contact with about 70% of my palm, which is very satisfying.All the while the soft-touch material is not noticeable at first, but whenever you liftoff, its assistance is more than appreciated.The click, oh my goodness the CLICK FEELS.Unlike any other mouses, the click is not your average, thin, crisp, light, or meek click.When you click, the feedback feels solid, but reverberates at a deeper click tone.It feels almost like a near-mushy but crisp tactility.There's no wiggle/flex(yet) of the primary mouse buttons, and the grooving on those feels natural/ergo.Bonus Facts:-The included cable actually feels heavier than the mouse!-I use a cable bungee so cable weight could be omitted.-Only 3 mouse feet/point of bottom contact. (interesting choice compared to other mouses, usually 4 or 5)-Only 2 DPI profile switching, strange since Rival 3 has up to 5.-SteelEngine 3 is pretty cool, easy, and simple compared to Razer's multi-program combo mess.-The Arctis Pro (no DAC) is perfect (minus haptic feedback or great sound) compared to Nari Ultimate.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OwOOwO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 14, 2020",
                "reviewTitle": "Rival 600",
                "reviewText": "Ya un año con el mouse, y puedo decir que no vale 2000 pesos, pero es un buen mouse, primero es solo para manos grandes o de agarre de palma, porque en manos chicas llega a ser estorboso, segundo el rgb que tiene es bueno y 100% customizable hasta en 8 zonasPero a lo que es el senzor y eso, es gracioso, cuenta con 2, uno que es uno normal, y otro que es de profundidad, por lo que puedes configurar si quieres que se siga moviendo el mouse despegado de tu pad, o apenas lo levantes ya no se muevaEste cuenta con unas gomitas a los lados, y con el tiempo estos se despegan y llegan a molestar mucho, es un error del propio mouse, por lo que, o quitan esas cosas, o cuidan esas cosas para que no se llenen sus manos de pegamentoCuenta con 7 botones reprogramables y cambiar las acciones de la rueda (arriba y abajo)En lo demás, si quieres un mouse RGB y relativamente bueno para jugar, este es buena compra, pero si te cuesta 1400 pesosEdit: Después de un año y 7 meses, ha empezado a fallar el click Izquierdo, tengo que decir que para el maltrato que le di al mouse duró mucho, pero se me hizo corto el tiempo de vida del mouse.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/512vZQdKRNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51sOcj0wcTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leroy L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 18, 2021",
                "reviewTitle": "Attention les petit bout en caoutchouc son facilement enlevable",
                "reviewText": "En ce qui concerne ma souris elle est vraiment très bien mais le service occasion d'Alzon laisse a désiréLa souris était volante dans la boîte le manuel en anglais (indiqué en français sur l'annonce) mais en tout cas la souris est vraiment bien n'hésitez pas à la prendre.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jun",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 18, 2019",
                "reviewTitle": "One of the Best Mouses in the Market",
                "reviewText": "There are a lot of things this mouse excels at, and very little that I could find in almost two years of use.The mouse includes variable weights, and I personally find having a single pod in the right compartment of the device provides the best balance for my use. The 600 is decently lightweight when none of the weights are in, but they do not feel cheap by any means.Moving onto performance, the SteelSeries Rival 600 packs one of the most top-notch sensors in the market; the TrueMove3+ Dual Optical Sensor with 12000 CPI is precise, accurate and is immune to failure.The ergonomics of the mouse is designed for a medium to large size hand, and it fits perfectly into your palms, so that you would never have to worry about tiring your wrists or fingers more than any other top-of-the-line mice.The scroll wheel is not too heavy nor too light on your index finger (or your middle, depending on how you use the mouse), so you can switch your weaponry in your favourite fps game with absolute precision.The LEDs are great looking, and is easily changeable thanks to the great software Steelseries provides. I personally prefer having them off, and that is achieved with great success as the Rival 600 has a memory unit that remembers the latest changes to the LED configuration.As with cons, I really couldn't come up with anything myself, but I've read that the rubber pads on the mouse have a hard time staying on in some units.Overall, I give the mouse a solid 10/10. You're not gonna find too many other mice that are objectively better than the Rival 600.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reidid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 15, 2020",
                "reviewTitle": "Buen raton, pero!!",
                "reviewText": "Buen ratón y cómodo, el pero es que las gomas de los lados se despegan con facilidad, lo bueno que te mandan unas nuevas en garantía, pero después te cuentan dinero.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sebastian K.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 2, 2019",
                "reviewTitle": "Schick designte Maus.",
                "reviewText": "Ich finde Sie obwohl für meine doch großen Hände etwas zu flach. Aber nach etwas eingewöhnung liegt sie doch gut in der Hand. Ergonisch gut sind die Tasten zu erreichen. Dank Software auch perfekt zu Programmieren. Alles in allem ein Top Nager fürs Gaming. Ob Amateurzocker oder Profi-Gamer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$33.99",
                "sellerName": "Perynt Global Inc.",
                "sellerRating": "5"
            },
            {
                "price": "$34.79",
                "sellerName": "Electronics Club",
                "sellerRating": "5"
            },
            {
                "price": "$53.96",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}