{
    "remaining_requests": 47313,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-Wireless-Computer-Mouse-Side/dp/B003NR57BY",
    "body": {
        "name": "Logitech M510 Wireless Computer Mouse – Comfortable Shape with USB Unifying Receiver, with Back/Forward Buttons and Side-to-Side Scrolling, Dark Gray",
        "price": [
            "9 options from$33.99"
        ],
        "originalPrice": "$39.99",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Logitech-Wireless-Computer-Mouse-Side/dp/B003NR57BY",
        "soldBy": {
            "sellerID": "A3DI1PQ3I3V3R1",
            "name": "Abe's Electronics Center",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3DI1PQ3I3V3R1&asin=B003NR57BY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLTWPZZZ"
        ],
        "asinVariationValues": [
            {
                "asin": "B006JRIDHK",
                "variationName": "Color",
                "variationValue": "Dark Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/4113j6oVY+L._SS36_.jpg"
            },
            {
                "asin": "B003NR57BY",
                "variationName": "Color",
                "variationValue": "Dark Gray",
                "price": "$24.29",
                "variationImageURL": "https://m.media-amazon.com/images/I/41m-I8XICyL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41m-I8XICyL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41CKxnC2DoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 66yIGKQL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71uOz9jLJoS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71024Lp948L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "Sold by Value Stock and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 38576,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 4 hrs 50 mins",
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35. Order within 4 hrs 5 mins",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Wednesday, February 14. Order within 4 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "Note: In case of wireless mouse, the USB receiver will be provided inside or along with the mouse",
            "Ergonomic shape: Ergonomically sculpted design and soft rubber grips conform to your right or left hand to be naturally comfortable and the compact size makes it easy to take with you wherever you use your computer at home, at work, or anywhere else",
            "Convenient controls: Back/forward buttons and side to side scrolling plus zoom let you do more, faster (requires free Logitech options software).Wireless technology: Advanced 2.4 GHz wireless connectivity (Unifying supported)",
            "Long battery life: You might forget this mouse runs on batteries with 2 years of power from 2 AA batteries",
            "Programmable controls: Configure the buttons to do exactly what you want like switching applications, opening browser windows or jump to full screen while watching videos",
            "Plug'n'play connection: Nano sized Logitech wireless unifying receiver stays in your computer plug it in, forget it, even add compatible wireless devices without multiple USB receivers USB connector is located underneath the item inside where the batteries are stored",
            "3-year limited hardware warranty"
        ],
        "description": "With its contoured shape, soft rubber grips and handy controls, the Logitech wireless Mouse M510 gives you more control, so you can do more with your mouse. Battery type - 2 AA batteries system requirements: Windows 10 Windows 8 Windows 7|Chrome OS|Linux Kernel 2.6+|USB port. Sensor Resolution - 1000.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Number of USB 2.0 Ports",
                "value": "‎1"
            },
            {
                "name": "Average Battery Life (in hours)",
                "value": "‎18 months"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Series",
                "value": "‎M510"
            },
            {
                "name": "Item model number",
                "value": "‎910-001822"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC, Linux, Mac"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 10"
            },
            {
                "name": "Item Weight",
                "value": "‎4.6 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎4.38 x 2.5 x 1.75 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎4.38 x 2.5 x 1.75 inches"
            },
            {
                "name": "Color",
                "value": "Dark Gray"
            },
            {
                "name": "Batteries",
                "value": "‎2 AAA batteries required. (included)"
            },
            {
                "name": "Manufacturer",
                "value": "‎Logitech"
            },
            {
                "name": "ASIN",
                "value": "‎B003NR57BY"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎June 7, 2010"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 38,576 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,388 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #39 in Computer Mice #382 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB, Radio Frequency"
            },
            {
                "name": "Special Feature",
                "value": "Wireless, Programmable Buttons, Power Saving Mode, Battery Life Indicator"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Laser"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Used To Care",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVSRDWIOZVNV6K57FJJT463PKDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33P1CUS92XRKP?ASIN=B003NR57BY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2012",
                "reviewTitle": "5.0 out of 5 stars Perhaps the Perfect Desktop Mouse",
                "reviewText": "Having wasted many dollars on Microsoft Bluetooth mice that needed to be re-paired every time I started the computer, I settled on this Logitech series of wireless mice that use a simple, tiny wireless receiver that ALWAYS works, regardless of computer.The first model I bought was the Logitech Wireless Anywhere Mouse MX . It's more designed for portability and I use it on my laptops because it stores the receiver in the mouse itself and has a large convenient on/off slide switch that covers the laser when not in use. It also has a little zipper pouch for safe protected transport. Its only downside is that it's a bit small for my hands. Good for portability, slightly small for hands.This M510 is larger, does not store the same tiny unified receiver, and does not have a zipper storage pouch. It's designed for permanent desktop use. It does have a small on/off switch on the bottom. When you first turn it on, a green LED lights on top, then goes out after a few seconds. There is no visible laser coming out the bottom. It runs on two included AA cells.The Logitech keyboard/mouse software allows a lot of customization. All the button functions are changeable via the Logitech software.One of the great features of both the Anywhere mouse and this M510 is the tilting wheel that allows for horizontal scrolling. Roll the wheel, it goes up and down. Tilt the wheel left or right and it scrolls left or right. Great for web windows that are larger than your screen magnification. I got so used to this feature on my laptop that I needed to get a new mouse for my desktops and the M510 fit the bill.If you press/click the wheel down, the software goes into autoscroll mode. Depending on the window, the autoscroll may go only up and down or in all four directions. Click again or click the left mouse button and you're back to normal.This M510 is definitely a \"righthanders\" mouse as the Forward/Back button are on the left side above the right thumb. It is just the right size and is very comfortable to use, gliding effortlessly on my mousepad, tracking reliably and never losing connection. Whatever RF or other wireless connection Logitech uses, it works great. The receiver is so small it's almost invisible. Little larger than the silver metal end of a USB plug. (By comparison the MS Bluetooth receiver was about 2\" long and it wasn't long before the thing was broken off in my laptop. Way too big, not to mention unreliable. And it wore out the USB socket to boot.)I was a bit concerned about the wireless receiver being recognized by my KVM switch that allows me to control two computers with one keyboard and mouse, but it's as reliable and seamless as my original corded Microsoft mouse.One of my complaints about the Microsoft mouse was that the back button on the side was so sensitive that I would inadvertently hit it moving from the keyboard to the mouse, sometimes dumping my input. This M510 has the buttons just right. They're small and you have to find them on purpose to activate them, but they're right where they need to be and have enough resistance that they don't get actuated accidentally.The mouse is very \"grippable\" and is very comfortable to use. My old Microsoft mouse was all plastic with no rubber, very slippery and hard to grip. And of course it was corded. It's amazing how \"freeing\" the lack of a cord is. The mouse is just \"there\" and not tangling on anything.Overall, a great mouse. Love it.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan Gonzalez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQPG7KRN3QDJUU32M7C475A53BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ7C4XW6B4RDX?ASIN=B003NR57BY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Works and Feels Great! Also good price",
                "reviewText": "I've never had an ergonomic mouse before, and I've had this for a few days now. The Logitech M510 feels great in my hand, not too big and not too small, plus the sides have indents to rest my fingers (hence the ergonomics I guess!). The mouse is decently heavy thanks to the 2 AA batteries, which is a plus for me at least. There's no lag as far as I can tell. The left click is very quiet and the right click is noticeably louder. The scroll wheel works good too, although in the beginning it felt a bit weird because I could feel the springs or something inside moving, but that went away. Lastly, I'm not much of a gamer - at least when it comes to FPS games can stuff like that - so I can only vouch for this working great for games like Stardew Valley and PvZ lol. Overall, great mouse for a great price! Hopefully it lasts long",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Truth B Told",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6PR6QXAWU4FQBRH2IACD2LUFKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MCGV6FHD8755?ASIN=B003NR57BY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2014",
                "reviewTitle": "5.0 out of 5 stars Solid mouse, great quality.",
                "reviewText": "I've tried to save a little money in the past by purchasing cheaper mouses that had good reviews but they die or become too frustrating to use after a few months due to shoddy craftsmanship and poor engineering. This mouse is a huge breath of fresh air.Some reviews have mentioned concerns about the weight of this mouse. Personally, I think it's great. You can use one battery or two so there is some control over weight which is nice. I love the feel of this thing. It's not so light that it feels like you can crumple it in your hand. It feels solid and is really a quality piece of equipment.Normally I cringe at power saving features since they can shut the mouse down after a period of time and require you to click it to activate it again sending you to pages/files on your computer that the cursor happened to be sitting on that you don't want to go to etc. In short, they're usually more of a hassle than their worth. Not the case with this mouse. It does shut itself down after some time but all you do is move it and it's going again. It doesn't have a noticeable delay, it just works exactly the way you want it to. That and it has a ridiculously long battery expectancy of 2 years. This was something that concerned me because I wondered if it would decrease the sensitivity and accuracy but it's all fantastic. No reason to be concerned at all.Finally, the back and forward buttons are crisp and work great. The mouse contours very well to my hand and feels comfortable. The up and down scrolling is smooth and accurate and the side to side scroll feature is just as good. A simple software download from their site allows you to customize functions to your liking.I registered the mouse and got an extra 6 months of warranty totaling 2 1/2 years. If you decide you don't like it, they have a 100% money back 30 day trial. Two good indications you're dealing with a good company and a quality product. It's really nice to be able to say there's nothing I don't like and I highly recommend this product to everyone.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JC.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "Work's great",
                "reviewText": "- I've had this for almost 4 years and it still works perfectly fine - so the quality and reliability is there- A bit heavy but very comfortable and durable (I've thrown it in my work bags before, and it's fine)- Bought it when it was $25 but would still repurchase at it's current price if needed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Kennedy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 4, 2023",
                "reviewTitle": "Excelente!",
                "reviewText": "La calidad superior de este producto es evidente en cada detalle: desde su diseño ergonómico, que minimiza la fatiga durante el uso prolongado, hasta su precisión y sensibilidad, que me permiten trabajar con rapidez y eficiencia. Además, su robusta construcción asegura que este mouse durará mucho tiempo, a pesar del uso intensivo. Personalmente, no puedo imaginar volver a un mouse de menor calidad después de experimentar el alto rendimiento del mouse Logitech. Lo recomiendo encarecidamente a cualquier persona que busque mejorar su interacción con la computadora.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nikolas S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 28, 2021",
                "reviewTitle": "Mouse de alta qualidade com preço justo",
                "reviewText": "O mouse tem um bom tamanho, sendo confortável na mão, é bem construído e tem boa duração de bateria (estou utilizando desde faz mais de 4 meses por pelo menos 8h por dia com a pilha que veio junto).A parte ótica não tem luz visível, então para ver se está ligado tem que olhar no botão ou, depois de não ficar parado alguns minutos, ele liga o led verde na parte superior.Os botões adicionais são muito úteis, mas para melhor uso é necessário buscar um programa externo para mapear esses botões (laterais e empurrar a roda do mouse para esquerda ou direita). A ergonomia dos botões é boa, com exceção do lateral de trás, que é o mais difícil de pressionar.Quanto a sensibilidade, poderia ser maior em alguns momentos e ter a possibilidade de ajuste, mas os 1000DPI são suficientes na maior parte do tempo.O custo X benefício é excelente, considerando que tem mais funções que a maior parte dos mouses sem fio na mesma faixa de preço, recomendo bastante principalmente para usar com notebook.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Thompson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 7, 2024",
                "reviewTitle": "Great Mouse!",
                "reviewText": "This is a great mouse if you do not want anything too fancy, but something that sits nicely in your hand and is not too fussy about what kind of surface you are using. If it needs replacing, I just get the same one again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on November 21, 2023",
                "reviewTitle": "muis uit Engeland",
                "reviewText": "deze muis is niet geleverd omdat de invoerrechten bijna de prijs verdubbelde",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$24.29",
                "sellerName": "Electronics Club",
                "sellerRating": "5"
            },
            {
                "price": "$24.29",
                "sellerName": "SaleTime Distributers",
                "sellerRating": "5"
            },
            {
                "price": "$24.29",
                "sellerName": "NetZero4U",
                "sellerRating": "4.5"
            }
        ]
    }
}