{
    "remaining_requests": 47026,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ergonomic-Precision-Vertical-Adjustable-Computer/dp/B074C5PQ8K",
    "body": {
        "name": "Wolf War Ergonomic Mouse High Precision Optical Vertical Mouse Adjustable DPI 800 / 1200 / 2400 / 3200 Wired Computer Mouse",
        "price": "$14.99$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ergonomic-Precision-Vertical-Adjustable-Computer/dp/B074C5PQ8K",
        "soldBy": {
            "sellerID": "A3PDMBRGMZ5X7E",
            "name": "yuanyuanjiang",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3PDMBRGMZ5X7E&asin=B074C5PQ8K&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "9",
        "stockDetail": "Only 9 left in stock - order soon.",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41s7ObeLkVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Zdmd1Sr6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/317 S768WNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ClC9m8qmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417WwIYstaL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Wolf War",
            "link": "https://www.amazon.com/Wolf-War/b/ref=bl_dp_s_web_121051139011?ie=UTF8&node=121051139011&field-lbr_brands_browse-bin=Wolf+War"
        },
        "brand": "Wolf War",
        "merchantInfo": "yuanyuanjiang",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 259,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 3 hrs 1 min",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 3 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Scientific ergonomic design encourages healthy neutral \"handshake\" wrist and arm positions for smoother movement and less overall strain.",
            "3200 DPI Resolution Optical Tracking Technology provides more sensitivity than standard optical mice for smooth and precise tracking on a wide range of surfaces.",
            "Added next/previous buttons provide convenience when webpage browsing; the superior choice for internet surfers, gamers and people who work at length at the computer.",
            "Package includes: 1 Vertical Ergonomic Optical Mouse (with 4.8 ft cable)",
            "4.8 ft USB cable length, product dimensions: 101 x 82 x 80 mm; product weight: 4.5 oz."
        ],
        "description": "The intersection of class, comfort and functionality. A mouse for the 21st century. Comfortable and classy. Tired of using the traditional grip Take a break from overly-clunky or uncomfortably tiny mice. The ergonomically-designed thumb rests and grips fit the contour of your palm for maximum comfort. Sleek and Sexy. Turn heads with a futuristic design. Made for increased functionality and comfort, this mouse combines a handshake grip with a easy-access buttons and three levels of mouse sensitivity for improved tracking. Easy-access use. Five buttons give you improved control over your computer's systems. Whether dragging and dropping, selecting large volumes of data, or casually gaming, this mouse provides a low-cost, effective solution for multiple computing needs. Compatibility: Windows 10 / 8 / 7 / Vista / XP / 2000 Linux Mac OS X (The two thumb buttons are not recognized on the Mac OS X.) Note: This mouse is not compatible with Mac OS X El Capitan.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Mice",
                "link": "https://www.amazon.com/Mice-Keyboards-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11036491"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.98 x 3.15 x 3.23 inches"
            },
            {
                "name": "Item Weight",
                "value": "4.5 ounces"
            },
            {
                "name": "ASIN",
                "value": "B074C5PQ8K"
            },
            {
                "name": "Item model number",
                "value": "8541645723"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 259 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,608 in Computer Mice"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 28, 2017"
            },
            {
                "name": "Manufacturer",
                "value": "Shenzhen City Ji Siyuan Technology Co., Ltd"
            },
            {
                "name": "Brand",
                "value": "Wolf War"
            },
            {
                "name": "Color",
                "value": "COLOR 1"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired, USB"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic Design"
            },
            {
                "name": "Movement Detection Technology",
                "value": "Optical"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bob MM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQVHBWC6XREOVEH2LJKBBRSX2IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RITGWT7QDHRO?ASIN=B074C5PQ8K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 15, 2019",
                "reviewTitle": "5.0 out of 5 stars Priced right, adjustable DPI on-the-fly, almost perfect ergonomics",
                "reviewText": "Like:1. Ease to use, I have a larger hand and the grip is almost perfect for me, but not quite perfect.2. Adjustable DPI helps for a person like me with multiple-monitors and task-switching heavily3. Price is on point - worth $10-20 easily. Got mine at $14.994. It's pretty comfortable to use once you get used to it.Dislike:1. Not great for gaming (for me) without extended repetitive use/practice. Movement and response is not perfect but precise enough; however for anyone interested in competitive gaming likely wouldn't purchase this product. For those who enjoy competitive gaming without the leagues and such, would likely be a perfect replacement for a normal style mouse after some time using .2. I frequently use the scroll button for it's general access in opening/closing tabs in web browsers and unfortunately it is awkwardly placed for my sized hand and/or I'm just not used to where it is placed in comparison to a general style mouse. FWIW. :/",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darline Davila",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDWMHFBF4HDO424V7JNJIXZQIAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PKO3WJVL8T69?ASIN=B074C5PQ8K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2018",
                "reviewTitle": "4.0 out of 5 stars Feels great, works great but use it gently",
                "reviewText": "This mouse has a great feel to the hand and it feels natural when you use it. The texture of the device is soft to the touch and the position of the hand helps a lot specially when you have to spend 8 hours working on your computer. As advertised it helps to avoid that your hand and wrist feel any stress or pain for using the mouse for long periods of time. The DPI option helps a lot if you need to be more accurate and detailed or if you need that it moves the cursor as fast as you want. The changing color feature is mostly for a visual element that has no impact in the function of this mouse but it looks really awesome. This mouse also has go back/go forward buttons on the side to navigate on your internet browser or folders. The only thing bad was that the scroll broke after 2 months of use and it was heart breaking as I use the scroll option a lot in my work.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J&L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFOZ2FOXAQDDVF5ZB6FSNSYF2AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ55FSWCXM8A9?ASIN=B074C5PQ8K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 19, 2019",
                "reviewTitle": "5.0 out of 5 stars Great price per performance.",
                "reviewText": "If you are interested in trying out an ergonomic mouse, just as I was, then this is definitely the item to look for. This is cheap, sturdy, and surprisingly functional. I was not expecting something so cheap to also be as effective as it is. However, if you want something with all the bells and whistles you would expect from a \"Logitech\" device you will be severely disappointed. Think of this as just the prototype for what you might be contemplating buying in the near future. This is the perfect throw away device (donate, give away, or w/e you want). You should be using this to see if the ergonomic option is to your liking or not, that is it. Or, obviously, you just want something that is cheap and does the job.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE35UPSV44YQOVRK6D4YARF46XBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FXU26NP74OL3?ASIN=B074C5PQ8K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2020",
                "reviewTitle": "5.0 out of 5 stars Directly responsible for reducing my wrist pain.",
                "reviewText": "I really like this mouse. I've been working with mice since MS Windows 3.1 and the old standard mouse position I believe has aggravated my right wrist to the point where now, working all day with a standard mouse, in just a few hours my thumb, index and middle fingers go numb. Not so with this mouse.It's set up so that your hand is sorta positioned like you're starting to reach out in a relaxed manner to shake someone's hand. This posture alone has been the relief of my wrist pain. Plus how the buttons and scroll wheel are positioned are well engineered. I like the forward and back buttons on the thumb side too.I have only used this mouse for 3 days and am already benefiting from the design of the mouse. I can use it all day long and not one time, experience numbing of any part of my hand and no pain in my wrist, which used to be very bad at the end of the day.I cannot vouch for the mouse's reliability for I simply haven't used it long enough. So far so good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marq",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWG5YFLGWVFEKODJ6QB2FJIIPTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L2E2G2RSZPBB?ASIN=B074C5PQ8K",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2023",
                "reviewTitle": "3.0 out of 5 stars Squeaky mouse",
                "reviewText": "it does not have color picking option and the scroll wheel makes a lot of noiseit is my first Ergonomic mouse so it takes a little getting used to so I plan to use this one and upgrade in a month or so it's good for an introduction into this kind of mouse set up.I give it a 6/10only docking points for the lack of static color and how squeaky the scroll wheel is and tbh I might have to look into fixes for it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6Q4RHCIGRBM5QWQMLSPUC6LOQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AI846H9QHQC0?ASIN=B074C5PQ8K",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2019",
                "reviewTitle": "2.0 out of 5 stars Not sure if Helping or Hurting; Broke",
                "reviewText": "Ordered this looking for a mouse I could use to prevent cramping and relieve a little hand stress since I work at an office and also use my computer a lot at home for gaming. Tried gaming with it, but it's not got the same hand precision without practice, so I took it to the office in hopes that it would at least mix up my wrist position and relieve any stress on my hand.It worked for a month or so, but I couldn't help but feel like it actually made my hand more crampy. It is a little too smooth like some reviewers have said and the click from the new angle makes it difficult sometimes, so without practice, your finger will find itself not clicking with enough strength (compared to what you're used to).You know that feeling when you shake someone's limp hand? I feel like this shape makes your hand that dead, limp hand form. You're not quite grabbing anything and you never truly feel in control of this mouse. I also found myself massaging my mouse hand after using this mouse, probably more than I ever did with a normal mouse. Something about the limp hand grip seems to ADD rather than reduce tension in my hand.If it were a little wider or something, I can't say for sure. At times I did feel like it was a refreshing new grip, but overall I have decided it's worse or at least not any better.Found myself many times \"tripping\" over the mouse with my arm when reaching around my desk or keyboard since it is much taller than normal.The mouse wheel has also seemingly broke, incredibly, with minimal use. I only use it at the office and scroll occasionally for sheets and pages and I treat my equipment nicely. It is now \"caved in\" to one side and does not register rolls anymore, jiggling around loosely. I don't think I could fix it myself without compromising the mouse itself since it has no real removable layers.It looks cool, has a light, but those are really irrelevant for what I was looking for. Disappointed.Would not recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCQFL3A5CWIAZS346C74GWHABIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4H9YIZUVQC35?ASIN=B074C5PQ8K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Wrist pain already relieved",
                "reviewText": "Its taken a little getting used to (I've been using this mouse for one week) but I can already tell a difference in my wrist pain. I struggle with carpal tunnel & arthritis, & this mouse is so helpful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "Quiet comfortable mouse that is better on my wrist",
                "reviewText": "The first mouse like this I bought stayed red even though it showed blue in the sales picture. This one allows a number of different colours to light up. I have not looked at how to choose a static colour. Great braided cable. I bought this as a backup but it quickly became my main mouse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lizbeth Maritza Perez Nuñez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 18, 2019",
                "reviewTitle": "Tendrá Garantia?",
                "reviewText": "Hace 4 meses compre este artículo y se le descompuso el scroll de repente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mumu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 30, 2020",
                "reviewTitle": "Très bien, bon ergonomie",
                "reviewText": "Souris très ergonomique. J'en ai testé une avant et je trouve que celle-ci s'adapte beaucoup mieux à la main.Petit bémol sur la faible épaisseur des patins, mais sur un tapis de souris, c'est nickel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2021",
                "reviewTitle": "Falls terribly short on expectations, don't buy!",
                "reviewText": "Substandard product and awful customer service. Don't buy this product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}