{
    "remaining_requests": 1573,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hydrogen-Sonata-Culture-Novel-Book-ebook/dp/B0081BU42O",
    "body": {
        "name": "The Hydrogen Sonata (A Culture Novel Book 9)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hydrogen-Sonata-Culture-Novel-Book-ebook/dp/B0081BU42O",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81DZVfEYjiL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Iain M. Banks",
            "link": "https://www.amazon.com/Iain-M-Banks/e/B000APXAVG/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5294,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0081BU42O"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Orbit; 1st edition (October 9, 2012)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 9, 2012"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1921 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 518 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0316212377"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#56,362 in Kindle Store (See Top 100 in Kindle Store) #226 in Hard Science Fiction (Kindle Store) #439 in Hard Science Fiction (Books) #622 in Space Opera Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 5,294 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Filippo A. Salustri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG742FLL7QJM2R35F6FIVD7J5VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C5JG474ICVZJ?ASIN=B0081BU42O",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2014",
                "reviewTitle": "5.0 out of 5 stars Awesome but bittersweet",
                "reviewText": "The Hydrogen Sonata is one of the last novels of Iain M. Banks before his death last June. It's also the last \"Culture novel,\" one of a series of essentially disconnected novels about a galactic, post-scarcity civilization called \"The Culture,\" and the various other civilizations with which it shares the galaxy.I loved this book.While some people complain that Banks's Culture novels are all basically the same, I find every one of them to be distinctive and highly unique. And while some themes may recur in multiple novels, each novel is clearly its own story, each examining those themes from different directions. They're all wrought with outrageous yet exquisitely detailed events and spectacles, by turns lovely and gory. Banks also paints different cultures beautifully; different enough to be startlingly alien, yet all with some tiny bit of familiarity to them that draws the reader in.For instance, in this novel, there is what might be best described as a space station that orbits a planet, but inside a kilometres-wide trough sliced round the planet's girth - the station actually orbits the planet below ground level. I've been reading SF close to 50 years now, and I ain't ever read anything like that before!The plots are also ridiculously complex and worked out in stunning detail. In this case, the plot revolves around the impending Subliming of the Gzilt, one of the non-Culture civilizations of the galaxy. Old enough to have been around when the Culture was first created, the Gzilt have reached a point in their development that they're ready to evolve - every one of them all at once - beyond the physical. This ultimate step of evolution, Subliming, has been mentioned in many of Banks's previous Culture novels, but never dealt with head on. Till now.The Gzilt have a holy book, and a weird one at that. It's a book that seems to fully outline all their major achievements with surprising accuracy. But there is a distinct possibility that there is a perfectly natural explanation for the book's existence, and that explanation might, if widely known, cause all manner of ugliness. The Culture, and especially the virtually omnipotent AI \"Minds\" that inhabit giant spaceships, regarding the Gzilt as one of its progenitors, feels some obligation to try to make sure things run smoothly during their Subliming.And so begins the intrigue.It's not possible to give a short description of the varied characters and roller-coaster plot that are involved in this story, so I won't even try. I will give this one, entirely inadequate, example, though, just to whet your appetite. A man some 10,000 years old - apparently the oldest man alive in the galaxy by orders of magnitude, knows the truth about the Gzilt holy book. He had those memories put into extra memory enhancements in his eyes, then eventually had those eyes removed and replaced with an extra set of ears. He gave his eyes, containing the memories of the secret of the Gzilt, to another person who wore them on a necklace - and who has 53 penises.Betcha didn't see that coming.What I found particular about the Hydrogen Sonata was that it dealt quite directly with Subliming - and it was written just before Banks died. It is even possible that he knew he was ill as he wrote it. I wonder if he wrote it thinking of the notion of death and the possibility of after-life. While Banks was atheist, it does seem reasonable that his thoughts might turn to the finality of death, given the circumstances.Even if he didn't think that way while writing The Hydrogen Sonata, I certainly read it that way. It was quite bittersweet, reading the novel as I did, knowing it was the last Culture novel I'd ever read, and I couldn't help but see it as a kind of manifesto by Banks about his thoughts on existence and death. In the Culture, you can live forever, transferring from one body to another, keeping one body for centuries and another for only hours, having your mind Stored for awakening and re-embodiment under conditions you specify before being Stored, and where the body you assume can be pretty much whatever shape and size you want it to be.And then there's Subliming. A completely mysterious state of existence, all but certainly real, only not in any sense we could appreciate. Nestled somewhere in the onion skin of multiple dimensions and universes that comprise hyperspace in Banks's world, there is another existence to which whole civilizations can gain entry, assisted by Presences (whatever they are - it's never made clear) or by an appropriately powerful AI. Sometimes, entities return to \"The Real\" from \"The Sublimed\" - like ghosts or angels - but are unable to describe in Real terms what being Sublimed is like.If this is anywhere near a reasonable reading of The Hydrogen Sonata, then its ending is surprisingly appropriate. And that is all I'm going to say about that.Needless to say, if you like Banks's Culture novels, then you should love The Hydrogen Sonata.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vadrian Seven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3OLPY5LXKTLYMITKKLCZHWD22Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TXKBIG26YS3S?ASIN=B0081BU42O",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2012",
                "reviewTitle": "4.0 out of 5 stars The Elevenstring Enfolding",
                "reviewText": "Let me begin by saying that I do Love the Culture novels.And I love Iain Banks for bringing them to us.It's a universe/a concept that I truly long for.Actually, The Algebraist was the first novel I ever read by Banks.After that, I fell right into The Culture universewith additional Transitions into Feersum Dark Background Endjinns.Anyway, I've never written a reviewbut I will try to do something here that isn't too confusing or boring.There will be Spoilers though-so if you have not read The Hydrogen Sonata--do not continue reading this.I would also recommend that if you have never read a Culture novelthat you start with Consider Phlebas and read the rest in the order they were published.It will be worth it. And help you gain inferred alien cachet value(positive)(honorary).Actually, I started with The State of the Art--not that I knew what I was doing back then.It was just on the shelf next to The Algebraist.So, I finished reading The Hydrogen Sonata last night and I was pretty pleased with it all.However, there were some loose ends that kind of bugged me a bit.I thought about some other Culture novels and maybe that is something Iain does on purpose.Open-ended is the term I believe.In prior novels, Gurgeh, Anaplian and Ledeje all go on wild rides that seem to sort of abruptly end as well.Maybe it's just me. You sort of have to draw your own sort of parallel epilogue--at the risk of being \"incorrect.\"And at the risk of sounding contradictory, I am not a reader/viewer who needs every little last thingspelled out for me. I do like to use my own imagination.However:1. I kind of wanted the Liseiden punched in their eel mouths--hard enough to break teeth.I do get how/why the Minds \"let them go\" with the understanding that the Culture'slong term disapproval would be way more damaging.But still, they got away with unprovoked aggression and murder and that really bothered me.Maybe I'm not recalling correctly, but I also feel like someone should have definitely included the Beats Workingin on all of the developments-as it was the ship actually escorting the Ronte fleet toward this mess.It sort of made for a sad side-plot in the end.Melancholia Enshrines All Triumph is a most splendid name--and the name of my next cat--but it was unfortunate that it also seemed to be their epitaph.With that being said, I was a little surprised the Beats Working was destroyed. Really??I mean, it seemed like child's play for it to haul along a whole dancing fleet of Ronte ships and it seemed child's play how it just disabled the Leseiden ships--not even actually being head on aggressive yet. So I found that suspicious that one missile killed it. I rather thought the Beats Working was going to turn up again. But I guess that last missile from the platform must have been seriously heavy duty.2. Jewilin of the Iwenick seemed a little suspect to me.I couldn't put my finger on it but he seemed on the sly/smug side of things.I thought there would be more with him/them but I guess not.I was a little curious how the Iwenick and Leseiden hooked up--or if it was done for them.3. General Reikl and the 14th getting just wiped out like that was tragic.I kind of thought that she was transmitting herself at the end as the shuttle fell into the sunbut we never hear from her again either. I would like to imagine that maybe she did transmitsome permanent FU signal to the 8*Churkun--something that blew it up later--or something.I'm still not fully clear why they blew up the Z-R ship right then.I mean it was like someone already knew ahead of time-and met the Z-R ship there to make sure they did not actually reach Zyse.As if the 8*Churkun was temporarily possessed.4. Fzan-Juym and Eshri seemed liked a kick ass base though.Sadly, further bizarre Reikl and Cossont interactions were not in the cards.I would have love to have seen a face off/fist fight between Reikl and Chekwri.5. Parinherm was here then gone as well. I just knew he was going to have a showdown with Urthuane but that didn't happen. Then I was like, \"Ooh, he's gonna be recharged, show up again and Show OUTwhen they go back to the airship--but nope--that didn't happen either.I was pretty disappointed he just ended up at the bottom of an elevator shaft.Not In Sim.6. Banstegeyn, Chewkri and Agansu got off scott free too. They didn't deserve to Sublime not after all the innocent deaths they caused.7. Why even have anything with the Zoologist? I mean it was cool to have someone aboard who had Sublimed and then returned. But I was thinking he was going to actually contribute something to the story beyond that.He too--just disappeared. I'm sure me and the Caconym weren't the only ones who were disappointed.Or maybe the Zoologist was some of secret secret agent? For who?Him abandoning ship the same time the Gzilt sublimed was a little curious.8. Ximenyr?Despite all the that I still really enjoyed the novel.And I believe this Culture novel was more a Ship/Minds novel.I like ship action.And I really like homoerotic ship action.The Mistake Not...is a Badass.The Girdlecity was just mind-boggling.It had to bigger than even I was imagining because just the Equatorial 353 had to be enormous--not even counting the ginormous tunnel it had to be traveling in.And I loved/envied Vyr walking around the empty expanse of the Girdlecity--the wind--the twilight--the vastness.I also grudgingly came to be ok with the fact that Vyr was not a soldier.I was like, \"Oh, she's got four arms?! It's about to be ON! But no.And I was cool with that ultimately.She was just a citizen who because of a rare interest in a rare piece of musicand a chance/not so chance encounter with a mysterious manwas thrown into an upside down water tank of cerise fire.It could happen to any of us.Pyan was pretty funny.A lot of sassy dramatics for a scarf.I like the concept of being immersed in sound too.Though I'm not sure if I fully like idea of Subliming.They say it pretty much heaven but, still, it seems way too unknown--and maybe I'm just a little too protective of my personality/identity.And I may be missing the point of it all: The Ultimate Letting Go.Even though I wanted like three or four characters to show back up.I imagine Vyr went/Sublimed eventually--after seeing QiRia one last time.Soooo--I've rambled enough.Sorry this wasn't much of a review.Maybe someone will get something out of it.Vadrianp.s.Someone has probably already mentioned this:The Gzilt could be a reference to the theory many have about us Earthlings.That we are (simply) an experiment---seeded/created by another (superior) race.Superior Race Engineers:\"Oh check it out, this planet looks like a good place to work on our project.Now let's see what happens when we do this...and that.\"",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jackie ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 27, 2024",
                "reviewTitle": "Book arrived ok.",
                "reviewText": "Probably my favourite Banks novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Rhoades",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 8, 2018",
                "reviewTitle": "Fantastic final book!",
                "reviewText": "I am devastated there will be no more Culture novels - I have been fretting over even starting this last novel. Such great ideas, rich stories, wonderful use of the English language . . maybe a future Mind can continue the incredible journey . . Multi-dimensional thanks Iain.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandeep Rao",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 4, 2015",
                "reviewTitle": "Five Stars",
                "reviewText": "Iain Banks is awesome. Enough said.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James N. Von Riesen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 13, 2013",
                "reviewTitle": "Banks going out with a highly existential Bang",
                "reviewText": "Fans of the Culture series will not be disappointed. This offering is full of the rich characters (including and perhaps especially the ship minds) moral & ethical quandaries, and a multitude of connected stories presented in such a manner as to feel complete and cohesive. Humor, bitterness, and real, valid philosophical pondering addressed from a perspective we've come to expect from Banks: sarcastic, satirical, face-slappingly direct and based on a deep understanding of \"human\" nature.Even before reading Banks' tragic letter of impending sublimation (I was about 2/3 through the book when he posted his death notice), I had that the feeling that the author was at a stage in his life pondering advanced age and the possibilities of endings. in \"The Outsider\" Camus ponders the meaning of a life after death without memory of the life before death. Banks address similar weighty concerns from various characters and perspectives.Fun, thought-provoking and very appetite-whetting.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gdarmois",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 9, 2014",
                "reviewTitle": "Le dernier volume du cycle de la Culture",
                "reviewText": "Pour ceux qui aiment et connaissent la Culture, ce dernier roman, dernier comme plus récent, mais aussi comme ultime puisque Iain M. Banks est mort, On y retrouve les vaisseaux AI aux noms interminables et quelques mortels de différentes races dans une intrigue bien construite et intelligemment développée.Pour ceux qui ne connaissent pas encore I.M. Banks, ce n'est pas le plus facile d'accès car le lecteur est (implicitement) supposé connaitre la culture de la Culture, mais si vous aimez celui-ci, vous aurez l'immense, et souvent rare, joie d'avoir une dizaine de romans d'Iain M. Banks à savourer.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}