{
    "remaining_requests": 1480,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Three-Body-Problem-Cixin-Liu/dp/0765382032",
    "body": {
        "name": "The Three-Body Problem",
        "price": "$10.59$10.59",
        "originalPrice": "",
        "rawPrice": 10.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Three-Body-Problem-Cixin-Liu/dp/0765382032",
        "soldBy": {
            "sellerID": "A2O5JQZ7GEIAX7",
            "name": "New Legacy Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2O5JQZ7GEIAX7"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51hshl7LRTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31HORDPHhuL.jpg",
            "https://m.media-amazon.com/images/I/51VOliRqizL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Cixin Liu",
            "link": "https://www.amazon.com/Cixin-Liu/e/B007JP96JU/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "New Legacy Books",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 41932,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 58 mins",
            "$3.99 delivery February 27 - 28.",
            "Or fastest delivery February 22 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16272"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0765382032"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Tor Books (January 12, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780765382030"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0765382030"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.15 x 1.1 x 9.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#804 in Books (See Top 100 in Books) #6 in Alien Invasion Science Fiction #13 in First Contact Science Fiction (Books) #18 in Hard Science Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 41,932 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LA in Dallas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4AGB3JJOROF4KGTO62ONBLTS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KQNI0Q15VTBX?ASIN=0765382032",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars This is one for the neophiles!",
                "reviewText": "** spoiler alert **This will be a review of all three books of Liu Cixin's Remembrance of Earth's Past, as translated into English by Ken Liu. HUGE spoilers for the entire series follow. You have been warned. Proceed at your own risk.I bought The Three-Body Problem from Amazon 20-Aug-2015 -- I bought the next two books, The Dark Forest and Death's End on 10-Apr-2017. I think that means that The Three-Body Problem sat on my kindle for two years before I got around to reading it, and that in 2017 when I did I immediately moved on to the two remaining books.The Three-Body Problem felt familiar, then the opposite of that. It was Golden Age Science Fiction. Now, \"Golden Age\" is a term of art in science fiction. It refers to that époque (early twentieth century) when science fiction was dominated by the pulp magazines, which were dominated by John W. Campbell Jr.. This was when every serious student of literature dismissed science fiction as trash. And, to be honest, they were mostly right. It would be flattery to call the characters two-dimensional. Women were there mostly to serve as rewards for the heroes, who were almost all men -- often (totally unrealistic) scientists. Plots were cookie-cutter. There were no real aliens -- the so-called aliens were all cosmetically modified humans. And humans always defeated the aliens -- this was a particular hang-up of Campbell's -- Earth always had to win.I am quite certain that Liu has read a lot of Golden Age science fiction. To one like me who has read embarrassing amounts of Golden Age SF, it was like slipping on a pair of comfortable old shoes. We have the one-dimensional scientist characters. (But, credit where due -- there are both men and women.) Now, the good news for me was that the story takes place in China during the Cultural Revolution. I have read a lot about the Cultural Revolution, mostly nonfiction. But this was the first novel I had ever read in that setting, and I learned a lot.And then Liu took it to new places. We have aliens who are *really* alien. Liu's universe is irreducibly hostile and more dangerous than a Mongol invasion. Aliens build extraordinarily dangerous weapons that destroy your solar system by folding space. I loved Liu's scientific imagination -- protons that contain artificial intelligences! (Is this possible according to our current physics? OF COURSE not. Duh. You have to imagine that lurking in the corners of fundamental physics that haven't yet been worked out -- that would be quantum gravity, mainly -- are some extraordinary engineering opportunities. Do I believe that this is probable? Absolutely not! But have you read science fiction? Liu comes much closer to making sense than most SF authors do.)And then we have Liu's vision of the universe. If the aliens find out you exist, they will unexist you as quickly as they can, because they know that if they don't do unto you, you may eventually do unto them. They know this by experience -- only the biggest, baddest civilizations survive. I thought as I neared the end of Death's End that some humans were going to escape. But no. The aliens know what they're doing. Death's End ends with all Earth-derived life eliminated.You may be wondering, from this description, why I give the series that five-star rating? I have said almost nothing in praise of the books. But here's the thing -- they're DIFFERENT, hugely different from anything I had read before and after. To a neophile like me, it was catnip.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Baker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVZNRFNWCU3NZRNREI2XL2QNS5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18BWC4BFJF8DI?ASIN=0765382032",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Good, but with all the hype, I expected better",
                "reviewText": "I've heard a lot of people hyping this up. This was supposed to be the new greatest thing to happen to the sci-fi genre, and it was good, but I wouldn't say it was great.Honestly, I enjoyed the parts about China's cultural revolution more than the main plot. The Three Body segments were all interesting (in an absolutely bizarre sort of way), but otherwise, Wang's journey of discovering the truth was the least intriguing aspect.Also, if you're not into HARD sci-fi, then this ain't the book for you. There are large portions of the story dedicated to first explaining the basics of computer programming and later the theoretical idea of unfolding quantum space.If nerding out to stuff like that is your jam, then dig in and enjoy.Translation was good.I'm stoked to watch the show and get a visual for some of these way out there concepts.And I'm hopeful that there's more alien stuff in the next books.4/5",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melynda Wangsness",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMCHBCMPNMBFLABUZF6IV6V3XTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKI0H23TJI7OW?ASIN=0765382032",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars “Most people would have difficulty explaining how they know two and two make four.”",
                "reviewText": "A wonderful blend of history and hard sci-fi, with the inclusion of many science disciplines.This translation was wonderfully done, in a way that appeared to keep the tone and content of the original story.While there were two parts in this book that felt slower to me, continuing through these were well worth it! I believe that some of this came from having a preconceived notion of what to expect, so I highly recommend going into this book blind. There were a few twists I couldn’t have imagined coming that kept me on my toes while soaking in the science heavy aspects.I will definitely be picking up the next two books to continue on the journey of the Three Body Problem!“The search for extraterrestrial intelligence is a unique discipline. It has a profound influence on the researcher’s perspective on life.”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iwona",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 26, 2024",
                "reviewTitle": "It’s an unique, hauntingly beautiful book.",
                "reviewText": "It’s an amazing book, difficult to describe though. To really appreciate the book a reader has to commit an undivided attention to it. It feels like immersing into a slow moving powerful river with all the tributary joining it and giving us more clues.We finally see the big picture and it’s awesome and terrifying at the same time- because it really can happen!I’m in awe of the author imagination and erudition. I also admire a fantastic job of the translator- Ken Liu ( any relation to the author?). I think the quality of his translation contributes to the book success.I’m moving now to start reading the part two of the trilogy. Can’t wait!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fernando Gamiñio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 16, 2023",
                "reviewTitle": "INCREIBLE",
                "reviewText": "Es una novela alucinante y compleja",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joao",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 3, 2022",
                "reviewTitle": "Really good, new. Novel as anything else.",
                "reviewText": "Uma estória surpreendente, única e rica, uma ótima surpresa.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suhaibe K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 11, 2024",
                "reviewTitle": "If you like sci-fi, you wont regret.",
                "reviewText": "An amazing book. Just go for it if you like sci-fi, Better parts are yet to come.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen W.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 27, 2023",
                "reviewTitle": "The first book of a truly amazing trilogy",
                "reviewText": "Cixin Liu, if there is any chance that you see this review, I want to say a huge thank you. I absolutely loved The Three Body Problem and its two sequels. This trilogy of books has had a profound impact on me and I will remember them until the day I die. This first book alone makes all of Hollywoods sci-fi movies which feature alien invasion completly bland in comparison. The challenges facing the aliens and humans and what they did to either overcome them or try to overcome them were super interesting and very clever. The first book explores sci-fi ideas (virtual reality, artificial intelligence, advanced cutting materials, dimension folding and so much more) in ways that drive the story forward and open doors for further exploration and discovery. I really like the fact that the author has a background in engineering and that he leverages this to add a touch of realism to his sci-fi concepts, all of which are really imaginative. The horror elements of this book are done amazingly and in such a unique way as well. I could write at length so much more but I don't want to give any spoilers.I actually finished reading this book about 6 months ago and forgot to write a review for it! After I finished this book, I immediately bought the second book in the trilogy 'The Dark Forrest' and immediately after that 'Deaths End'.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.23",
                "sellerName": "readhearnow",
                "sellerRating": "4.5"
            }
        ]
    }
}