{
    "remaining_requests": 1666,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/We-Yevgeny-Zamyatin-ebook/dp/B08GKJ2VGF",
    "body": {
        "name": "We",
        "price": "$0.45",
        "originalPrice": "",
        "rawPrice": 0.45,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/We-Yevgeny-Zamyatin-ebook/dp/B08GKJ2VGF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81uxYSSCNQL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Yevgeny Zamyatin",
            "link": "https://www.amazon.com/Yevgeny-Zamyatin/e/B000AQ1TZY/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 4545,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The exhilarating dystopian novel that inspired George Orwell's 1984 and a precursor to the work of Philip K. Dick and Stanislaw Lem and foreshadowed the worst excesses of Soviet Russia. The novel describes a world of harmony and conformity within a united totalitarian state. This story of the thirtieth century is set in the One State, a society where all live for the collective good and individual freedom does not exist. The novel takes the form of the diary of state mathematician D-503, who, to his shock, experiences the most disruptive emotion imaginable: love for another human being. We is the classic dystopian novel and was the forerunner of works such as George Orwell's 1984 and Aldous Huxley's Brave New World. It was suppressed for many years in Russia and remains a resounding cry for individual freedom, yet is also a powerful, exciting and vivid work of science fiction.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08GKJ2VGF"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Sanage Publishing House; 1st edition (August 22, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ August 22, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3887 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 214 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B08VBH5MH4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#54,758 in Kindle Store (See Top 100 in Kindle Store) #615 in Dystopian Science Fiction (Kindle Store) #648 in Dystopian Fiction (Books) #22,612 in Literature & Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 4,545 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUTAO4V5FFUB36URHXOMZCH6VFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R245VREWSSSQFF?ASIN=B08GKJ2VGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars The source code for dystopia",
                "reviewText": "I see how this novel would influence what came after it. And no happy ending either! Keeping it bleak.after all these years. Well done!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Diamond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWR4WHMIQXZW7TYWUL5SUGGDRBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P3C1UYYJTPJR?ASIN=B08GKJ2VGF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2017",
                "reviewTitle": "4.0 out of 5 stars There is no I",
                "reviewText": "The narrator of We, D-503, is a mathematician and engineer, the primary designer of a rocket called the INTEGRAL. D-503 is a citizen of the totalitarian OneState, in which the Benefactor presides over a society of perfect reason. People are \"Numbers.\" There is no I anywhere in the society, no concept of an individual. Each Number is simply a component of the larger We.Everyone's daily lives are governed by the Table, which tells them when to get up, when to eat, when to work, when to have sex, how many times to chew each mouthful of food, etc. When the Numbers go out for their walk at the same hour each day, they all walk in lockstep. Every movement at work is governed by the efficiency rules of Frederick Taylor, the mechanical engineer who wrote about efficiency of movement in the workplace.OneState broke separated itself from the rest of the world after the 200-years war. The state itself is a huge city of glass, which the inhabitants are taught to praise for its clarity and transparency. The city is protected from the rest of the world by The Green Wall (which is also made of glass). Beyond the wall are trees and animals and other hideous, disorganized things that have no reason or logic.The Benefactor teaches that happiness comes from the absence of desire, which is irrational, and the path to absence of desire is a strict adherence to logic and reason in all aspects of life.There is no marriage or family on OneState. If a person wants to have sex with another person, they put in an application at the Health Ministry, and if their application is approved, they get a book of pink tickets which they can redeem with their chosen parter at scheduled times.When the book begins, D-503 is at work writing a sort of ode to OneState, which he will put into the INTEGRAL, to be sent off to other planets, to teach the savage inhabitants the greatness of rational civilization. D-503, like everyone else in OneState, believes it is the state's duty to export its system of happiness to all other rational creatures.The problem arises when D-503 is assigned a new sexual partner, I-330, a subversive free-thinker who embraces instinct, desire, the unknown and unknowable. These are all the things OneState has taught its citizens to reject, and things which D-503, being a mathematician, tends to reject by nature. Early on, he describes the encroachment of feeling into his thought process as being like an irrational number that has crept into an equation and can't be factored out.He becomes obsessed with I-330, because she can access feelings in him that he cannot access himself. His impulse toward the irrational becomes overpowering and almost obsessive. Needless to say, this causes a lot of problems in a society that was designed not just to repress, but the deny and invalidate desire, irrationality, the \"I\", and by extension, imagination and creativity.The book maintains a strong and consistent set of symbols and imagery (the hard, transparent glass, the masses of figures in lock step, the looming accumulator tower, the Green Wall and the ancient house). It also uses the metaphor of mathematics and engineering throughout, as examples of ideal systems of representation and manipulation that can be applied to materials, and which OneState tries to apply to humans. A human who cannot abide by the mathematical logic of OneState, who cannot or will not be engineered into his position in the \"We,\" is seen as a defective part, like a faulty piston or a bad spark plug, and is destroyed by the Benefactor. As one of the characters remarks late in the book, love has to be cruel. This society constantly destroys parts to save the whole, and the Benefactor teaches the Numbers to understand that as an act of love.This book was written around 1921, and the correlation between OneState and communism is obvious. In those early days, at least, communism sought to replace almost every human belief system with reason, and to build an engineered society in which everything was centrally planned. The way the citizens are brainwashed, and the ignorance, fear, and revulsion they feel toward the \"mythical\" world beyond the Green Wall is reminiscent of today's North Korea.The book also comments quite a bit, both directly and obliquely, on Christianity, which D-503 describes as humanity's first attempt to establish an all-powerful Benefactor (who also happened to be cruel).The one difficulty in reading We lies in the narrator's language in the second half of the book. In the first half, when everything in his daily life is rational and follows the Table of prescribed activities, the narrator's language is clear, detailed, and precise, as you would expect from a mathematician/engineer. Those fields, after all, are all about clarity, precision, and detail.As love, desire, yearning, anger, confusion, and other emotions begin to take over D-503's daily life, he often leaves his sentences hanging, because he simply has no way to express such imprecise emotions. He's trying to describe emotion using the language of OneState, which is a language from which the terms of emotion have been removed. As a result, the narrator leaves many sentences unfinished, because he just doesn't have the words to complete them.This can be maddening at times, especially when the narrative goes like this (I'm paraphrasing): \"The footsteps now were close behind me. When I turned to look, I saw it was... Of course, my first thought was... And from his eyes, I could tell he was thinking... And... well... you know.\"There's a lot of that in the final quarter of the book, as the breakdown of the narrative mirrors the breakdown of order in general, and of the narrator's understanding of his world.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Razzmatazz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUBPID4ZC6XOIGKBJE5Z2WE4TTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ8XMQ9CES3J6?ASIN=B08GKJ2VGF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2018",
                "reviewTitle": "5.0 out of 5 stars A New Favorite: dyspotian tragedy that can make you laugh out loud",
                "reviewText": "Mirra Ginsburg and Clarence Brown appear to be the best way to read this in English. I read all of Brown and only parts of Ginsburg. Like all translations I agreed with one or the other depending the given term or setence in the overall context and neither translator wins every time. The main thing is to get yourself a copy of this book -- NOW!Ginsburg:\" IMAGINATION.It is the worm that gnaws out black lines on the forehead. It is a fever that drives you to escape even farther--even if this \"farther\" begins where happiness ends. This is our last barricade on the way to happiness.Rejoice, then: this barricade has already been blown up.The road is open.The Latest discovery of State Science is the location of the center of imagination--a miserable little nodule in the brain in the area of the pons Varolii. Triple-X-ray cautory of this nodule--and you are cured of imagination--FOREVER.\"Now, Brown:\"IMAGINATION.This is the worm that eats out black wrinkles on the brow. This is the fever that drives you to run farther and farther, even though that 'farther' began in the place where happiness ends. This is the last barrier on the path to happiness. But rejoice: it has already been demolished. The path is free. The latest discovery of State Science: The imagination is centered in a wretched little brain node in the region of the pons Varolii. Expose this node to three doses of x-rays -- and you are cured of imaginationFOREVER.\"There is something eerie about how the great Russian writers from ~1830-1930 were writing about so many things that are not at all superficially relevent to Americans of today. Russia took a wrong turn and their brilliant dissidents could not affect a course correction. It seems that we are now playing with the idea of making the same sort of wrong turn, for the same naive and delusion reasons the Russians did. There is a very real set of lessons in this book and they are delivered with intelligence and humor.This book in particular out of the great Russian novels really struck a chord with me, thinking about how we live at the moment and the sorts of mistakes we are making. I think this book should be mandatory reading for anyone who admires Sam Harris and other \"rational athiests\", in particular, because it exposes the subtle hypocrisy and irrationality of people who claim to be all about 'the facts' or 'the science' or 'reason'. It shows that you don't need religion or dictators to create a tyrannical nightmare, you merely need people who think they are right about something and who are willing to coerce others into accepting it -- and the rest will happen on its own. It shows that terms can turn from ideals beyond reproach to tools for control and conformity. It exposes how subjective our purest ideals become in the hands of people who do not respect them.Easily one of my favorite books.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deniz Hassan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2023",
                "reviewTitle": "Pretty good",
                "reviewText": "I enjoy futurism and dystopian fiction. It is a great edition to my collection. Easy to read, the chapters are short.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 12, 2020",
                "reviewTitle": "Calidad corresponde al precio",
                "reviewText": "Por el precio, la calidad es la de un libro de bolsillo, el papel no es de buena calidad, es delgado y grisáceo. Realmente esperaba algo un poquito mejor, pero bueno, quería una versión de bolsillo para poder llevar y leer y para eso funciona bien. El forro es de pasta blanda pero no se siente de mala calidad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandre D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 22, 2018",
                "reviewTitle": "Very insightful.",
                "reviewText": "We was written in 1920 by an engineer, so the book has lots of analogies to numbers and science. Read it and you will start thinking to what extent conformity to society, even forced and totally obligatory conformity, has a power to produce happiness. Good luck to us all.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "giselle helene pons",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 3, 2017",
                "reviewTitle": "WE one if the first dystopian novels of tge XXth century.",
                "reviewText": "We is an astonishing dystopia that seemed to foresee and perhaps go beyond what happened in the USSR under Stalin.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Humberto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 3, 2015",
                "reviewTitle": "Excelente.",
                "reviewText": "O personagem central vive num sistema totalitário. Neste trecho fica evidente o seu pavor sobre os ricos de um mundo de homens livres: \"Eu tive oportunidade de ler e ouvir muitas coisas improváveis sobre aqueles momentos em que os seres humanos ainda viviam no estado de liberdade, ou seja, em um estado primitivo desorganizado. Uma coisa que sempre me pareceu mais improvável: como poderia um governo, mesmo um governo primitivo, permitir que as pessoas vivessem sem nada como nossas \"Tables\" - sem passeios obrigatórios, sem uma regulação precisa da hora de comer, por exemplo? Eles iriam se levantar e ir para a cama sempre que eles quisessem. Alguns historiadores chegam a dizer que naqueles dias as ruas eram iluminadas a noite toda, e todas as noites pessoas queriam sair pelas ruas.\"O resumo: o escravo tem medo da liberdade. O pior é que os homens livres também querem se escravizar...",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}