{
    "remaining_requests": 1658,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ubik-Philip-K-Dick/dp/0547572298",
    "body": {
        "name": "Ubik",
        "price": "$11.99$11.99$2.54$2.54",
        "originalPrice": "$18.99",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ubik-Philip-K-Dick/dp/0547572298",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/719x7SbxZ2L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Philip K. Dick",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Philip+K.+Dick&text=Philip+K.+Dick&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by so_goodwill.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3156,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 17 mins",
            "$3.99 delivery Wednesday, February 28.",
            "Or fastest delivery February 22 - 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Mariner Books; Reprint edition (April 17, 2012)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0547572298"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0547572291"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 6.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.56 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,505 in Books (See Top 100 in Books) #177 in Hard Science Fiction (Books) #404 in Space Operas #1,489 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,156 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Toby Price",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED7O5PMDAM5QEHRLIUHPYGL6ROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X8NWLCN5Y60D?ASIN=0547572298",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars amazing",
                "reviewText": "This is not only great science fiction, but a great novel, one of Dick’s best. If you’ve never read anything of his, this is a great place to start.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Timothy Haugh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIKRWUS4AMZQXKK2RXD6WOT2SAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ISBNX36KYJN7?ASIN=0547572298",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2021",
                "reviewTitle": "4.0 out of 5 stars Who Is Alive? Who Is Dead?",
                "reviewText": "I love science fiction—today perhaps not in the way I loved it back in the 1980’s and early 90’s, when I devoured so much of it—but those authors—Heinlein, Bradbury, Clarke, and, especially, Asimov—were the core of my reading until my tastes expanded as I got older. Dick was not one of my favorites; still, I had read and enjoyed The Man in the High Castle and a few others, and I knew he was the mind behind some of my favorite movies: Total Recall, Minority Report, and, especially, Blade Runner. Ubik was a story with which I was not familiar; however, I decided to give it a read and it took me back to a younger self.This novel is a mishmash of ideas, which is why I like it. In this world there are people with mental powers like mind-reading, telepathy, and precognition, as well as people who have the ability to counter these powers. Also, people have the ability to communicate with the recently dead, whose personalities live on in an accessible “half-life” for a certain period. Even better is the setting, which shows a world where everything costs, from paying your stove to cook and your front door to open.The story takes place among a group of people who work for a company that hires people with the counter-powers to deflect the advantages of people who have the powers. After an attack on the company, the world seems to regress back in time for the people in the accident—rockets become jets become bi-planes, etc. The questions the novel explores are things like, is the regression in time truly happening or an illusion? has everyone been killed and is this an experience of half-life? are some dead and some alive? is it ultimately possible to use our experiences to tell who is dead and who is alive? Heady stuff. Great stuff.Of course, reading it now reminds me also of the weaknesses of some of the science fiction I love. The characters are not drawn particularly strongly. And even the best science fiction cannot help but be a reflection of the time in which it was written. The pay-as-you-go appliances seem surprisingly old-fashioned, and the preponderance of cigarette smoking seems to be something that writers of the 60’s and 70’s couldn’t imagine a world without. And yet, it is easy to immerse yourself in this world and ignore these quaint touches in the face of some very interesting ideas.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott Holstad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELRUSCVX6OWDFSTLOCJ6B6GO3CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ6S8N8NXO09G?ASIN=0547572298",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2013",
                "reviewTitle": "5.0 out of 5 stars Great PKD Book!",
                "reviewText": "Wow! Ubik was a wild ride, even by Philip K. Dick's standards. Or perhaps a better way of putting it is the book meets the high standards he creates for his works, and then some!As the book begins, we meet Glen Runciter, head of the world's top anti-psi agency (to combat all of the psi organizations that have arisen now that it is 1992 -- heh!), located in New York City. He confers with his late wife, Ella, who is dead and buried in a Swiss moratorium, where she is in a suspended state of \"half life,\" through \"cold-pac\" --- something like our cryogenics. The world's top psi's are disappearing, and Runciter wants his wife's opinion on what to do. She thinks they should advertise more.We then go off to met Joe Chip, Runciter's top man, who is dirt poor and in debt. A Runciter scout has brought a young woman named Pat by to meet Joe. Pat has an unusual ability to nullify events before they even happen. Her psi tests are off the charts, and Joe marks on her report that she should be watched, that she could be dangerous.Runciter has a visitor from a businessman with a business on Luna (the moon?), in need of immediate anti-psi help. Runciter agrees to overlook some typical preliminaries, since it's an emergency, and soon he's leading Joe, Pat, and nine others to Luna to save this company. Where they're sabotaged. A bomb goes off in the room in which they're gathered and Runciter takes it the worst. He's pretty much dead, and the team rushes to get him into cold-pac in the spaceship so he can be saved and consulted with his wife. Joe starts planning on how to get back at their enemies from that moment forward. And from that moment forward, things start unraveling. It gets really PKD-like as alternate realities are discovered and time moves backward. Joe starts receiving odd messages from Runciter while members of the team start dying off, decomposing quickly. Soon the surviving members find themselves back in 1939 in Des Moines IA -- Joe has to get there by bi-plane. They're there for Runciter's funeral, but by now, Pat is under deep suspicion for being behind this, plotting with their enemies, and Joe's really ticked. Soon the reader doesn't know who is dead and who is alive!I won't give away the ending, but I'll just let you know that it's a typical PKD mind-f*** which is immensely satisfying while still being a bit confusing. It's a lot to swallow at once. Ubik rears its head at the beginning of each chapter in the form of an unusual ad for an unusual product, and Ubik plays a real role at the end of the book, but it's a bit mysterious at that. Suffice it to say that it's a miraculous spray can that is Joe's only way to stay alive.Philip K. Dick's eye for minutia is especially good in this novel as he highlights magazines from 1939 (real ones), early cars, etc. And this book is a fast paced thriller too. I read it in less than a day. I couldn't put it down. No wonder Time magazine chose it for inclusion as one of their \"100 best English-language novels!\" No argument there. I don't know if this is my favorite Philip K. Dick book, but if not, it's close. It's got the usual PKD themes like unreliable and alternate reality, time running backward, precognition (Minority Report, anyone?), telepathy, paranoia, hallucinations, and even spirituality. It's got a fantastic ending. It's a great introduction to Dick, if you're unfamiliar with him, and if you're a fan, it's a must read. You won't be able to put it down. Highly recommended.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Athelas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETKQPFRMPBPATSA52F5O2W45VEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AWXASSZ2LMXQ?ASIN=0547572298",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 20, 2015",
                "reviewTitle": "3.0 out of 5 stars Solid classic science fiction premise: flat characters that one could care less about.",
                "reviewText": "I am finding in a lot of my recent reviews that my main gripe has to do with not caring about the characters. Sadly that trend continues with the science fiction novel \"Ubik\". I bought it upon a multitude of positive recommendations and reviews, most of which lauded this classic work by a well-established writer of science fiction.Perhaps it is the era in which the novel was written - which coincides with the year of my birth. I read a lot of books like this as a kid and was perhaps more easily impressed by clever plot devices and exotic ideas. As a more experienced reader, however, I want to care about the characters. I want to feel upset when something bad happens to them and I want to shed a few tears when something sad or heartwarming occurs.Don't get me wrong - I still like clever plot devices, which in the case of this novel involves the characters losing touch with the reality of what is present and what is past. And I love reading about imagined futures that I have already lived through, which in the case of this novel involves a 1960s author speculating on what technology and society would be like in the 90s. (They got hover cars and moon bases, but no internet as it turns out!). That's great classic sci-fi. Bring it on! But just make me give a damn about the protagonist. Unfortunately, as Joe Chip struggled to get a grip on reality, I felt like I was watching an insect navigate across the pavement. Interesting, in an academic sense, but I don't personally care all that much if the ant makes it across, which was kind of how I felt by the end of the novel about Mr. Chip.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Too Cool For School",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 3, 2022",
                "reviewTitle": "Great book",
                "reviewText": "This book is awesome. Very PKD if you like his style. The book cover is not glassy smooth, there is a texture to it... Like silly smooth sandpaper. A very pleasing texture. Although \"A scanner Darkly\" has a slightly more coarse cover that has an even better tactile quality.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 17, 2018",
                "reviewTitle": "Milestone della literature science fiction Cyberpunk",
                "reviewText": "Uno dei migliori libri della letteratura scifi cyberpunk, accattivante, dialoghi ben scritti e personaggi come non si sono mai visti. E uno dei libri da leggere nella vita.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raiko M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 15, 2012",
                "reviewTitle": "Alles bleibt anders",
                "reviewText": "Wer neben Science Fiction auch das Absurde sucht, sollte Ubik lesen. Die Werke Philip K Dicks gelten zu Recht als einer der wesentlichsten Einflüsse in der Science Fiction Literatur.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 25, 2019",
                "reviewTitle": "GREAT BOOK",
                "reviewText": "WONDERFUL READ",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "F. Bertrand",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 15, 2021",
                "reviewTitle": "All of Philip K. Dick's books are worth reading, but they're not all of the same quality.",
                "reviewText": "Ubik is an experiment by Dick. Some people love Ubik. I think it's interesting, but unfinished.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}