{
    "remaining_requests": 1501,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shadow-City-Tales-Book-ebook/dp/B093FZCH13",
    "body": {
        "name": "Shadow City : (Tales of the Shadow City Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shadow-City-Tales-Book-ebook/dp/B093FZCH13",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/916uKGGhQuS._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anna Mocikat",
            "link": "https://www.amazon.com/Anna-Mocikat/e/B00IW3OO9A/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 233,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B093FZCH13"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (April 24, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 24, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1543 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 277 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1684333512"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#398,523 in Kindle Store (See Top 100 in Kindle Store) #3,563 in Dystopian Science Fiction (Kindle Store) #4,430 in Post-Apocalyptic Science Fiction (Kindle Store) #5,016 in Science Fiction Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 233 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Los Angeles is an apocalyptic wasteland. A place where villains become heroes and heroes are not what they seem. There is no light, there is no dark... only shadows. Book One in the Sci-fi/Horror series Tales of the Shadow City!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/c7ed6908-f949-45d7-a191-8730c824bbe6.__CR14,28,1385,856_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/c15b03a5-7fa7-4372-9d65-ca3213c010e5.__CR0,134,1920,576_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/c7ed6908-f949-45d7-a191-8730c824bbe6.__CR14,28,1385,856_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SephSpirit84",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2IP25HWBBJWWCSSLWU4UIRXKUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q3TQYUGMI632?ASIN=B093FZCH13",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2020",
                "reviewTitle": "5.0 out of 5 stars Shadow City is dark but intriguingly fun!",
                "reviewText": "Finished ‘Shadow City’ book one in the ‘Tales of the Shadow City’ by Anna Mocikat, quite enjoyed this and the setting and characters worked well for me with it being October and wanting some Halloween reading.I really liked the mix of fantasy and at times cyperpunk here, Shadow City is all over the place but it makes sense and the dystopian setting works really well for this tale.We are introduced to two siblings who find a naked and vey confused man who they save from being beaten by mutants. He needed help but we learn he has pretty decent reflexes for a supposedly helpless, naked stranger with amnesia. The siblings give him the name Colton and bring him home to the ‘the Zone’ with them. From there we are introduced to a very strange and dark world through the eyes of Colton and everyone he meets along with those in the ‘Human Force‘ who we find out made a pack with Vampires to help protect the last remaining city from The Dark Ones.This story has a ton of characters who are all unique and fun to be in the heads off including a rogue vampire named Eurydice who was quite intriguing. Couldn’t help but constantly wonder what was up with the one character Vincent who seems to fall in love(or is it lust?) for Eurydice.I will definitely be checking out the sequel to this when I get the chance because I want to know what happens! Still this was an amazing ride and nice first novel for a trilogy and felt it was time well spent! Truly recommend if you enjoy stories around Vampires, cyborgs and other otherworldly beings in a dystopian L.A.! I sure did!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montzalee Wittmann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDX66BRR74GD3TQ4EWR44444YUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TAD59GT38M9N?ASIN=B093FZCH13",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 18, 2020",
                "reviewTitle": "4.0 out of 5 stars A different kind of dystopian future!",
                "reviewText": "Shadow City by Anna Mocikat is a different kind of dystopian future. It has a bit of sci-fi and fantasy mixed together. There is my favorite character, a cyborg that is a woman in a machine body. There are mutant creatures, vampires, and Dark Ones that come from some other place. The world has been destroyed but no one alive knows what happened. They call it the Glitch. This story is about a settlement of humans and a group of vampires that help protect the humans from danger. There are evil bands of humans too. One man is new, he doesn't know who he is but he is a hero already to the people. The vampires checked his thoughts and ok'd him. But the mystery is who is he? Another mystery is that of a Being taking charge of a dead body. No one knows it's not their friend they thought was dead. Who is he? It is very exciting and mysterious! The only thing I had trouble with was the jump between points of view. No warning or change of chapter. Oh well, I enjoyed it and starting the next book I got from NetGalley!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tobias F.  Cabral",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD5JRGFMHWVTW34S6ZTX3T3TNGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EQ27BX3NM2B1?ASIN=B093FZCH13",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2021",
                "reviewTitle": "5.0 out of 5 stars The Apocalypse Was Just the Beginning!",
                "reviewText": "Anna Mocikat's Shadow City took me a bit by surprise. In an era when Post-Apocalyptic stories are as plentiful as mushrooms after a rain, it's difficult to fathom how such a tale can still feel fresh.But here it is!Years after The Glitch, the world is VERY different. Beings of extraordinary malice (the word, \"Evil\" would not be misused) have emerged into our reality, wreaking terrible devastation...which is just the way they like it, since they feed on pain and fear and suffering.THEY are not going hungry!A hardy band of humans (etc...) clings to existence in Los Angeles (the fate of the wider world is left ambiguous...as it would be when all electronic communications have broken down). Unlikely alliances form, and resolute warriors fend off mutants, marauders, and the corrosive effects of despair in their own midst.Into this mix, several mysterious characters drop, unsure of their role, except to help these survivors hold their own against the insidious, terrifying Dark Ones and their minions.Bleak as this all sounds, what really struck me about this story was the unexpectedly sweet, human nature of the connections which form among the characters. I expect this was one of the author's themes: Love can flourish even in the darkest, most unlikely of spaces.I very much look forward to the next installment in this saga!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ccg50",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOMRLMLDJ7C4TK55T2D4F4GIRVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24345XZDDAW5R?ASIN=B093FZCH13",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2020",
                "reviewTitle": "3.0 out of 5 stars Interesting!",
                "reviewText": "I did like the premise of this book. I liked the plot, character development and even the ending. What I was annoyed about was the writing. Grammar was lacking for whatever reason.I question who edited this book. Very poor job.When I’m reading and getting right into a book I hate getting stopped dead mid sentence to decipher what was written!Clean it up!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aaron Wang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTC3W65NGR2NMH4POTHVQXNMX6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ML4D8YOFXQ8I?ASIN=B093FZCH13",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2020",
                "reviewTitle": "5.0 out of 5 stars Broad Post-Apocalyptic Saga",
                "reviewText": "Shadow CityAfter the apocalypse, in the shadows of the Hollywood Hills, a war sweeps across the streets of Los Angeles for the future of humanity.And yet, this is far more than a story of post-apocalyptic survival. The author has constructed a world pulled by the forces of good and evil, of technology and the old world, and more importantly of the choices people have to make to survive in a place that takes everything and forgives nothing.This is definitely a book most enjoyed when read carefully. The author has created a wide variety of characters, both human and not, into a rich plot with many interwoven threads.The main thrust of the plot centers around the surviving bastion of civilization, an uneasy alliance of humans and vampires, and the forces aligned to destroy it. There's a little of something for everyone in this broad canvas - vampire lore, kick-ass women, mysterious despots, a POV character of unknown origin, and a battle robot too. The world-building is excellent and the different factions and their motivations very well thought out.I don't want to give too much away, so I'll leave it that the battles are vivid and the characters are a lot of fun. I'd particularly like to hang around with Eurydice, possibly to my detriment.From a plot standpoint, the first act covers almost half the book as a setup for the final two books of this trilogy, which I am super-excited to read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "j_cook10",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 1, 2020",
                "reviewTitle": "An Absolute Rollercoaster",
                "reviewText": "Okay, so, first of all, I loved this story! I loved the world Anna built. She is an absolute master of creating dystopian settings that are so vivid and realistic that it kind of makes you feel uneasy because you can quite easily picture yourself in them.I also loved how fast paced this story was. It was action, action, action all the way through. At times I felt annoyed with myself because my eyes couldn’t read fast enough and I needed to know what happened next! I do love a plot driven story. Also, I have to comment on the fact that there are so many suspenseful moments and intriguing moments that grab you and hold you throughout. Some questions are still unanswered now but that’s fine because I will definitely be back for book two.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kián KoWananga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 13, 2019",
                "reviewTitle": "Absolutely love it!",
                "reviewText": "First, there's a capital mistake with this book: it starts thrilling, reads page-turning, tension leads to a last occasion, and then suddenly the book ends – only to left a despared and adicted reader who want's so eagerly to know how this will go on and why with the promise: „to be continued, don't worry, it's a trilogy“.Content: There's no such as one single protagonist, there are some characters to focus on and to follow through thoughts and actions in an apocalyptic future of Los Angeles. The City of the Angels is full of dire shadows, and hostile after a catastrophic desaster which isn't really defined yet. Although people act like people always did, they behave human, it's kind of familiar to our own reality. Creatures known as existing only in myths and fantasy or movies like Underworld or RoboCop are real for the people, as there are mutants, and extremly evil entities are threatening the last survivors of the town.Nevertheless there are … how to name them without giving to much of the story away... beings well-disposed to the settlers, and there's also a observer who's always a tiny step bevore to reveal himself and interfere, against his instructions only to monitor the situation.If you want more to know about the „Shadow City“ - read the book! I highly recommend it.(As a German native I beg you pardon if the language I've used and thought of it as English does not match the skills of a translator, really tried my best.)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "luke hancock",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 27, 2021",
                "reviewTitle": "Once I was in, I was hooked",
                "reviewText": "Took a bit for me to remember which character was which, but once I did I became attached and invested to every single one.A perfectly paced story that built up to its epic finale moments and more than earned it's cliffhanger ending.Now on to the sequel!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Evelyn Chartres",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 8, 2021",
                "reviewTitle": "A satisfying ending that will have you yearning for more!",
                "reviewText": "An iconic city in ruins, a man with no past, entities from out of humanity's nightmares... Do I have your attention?Shadow City is a post-apocalyptic science fiction novel written by indie author Anna Mocikat. This tale features a rich cast of characters in a world filled with detail and nuance. Told from multiple points of view, the reader will soon realise that even in a world this dark, there is still plenty of grey to go around.It begins with a man with no past who is saved by two scavengers. Readers are quickly introduced to a dystopian society held together by an uneasy alliance facing an enemy only known as the Dark Ones. The characters' fates are complex and intertwined, leaving the reader guessing as to what will happen until the very end.If you are looking for a unique take on the struggle of good versus evil, this book is for you. You will be rewarded with a satisfying ending that will have you yearning for more. Fortunately, the sequel, Dark City, is already available! So, what are you waiting for?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Arrowsmith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 15, 2021",
                "reviewTitle": "Action-packed inventive fun",
                "reviewText": "There's lots to love here - a mysterious end of days event, strange characters appearing, vampires, a great post-apocalyptic LA setting... It's pacy, intriguing and inventive, and full of action as well as a varied and interesting cast list. If you like your fiction with a hefty dose of sci fi or fantasy, or like those kind of high octane films and video games then check this out...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}