{
    "remaining_requests": 1681,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Project-Hail-Mary/dp/B08GB58KD5",
    "body": {
        "name": "Project Hail Mary",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Project-Hail-Mary/dp/B08GB58KD5",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51b6fvQr1-L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Andy Weir",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Andy+Weir"
        },
        "brand": "Andy Weir",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 117665,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Winner of the 2022 Audie Awards' Audiobook of the YearNumber-One Audible and New York Times Audio Best SellerMore than one million audiobooks soldA lone astronaut must save the earth from disaster in this incredible new science-based thriller from the number-one New York Times best-selling author of The Martian.Ryland Grace is the sole survivor on a desperate, last-chance mission - and if he fails, humanity and the Earth itself will perish.Except that right now, he doesn't know that. He can't even remember his own name, let alone the nature of his assignment or how to complete it.All he knows is that he's been asleep for a very, very long time. And he's just been awakened to find himself millions of miles from home, with nothing but two corpses for company.His crewmates dead, his memories fuzzily returning, he realizes that an impossible task now confronts him. Alone on this tiny ship that's been cobbled together by every government and space agency on the planet and hurled into the depths of space, it's up to him to conquer an extinction-level threat to our species.And thanks to an unexpected ally, he just might have a chance.Part scientific mystery, part dazzling interstellar journey, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian - while taking us to places it never dreamed of going.PLEASE NOTE: To accommodate this audio edition, some changes to the original text have been made with the approval of author Andy Weir. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "16 hours and 10 minutes"
            },
            {
                "name": "Author",
                "value": "Andy Weir"
            },
            {
                "name": "Narrator",
                "value": "Ray Porter"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 04, 2021"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08GB58KD5"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#59 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Adventure Science Fiction #1 in Hard Science Fiction (Books) #1 in Hard Science Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jeff Gomske",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJED44JHCW4ATDA2K2MQRWPZQ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S65T689ZMZ1Z?ASIN=B08GB58KD5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 10, 2021",
                "reviewTitle": "5.0 out of 5 stars Astonishing, Fun, Entertaining, Fantastic",
                "reviewText": "I consider The Martian my favorite fictional novel of the last 15-20 years. The movie was incredible in that they actually followed the book closer than 99% of other films based on books. It remains my favorite movie of the last 15 years or so as well. I don't know anyone (personally) that loves either of them as much as I do.With that said, I was REALLY looking forward to Artemis. It was good...but, it was certainly not in the same caliber as The Martian was (at least not for me). I enjoyed it a lot, however and appreciated how author Andy Weir chose to go in a completely different direction and not just rehash another similar story, which I am certain would have been great as well.As a result, I was cautious regarding Project Hail Mary. It sounded a little too close to The Martian, but yet, also different in that the circumstances simply could not be more opposite and the stakes so much higher. I'm trying to figure out the best way to summarize without giving too much away from this utterly compelling novel. As I read several reviews, I noticed a recurring theme: SCIENCE. Lots and LOTS of science. Holy cow, they were right. Many years ago I read Apollo 13 and Jim Lovell and his co-writer, try as they might, simply could not dumb down Orbital Mechanics anywhere near enough for me to have even a minor clue as to what they were attempting to say...I just skipped 90% of it and hoped that the sentences written afterwards, would help to make sense of what I had just skimmed over. I'm a lot of things, but a math wizard is definitely not one of them. Michael Crichton (Jurassic Park) had an amazing talent for dumbing-down the science of what he was trying to explain in ways that genuinely made sense (most of the time). Not everyone has this talent, and I would say Andy Weir falls squarely in between. He's certainly better than Jim Lovell, but not quite as good as Crichton. But then again, outside of a science textbook, I haven't really read anything with quite as MUCH science as Project Hail Mary. So maybe he's just as good, but he just puts more science into his books than Crichton, maybe that's it...? Either way, be prepared for a lot of astonishingly interesting science within the pages of this novel...and I DO mean a LOT. I don't say this to make you wary or steer you away...on the contrary, Andy Weir has a special talent for making hard science truly entertaining.The book opens with an absolutely amazing and frightening premise: an astronaut awakes from an induced coma to find the only other two people on board have died at some point along their journey...but it gets worse. He has no idea who he is, or why he's on the ship, and oh yeah, they look to be a long way from home. A really, REALLY long way from home. In fact, the sun he sees isn't actually OUR sun at all. He's managed to leave our solar system entirely. And he has no idea why.((Minor Spoilers)) The book goes through some clever flash-backs, which set the stage for why the mission happens, and slowly, carefully explains how they managed to get so far away from earth in such a short amount of time. Basically, earth's sun seems to be dying. At the rate of decay, we have maybe 19 years left before the gradual cooling has catastrophic consequences resulting in the death of billions (best guess). Why the sun is dimming is quite the conundrum in the first place. Turns out it really isn't dying, it's being killed by an outside source...which turns out to be easily the greatest find in history. It's alien life, and they are using the sun for food, essentially. It's alien life, but not intelligent life. But still, wow! ALIENS, right???After this monumental discovery, and some tremendous research done by the most improbable scientist, the investigation into what is happening and why and what to do about it expands exponentially to other nations in order to pool all the resources possible to hopefully save the sun, and by extension, the human race as well. They learn. A LOT. A plan is put together, and with the help of the newly discovered microscopic alien life, which can also double as a power source (along with a few other nifty surprises), they begin to create one last, Hail Mary that could very well be the last chance we might have to save earth. It's audacious. It's dangerous, and it is absolutely critical that it succeed.As our astronaut's memory slowly unravels, so does his identity: Ryland Grace. He's a teacher on earth. Just a science teacher. Not even a college professor. He's amazingly smart, though. But he's no astronaut...and certainly not one who would volunteer to go on a one-way mission to another solar system to \"try\" and save humanity. Yet here he is. Alone. light years from earth, trying to solve the biggest riddle in all of human history. Ryland accepts his situation, such as it is, with relative indifference (for the most part). It doesn't matter HOW he got here. He's here now and he may as well use that time to be as productive as possible, right? Along the way, he unravels even more information regarding the microscopic alien life which is slowly dimming our sun during some additional flashbacks. The aliens, dubbed, \"Astrophage\" are quite the galactic plague as it turns out. Stars all over the galaxy are also losing their light, all due to the little buggers. All that is, except one particular star named, Tau Ceti. Now why would that one star be unaffected by Astrophage, when every single star around it has been affected to some degree. The plan is to go there and figure it out and send the information back, hopefully in time to save the sun before the damage to earth is beyond repair.There is an incredible amount of stuff going on. The story switches from Tau Ceti to flashbacks of how the whole mission was planned and implemented (which is VERY entertaining, especially Director Stratt, who may actually be my favorite character in the entire novel). Weir is becoming quite adept at building tension, and abruptly switching the story from Tau Ceti back to earth and building more of the backstory then switching back to Tau Ceti. Keeping it all in check and most importantly, interesting all while mixing in a healthy dose of science, which I am to understand is pretty much all genuine, is quite the juggling act. I have long known science can be astronomically entertaining (see what I did there?) when done right...but unfortunately very few people in a position to teach science actually know the best way to create that interest in others. I can say without reservation, Andy Weir definitely knows how to do it...at least in written form.There is so much I want to say more regarding this truly phenomenal story, but I simply cannot without ruining a lot of the fun and surprises revealed along the way...and it is killing me to keep it locked in. Though I labeled a spoiler warning earlier, I don't think it gave away any more than what the author himself has revealed in interviews he has done regarding the book, and what you can glean from reading the summary here and just a couple other reviews. Tying all of that science together is truly astonishing to me. The creativity to put it into a novel that is remarkably exciting to read is nothing more than incredible talent. Kudo's to Andy Weir for not just hitting a home run, Project Hail Mary is a Grand Slam all the way. I truly did not want this story to end. By the way, I enjoyed the ending quite a bit. I don't know if everyone will. But it was fine for me. I think the ending screams \"sequel\" at some point too. A lot was left open-ended (IMO) and I wouldn't mind reading a follow-up to this. It doesn't HAVE to happen, but there are a lot of ways where the story could go if Andy chose to do it. Just sayin'.Just run out and buy this book.",
                "reviewVotes": "278 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Armstrong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ5PTV7MB462ZRGE73SDGT5RCIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30C39CH3ZGZLK?ASIN=B08GB58KD5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars This is my #1 favorite book of all time. I read a LOT of books so I mean what I just said.",
                "reviewText": "As with The Martian, Andy Weir hooks you on page one where Ryland Grace is being asked a simple question. \"What is two plus two?\" From there, you go on a journey with Ryland to figure out his environment, what the heck is going and why HE is in the middle of all of this.I can't spoil it for you but there is a specific character that you will LOVE. Andy did a fantastic job of making this particular character one of the best in Sci-fi. Yes, this is just my opinion, but suffice it to say, you will probably love this character just as much :)There is a LOT of science. If you can appreciate the puzzles Ryland has to solve and not worry so much about the math or technical aspects woven into the story, it should not be overwhelming. If you liked The Martian, you should have no problem with this level of technical prose.I've read/listened to this book twenty-three times now. The high number is because I love the book so much that I am writing a fan-fiction sequel. It will suck and I'm not posting any means for you to find it here, but it does explain twenty-three reads.I can't say why, but this one book above all others might be better listened to as a first-read experience. If you trust me on this, you will understand. Ray Porter narrates and did so well that it won an award.The ending is heroic as only Andy could write. You will feel very satisfied that all has been resolved but in unexpected ways.I'll finish by saying the supporting characters are amazing. Andy does a fantastic job of creating different voices and personalities that make you enjoy their 'scenes,' hoping to see more of them.I give this book 5 resounding 'Jazz Hands.' Read the book and you will REALLY agree and also, understand my reference.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erik Martenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRMU5NES6TRNNNION42M4TQ6Q5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CQW7SL9JN5TZ?ASIN=B08GB58KD5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Lost in Space",
                "reviewText": "I loved the movie The Martian and thought I’d try the new Andy Weir book. It’s my first encounter with this author, and at first I was a bit thrown off by the use of first person perspective, but in the end I decided it fit the story perfectly.It’s about a man waking up on a spaceship having no memories of himself or his surroundings. Classic setting, and one that worked well for the story. All in all I loved the book, but there were a few inconsistencies or errors that prevented me from giving it five stars.I read the book using the Kindle app, and the first impression is that the text should’ve been justified. But I guess the author had someone else do the formatting, so I won’t blame him. However, as an American he should really know how to write the caliber of a bullet. It’s usually measured in milimeters or inches. On page 59 he writes «Which is like shooting a 50-caliber round at a sheet of paper …»I’m pretty confident he meant «… shooting a .50-caliber round …» because that bullet is half an inch in diameter, and in Norway we call it 12,7 mm.The next thing that makes no sense is a few pages later. «You guys know about climate change, right? How our CO2 emissions have caused a lot of problems in the environment?»Our CO2 emissions? Problems in the environment? More CO2 means a greener planet. Plants use CO2 for photosynthesis, and more CO2 makes them grow faster and use up less water. Why do you think farmers pump more CO2 into their greenhouses? It’s good for the planet, not bad, especially now we’re in a time with historically low CO2 content in the atmosphere, meaning many species of plants are almost at a starvation level.Besides, human emissions are tiny compared to those of nature herself. Fifty active volcanos, anyone? And most of it comes from the ocean anyway, and that’s where any excess CO2 would end up too.And then he presents one and a half degree temperature rise as a problem. Excuse me? One and a half? It was much warmer during the Holocene Optimum. Maybe he should read some history? Talk to some geologists? The Earth has been much warmer before, and we know this from ice core samples and tree ring data. Civilizations thrived. The Roman Empire, Chinese Han Dynasty, the Vikings settled Greenland and Newfoundland. No, cold is the enemy, not warmth.Looking past these rookie mistakes I found the book entertaining and fun. Great sci-fi. Great dialog. Loved Rocky and how his entire species was described in detail. I just love it when an author put this amount of detail into his stories. Also amazing detail on the spaceship and its unorthodox fuel.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Felipe Lorenzo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 10, 2024",
                "reviewTitle": "Excelente lectura",
                "reviewText": "sorprendente, ingenioso, detallado... No dormí una noche para terminarTodo estudiante de Ciencias o ingeniería debería leerlo. Muy buen libro",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 28, 2023",
                "reviewTitle": "Ficção científica com suspense - muito bom!",
                "reviewText": "A personagem principal do livro é - a ciência! Muito interessante a forma como ele desenvolve a história e envolve o leitor em cada descoberta. Tem muito suspense, foi difícil parar de ler. Recomendo para todos \"nerds\" como eu.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 5, 2024",
                "reviewTitle": "Wow!",
                "reviewText": "Das ist bei weitem das beste Buch was ich jemals gelesen habe. Und ich lese viel!!!!Ich hab’s gelesen und möchte direkt von vorne anfangen. Ich habe die englische/ originale Ausgabe gewählt. Manchmal gehst in der Übersetzung viel verloren. Es war soooo spannend und hat mich so tief innere Geschichte gezogen …. Ich muss es direkt (und ich meine DIREKT!) noch mal lesen.AMAZE!!! Good. Good. Good!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Saf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "Wanted to get back into reading after 30 years - Could not have chosen a better book",
                "reviewText": "About 30 years ago I used to have a huge collection of sci-fi books. Clarke, Dick, Asimov, the whole shebang which mysteriously disappeared during a house move. Since then I've been an avid watcher of sci-fi movies starting off with a VHS tapes, DVD collections, then Blu Rays and then eventually moving on to streaming services. Somewhere between all that I managed to install a home theatre including a 120\" screen, UHD projector and full Dolby surround sound and even 3D for movies such as Gravity, Avatar, Prometheus and Passengers. I even went back to watching old sci-movies such as 2001 and The Thing to get the large screen experience that I'd missed out on.Recently though I felt something off with the number of movies I'd been going through. I'd be scrolling through movies not being able to recall if I'd actually watched them or not. In some cases I'd even press play and 15 minutes or so in realise that I had already watched it a few weeks earlier. I was almost zombie watching them, sitting through an entire movie without really focussing on it and I was beginning to feel that my attention span was shot to shreds.As someone who spends most of his worktime on a computer I felt that way too much of my time was spent staring at a screen in one form or another. A laptop screen, monitor screen, TV screen, projector screen and the worst culprit of them all, a damn mobile phone screen. My sleep pattern was non existent and the only time I'd feel the slightest bit drowsy was when I was not staring at a screen, and this would usually be when I was driving. Otherwise I could comfortably be awake and alert until 3, 4 or even 5am without feeling the need to go to sleep, staring at a screen of course.As it happens, one of the Youtube channels I frequently watch called \"Media Death Cult\" often has top listings of recommended sci-fi including movies, TV shows and books. It was during one of the Top 50 books listings that I just decided to add some of the books to my Amazon shopping list totalling £200 and literally force myself to get back into reading. One of those books was Andy Wiers \"Project Hail Mary\" which was highly recommended by the shows presenter, Moid Moidelhoff.I've seen the movie version of Andy Weirs \"The Martian\" and to be honest I found it OK. \"Cast Away\" in space is a pretty apt description. Still, I decided to start with Project Hail Mary and to be honest I found it extremely hard to get into. Again, this had nothing to do with the content itself but by the realisation that I was finishing pages without absorbing the content itself. I'd constantly wonder how the current situation was occuring as I wasn't paying attention to what I was reading in previous pages.I then got into the habit of rereading paragraphs and pages until they started sinking in and before I knew it I was back in the reading groove. I was visualising scenarios in my imagination as they were being played out on the pages before me. I could see in my minds eye the spaceships, rooms, scenes, facial expressions, items floating around in zero g and what I'd been missing for all those years suddenly hit me. My mind was actually doing what it is actually supposed to and enjoying it immensely at the same time.I then decided to switch all devices off at 10:30pm every day and settle in bed with \"Project Hail Mary\" and in about an hour I'd start to feel drowsy not because the book was boring, but the natural urge to sleep was starting to kick in again. I'd actually fight the urge to nod off as much as I could because the book itself was so engrossing. I simply could not put it down. Eventually I'd turn the lights off at 11:30pm and within minutes I'd be asleep.I won't give any spoilers but put simply the plot is pretty straight forward, easy to follow, beautifully descriptive and emotional. I'm sure more seasoned sci-fi readers will pick faults but for my intent and purposes I could not have picked a better book. I simply loved it and in fact re read the last couple of chapters 3 times.And in just over a week I'd finished it. The first book I'd completed in 3 decades. For me it was more than just a book. It was a rehabilitation. A therapy session. A life changing event.My sleep patterns are back. My attention span is much impoved. My addiction to screens has finally been broken. I'm more alert and awake during waking hours and this book has played a massive part in this turnaround. While I am sure that many other books would have done the same \"Project Hail Mary\" now holds a special place for me.It has quite literally changed my life.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jasin s.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 23, 2024",
                "reviewTitle": "This book gives you hope for Mankind ♥️",
                "reviewText": "You will never find a book like this. Because there are no other feel good si-fi books out there. And this book will make you proud for being a human.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}