{
    "remaining_requests": 1568,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trust-David-Moody-ebook/dp/B008NYD00C",
    "body": {
        "name": "Trust: an Anti-Science-Fiction novel",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trust-David-Moody-ebook/dp/B008NYD00C",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81A8+xbjGVL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "David Moody",
            "link": "https://www.amazon.com/David-Moody/e/B001JSCGOU/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 93,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B008NYD00C"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Infected Books; 2nd edition (July 22, 2012)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 22, 2012"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5761 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 301 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#510,230 in Kindle Store (See Top 100 in Kindle Store) #1,557 in Alien Invasion Science Fiction eBooks #2,537 in Alien Invasion Science Fiction #3,395 in First Contact Science Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 93 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/ad3f0517-b8ee-4118-9dc1-98f4212e4694.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/4be9c687-799c-4e2c-9fa8-2a9f65f87716.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/46cd7e3d-a7b1-488a-a2b7-3b98715d5ca7.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/3b503aa6-3ca6-4add-bb19-a49336a42f69.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "lindaluane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENRAIC4BIO5UE4JWY2WOPNMXV3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4HOMWG2AY2OQ?ASIN=B008NYD00C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 23, 2013",
                "reviewTitle": "5.0 out of 5 stars a different kind of alien",
                "reviewText": "I really enjoyed this book - and I'm having a difficult time trying to figure out what to say because I don't want to spoil it for other who want to read it.The main character is Tom - he has moved to Thatcham, a small coastal village in England and has retired - even though a young man - he wants to get away from the dog-eat-dog world. So we find Tom living in a small town. At this point Aliens arrive on Earth as their mining starship has a technical problem that they can't seem to fix. As a result the aliens are stranded for a period of time until their home planet can come and pick them up (reminds me of a recent experience I had of a car problem and sitting on the expressway until the tow truck arrived ). Anyway, there are approximately 300+ aliens stranded on earth - we earthlings try to make them feel at home here and are awed and amazed at the presence. The first part of the novels is about the daily updates on TV - kind of like a mini series - even the sci-fi mini-series \"V\" is mentioned. Slowly, the establishment starts to trust these new visitors, welcoming them to earth, and following them around like pop-stars. But, there are also doubters, people who don't believe they are here for \"good\" reasons\". The book's main character, Tom Winter, is one of the doubters - he has questions. Part of the book describes this acceptance and the cultural conflicts of humans living with aliens. The main character, Tom, a rather distant and paranoid individual, grows progressively more so, isolating himself from just about everyone, as he tries to dig deeper into the aliens' reasons for being here on earth.I have to admit I thought Tom was a bit to antagonistic at times ... but....I will stop there for fear of giving too much away",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZ3YUSJJC7MBMSFCODGYHCSMJJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W7QDB9I97MZK?ASIN=B008NYD00C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2012",
                "reviewTitle": "4.0 out of 5 stars Another great story by Moody",
                "reviewText": "I have just finished this book and what a story. In typical Moody style, the characters are built up over a period of time and I find them very believable. The story starts fast paced and then slows into everyday life (hence my 4 instead of 5 stars as this is 80 per cent of the book), building up the suspense in a very real manner. The last 20 per cent of the book is where the story goes a million miles an hour and what a ride. If you liked the road, this is a must. Well done again and spot on ending.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Smitty of ONE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFZNWJPI6IZNRJZUVO5BWQB6WZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R67F5ALK65F3W?ASIN=B008NYD00C",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2012",
                "reviewTitle": "3.0 out of 5 stars First Contact?",
                "reviewText": "Trust starts out with a pretty neat concept, Aliens arrive on Earth as their mining starship has a 'flat tire' they can't fix. As a result they are stranded for a period of time until the intergalactic AAA can arrive. Cultural difference arise as the Aliens mingle with the skeptical earthlings.The book starts out strong and does a good job of fleshing out the main characters, but stumbles for much of the book as to much focus is placed upon the depression, or whatever, of the main main character. Ultimately almost most of the book is fluff that doesn't go anywhere. This all changes towards the end of the book when the book picks up again as the Aliens reveal and take action of their true intentions.This book had some great ideas and some solid writing, but to much fluff, numerous chapters of writing that goes nowhere. Ultimately this could have been a great short story. This did not stop me from enjoying it, and I plan on checking out some more of Mr. Moody's work.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr Dave Lightfoot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF45YBJVTRAPEYQN5AD3KEWY6EPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T7GO2I8QC7LZ?ASIN=B008NYD00C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2012",
                "reviewTitle": "5.0 out of 5 stars Trust Me, it's good.",
                "reviewText": "David Moody is without a doubt one of the best apocalyptic writers around today. He has created many different types of 'MAN' killing events within his fiction. From zoimbies to a dying sun and genetic differences causing war. In TRUST he leaves the apocalypse up to an invasion of aliens.Written in the first person, TRUST starts off running, literally as the main character is out for his daily jog and metaphorically as the pace of the book is quick and remains so throughout the entire story.David Moody has created an alien invasion unlike any other I have read about or seen in a movie. This time there seems little hope for mankind. The story is gripping, the setting is believable and premise is quite chilling. He has once again created the perfect apocalypse. One where the reader is left thinking, \"We're all doomed\".I highly recommend this book, just like I highly recommend everything David Moody writes. He is quickly becoming my favourite author of all time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Felicia A. Sullivan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKM4FCBTB5R3C3P7GBDMHTZH64Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZBGGP56DU962?ASIN=B008NYD00C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 14, 2012",
                "reviewTitle": "4.0 out of 5 stars Loved this book",
                "reviewText": "And I love David Moody. I bought the book years ago, but found it on a shelf recently and realized I had never reviewed it. I still remember details about it 5 years later, so it has been lasting. Honestly, anything David Moody writes, I like. He is a great storyteller with great ideas and I always look forward to anything he writes.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUFXRMOMFEONJKB2XA5DPIQTL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW1H1NUDXQXD8?ASIN=B008NYD00C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2013",
                "reviewTitle": "5.0 out of 5 stars Another Great Moody Classic",
                "reviewText": "I'm a huge fan of David Moody so I couldn't pass up the opportunity to nab the book while cheap.First and foremost David's books are very much concentrated on the relationships between the fellow man and how they impact the world around them. In Trust David focuses the story around one man, the friends and family in his life, and how they, along with the rest of humanity react to the sudden arrival of Alien beings.David has a way about making his characters real and believable. At once you will be able to relate to those in the book and start wondering what character you are most likely to emulate in this scenario.Some chapters tend to be a little slow, but by the end of each it is hard to put down. The need to continue is great and you will be rewarded with a very good ending. Highly recommend.Additionally, if you enjoyed this book, I recommend picking up David other books, especially the Autumn series!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZFY5DKPTXC4LPIJOUR4ABDYOOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QVZ7CZ19X8CQ?ASIN=B008NYD00C",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2014",
                "reviewTitle": "3.0 out of 5 stars Enjoyed it :)",
                "reviewText": "Not Moody's best compared to his others but his character descriptions and development was amazing Tom Winter was a truly well written lead and I could perfectly picture the beauty of Siobhan; but the entire book led up to an event that I thought may be greater...I wish there was more detail about his parents as well, I was at least expecting a monologue. I'm still glad I read the book, I felt myself daydreaming about it all week at work and excited to get home and read more, what I would give to head down to The Badger's Setting with Tom, Siobhan, James, and Rob and have a cold pint and a few laughs!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "danielle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELT3FO7OSXMV2X6UPYT6MW3ZSFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35ZC03GHHGLAG?ASIN=B008NYD00C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2017",
                "reviewTitle": "4.0 out of 5 stars I love David Moody's writing and I loved this book",
                "reviewText": "I love David Moody's writing and I loved this book , but I'll reserve that 5th star for my favorite. As always the journey was entertaining.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frauke",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 2, 2016",
                "reviewTitle": "Alien Invasion",
                "reviewText": "Na ja, Ca. 50% des Buches plätschern so vor sich hin. Dann wird es tatsächlich spannend, aber der Science Fiction Roman mutiert eher zu einer Zombie Geschichte. Der plötzliche Umschwung in der Geschichte ist meines Erachtens auch nicht besonders gut motiviert. Und das Ende ist dann unvermeidlich so, wie eine Zombie Geschichte eben nur enden kann.Mein Fazit: Gut geschrieben aber leider kein allzu anspruchsvolles Buch. 3 Sterne sind mich persönlich hier das Maximum.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Milton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 8, 2012",
                "reviewTitle": "Trust delivers dark \"anti sci-fi\"",
                "reviewText": "In my experience, people are creatures of habit and generally stick to what they know; and I'm no exception. I love horror and reading fiction from outwith the genre is really a rarity for me. There is quite often a degree of cross-over with the science-fiction and horror genres which led me to reading Trust by David Moody: the British writer behind the massively popular Autumn series and Hater, the film rights to which were snapped up by Guillermo del Toro.With Trust, there is little in the way of preamble, with the book effectively opening minutes before the alien vessel enters the Earth's atmosphere. From this powerful opening, Moody then turns his focus around on to the human characters of Trust and embarks on an exploration of the human condition relating to paranoia, racism, and of course, trust. While reading Trust, the reader cannot help but empathise with Moody's protagonist and be drawn into the story, questioning whether Tom Winter's suspicions are based on xenophobia or actually have some foundation.It's now been two weeks since I finished reading Trust and I still can't quite put my finger on what makes it, in my humble opinion, an instant classic. Moody has, as with the Autumn series, taken a group of very ordinary people and thrust them into a very extraordinary set of circumstances, yet makes it all so believable. The characters going about their daily business, jobs, relationships, dealing with financial woes contrasts sharply with and enhances the closing chapters of the book.Trust has been described as \"anti sci-fi\" by some critics and perhaps rightly so. Trust is an atypical sci-fi story, setting aside many genre cliches while directly referencing the film and TV shows that have shaped contemporary audiences notions of alien lifeforms coming to earth such as V, Alien Nation, War of the Worlds, Invasion of the Body Snatchers and Independence Day. However, I can guarantee that you will never have read anything like Trust before...Being objective, Trust will not be for everyone. Moody has a talent for taking his time with telling a story, developing it fully, before building to climactic and even shocking finales in his work and Trust continues this form. Those who don't have the patience for such efforts and are seeking a less cerebral, more action-driven plot would do well to look elsewhere. For those looking for something a little different, infinitely more satisfying and thought-provoking, get yourself a copy of Trust at your earliest convenience.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lorelei Douglas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 2, 2013",
                "reviewTitle": "Good but not as compelling as Autumn and Dog Blood",
                "reviewText": "Don't get me wrong - I love David Moody's writing. I couldn't put the Autumn series down and waited with bated breath for each part of the Dog Blood trilogy. Trust left me feeling cold. The premise was interesting and some of the characters had potential, but they didn't seem to develop much along the way. Plus, we never got to know the aliens really. And the ending - completely nihilistic. But I don't want to spoil that for you. Trust is good, but not as good as the others.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 24, 2020",
                "reviewTitle": "A good David Moody book.",
                "reviewText": "A good read which kept me interested.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 10, 2013",
                "reviewTitle": "Decent but I don't quite get all the rave reviews....",
                "reviewText": "I thought the book was ok and good in some parts. I suppose I get why people are quoting it as being `dark', but to me the characters were just a too curmudgeonly and cynical, I didn't get anything deep or clever about the character's continued cynicism, just annoying and not really likeable after a while, and I don't feel the plotline countered that in any way - sorry for being a bit negative and I concede it's maybe `just me'.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}