{
    "remaining_requests": 1578,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Transient-Echoes-Dystopian-Sci-fi-Variant-ebook/dp/B01B9U2H50",
    "body": {
        "name": "Transient Echoes: A Dystopian Sci-fi Novel (The Variant Saga Book 2)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Transient-Echoes-Dystopian-Sci-fi-Variant-ebook/dp/B01B9U2H50",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81kGFTTkcOL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "J.N. Chaney",
            "link": "https://www.amazon.com/J-N-Chaney/e/B00W2ZAK7E/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1331,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "It has been three years since the day of the Second Jolt.Thanks to the efforts of a select few, the world is finally moving on. As the Variant air begins to thin, humanity finds itself on the cusp of a new age of exploration. But at what cost?After closing the rift—the source of all Variant—the hybrid child known as Terry has been transported to a distant world, far away from the only home he’s ever known. Completely isolated, and haunted by voices from his past, he wanders through the ruins of an ancient civilization long forgotten.Back on Earth, a young woman named Mei works tirelessly to uncover the secrets of the rift. Against orders, she searches for the truth, making an unprecedented gamble. Will her obsession bring the answers she so desperately seeks…or will it cause even more destruction?Experience the second volume in the epic series from USA Today Bestselling Author J.N. Chaney. If you're a fan of Ender's Game, Fallout, or Renegade Star, you're sure to enjoy the Variant Saga. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01B9U2H50"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Variant Publications (March 28, 2016)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 28, 2016"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2139 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 362 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#217,253 in Kindle Store (See Top 100 in Kindle Store) #700 in Galactic Empire Science Fiction #792 in Space Exploration Science Fiction eBooks #816 in Alien Invasion Science Fiction eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,331 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lomeraniel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC2ACLZ2MNWXCGZ7IIR5ZW5Z66A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JPZF7OGF1QGY?ASIN=B01B9U2H50",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2016",
                "reviewTitle": "5.0 out of 5 stars I think this is one of the aspects that I enjoyed most of this book",
                "reviewText": "Audiobook was provided for review by AudioBookReviewer dot com.In the Amber Project we left Terry in a new world after he closed the rift, which will be called the Second Jolt. This story starts three years later, in the year 2350. There are two parallel stories in this book. On one hand, Terry is scouting around the new place were he got trapped and where the variant came from, and on the other hand, his friends John and Mei are investigating what could have happened to Terry, and whether he may still be alive. Mei leads an investigation team on the place where the Jolts took place, to check why there is an increasing radiation in this area and to investigate a new power source. The increasing radiation will be the main issue that will prevent them to get to the exact place where the Jolts originated, and where Terry got lost.The style of this book is completely different to the first one, keeping the story fresh. It is more slowly paced and we are presented with two parallel stories. Chaney knows how to keep us interested though, since in both stories there are mysteries to be revealed, and we accompany the characters in their way to finding the truth. I think this is one of the aspects that I enjoyed most of this book: investigating and discovering things along with the characters, making hypothesis now and then. When an author gets this from their readers, I think it is a complete success. Chaney really knows how slowly unfold the truth and keep us interested until the very end.Another strong point is how the characters are built. We are not given a zillion details about them but they are alive, they feel human, and one can easily connect with them.I was surprised about this book being narrated by someone else than the first book, and it took me a while to get used to Steve Barnes' husky voice (in a way I felt that somebody was whispering in my ear), but his speech is clear and he successfully transmitted the characters' emotions.This is a transition book, and there is still a lot to know about the world where Terry now lives. Transition books are hard to build, since you need to keep your readers interested while going from A to B. The two parallel stories helped to create this bridge, and the story was cleverly constructed.Something that made me doubt a bit is that days seem to have the same duration on Earth and on the planet where Terry lives. As I have said, there is still a lot to be revealed about this new world, and I do hope we will get the answers to our questions. Building a transition book is difficult, but a good ending is even more difficult. Let's see what Chaney comes up with. I am impatient.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTQIB2N2IKU7PYNLCTHVZH4HW7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H0SNFQTV6EBC?ASIN=B01B9U2H50",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2022",
                "reviewTitle": "4.0 out of 5 stars Worlds apart!",
                "reviewText": "Terry is now on an alien planet with a variant atmosphere, while Mei is trying to work out what happened to Terry when the portal closed. Terry is foraging for food, surviving mainly on fruit and the occasional animal when comes across some alien natives who try and capture him. He manages to escape and finds a settlement where he starts to learn the language and make friends until one day the others come back.....Meanwhile Mei is head of a research group to try and get the coils working that could provide an alternative energy supply. She is also excavating the collapsed location of the portal, when the radiation levels start to rise....This book is really a stop gap before the next one, but does provide some insight into the alien natives. An entertaining read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bea LaRocca",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL6GYFNYHX4RMEE4CXGYSDW4VDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UQJHUJ17CJX1?ASIN=B01B9U2H50",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2016",
                "reviewTitle": "5.0 out of 5 stars Brilliant! I would love to see this series on the big screen!",
                "reviewText": "I began reading Transient Echoes the minute that I one-clicked! I couldn't wait to see how Terry and Mei and all of these other characters that I had come to know and love were getting along. And I really couldn't wait to have more of the story unfold, to learn more about the origins of the disaster that had befallen the Earth so long ago. I was not disappointed!The pacing of this story is perfect. Just slow enough to keep you on the edge of your seat as the layers are peeled back one by one, eventually exposing the truth behind the Jolt, the catastrophic event that had drastically altered the Earth's atmosphere and brought mankind to the brink of extinction.Like any great mystery, the clues are exposed gradually giving the reader time to try to puzzle it out on their own.We now find Terry alone on a strange new world with only the voices in his head to keep him company. Transported through the rift in space as he shut down the machine that had all but destroyed the human race, he struggles to survive as he believes himself to be responsible for the death of the friends that he'd left behind.Meanwhile Mei is back home on Earth, a PHD now in charge of her own scientific team. Under the guise of discovering the source of the radiation still emanating from the facility that had housed the machine and of exploring the potential development of a new energy source, she secretly works to learn the truth about what really happened to her friend Terry on that fateful expedition three years before.As they each struggle to survive in their dangerous surroundings, the truth slowly unfolds, but not all of the answers are to be found on Earth...I hated getting to the end of this story as I knew that I had to wait for the next installment to be released. And now I've been sitting on Hope Everlasting for a while, waiting for all of the holiday chaos to be over so that I could totally immerse myself in this wonderful story that Mr. Chaney has created. I can't wait to see if things are going to work out the way that I think that they are or if the author has some surprises for me! The Variant Saga is a brilliantly written, exciting story that I think would translate very well to film. Much like the Divergent Saga, Maze Runner or The Hunger Games I would love to see this series up on the big screen someday! Highly recommended!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Good stuff",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 10, 2020",
                "reviewTitle": "Page turner",
                "reviewText": "What an exciting story! I’ve enjoyed every minute and the way the story switches between character groups/settings. I’m constantly guessing what will happen on the next page. Great character development with just the right amount of detail to keep the story moving and the reader engaged. Can’t wait to read the next book of the series. My only complaint... what the heck happened with Sarah?!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 31, 2020",
                "reviewTitle": "Books For Any Age.",
                "reviewText": "From book 1 to book 3 found that you invested in the main charters they were a joy to read good for any age to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wildfly56",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 24, 2016",
                "reviewTitle": "Another great read",
                "reviewText": "Enjoyed reading book 2 in this saga. The follow on from book one is great with more depth being developed in some of the character. There are a couple of the original children missing in this tale and I hoped they get a chance to reappear in the next book. Left with a little bit of a cliff hanger in regards to the team from earth have passed through the wormhole to another world where a team is setting out to find out what has disturbed an ancient quarantined building. Look forward to reading book 3",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sonni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 5, 2020",
                "reviewTitle": "Good series",
                "reviewText": "I have enjoyed this series so far . It has some flaws . But over all a good read . Recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 7, 2016",
                "reviewTitle": "Great Read",
                "reviewText": "A great read. I read this and book 1 while on vacation in Rome, which I think shows how well it held me interest.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}