{
    "remaining_requests": 1432,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Severance-Novel-Ling-Ma/dp/1250214998",
    "body": {
        "name": "Severance: A Novel",
        "price": "$10.99$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Severance-Novel-Ling-Ma/dp/1250214998",
        "soldBy": {
            "sellerID": "A1L0GTHEGBAVJ6",
            "name": "designcentral",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1L0GTHEGBAVJ6&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31mPYQxX73L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51g3JhnXoaL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ling Ma",
            "link": "https://www.amazon.com/Ling-Ma/e/B001JOCHRA/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "designcentral",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 5358,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Winner of the 2019 NYPL Young Lions Fiction AwardWinner of the 2018 Kirkus Prize for FictionWinner of the 2019 VCU Cabell First Novelist AwardWinner of the 2019 Friends of American Writers First Prize in LiteratureFinalist for the 2019 PEN/Hemingway Award for Debut NovelShortlisted for the 2019 Neukom Institute Literary Arts Award for Debut Speculative FictionA New York Times Notable Book of 2018An NPR Best Book of 2018An Elle Best Book of 2018A Marie Claire Best Book of 2018A Buzzfeed Best Book of 2018A Refinery29 Best Book of 2018A Jezebel Favorite Book of 2018A Bustle Best Book of 2018An Electric Lit Best Novel of 2018A Lit Hub Best Book of 2018A BookPage Best Book of 2018A Bookish Best Book of 2018A Mental Floss Best Book of 2018A Chicago Review of BooksBest Book of 2018A HuffPost Best Fiction Book of 2018An Electric Literature Best Book of 2018An A.V. Club Favorite Book of 2018A Jezebel Favorite Book of 2018A Vulture Best Science Fiction and Fantasy Book of 2018Longlisted for the Aspen Words PrizeA Book of the Month Club Selection for December 2018Shortlisted for the 2018 Chicago Review of Books AwardNew York Magazine Approval Matrix, \"Highbrow Brilliant\"An Indie Next Great Reads SelectionA Southern Living Best New Book of Summer 2018A Millions Most Anticipated Book of 2018An Alma Favorite Book for FallA Nylon Best Book of Summer 2018A Chicago Magazine Summer Reading PickA Library Journal Summer Fall Best Debut Novel An April Magazine Most Anticipated Book of 2018A BookBub Laugh-Out-Loud Book of 2018A Library Journal Debut With CredentialsA Refinery29 Best New Book of August 2018A Greenlight Bookstore Pick in Brooklyn Paper “Severance is the most gorgeously written novel I’ve read all year; when I finished it, I immediately picked it up and read it all over again.” ―Jane Hu, The New Republic“Severance is the best work of fiction I’ve read yet about the millennial condition―the alienation and cruelty that comes with being a functional person under advanced global capitalism, and the compromised pleasures and irreducibly personal meaning to be found in claiming some stability in a terrible world. I love how, in this novel, doom is inevitable, and yet it comes so slowly you might not even notice it. Ling Ma has written one of my favorite novels of the year.” ―Jia Tolentino, New Yorker staff writer“A satirical spin on the end times―kind of like The Office meets The Leftovers.” ―Estelle Tang, Elle\"[A] standout debut. Satiric and playful―as well as scary . . . Ling Ma is an assured and inventive storyteller [and her novel] reflects on the nature of human identity and how much the repetitive tasks we perform come to define who we are. . . . A sardonic wake-up call.\" ―Maureen Corrigan, Fresh Air, National Public Radio\"[A] semi-surreal sendup of a workplace and its utopia of rules, not unlike Joshua Ferris's Then We Came to the End . . . Laced within Ma's dystopian narrative is an arresting encapsulation of a first-generation immigrant's nostalgia for New York . . . Severance evokes traces of . . . Joan Didion.\" ―Antonia Hitchens, The New York Times Book Review\"How do you fit a zombie novel inside an immigrant story inside a coming-of-age tale? Ling Ma . . . accomplished this feat in her gripping and original turducken of a novel . . . Fascinating.\" ―Trine Tsouderos, The Chicago Tribune“Ma’s prose is, for the most part, understated and restrained, somewhat in the manner of Kazuo Ishiguro . . . Ma is at her most deft when depicting this kind of severance: the amputation of the immigrant’s past, preserved like a phantom limb whose pain is haunted with absence.” ―Jiayang Fan, The New Yorker\"Gorgeously wacky.\" ―Hillary Kelly, Vulture“Tense and elegant, Ma’s writing here masterfully treads the line between genre fiction and literature. Part bildungsroman, part horror flick, Severance thrillingly morphs into a novel about self-worth, about the kinds of value we place on our own lives.” ―Larissa Pham, The Nation“Ling Ma’s extraordinary debut encompasses many genres and might just be the first and only coming-of-age, immigrant experience, anti-capitalist zombie novel you’ll ever need.\" ―The Cut“Ma’s writing about the jargon of globalized capitalism has a mix of humor and pathos that reminded me a little of Infinite Jest and a little of George Saunders.” ―Emily Witt, The New Yorker\"I recommend [Severance] unreservedly: it’s perfect for when you’re living in that space between “oh shit, what if the world ends” and “oh shit, what if the world doesn’t end”―and truly, who isn’t living in that space right now?\" ―Katie Yee, Lit Hub“Ling Ma’s Severance . . . sneaks up on you from all sides: it’s an affecting portrayal of loss, a precise fictional evocation of group dynamics, and a sharp character study of its protagonist, Candace Chen.” ―Tobias Carroll, Tor.com\"Ling Ma delivers a fascinating coming-of-age novel, one full of millennial culture, post-apocalyptic adventures, and, perhaps most exciting of all, a zombie-like populace . . . Severance wonderfully demonstrates how the lifestyles we lead now can have a great impact on our future.” ―M. M. Silva, Zyzzyva\"Shocking and ferocious . . . a fierce debut from a writer with seemingly boundless imagination. . . a wicked satire of consumerism and work culture . . . It's a stunning, audacious book with a fresh take on both office politics and what the apocalypse might bring: This is the way the world ends, Ma seems to be saying, not with a bang but a memo.\" ―Michael Schaub, NPR.org\"A suspenseful adventure that doubles as a sly critique of late capitalism.\" ―Boris Kachka, Vulture \"Funny, frightening, and touching.... Ling Ma manages the impressive trick of delivering a bildungsroman, a survival tale, and satire of late capitalist millennial angst in one book, and Severance announces its author as a supremely talented writer to watch.\" ―The Millions“As debut novels go, Severance is about as original and assured as they come.” ―Laura Pearson, The Chicago Tribune \"If satirist Gary Shteyngart wrote his version of 2015 end-of-world breakout Station Eleven, it would be this compulsively readable book.\" ―Mind Body Green“Ling Ma’s debut novel tackles countless themes―immigration, work culture, family, capitalism, and the confusing aimlessness of your early 20s―with a dry wit that keeps the horrific digestible, the repetitive laughable, and the pages turning.” ―Marie Claire \"Astounding . . . Ma’s engrossing, masterfully written debut transforms the mundane into a landscape of tricky memory, where questions of late-stage capitalism, immigration, displacement and motherhood converge in such a sly build-up as to render the reader completely stunned.\" ―BookPage\"Ling Ma’s debut novel is a weird and funny story that melds an end-of-the-world collapse of civilization with a sharp critique of modern work culture, along with a dose of meditation on grief and the immigrant experience.\" ―Chris Kim, OZY \"A brilliantly unsettling dystopian novel following a young woman who somehow escapes a fever epidemic and joins a cult-like group of fellow survivors.\" ―Bust\"The book I loved most of all in 2018, the queen of the stack (if you will), is Severance . . . It’s I Am Legend for the plugged-in, globally conscious, thinking woman. I could not be more obsessed.\" ―Siobhan Jones, Book of the Month Club \"Ma's writing is compelling and cogent, perfectly satirizing a world that often feels beyond parody.\" ―Nylon“[Severance is] a book about work that puts the work in the context of globalization, a book that is mordant and sad and full of quicksilver allegories. I loved that book so much.” ―Lydia Kiesling, The Millions \"Ma's language does so much in this book, and its precision, its purposeful specificity, implicates an entire generation. But what is most remarkable is the gentleness with which Ma describes those working within the capital-S System. What does it mean if a person finds true comfort working as a 'cog' in a system they disagree with? Is that comfort any less real?\" ―Buzzfeed \"What Ma accomplishes with her fever-stricken world is what sets Severance apart. Rather than take the end of days as a chance for the usual pontifications on societal collapse―most seemingly ignorant that we built society from nothing the first time, and we would certainly do it again―Ma uses the disaster trope for interrogation on a scale small enough to lacerate.” ―B. David Zarley, Paste“A satiric vision that takes in late capitalism, the immigrant experience, and the anomie of early adulthood.\" ―Library of America“With exquisite pacing, Ling Ma alternates between Candace’s precarious present and her childhood as the daughter of Chinese immigrants, and contemplates the possibility of a future in a lonely, blasted world. Severance is a scathing portrait of a society collapsing under its own ungovernable appetites, as well as a haunting meditation on family inheritance and its loss.” ―Claire Fallon, Huffington Post\"Severance meets and exceeds the promise of [its] exciting description. In many ways, Severance is a novel of ideas―it artfully blends/bends genre, it boldly indicts global capitalism, consumerism, and materialism―but every one of its intellectual aims is deeply grounded in the richly felt experiences of the narrator. ―Joseph Scapellato, Electric Lit\"For readers who love their literary fiction with a dash of apocalypse, this one's for you.\" ―Bookish\"Severance shares as much with Then We Came To The End, Joshua Ferris’ meditation on the failure of an advertising agency, as it does with The Walking Dead; Ma plays with voice, alternating between the first-person singular and plural to show how easily an individual comes to identify as part of a collective and how hard it is to have that group fall apart.\" ―Samantha Nelson, A.V. Club\"Takes the milieu of the film Frances Ha and mixes in a subdued zombie apocalypse. . . A clever and funny novel that depicts modern urban ennui and a speculative post-apocalyptic world equally well, while using its central contagion as a metaphor to critique late capitalism, globalization, and nostalgia.\" ―Matt Stowe, Brooklyn Paper\"I consumed [Severance] like a hungry fungal spore in two days.\" ―Molly Young“Ma is satiric about the workplace, in a way that’s less snobbish than Nell Zink but just as funny and imaginative . . . All the best metaphors in the book are cleverly crafted harbingers . . . Her dexterity in joking about capitalism rivals the skill of the great Richard Powers.” ―Kaitlin Philips, BookForum“Listen, are we just suggesting Severance to everyone, because everyone in the office read and loved it? Yes, sure. But also, post-apocalyptic novels are perfect crucibles for imagining what happens when the rules we operate under break down.” ―Electric Lit\"Ling Ma's novel Severance is an astute combination of workplace novel and apocalyptic tale. Smart and filled with humanity, this debut is one of the year's best books.\" ―Large-Hearted Boy“This depiction of the Midwest feels unexpectedly of our time, at a moment when coastal nostalgia for the heartland has fixated as much on frontier sentimentalism (prairie dresses, artisanal foods) as it has dead mall videos and ruin porn.” ―Meghan O’Gieblyn, Lit Hub\"A radically understated debut novel . . . searingly underplayed.\" ―Constance Grady, Vox\"This quirky satire of office culture . . . imagines what would happen to a Chinese American workaholic if Manhattan were hit by a sudden apocalypse.\" ―Chicago Magazine\"Blends two distinct subgenres into a wholly original narrative.\" ―Vol. 1 Brooklyn \"A biting indictment of late-stage capitalism and a chilling vision of what comes after . . . [Ma] knows her craft, and it shows. [Her protagonist] is a wonderful mix of vulnerability, wry humor, and steely strength. . . . Ma also offers lovely meditations on memory and the immigrant experience. Smart, funny, humane, and superbly well-written.\" ―Kirkus, starred review \"Embracing the genre but somehow transcending it, Ma creates a truly engrossing and believable anti-utopian world. Ma's extraordinary debut marks a notable creative jump by playing on the apocalyptic fears many people share today.\" ―Booklist, starred review \"In this shrewd postapocalpytic debut, Ma imagines the end times in the world of late capitalism, marked by comforting, debilitating effects of nostalgia on its characters . . . The novel's strength lies in Ma's accomplished handling of the walking dead conceit to reflect on what constitutes the good life. This is a clever and dextrous debut.\" ―Publishers Weekly \"A smart, searing exposé on the perils of consumerism, Google overload, and millennial malaise . . . an already established audience will be eager to discover this work.\" ―Library Journal About the Author Ling Ma is a writer hailing from Fujian, Utah, and Kansas. She is the author of the novel Severance, which received the Kirkus Prize, a Whiting Award, the VCU Cabell First Novelist Award, and the New York Public Library Young Lions Fiction Award. She lives in Chicago with her family."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21",
            "FREE delivery March 5 - 18 on orders shipped by Amazon over $35",
            "Or fastest delivery March 4 - 15",
            "FREE pickup Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Maybe it’s the end of the world, but not for Candace Chen, a millennial, first-generation American and office drone meandering her way into adulthood in Ling Ma’s offbeat, wryly funny, apocalyptic satire, Severance.\"A stunning, audacious book with a fresh take on both office politics and what the apocalypse might bring.\" ―Michael Schaub, NPR.org“A satirical spin on the end times-- kind of like The Office meets The Leftovers.” --Estelle Tang, ElleNAMED A BEST BOOK OF THE YEAR BY: NPR * The New Yorker (\"Books We Loved\") * Elle * Marie Claire * Amazon Editors * The Paris Review (Staff Favorites) * Refinery29 *Bustle *Buzzfeed *BookPage *Bookish * Mental Floss * Chicago Review of Books * HuffPost * Electric Literature * A.V. Club * Jezebel * Vulture * Literary Hub * FlavorwireWinner of the NYPL Young Lions Fiction Award * Winner of the Kirkus Prize for Fiction * Winner of the VCU Cabell First Novelist Award * Finalist for the PEN/Hemingway Award for Debut Novel * A New York Times Notable Book of 2018 * An Indie Next SelectionCandace Chen, a millennial drone self-sequestered in a Manhattan office tower, is devoted to routine. With the recent passing of her Chinese immigrant parents, she’s had her fill of uncertainty. She’s content just to carry on: She goes to work, troubleshoots the teen-targeted Gemstone Bible, watches movies in a Greenpoint basement with her boyfriend.So Candace barely notices when a plague of biblical proportions sweeps New York. Then Shen Fever spreads. Families flee. Companies cease operations. The subways screech to a halt. Her bosses enlist her as part of a dwindling skeleton crew with a big end-date payoff. Soon entirely alone, still unfevered, she photographs the eerie, abandoned city as the anonymous blogger NY Ghost.Candace won’t be able to make it on her own forever, though. Enter a group of survivors, led by the power-hungry IT tech Bob. They’re traveling to a place called the Facility, where, Bob promises, they will have everything they need to start society anew. But Candace is carrying a secret she knows Bob will exploit. Should she escape from her rescuers?A send-up and takedown of the rituals, routines, and missed opportunities of contemporary life, Ling Ma’s Severance is a moving family story, a quirky coming-of-adulthood tale, and a hilarious, deadpan satire. Most important, it’s a heartfelt tribute to the connections that drive us to do more than survive.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Picador; Reprint edition (May 7, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250214998"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250214997"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.4 x 0.8 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,577 in Books (See Top 100 in Books) #50 in Asian American Literature & Fiction #132 in Fiction Satire #1,196 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 5,358 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4YI3DF3JUM6I4FQR3MIONWE5WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17GW904K08SBV?ASIN=1250214998",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Not what I was expecting",
                "reviewText": "I read LOTS of apocalyptic novels, but I have to admit that they tend to be a lot alike. This novel is nothing like anything I've read before. I didn't read the reviews before I bought this book, so I wasn't prepared for the abundant detail of the main character's pre-pandemic past. This is something you don't see very often in apocalyptic novels. But I was fascinated by her past, the ennui she seemed to feel after her parents died and she moved to NYC without a clue what she was going to do for a living.I've never been to New York City, but I watch lots of videos on YouTube of young people living there and hustling like crazy to break into careers in the areas they are most interested in. Sometimes they have to take low level office jobs and work their tails off and put up with high stress and office politics. Sometimes they burn out and move out.Candace Chen (the main character) does her job well, yet she wonders if that is enough reason to remain there. After all, she doesn't feel fulfilled. Surely there is more. Does she have the courage to make that leap away from security and the routine and head into unknown territory and build a new life? Her parents did, when they immigrated from China.OK, I was pretty far along in the story when I realized that the Shen Fever which turned people into non-dangerous zombies who were just interested in repeating their same old patterns until they rotted, might actually be a metaphor. That maybe this book wasn't about a global pandemic that killed so many people that there weren't enough survivors for a reboot.I can't stop thinking about this novel. I was shocked to find that it was published in 2018, before COVID. The author foretold so many things, such as wearing masks that don't stop the spread, lockdowns, working from home. I was puzzled that she set the novel during President Obama's administration. I am still trying to figure that one out.I highly recommend this book, even though I'm not sure I understood it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Duane Schneider",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCW5DLJJSHDXQOXRGHJ5D6VRODA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LLOK2Y7DMUM?ASIN=1250214998",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2020",
                "reviewTitle": "4.0 out of 5 stars Great Read if You Happen to Be Caught in a Pandemic (or Not)",
                "reviewText": "A few months ago, I was looking for books on office life (I know, exciting!) and came across \"Severance\" on a list. I recently picked it up to read during \"quarantime\" not even knowing that the book is primarily about life during and after a worldwide pandemic. But a portion of \"Severance\" does involve Candace's--the protagonist's--life working in an NYC publishing/distribution firm. She ends up going to work every day, despite more and more people sickening with \"Shen Fever,\" an incurable illness contracted by inhaling fungal spores that originated in China. Ling Ma's evocation of the illness is quite good. When people become \"fevered,\" they continue going about their most common activities, such as folding sweaters at a retail store or driving a taxi cab, but they're totally on auto-pilot and are eventually killed or die of exposure, exhaustion. etc. They're like totally non-threatening zombies, yet still chilling, maybe more so for their lack of engagement with the non-fevered. Candace becomes the final employee to flee her office and indeed one of the last to flee New York City, and this really made me think about my own life. How long would I stay in my office if the pandemic got really bad? There seems to be a fine line between duty and habit, as Candace discovers. She tends to stay at the office for lack of a better plan, lured by the promise of a big payday at the end, but when the paycheck finally arrives, there's nowhere to spend it. Eventually Candace bands together with a small group of survivors making their way to Chicago, but, as I imagine might happen in a situation like this, one of the group members, Bob, emerges as a threatening, tyrannical leader from whom Candace must escape. What are the true motives of people who want to be in charge? We hope these motives are altruistic, but too often they aren't. What I most loved about \"Severance\" was how multi-faceted it was. The book wasn't just about office life, and it wasn't 100% post-apocalyptic. There were some lovely sections where Candace recalls life with her parents or fleeting relationships she has with men in the city. It's a book about immigrant life, about fitting in (and not fitting in). A lot of post-apocalyptic novels (\"Dog Stars,\" \"The Road,\" \"Station Eleven\") focus on survival, but there are no hunger games in \"Severance,\" no fight for resources. If you've survived the fever, then you're golden. I liked that freshness in the genre. It seemed to give Ma much more room to write about the other things one would undoubtedly experience in that situation, like loneliness, grief, or memories. After experiencing the Covid-19 epidemic, I can see that some of Ma's speculations are eerily accurate. The breakdown of society can come slowly. People try to keep going about their daily lives. And I really appreciated the braveness of Ma to leave a couple narrative strands open-ended in her conclusion. Some books drag on too long, but \"Severance\" ended right where it should; a great debut.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 22, 2023",
                "reviewTitle": "Nice Book",
                "reviewText": "I enjoyed reading this book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 22, 2021",
                "reviewTitle": "Loved every single page of this book.",
                "reviewText": "Fantastic, funny, intriguing, loved every single page of this book. Totally recommend. Will purchase the author’s other books now. Wow",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PGG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2020",
                "reviewTitle": "A wonderful book",
                "reviewText": "It’s not enough to write that *Severance* is a critique of materialism or deals with millennial angst or even label it as a “zombie book.” Such a review would tempt a potential reader to think there’s something hackneyed about this book or that we’re destined for a violent walk through a well-known land. But there is no cliché here--not even one. Each page exposes such preconceptions and elicits a revelation. While our world seemingly waits for catastrophe or a sudden violent end, other authors jump to provide fodder for the fascination. But Ma warns us of the sickness of sustained, indiscernible, daily loss. She reveals the dangers of the incessant. How does one write about the deadliness of the banal without creating a tedious or boring read? Read it and find out! Because in this wonderful book, Ling Ma succeeds.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanne Sheppard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 15, 2019",
                "reviewTitle": "Brilliant, thoughtful debut",
                "reviewText": "Ling Ma's Severance is narrated by Candace Chen, a millennial living in New York as the world succumbs to an epidemic of Shen Fever, a disease from China spread by fungal spores which cause sufferers to descend into a sort of trance and repeat in their final days the meaningless routines that linger in their memory: \"they could operate the mouse of a dead PC, they could still drive stick in a jacked sedan, they could run an empty dishwasher, they could water dead houseplants.\"The fevered are essentially harmless, so this isn't a zombie apocalypse horror story - it's a quiet, thoughtful novel in which the real threat comes not from the fevered but the survivors, who, in the case of the group Candace joins, predictably descend into cultish behaviours that can only end in trouble.The post-apocalyptic storyline, however, is really only a small part of the book. Interwoven with Candace's experiences after Shen Fever strikes is the story of her relationship with her parents, their move from Fuzhou, China to Utah, and her years living in New York after graduating. In New York she abandons her ambitions to become a photographer and takes a job working in production for Spectra, a firm of publishers. Candace works in the Bible department, doing a job so routine that it sees her plagued by recurring dreams of inadequate paper stock crumpling in printing presses. Candace is oddly comforted by the routine of her job, despite the dubious ethics of sourcing suppliers in China whose staff work in appalling, often dangerous conditions, dying of diseases caused by precious stone processing so that her employer can produce the 'Gemstone Bible', aimed at American teenage girls in the Bible Belt and sold with a semi-precious charm attached.Candace, perhaps partly because of her immigrant roots, is nagged by a slight sense of otherness, and is curiously detached from the world around her - I don't think it's an accident that her first love is photography, an activity which requires her to observe rather than participate, and yet somehow she also barely notices when the world starts to end around her. However, while she doesn't appear to enjoy her job as such, she is strangely comforted by it, as if its very meaninglessness brings a meaning to her life that's otherwise lacking. When others are leaving New York as Shen Fever takes hold, she continues to turn up to work. Eventually, she's the only employee, continuing to send emails and attempting to schedule production tasks long after the rest of her colleagues have died or fled and Spectra's Chinese suppliers have succumbed to Shen Fever themselves.Is Candace, perfectly healthy but turning up day after day in an almost empty city to do a job that no longer really exists, much different from the fevered woman she observes in a clothing store, repeatedly folding the same items over and over again as she rots alive? And when her contract is finally over and she decides to leave New York with a group of fellow millennials, armed with \"bottled water and exfoliating body wash and iPods and beers and tinted moisturiser\" looted from an abandoned WalMart, will she manage to survive in a world without meaning, and avoid succumbing to the deadly Shen Fever which might - just might - be triggered by nostalgia? What might just save Candace, it seems, is her immigrant experience. Candace doesn't feel any real affection for any of the places and things she encounters on her journey across America: for her, the place that triggers those feelings of intense, unnerving nostalgia is her original home city of Fuzhou.This is a novel of complicated ideas, simply written - but it's also often funny. Candace herself has a detached, observational wit, self-deprecating but never performatively so. It's sad too, imbued with a completely unsentimental melancholy. If you're looking for a post-apocalyptic rollercoaster ride of a novel, this isn't that book, but I loved this understated satire of consumerism, missed opportunities, modern living and the immigrant experience, and would definitely look out for more work by Ling Ma.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 27, 2021",
                "reviewTitle": "Beautiful and unsettling",
                "reviewText": "This book is a surprisingly fresh addition to the increasingly-saturated genre of pandemic fiction. The characters are fresh, set in a vivid world of decay.To increase the unease that comes with reading Severance: read it directly after reading Atomic Habits by James Clear.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.45",
                "sellerName": "Zebras Books LLC",
                "sellerRating": "5"
            }
        ]
    }
}