{
    "remaining_requests": 1639,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cloud-Cuckoo-Land-A-Novel/dp/B08TX66JJ7",
    "body": {
        "name": "Cloud Cuckoo Land: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cloud-Cuckoo-Land-A-Novel/dp/B08TX66JJ7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51j7HaVDIoL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Anthony Doerr",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Anthony+Doerr&search-alias=audible"
        },
        "brand": "Anthony Doerr&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 30223,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "AudioFile Magazine’s Best Audiobooks of 2021On the New York Times bestseller list for 19 weeks * A New York Times Notable Book * A Barack Obama Favorite * A National Book Award Finalist * Named a Best of the Year by Fresh Air, Time, Entertainment Weekly, Associated Press, and many more—one of the ten books that appeared on the most lists for 2021“If you’re looking for a superb novel, look no further.” —The Washington PostFrom the Pulitzer Prize-winning author of All the Light We Cannot See, comes the instant New York Times bestseller that is a “wildly inventive, a humane and uplifting book for adults that’s infused with the magic of childhood reading experiences” (The New York Times Book Review).Among the most celebrated and beloved novels of 2021, Anthony Doerr’s gorgeous third novel is a triumph of imagination and compassion, a soaring story about children on the cusp of adulthood in worlds in peril, who find resilience, hope—and a book. In Cloud Cuckoo Land, Doerr has created a magnificent tapestry of times and places that reflects our vast interconnectedness—with other species, with each other, with those who lived before us, and with those who will be here after we’re gone.Thirteen-year-old Anna, an orphan, lives inside the formidable walls of Constantinople in a house of women who make their living embroidering the robes of priests. Restless, insatiably curious, Anna learns to read, and in this ancient city, famous for its libraries, she finds a book, the story of Aethon, who longs to be turned into a bird so that he can fly to a utopian paradise in the sky. This she reads to her ailing sister as the walls of the only place she has known are bombarded in the great siege of Constantinople. Outside the walls is Omeir, a village boy, miles from home, conscripted with his beloved oxen into the invading army. His path and Anna’s will cross.Five hundred years later, in a library in Idaho, octogenarian Zeno, who learned Greek as a prisoner of war, rehearses five children in a play adaptation of Aethon’s story, preserved against all odds through centuries. Tucked among the library shelves is a bomb, planted by a troubled, idealistic teenager, Seymour. This is another siege. And in a not-so-distant future, on the interstellar ship Argos, Konstance is alone in a vault, copying on scraps of sacking the story of Aethon, told to her by her father. She has never set foot on our planet.Like Marie-Laure and Werner in All the Light We Cannot See, Anna, Omeir, Seymour, Zeno, and Konstance are dreamers and outsiders who find resourcefulness and hope in the midst of gravest danger. Their lives are gloriously intertwined, and Doerr’s dazzling imagination transports us to worlds so dramatic and immersive that we forget, for a time, our own. Dedicated to “the librarians then, now, and in the years to come,” Cloud Cuckoo Land is a beautiful and redemptive novel about stewardship—of the book, of the Earth, of the human heart. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Genre-Fiction-Literature-Books/b?ie=UTF8&node=10177"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 52 minutes"
            },
            {
                "name": "Author",
                "value": "Anthony Doerr"
            },
            {
                "name": "Narrator",
                "value": "Marin Ireland, Simon Jones"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 28, 2021"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08TX66JJ7"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,010 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Metaphysical & Visionary Fiction (Audible Books & Originals) #11 in Metaphysical & Visionary Fiction (Books) #105 in Historical Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Emily Layne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCQJHKAYG3G7WJQJWQHRGABDDVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23TH4EDRFVESO?ASIN=B08TX66JJ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2023",
                "reviewTitle": "5.0 out of 5 stars For us whose lives have been changed by books",
                "reviewText": "Cloud Cuckoo Land is an Ancient Greek tale of a man not satisfied with his current existence, so he spends his life trying to find a legendary city in the sky where no one ever suffers or wants for anything. It’s a silly story full of profound lessons and comedic relief - one that both inspires and gives refuge to the lost and the weary.Cloud Cuckoo Land: A Novel follows Cloud Cuckoo Land the Ancient Greek book for over 700 years. It’s nearly lost over and over again to war, to the elements, to egregious acts of man, and to the passage of time. It survives against all odds - and it shapes and connects the lives of 5 main characters: Anna, Omeir, Zeno, Seymour, and Konstance.Despite living in different centuries, the characters all have two things in common:1. They are each born a little different and because of this they struggle to adapt to the world around them.2. Every one of their lives is deeply and irrevocably changed by Cloud Cuckoo Land.——Anna/Omeir - Set in the 15th century at opposing sides of a great war, the Anna and Omeir chapters serve as something of an origin (or, rather, discovery) story for Cloud Cuckoo Land. Full of personal tragedies, adventure, bravery, and hope, Anna’s life story in particular is a profound example of how a book can become a source of strength during times of hopelessness. Without her tenacity, Omeir’s faithfulness, and the early examples of libraries touched upon in these chapters, Cloud Cuckoo Land would never have made it out of the 15th century.Zeno/Seymour - Zeno and Seymour are born generations apart. While the circumstances of their lives are very different, both are at odds with the world around them. Often navigating life restless and alone, it takes them years to stop running and finally find peace and purpose. Their paths cross dangerously at a library in the 21st century, and the events of that day will forever change the lives of everyone involved - as well as the trajectory of the book Cloud Cuckoo Land.Konstance - In the 22nd century, humans have destroyed the planet and are trying to start over on a new Earth called Beta Oph2. Konstance and her parents are a part of this mission. Guided by an AI named Sybil, they spend most of their days inside of the library on their ship called The Argos, researching and preparing for humanity to live in the new world. The fate of Cloud Cuckoo Land once again lies in the hands of a young girl who in turn comes to rely on the ancient story as a sort of lighthouse beaconing her home.And then, of course, there is Cloud Cuckoo Land itself. Doerr doesn’t just write about the ancient tale - he writes the entire book into this novel. By the time readers are finished, they will have essentially read four books in one: Anna/Omeir, Zeno/Seymour, Konstance, and Cloud Cuckoo Land. Chapter by chapter, Doerr alternates timelines and points of view. Piece by piece, the individual stories puzzle together over time just as they did in All the Light We Cannot See. While not quite as lyrical as All the Light, Doerr’s imagery and prose are still captivating.There are many lessons to be found within this book, but above all, Cloud Cuckoo Land: A Novel is an incredible, slow-burning love story. It’s a story about the love of reading, and the deep appreciation for those who make it possible. It is a lot and it won’t be for everyone. It didn’t click for me until I was about 20% of the way through. But if reading has changed you, or even saved you, then you might find your love story reflected in this too.",
                "reviewVotes": "108 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "By the Book",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRB45SIA567DZLX5ZSX4JIUON5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYO5DWH3MX01F?ASIN=B08TX66JJ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2021",
                "reviewTitle": "5.0 out of 5 stars ‘Cloud Cuckoo Land’ weaves history, myth into ‘paean to books’",
                "reviewText": "Five characters living in three different centuries and four different places are all saved by a story. A story that allows them to “slip the trap” of their fear or misery. Anthony Doerr tells their stories in ‘Cloud Cuckoo Land,’ a book that he calls a “paean to books.”The ‘Cloud Cuckoo Land’ in the novel is a 1st century tale written by Diogenes that tells the story of Aethon, a foolish shepherd who leaves home in search of Cloud Cuckoo Land, a fictional place where there is no pain and turtles walk around carrying honeycakes on their backs. On his journey he is turned into a donkey, a fish, and a crow.Although there is no actual ‘Cloud Cuckoo Land,’ there was a 1st century writer named Antonius Diogenes. Moreover, there are hundreds, perhaps thousands, of works that we know of but have been lost, some of them comedies about men being transformed into donkeys. Doerr uses this imagined tale to tie his characters together, even though they are separated by geography and time.Konstance, 14 years old, lives aboard The Argos, a spacecraft launched 65 years earlier headed to a distant planet that is to be man's new home. Zeno is 80 years old and leading a group of fifth-graders in a production of ‘Cloud Cuckoo Land’ at the public library. Seymour is a young man who is intent on placing a bomb in that library. Anna is a young girl that works in an embroidery shop with her sister in 15th century Constantinople. Omeir is a Bulgarian boy who is drafted by Sultan's army in their attack on Constantinople.Each character is abandoned or outcast and each is saved by a story. Konstance is the last human left alive aboard the Argos. Zeno is a gay man in rural Idaho in the mid-20th century; Seymour is autistic; Anna is an orphan; Omeir is born with a cleft lip.Anna discovers a codex of ‘Cloud Cuckoo Land’ in an abandoned priory. She and Omeir escape Constantinople as it falls to the Ottomans. They view the book as a talisman that gives them luck in their escape and even heals one of their sons when he has a fever.Zeno has spent years teaching himself ancient Greek and translating ancient works when a lost story, ‘Cloud Cuckoo Land’ is discovered in the Vatican library. Zeno finds joy in the ancient tales and is elated by the discovery. Seymour, regretful of his crimes, assembles Zeno’s work on Aethon’s tale into a book, ‘Cloud Cuckoo Land.’ In doing so, he finds some redemption.Konstance, alone on the Argos, recalls the stories of the foolish shepherd that her father told her and searches the ship’s library for the stories. In doing so, she discovers a secret that leads to her escape.What links all these characters is a story. A story that was once lost and has been found. A story that saves each of their lives. A story that allows them to “slip the trap” of their heartbreak or existential misery. A story that allows them to live inside of it for a few precious moments and be content, entertained, and remember the loved ones they have lost.The alternating chronologies and main characters make this book compelling. And although it’s over 600 pages, you will find yourself finishing it in just a few days. The characters are endearing, especially Zeno and Anna.Anna, who is so young and so fierce, who trades stolen wine for reading lessons, is willing to brave any challenge to keep herself and her sister alive. Zeno, the sweet orphaned boy who is both foreign and a “sissy,” volunteers for the army to honor his father, who died in WWII, returns from a POW camp to dutifully cares for his dying guardian, a selfish woman who offers him only shelter, never love.Even six weeks after finishing the novel, I find myself still thinking about these characters and their moving stories.This love-letter to stories and books is beautiful and enthralling, a masterpiece, and has been predicted to be in the running for next year's Pulitzer. If you love books, you will love this book.",
                "reviewVotes": "105 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTERADTIPAZ6T3YZB5JZC4JTUKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OBQXL8O0N9GO?ASIN=B08TX66JJ7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Cloud Cuckoo Land",
                "reviewText": "The author has a wonderful way of weaving this story across centuries. The characters are lovable and believable. A good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christie Murray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG5GPJOTDM6YBL6JPQQFLGWNXGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I3YIGF4CJJ8A?ASIN=B08TX66JJ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars An Ode to the Power of Books",
                "reviewText": "I have tears streaming down my face as I finish what may well be my favorite book of all time. I have for days now been transported to far off places and times and met and have become a part of the lives of characters I will not soon forget. This book is why I am passionate about reading. It is everything I hope for each time I start a new one but so few are the heart-searing gems that this one is. Many years from now I am sure I will still reflect back on these stories and long for another book like this one to come along.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr O.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 30, 2023",
                "reviewTitle": "splendid storytelling",
                "reviewText": "I liked this book for many reasons, although I could not read Doerr’s last book. But this one has all the right material: Aristophanes, comedy, a few brushes with tragedy, the same story told several different ways in several different eras and countries. The language is fun — Doerr likes to plays with words, not something I noticed in his previous book. The characters are all ages just as the story is ageless. It is ok not to be a hero, but it is ok to be a hero if someone needs a hero. People need to survive but not everyone. Life is about surviving, maybe not everyone but a good portion to start again and maybe learn from mistakes of the past. If books from the past survive, or even scraps of the past survive, that should be enough. Memory, knowledge, practical skills, language, these are tools we need to survive. Sacrifice of self is only worth it if survival of the species is at stake. And you’d better be right in your judgment of what is worthwhile. Otherwise you’ve thrown away something precious that might have preserved life.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pablo B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 13, 2022",
                "reviewTitle": "¡ENTRA EN LA LISTA DE MIS NOVELAS FAVORITAS!",
                "reviewText": "Me encantó esta novela, ¡No quería acabarla de leer!Novela en la que la historia de varios personajes se entrelazan den distintos puntos del tiempo.La novela está bien escrita y es sumamente fácil de leer. Realmente te lleva a otro mundo.¡No te vas a arrepentir de leerla, recomiendo 100%!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jairo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 12, 2022",
                "reviewTitle": "Leveza mesmo em tempo de guerra.",
                "reviewText": "Anthony Doerr mais uma vez nos guiando com leveza (mesmo abordando uma ou duas guerras) numa (ou mais) aventura (s) com erudição e classe. Para ler sem pressa.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alifiya Vagh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 30, 2023",
                "reviewTitle": "What a masterpiece!",
                "reviewText": "What a captivating masterpiece is it! Three different stories in three different time periods spanning hundred of years with so many layers and how they all come together to create this spectacular book is amazing. I loved all the characters, and they felt so real. Beautiful prose. Descriptive, yet rich, and emotional. I am amazed at the brilliant mind of Anthony Doerr to have pictured this imagery.Initially, it was a little confusing but I persevered through it and was delighted to see how all the threads of the different stories weave together to create the fabric of the picturesque Cloud Cuckoo Land.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valerie Fawcett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2024",
                "reviewTitle": "A future classic in my view",
                "reviewText": "For me this novel has everything: sumptuous writing, magnificent plotting, fascinating characters and a quality which puts it above anything I have read recently which isn't already a classic. I enjoyed All the Light We Cannot See but I think this is another step up. I am amazed it hasn't won more prizes. Often, in novels where several strands of a story are visited in turn, I find that one or more are less interesting than the others. Not with this one; I was simultaneously wishing the last chapter hadn't ended where it did, but looking forward to picking up the next thread again. I don't think it is perfect; there are some things about the end I found a little contrived, but perfection is neither attainable, nor perhaps desirable as it would prompt no discussion!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}