{
    "remaining_requests": 1486,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Warriorborn-Cinder-Spires-Novella-Book/dp/B0CD8B221X",
    "body": {
        "name": "Warriorborn: A Cinder Spires Novella: The Cinder Spires, Book 1.5",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Warriorborn-Cinder-Spires-Novella-Book/dp/B0CD8B221X",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61JLD6-J TL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jim Butcher",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Jim+Butcher&search-alias=audible"
        },
        "brand": "Jim Butcher&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3088,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the #1 New York Times-bestselling author of the Dresden Files comes an action-packed all-new fantasy adventure set in the Cinder Spires universe.Benedict Sorellin-Lancaster hasn't even broken in his lieutenant's insignia when he's summoned to meet with the Spirearch of Spire Albion himself for a very special—and very secret—purpose. The Spirearch needs Benedict to retrieve a bag he's \"misplaced\" on the Colony Spire known as Dependence, which has strangely cut off all contact with the outside world. It's a delicate mission at best, a potential bloodbath at worst.To this end, the Spirearch has supplied Benedict with backup in the form of three Warriorborn. But unlike the courageous lieutenant, this trio has formerly used its special gifts for crime, carnage, and outright bloody murder. And all of them were caught and imprisoned because of Benedict. Now, if they behave—and make it back alive—they'll go free.But when the odd squad reaches Dependence, they soon discover something waiting for them: a horrific weapon that could shatter the balance of power among the Spires. And Benedict will have to bring his own Warriorborn skills to bear if he, his team, and Spire Albion are to have any hope of survival . . . Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "3 hours and 1 minute"
            },
            {
                "name": "Author",
                "value": "Jim Butcher"
            },
            {
                "name": "Narrator",
                "value": "Euan Morton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 19, 2023"
            },
            {
                "name": "Publisher",
                "value": "Podium Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0CD8B221X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,072 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #6 in Steampunk Science Fiction (Audible Books & Originals) #13 in Steampunk Fiction #38 in Gaslamp Fantasy (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bruce Parrello",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEA7JX4C2YEEFNV3K4H3YD6V6XMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FL1AQTSNS7IC?ASIN=B0CD8B221X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars A wonderful gaslamp fantasy with cats",
                "reviewText": "This is a grace note to the Cinder Spires series, which takes place in a steampunk-like fantasy world of fantastic flying ships, magic crystals, and cats. While it stands alone, the characters will be familiar if you have read the series itself. This story concerns a simple reconnaissance mission that goes horribly awry. The protagonist is a genuine hero, which makes him refreshing in this day and age, and is forced to use his wits to survive against impossible odds, which is the heart of any good adventure story. Though the world is alien, Butcher skillfully gives you all the information you need to understand without resorting to heavy-handed exposition.Plus there are the cats. The cats in Cinder Spires are fantastic characters, arrogant, quirky, and all-too-observant, and they elevate the story from a good adventure to a great one.Highly recommended!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave Perry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYFIDIWFPNXSU5XCUR5CRPW445Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X0BQ68CB9DRU?ASIN=B0CD8B221X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars My First Jim Butcher Novel!",
                "reviewText": "Wow! That is the first word that comes to mind when I think of this novella I purchased of a prequel story written and published by Mr Butcher earlier this year!I have not read either one of the two books that he has written about these characters or the stories they come from!But that is about to change because I've already ordered the 1st book about The Cinder Spires!And let me tell you-- this 136 page novella about Benedict & the Spire Albion is absolutely terrific! I don't want to spoil any of the fun for you, but when it comes to Fantasy novels this book is as good as it gets! I'm not saying it's in a league with Harry Potter, but I have not read the 1st full novel in this particular series yet!But I can certainly say that Jim Butcher has really created a wonderful set of characters, and some of the most brilliant storytelling! And if you are an animal lover, you will absolutely love the way the man weaves kittens/ cats into this story!This is one of the finest short stories I've read in a long while-- and I am so excited about reading both of the full novels Mr Butcher has published concerning these characters!Thanks for the entertaining story, Jim Butcher!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Nolan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEFP7YEI3IYSHGOJVLZWKSZCGSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W35RW47WKMGD?ASIN=B0CD8B221X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Good Re-introduction to the Cinder Spires World",
                "reviewText": "Just as Butcher eased back into the \"Dresden Files\" with a novella,\"Warriorborn\" leads off his return to the world of the \"CinderSpires\".Benedict Sorellin-Lancaster is a \"Warriorborn\" lieutenant in theservice of Spire Albion. It's been so long since the first CinderSpires book that I can't recall if the Warriorborn were introducedthere or not, but basically they are semi-weres: stronger & fasterthan normal humans, and also more subject to impulsive and instinctualbehavior. War is brewing in the setting, and the Spirearch isconcerned that he hasn't received vital intelligence from the newAlbion colony at Spire Dependence, so he sends Benedict and a \"dirtydozen\" team of Warriorborn criminals to asses the situation and dowhatever it takes to retrieve a dispatch case.Arriving by airship and dropping in stealth Benedict's team findsthat it's not a case of the Spirearch's agent being held or killed:The whole spire has been massacred by unknown and apparentlyimpossible means. Perhaps the war has started, but as far as anyoneknows, Spire Aurora has no weapon that could have done this. Asit develops, there are witnesses who it is vital to bring back tothe Spirearch along with the dispatches, wherever they are, butthat won't be easy in the hellscape of a ruined Spire, the hostilenative life of the Spires setting, and enemy action. At leastBenedict understands *that* part of it..This was a very satisfying return to a setting I really enjoy. Iwould say the only nit was a speech given by Benedict's (convict)second-in-command, an excellent character, which did not have thepayoff I expected later.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jimmy white",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPGM5FCNEKVCNTSMIPBXB6S3HGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IA3MVNUY5YVN?ASIN=B0CD8B221X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars my wife can never put his books down",
                "reviewText": "Warriorborn: A Cinder Spires Novella\" is yet another captivating addition to Jim Butcher's literary repertoire, and it continues to prove why he is a master storyteller. As an avid reader of Butcher's works, I find myself consistently drawn into the rich and imaginative worlds he creates, and Warriorborn is no exception.This novella, set in the intricate universe of The Cinder Spires, is a delightful exploration of characters and events that adds depth to the overarching narrative. Butcher's ability to craft compelling and multifaceted characters shines through once again, making it easy to become emotionally invested in their journeys.What I appreciate most about Jim Butcher's writing is his unparalleled skill in blending action, intrigue, and a touch of humor. Warriorborn keeps the pages turning with its fast-paced plot, unexpected twists, and a healthy dose of Butcher's signature wit. It's a testament to his storytelling prowess that each book, including this novella, has the power to both entertain and leave me eagerly anticipating the next installment.Jim Butcher has a unique talent for creating worlds that not only transport readers but also keep them happily immersed in the story. Warriorborn is a perfect example of why I turn to his books when I want a satisfying blend of excitement, mystery, and a touch of magic. If you're a fan of Jim Butcher's previous works, you won't be disappointed with Warriorborn—it's another gem in his literary crown that will keep you both happy and intrigued from start to finish.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lauren R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZSKB3TK4PUMWEQHCYVWAY6MB4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWLHQE2KX2Q26?ASIN=B0CD8B221X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Jim Butcher Hits Another Home Run!",
                "reviewText": "I hate spoilers, so if that's what your looking for, read a different review. I will say this book is everything you want and expect from Jim Butcher. Quality writing all the way, enticing and riveting story telling, full character development, and a dose of humor in all the right places. If you are a Butcher fan, this is a MUST read. If you aren't, you should be and will be after reading the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Young",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI7X3TQLZFJWAMAFXVLEZ2UUSHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TEZFRZUIGN75?ASIN=B0CD8B221X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Butcher doesn't disappoint!",
                "reviewText": "I have to start by saying Jim Butcher is my favorite author, so I am slightly biased. That being said, this was a delightful addition to the Cinder Spires world and narrative. Can't wait to read The Olympian Affair!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee Rogers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 19, 2023",
                "reviewTitle": "A brilliant morsel",
                "reviewText": "This is a small vignette but ever so well written. I adore the world of the Cinder Spires and have waited long for this, and hopefully not too much longer for book 2 The Olympian Affair. Benedict is one of my favourite characters and it was a delight to follow him on his adventure. It does not entirely satiate though, I want more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose Belluga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 26, 2024",
                "reviewTitle": "Buena pero breve",
                "reviewText": "Interesante y trepidante, pero se acaba rápido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 21, 2023",
                "reviewTitle": "An interlude. But with more questions than answers, but fun. Buy it!",
                "reviewText": "A wonderful addition to the Cinder Spires universe. An adventure with some new characters with most of our protagonists from the Aeronaut's Windlass in the background, we have Benedict as the lead in this novella. Lots of new questions arise and the world of Cinder Spires is filled in. Cats make an appearance as do new monsters of various sorts. Benedict has to lead a squad not of his own choosing. Fun, definitely worth reading especially as we wait for the Olympian Affair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on September 25, 2023",
                "reviewTitle": "A story worthy of Cats",
                "reviewText": "Finally, another Cinder Spires story. And one that will perfectly tie the two main parts together. The tale combines mystery, tragedy, and horror as Benedict investigates a silent Spire.A tale worthy of Butcher's prowess",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 31, 2023",
                "reviewTitle": "A fun light romp with Benedict",
                "reviewText": "Punchy action that fills in the story right before Cinder Spires book 2. And there are cats! An enjoyable read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}