{
    "remaining_requests": 1644,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Post-Human-Omnibus-audiobook/dp/B00U1S453E",
    "body": {
        "name": "The Post-Human Omnibus: Books 1-4",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Post-Human-Omnibus-audiobook/dp/B00U1S453E",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51BRm8O7YSS.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "David Simpson",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=David+Simpson"
        },
        "brand": "David Simpson",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 7292,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "1. Sub-Human Before he was Oldtimer, he was Craig Emilson, a young doctor sucked into military service at the outbreak of World War III. Enlisting to become a Special Forces suborbital paratrooper, Craig is selected to take part in the most important mission in American military history - a sortie into enemy territory to eliminate the world's first strong artificial intelligence. The mission is only the beginning of Craig's story and the story of humanity as well as they accelerate toward a world that is post-human. If you're already a fan of the smash-hit Post-Human Series, this prequel to Post-Human, Sub-Human, will answer the previously unanswered questions of how the post-human world came to be. And if you're new to the series, Sub-Human will serve as an engrossing introduction to a possible future that has enraptured tens of thousands of listeners! 2. Post-Human The future should have been perfect. Microscopic robots known as nans could repair any damage to your body, keep you young by resetting your cellular clocks, and allow you to download upgrades like intelligence, muscle strength, and eyesight. You were supposed to be able to have anything you wanted with a simple thought, to be able to live forever. But when a small group of five terraformers working on Venus return to Earth, they discover that every other human in the solar system has been gruesomely murdered. Now James Keats and his four companions must discover what happened to the rest of humanity and fight back if they wish to avoid the same horrifying fate.3. Trans-Human In this sequel to Post-Human, humanity will be forced to face a future more advanced than it could have imagined if it wants to survive. Nineteen months have passed since the AI turned against humanity and was subsequently destroyed. In the meantime James Keats has turned over the AI's powers to a nonintelligent, easily controlled operating system. He and Thel have left the planet and spent six months vacationing on Venus, which has been terraformed without the consent or knowledge of the Governing Council. The AI has been deleted, but the message it sent out into the abyss of space in search of a companion has been answered. An alien force dwarfing the Earth is on its way to find out why the AI has stopped communicating. Keats and company can only assume its intentions will be hostile when it finds out the truth.4. Human Plus Human Plus is the fourth story in the smash hit science-fiction series. Not exactly a sequel, not exactly a prequel, Human Plus will defy expectations. No matter what you thought was coming next, you're in for a surprise! Just one caution: When you're finished you're going to want to share the surprises with everyone online.... Please don't! Please respect future listeners, and let them enjoy the surprises just as much as you did! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            },
            {
                "name": "Technothrillers",
                "link": "https://www.amazon.com/Technothrillers-Thrillers-Mystery-Books/b?ie=UTF8&node=10497"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "24 hours and 54 minutes"
            },
            {
                "name": "Author",
                "value": "David Simpson"
            },
            {
                "name": "Narrator",
                "value": "Ray Chase"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 17, 2015"
            },
            {
                "name": "Publisher",
                "value": "Podium Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00U1S453E"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#96,001 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #285 in Science Fiction Anthologies & Short Stories #377 in Technothrillers (Audible Books & Originals) #944 in Science Fiction Anthologies (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTAVEFDEVVBOIEPORBJQHKU57JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7JZ8KXTR3NF0?ASIN=B00U1S453E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2015",
                "reviewTitle": "5.0 out of 5 stars Great science fiction series!",
                "reviewText": "There are first four books in this series.Book 1 - Sub-HumanThis book begins with an interview with Presidential nominee and Senator Morgan,where he raises up the threat of a strong conscious A.I. that will take over beforestorming off.Then we cut to Dr. Craig Emilson receiving a nano-infusion treatment from his wifeSamantha before going on a mission under Special Forces Command to SpaceportAmerica on an extraction mission which does not go as planned.He falls and wakes up fourteen years later in a secret hidden faculty where he findsthat Samantha is remarried to the old professor Aldous Gibson (although neither areold now - they have used the tech to keep themselves young and now, they arecalled post human as is Craig and wanted by the government. Craig is angry andstalks off. But soon he is needed as the faculty is attacked by Chinese A.I. andhe is injected with an experimental A.I. and sent to Universe 66, where he finds himselfon the Titanic and tries to save it before governmental military or Purists as theycall themselves, try to stop him. Then the A.I. inside him sends him to Universe 332,where it is September 11, 2001. Will he try to change the past and can he fightoff the purists? Or will he make a fatal error?Has two epilogues - the first is interesting and the second sets up the next book.Book 2 - Post-HumanJames Keats is a genius and he goes on a mission with Craig Emilson, whom hecalls Old-Timer, and others. Then their nanotech is over-loaded and knocking themout and offline. Soon they find that everyone that had been connected to the Internetis dead and the ones remaining are being hunted by the A.I. and they must unitewith the Purists to save what is left of mankind.Book 3 - Trans-HumanThis one is set 19 months after Post-Human.Thel and James are vacationing on the terraformed Venus (that James did) and Richand Old Timer (Craig) stop by for a visit when James is contacted by Chief AldousGibson to come to Earth where they discover that an alien race of machines arecoming into their solar system. Now they must race and stop them.Book 4 - Human PlusTold from first person POV.A professor is trying to break it off with his girlfriend and discovers that she ismore than she appears to be and that his world is not what it seems.Most of the chapters are in large print but some (ex. Chapter 1) paragraphs arein small print. Must read!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Percephonee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPWFPHDCFL6CRXDUXFWQBIBGFWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MN887TYDA7FP?ASIN=B00U1S453E",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2015",
                "reviewTitle": "4.0 out of 5 stars Very interesting Futuristic Sci-Fi Story",
                "reviewText": "Pros:Good overall story arcGreat details bring the story to lifeConcepts are realistic; stretches your thinking about the applications of VI and nano technology developmentCharacter dialogue provides recaps and hints of events in previous books, so that a reader can enjoy any of the books as either stand alone novels, or can read the books in any order. They are written in such a way that you can pick up and follow the story from just about any point in the seriesGood continuityNo plot holesVery few spelling/grammatical errors (I only found one in the whole series, in the edition I have purchased)Cons:Very little character development (excluding the development and changing of character relationships demonstrated between the book \"Sub-Human\" and \"Post-Human\"). Because of this, it's a little like reading a console or PC game, where the story itself will change and grow, but the characters (players) remain stagnant.Can be a bit jargon-y, and although the jargon is explained, it takes up valuable story space and time.Sometimes, the cerebral aspects overshadow the point of the story; it's so smart on concepts that the story can be lostPredictable mode of delivery: Things are wonderful, things get bad, things get worse, Huge revelation is made, Things are desperate, Impossible odds are overcome, happy ending.Warning: Mild SpoilersI really enjoyed this series, despite the cons I listed. For some reason, the story feels a bit..hollow to me. I don't know if it's the lack of character development or what, but still, it's not enough to keep me from enjoying the series or not recommend it. Even so, the heroes are always triumphant at the end of each book, and they are familiar as old friends now. I resonate with Old-Timer, I feel I have been around as long as he is.I love the thought -provoking concepts raised; ethical treatment of AIs, the purpose of humanity, the imperative of human reproduction, the implications of immortality, the ethics of how we procure our food. There are even subtle hints as to how intelligent humans really are since nans and the AI is doing most of the work for them; (At one point, this is in book 5, a character has no idea what a fever is, and has never heard of pneumonia.) Would humanity survive without their new tech crutch?I love how smart this series is, I love the questions it asks and the way it paints a portrait of a possible future. This is definitely worth a read or two, and I will be keeping up with the series.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vhyshious",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD2OXTCEQ5QXOXV4MDPMXGTXP4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTGF26MXCC8YD?ASIN=B00U1S453E",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 6, 2015",
                "reviewTitle": "5.0 out of 5 stars read all 5 books in less than 48 hours!",
                "reviewText": "Well, on friday I had 2 teeth pulled, so I was in a little pain, and couldn't sleep that evening. So by 11pm, of course I was browsing my bookbub recommendations and found the posthuman 1-4 and said to myself \"self, these seem like just the books to read to distract from the pain, let's embark on this adventure!\"By Sunday mid-afternoon, I was done with book 5 and and and my husband asks me \"what books have had you so engrossed all weekend? They must have been really good cause I haven't seen you like this in a while.\" So there I was trying to explain the books to my husband. So he says \"Very well hun, carry on\".It WAS very immersive. Mostly because I was laying in the dark, reading on my kindle on the black with white letters setting, so it kept the room really dark. Reading it this way allowed for my imagination to really follow the story, to shape the world inside my mind with no distractions. The characters just came alive inside my head. It was riviting.And the book served its initial purpose, it really took my mind off the pain, better than any pain medicine ever could have.So on to my review of the books.Book 1-4 I got in a bundle, so I just read them in one go like a giant book. I wish book 3 would have been first, because it was really wierd to read it right in the middle, but I completelty understand why you can't read that book first...holy spoiler book! These books have great character development and really nice story lines. Each book has something new going on while building onto the last story. I immediately bought book 5 after finishing the bundle and loved it too.I can't wait for book 6. I will recommend these books to all my friends and family.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 18, 2023",
                "reviewTitle": "None",
                "reviewText": "A fantastic service",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miguel Ângelo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 22, 2017",
                "reviewTitle": "Vale a leitura. Muito divertido.",
                "reviewText": "Muito divertido. No último livro a qualidade decai um pouco, mas ainda vale.Mas nos 2 primeiros, principalmente, o futuro imaginado é bem interessante e usa as promessas tecnológicas de hoje como itens imprescindíveis no mundo do futuro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heena",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 22, 2017",
                "reviewTitle": "The future of humanity is nicely portrayed. The entire series was filled with the ...",
                "reviewText": "Post Human (1 to 4) is the different kind of sci-fi book focusing on human body mutation. The future of humanity is nicely portrayed. The entire series was filled with the future technology that was out of imagination for me. If someone makes a movie on this series it will be far better and action packed than star wars series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Garret Dent",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 20, 2015",
                "reviewTitle": "5 stars are not enough!",
                "reviewText": "I wish I could write as eloquently as this author does. To be honest, I'm in awe of his talent. The books had me right from the very first page! I have to admit that I lost sleep for a while, rabidly reading the post human series at every opportunity, late at night, and when I should have been doing other things (important real life things like .... work). After reading these first 4 books, I quickly bought Inhuman and devoured it too! Along with some of the works of Azimov, Clark, Herbert, Bear, and Zahn, your series rates as one of the best that I've read in over 40 years of sci-fi. I'm looking forward to many more years of reading your work. Wish I could give you more than 5 stars - you deserve it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 11, 2016",
                "reviewTitle": "Un libro aceptable de ciencia ficcion con sus mas y sus menos...",
                "reviewText": "Es una recopilacion de una saga de ciencia ficcion inglesa que no esta completa pero tampoco se queda en el aire en el ultimo libro.La serie va 2-3-1-4 en orden de publicacion y el que, a mi parecer, se deberia seguir. El estilo va de menos a mas, siendo los ultimos libros los mas elaborados. Aun así hay veces que el autor peca de inconsistente al explicar erroneamente situaciones con un estilo racional aplicando leyes fisicas y conceptos actuales, pero quitando eso, es un libro recomendable.Cabe mencionar que amazon me ofrecio este libro a 0€ por una promocion por lo tanto mis expectativas no eran altas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}