{
    "remaining_requests": 1679,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Station-Eleven-Emily-John-Mandel/dp/0804172447",
    "body": {
        "name": "Station Eleven: A Novel (National Book Award Finalist)",
        "price": "$11.01$11.01",
        "originalPrice": "",
        "rawPrice": 11.01,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Station-Eleven-Emily-John-Mandel/dp/0804172447",
        "soldBy": {
            "sellerID": "A2UN8CSYZLK610",
            "name": "WorthWhile Reads",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2UN8CSYZLK610&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41pTpWV5CfL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31RkFqaFtsL.jpg",
            "https://m.media-amazon.com/images/I/51gqBhJGlOL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emily St. John Mandel",
            "link": "https://www.amazon.com/Emily-St-John-Mandel/e/B002BMMGK2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "bookmasters444",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 63318,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A National Book Award Finalist • A PEN/Faulkner Award Finalist • One of the Best Books of the Year: The Washington Post, San Francisco Chronicle, Chicago Tribune, Buzzfeed, and Entertainment Weekly, Time, Milwaukee Journal Sentinel, Minnesota Public Radio, The Huffington Post, BookPage, Time Out, BookRiot “Station Eleven is so compelling, so fearlessly imagined, that I wouldn’t have put it down for anything.” —Ann Patchett “A superb novel . . . [that] leaves us not fearful for the end of the word but appreciative of the grace of everyday existence.” —San Francisco Chronicle “Deeply melancholy, but beautifully written, and wonderfully elegiac . . . A book that I will long remember, and return to.” —George R. R. Martin“Absolutely extraordinary.” —Erin Morgenstern, author of The Night Circus “Darkly lyrical. . . . A truly haunting book, one that is hard to put down.\" —The Seattle Times “Tender and lovely. . . . Equal parts page-turner and poem.”—Entertainment Weekly “Mesmerizing.” — People “Mandel delivers a beautifully observed walk through her book’s 21st century world…. I kept putting the book down, looking around me, and thinking, ‘Everything is a miracle.’”—Matt Thompson, NPR “Magnificent.” —Booklist “My book of the year.”—Karen Joy Fowler, author of We Are All Completely Beside Ourselves “Unmissable. . . . A literary page-turner, impeccably paced, which celebrates the world lost.” —Vulture “Haunting and riveting.”—Milwaukee Journal Sentinel “Station Eleven is the kind of book that speaks to dozens of the readers in me—the Hollywood devotee, the comic book fan, the cult junkie, the love lover, the disaster tourist. It is a brilliant novel, and Emily St. John Mandel is astonishing.” —Emma Straub, author of The Vacationers “Think of Cormac McCarthy seesawing with Joan Didion. . . . Magnetic.” —Kirkus (starred)“Even if you think dystopian fiction is not your thing, I urge you to give this marvelous novel a try. . . . [An] emotional and thoughtful story.” —Deborah Harkness, author of The Book of Life“It’s hard to imagine a novel more perfectly suited, in both form and content, to this literary moment. Station Eleven, if we were to talk about it in our usual way, would seem like a book that combines high culture and low culture—“literary fiction” and “genre fiction.” But those categories aren’t really adequate to describe the book” —The New Yorker“Audacious. . . . A book about gratitude, about life right now, if we can live to look back on it.\" —Minneapolis Star-Tribune“A surprisingly beautiful story of human relationships amid devastation.” —The Washington Post “Soul-quaking. . . . Mandel displays the impressive skill of evoking both terror and empathy.” —Los Angeles Review of Books“A genuinely unsettling dystopian novel that also allows for moments of great tenderness. Emily St. John Mandel conjures indelible visuals, and her writing is pure elegance.” —Patrick deWitt, author of The Sisters Brothers“Possibly the most captivating and thought-provoking post-apocalyptic novel you will ever read.” —The Independent (London)“A firework of a novel . . . full of life and humanity and the aftershock of memory.” —Lauren Beukes, author of The Shining Girls“One of the best things I’ve read on the ability of art to endure in a good long while.” —Tobias Carroll, Electric Literature“Will change the post-apocalyptic genre. . . . This isn’t a story about survival, it’s a story about living.” —Boston Herald “A big, brilliant, ambitious, genre-bending novel. . . . Hands-down one of my favorite books of the year.” —Sarah McCarry, Tor.com“Strange, poetic, thrilling, and grim all at once, Station Eleven is a prismatic tale about survival, unexpected coincidences, and the significance of art.” —Bustle, “Best Book of the Month”“Disturbing, inventive and exciting, Station Eleven left me wistful for a world where I still live.” —Jessie Burton, author of The Miniaturist About the Author EMILY ST. JOHN MANDEL's five previous novels include The Glass Hotel and Station Eleven, which was a finalist for a National Book Award and the PEN/Faulkner Award for Fiction and has been translated into thirty-five languages. She lives in New York City. Excerpt. © Reprinted by permission. All rights reserved. Jeevan’s understanding of disaster preparedness was based entirely on action movies, but on the other hand, he’d seen a lot of action movies. He started with water, filled one of the oversized shopping carts with as many cases and bottles as he could fit. There was a moment of doubt on the way to the cash registers, straining against the weight of the cart—was he overreacting?—but there was a certain momentum now, too late to turn back. The clerk raised an eyebrow but said nothing. “I’m parked just outside,” he said. “I’ll bring the cart back.” The clerk nodded, tired. She was young, early twenties probably, with dark bangs that she kept pushing out of her eyes. He forced the impossibly heavy cart outside and half-pushed, half-skidded through the snow at the exit. There was a long ramp down into a small park-like arrangement of benches and planters. The cart gained speed on the incline, bogged down in deep snow at the bottom of the ramp and slid sideways into a planter. It was eleven twenty. The supermarket closed in forty minutes. He was imagining how long it would take to bring the cart up to Frank’s apartment, to unload it, the time required for tedious explanations and reassurances of sanity before he could return to the grocery store for more supplies. Could there be any harm in leaving the cart here for the moment? There was no one on the street. He called Hua on his way back into the store. “What’s happening now?” He moved quickly through the store while Hua spoke. Another case of water—Jeevan was under the impression that one can never have too much—and then cans and cans of food, all the tuna and beans and soup on the shelf, pasta, anything that looked like it might last a while. The hospital was full of flu patients and the situation was identical at the other hospitals in the city. The ambulance service was overwhelmed. Thirty-seven patients had died now, including every patient who’d been on the Moscow flight and two E.R. nurses who’d been on duty when the first patients came in. The shopping cart was almost unmanageably heavy. Hua said he’d called his wife and told her to take the kids and leave the city tonight, but not by airplane. Jeevan was standing by the cash register again, the clerk scanning his cans and packages. The part of the evening that had transpired in the Elgin Theatre seemed like possibly a different lifetime. The clerk was moving very slowly. Jeevan passed her a credit card and she scrutinized it as though she hadn’t just seen it five or ten minutes ago. “Take Laura and your brother,” Hua said, “and leave the city tonight.” “I can’t leave the city tonight, not with my brother. I can’t rent a wheelchair van at this hour.” In response there was only a muffled sound. Hua was coughing. “Are you sick?” Jeevan was pushing the cart toward the door. “Goodnight, Jeevan.” Hua disconnected and Jeevan was alone in the snow. He felt possessed. The next cart was all toilet paper. The cart after that was more canned goods, also frozen meat and aspirin, garbage bags, bleach, duct tape. “I work for a charity,” he said to the girl behind the cash register, his third or fourth time through, but she wasn’t paying much attention to him. She kept glancing up at the small television above the film development counter, ringing his items through on autopilot. Jeevan called Laura on his sixth trip through the store, but his call went to voicemail. “Laura,” he began. “Laura.” He thought it better to speak to her directly and it was already almost eleven fifty, there wasn’t time for this. Filling the cart with more food, moving quickly through this bread-and-flower-scented world, this almost-gone place, thinking of Frank in his 22nd floor apartment, high up in the snowstorm with his insomnia and his book project, his day-old New York Times and his Beethoven. Jeevan wanted desperately to reach him. He decided to call Laura later, changed his mind and called the home line while he was standing by the checkout counter, mostly because he didn’t want to make eye contact with the clerk. “Jeevan, where are you?” She sounded slightly accusatory. He handed over his credit card. “Are you watching the news?” “Should I be?”“There’s a flu epidemic, Laura. It’s serious.”“That thing in Russia or wherever? I knew about that.”“It’s here now. It’s worse than we’d thought. I’ve just been talking to Hua. You have to leave the city.” He glanced up in time to see the look the checkout girl gave him. “Have to? What? Where are you, Jeevan?” He was signing his name on the slip, struggling with the cart toward the exit, where the order of the store ended and the frenzy of the storm began. It was difficult to steer the cart with one hand. There were already five carts parked haphazardly between benches and planters, dusted now with snow. “Just turn on the news, Laura.”“You know I don’t like to watch the news before bed. Are you having an anxiety attack?”“What? No. I’m going to my brother’s place to make sure he’s okay.”“Why wouldn’t he be?”“You’re not even listening. You never listen to me.” Jeevan knew this was probably a petty thing to say in the face of a probable flu pandemic, but couldn’t resist. He plowed the cart into the others and dashed back into the store. “I can’t believe you left me at the theatre,” he said. “You just left me at the theatre performing CPR on a dead actor.”“Jeevan, tell me where you are.”“I’m in a grocery store.” It was eleven fifty-five. This last cart was all grace items: vegetables, fruit, bags of oranges and lemons, tea, coffee, crackers, salt, preserved cakes. “Look, Laura, I don’t want to argue. This flu’s serious, and it’s fast.” “What’s fast?”“This flu, Laura. It’s really fast. Hua told me. It’s spreading so quickly. I think you should get out of the city.” At the last moment, he added a bouquet of daffodils. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 3 hrs 49 mins",
            "FREE delivery March 4 - 15 on orders shipped by Amazon over $35",
            "Or fastest delivery March 3 - 13",
            "FREE pickup February 28 - March 1 on orders shipped by Amazon over $35",
            "Or fastest pickup February 25 - 27"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLER • NATIONAL BOOK AWARD FINALIST • A PEN/FAULKNER AWARD FINALIST • Set in the eerie days of civilization’s collapse—the spellbinding story of a Hollywood star, his would-be savior, and a nomadic group of actors roaming the scattered outposts of the Great Lakes region, risking everything for art and humanity. • Now an original series on HBO Max. • Over one million copies sold!Kirsten Raymonde will never forget the night Arthur Leander, the famous Hollywood actor, had a heart attack on stage during a production of King Lear. That was the night when a devastating flu pandemic arrived in the city, and within weeks, civilization as we know it came to an end. Twenty years later, Kirsten moves between the settlements of the altered world with a small troupe of actors and musicians. They call themselves The Traveling Symphony, and they have dedicated themselves to keeping the remnants of art and humanity alive. But when they arrive in St. Deborah by the Water, they encounter a violent prophet who will threaten the tiny band’s existence. And as the story takes off, moving back and forth in time, and vividly depicting life before and after the pandemic, the strange twist of fate that connects them all will be revealed.Look for Emily St. John Mandel’s bestselling new novel, Sea of Tranquility! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage; Reprint edition (June 2, 2015)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0804172447"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0804172448"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.2 x 0.78 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,840 in Books (See Top 100 in Books) #64 in Dystopian Fiction (Books) #69 in Post-Apocalyptic Science Fiction (Books) #389 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 63,318 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d4ceabf5-6afa-48bc-a56b-10b8fee63e1c.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f677ab20-119c-4883-83bc-42e5635b9e57.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/29241543-2276-41b0-8a54-1b8a7597550c.__CR0,0,1080,1080_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alyson Larrabee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTTW7H7E4B372KZA4OCYMJ6SKCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39X5FP1RCNL81?ASIN=0804172447",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2020",
                "reviewTitle": "5.0 out of 5 stars Read this book now. It's so relevant.",
                "reviewText": "Station ElevenEmily St. John MandelImagine a world where the libraries and bookstores are closed. No theatres, concerts or films. Singing and laughing together can be deadly. Wait… we don’t need to imagine it. We’re living in this world now. There are so many parallels between the world of Station Eleven, and the present day Covid 19 pandemic, except the pandemic in the novel spreads even faster and is inevitably fatal. Victims die within two days of getting sick. So, it could be worse. This fictional pandemic manages to wipe out 99.9% of Earth’s population, more or less. There’s no way to be sure of the statistics because there’s no internet, or gas, or electricity. Small bands of survivors find each other, and sometimes form settlements, sometimes murder each other. The people who are interested in rebuilding a nonviolent civilization sometimes need to kill in self-defense, in attempts to save their friends or themselves, and their vision of a better, peaceful, productive life.The story begins before most people are aware of this deadly virus. Jeevan, a former paparazzi photographer, and paramedic in training, receives a phone call from a friend, warning him to stock up on groceries, and hide away in quarantine. He listens to his friend’s advice, and tries to warn his girlfriend, who replies, “It’ll be like SARS…They made such a big deal about it, then it blew over so fast.” Sound familiar? Seems to me that I heard someone say, “When the warm weather arrives, the Corona Virus will just disappear.” It hasn’t yet; after seven months we still have no vaccine and people are still dying. It’s August, it’s been warm for more than two months now, and the virus is still going strong.The story, like everyone’s life, is divided into chapters that take place before and after the pandemic. Kirsten, a young actress who was eight years old when the virus struck doesn’t remember much about her early life. After the pandemic, as an adult, she’s part of a traveling Shakespearean theatre troupe. They travel from “town” to “town” with a small orchestra, giving performances and concerts. “Because survival is insufficient.” – a quote from Star Trek that’s repeated throughout the novel, and is painted on the side of the players’ horse-drawn van. It’s their motto, their words to live by. Shakespeare’s life and career were also defined by and shaped by the plague. The Globe Theatre was often closed due to the disease. “Plague closed the theaters again and again, death flickering over the landscape.” Shakespeare lost people he loved and understood how death can strike fast, hot and sharp like a bolt of lightning. “Hell is the absence of the people you long for.” Tell me about it. I haven’t seen one of my daughters for a full year, but at least she’s still alive, and there’s a strong possibility we’ll be able to spend time together soon. I’ve visited my ninety-year-old father once in seven months, just last week. Yesterday, his assisted living facility went back into lockdown. The CEO tested positive for Covid. Again, and again, the characters of Station Eleven, their lives, thoughts, and dialogue resonate with me.Along with the lives of Kirsten and Javeen, another common thread holds the narrative together: a science fiction graphic novel, titled Station Eleven, created by Miranda, an artist. The fictional Dr. Eleven has also survived an apocalypse. He lives on a spaceship called Station Eleven, that’s disguised as an island, and says, “I stood looking over my damaged home and tried to forget the sweetness of life on Earth.” Kirsten, one of the main characters has forgotten, defensively blocked out, a memory of her life on the road when she was still a child. She also has difficulty remembering happier times. Kirsten has the only known copy of Station Eleven and its sequel, The Pursuit. She has memorized all of the text. “We long only to go home…We have been lost for so long…We long only for the world we were born into.” At one point in the story, these words buy her time and save her life.Groups of people have banded together and formed townships. One of them has a school, a library and a museum. There’s a debate about whether or not the school children should learn about history, the way civilization was before they were born. Do they need to picture what life was like when you could connect to other humans across vast distances via cellphones and computers, to travel in cars, and even airplanes?In their quest to reach this unusually evolved civilization, the Shakespearean theatre troupe and orchestra meet a vicious, homicidal Doomsday cult with a prophet who spouts such horrific nonsense that no one can logically argue with him.“They tell you they were saved (from the plague) because they’re superior people and free from sin…You just remember your own lost family and either cry or harbor murderous thoughts.”This prophet actually carries with him a page torn from a copy of Station Eleven.There is so much to admire and enjoy in this novel. It asks a question that most of us are asking ourselves now: Can we rebuild civilization the way we knew it, only even better?In most ways, this fictional pandemic and its aftermath are so much more horrific than our present-day pandemic, but in some ways this fictional world is more beautiful. The strength and heroism of the best of the survivors is inspiring to witness.I loved this book, and won’t stop thinking about it for a long time. I’ve recommended it to all of my friends who read books and like to discuss them, a pastime I’m very fond of, even more-so during this difficult time. “Because survival is insufficient.”",
                "reviewVotes": "81 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ4JXF6NYO6FKCFET6HK4EACZGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FBFBH8R2ML61?ASIN=0804172447",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "4.0 out of 5 stars A Parallel Pandemic Universe We Missed by a Whisker",
                "reviewText": "What if our Covid pandemic had been 99% fatal? This 2015 near future, low tech, on-earth sci-fi novel is clever, unnerving, imaginative and plausible. The key characters intersect on a PTSD-creating stage; sharing the public death of an infamous Hollywood actor while the first pandemic deaths flame through the City. From this beautifully written big bang, the individual character arcs vector into past and present scenes, and tangle through the early years of survival. A band of musicians and actors form The Traveling Symphony, playing classical music and performing Shakespeare among the small settlements around the upper Great Lakes. Mandel spends a lot of time on too many unimportant characters, for example the famous actor Arthur, and his wives. Taking the T-Sym plot further into work of survival and slow starts at rebuilding would have been much more interesting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mohammed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHIM5BIV4XZZNTBSQOZN2D3PKFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XPFKL9DX16YV?ASIN=0804172447",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Absolutely Captivating",
                "reviewText": "I read this entire book in less than 3 days since it was so captivating. The writing is absolutely beautiful and you feel connected to the characters. I assumed that this was written post covid since the pandemic in the book is very similar, however, Station Eleven was written in 2014! I highly recommend this book, I’ve shared it with my friends and they all enjoyed it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William S. Morris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRNYS4SEZ2DLH7SL6PIMQVUDECQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E8IJ911EOWDR?ASIN=0804172447",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2021",
                "reviewTitle": "3.0 out of 5 stars I don't get it",
                "reviewText": "Ms Mandel has an excellent publicist. She's gotten this book identified as some work of literature. They're making it prescribed reading in college, and bragging it up everywhere. It is definitely expensive, far more than all these Indie wannabes I read. The editing isn't much better. \"It was me\" \"aren't I\" \"who did I give it to\" not to mention some other pet peeves of mine. The story seems to have a point, but I don't get the epigraph. I can't figure the \"Too much, too much\" thing. As a general principle, I hate apocalyptic novels. I did enjoy Earth Abides. In that story, the plague wiped out so many people there weren't enough people to get a group of three hundred together. I'm not much for King's The Stand, which turned surreal in the middle. I don't mind a little morality thrown in, but let's cover it in detail. I'm not sure that morality was the purpose of this book. Father more concerned about his popularity than developing relationships with his son or his mother or his parade of wives? The failure to be involved with his family being the cause for the prophet? I am the light? What is that supposed to mean? Does the child show us the way by shooting the light? Or are we condemned to darkness? That comic book composed of ten copies, but we only see four printings with a missing edition, and some duplication in that two go to Katrina, and two to the son. Somehow it is central to the story, but some on station nine reside in the light while the others are pulled down to the darkness by seahorses. Nobody can go home because Dr. Eleven is in control, and says no. Since Miranda is Dr. Eleven, what does she have to do with anything? She goes out to the beach in Malaysia, and stares at container ships for the rest of her life. Are we hoping for container ships to rescue the world? I was upset that a pilot, one who could help the reconstruction, decides to make a futile flight with about 30 Asians when there was a need for a strength in numbers for defense and reconstruction. That's really what I don't like about apocalyptic stories. People are doing stupid or incorrect things, and the situation only gets worse. I cried when the old man selected the wrong leader in Earth Abides. It's been a long time, but Heinlein wrote a story about surviving a plague. Unlike this book, Heinlein's book was concrete in its story of survival. This book seems to think there is more than survival. Somehow society needs a band of actors and musicians to travel like gypsies to brighten the day. Reminds one of the medieval days. Anyway, I wonder if anyone consulted Maslow about this concept? It must be nice to sit at the top of our pyramid, and contemplate how the world should change as people are forced to grub around for everything they need.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Libby C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSXECTCNKHDLWSX6G7ULLF5N4SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N127N059Z3EQ?ASIN=0804172447",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Explorations of reactions to the end of the world",
                "reviewText": "I loved that I was never really able to predict how each of the characters would react. Or why people would do what they did. I loved that the characters were never exactly what was needed in any given situation and that those that were able to provide entertainment seemed the most settled in the aftermath of the world's end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emmitt Radmore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 30, 2023",
                "reviewTitle": "G-T-F-O. I HAVE NEVER BEEN SO ENTICED BY ANOTHER WRITER'S MIND. EMILY ST.JOHN-MANDEL IS SEXY!",
                "reviewText": "The book DID end up being every bit as masterful as the HBO series based on it, which I absolutely, immediately adored, and I look forward very much to reading Sea of Tranquility next. Emily St. John-Mandel's mind, her narration, her attitude, her ability to empathize in writing and convey emotions the rest of us have difficulty describing, and what's more, to attribute them to the sorts of nuances too subtle for some of us to perceive without her help. Clearly the work of a beautiful mind that has been allowed to idle creatively and introspectively. I hadn't received a literary spark like this since I first read Mary Shelley's Frankenstein.I stumbled across the show on HBO. From the very first few minutes I could tell this was the work of a BRILLIANT writer, and immediately wondered if the book was the reason for this, or if the screenwriters were simply very gifted, so decided to give the book a gander and see for myself. As evidenced in the overall quality of the concept, my guess was right on, and this was immediately one of the most engaging writers I had read in possibly an entire generation, at least insofar as novels go. Emily St.John-Mandel says what she has to say FEARLESSLY, with conviction, and without mincing words. I would be very curious to see how many drafts she wrote, as I wouldn't expect their to be many, with the writing coming at you raw, like, DARE I EVEN SAY? HEMMINGWAY?! Her mind is keen, and she knows exactly how many words she needs to bring you into her next thought, and somehow skips along her discontinuous narrative without losing you, at a rate that would set off alarms for other writers like the wheels were going to come off. A dancer no less, to be sure, in real life. Really? Fitting the way her prose dances across the page, from her mind into yours, without undue modesty. Clearly she wants to connect her thoughts to yours, and she chooses her words appropriately to that purpose. BRAVO! Now THIS is what SEXY writing looks like, and scratches the sci-fi/post-apoc itch no less!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 12, 2021",
                "reviewTitle": "Excelente libro!",
                "reviewText": "Me encantó este libro, a pesar de ser una distopía guarda esperanza, amor, suspenso, de todo. Varias historias unidas por un mismo hilo, y dadas las circunstancias actuales de pandemia, uno puede evitar quedar agradecido, podía haber sido peor.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heinrichson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 23, 2023",
                "reviewTitle": "Eine poetische Reise durch eine fragile postapokalyptische Welt",
                "reviewText": "My impressions in German and English:Eine poetische Reise durch eine fragile postapokalyptische Welt / A Poetic Journey Through a Fragile Post-Apocalyptic World.\"Station Eleven\" ist ein fesselndes Buch, das mich von Anfang bis Ende in seinen Bann gezogen hat. Die Autorin, Emily St. John Mandel, schafft es meisterhaft, eine postapokalyptische Welt zu entwerfen, die gleichzeitig düster und hoffnungsvoll ist.Die Geschichte folgt verschiedenen Charakteren, die auf beeindruckende Weise miteinander verbunden sind. Mandel wechselt geschickt zwischen verschiedenen Zeitebenen, was dem Roman eine faszinierende Struktur verleiht. Die Überlebenden einer tödlichen Grippe-Epidemie versuchen, in einer Welt ohne Elektrizität und moderne Technologie zu überleben.Die Charakterentwicklung ist bemerkenswert, und man kann sich leicht mit den unterschiedlichen Figuren identifizieren. Mandels Sprache ist poetisch und einfühlsam, was die Atmosphäre des Buches noch intensiver macht.\"Station Eleven\" regt nicht nur zum Nachdenken über die Fragilität unserer Zivilisation an, sondern auch über die Bedeutung von Kunst und Kultur in einer Welt, die dem Untergang geweiht zu sein scheint. Die Beschreibungen der verlassenen Städte und die Suche nach menschlicher Verbindung verleihen dem Buch eine tiefgreifende emotionale Dimension.Insgesamt ist \"Station Eleven\" ein literarisches Meisterwerk, das die Leser mit einer packenden Handlung und anspruchsvollen Themen begeistern wird. Ich kann es nur wärmstens empfehlen, besonders für diejenigen, die nach einem Buch suchen, das sowohl intellektuell anregend als auch emotional berührend ist.\"Station Eleven\" is a captivating book that held me spellbound from beginning to end. The author, Emily St. John Mandel, masterfully crafts a post-apocalyptic world that is both bleak and hopeful.The story follows various characters intricately connected in a post-pandemic landscape. Mandel skillfully navigates between different timelines, giving the novel a fascinating structure. Survivors of a deadly flu epidemic strive to adapt to a world devoid of electricity and modern technology.The character development is remarkable, and readers can easily identify with the diverse cast. Mandel's language is poetic and empathetic, intensifying the novel's atmosphere.\"Station Eleven\" not only prompts reflection on the fragility of our civilization but also on the significance of art and culture in a seemingly doomed world. The descriptions of abandoned cities and the search for human connection add a profound emotional dimension to the book.Overall, \"Station Eleven\" is a literary masterpiece that will captivate readers with its compelling plot and sophisticated themes. I highly recommend it, especially for those seeking a book that is intellectually stimulating and emotionally resonant.Furthermore, the absence of smartphones, internet, and the inability to swiftly travel to the other end of the earth by plane underscores a haunting reality. The characters must rely on traditional forms of communication, adding an extra layer of realism to the narrative. The inability to communicate over long distances amplifies the survivors' isolation, emphasizing the fragile nature of our highly technological world. This element significantly contributes to the allure of \"Station Eleven,\" compelling readers to contemplate the impact of technological collapse on our interpersonal connections.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 7, 2023",
                "reviewTitle": "A beautiful book",
                "reviewText": "Beautiful, haunting, heartbreaking, but with some hope too, at the end. Beautifully written, with characters who will stay with me for a long time. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vidya Nand Garg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 2, 2022",
                "reviewTitle": "A novel about a pandemic ,written in 2014",
                "reviewText": "Emily St John Mandel published Station Eleven in 2014, about a post pandemic world . I read it in October 2022 when Covid19 is at its last legs. Emily is an inventive author and she has visualised a world during and after a pandemic with great imagination. Station Eleven is spellbinding. Worth a reread.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.67",
                "sellerName": "bookmasters444",
                "sellerRating": "5"
            }
        ]
    }
}