{
    "remaining_requests": 1592,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Redshirts-John-Scalzi-audiobook/dp/B0088U1CCO",
    "body": {
        "name": "Redshirts: A Novel with Three Codas",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Redshirts-John-Scalzi-audiobook/dp/B0088U1CCO",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51CE3t95FqL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Scalzi",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=John+Scalzi"
        },
        "brand": "John Scalzi",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 11152,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Ensign Andrew Dahl has just been assigned to the Universal Union Capital Ship Intrepid, flagship of the Universal Union since the year 2456. It’s a prestige posting, and Andrew is thrilled all the more to be assigned to the ship’s Xenobiology laboratory. Life couldn’t be better…until Andrew begins to pick up on the facts that (1) every Away Mission involves some kind of lethal confrontation with alien forces; (2) the ship’s captain, its chief science officer, and the handsome Lieutenant Kerensky always survive these confrontations; and (3) at least one low-ranked crew member is, sadly, always killed. Not surprisingly, a great deal of energy below decks is expended on avoiding, at all costs, being assigned to an Away Mission. Then Andrew stumbles on information that completely transforms his and his colleagues’ understanding of what the starship Intrepid really is…and offers them a crazy, high-risk chance to save their own lives. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Alien Invasion",
                "link": "https://www.amazon.com/Alien-Invasion-Science-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9059886011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 41 minutes"
            },
            {
                "name": "Author",
                "value": "John Scalzi"
            },
            {
                "name": "Narrator",
                "value": "Wil Wheaton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 05, 2012"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0088U1CCO"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#578 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Alien Invasion Science Fiction #6 in First Contact Science Fiction (Audible Books & Originals) #11 in First Contact Science Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KarToon12",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4BUSB37F7BUAAQBI5JYZ3FM3XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R203IQV1XK8H4Z?ASIN=B0088U1CCO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Star Trek meets Stranger than Fiction",
                "reviewText": "I've been slowly making my way through a long list of books recommended by a librarian I follow on social media. Next up on the docket was a novel I knew I had to check out. One that would poke fun at \"Star Trek\"---one of my favorite TV shows---and all the various clichés within it. And while I DID get a loving parody of one of the most famous sci-fi shows ever, it eventually veered off in a direction that not only surprised me, but turned this into one of the most clever tales about free will and the art of storytelling that I've ever read.Ensign Andy Dahl is excited to begin his career on the starship 'Intrepid'; seeking out new life and going on intergalactic adventures. But not long into his stay on board, Dahl begins to notice a myriad of oddities about the ship and its crew. How do crewmembers keep sustaining critical injuries, yet are perfectly healed within hours? How does the ship get attacked in a multitude of ways, yet the same couple systems keep exploding every time? Why does Dahl feel compelled to say certain things at certain times that he wouldn't otherwise say? Why do crewmembers run and hide when the commanding officers pass by? And most perplexing of all: why are there so many low-ranking crewmen being constantly killed off in the most ridiculous of ways? With most of the crew too afraid to speak up, Dahl, along with a plucky band of his fellow low-ranking officers, takes it upon himself to figure out what is seriously wrong with the Intrepid. And what he and his friends discover will turn their views of reality upside down. And by the end, one thing will be made clear: in order to ensure their survival, Dahl and his friends will have to find a way to bend the narrative of the universe to their will.For decades, 'Star Trek' has entertained millions of people with their outer space adventures, life lessons, and critical examinations of humanity. But even fans like myself can laugh at the many clichés it's spawned over time.....primarily, the idea of the \"redshirts\"---ie: the random, nameless, background crewmen who get killed off in every episode to raise the stakes for the main characters (who miraculously manage to survive anything thrown at them because of plot armor). So imagine my delight in coming across a book that's told entirely from said-redshirts' perspective. In doing so, people like \"random ensign number five\" or \"lieutenant with just a last name and nothing else\" are finally given a voice. And as crewman after crewman are lost to some of the most ridiculous scenarios imaginable, we quickly come to sympathize with and remember that these were people with backstories and families and lives of their own, and that they don't deserve to be treated as cardboard cutouts for our entertainment.Which leads me into having to try and talk about a major plot development that happens about a third of the way through the book. The title of this review somewhat gives it away, but to try and not spoil TOO much, all I can safely say is that, when Dahl and company finally figure out why life on the Intrepid is so strange, the plot suddenly becomes a hilarious (but still poignant) commentary on the art of storytelling, and how we, as writers, can so easily hand wave away story elements under the excuse of \"it's fantasy\" or \"it's science fiction--who cares\", without thinking about the greater consequences as to how said decisions would affect that universe. And it also becomes a biting look at the lengths some people are willing to go to ensure their own survival, even if it means throwing their fellow crewmembers to the lions. But Dahl and his friends realize the crew can't go on living in fear of when their eventual number will be called. And in their courageous efforts to figure out how to save everyone from a terrible fate, they'll learn the hard way that in order to change our lives for the better, we must take action and become the main characters of our own story.To anyone and everyone who loves 'Star Trek' (and enjoys the humor of \"Lower Decks\"), as well as movies like \"Spaceballs\", you owe it to yourself to read this. What starts as a fun comedy eventually morphs into a dramatic existential crisis that had me on the edge of my seat in the final act. All I can say is, the next time I tune in to Trek, I'll never see the background extras the same way ever again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jesica love",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJBXZ5ZZ2AHKVQVE2NTGZXERMHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAYR3O8GRAVM6?ASIN=B0088U1CCO",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "4.0 out of 5 stars A Silly Good Time",
                "reviewText": "I read my first Scalzi book at the end of next year and immediately knew I had to read more. A neighbor recommended this one and I'm officially a fan. His books are completely absurd and out there and they're hilarious and I love them.Redshirts is set on a starship in the future. If you've watched Star Trek or really just know pop culture, you'll know that the redshirts always die. And in this story, they start noticing and decide to do something about it.It's a fun time. I'll admit I liked Starter Villain better, but that one had spy cats, so you know... This one is a good silly time too. Recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JTF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6O5TSRSGYS364QMH6OHPX454BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W457Q9XJJVQ2?ASIN=B0088U1CCO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2013",
                "reviewTitle": "5.0 out of 5 stars Redshirts - a strangely thought-provoking funny book.",
                "reviewText": "It's a familiar meme: don't wear a red shirt on the deck of the U.S.S. Enterprise; if you do, you're likely to be killed before the first commercial break.This not-so-inside Trekkie joke became the basis for novel of the same name by John Scalzi. Heck, there's even a Redshirt song by Jonathan Coulton (of Code Monkey fame; speaking of which, there's a graphic novel Kickstarter project and a related album of Coulton's). Clearly, Mr. Scalzi is jumping onto a fairly main-stream meme (hey, even I heard about it).So, I hunkered down, ready for some inside Trekkie references and some serious fun. Redshirts does not disappoint on that score. It begins as expected with funny, light banter about junior officer life in space and fodder for various life forms they encounter; away missions and survival tend to be mutually exclusive for the junior officers. Soon, however, it dives a bit deeper - the senior officers go from normal to cliché in 7.6 seconds and then, flip back. Even Star Fleet officers typically don't do that. You get the picture; to say more, I'll need to leak some of the story. Before I continue on to the spoiler version of the review below, let me say a few things I'll attempt to substantiate below:- Mr. Scalzi does a good job building the relationships and defining the characters in the first half of the book. Those characters grow considerably in the second half of the book.- Speaking of the second part of the book, a relatively surprising shift takes place that moves the dialog onto a bit more speculative and less comical ground.- The three Codas at the end of the book are a non-trivial; they address some very interesting and often overlooked issues and perspectives. Do not blow by these. My view is that they take a really good book to the next level of excellence.- I believe that you could enjoy the book without being a Star Trek (or even SciFi) fan. Most who read it will be both, but it's not necessary to lock in.- I went between listening to the Audible book, ably read by Will Wheaton of Wesley Crusher fame on Star Trek: The Next Generation (TNG) and the Kindle edition. Mr. Wheaton is able to convey both the humor, the action and the issues equally well. (If you don't already, follow him on Twitter @wilw. He's both funny and has some interesting insights; mostly funny. Pet Peave timeout - my dear developer friends at Audible, please get Whispersync for Voice working on Windows Phone 8 so that I can pick up where I left off on my Kindle Paperwhite. It's a fabulous feature. Overall, I love the app, but it could stand that improvement. Thanks. Now, back to our regularly scheduled program.- My one disappointment: while I understand that Mr. Scalzi is reflecting military life (and that this isn't his father's Star Trek), the language was overly foul. All that needed to be accomplished could have been done so with brief forays into foul language land, instead, we move in and occupy it.****SPOILER ALERT****It turns out that our intrepid crew, yes pun intended, of the U.U. Intrepid, were really part of a future show that used Star Trek as its basis; a sort of Star Trek remix. The writers often used cheap dramatic tricks of death, destruction and mayhem to keep their audience interested; the tricks were typically played on the Redshirts. The book goes from mere fun to interesting when the junior officers, led by Ensign Andrew Dahl, figure out that they are part of a show. Now, not only do they know the challenges of going on away missions in red, they are cognitive of the fact that they're bit players in a show. Mr. Scalzi handles this awareness very well, and he takes it head on. He has Dahl and friends meet the show's producers; they come into contact with their doppelgängers and attempt to right many wrongs and make the alternate universe safe(r) for democracy. This is adroitly done with no over-long back-story; rather Mr. Scalzi takes you from what you think will be the main, light fun meat of the book and uses it to build the characters and relationships so that, by the time awareness dawns and producers are met, we know the characters, care about them and their relationships and are ready to walk with our new friends in unexpected directions.The characters now become involved with the lives of the \"real world\" folks; albeit some involuntarily like Lt. Kerensky and some more intimately like Jasper Hester. I do want you to read it, so I won't say anything more other than, it works. That's saying a lot. A character meeting themselves in the real world when they were a bit part the \"real\" person nearly forgot they played is nearly the embodiment of \"awkward\". Yet they meet and move on.Some of the most interesting parts comes in the codas - what would you do if, as a script writer, you discovered people actually died, in some alternate world, when you killed your characters off? You couldn't very well continue knocking them off. Now what? You still need tension and story. But wait, what if even angst over this question is covering up a deeper issue. Now, we're talking. Yes, John Scalzi goes there.What if your characters meet and, for the first time, you receive \"tough love\" feedback from someone you can trust, your other self. He goes there too.Finally, what if the \"story\" dead spouse of an unhinged husband has a counterpart who drifts because she knows there something else, a sense of loss or missing connection?All of these are examined in the context of story, not simply self-reflected dialog.So, while I thought Redshirts would be fun, and it was, it was also thought provoking, had some drama going down and some characters growing up. Well done Mr. Scalzi.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 30, 2022",
                "reviewTitle": "amazing",
                "reviewText": "Amei cada parágrafo desse livro e qualquer pessoa que goste de ficção científica deveria lê-lo.Precisa ter visto algo de Star Trek tbm pra não ficar perdido nas referências.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aniket",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 2, 2024",
                "reviewTitle": "He’s good with premises but gets too self righteous",
                "reviewText": "He had a good idea and a decent plot, upto a point. You can really feel when the story runs out.I picked up another book of his and it’s written in the same voice. The same “catcher in the rye” voice that gets grating after a while.Remember to respond with compassion instead of useless frustration at an injustice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "book nerd!",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 26, 2023",
                "reviewTitle": "😁",
                "reviewText": "Every book I read by this guy makes me love him more (in a reader way, not in a watch him sleeping way) *! I bought this not knowing that much about it, nor Star Trek. And I am so glad I did! You get everything in his books - Comedy, Drama, Romance, Action, Loveable characters... And a good fart joke, sorta, more of a burrito incident. What's not to learn and love - Nothing! Thank you for the ride!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 23, 2018",
                "reviewTitle": "Great tongue in cheek SIFI",
                "reviewText": "John Scalzi takes a known phenomena (red shhirts) from a well known SIFI TV series and turns it into a fast paced Story of its own. Great read and kept the reader on their toes all the time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 14, 2018",
                "reviewTitle": "Funny and philosophical at times",
                "reviewText": "Loved this book on multiple levels, especially the humour and the Star Trek references. At first I thought that the \"Soon to be a major tv series\" announcement on the back cover was a joke but apparently it's really going to happen, which could then be the subject for the sequel, at which point minds will explode.This book is a kind of spoof of science fiction series where the lead characters always survive, but the extras die tragic, often pointless deaths. Redshirts is about those extras. But the extras are real people with real lives in this case. But are they? I love Scalzi's sense of humour, his easy-going style and the deeper layers hidden behind the humour. His work makes me think of Hitchhiker's Guide to the Galaxy, but more entertaining and more intelligent.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}