{
    "remaining_requests": 1513,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ready-Player-Two-A-Novel/dp/B08C7DQWRC",
    "body": {
        "name": "Ready Player Two: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ready-Player-Two-A-Novel/dp/B08C7DQWRC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51XI-UQzsAL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ernest Cline",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ernest+Cline"
        },
        "brand": "Ernest Cline",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 43053,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Number-One New York Times Best SellerThe thrilling sequel to the beloved worldwide best seller Ready Player One, the near-future adventure that inspired the blockbuster Steven Spielberg film. Named One of the Best Books of the Year by the Washington Post“The game is on again. ... A great mix of exciting fantasy and threatening fact.” (The Wall Street Journal) An unexpected quest. Two worlds at stake. Are you ready? Days after winning OASIS founder James Halliday’s contest, Wade Watts makes a discovery that changes everything. Hidden within Halliday’s vaults, waiting for his heir to find it, lies a technological advancement that will once again change the world and make the OASIS a thousand times more wondrous - and addictive - than even Wade dreamed possible.With it comes a new riddle, and a new quest - a last Easter egg from Halliday, hinting at a mysterious prize. And an unexpected, impossibly powerful, and dangerous new rival awaits, one who’ll kill millions to get what he wants. Wade’s life and the future of the OASIS are again at stake, but this time, the fate of humanity also hangs in the balance. Lovingly nostalgic and wildly original as only Ernest Cline could conceive it, Ready Player Two takes us on another imaginative, fun, action-packed adventure through his beloved virtual universe, and jolts us thrillingly into the future once again. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 46 minutes"
            },
            {
                "name": "Author",
                "value": "Ernest Cline"
            },
            {
                "name": "Narrator",
                "value": "Wil Wheaton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 24, 2020"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08C7DQWRC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#358 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #7 in Dystopian Science Fiction (Audible Books & Originals) #11 in Dystopian Fiction (Books) #12 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "fernando",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFX3VY5ZETFP5PJYKUS55M4OLR5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N2F1MV89FGNT?ASIN=B08C7DQWRC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars One of those books to eat the pages one after another",
                "reviewText": "A lot of people didn't completely like this book, I haven't finished it but it's one of those books you can't let go, just every page leaves you wanting for more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesse Miller-Riley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTWJHBXTQ54K57JFAQNMD6LTK3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPSPNDNP7CQYD?ASIN=B08C7DQWRC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2020",
                "reviewTitle": "4.0 out of 5 stars On the fence.",
                "reviewText": "Maybe some other people can review Ready Player Two without mentioning Ready Player One, but I'm not one of them. So, here we go.Ready Player One knocked my socks off from the very first page. I knew it was going to be something amazing and legendary from the get-go, and I stand by that, though even the first book has its obvious downfalls and the biggest critique seems to be that it's an info-dump of 80s pop culture. But, hey. That's the time period I grew up in as well, so while the book may not have captured the imagination and heart of someone older or younger, it did for me.So I waited with baited breath for the next book by Ernest Cline. And I tried to like Armada>, I tried really hard, actually. But I didn't. So that totally upped the ante for Ready Player Two for me--and, I suspect, for many of you. I also have the somewhat limiting habit of putting myself too much in the shoes of the author, anxiously awaiting how the masses are going to like their latest book. Having never (yet) finished a story of my own with which to try the rocky seas of publication see if anybody beyond my own circle of friends will like to read it or not, I know I'm not at the exact same place a published author is when waiting for reader feedback, but I can imagine it's pretty terrifying, especially when the track record has been dubious at best. And I hate hurting anyone's feelings, which compromises how objective I can be in some of my review, I know. So yeah.What I liked about Ready Player Two:The retro video game and 80s/90s pop culture trivia was, if anything, even more interesting to me than it was in the first book, because a lot of this stuff was even more obscure (to me, anyway) and I actually learned a great deal of interesting facts that I didn't know about before. I'd often find myself pausing to google something and find out more about it, and you know what? That's pretty awesome.Cline made an effort to make his characters more diverse this time around, and while some will scoff or take issue with it, I give him points for trying. I tried not to read any articles or reviews before finishing the book, so as not to cloud my own feelings about it, but I did see the headline about the \"non-binary sex\" fumble. I get that, and we can all improve. But it's better to try to be inclusive, and then accept feedback, than to just not try to be inclusive at all. I loved that there was a non-binary character in this book. I hope we see more of that, going forward.The story, and the character of Wade himself, have both matured. Again--yeah, I get it--there's still tons of room for improvement. But one of the biggest wins for me was Wade's having matured when it came to sex, and sexual orientation, in general. The jokes about Art3mis potentially being a middle-aged man named Chuck, in the first book, gave Wade the vapors and sent him into a sexual identity crisis at the thought of potentially loving and/or being sexually attracted to another male. And yeah, as a teenager, sexual identity crises are not out of the ordinary. But as someone who is not heterosexual myself, it still felt like a stab, like the old \"gay joke\" which has long outworn its welcome. Cline, and Wade, set that right in the new book. Thanks to the technology of ONI, Wade has now had lots of experiences very diverse from his own upbringing, and yes, that includes sex too, so he's more level-headed about the whole thing, and the thought of \"non-heterosexual sex\" (for lack of a better term) no longer freaks him out. You know what? That's really cool. It acknowledges all of us out there who aren't heterosexual and/or cisgender, and in my mind, that is something to be celebrated.With more of a focus on the character of Kira Morrow, and the admission that she had been overlooked as one of the founders of the OASIS, some more cracks appeared in the glass ceiling. The retro gamer geek world has some pretty amazing female figures, both as creators and gamers, but they still seldom get the recognition they deserve. This felt like a nod to that.It was also fun to read. While I admit that the first few chapters did not grab me and draw me in as quickly as the first book did, by page 50 or so, I was definitely hooked, and I certainly finished this book a lot faster than any of the other books I've read recently.What I didn't like about Ready Player Two:The pacing. In Ready Player One, there were moments of intense action and pressure, and stretches of downtime (sometimes good, sometimes also tense but in a good way) as the quest for the first easter egg stalled, the way any true treasure hunt would. It was like a brand new game that nobody has ever seen before, and everything along the way had to be learned by trial and error, and luck. But this time around? It read like someone who didn't even *bother* to try to use trial and error, and instead just read the game walkthrough from start to finish. One of the characters always knew exactly what obscure and arcane thing was needed next, and it was a headlong rush to collect a bunch of crystals that felt more like speed-running a game while your friend sits on the couch next to you, reading the walkthrough and telling you what to do step by step. You still get to the same ending, yeah, but some of the fun of it has been stolen away in the process. Now yeah, in the story, the characters are under time constraints to do what they had to do. So I guess it had to go down that way. But it left me dissatisfied.Ditto for L0hengrin and her entire part to play in this. (I use the pronoun she, as it was what the character's preference was stated to be.) I was intrigued by her character, and the entire band of the L0W Five, and I wanted to know so much more! But it felt like a total cop-out, how little we really got to see about what they were off doing. I suppose that could be a gimmick and a way to eke another story out of this fictional universe, and while it's one I would read in a heartbeat, it only contributed to the abrupt pacing of this story, making me feel like I was reading a Cliff's Notes version instead of an entire, unabridged book. There was a lot to pack in, and it didn't all get packed in.Audiences have said loud and clear that they need more to a story than just an info-dump of retro trivia, so while that worked the first time around with Ready Player One, I think we all need more, this time around. And with the rushed pacing and abridged storyline, glossing over or not showing a lot of the action at all left me feeling like I'd only gotten to see 1/4 of the story.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John David Jacobs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5F7665QHKOKTU4LTPXWILG6DLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36BMQJ6SM3KWS?ASIN=B08C7DQWRC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2020",
                "reviewTitle": "5.0 out of 5 stars A great Ready Player One follow-up that paints the same captivating story",
                "reviewText": "I vividly remember reading Ready Player One and being completely enthralled by what the book had to offer. I didn't understand a majority of the 80's references, and I wasn't nearly as much of a sci-fi fanatic, but Ernest Cline's ability to paint a colorfully nostalgic world is what was so captivating about RPO. In Ready Player Two, I get to enjoy those same evocative experiences with the turn of each page. That quality is what makes this series so childishly fun to read.Ready Player Two takes off basically where Ready Player One finished, so it wastes no time catching you up. The strong, unfamiliar pop culture references were going to be a given, but that is what makes this series so unique. Every now and then, I would *insert Captain America meme* understand a reference, and it brought me back to how reading the first one felt. During both books, I kind of liked typing each referenced character and video game into Google to get a look of what it actually looks like. The fact that Cline is creating a totally imaginative world that is heavily based on real-life references is impressive in that Cline has to ensure those references are correct. Ensuring consistencies in his fantasy world AND in relating to actual stories created by someone else seems like a daunting task, but Cline nicely did so in RPO and RPT.The love story between Parzival and Art3mis has a veil of realistic truth around it, in that in this day and age, this is exactly how I would believe an online relationship to feel, begin, and be executed. It's not hard to imagine Wade and Samantha as the geeky, awkward people that are transformed into immortals when online. The way the two act around each other, and the juxtapositions that are their lives (both on and offline, and when they are and aren't together), made their relationship always feel genuine and innocent to me. Most books have the love interests revolve their attractions around sex, money, or other motives that get overplayed. This one revolves around the experience of sharing adventures together, and I've always enjoyed that.Now, there are parts to the plot that are a bit questionable. I won't go into detail about most of the plot, in order to avoid spoilers, but I will say that the entirety of the book takes place roughly in twelve hours. Considering how long it took Wade and his friends to complete the first Easter Egg quest in RPO, in seems a bit rushed and unbelievable that the \"almighty Halladay\" would create a second scavenger hunt that seemed nowhere near as difficult and time-consuming. The antagonists, too, seemed a little baffling. I don't feel there was too much effort put into developing new, exciting, and practical antagonists -- in fact, that was the area of RPT where I felt the least attached to. But with that said, the plot inconsistencies and lack of strong, sensible bad guys did not drive me away from liking the book.I will admit, my adoration for RPO did play a part in making me a tiny bit biased, but in the end, Ready Player Two is enough like Ready Player One for my liking. It obviously doesn't feel like Cline was planning to write a sequel to RPO, and RPT seems much more brushed and prepared for a movie than its copywrite-infringing predecessor. With that said, Cline still did a good job at, again, capturing and maintaining the flavor that made RPO so enjoyable to experience.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 5, 2022",
                "reviewTitle": "Sequals do not always suck- this book is the proof!",
                "reviewText": "Sequels always suck - with the exception of The Terminator and Aliens. This book is another proof that squeals don't need to always suck. I was hesitant to read and buy this book because the first one was so amazing. I hope they make a movie out of book 2 and also hopefully some people crate the amazing technology that has been imagined in this book. Thanks to the author for making me a VR enthusiast and writing an unforgettable book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manuel Nava V",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 14, 2021",
                "reviewTitle": "Great sequel",
                "reviewText": "Sequels are difficult and for the most part not as good as the first but. This book was not the exception. However, the author takes us in a great journey of different feelings including nostalgia for those movies and games we grew up with.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.M. Diniz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 13, 2021",
                "reviewTitle": "Tempo e espaço, universo e vida.",
                "reviewText": "Ai final eu me sinto parte da tribulação que que tem um universo para explorar. Geralmente eu me sinto órfã depois de grande leitura e fico sem vontade de ler mais nada por um tempo, e até volto a ler o livro tudo se novo para minar a sensação de vazio que fica quando o livro termina. Mas desta vez me senti como os tripulantes de uma nave interstelar que todo tempo que precisa para explorar tudo que o universo tem para ser descoberto. Dessa vez eu terminei a leitura com uma sensação de que realmente tenho tempo e espaço. Muito obrigada Ernest.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Torguet Patrice",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 3, 2021",
                "reviewTitle": "He did it agin",
                "reviewText": "This book is awesome. I was worried that it wouldn’t be as good as the first one but all in all I loved it as well. I recommend it fully. It really is awesome. And of course, if you didn’t read the first and only saw the movie you really HAVE TO read it as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mohammad A. Rahman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 31, 2020",
                "reviewTitle": "The inevitable sequel to a beloved original",
                "reviewText": "I actually had no idea that Ernest Cline had written a sequel to his now-classic sci-fi Valentine to the 80s, D&D and geeks in general. To me, it just seem to appear out of the blue, which I guess goes to show how deep I'd crawled under my own rock but also the idea of a sequel seemed impossible, unwanted and risky. Our hero, Wade Watts, had successfully reached the end of the quest, won the ultimate prize, become a legend, an instant billionaire and seemingly found his soulmate, Artemis (aka Samantha). What more could Wade achieve after inheriting everything from the mad genius geek icon James Halliday, including the cloak granting his avatar, Parzival, God-like control of the Oasis? Why would any reader who'd enjoyed this ultimate geek's fantasy want to mess with this happy ending? And why risk writing a sequel to such a popular hit when so many other sequels have failed to match the original's brilliance?Let's be frank - sequels have been and always will be around for one reason only: money. Very few sequels have transcended their commercial origins to be artistically appreciated. For the most part, sequels are repetitious, familiar and rarely unpredictable. If done reasonably well enough, sequels can be fun opportunities to revisit a particular world or universe and to enjoy the further adventures of beloved characters. But lazily conceived and written sequels are horrible and reek and leave a bitter aftertaste. These are just some of the things that I'm sure went through Ernest Cline's mind when he began to formulate \"Ready Player Two\".Now, \"Ready Player One\" wasn't exactly perfect. It can be easy to forget that as enjoyable as it was, \"Ready Player One\" sometimes felt a bit superficial. Sure, there was plenty of excitement and thrills but sometimes you could get a bit bored with Wade's super gamer skills and his seemingly encyclopaedic knowledge of movies, music, games, books etc. At least Cline successfully put his main character's prodigious talents and skills to the test but in my experience as a reader I've always preferred my heroes to develop these super skills and talents. It took me a bit of time to accept Wade/Parzival as being innately talented.I'm happy to say that once I dived into \"Ready Player Two\" not only did Cline hit all the right buttons in terms of recreating the universe of the original novel - the sequel literally begins where the original left off - but he has expanded on this (and the virtual world of the Oasis) brilliantly and imaginatively. Far from being lazy, Cline has definitely done his research and made wise choices in the inevitable references to 80s pop culture as well as to sci-fi, the fantasy world of Tolkein and D&D as well as video gaming. The other pleasing aspect is that Cline has successfully found a way to keep Wade's story and that of his friends exciting and thrilling by acknowledging some unpleasant and dark aspects and weaknesses, particularly in Wade's case. Not only that, the legendary figures of Halliday, Og and Kira provide a fascinating and dark plot line which necessarily exposes the more unpleasant and uncomfortable truths that were glossed over in the original novel. And to my mind the integrity of the novel and its universe is not damaged by the obvious references to all that's been happening in the world since the original novel came out. What has been criticised as being the \"woke\" aspects of \"Ready Player Two\" are actually sensitive and provide some of the novel's heart.That it has already disappointed many readers is perhaps inevitable. Not for me. I read this in two days. It's not Shakespeare but it is immensely entertaining, sometimes a bit too overwhelming on the pop culture references but nevertheless I learnt some interesting tidbits of info. Another pleasing aspect of the book is that it avoids trying to incorporate aspects of \"Ready Player One\" the film. \"Ready Player Two\" is a sequel to the \"Ready Player One\" novel. It's two thumbs up for me.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}