{
    "remaining_requests": 1522,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Testaments-Margaret-Atwood-audiobook/dp/B07KYSPLBJ",
    "body": {
        "name": "The Testaments: The Sequel to The Handmaid's Tale",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Testaments-Margaret-Atwood-audiobook/dp/B07KYSPLBJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lS6XYDwZL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Margaret Atwood",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Margaret+Atwood&search-alias=audible"
        },
        "brand": "Margaret Atwood&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 68931,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Number one New York Times best sellerWinner of the Booker PrizeThe Testaments is a modern masterpiece, a powerful novel that can be enjoyed on its own or as a companion to Margaret Atwood’s classic, The Handmaid’s Tale.More than 15 years after the events of The Handmaid's Tale, the theocratic regime of the Republic of Gilead maintains its grip on power, but there are signs it is beginning to rot from within. At this crucial moment, the lives of three radically different women converge, with potentially explosive results.Two have grown up as part of the first generation to come of age in the new order. The testimonies of these two young women are joined by a third: Aunt Lydia. Her complex past and uncertain future unfold in surprising and pivotal ways.With The Testaments, Margaret Atwood opens up the innermost workings of Gilead, as each woman is forced to come to terms with who she is, and how far she will go for what she believes. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Dystopian",
                "link": "https://www.amazon.com/Dystopian-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3559311011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 18 minutes"
            },
            {
                "name": "Author",
                "value": "Margaret Atwood"
            },
            {
                "name": "Narrator",
                "value": "Margaret Atwood, Derek Jacobi, Mae Whitman, Ann Dowd, Bryce Dallas Howard, Tantoo Cardinal"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 10, 2019"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07KYSPLBJ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,137 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #43 in Dystopian Science Fiction (Audible Books & Originals) #125 in Dystopian Fiction (Books) #157 in Literary Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENLVQQF33R6DKHLA5HVGGHM5ICQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10VTF7E2NTX4J?ASIN=B07KYSPLBJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2019",
                "reviewTitle": "5.0 out of 5 stars A unique, essential sequel that tastefully incorporates the current TV series as canon",
                "reviewText": "Not in a very great while have I been able to finish a 400+ page book in 24 hours, which is precisely what happened with \"The Testaments\". I love reading and am a fairly fast-paced with a good book, but with my day job and my second \"professional hobby\" as a sound engineer it's very difficult for me to get in 20-30 pages of quality reading in any given day/night. It sadly takes me close to 3-4 weeks each to read fantasy novels like the A Song of Ice and Fire or Wheel of Time series.However...I basically put my life on pause for this book, as soon as I started reading it (and listening to it, more on that in a bit). Having binged \"The Handmaid's Tale\" series on Hulu earlier this summer and subsequently reading the original 1985 novel, the way this book adds to its previous media (including, very heavily I might add, the TV series) is absolutely delightful. This is an example where the author has the readers'/viewers' interest in mind, and is not just some bombastic continuation of the story just to sell copies.That being said, the book is broken up into 3 sections, all being told retrospectively some years after the last season of \"The Handmaid's Tale\":1) Aunt Lydia, from her stance as basically the matriarch of Gilead;2) Daisy, a teenager in Toronto during the prime days of Gilead;3) Agnes, who, if you've watched the TV series, you already know who this character is.This book finds itself in a very unique position not common in sequels because of the mixed background of any possible reader. It could stand alone okay, but not nearly as well as serving as the direct follow up to just the novel. But for the ultimate experience - it does fan service to those who have read and watched \"The Handmaid's Tale\". Because the show still has a little bit to go (who knows how long) the time distance and the plot points set in \"The Testaments\" surprisingly do not write each other into a corner, but provides even more anticipation for how the entire timeline of Gilead will be explored. It's like the tightening of a fishing line in a pond - you know something's at the end and you're excited to have caught it, but reeling it all in is part of the experience - and that will be the job of the last seasons of the show.There are some great twists and turns in this book as there is in the preceding media, however it is best to leave all detail out. I am going to admit - being the harsh critic that I am - some of the ending does seem a bit forced especially on Aunt Lydia's part and I was able to predict a few things quite far in advance - but I've consumed all the previous media. A few predicable details did not deter me from reading any further, particularly during the beginning it even had a paradoxical effect: enhancing the experience as I turned the pages...or the seconds of the audiobook.In another unique twist of my own accord - I actually started 'The Testaments' with Audible when I was at work (and I typically despise audiobooks unless I'm on a solo road trip) and this is one of those rare exceptions (to me) where the audiobook might be even more compelling than just the text on a page. The main reason: Ann Dowd, the phenomenal actress that plays Aunt Lydia in the TV series, reads her sections in that familiar piously strict voice of hers that we all love to hate from the Show. Bryce Dallas Howard and Mae Whitman also NAIL their respective characters' \"voice\" and I was sucked into the beginning 10 chapters while crunching numbers at work and I'm so glad I did. It felt more like a radio broadcast than anything else and is part of why I sped through this book. Even if you've read this already, play the audiobook if you have some hours to kill. You won't regret it.If you're a fan of the Gilead alternate universe (let's face it, no one is a fan of Gilead itself...but you know what I mean) then this is essential reading, obviously. If you've only read the novel, I highly suggest watching the entire series (and if you are in the middle of it, you should finish it). The whole is MUCH greater than the sum of its parts, a rare feat for a \"mixed media\" type of experience.",
                "reviewVotes": "76 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ZOMGPWN❗",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDBTMZWRQJLF7Z4IUSCALL6PPMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R44PXTOOOIPO6?ASIN=B07KYSPLBJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2019",
                "reviewTitle": "5.0 out of 5 stars Perspective and context",
                "reviewText": "It's tricky to mess with a classic. I think it's mostly because once a piece of art attains \"classic\" status, almost all of those who have experienced it - in the case of a classic book - read it, now feel like they own it. Books and films in particular have a hard to define participatory effect where the reader becomes part of the story and therefore defines the story and characters according to their own interior perspective and thought process. When it comes to either the most revered classics and/or books that achieve their renown via first person, possibly unreliable narrator who exists in a world not fully sketched out and purposely left hazy as a storytelling device, the more the reader will tend to go ahead and sketch that world out with their own assumptions. This means that said classic book becomes something slightly different for every fan, taking on a particular shape and form that becomes almost talismanic for some, quasi-holy for others. It would be hard to find a book published in the last half century more revered than The Handmaid's Tale, so when we all saw the announcement that Margaret Atwood was bringing a sequel, we also all knew there would much hand-wringing and kvetching no matter WHAT the next chapter focused on. For my money, you couldn't ask for a better continuation of the story.I first read The Handmaid's Tale last year. It had nothing to do with the TV show or cultural resurgence of the story and it's oh so prescient themes. It was just on my bookshelf of \"VERY IMPORTANT BOOKS YOU SHOULD READ SOMEDAY\" and I finally got around to it. As a 49 year old white middle-class male raised in a middle-class Mid-Atlantic USA type of world I really didn't think it would be a home run for me. I was wrong. I fell down the same hole that so many others have found themselves tumbling through into Gilead and the murky, strange world of Offred. I love the entire thing, including the post-script... thought about it for about two weeks, then moved on with my life. I haven't ever been interested in the TV show. When I saw The Testaments up for order, I figured I should at least see what shape the story would take and I hit the buy button. Now I have just finished it and not only was it what I was hoping for but I don't think anyone could hope for anything better than this, in regard to gaining perspective and context on what led up to the previous book as well as the fallout of the events that take place in The Handmaid's Tale.As mentioned, there will always be some that don't WANT perspective and/or context on a classic, timeless allegorical and prophetic novel. For me though, it was fascinating. Seeing motivations peeled back, repercussions revealed and a legacy played out over a new generation added immensely to the previous story and only made it more emotional and tender to me. Sometimes when a story ends you almost don't want to know what happens to a certain protagonist and sometimes you are just itching to know more. I wasn't sure how I felt about Offred and/or the entire cultural landscape in the Handmaid's Tale, but now that I know more, it all just feels deeper and more meaningful to me.I'm trying hard to not put any spoilers in this review, even light ones, so there's a lot I don't want to say. I will put it like this. If The Handmaid's Tale was a close-up on one character, The Testaments is a panning, wide-shot of an entire culture that encompasses three main viewpoints and ties together in a satisfying and logical way. It does take a few chapters to build up some steam, but trust me when I say, once the story gains momentum - it moves along quickly and flows in some unexpected directions.Sequels written decades later can end up really crashing hard sometimes, but in the hands of such a talented author, you get a book like The Testaments. It meshes perfectly with the previous story while still being timeless and speaking to current society at the same time. Since I'm just one person, that's just my opinion and many will find fault with this book, believing it's either too much or not enough, or not necessary or whatever. But I think it's a great gift from an author to her fans. Unwrap it and enjoy.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DW_4343",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLB4DAOXOQG6FKUV72FROVU3TZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2032THEZWH9JN?ASIN=B07KYSPLBJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "4.0 out of 5 stars The Handmaid’s Revenge",
                "reviewText": "I read ‘The Testaments’ after ‘The Handmaids Tale’, I guess, because the first book was such a “downer”. It was just plain sad and even depressing. This second book, while trading on the content of the first, featured a more positive theme and a better conclusion. The characters were well developed and the story and action was well paced.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6UK5JTTIJATVPVOWPQBFTHSWKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MMR5VLYDSN3K?ASIN=B07KYSPLBJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars great book",
                "reviewText": "Great follow up to the Handmaids Tale. So glad the sisters were reunited with their mother. A wonderful book to read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mia S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKCW5JMXRM274XTGJJMT4EURQXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XV880ZQVS81N?ASIN=B07KYSPLBJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Written different than expected but wonderfully. I was pleased that Gilead fell.",
                "reviewText": "I enjoyed the book. Of course as is often the case for myself, I wasn’t ready for the end. Not every question I had was answered but the important ones were. The follow up many many years in the future was interestingly unexpected. I really can’t say more than this as I will not be a reviewer who “spills the beans”.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. L. Sapp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZVFDO35CN4JE23LDBQL5BTOCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SXWXDGPOYZ9E?ASIN=B07KYSPLBJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing",
                "reviewText": "Although it takes a little off this book to get going, once it does, it is amazing. The story is captivating. The characters are so real. A fitting by sequel to The Handmaid’s Tale.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHWZUMXR65YE4DX6HB7TWCKKVGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18X4OL0LI06DZ?ASIN=B07KYSPLBJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "4.0 out of 5 stars liked it",
                "reviewText": "Interesting follow up. A little more action than the original. 1 2 3 4 5 6 7 8 9 o",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fuzzarilly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDXNXDIKPFAVOQYM7S4MNPZ66FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVM1KHRKRYV1H?ASIN=B07KYSPLBJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars The Testaments",
                "reviewText": "I throughly enjoyed this. I would love to read a third novel about The Handmaids Tale but I did like how this pretty much ended the story. It was nice to know what happened to Gilead. Margaret Atwood is a fascinating and intriguing writer.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "robmik43",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Very nice",
                "reviewText": "Was a gift. Recipient very pleased.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deya Cast",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 19, 2023",
                "reviewTitle": "Excelente libro",
                "reviewText": "Llegó en perfectas condiciones y es de excelente calidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andressa S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 15, 2023",
                "reviewTitle": "Livro grande",
                "reviewText": "Adorei o livro (não li ainda). Ele e6bem grande, mais de um palmo. A fonte é perfeita, o espaçamento entre linhas é ótimo, não deixando a leitura pesada. Recomendo. Custo benefício tá ótimo. Comprei a 26 reis e agora está a 21. Corram!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel W.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 16, 2024",
                "reviewTitle": "I could not put this down…",
                "reviewText": "But at the same time was terrified of what would come next. Amazing book. I loved it. I need to watch the series now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catarina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 7, 2023",
                "reviewTitle": "Livro muito bom",
                "reviewText": "Para quem já leu o livro anterior, este é um MUST.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}