{
    "remaining_requests": 1570,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Crypt-Shakedown-Book/dp/B0C5N8X8S9",
    "body": {
        "name": "The Crypt: Shakedown: The Crypt, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Crypt-Shakedown-Book/dp/B0C5N8X8S9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51X46t7JyqL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Scott Sigler",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Scott+Sigler&search-alias=audible"
        },
        "brand": "Scott Sigler&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 506,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The only way out is to die...Few know the warship’s actual name. Fewer still know what it really is. And almost no one knows of its unique ability, an ability that could tilt the balance of power if not outright win the war.But everyone has heard the rumors. Rumors about the worst place the Planetary Union Fleet can send you. Rumors of a ship with an eighty percent crew mortality rate. In these hushed, fearful whispers, the ship does have a name. People call it “the Crypt,” because those aboard are as good as dead.The PUV James Keeling can do something no other vessel in existence can do—slip into another dimension, travel undetected, then re-emerge onto our plane and surprise enemy targets. But the thing that makes the Crypt unique also makes it a nightmare for those onboard; interdimensional travel causes hallucinations, violent behavior, and psychotic breakdowns.Keeling could be the Union’s greatest weapon, a game-changing asset that can defeat the bloodthirsty zealots of the Purist Nation, the Union’s mortal enemy. If, that is, the brass can find the right crew.But with those dark rumors traveling at lightspeed throughout Fleet, sailors with connections, with favors to call in, or those with careers on the rise pull any string they can to avoid being assigned to the Crypt. The brightest and best shield themselves from this top-secret craft, yet the brass must send it out on critical missions.As the war drags on and casualties pile up, Fleet crews the ship by assigning the worst of the worst. If you are convicted of assault, fraud, cowardice, theft, rape, murder—or you cross the wrong Admiral—you may find yourself aboard the Crypt. Most are given a choice: serve a two-year stint on the Keeling and have your record expunged, or be executed for your crimes.Welcome to the PUV James Keeling, where the only way out… is to die.#1 New York Times Bestseller Scott Sigler returns with this highly anticipated Military Sci-Fi series, THE CRYPT. It's BATTLESTAR GALACTICA meets EVENT HORIZON in this tale of service and solitude. Pre-order your copy today! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "16 hours and 57 minutes"
            },
            {
                "name": "Author",
                "value": "Scott Sigler"
            },
            {
                "name": "Narrator",
                "value": "Ray Porter"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 03, 2023"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0C5N8X8S9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,767 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #50 in Military Science Fiction (Audible Books & Originals) #118 in Adventure Science Fiction #126 in Military Science Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Catalyzt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSTFPLQXLC2ZQI6FX5KYKHI4VMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P20TYMGTCGQ3?ASIN=B0C5N8X8S9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Looking For Weird? Look no Further.",
                "reviewText": "My first try with this author. This was a great ride. A little about me, so you can get a sense of the kind of reader this book might appeal to.Not typically a military sci-fi fan, I've come full circle: As a kid, I was fascinated by and studied submarines. As a tween and teenager, I was a die-hard hippie pacifist. As a young adult, I crewed in a punk band in New London with an audio engineer who had been dishonorably discharged from long-range sound detection for dropping acid on boomers-- but who never, ever let a military secret slip, no matter how wasted he got. My bass player and I sailed up to subs under construction in Groton until they pointed M16s at us; our previous bass player drafted me as first mate for a sailing trip from Nantucket to Long Island where we were used as a target in a sub training exercise (three subs surfaced at the same time, one right behind us.) I switched careers in late mid-life to psychotherapy, and have been honored to serve a few vets from different branches of the military. And I come from a Navy family with a strong background in hard sciences, and have been an SF fan since the late 60s.So I wound up being the perfect audience for this book. I don't want to give away much-- I will say that I was almost turned off by the gory attacks by female characters in the first few chapters, almost didn't get past the sample... but I'm glad I did.The characters are strong, and remind me of some of the submariners I met in NL. The transdimensional travel is interesting; at points I thought, \"Mmm, this seems like a plot device so the author can use analog targeting he may be more familiar with,\" and maybe it was, but at a certain point, I didn't care. Another bias of mine is that I love analog watches and clocks, which featured prominently in the tech. As a former diver, I liked the Raiders gear, too-- like older scuba gear, yeah, you can use it if it late into its service life if it has a few minor problems, but combine an aging rig with an inexperienced diver, and you've got lethal risk.The tactics and descriptions were really good. It's hard for me to visualize a battle in 3D, but Sigler's diction is careful, precise, and economical-- I could pretty much visualize what was going on. Physics seemed pretty solid, though I couldn't follow all of it just because my brain doesn't do that well with numbers. I am a recovering tech writer, so it's nice not to find any obvious mistakes-- I think I spotted one typo in the whole book.To top it off, I read the book during a bad case of COVID, with my fever spiking past 102, interrupted by an online appointment with my neurologist, so I was actually delirious at the time. I think I would have been properly terrified by the book even if I had known I was certain to recover. (I'm high risk, so that wasn't actually clear.) Let's say that the books vivid, hallucinatory quality was not lost on me.In some ways, the best parts of the book were the little stuff, the throwaway lines and images that drive the Keeling deep into the butterscotch zone. My favorite scene wasn't even integral to the plot: The Raiders card game in transdim. Hey, I lived through the '70s... and played in card games like that.Look, this book isn't for everybody. All I'm saying is, even if you usually don't like military SF, it might be for you. Thanks to Sigler for a fine read that kept me suitably distracted during a scary run-in with a nasty virus!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James A. Pavlik",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVI673PD4XWCTZIYUSYB2UNZ57Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFPG6OVY27TA?ASIN=B0C5N8X8S9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Not your normal space opera!",
                "reviewText": "Ok, on the surface, this story seems like a lot of other space opera types. disgraced hero, and other assorted misfits, is offered prison or death, OR to serve on a \"classified / cursed / broken down / one way suicide mission to regain their honor. BUT, in this book the story takes a left turn into the unknown. you are introduced to a cast of misfits, all given the same option, 2 years on the ship nicknamed the Crypt, or Prison / death. beside those people, there is a scattering of people who volunteered for this duty, either trying to prove themselves, or in one case, an old soldier who wants to go out fighting, and not in his bed. as the story goes, these people are introduced to the ship, which is not built by human hands, a Biomechanical ship, a LIVING ship that can go into another dimension, a dimension that drives people insane. BUT, no one can track the ship in that other dimension, and they can, sometimes, track others without others being seen. this makes the ship, with all it's flaws, the perfect spy ship. I am leaving a lot out, because, Spoilers. this is a new trist on the space opera stereotype, and it is a GOOD twist. I am ready for the next book in this series, this one will keep you on the edge of your seat, hold on and enjoy the ride!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Calvin Pulizzi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF67BD52FZP4G67YXWWUNAXZYWGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IB0NOT5RGDV6?ASIN=B0C5N8X8S9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "4.0 out of 5 stars Event Horizon meets U571 sort of",
                "reviewText": "There's a lot to say about this book. I'll give the author credit, he did a great job writing about a large group of characters and making them all distinct individuals with different personalities and backstories. Bennet was easily my favorite character. A normal man stuck in a very not normal situation. This is a really long book but it kind of needed to be in order to properly introduce all the characters, they're various ways of ending up on the Keeling, their initial training, and then their first mission as the big finale. There's a ton of questions left unanswered about the ship, which will hopefully be answered in book 2. I'm very interested to see what happens with Anne and Bethany. Overall, it was a good book, but I hope it doesn't turn out like Lost: too many unanswered questions",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam Gerstein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFX2OIWRDXPF7SVXGALBPEJXQJZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MLGTCCDFJW3N?ASIN=B0C5N8X8S9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect introduction to this new storyline",
                "reviewText": "I've been listening to Sigler's content since about 2006, which includes his first pass at this \"universe\" - a series of character studies/backgrounds. It was amazing to listen to then (around 2008).Reading this new version was, as he explained before it was released, different. And it is. Very different. It's consistent with the rest of his \"Siglerverse\", but you don't have to read ANY of that content - it's just enhanced by it.The story is consistently great to read, with twists and turns you don't expect, characters that are as devious as you can imagine, and a setting that's as amazing as it is disturbing.I dreaded reading this book - I've been a fan for so long that I was worried it would be just like everything else he creates - amazing while I'm in the story, but the second you're done, it leaves you wanting more. That was exactly the case with \"The Crypt: Shakedown\" - I couldn't put it down, but when I was done, I wanted more.To say I'm anxiously awaiting the next installment - knowing that it will take at least a year and mean seeing several other releases in the meantime - is an understatement.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. Copenhaver",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDLW7X6Y6PSQVUSG7KJPPG5PYUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3420L90W486HC?ASIN=B0C5N8X8S9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Intense action, great characters, can't wait for the sequel",
                "reviewText": "As a long-time fan of Sigler's work, I had listened to the original \"Crypt\" in podcast form. This is a near complete re-write, so even if you think you know the story there will be plenty of surprises.I listened to the audio version this time, Ray Porter narrates and does a great job.If you are looking for sci-fi that has hard science, great characters, and plenty of action you'll enjoy this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "david edwards",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 11, 2023",
                "reviewTitle": "this one lives up to what I wanted it to be",
                "reviewText": "I can’t remember when I first heard the audiobook, but I have been waiting for this. Good job Scott, really!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "anthony",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2024",
                "reviewTitle": "Enjoyed",
                "reviewText": "I have read all of scott siglers books, this one another master piece, looking forward to the next installment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ben G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 24, 2023",
                "reviewTitle": "Fantastic story full of action",
                "reviewText": "Another gripping, original and entertaining story by Scott Sigler. He writes in a way that drags you into the story and you can picture being there amongst the action.Highly entertaining and enjoyable read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cordinia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2023",
                "reviewTitle": "Slow start but what a finish",
                "reviewText": "Took a chance and boy am I glad I did. Really interesting plot and complex characters. The politics of the galaxy are also open for a lot of exploration. Good action in the last third of the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Andrew J. Knight",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 23, 2023",
                "reviewTitle": "Excellent first instalment of what will be another epic series",
                "reviewText": "This is the first book of a five book series as usual Mr Sigler is taking you in to a wonderfully crafted story with a deep history that will leave you begging for the next instalmentI have been a Sigler junkie from the free podcasts and all have been crammed with characters of such depth you feel you know them personally",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}