{
    "remaining_requests": 1652,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tomorrow-novel-Gabrielle-Zevin/dp/0593321200",
    "body": {
        "name": "Tomorrow, and Tomorrow, and Tomorrow: A novel",
        "price": "$14.71$14.71",
        "originalPrice": "",
        "rawPrice": 14.71,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tomorrow-novel-Gabrielle-Zevin/dp/0593321200",
        "soldBy": {
            "sellerID": "AJQMILYQ478KQ",
            "name": "Citadel Goods LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AJQMILYQ478KQ&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91VcwLdcNHL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gabrielle Zevin",
            "link": "https://www.amazon.com/Gabrielle-Zevin/e/B001IGJWR2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Citadel Goods LLC",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 84567,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 16 mins",
            "FREE delivery March 1 - 8 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 6"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Knopf (July 5, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593321200"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593321201"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.48 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.4 x 1 x 9.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#194 in Books (See Top 100 in Books) #4 in Friendship Fiction (Books) #41 in Literary Fiction (Books) #229 in Contemporary Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 84,567 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1391f5bb-3d27-4ef5-b331-16fd8c3d0d03.__CR0,0,1746,540_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30bbdbbf-69ad-4eca-a218-8eaf310d8375.__CR0,0,1746,540_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/291d020d-b653-4c60-a925-efffba849af9.__CR0,0,1746,540_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd8a20ae-b153-4e5c-94b6-7c3ccf847169.__CR0,0,1746,540_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "elysejody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2ZJT6CUNHCHQDOC4F575DMG2CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV1FBHVM4718B?ASIN=0593321200",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2022",
                "reviewTitle": "5.0 out of 5 stars relationship themes & game metaphors are balanced brilliantly",
                "reviewText": "I loved everything about this book…It’s adorable, sweet, sad, theatrical, character-collaborative-driven-in-spirit, artful, smart, emotional, intellectually rigorous, perceptive, and wonderful…I could name a dozen more vertiginously exciting . . . vibrant wordsto reflect the deep satisfying experience this novel is.Even at oddball moments, Gabrielle Zevin’s novel flourishes surprising wisdom touching on the most common elements of the heart…..with unforgettable indelible characters.In totality…….IT’S ALL BRILLIANT!…..and VERY ENJOYABLE!!! ….the writing, narrative, structure, (the gaming), the characters: (major and minor), and their relationships are LOVABLE as can be….Sadie (Jewish-American) was one of the most brilliant people that Sam (American, part Korean and part Jewish descent) knew.He hadn’t seen her in years—until he did—since their childhood in Southern California. Sadie went to MITSam went to Harvard…..[Sam’s roommate-Marx- is a crucial part of the story, too]…Other favorite characters are *grandparents*… GOTTA LOVE the generations — of love….The context themes of love, loss, and life tragedies, are captured with sincerity, depth, and honesty.This book could only have been written by somebody who has experienced grief to great lengths. Zevin has an impressive imagination and proficient talent…..leaving us readers with a memorable feat of storytelling, fine prose, and heartbreaking real characters.I was one of those readers who fell in love with her novel “The Storied Life of A.J. Fikry”…..(It wasn’t too ‘sappy’ for me as it was for a few of my friends), but THIS….”Tomorrow, Tomorrow, Tomorrow”…..is more sophisticated….more fully developed….Zevin is in her prime with this novel…. ……I can’t imagine any reader ‘disliking’ it…..There is something for everyone….many issues to contemplate!!!! …..an examination of very profound friendships—The ‘relationship-complex-love-friendship-issues’ were masterfully explored.The brilliance shines throughout…… ….with a look at the effects of tragedies, violence, illness, death, parents, grandparents, feelings of loneliness, fitting in, admiration for gaming designers….(especially women in the profession)…love for people, love for one another, and an enhanced respect for the benefits of gaming ……About the aspects of ‘gaming’ …. …..NOBODY NEEDS TO BE DIRECTLY interested….But……I realized by the end of this novel (after tearful melancholy feelings), that there are benefits from gaming….They ‘really’ must improved cognitive abilities, improved problem-solving skills and logic….BECAUSE…. …..the characters in this novel (who played and created these games) WERE able to apply their technical skills to their relationships. It was subtle—but not-not unnoticed.So…..parents: I wouldn’t worry if you can’t get your kid to stop playing games too much. It’s amazing how much they are learning about life….in relationship to others.One more thing I must say …..then I’ll leave a few excerpts…I thought the very beginning was MASTERFULLY written. I can’t remember ever reading a book that pointed to the ‘past, present, and the future’ at the same time more magnificently. SO WELL DONE!!!Ok….enough of my excitement….Here are some excerpts: “Before Mazer invented himself as Mazer, he was Samson Mazer, and before he was Samson Mazer, he was Samson Mazur—a change of two letters that transformed him from a nice ostensibly jewish boy to a Professional Builder of Worlds— and for most of his youth he was Sam—S.A.M. on the hall of fame of his grandfather’s ‘Donkey Kong’ machine, but mainly Sam”.NOTE: the above excerpt— written at the start- is worth reading a few times. (IMO)….then let it go…..it will show up in different ways through the rest of the novel. “Sadie! SADIE! He felt foolish. SADIE MIRANDA GREEN! YOU HAVE DIED OF DYSENTERY!” “Finally, she turned. She scanned the crowd slowly and when she spotted Sam, the smile spread over her face like a time-lapse video he had once seen in a high school physics class of a rose in bloom. It was beautiful, Sam thought, and perhaps, he worried, a tad ersatz. She walked over to him, still smiling—one dimple on her right cheek, an almost imperceptibly wider gap between the two middle teeth on top—and he thought that the crowd seemed to part for her, in a way that the world never moved for him”. “It’s my sister who died of dysentery, Sam Masur, Sadie said. I died of exhaustion, following a snakebite”. “And of not wanting to shoot the bison, Sam said”. “It’s wasteful. All that meat just rots”. “Sadie through her arms around him. Sam Masur! I kept hoping I’d run into you”. “What brings you to Harvard Square? Sam asked”. “Why the Magic Eye, of course, she said playfully. She gestured in front of her, toward the advertisement. For the first time, Sam registered the 60-by-40-inch poster that transformed commuters into zombie horde”. “SEE THE WORLD IN A WHOLE NEW WAY. THIS CHRISTMAS, THE GIFT EVERYONE WANTS IS THE MAGIC EYE”.Sadie….with thoseheterochromic eyes….. “In which case, the only proper thing for us to do right now is have coffee, Sam said. Or whatever you drink, if coffee’s too much of a cliché for you. Chai tea. Matcha. Snapple. Champagne. There’s a world with infinite beverage possibilities, right over our heads, you know? All we have to do is ride that escalator and it’s hours for the partaking”. “If this were a game, he could hit pause. He could restart, say different things, the right one’s this time. He could search his inventory for the item that would make Sadie not leave”. “You would think women would want to stick together when there weren’t many of them, but they never did. It was as if being a woman was a disease that you didn’t wish to catch. As long as you didn’t associate with the other women, you could imply to the majority, the men: ‘I’m not like those other ones’. Sadie was, by nature, a loner, but even she found going to MIT in a female body to be an isolating experience. The year Sadie was admitted to MIT, women were slightly over a third of her class, but somehow, it felt like even less than that. Sadie sometimes felt as if she could go weeks without seeing a woman. It might have been that the men, most of them at least, assumed you were stupid if you were a woman”.“What is a game? … It’s tomorrow, and tomorrow, and tomorrow. It’s a possibility of infinite rebirth, infinite redemption. The idea that if you keep playing, you could win. No loss is permanent, because nothing is permanent, ever”.Wonderful….as wonderful as can be!!!elysejody",
                "reviewVotes": "219 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Juneau",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPKQFHKU74ZPTH3H4ZLZEWEEJQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AX0W999O9B5E?ASIN=0593321200",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2023",
                "reviewTitle": "4.0 out of 5 stars A Love Letter to Video Games (and the friends we made along the way)",
                "reviewText": "This book seems to be sweeping the nation as the new “The Fault in Our Stars“. It’s got higher than 4 and a quarter stars for having 300,000 reviews, which means it’s a box office smash (at least as far as books ago). So what is it about? Is it a romance? An adventure? A family saga?Kind of all three, but also not all three. It’s the story of two people who create a video game company. These two, a girl and a guy, used to be friends as pre-teenagers, but had a falling out. In college, they both fall into programming which leads to video game making, which leads to the story at hand as they become friends and business partners. Also, it’s about the other people that come into their life as a result of that, such as the best friend/roommate who goes from theater major to video game producer and the girl’s college professor. The story takes place from 1995 up to present day.Let’s talk about the two main characters. One is Sam. His trauma is that he has a foot that was broken in a million places, a handicap which has made him taciturn and stoic, though he reads like autistic–overanalytical, judgemental, aloof.The second is Sadie who also found solace in video games, as her sister had childhood cancer and became the focus of the family’s attention. She bonded with Sam since they both were often in the children’s ward of the hospital. Sadie has bouts of depression and insecurity, even though she’s a game-making genius. This leads to an affair with her foreign-born video game professor who’s one of “those” types (egotistical, pompous, always thinks he’s right and everyone else’s opinion is wrong) and much unhealthy relationshippage occurs.From the first chapter, I wasn’t sure how this would go down. Since the first main character is Sam, it sounded “The Curious Incident of the Dog in the Night-Time“. The writing sounded like writing. The dialogue did not sound like how people talk. But I gave it the benefit of the doubt and continued. It starts out almost being a sick kids romance (The Fault in Our Stars, Everything, Everything, Five Feet Apart) But I was able to get past that and into the core of the book, which is about the creation of video games–what ludonarration means, video games as art, as ways to make the audience feel something.It romanticizes the idea of video game development, ignoring things like “crunch time“, running a business, office politics, and other meta elements that come with complex media production. Instead, the author focuses on the relationship between the people working on the project (e.g. game producers as public figures such as Will Wright or Richard Garriott).The author is writing video games not as they were but how she wishes they could be. Which would be fine… if the majority of this book didn’t take place in the past. See, the big video game they make is called “Ichigo” and the way they talk about it, it seems to be along the lines of “Limbo” or “Undertale”. It sounds artsy and avant-garde, which would be fine if this took place today. But in 1995, there were no such things. Video games didn’t make people cry in 1995. And they certainly weren’t used as pack-in games for new consoles, which is what this game becomes (as part of a plot point). The top games in 1995 were Quake, Duke Nukem 3-D, Command and Conquer, Super Mario 64, etc. War games. Shooters. Well-established franchises.You couldn’t be successful unless you were at least a little bit commercial. There is no freakin’ way someone would have made an artsy game as the pack-in. (They weren’t even using pack-ins anymore by this time.) And certainly not a game from a new unproven studio with just two people. There were no Bastions or Insides or Journeys or even Bioshocks that you could point to and say “here’s a successful example of the video game we’re making and that’s why this is going to work.”So that’s what bothers me the most–the backdrop is not plausible, and I pointed out a hundred times where “this wouldn’t have happened”, “no way should this have happened”, “the industry would have reamed them out if this happened”. The only game during this era I could even try to point to that succeeded was “Myst”. And that game succeeded because it had a big new gimmick–the CD-ROM which allowed complex graphics and FMVs. No such innovations in this book. It wasn’t until 2003 that companies started taking chances with non-traditional games (e.g. “Katamari Damacy” and “Shadow of the Colossus“).On the other hand, maybe this is the author writing about video games and how they evolved as she wishes they had been. Instead of it all being guns and gore and misogynistic heroes like Duke Nukem and Solid Snake, she wrote a universe where video games catered toward all genders instead of just guys. There’s no reason video games had to be marketed toward boys. It was just what they did in the eighties because executives believed in “there are toys for boys and toys for girls and there is no crossover.”There is good writing here. I particularly fell for the beautiful chapter in the third act break (no spoilers!). If you don’t know anything about video games as an industry, you will enjoy this book. If you do, you will probably be tempted to throw it away because of how unrealistically it portrays the industry. Myself, I’m halfway on it. The story itself feels like something that could make an excellent Netflix short series. The video game backdrop drove me nuts, but I’d be lying if I said this wasn’t the kind of book I wish I could write.",
                "reviewVotes": "80 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "catherine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2024",
                "reviewTitle": "Really exquisite read",
                "reviewText": "I love how the story is about life through the lens of 3 friends. Their ups and downs, success, stress, lost, and their love, jealousy and even dislike of one another at times. A few chapters are a unique wild read, but I adored them because they made me curious and yet it tied everything together. While serious life events happen in the book, it’s not a heavy read and there was always something calling me back to find out what happened next. Just a pleasant read with a solid comforting ending.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2024",
                "reviewTitle": "More than a story about gaming",
                "reviewText": "As someone with zero interest in computer games, I was surprisingly drawn into this world through the characters and their experiences with gaming throughout their lives. Indeed, this was a detailed look at growing up, the evolving of personalities through experiences, and the development of friendships, rather than gaming itself. Wonderful storylines and characters; I can see why it’s been such a hit in the charts. Thoroughly justified",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 14, 2024",
                "reviewTitle": "Enjoyable friendship novel",
                "reviewText": "Sometimes it felt a little pretentious. But it's a beautiful bittersweet story. I feel like I should be hoping for more but I don't. It feels like lifeThe writer is clearly not a game designer but it's fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Briten-Fan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 30, 2024",
                "reviewTitle": "Loved it!",
                "reviewText": "It's such a different exciting world...I finished reading this book in three days, and it's still in the back of my mind, two weeks later.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 22, 2024",
                "reviewTitle": "Kom I bra skick",
                "reviewText": "Inte läst än",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.71",
                "sellerName": "thebookforest",
                "sellerRating": "5"
            }
        ]
    }
}