{
    "remaining_requests": 1360,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cahokia-Jazz-Novel-Francis-Spufford-ebook/dp/B0C7RNBPHC",
    "body": {
        "name": "Cahokia Jazz: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cahokia-Jazz-Novel-Francis-Spufford-ebook/dp/B0C7RNBPHC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71LKjygnUAL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Francis Spufford",
            "link": "https://www.amazon.com/Francis-Spufford/e/B001HCV3N8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 168,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Named a Best Book of the Year by The Guardian and The Financial Times From “one of the most original minds in contemporary literature” (Nick Hornby) the bestselling and award-winning author of Golden Hill delivers a noirish detective novel set in the 1920s that reimagines how American history would be different if, instead of being decimated, indigenous populations had thrived.Like his earlier novel Golden Hill, Francis Spufford’s Cahokia Jazz inhabits a different version of America, now through the lens of a subtly altered 1920s—a fully imagined world full of fog, cigarette smoke, dubious motives, danger, dark deeds. And in the main character of Joe Barrow, we have a hero of truly epic proportions, a troubled soul to fall in love with as you are swept along by a propulsive and brilliantly twisty plot. On a snowy night at the end of winter, Barrow and his partner find a body on the roof of a skyscraper. Down below, streetcar bells ring, factory whistles blow, Americans drink in speakeasies and dance to the tempo of modern times. But this is Cahokia, the ancient indigenous city beside the Mississippi living on as a teeming industrial metropolis, filled with people of every race and creed. Among them, peace holds. Just about. But that corpse on the roof will spark a week of drama in which this altered world will spill its secrets and be brought, against a soundtrack of jazz clarinets and wailing streetcars, either to destruction or rebirth.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C7RNBPHC"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Scribner (February 6, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 6, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 9837 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 455 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1668025450"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,035 in Kindle Store (See Top 100 in Kindle Store) #11 in British & Irish Literary Fiction #26 in Alternate History Science Fiction (Books) #34 in Financial Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 168 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4eb29114-fd4c-4d07-8e1c-354d1ac0ae91.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2996f408-27a8-4a89-934c-a7356a5bc98f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/81d6a071-c40a-47b5-af2d-c793bad6e438.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0cdd0645-d97c-4556-b27d-69fc26dff301.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b915f1e7-420a-4f51-ac38-fa160a195640.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09963919-8067-4357-9bf9-a72cd3c260ff.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nancy Adair",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQHNAXOEGSAZLAYOQRG3VR2DC6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E68BZB7LV4J6?ASIN=B0C7RNBPHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Alternate History Noir",
                "reviewText": "Spufford imagines a New World visited first by a less deadly smallpox virus, leaving the indigenous population immunized. With a healthy Native American presence they were able to establish their own state in the middle of the continent where native, black, and white are equal. The Jesuits converted the Native Americans by overlaying Christian ideas on the native myths. The land is not privately owned, with limited time leases for its use. And, there are the figureheads of a king and his princess sister.The white immigrants from the North come for jobs but bring their racial prejudices.The novel begins with the horrific murder of a white man, found with his heart torn out in imitation of ancient Aztec ritual killings. The whites flee the state, and those who remain are ready to riot against the Native American government.Detective Barrow, a Native American who grew up in an orphanage, is on the case. Identified as Thrown-Away Boy, a hero in native legend, he is given access to the royal palace, and encountering the beautiful princess, falls in love.It is a novel rich in detail and character, a great mystery, if not a fast reading page-turner, with interesting red herrings and twists. It’s immensely entertaining in the way a murder mystery or alternative history can be, but also reflects our contemporary world. Plus there is a love story! And scenes in a jazz lounge, with Barrow pounding out Jelly Roll Morton's \"Kansas City Stomp\". And a spunky secretary who staples the hand of a man who goosed her one time too many.Then, there is the great noir style writing. \"His voice was a Boston Brahmin Drawl, with vowels as aristocratically deformed as if an ottoman has been dragged on top of them.\" \"Muscle work was a stupid thing for a pianist to get involved in.\" \"Their money was so old that it underlay the United States like geology.\"Thanks to the publisher for a free book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kathleen g",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF35564CAWXR67LRE2C2YVX36KHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGM4KT7JXIG8Q?ASIN=B0C7RNBPHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars patience will be rewarded",
                "reviewText": "A densely plotted, at times challenging, novel that both an alternative history of the US and a mystery. Fans of Spufford know that there might be a spot in the novel where you want to put it down, rest for a while and maybe not pick it up again. And then you do because it's a rewarding read with good characters who you will find yourself caring about. The worldbuilding here- Cahokia in the 1920s- is imaginative and thoughtful. If the detectives Drummond and Barrow feel a tad trope-y, they aren't- they are quite original. It sprawls, it circles, it is classic Spufford. Thanks to the publisher for the ARC. Don't miss the afterword. This is one to savor.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tony Thomson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCQTZCY6S3WUTDAHJEX4SWJVJQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RZUQ6E5E5IRF?ASIN=B0C7RNBPHC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "1.0 out of 5 stars Unlocks the Real Meaning of Unreadable",
                "reviewText": "somehow boring and whimsical at the same time - has an academic quality - and much, much too long",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Adrian Mcmenamin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 15, 2023",
                "reviewTitle": "Love letter to a different America",
                "reviewText": "Perhaps oddly, at the end of this I was left with the sense this was a love letter to the US. To its role as a cultural melting pot, to its democratic order, to its sense of potential and commitment to human betterment.The odd bit is that, of course, this book isn’t about the (real) USA at all but a fictional US where native American civilisation remained strong and was able to both decisively influence the outcome of the civil war and set the terms on which it entered the Union.The US we see here is recognisable, the roaring 20s, the Klan, prohibition and the emergence of a new politics in the era, but it’s also a liberal fantasy too.A fantasy under attack and the hero, Detective Barrow, must decide if he will defend it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alex russell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 17, 2024",
                "reviewTitle": "A Fantastic Thriller",
                "reviewText": "This is a classy thriller, innovative and imaginative, throughly researched, and it deserves to do well.It’s a thoroughly enjoyable book, skilfully written by a confident hand, with a gripping plot. There’s some great dialogue because the author obviously has a good ear for discourse, and this really helps the characterisation. The descriptions of place are good too and the reader can really feel that they’re right there in the world of that foggy city.In terms of critique, I had a sense that the author was in a rush to finish the last quarter of the novel. It still held my interest but the writing felt a shade more casual, less polished. Some editing is suggested too, for example, the cathedral scene isn’t really necessary, it adds nothing to the plot and is merely a superfluous set-piece, and there are a few set-pieces towards the end. The final scene is seeded so thoroughly that it’s no surprise when we actually arrive there.But don’t be put off by these moans because most readers will love the book, it’s just t",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise Jarrett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 9, 2023",
                "reviewTitle": "A slow burner",
                "reviewText": "Definitely a slow burner for me. His novel 'Light Perpetual ' grabbed me immediately - I was nearly half way through this before I was hooked.An unusual novel set in a 'what if' state in America where Europeans, native redskins and people of African origin live side by side in agreement. However when Fred Hopper is discovered murdered in an unusual way in an unusual place, it sparks off great unrest in the city, threatening to ruin everything or was there unrest building anyway?A story of racial unrest, of big dogs biting little dogs, of survival of a race, I'm not sure why it took me so long to get into this book.It could be because the hero; Joe Barrow, takes a while to decide what is important to him, what he is about and where he belongs. We get to know him as he gets to know himself. An orphan always struggling for a human connection, the book becomes interesting when he stops doing what his complicated parter; Drummond tells him to do and starts doing what he feels is right.All in all, a good read.Read by Methley Bookgroup",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 29, 2023",
                "reviewTitle": "Cahokia Jazz",
                "reviewText": "Cahokia Jazz is a novel focused on how it tells the story rather than telling the story, particularly in the first half. The author focuses on his language (the book is beautifully written) and the dialogue between the characters to set the scene as well as detailed description to help (in my opinion) the reader to understand the different communities in the book. However, I really lost the story and the plot because of this, and so found it underwhelming.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EmmaJMEmmaJM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 16, 2024",
                "reviewTitle": "Pages Missing",
                "reviewText": "Nooooo! Pages jump from 54 back to 23 and from 54 to 87. It is unreadable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71NRZDaYMuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71icTU3JZ4L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}