{
    "remaining_requests": 1563,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/American-Science-Fiction-Classic-Library/dp/1598531573",
    "body": {
        "name": "American Science Fiction: Nine Classic Novels of the 1950s: A Library of America Boxed Set",
        "price": "$56.10$56.10",
        "originalPrice": "",
        "rawPrice": 56.1,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/American-Science-Fiction-Classic-Library/dp/1598531573",
        "soldBy": {
            "sellerID": "A3DPOCK2IHLX0M",
            "name": "PLANET-SURPLUS",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A3DPOCK2IHLX0M&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71JGqNTsqLL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Various",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Various&text=Various&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "PLANET-SURPLUS",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 72,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22. Order within 18 hrs 8 mins",
            "FREE delivery Monday, February 26",
            "Or fastest delivery Thursday, February 22. Order within 18 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ The Library of America; First Edition (September 27, 2012)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 1750 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1598531573"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1598531572"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 3.38 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.52 x 3.07 x 8.52 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#835,243 in Books (See Top 100 in Books) #380 in Science Fiction Short Stories #2,044 in Science Fiction Anthologies (Books) #8,856 in Short Stories Anthologies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 72 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David Valentino",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECKMTIMUQ6ELPSSEXQ53MLHGVBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CYFY2G7JLGHU?ASIN=1598531573",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 6, 2019",
                "reviewTitle": "5.0 out of 5 stars A Must for Fans of Sci--Fi",
                "reviewText": "American Science Fiction: Nine Classic Novels of the 1950s: A Library of America Boxed SetOne of the best ways to own among the best of American writing is to explore offerings from the Library of America. Each volume includes annotated texts, biographies of the authors, and additional scholarship. This outstanding boxed set includes:Volume I: 1953-1956The Space Merchants, by Frederik Polh ad C. M. Kornbluth: A dystopian satire of consumerism run amok, in which advertising is not only a profession but the de facto government.More Than Human, by Theodore Sturgeon: Imagines the evolution of a new species of humanity, Homo Gestalt, and how it gains the key to survival, a conscious.The Long Tomorrow, by Leigh Backett: Among the first meditations on the aftermath of nuclear holocaust, in which humans resort to primitive living, except for a handful of scientists in a mythical city.The Shrinking Man, by Richard Matheson: The novel that birthed the movie cult classic, in which a man shrinks down to walk among the most basic elements.Volume II: 1956-1958Double Star, by Robert A. Heinlein: Follows the exploits of a near do well thespian as he assumes the role of a lifetime that lasts a lifetime.The Stars My Destination, by Alfred Bester: About a man driven to the ends of the solar system, and ultimately beyond, by his thirst for revenge, loosely patterned after Dumas’ The Count of Monte Christo.A Case of Conscious, by James Blish: In the future, a commission of humans confront the issue of morality without god on the planet Lithia, and the effect it would have on Earth society.Who?, by Algis Budry: A mash up of Cold War espionage, sci-fi, and alternative history that has a man questioning his very identity.The Big Time, by Fritz Leiber: As much a philosophical query into the nature of life, the effects of perpetual war, external life, love, and cynicism about pretty much everything, as it is about time travel and the disruption of the time line.Fans of science fiction will want to add this boxset to their collection.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7XO376URXXCSK332KEPQOX4CKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31SET9NO9TR51?ASIN=1598531573",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Overall a very cool collection",
                "reviewText": "I would give this a 4.5/5 if I could, but I optimistically rounded it up to 5.This is a nice collection with some of the greats. Overall it's a decent representation of 50s sci-fi, though of course if I could pick my own it would have been different, however I would have kept The Stars my Destination in my personal list because it is one of the best books ever! Double Star is curious pick for Heinlein, there are other fantastic books they could have picked for Heinlein that would have been a better representation, but hey, at least they included him!One gripe I have is the slip case. It has a big nasty QR code on the top which is like an annoying blemish on an otherwise fairly attractive case. It's not a huge deal, just a small nag. Like all LoA volumes, the binding and materials are all very nice, so this collection should last as long as you do (and longer) provided you take good care of it!Keep an eye on the price! Volumes like this fluctuate in price quite drastically, one month it might be ~$38 and the next it might be $70! If you're patient then you can grab it for a nice little discount off of the normal asking price.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6WKWLSEVUS7BZKBY7R4HF76X7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S6WJBU9OFCUB?ASIN=1598531573",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2012",
                "reviewTitle": "5.0 out of 5 stars Marvelous edition and great value",
                "reviewText": "I received this collection today as promised, having ordered it when the first announcement was made some months ago. I have not read the novels again but wish to comment on the presentation. The books are produced to the same standard as other LoA books, with clean typography, high-quality paper and Brillianta cloth binding. The end notes explain the sources of the texts (for example the multiple versions of Alfred Bester's The Stars my Destination, originally published as Tiger, Tiger) and define many names and places that might be unfamiliar. There also is a web site with essays on the novels and other information (loa.org/sciencefiction).In my opinion the nine novels are all among the best science fiction novels of the 1950s. There are some favorite authors missing, including Kurt Vonnegut, who has his own set of Library of America volumes, and Ray Bradbury, who may someday also have his own volume. But the selections are excellent and the presentation fine.Plus, to buy the least expensive mass market paperbacks of the nine would cost significantly more than the price of these volumes.",
                "reviewVotes": "46 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R N Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2HHU5BKZFS2CCRKWDXNRKLPSUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13Q0UZ48N6G0L?ASIN=1598531573",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2016",
                "reviewTitle": "5.0 out of 5 stars Nine Ground-breaking sf Classic Novels",
                "reviewText": "From what many consider the beginning of the golden age of sf novel writing, this two volume collection includes nine classic novels, some now difficult to find. The novels, originally published between 1953 and 1958, are surely among the favorites of experienced sf fans and readers, so for younger, less experienced sf readers this collection consists of key sf writers of the post-WWII era. Most of the selected novel titles have been considered ground-breaking, original in a time when sf was emerging from the pulp magazines to find a permanent home the publishing industry. The two book, boxed collection reflects the care taken in publishing works in The Library of America series. Notes and publishing history are sparse but informative. This nine novel set is now a permanent part of my sf library.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wandering boy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO6ZRVRAKPSNU3EPCVMWLHJOBYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5VY9A8T263SF?ASIN=1598531573",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2012",
                "reviewTitle": "5.0 out of 5 stars Why I fell in love with Science Fiction in the first place!",
                "reviewText": "The Library of America has done it again! I wasn't old enough to be reading these in the 1950s when they were published, but I did come along in the 60s and discovered science fiction by finding a stash of old pulp magazines. It was instant love with a specific type of story.As science fiction changed over the years, some of the directions taken were great and made wonderful reading, other directions were not quite as enjoyable to me, but I always missed the way it started. This compilation of novels is absolutely wonderful. It's like being taken back to the early years of science fiction writing.For the younger readers of science fiction, that have not had the opportunity to experience this style of writing, I highly encourage your buying this set and enjoying it. You will fall in love with a totally different style, and one that set the bar for future writers.Great reading.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 18, 2023",
                "reviewTitle": "Awesome product!",
                "reviewText": "Quality product. Apart the fact that the paper is a bit thin, this is pretty much the same quality as Everyman's Library. Medium size hardcover. I'm into collecting the amazing SF Masterworks books, and these 2 volumes contains 6 SF Masterworks novels, plus 2 others novels. I've also ordered the 2 sci-fi books from the 60's, glad cause it's gonna be the same quality product!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Markus Gerhard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 9, 2013",
                "reviewTitle": "Up to the highest standards",
                "reviewText": "I don't want to review the stories themselves as I find that this is matter of taste. So I rather like to review the presentation and production values of this edition.I must say this book is up to the high standards set by the library of america project. The paper is excellent as is the printing. Much clearer than the usual paperbacks. The additional material provided is also very well researched and provides some context for the materials.The cover illustration perfectly capture the essence of 50s Science Fiction.I would recommend this to anyone who reads science fiction.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$52.10",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            }
        ]
    }
}