{
    "remaining_requests": 1538,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Year-After-audiobook/dp/B014LBYA6S",
    "body": {
        "name": "One Year After",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Year-After-audiobook/dp/B014LBYA6S",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61f9YCMKorL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "William R. Forstchen",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=William+R.+Forstchen"
        },
        "brand": "William R. Forstchen",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 14019,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The thrilling follow-up to the New York Times best-selling novel One Second After. Months before publication, One Second After was cited on the floor of Congress as a book all Americans should have, a book discussed in the corridors of the Pentagon as a truly realistic look at the dangers of EMPs. An EMP is a weapon with the power to destroy the entire United States in a single act of terrorism in a single second; Indeed, it is a weapon that the Wall Street Journal warns could shatter America. One Second After was a dire warning of what might be our future... and our end. One Year After returns to the small town of Black Mountain and the man who struggled to rebuild it in the wake of devastation: John Matherson. It is a thrilling follow-up and should delight fans in every way. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            },
            {
                "name": "Technothrillers",
                "link": "https://www.amazon.com/Technothrillers-Thrillers-Mystery-Books/b?ie=UTF8&node=10497"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 51 minutes"
            },
            {
                "name": "Author",
                "value": "William R. Forstchen"
            },
            {
                "name": "Narrator",
                "value": "Bronson Pinchot"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 15, 2015"
            },
            {
                "name": "Publisher",
                "value": "Blackstone Audio, Inc."
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B014LBYA6S"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,029 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #5 in Technothrillers (Audible Books & Originals) #10 in Technothrillers (Books) #15 in Post-Apocalyptic Science Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNNT4VEF2U7GY6C73C6DIT5NAEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNTI9HSCLXL9L?ASIN=B014LBYA6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Sobering",
                "reviewText": "So much we take for granted so little we prepare for. Preparation is the soul of survival. We are headed in a very bad direction led by power hungry people. America has been led by people who understood that there was a single example to which we could point to for guidance. Those in power wish us to think that it is they who give guidance, but we all know from past history and the current Administration trying to deceive us at every turn, that is not they but almighty God that we must turn to. Those in power hate to think that they are not their own god.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. T. Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNP56ZSTYGPFXLY3WMMQ6QZTO6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MUU3ZLG20YEA?ASIN=B014LBYA6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars a must read in 2024",
                "reviewText": "important book for americans to read.this is a red flag book. a heads up book. it scared me, but i learned so much from it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Lucero",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZT6VVE6K7HFYGZATEXHUOUOCYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMU83OGT8EKF8?ASIN=B014LBYA6S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 9, 2023",
                "reviewTitle": "4.0 out of 5 stars We Can Only Hope & Pray Our Future Does Not Come to This....",
                "reviewText": "One year after an EMP strike against the United States leaves the once-powerful nation crippled, the North Carolina town of Black Mountain has managed to survive and regain some self-reliance. However, things are far from normal. They must return to farming techniques to ensure a steady supply of food, medicines are in short supply, as is fuel and communications. Students have been drafted into the local militia and spend an equal time protecting their community from gangs looking to steal in order to survive. Still, in all this, the town leader, John Matherson, has managed to create a sense of hope for his family and friends.This changes when a federal administrator arrives and informs the citizens most of the eligible people will be drafted in a new army and dispersed throughout the former nation to bring order in trouble spots. This does not sit well when it is learned cities throughout former America have descended into chaos and proven to be quite capable of defeating regular army troops. But Matherson is left with two choices: submit or refuse.When it becomes clear the federal administrator has a different set of goals in mind for the future of Black Mountain, John Matherson is ready to do the unthinkable.... But will his family and townsfolk support him?This apocalyptic series is a good follow-up from One Second After. Tells how things may turn out if the U.S. suffers an EMP strike. From the way politics are today, I don't believe the author is far from wrong. His book is a page-turner. 4 stars instead of 5 because his story is sort of similar to others, but the author does a good job of detailing how people react in times of crisis and what might become of all of us should this unthinkable, but possible, scenario be in our future. Hope it remains only a story.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MSpike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHERK55DSINCRNZGFZSKV423FAUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SWT5XLVQI69U?ASIN=B014LBYA6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Frighteningly Real but Masterfully Written",
                "reviewText": "Forstchen describes in amazing detail a scenario that could be all too real. The characters are human and relatable. A true page turner that you won’t be able to put down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eugenia Martchenko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG2D7QD6FJOOKSJBFXQHTZRQQDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35B2TT57LHEUW?ASIN=B014LBYA6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars The reality",
                "reviewText": "This feels so real, It's scary. We watch Dales many a day, spitting out 'for the common good' and 'to a benefit of the others'. Who are these elusive 'others' though? This is a rhetorical question...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMVS2HMLSQWBJM6OFKESTXXU5KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJAZ4YH0ZXOO?ASIN=B014LBYA6S",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "3.0 out of 5 stars Enjoyable reading",
                "reviewText": "I couldn’t give it four stars because the first book of the series already topped out. While I did enjoy this book’s story but there’s a pattern of many similarities. Community, conflict, situation, then fight at climax point. Don’t get me wrong but it makes it like a cliche. What I wished for was something more insidious and in shadow. This did have little of it but focused on high pace storyline instead. I would still encourage you to read it anyway.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPQVAYMR4QEP7G6MYF7OSMUYA5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PPIC4UZ1G8V4?ASIN=B014LBYA6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars great followup",
                "reviewText": "great followup of the people, community and world after a years time of major change that affects everyone",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RayB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3WBV4GBTHCOKJYEWGMREZGDHSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WFR6TY1Z5DV7?ASIN=B014LBYA6S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2016",
                "reviewTitle": "4.0 out of 5 stars The Necessary Sequel To ONE SECOND AFTER",
                "reviewText": "I really enjoy this author!It blows my mind that to date our government, and even \"The Donald\", has not seriously addressed hardening the US power grid against an EMP attack! Like an asteroid hit, the probability of such an event depends largely on the timeline one is willing to consider. An event unlikely in five years, may be probable and even unavoidable in fifty!And the tech needed to prosecute an EMP Attack is not all that elusive to many Third World Powers--especially today!Clearly, most US Representatives put their careers first and foremost, as they realize that their relevance to us will vanish as quickly as the grid collapses. So, why bother?This story is the anticipated sequel to the ground breaking \"One Second After\".Yes, I checked \"Predictable\"; but that's only because the author taught me how to think in the first novel.I thoroughly enjoyed this read, as an ad hoc government of unelected \"leaders\" seizes control of the military and attempts to install a \"new order\" in place of the constitutional government so many have given so much to defend.Clearly, William Forstchen understands human behavior and how today's world works, along with what history has taught us over a considerable timeline. I'm glad someone smarter than me is paying attention.This is a must-read for those who've read and enjoyed \"One Second After\". \"One Year After\" is the necessary sequel to the mind-stretching first installment, of what might prove to be a dire prediction of the very near future. And it's such a pity--because we COULD fix this!While \"preppers\" are kindly considered \"eccentrics\", and not so kindly, \"nutjobs\" in today's society, if something like this--or the asteroid--ever hits, they'll be brilliantly vindicated as the \"wise and insightful\", if not outright \"prophetic\" among us.The transition from a skeptical \"Really?\" to an obvious \"Duh!\", can manifest itself in a virtual heartbeat. Why any US citizen that's able, would not have a supply of clean drinking water and storable food on hand, completely mystifies me...RayB",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Slater",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "Haven't read yet",
                "reviewText": "Can't wait to dive in. The forst one was great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Puggers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 28, 2019",
                "reviewTitle": "One of a great trilogy of books",
                "reviewText": "I bought all three of the books in this seires, One Second After, this one and The Final Day after reading the reviews on Amazon. I have to say that I was not disappointed and that all three books tell a story of what could easily happen if society lost all its electric & electronic equpment. One of the phrases in the books that has stuck in my mind is that we currently live in just about the most fragile society mankind has ever lived in and that, in most Westernised socities today, we are totally dependent on a very complex supply and infrastructure system and Heaven help us if anything major happens to all of that. A series of books well worth reading and totally unputdownable!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hbsc Xris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 13, 2017",
                "reviewTitle": "Excellente triologie sur les conséquences d'une EMP",
                "reviewText": "Excellente trilogie, \"One second after\", \"One year after\", \"The final day\", sur les conséquences d'une EMP.Les explosions type EMP (Electro magnetic pulse) sont presque totalement inconnus du grand public en France et ignorés de nos politiciens, même si quelques militaires ont tiré la sonnette d'alarme, dans le désert.Pour résumer, un missile nucléaire tiré à une certaine altitude dans l'atmosphère, au dessus d'une zone donnée, qui peut-être de la taille d'un pays ou plusieurs, peut neutraliser l'ensemble du système électrique de la zone donnée. Concrètement, cela veut dire que physiquement nous ne percevrions rien ou pas grand chose, peut-être même pas l'explosion et au premier abord, il n'y aurait rien de visible au sol sauf des transformateurs et des lignes fondus. Mais la totalité du réseau électrique s'arrêterait instantanément de fonctionner ainsi que la tous les véhicules ayant de l'électronique et bien sûr trains, avions, camions, etc.C'est à dire que seule la jeep de collection ou le tracteur de arrière grand papa pourrait continuer à rouler, plus des véhicules ou des installations spécialement protégées, mais il n'y en a quasiment pas en France. Toutes les communications téléphoniques et informatiques seraient suspendues. Le réseau et les appareils étant \"fondus\" (pour faire court), il faudrait des mois ou des années pour reconstruire le monde actuel, selon l'étendue de la zone ou des zones touchées.La trilogie de W. R. Forstchen raconte les conséquences d'une telle catastrophe survenant sur le continent US, vues depuis une petite ville des Blacks Montains en Virginie.W. R Forstchen est un historien, spécialiste des XVIIIème et XIXème siècle US d'où la crédibilité de son récit sociétal d'un \"retour vers le passé\". Pour toutes les conséquences d'un EMP, il a travaillé en collaboration avec un de ses amis, spécialiste militaire car les Américains, \"eux\", comme les Russes ou les Chinois ou les Israéliens travaillent sur le sujet.Le récit est extraordinaire de \"réalisme\", assez dur parfois, mais parfaitement cohérent sur ce qui se passerait dans un monde privé de ravitaillement, de médicaments, de communications et correspond aux prévisions des experts sur le sujet.90% de la population mourrait en 1 an, dont la presque totalité des habitants des grandes villes.Les survivants appartiendraient à de petites communautés soudées, créant leur milice de défense et mettant en place une protection de leur zone contre les réfugiés. Eh oui, c'est terrible, mais quand il n'y a plus à manger pour tout le monde et presque plus de médicaments, on arrête d'accueillir toute la misère du monde, il faut choisir entre les siens et les autres et, parmi les autres, trier les savoirs utiles en revenant à ce qui est véritablement utile dans une société. Il en fut ainsi dans toutes les sociétés pendant des millénaires. C'est à dire plus de place, ni d'espoir pour le licencié en droit , sciences po, ou en lettres mais une petite place pour le chasseur, le mécanicien, l'infirmière, le forgeron, le collectionneur d'antiquités ou l'historien des techniques.Les interrogations humaines des survivants et du héros principal, ancien colonel de l'armée US, professeur d'histoire de l'université locale, leur souci de se raccrocher à des principes tirés de la constitution US, de l'histoire US, de la religion, les rend plus vrais et donne du corps au récit, rappelant qu'aucune société ne se construit ou ne se reconstruit sans un fondement idéologique.Ok, il y a quelques guerres, un peu à la John Wayne. Un commentateur a trouvé l'attaque d'une armée de voyous peu crédible. En ce qui me concerne, je la trouve non seulement hautement crédible car les voyous croulent déjà sous les armes en tout genre, mais serait également les 1ers a être organisés en bandes armées, en mesure de piller armureries et autres lieux de stockage d'armes en cas de catastrophe.Pire, la France n'est pas les USA ou la Suisse où tout citoyen a le droit de posséder une arme y compris de guerre.En France, des séries de lois, qui auront peut-être un jour des circonstances catastrophiques, ont privé les honnêtes citoyens de presque toutes leurs armes. Ce n'est pas les fusils des chasseurs \"français\" et leur médiocre provision de cartouches qui iraient loin face à des AK 47 ou des colt 45 qui sont monnaie courante dans certains lieux qu'on ne citera pas. C'est donc la quasi-totalité des citoyens honnêtes qui seraient incapables de se défendre si une guerre civile survenait, quelle que cause que ce soit.Effrayant de comprendre à quel point, on serait vulnérable dans notre pays car je n'ai pu m'empêcher de faire des parallèles entre ce qui serait possible dans une petite ville des USA et dans une petite ville de France.Serait à offrir aux candidats à la présidentielle pour qu'ils réfléchissent aux conséquences gravissimes des absurdités de leurs choix et de leur bien pensance, tous partis confondus depuis 1/2 siècle.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manolo Macchetta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 7, 2016",
                "reviewTitle": "Better than expected, (almost) as good as the first one",
                "reviewText": "I loved the first one, and i Got this one as soon as it came out. I was not disappointed...I didn't know how the story could develop after the \"saviors\" arrived.Well, Forstchen found a perfect way to expand it and build a perfect stage for book 3 (it s coming out in 6 months, but I already pre-ordered it).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcos Luz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 26, 2015",
                "reviewTitle": "Si-fiction",
                "reviewText": "The first book is about a potential threat: EMP and so on. This second book is pure but well written Novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}