{
    "remaining_requests": 1510,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Starter-Villain/dp/B0C6FR3JN1",
    "body": {
        "name": "Starter Villain",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Starter-Villain/dp/B0C6FR3JN1",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/513hdsLOrbL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Scalzi",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=John+Scalzi&search-alias=audible"
        },
        "brand": "John Scalzi&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5822,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Inheriting your uncle's supervillain business is more complicated than you might think. Particularly when you discover who's running the place.Charlie's life is going nowhere fast. A divorced substitute teacher living with his cat in a house his siblings want to sell, all he wants is to open a pub downtown, if only the bank will approve his loan.Then his long-lost uncle Jake dies and leaves his supervillain business (complete with island volcano lair) to Charlie.But becoming a supervillain isn't all giant laser death rays and lava pits. Jake had enemies, and now they're coming after Charlie. His uncle might have been a stand-up, old-fashioned kind of villain, but these are the real thing: rich, soulless predators backed by multinational corporations and venture capital.It's up to Charlie to win the war his uncle started against a league of supervillains. But with unionized dolphins, hyperintelligent talking spy cats, and a terrifying henchperson at his side, going bad is starting to look pretty good.In a dog-eat-dog world...be a cat. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Science-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16190"
            },
            {
                "name": "Superheroes",
                "link": "https://www.amazon.com/Superhero-Science-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9059889011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "8 hours and 5 minutes"
            },
            {
                "name": "Author",
                "value": "John Scalzi"
            },
            {
                "name": "Narrator",
                "value": "Wil Wheaton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 19, 2023"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0C6FR3JN1"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#130 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Superhero Fantasy #1 in Superhero Science Fiction #3 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nick Boltz026",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELVNZDNHYP3ZT7V5776EXDGIJ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EUVHZ9KMQUCW?ASIN=B0C6FR3JN1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars 🐈 Spy Cats? Cursing Dolphins? Volcano Lair? SIGN ME UP! 🐬",
                "reviewText": "Hello, ladies and gentlemen of Amazon! This is your friendly neighborhood book reader, coming out with my first book review of 2024! Yahoo! 🥳Sorry for the loooong delay, it has been a HARD few months and I got buried in work and responsibilities. 😵‍💫It wasn’t until during the holidays, that I got some times to find a book and read it! And BOY, DID I PICK A DOOZY! 😃I actually discovered this book on an ad in the news, it showed about the spy cats, and the cursing dolphins. When I realized that it was narrated by the famous Will Wheaton, I KNEW I had to try this book….and it was so worth it! 😄I can’t get into many spoilers, cause I’ll try to leave my reviews as spoiler free as possible. But I can tell you this ( ⚠️SPOILER WARNING⚠️) : We have our main protagonist, Charlie, that finds out that his Uncle Jake, who was a billionaire that owned parking lots as his business, tragically passed away. He then finds out that it that he wasn’t JUST a very rich park lotting entrepreneur, but was also a “VILLAIN”. His life turns upside down after he discovers that. That’s all I’m gonna give you in spoilers.If my small, brief explanation of this book interest you in any way then I truly recommend that you take some time of your schedules and sit down and give this book a try.John Scalzi,Thank you for such an enjoyable read! It really made my Christmas! I also wanted to thank you the great Will Wheaton for narrating it, and bringing the characters to life.FINAL RATING: ⭐️⭐️⭐️⭐️⭐️",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cwousn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER3VQ63FFADK64B7WAZR22D4ORA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAMI41KBTNO62?ASIN=B0C6FR3JN1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Scalzi pens another winner",
                "reviewText": "I was only going to read a chapter or two. I ended up reading the whole thing in less than a day! As can be expected from a book about villains, there are murders, mayhem, missile explosions, and even a deadly laser. But the violence almost seems like an afterthought. The focus is on the rather inept hero, Charlie, and his efforts to fill his recently departed uncle’s shoes. As part of the uncle’s villainous machinations, a line of intelligent cats was developed. Along the way, they (with some human assistants) guide Charlie on his path to villainy. I grinned, chuckled, and even laughed out loud at some of the happenings in the book. The rather banal ending has a couple of twists that I didn’t see coming. Should yoiu read it? Yes!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BigMac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTHKBSCNK4VZPHXYF5U5K57EV6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRV6KWRYUH62F?ASIN=B0C6FR3JN1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars loved it",
                "reviewText": "A comedy spy thriller! Austin Powers meets James Bond. This is my first Scalzi book but it won’t be my last. I enjoyed the very convoluted plot with tons of plot twists and turns. The witty dialogue kept a smile on my face for the first 20% of the book. The humble, self deprecating hero was perfect in his role as the hapless stooge, thrown into a network of huge corporate, high tech criminal enterprises upon the death of his uncle. Lots of sophisticated machinations and plots within plots. No spoilers here, but I ended the book with another smile on my face. Enjoy!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brooke Bell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXKQPND5SVQSOUMM4V26KNJHUMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32NHRREPMDM98?ASIN=B0C6FR3JN1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Humorous Amateur Villainy Fiction",
                "reviewText": "FIVE STAR STORY. This book made me laugh with its subtle and then not so subtle humor. The story was outlandish yet believable even down to the typing intelligent manager cats and the talking dolphins. The mob-like antagonists are hilariously idiotic only because they think they’re smart and somehow get outwitted time and again by someone who died at the beginning of the book. It’s a light read that took me a couple of days and such an excellent book. This is my second Scalizi book, and I plan to read everything he has written. Will Wheaton narrates the audio book, as he did the first Scalzi book I read, and the audio book was perfection. Wheaton is one of my all-time favorite narrators for science fiction and fiction books.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lesa Holstine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3IYVOHCWH5VR6IB4QCTS2XAWWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBXEO2A1TKLI6?ASIN=B0C6FR3JN1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "5.0 out of 5 stars A Joy from Start to Finish",
                "reviewText": "Are you ready for cats who are management, and dolphins who want to unionize? I love John Scalzi's imagination, and Starter Villain is a joy from start to finish.Most people would look at Charlie Fitzer and see a loser. At thirty-two, he's divorced, working as a substitute teacher because journalism is a dying profession, and living with his cat, Hera, in a house he doesn't own. His father left the house in a trust to Charlie and his three successful half-siblings almost a generation older than their younger brother. He hears on the news that his Uncle Jake died, but he hasn't seen the wealthy businessman since he was five. Uncle Jake and Charlie's father had an argument at Charlie's mother's funeral, and that's the last time he saw him. But, it seems Uncle Jake had his eye on Charlie.Mathilda Morrison represents Jake Baldwin when she shows up at Charlie's. She has some odd requests. Would Charlie stand for his uncle at his funeral in town? In return, Jake left everything to Charlie, and the estate will buy Charlie's house from the rest of the estate. It's only at the funeral home that Charlie wonders what Uncle Jake was involved in. He thought he only owned parking garages. But, the floral arrangements have messages saying they're glad Jake is dead, and the mourners are all males in their late 30s and early 40s. One even tries to stab the corpse to prove Jake is dead. Charlie doesn't understand at all, and he's even more confused when he returns home just in time to see his house blow up.Morrison will handle all Charlie's difficulties. She sweeps him off to Saint Genevieve in the southern Caribbean. It seems Uncle Jake owned the entire island. He owned more than parking garages. He was a villain who offered countries and other businessmen opportunities to compete against each other. Now, it's all Charlie's. He knows nothing about the villain business, and he's too empathetic and kindhearted. But, he easily learns to listen and be ruthless when he's invited to a convocation of villains. He needs all the help he can get from Morrison and Charlie's cat, Hera. It seems Hera is sentient, can type, and owns real estate. She's been watching over Charlie all this time he thought he provided a home for a stray.While some readers might find all their conspiracy theories confirmed in Starter Villain, I thought it was funny and slightly believable. I love the cats and the dolphins who are planning to go on strike. And, Charlie. Charlie is a nice guy caught up in an unbelievable world. If you read and enjoyed Scalzi's The Kaiju Preservation Society, you should enjoy this one.Oh, and the cats. John Scalzi's cats are well-known on his blog. This book is dedicated to \"Sugar, Spice, and Smudge, my current set of cats. You are a real pain in my ass, and I love your stupid fuzzy faces\".",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRFOKKKZAEWPI6CJ52WA6I4W3AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KLCWY84QH9JE?ASIN=B0C6FR3JN1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Mostly fun",
                "reviewText": "It's a shame that the author didn't manage to finish the book as I assume (as he writes in the conclusion) he planned. You can tell that the final sections are less polished and it hurts the book a lot. It has interesting ideas, it is sometimes funny, some of the twists are unexpected. It's not profound literature, just fun. And Hera deserves more attention :)",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marc LeClerc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 5, 2024",
                "reviewTitle": "Cats, villains AND a volcano lair! What's not to love?",
                "reviewText": "You read the one-liner right. This is typical Scalzi science fiction: a totally fresh take on all those outlandish spy thrillers, but with humour and bad guys you almost sympathize with. This was a fun read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jens Stark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 25, 2024",
                "reviewTitle": "A Scalzi",
                "reviewText": "You can expect an insane joyride of a book. A story with more twists than Jack Rabbit Slim's.And you better like cats.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 26, 2023",
                "reviewTitle": "Fun and cozy read",
                "reviewText": "I had so much fun with this book (I'm a huge cat lover). Everything about it was funny, warm, and cozy. Very entertaining.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin, The Wonder Horse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 12, 2023",
                "reviewTitle": "Fun, well written, interesting and short",
                "reviewText": "Five stars on account of the cats, which I am sure was Scalzis plan all along.A thoroughly entertaining, if short, read with quite a satisfying ending.Like many of his other books there's a lot of humour in this one. All of the characters, even those, like the hero, who don't habitually shoot people, throw them to the sharks or attempt to drown them in molten lava approach such activities with the kind of dry, wise cracking humour that probably wouldn't be exhibited in real life.An out of work journalist come supply teacher finds his life turned upside down following the death of his estranged uncle. He swaps a mediocre solitary existence with just his cat for company for a life populated by men called \"Tobias the Stabber\", not so secret high tech lairs on volcanic islands, secret cabals of global super villains and surprising revelations about his cat.Why would want to read this book ? Why wouldn't you. It's short so it won't take long and it's exciting, warm and amusing with an ending that will leave you feeling happier than you felt when you started the book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 10, 2024",
                "reviewTitle": "loved this",
                "reviewText": "Awesome work John. Great read and flows so well. A really good book about a villain suffering impostor syndrome, very interesting read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}