{
    "remaining_requests": 1381,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Olympian-Affair-Cinder-Spires-Book/dp/B0C37SR79V",
    "body": {
        "name": "The Olympian Affair: The Cinder Spires, Book 2",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Olympian-Affair-Cinder-Spires-Book/dp/B0C37SR79V",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51jac1gcrfL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jim Butcher",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Jim+Butcher"
        },
        "brand": "Jim Butcher",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2682,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An instant New York Times bestseller! The fate of the Cinder Spires may be decided by crossed swords in the next exhilarating fantasy adventure from the author of the Dresden Files, in this New York Times bestselling series of noble families, swordplay, and airships. For centuries the Cinder Spires have safeguarded humanity, rising far above the deadly surface world. Within their halls, aristocratic houses rule, developing scientific marvels and building fleets of airships for defense and trade. Now, the Spires hover on the brink of open war. Everyone knows it's coming. The guns of the great airship fleets that control the skies between the last bastions of humanity will soon speak in anger, and Spire Albion stands alone against the overwhelming might of Spire Aurora's Armada and its new secret weapon--one capable of destroying the populations of entire Spires. A trading summit at Spire Olympia provides an opportunity for the Spirearch, Lord Albion, to secure alliances that will shape the outcomes of the war, and to that end he dispatches privateer Captain Francis Madison Grimm and the crew of the AMS Predator to bolster the Spirearch's diplomatic agents. It will take daring, skill, and no small amount of showmanship to convince the world to stand with Spire Albion--assuming that it is not already too late. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159265011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "20 hours and 23 minutes"
            },
            {
                "name": "Author",
                "value": "Jim Butcher"
            },
            {
                "name": "Narrator",
                "value": "Euan Morton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 07, 2023"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0C37SR79V"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,116 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Steampunk Science Fiction (Audible Books & Originals) #4 in Steampunk Fiction #99 in Fantasy Action & Adventure"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "E. Nolan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEFP7YEI3IYSHGOJVLZWKSZCGSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VYT8GTZM9IF8?ASIN=B0C37SR79V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Monsters, Diplomacy & Duels (& Cats)",
                "reviewText": "_The Olympian Affair_ takes up directly after \"Warriorborn\", andBenedict continues to feature, but the three main characters hereare Auroran Colonel Renaldo Espira, a Warriorborn in a society lessfriendly to such than Spire Albion, Albion Captain Francis MadisonGrimm Captain of the AMS Predator, the Spirearch's personal ship,and Albion Lady Abigail Hinton, scion of an important Ablion merchantHouse, and the Spirearch's personal representative to the diplomaticgoings-on at Spire Olympia.What are the goings-on? Well, war with Aurora is coming, may alreadyhave arrived, and Albion is going to need all and any allies it canget. The conference is full of backstabbing, sometimes in a literalsense, and Lady Hinton is having a difficult time of it. Not helpingmatters is that her lover, Albion's most famous duelist has alsobeen sent to Olympia, with strict instructions not to duel *anyone*while his Auroran counterpart is also there and is determined toprovoke same. Helping matters even less is the fact that Abagailfinds herself involved in a duel of her own, and the menace fromSpire Dependence is bearing down on everyone despite all Espira cando to stop it.I really like the Cinder Spires setting. Its quasi-Elizabethancharacters all live turned-up-to-eleven lives, fighting harder,loving larger and friending stronger than in our own workaday world.We get a few new pieces of information on the setting in this book,which tend to make me think I was wrong in my initial assumptionthat it takes place in the same multi-verse as the \"Codex Alera\"books. We also get an interesting twist at the end of the bookwhich puts in in the mind of a similar turn in the first of McClellan's\"Glass Immortals\" books. I also like Butcher's portrayal of havingcats as allies: It doesn't help as much as you might think.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LingoSlinger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNIHQKLSG4DSVQAFXVUBPQVKSSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UJI1MKOFOGIH?ASIN=B0C37SR79V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderfully conceived, action-packed fantasy",
                "reviewText": "Butcher has absolutely topped himself with this amazing \"steam opera\" full of lovable characters, sprawling politics, imaginative world building, and jaw-dropping action set pieces.Though this is nominatively steam punk, I consider it a genre-busting masterpiece. I would dub it \"fantasy thriller.\" We come to care about the characters a LOT. A couple of them are in tremendous jeopardy in the second act, and the second act sub-climaxes hit heights of heart-racing conflict that most fantasies don't achieve in their finale. Then, improbably, Butcher ratchets up the thrills even MORE for a finale of incredible intensity and scope. It wraps up in ways that are satisfying yet not cliche-sweet.This is catnip not only for fantasy readers, but also sci-fi readers, and even fans of Aubrey-Maturin and Hornblower naval conflicts: imagine how rousing ship to ship warfare becomes if the ships can fly!A delightful read that stimulates both the heart and the imagination. Highest recommendation.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP7AVNIGV3BW3QWKW3KO3EIJDAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CAXGMWBF4689?ASIN=B0C37SR79V",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Solid Entry, Well Written, Not a Fan of some of the Story Choices",
                "reviewText": "I'm a huge Jim Butcher fan - I've been buying his books during pre-sale for quite a long time, and will continue to do so. That said, I generally prefer the single POV of Dresden to the (sometimes too many) POVs of Cinder Spires. In this entry I felt like there were major scenes that lacked weight because of the shifting perspectives. Also, there were times where I had to re-read dialogue because everyone is so similar in their speech (due to the setting and social constraints) that it can be hard to tell characters apart. I actually really enjoy the social scenery of this World, but it does feel at times like many of the characters are interchangeable.My biggest criticism of this book is that despite the very long wait for it, it feels rushed. There were actually a couple of editing mistakes in this book that I noticed, which I've never seen in any other Butcher entry. I feel like a couple of the characters were shoved into a storyline towards the end, just so they would have something to do. Between this, the multiple POVs, and a couple of other things, I couldn't help but feel more than once that this book and series are written as 'TV Show Bait' - a rather distressing trend in books (or maybe just the books I read?)My other complaint is really less of a criticism than difference in preference: I feel like this series went from zero to a hundred miles an hour much too quickly. To borrow an expression, it's like skipping a couple seasons of 'Supernatural' and we went from killing werewolves to fighting gods awfully fast. I think if there had been an entry between the first book and this one that covered all the things alluded to in this story, I would have rather read that. I don't need (or want) every book I read to have the multi-verse hanging in the balance against unspeakable evil. For this series to be setting this up in book #2 is a couple of books too soon for me. I feel like I was cheated out of what a cool, interesting World this is set in because everything is already changing. I would have loved to read a few more airship battles, or even the lives of aeronauts on a ship.The more I think about this as I reflect on the book, the more this feels like a book 3 or 4, and the more I feel disappointed to not have the book 2 I wish would have been here.All in all, my 4/5 stands, because this is still a good, well-written story and my criticisms are my own. If you liked the first in the series you'll likely enjoy this as well.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Winkless",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 3, 2023",
                "reviewTitle": "Jim Butcher is back in form",
                "reviewText": "An excellent continuation to the Cinder Spires series, which I had worried the author had given up on. A new point of view character is introduced with a quite different perspective from the cast to date. The only real negative is that it will be a couple of years until the third book comes out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Stein.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 10, 2024",
                "reviewTitle": "Fast paced and funny",
                "reviewText": "I love this New series of Butcher. It is fast paced, funny with likable charakters. For me it was a pageturner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "At last!",
                "reviewText": "Thank you, Mr Butcher, for finally writing the follow-up to The Aeronaut's Windlass! Steampunk (although there's not much steam), pirates, a fascinating world studded with heroes, villains and cats. Aerial Hornblower!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "balooka",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 18, 2024",
                "reviewTitle": "And now to wait for the next installment",
                "reviewText": "I thought I liked Jim Butcher, having discovered his Dresden serie...Well, I love the Cinder Spires series, and if I didn't feel to egotistical with such a statement, I'd ask him to park Harry on a long holiday till he completes at least another two volumes of this serie.Can't recommend enough",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco Jose",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 7, 2024",
                "reviewTitle": "Muy bien",
                "reviewText": "Llegó perfecto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}