{
    "remaining_requests": 1676,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hyperion-Dan-Simmons-audiobook/dp/B001OC2W04",
    "body": {
        "name": "Hyperion",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hyperion-Dan-Simmons-audiobook/dp/B001OC2W04",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51RIKu29fRL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Dan Simmons",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Dan+Simmons&search-alias=audible"
        },
        "brand": "Dan Simmons&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 22673,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "On the world called Hyperion, beyond the law of the Hegemony of Man, there waits the creature called the Shrike. There are those who worship it. There are those who fear it. And there are those who have vowed to destroy it. In the Valley of the Time Tombs, where huge, brooding structures move backward through time, the Shrike waits for them all. On the eve of Armageddon, with the entire galaxy at war, seven pilgrims set forth on a final voyage to Hyperion seeking the answers to the unsolved riddles of their lives. Each carries a desperate hope - and a terrible secret. And one may hold the fate of humanity in his hands. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "20 hours and 44 minutes"
            },
            {
                "name": "Author",
                "value": "Dan Simmons"
            },
            {
                "name": "Narrator",
                "value": "Marc Vietor, Allyson Johnson, Kevin Pariseau, Jay Snyder, Victor Bevine"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 22, 2008"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B001OC2W04"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#824 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #16 in Space Opera Science Fiction (Audible Books & Originals) #25 in Space Operas #27 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ian Humphreys",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLYJZ3LKGMQXQDZZOJZCFRVCU5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R5YH8K286VRH?ASIN=B001OC2W04",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Absolutely Beautiful",
                "reviewText": "I don't really know where to begin here.I have loved science fiction books since childhood, and anyone who reads the genre will know there are many styles and stories beneath that umbrella. Does the author abuse open ended approaches to science? Maybe an overuse of the fantastic in pursuit of good fiction? Is there a point to the story beyond \"kill the baddies\"? Anyone who loves sci-fi knows sometimes a series or an author fails to live up to they hype.Saying that this series \"lives up to the hype\" simply does not say enough. To me, this is a masterpiece on form with Frank Herbert's DUNE. The author weaves an incredible story through some of the most inspired world creation I have ever had the pleasure to experience, through any medium. Simply every facet of the universe that Dan creates for the reader is just right, he knows when to stop and let the minds eye fill in the gaps while providing the materials for it to do so. As i read, I wanted to highlight entire chapters for their sheer literary beauty, worlds in the work of Dan Simmons are more than altered and recycled earths. The story he weaves in this universe is shrouded in mystery through to the very end without being confusing, relevant without grinding an axe, and nuanced without being understated.There are some authors that simply stand out in their ability to emotionally involve the reader in their story, and Dans Hyperion series stands in another league in that regard. I write this review having finished \"The rise of Endymion\" only minuets prior, and I feel as if I have just parted with a dear friend. Goosebumps covered my arms and emotion filled my eyes throughout the series, but the true master work to me is in the conclusion, a brilliant tying together of an immensely complicated story that covers thousands of years in story time in a way that does not leave the reader wanting. To watch him do that with such measure as an author makes me never want to write again.One of my great regrets is having been born too late to meet Frank Herbert. To make an estimation of the artist that created a series that nobody waned with such finesse that it swept the literary world and demanded their attention to the genre. Frank told more than a nice story in his writing, DUNE to me is more than a diversion of my time. DUNE to myself and others was a beautiful questioning of what it means to be a human explored through a literary medium.I didn't think it possible but Dan Simmons has written his Hyperion series to the level of great authors like Frank Herbert. The amount of real world work it must have taken to tie together the incredible detail in science, religion, and relationships is staggering, and highlights his mastery of his craft. He approaches the fictional science much as we approach the realities of our modern world, giving enough detail to understand without having to resort to hand-wavium. His understanding of human religions and his postulations of their future growth and adaptation highlights a far more than cursory understanding of the topic, and his characters feel like people i would deeply like to know.Thank you Mr. Simmons for this book and this series. If humanity is meets an untimely end and our society is exhumed at some later date by some later life, I hope that they find your book. The Hyperion series is more than a sci-fi novel, its a love letter to humanity from a man who invested the years in understanding it.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4E55UFZJEUMD5DKLC6QVDDDN5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34KVAMJEX5LDQ?ASIN=B001OC2W04",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2014",
                "reviewTitle": "4.0 out of 5 stars Fear the Shrike!",
                "reviewText": "Hyperion by Dan Simmons is the first book in the Hyperion Cantos series and folks, its a good one! I've always been looking for a good sci-fi book that deals with some type of mythical creature and whatnot. So when I read the description of Hyperion and the Shrike, I was sold. It also helped that I've seen this series posted on many \"must read\" lists online. Like many reviews have stated, this first book in the series serves nothing more than an \"introductory\" of the characters. Basically, each character has their own story to tell and when one is done, a small break back to reality is given until the next story is told. Think of it as several novella's. Either way, I think it's a pretty good way to start off the series. It gives the readers a good chance to get familiar with the major characters. Whether you think each story is interesting or not, well, that's obviously a different thing altogether.The book does start off a bit slow but after reading the first story of the characters, I knew I was in for something special if all the other stories followed suit. The common ground is that each character's story has something to do with the character's pilgrimage to the world of Hyperion where they will eventually meet with the legendary Shrike creature.Father Hoyt - I absolutely loved his story. It was mysterious and haunting at the same time. It gives the readers a first glimpse of the Shrike.Kassad - His story gives the readers a taste of the powers the Shrike wields along with how dangerous they can be.Martin - One of my least favorite stories to read although it did have some funny moments here and there. As with every group, there has to be one guy that seems to piss everyone off and in Hyperion, it's Martin.Sol - I'm sure his story will be a fan favorite for many readers. It's sad to read what happened but does give us another glimpse to the mysterious ways of the Shrike's power.Brawne - Her tale involves the most action. Also, it does take some patience to read through during the later part as it requires quite a bit of imagination from the reader.The Consul - Definitely a very weird story at first but pans out nicely towards the end.I appreciate the author spending a lot of time giving details of the world around the characters. I do have to admit though that there were many times throughout the book where the author would use a \"technological or sci-fi\" term without explaining the details or giving a explanation. The only way of knowing what that term means is to hope that the author uses it more than once and piecing the context in which it was used to predict the definition. It's definitely not bad enough to the point where it would drive one crazy though.The world the author builds is your standard affair of stuff where Old Earth is no more but instead hundreds and thousands of planets are now inhabitable. Travelling via farcaster portals to different planets definitely gives this book the \"sci-fi\" feel. Some readers didn't like the cliff hanger ending but I felt it ended exactly as I thought it would. In fact, I wouldn't even consider it a cliff hanger at all. A cliff hanger to me would be if a major character in the story was shot by a mysterious person and it ended right there. With Hyperion, I believe the choice is up to the readers on whether they want to continue with the series or not based on the ending. If they chose not to continue, I think the author did enough to close out the stories of the characters so that the readers don't feel cheated with having to purchase the next book in the series to find out what happens next. If they choose to continue, which I consider myself in this category, then I'm sure the next book will continue right where this one ended.The Shrike legend will definitely continue!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Pachence",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEACDFQSRLAZEZ36GAYGOXB2MMBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36A3KP8DFYUU7?ASIN=B001OC2W04",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars superb",
                "reviewText": "One of the best books I have read in the Sci Fi genre. Truly a poem indicative of humans needs/desires and the conflicts involved in choice and change.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTBAXD27LQDRUOKW6KKDCJBWHUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GI1CGAFN1EZG?ASIN=B001OC2W04",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Epic Sci-fi With brilliant world building",
                "reviewText": "Engaging concept, with planets and imaginary cultures you don't see elsewhere. Several travelers are chosen for pilgrimage to Hyperion, they are not sure why. Each tells their story, adding a bit to the mystery.I admit I got lost several times during the story telling, maybe that's just me. The main story doesn't get resolved, but I enjoyed this enough to read the next book.Recommended for fans of epic sci-fi with fantasy and mystery elements.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 26, 2023",
                "reviewTitle": "Awe inspiring",
                "reviewText": "The entire series blew me away. I'm not sure I've watched or read anything quite like it. It is one of those generational monoliths that only come around rarely. Truly a treasure to have read these.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renato AugustoRenato Augusto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 24, 2022",
                "reviewTitle": "Edição econômica",
                "reviewText": "Eu não posso comentar sobre a história porque eu ainda não o li. Mas sobre o livro em si, eu comprei a versão econômica e ela é bem econômica mesmo, ela é uma edição de bolso, portanto o tamanho das letras é um pouco menor do que o normal (como já era de se esperar) e as páginas internas são de um papel parecido com papel jornal, até tem o cheiro parecido. Eu já comprei o livro esperando mais ou menos esse nível de qualidade, então pra mim tudo bem, só estou fazendo esse review para futuros compradores estarem cientes do que irão receber e não se decepcionarem com a compra depois.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81OI2aWiSmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Y5JQSevtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61LQXcOgcrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81EuDN0jUBL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 29, 2024",
                "reviewTitle": "Not as heavy as Dune",
                "reviewText": "4.5 for me. Very well written. It sort of reminded me of Dune, but I enjoyed this one much more.It's amazing how current it is as it touches on climate change, artificial intelligence, religion, etc.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 24, 2023",
                "reviewTitle": "Der Einstieg in eine außerordentliche Geschichte! Leseempfehlung!",
                "reviewText": "Spannend, komplexe Handlung, in sich schlüssig und mit interessanten Charakteren. Muss man lesen!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lethenarl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on March 28, 2023",
                "reviewTitle": "Challenging language for a non-native english speaker.",
                "reviewText": "My english level is C1 yet while reading this book, I had to keep looking at the dictionary in every page like at least 4-5 times. This is good in a way, improving my vocabulary yet I can not really get into the book on the other hand because of this issue.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}