{
    "remaining_requests": 1661,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Observer-Novel-Robert-Lanza-ebook/dp/B0CSB3LRKW",
    "body": {
        "name": "Observer: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Observer-Novel-Robert-Lanza-ebook/dp/B0CSB3LRKW",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71tvNCBFf7L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Robert Lanza",
            "link": "https://www.amazon.com/Robert-Lanza/e/B004NDEASI/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2182,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NATIONAL BESTSELLER ● \"Mind-bending ... A novel full of life-affirming ideas.\"—Kirkus Reviews (Starred Review)\"The cutting edge of science tipping into something new and marvelous ... a startling, fascinating novel.\"―KIM STANLEY ROBINSON, New York Times bestselling author\"Real science and limitless imagination combine in a thrilling story you won't soon forget.\"―ROBIN COOK, #1 New York Times bestselling author of Coma (and 37 other international bestsellers)\"Brilliant ... A riveting and moving story.\" ―RHONDA BYRNE, #1 New York Times bestselling author of The Secret.Caro Soames-Watkins, a talented neurosurgeon whose career has been upended by controversy, is jobless, broke, and the sole supporter of her sister, a single mother with a severely disabled child.When she receives a strange job offer from Nobel Prize-winning scientist Sam Watkins, a great uncle she barely knows, desperation forces her to take it in spite of serious suspicions.Watkins has built a mysterious medical facility in the Caribbean to conduct research into the nature of consciousness, reality, and life after death. Helped in his mission by his old friend, eminent physicist George Weigert, and young tech entrepreneur Julian Dey, Sam has gone far beyond curing the body to develop a technology that could solve the riddle of mortality.Two obstacles stand in their way: someone on the inside is leaking intel and Watkins' failing body must last long enough for the technology to be ready.As danger mounts, Caro finds more than she bargained for, including murder, love, and a deeper understanding into the nature of reality.A mind-expanding journey to the very edges of science, Observer will thrill you, inspire you, and lead you to think about life and the power of the imagination in startling new ways.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CSB3LRKW"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ The Story Plant (January 12, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 12, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 920 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 393 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,911 in Kindle Store (See Top 100 in Kindle Store) #15 in Metaphysical Science Fiction eBooks #46 in Hard Science Fiction (Kindle Store) #110 in Hard Science Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,182 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A mind-bending novel that will change the way we think about reality",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/50c172c7-5a91-4da7-9bb9-d0559d1580f1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/50c172c7-5a91-4da7-9bb9-d0559d1580f1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joseph",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUGYRLLMFDJE7H62DZUSYUVGFCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LB1P7OHFZZKD?ASIN=B0CSB3LRKW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Incredible book!",
                "reviewText": "Incredible book! My wife bought Observer for me based on a friend's recommendation and it didn't disappoint. I thought I'd amuse her by pretending to open it up Friday after work, but instead, I spent the entire weekend glued to its pages. Couldn't put it down ‘til the very end.Being interested in the nature of reality myself, it was a total homerun. The book kicks off with a hospital drama that spills onto the internet, ruining a doctor’s career. It has complex characters that completely draw you into their lives. It has a ton of information and insights into the real-world implications of quantum theory that pushes well past the horizons of modern science. And when that technology is stolen and misused by gamers on the black market, danger and intrigue ensue. This book is filled with incredible characters, cutting edge science, and a story that takes you on a roller coaster ride to places you never thought possible. In my opinion, Crichton and Weir have to make room at the top for Robert Lanza and Nancy Kress. This book was great!.To start with, the main character Caro is very relatable. She's smart and tough but the authors manage to show her softer side too. You can't help but get behind Caro and hope the journey she sets out on will end well for her. That makes her mysterious uncle, his unexpected job offer, and the controversial, cutting edge work she's asked to do all the more intriguing. Should she do it? Should she run for the hills? Combined with the compound in the Caymans and her introduction to a mind-bending concept that would make anyone question their beliefs (including me), she has to weigh the risk of accepting the job which will save her career and steady her financially against the unknown moral and ethical dilemmas it presents. But you know how it goes - a sister with a disabled child that needs help, a career that's been destroyed, all your other options are gone... What other choice does she really have?In addition, as the story proceeds, you inadvertently learn a lot about the science behind the book. Fortunately, it’s presented in such a simple and elegant way, you don’t even realize you’re grasping advanced physics concepts while sipping your tea. I think this passage says it best:“You, Caroline, are young in one ‘now’, and you will experience wrinkles and graying hair in another ‘now.’ But in reality, they all exist in superposition. Think of it like one of those old phonographs. Listening to the music doesn’t alter the record itself. Depending on where the needle is, you hear a certain song. This is the present – the music before and after the song is the past and the future. In like manner, every moment endures in nature always. The record doesn’t go away. All ‘nows.’ Like all songs on the record, exist simultaneously, although we can only experience it piece by piece. That superposition is why Einstein said ‘the distinction between past, present and future is only a stubbornly persistent illusion.’”Based on that, what do you think is going to happen? I won't give anything away but it's one thing for a science fiction novel to present impossible events or concepts as fact. That's why it's called fiction or fantasy. It's a totally different ballgame though when you realize this book is hard science based on real experiments which show how the quantum world entangles itself with ours - not just in a theoretical way or at the microscopic level, but on our level, in our everyday lives shaping reality, even affecting our concept of death as described in the passage above. I looked stuff up online and found strong scientific support for the claims made in this book. Honestly, I still haven't gotten my head around it. If it were philosophical or make believe, I'd take it with a grain of salt, but if the implications of modern science are true and we can learn to manipulate them one day, I hope it’s soon because I’d love to experience it myself!Through the twists and turns that keep you perched on the edge of your seat, I loved every second (well, almost every second lol) of this book. I feel like I've been inspired by science all over again. How this book managed to capture all the science in a way that makes you forget you're actually learning about quantum physics and the nature of reality and how it works is truly a testament to the authors. The combination of a great storyteller (Kress) and a great scientist (Lanza) delivers nothing less than a stellar piece of literature that works for a popular audience too.Observer is truly amazing. I loved it. Can’t wait for the movie. Do yourself a big favor and read it!",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZTDUU4R2RMFYWC7IIK3YAQT45A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E2AAHP9FOWSL?ASIN=B0CSB3LRKW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars The science is very intriguing",
                "reviewText": "I found the science very intriguing! It certainly gives you a lot to think about. I felt that the first 2/3 of the book was captivating. I was a bit disappointed in that there was a build up of certain characters and events that resulted in a wrap up in only a few sentences. It felt rushed. The focus then moved to other characters and events. I felt that this book could have been a bit longer in order to fully conclude some of the characters and events. Overall though a very good read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ygothere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCY4LNNXRQMA4B4R5LC4JFTYE2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HUO4TYRJYNO5?ASIN=B0CSB3LRKW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Total. Mindblower.",
                "reviewText": "After reading a review that recommended Observer to fans of Blake Crouch, whose books are among my favorites, I contemplated buying it but first wanted to know more about the authors, Robert Lanza and Nancy Kress, neither of whom I was familiar with.I took a look at the authors’ previous books, which sent me down a very intriguing rabbit hole. It turns out Robert Lanza cloned the first human embryo and first endangered species and is considered one of the most influential scientists of the 21st century. Truly, his background is a story in and of itself. He had a hardscrabble childhood but when he was only a teenager he altered the genes of chickens. One article I read compared him to the character Matt Damon played in the movie Good Will Hunting. He went to medical school, worked with some of the most important doctors of the 20th century, and then, instead of becoming a surgeon, he took time off so he could research the nature of reality in order to understand the universe and our place in it. The guy lives on an island outside Boston and has million year-old dinosaur bones in his house. In short, he’s not only a genius, but an interesting character who I see reflected in few of his book’s central players. Nancy Kress is also brilliant and trailblazing. She’s written close to 30 books - mostly sci-fi novels - that draw from the cutting edge of science and technology and explore how it can and will change our lives in positive and potentially catastrophic ways.Kress is a wonderful storyteller and in Observer she helps adroitly translate Lanza’s scientific work into something understandable while building a rich narrative that compels the plot, engages the imagination, and makes you think!The book opens with a quote from Stephen Hawking’s A Brief History of Time that asks: “Why does the universe go to the bother of existing?” Observer, whose premise is based on Lanza’s theory of biocentrism, answers the question as the main character, Caro Watkins, a cynical young neurosurgeon, interrogates the unusual nature of the experimental surgeries she’s been hired to perform by her great uncle, a Nobel prize-winning scientist who she’s never met.Sam Watkins won the Nobel Prize in medicine for developing a cure for the common cold. He gained fame and fortune then dropped off the face of the earth to build a medical facility in the Caribbean. When he summons Caro he’s a dying man desperate to not only alter his existential condition but to use the research he and his old friend, theoretical physicist George Weigert, have been working on for decades to change the course of reality itself.When Caro arrives at the medical facility, a shadowy fortress set on a sunny tropical island, everything seems incongruous. Nothing about it makes sense to her, and for a serious person, a surgeon who needs to be in control, she feels completely unmoored. But she has no other options. After being blackballed by her mentor, an esteemed surgeon who harassed her and then turned the table on her, she not only lost her job but she had been betrayed by colleagues and crucified by online trolls. She now finds herself in a strange place tasked with performing brain surgeries on healthy volunteers using an untested protocol that relies on clandestine research, a theory derived from quantum physics, and software developed by a young tech billionaire.As Caro tries to come to grips with the awful turn of events that ended her career and led her to this bizarre place, she takes solace from George Weigert, the only person in the compound who seems trustworthy. Weigert, a grandfatherly English gentleman grieving the loss of his wife, is the antithesis of Sam Watkins, his gruff and arrogant Oxford classmate from way back, and much less intimidating than Julian, the handsome young tech genius who always seems preoccupied. Throughout the book it’s Weigert who patiently explains his theory to Caro so that she understands her role and the magnitude of what they’re attempting to do at the compound.While Weigert educates Caro on quantum phenomena I learned more about physics in a few pages than I gleaned in a whole college class on the topic. Weigert relates the fact that mathematics shows us that the universe we perceive is only one of many. Every time an observation is made by humans or animals the universe holds the possibility of other branches of itself, with all other possible outcomes of that observation. In other words, “everything we experience is only a whirl of quantum information in our brains.”When Caro performs the first operation, on Julian, which involves implanting a chip in the brain that’s connected to a conductor and fed into a high-powered computer, she’s leery of what she sees on the screen: Julian transported from the operating table in the compound to the Trevi Fountain in Rome. But as Weigert continues to teach her about his theory and she does implantations on other volunteers, including Weigert and her own sister, she begins to gradually understand the profundity of what it all means.As the story unfolds there are interesting subplots, one involving Caro’s sister, a single mom of 2 daughters, one severely disabled, whose vulnerability and openness provide a good counterpoint to Caro’s guardedness and hard edge. The more she learns from Weigert and the more she witnesses from those she implants, the less wary and closed off she becomes. She falls in love. At the same time, danger mounts at the compound as her great uncle’s life grows ever more precarious. I won’t give away any spoilers, but the denouement is spectacular.Observer is truly one of those books that linger in the mind long after you’ve turned the last page. It has incredible depth while being a gripping story with interesting characters and provocative ideas. I will definitely be reading it again and recommending it to everyone I know.",
                "reviewVotes": "100 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 27, 2023",
                "reviewTitle": "Great book, recommended to everyone",
                "reviewText": "Great new book by Robert Lanza! This is a fiction book, a novel, which gives an easy-to- read and enjoyable way to understand how modern science looks at cautiousness as a creator of the world that we live in - his idea of biocentrism. To get more data on science side, one need to read his previous books on biocentrism. This book is great for bringing these ideas to the attention of more people, who don't necessarily have science background. At the end of the day, these ideas will change the way how people think about themselves and the world that they live in.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 19, 2023",
                "reviewTitle": "Spannend & Originell",
                "reviewText": "Ich habe schon seit längerem kein Buch mehr so schnell ausgelesen.Es ist einfach sehr gut und spannend geschrieben, wodurch man richtig in der Handlung und den Charakteren versinkt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 18, 2023",
                "reviewTitle": "fascinating reading.",
                "reviewText": "I couldn’t put this book down, and recommend anyone who is looking for an alternate view of the universe and self, to read this book. It maybe science fiction in parts but I believe the truth is in those words too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Kindle: Maria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 23, 2023",
                "reviewTitle": "Emocionante",
                "reviewText": "Habiendo leído otro libro de R. Lanza este es mucho más que una novela. Es un nido de información científica real que verdaderamente emociona.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}