{
    "remaining_requests": 1413,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Story-Genius-Science-Outlining-Riveting/dp/1607748894",
    "body": {
        "name": "Story Genius: How to Use Brain Science to Go Beyond Outlining and Write a Riveting Novel (Before You Waste Three Years Writing 327 Pages That Go Nowhere)",
        "price": "$12.74$12.74$11.47$11.47$12.74",
        "originalPrice": "$16.99",
        "rawPrice": 12.74,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Story-Genius-Science-Outlining-Riveting/dp/1607748894",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51XnJdeePkL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lisa Cron",
            "link": "https://www.amazon.com/Lisa-Cron/e/B006K6PX5K/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by RNA TRADE LLC and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 2024,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 17 hrs 50 mins",
            "FREE delivery March 2 - 11 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 5",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow 7 AM - 11 AM. Order within 5 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 1607748894"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Ten Speed Press; 1st edition (August 9, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9781607748892"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1607748892"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.39 x 0.76 x 8.17 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,152 in Books (See Top 100 in Books) #12 in Words, Language & Grammar Reference #15 in Fiction Writing Reference (Books) #41 in Cognitive Psychology (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 2,024 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "seventyninehundred",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJ54FMHUCKVWWEXBMI6RU2GQ45A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24N4BVT9TN1KU?ASIN=1607748894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars I get more from this book each time I read it",
                "reviewText": "Should be in everyone's canon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iola",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAZGMQJIRYNS3EOJQHKNTX43PNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T2NQA48455W5?ASIN=1607748894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2016",
                "reviewTitle": "5.0 out of 5 stars Now I want the paperback",
                "reviewText": "Story Genius is the latest book from Lisa Cron, author of Wired for Story. In Story Genius, Cron takes the basic concept from Wired for Story (that, as humans, we are wired to read stories and listen to them as a way of learning about the world and understanding how other people think). It takes elements of Debra Dixon’s GMC theory, and adds in a plotting methodology similar to the method Jack Bickham outlines in Scene and Structure.No, this is not a book for confirmed pantsters … although it might prompt pantsters to question whether they might actually need to cross over to the dark side and become a plotter. Although Cron isn’t a fan of traditional plotting:Plotters have it backward: the events in the plot must be specifically created to force the protagonist to make a specific really hard internal change. And that means you need to know, specifically, what that internal change will be before you begin creating a plot.I suspect some novelists (pantsters, perhaps) don’t do this, because I’ve certainly read novels where the end didn’t make sense in the light of the information provided. I also suspect some novelists (definitely plotters) take this overboard, as I’ve also read novels where the external situation was too obviously contrived to bring around the inner change, to the point the external situation didn’t make sense.To misquote Yoda, there has to be a balance. Lisa Cron starts by practicing what she preaches: she hooks us with a story. In this case, she refers to those times she/you/I stayed up far too late at night, reading ‘just one more chapter’ until we reached the final page … probably at the same time as the birds woke up to welcome the new day.(At the risk of sounding judgemental, if you’re an aspiring fiction author and you’ve never said ‘just one more chapter’ or stayed up far too late reading, you either don’t read enough fiction, or you’re lying. I’d prefer you were lying.)The most useful part of Story Genius for me was the discussion about plot vs. story. I’ve read other books which talk about plot being the all-important element of fiction, with comments like this:Before there was plot there was story. Story was the narration of events in the sequence that they happened. Plot is story that has a pattern of action and reaction. Plot is more than just a chronicle of events. The listener asks a different question: “Why does this happen?”Ronald B Tobias,20 Master Plots and How to Build ThemInstead of the either/or nature of plot and story, Lisa Cron’s view is that plot and story are intertwined:Story is about the internal struggle. It’s about what the protagonist has to learn, to overcome, to deal with internally in order to solve the problem that the external plot poses.(see the GMC connection?). Cron also says:Here’s the real truth: your novel itself beings “in the middle of the thing” [aka in media res]—the “thing” being the story. What starts on page one is the second half of the story, where the plot kicks in.”I don’t know about you, but reading that was a lightbulb moment for me, as was this:The story and the plot are two very different things. The story comes first, and is born of one person, and one person only: the protagonist. Everyone and everything else will be created to serve his or her story.After explaining her methodology, Cron applies it to a real-life manuscript from volunteer/victim Jennie Nash, novelist, book coach and partner in Author Accelerator (yes, Jennie and Lisa offer Story Genius as an online course as well).This is alternately fascinating and frustrating: fascinating to see the way a writer works and applies the concepts, and frustrating because she didn’t tell us how the story ends (she hinted, but didn’t answer the big question: does Henry live?).[...]I’ve highlighted 59 passages, and that’s in the ebook (which is how I know. Kindle counts them for me). I think I’m going to have to buy the book so I can read it again and highlight with “real” highlighters, and see the sample Scene Card properly—I don’t think it showed up properly in my electronic review copy.Recommended. You may or may not want to follow the methodology, but I’m sure you’ll learn something.Thanks to Ten Speed Press and NetGalley for providing a free ebook for review.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reader Grl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7VVFRAKT5NJQQBPOX63WIHXZTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HXA0RG8KGRV6?ASIN=1607748894",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2016",
                "reviewTitle": "5.0 out of 5 stars Thank you! Thank you! Thank you!",
                "reviewText": "Um... where do I start? Okay, how about: THANK YOU FOR THIS BOOK. After a year and a half of trying to \"fix\" my manuscript, primarily my protagonist, Lisa Cron's book FINALLY pinpointed my root issue. Thank you! Thank you! Thank you!Imagine getting similar feedback from fellow writers, agents, and betas, raising your hopes by stating you have an excellent plot, great and memorable characters, and a nifty style of writing, etc., BUT, there seems to be no \"theme\" and your MC falls flat. *Ouch*Anyway, so I came across this book, STORY GENIUS, who had high reviews and touched on a nerve when I read the [ *Before You Waste Three Years Writing 327 Pages That Go Nowhere ] bit. 'Cause, well, it's been close to that long since I finished my first draft.I bought the book and began reading it, but had low expectations. My expectations dropped even lower after I couldn't read past a few pages at a time... without dozing off. Yep, seriously. (Mind you, I can devour a 300 page book in about 4 hrs or less.) Just something about her writing made my eyes gloss over, and I'd have to go back and reread things, two to three times.I almost quit reading it because of that reason alone, but, I stuck it out and just read a chapter at a time and started to do the exercises she prompts you to do. And, man... if the putting me to sleep thing wasn't bad enough, the exercises were like pulling teeth. So I kinda \"skim did them.\" Like skim reading, only it was halfheartedly completing them. And it took me almost two weeks just to get through 8 exercises! Finally, 8 exercises later and half-way through the book, I got tired of wracking my brain and decided that I wasn't learning anything. So I opened up my latest draft of my MS and was going to just try tinkering with it a bit.And, omgosh... on just the first line alone, I was like: why did I write that? My MC wouldn't think that.AND THAT WAS WHEN I REALIZED that even though the exercises felt like they weren't doing anything for me, stuff I'd learned had sunk in and I'd actually finally grasped what my issue was. I didn't have a clue who my MC really was!I'd initially based my MC off myself, and just kept saying that I'd reveal her personal backstory in book two. But I know now that that was just an excuse because I hadn't come up with anything solid. I couldn't answer things like: what happened to her parents? Why/how does she have supernatural abilities? Why would anyone risk their life for her? Why does everything just happen \"around\" her? What are her personal stakes? And the list goes on.But once you pinpoint that seed of a backstory--not just any old makeshift backstory, but specific events in your MC's history up to the start of your MS, all guided step by step in the book--ideas just keep manifesting out of the blue, about as quickly as a snowball rolling downhill. Now, not only do I know exactly who my MC is--which is making revisions fun and exciting, and has rekindled that passion I had when writing my first draft years ago--but I've found that missing piece of the puzzle that turns an already good story into a great one.Sorry for the \"novel\" lol. But, really, you need this book. Highly recommend it! Happy writing! :)",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRFUTLRPKZOD5SM2IY4DOYNKZEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L3TJRD7LLD5D?ASIN=1607748894",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Interesting",
                "reviewText": "I thought the focus on characters rather than plots on their own to be interesting. I think it's good addition to your writing toolkit.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danielle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 6, 2023",
                "reviewTitle": "Amazing!",
                "reviewText": "Really loved this. Gave me a totally way new way to think about outlining and the importance of backstory and internal dialogue.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathryn Kerle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "Brilliant guide",
                "reviewText": "I love the author’s exploration of brain science, coupled with practical guidance on writing. Unbeatable combination.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 26, 2023",
                "reviewTitle": "FÜR AUTOREN UND AUTORINNEN EIN MUSS",
                "reviewText": "Das Buch räumt mit vielen 'Voreinstellungen' auf und gibt einen frischen und tiefgründigen Einblick ins Schriftstellertum. Es ist pointiert geschrieben mit vielen Beispielen. Der einzige Wehrmutstropfen ist die fehlende Übersetzung ins Deutsche. Es könnte so auch vielen DACH Autorinnen und Autoren helfen. Nach dem ich es gelesen habe, ist für mich klar, dass dies eines der Bücher ist, welches 'man' als Autor oder Autorin gelesen haben muss.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 7, 2023",
                "reviewTitle": "Recomendado",
                "reviewText": "Me gusta mucho cómo está explicado el proceso de crear una buena novela!! 100% recomendado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lakshmi Raj Sharma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 6, 2023",
                "reviewTitle": "Great Book",
                "reviewText": "Useful for story writers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}