{
    "remaining_requests": 1492,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Vicarious/dp/B08V3VF1VX",
    "body": {
        "name": "Vicarious",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vicarious/dp/B08V3VF1VX",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61FECeBRXZL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rhett C. Bruno",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Rhett+C.+Bruno&search-alias=audible"
        },
        "brand": "Rhett C. Bruno&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 336,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Award-winning performers Wil Wheaton (Star Trek: The Next Generation, The Big Bang Theory, and Ready Player One audiobook) and Katherine McNamara (Shadowhunters, The Stand, CW’s Arrow) bring this mind-bending, deeply imagined sci-fi tale to life.The real world is only where you breathe....In High Earth, digital entertainment is everything. Shows. Virtual worlds. Simulations - there’s something for everybody in a city where working for a living has been rendered obsolete by technological advancements. Even a short walk outside to visit with others is no longer necessary. Just load into the network and you can be with anyone, anywhere.For Asher Reinhart, nothing compares to Ignis; a live reality show that pushes human beings to their very extremes. As a volunteer director, Asher closely monitors the lives of those living on an interstellar ark, believing they're the last of humanity.But when it's determined that the life of the show’s brightest star, Mission, must be put in danger to boost declining ratings, Asher is forced to choose: the show he loves or the woman whose existence has been the focus of his attention since the day he was born.From number-one Audible best-selling author and Nebula Award nominee Rhett C. Bruno comes a story about the power of human connection. The Truman Show meets Ready Player One in a novel perfect for fans of Hugh Howey, Kim Stanley Robinson, and Michael Crichton. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Technothrillers",
                "link": "https://www.amazon.com/Technothrillers-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10497"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 5 minutes"
            },
            {
                "name": "Author",
                "value": "Rhett C. Bruno"
            },
            {
                "name": "Narrator",
                "value": "Wil Wheaton, Katherine McNamara"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 13, 2021"
            },
            {
                "name": "Publisher",
                "value": "Podium Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08V3VF1VX"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,258 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #115 in Technothrillers (Audible Books & Originals) #141 in Hard Science Fiction (Audible Books & Originals) #349 in Technothrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKLLCHGDHCRVTYOZ4EJ3G4YZVFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2939IZY285SWW?ASIN=B08V3VF1VX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2021",
                "reviewTitle": "5.0 out of 5 stars Excellent",
                "reviewText": "This review is for the audio version of this excellent bookThis isn't the first glowing review of a Rhett C. Bruno book that I've written, he has a way of captivating me in every story he tells. Vicarious was no different. From the first few minutes of it I was intrigued. I needed to know more and know who these characters where and what made them tick.The description calls it The Truman Show meets Ready Player One, and I definitely see that, but I would throw in a bit of The Island as well. A lot of the pretense around their lives reminded me a lot of what the characters in The Island were going through. Especially because the characters in Vicarious were meant to be almost perfect human specimens because of the specific breeding and procreation they were doing.One of the hardest things to do about a book that has twists and turns like this one does is write a review and talk about it. I can't really mention anything about the book because it will likely give away a twist or a turn that someone didn't see coming. I think The Truman show is definitely the \"best\" comparison, but in the future and in a really unique setting.Normally, I can take or leave a Wil Wheaton narration. I've never hated them, but I haven't loved them either. I loved him in this. I thought he was perfect for Asher even to the point where I could sort of see Wil playing him in a movie/tv version of this. And the same goes for Katherine McNamara, I thought she absolutely nailed becoming Mission. There were a few times where I had to remind myself that this was a book and not a retelling of their life story. The narration was that good.Overall, I really really enjoyed Vicarious. I think that Bruno knocked this one out of the park and this might be his most ambitious book along with being the best one I've read so far.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ARbee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI7YKYTVDSERGEX5NLNOOX2PSSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G364MER8B3VS?ASIN=B08V3VF1VX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2021",
                "reviewTitle": "4.0 out of 5 stars Twisted VR World",
                "reviewText": "I read Vicarious for pleasure, wanting a change of pace back to my genre interest in SciFi.This is not an easy book to digest. From a complicated setting in an artificial world, to the character’s involvement in Virtual Reality and Reality Show entertainment, to banishment outside, the line between real and imagined is difficult to draw. People’s very lives and quality of living depend on the odds of surviving contrived events. Even casual spectators can die in a VR catastrophe sparked in error.I’ll give the author full credit for taking on this complicated story line, as well written as possible. I actually",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacob P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOVT4KZFIM225GYNY6ENUAQHLUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IWBUFA0FAMKX?ASIN=B08V3VF1VX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2021",
                "reviewTitle": "5.0 out of 5 stars Disurbingly Believable Dystopia",
                "reviewText": "Vicarious presents an all too believable vision of a dystopian future where the privileged (admittedly the vast majority of humanity that remains rather than a rich minority) have all their needs provided for and have their emotional states kept at equilibrium by auto-administered pharmaceuticals while they consume endless VR content. Despite the existence of matter-converting technology, there are still those who have been removed from society and forced to live on the fringes, disconnected from the network and having to scrape by in the limited non-flooded area left on Earth outside of the High Earth enclave. For some reason, citizens are limited in how much media in total they are allowed to consume and going over without contributing media for others to consume is one of the few things that can result in removal from High Earth. More disturbing is the most popular reality show, which involves viewing people who truly believe themselves to be refugees from a destroyed Earth on a multi-generational ship living and dying in ignorance that they are forced to live a lie for the entertainment of others. The truly disturbing thing is that the citizens of High Earth place so little value on the lives of anyone outside their individual selves outside of how a person entertains them, and don't care that other people are in fact people and life to be valued. The vision of the future presented with humanity amusing itself to death and having no higher ambition than being amused plays as too real and believable given current cultural trends.For the audiobook, the narrators do an excellent job on the respective perspectives that they present and add to the depth of the characters' emotions.Cannot recommend enough.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Willy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIHBT6UPHZ2AFMMR3R7UJQ6FNHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MD8GTY5H6R7?ASIN=B08V3VF1VX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2021",
                "reviewTitle": "3.0 out of 5 stars A DystopianAlthough novel of a flooded earth.",
                "reviewText": "Although the primes was difficult to understand in the beginning of the book and it moved the explanation slowly forward, perseverance finally paid off with a more or less understandable conclusion. I had trouble understanding why with so much water and so little land they didn't use the technology to to turn the water into land. The mountain must have been Mt. Everest. That took a lot of water to cover that much earth. That gangs would form was logical, but the semi-religious having their eyes removed and their amazing abilities severely stretched my ability to suspend my disbelief. And my disbelief was already pretty thin. I do give points for imagination and the action scenes were well written. Perhaps a little more explanation in some areas would help make thins more believable to the reader.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 13, 2021",
                "reviewTitle": "A good read",
                "reviewText": "A different story than what I usually read. I was never able to see what was coming. The ending was also not what I expected.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SystemState",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 28, 2021",
                "reviewTitle": "A wonderfully imaginative take on reality TV",
                "reviewText": "The story tells the tale of Mission, a young woman on a colony ship to a new world. Humanities last hope as it feels the dying Earth. Only that's not entirely true. Unbeknownst to the 10,000 souls on board they or their parents all signed up for a memory wipe and to join a relativity TV show like no other.The story bounces between the perspectives of Mission and one of the Directors who grew up watching the show.Let's just say that I loved this story. Not only is the premise entertaining and captivating but the world built around it and around events is phenomenal and well crafted. Each character has their motives and flaws brought about by their environment which effects the way they act and respond. The start of the story gradually introduces you to the concepts and the world around you, such that by the time the main story gets going you can easily envision scene that takes place.Simply put I highly recommend this novel if you are looking for something new. Particularly fans of the Truman show.Additional note: In the blurb there is mention of Ready Player One. I would choose to ignore that reference as while there is most certainly VR element that's kind of the limit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 6, 2021",
                "reviewTitle": "Well written book with a sad futuristic theme",
                "reviewText": "This might be a visionary work, hopefully we can avoid a future like this by healing our planet before it's too late. The way the characters interact with the world is a progression of virtual reality and reality TV. The characters rely on virtual interactions with everyone else. In summary the story really makes you think.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Reid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 13, 2021",
                "reviewTitle": "Great Scifi Thrills at its best",
                "reviewText": "Rhett has always done well with the main characters of his stories and this is no different, especially for a single book. The story is simliar to the 100 as it showcases the thin line that a colony of survivors live with strict rules on population and freedoms. Unfortunately it is a Truman show esqe betrayal of their struggles as every moment is recorded and manufactured to give better ratings to a VR addicted culture on Earth who love the manipulation of this population who are unaware they are in a carved out asteroid made into a Ark. Only getting by narrowingly on its way to populate another world creating plenty of tensions and thrills as we live their journey with only the Show director to stand up for them, especially one particular illegally conceived child who is their rising star that he is engrossed with.An excellent journey from both these two main characters and worryingly something we can only imagine in a elite jaded world who care nothing for their fellow humanity and what it may cost these unwillingly actors.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricky Reader",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 3, 2021",
                "reviewTitle": "A chilling view of the future",
                "reviewText": "A well told story about a future where everything is about entertainment for those who are fortunate enough to live inside the system. For those outside, life is brutal and often recorded for the amusement of the pampered insiders.When Asher Reinhart uncovers a plot to illegally tamper with the lives of the subjects to increase ratings, he finds himself on a journey that will make him question all his beliefs.This was a thought-provoking and original take on a future where the values of society are skewed by a system that places massive importance on keeping its citizens entertained.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}