{
    "remaining_requests": 1612,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/ReInception-Sarena-Straus-ebook/dp/B0B9RG47LN",
    "body": {
        "name": "ReInception",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/ReInception-Sarena-Straus-ebook/dp/B0B9RG47LN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81ARxe40ELL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarena Straus",
            "link": "https://www.amazon.com/Sarena-Straus/e/B001K8KQ82/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 107,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A corporation’s immensely popular technology can rewire your brain to rid you of any bad habits or unwanted impulses in 2126 New York City. The government is using ReInception in a supposed attempt to rid society of criminal behavior one brain at a time. But when a college student and a government-labeled terrorist discover the truth behind what’s happening in people’s head, they are ready to risk their lives to preserve their free will and the future of society.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B9RG47LN"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Winding Road Stories (October 25, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 25, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3166 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 289 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#326,988 in Kindle Store (See Top 100 in Kindle Store) #1,252 in Genetic Engineering Science Fiction (Books) #1,388 in Genetic Engineering Science Fiction eBooks #4,183 in Science Fiction Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 107 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tall Guy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBQYDVMVWCZVYNMGNRLJNEMIHYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SXW1D0O2YEE0?ASIN=B0B9RG47LN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2022",
                "reviewTitle": "5.0 out of 5 stars WOW! One of the best spec futures books I've read in a LONG time",
                "reviewText": "This book just blew me away. One of the better spec future novels I've ever read. I received ReInception a couple of weeks ago as an advanced review copy in exchange for my honest review. As a lifelong reader and fan of sci-fi, I set a very high bar for a five-star review. ReInception checked all the boxes for me.ReInception is set 100 years in the future in New York City. It's 50 years after the US had a second civil war and society is divided into a caste system. ReInception is a technology that is used to modify human behavior, but the company is hiding the truth about how safe its product is. This is a world where no one has any privacy and where parents can modify their minor children through the use of ReInception. Nothing is off limits, from inhibiting their sex drives to making them physically ill from drinking. The government also has a loose hand with the technology, using it to reprogram criminals and terrorists.Against this backdrop is our main character, Leandrea, a 20-year-old, unmodified, college student who struggles with feeling ordinary in a world where all it takes to be great is ReInception. The book opens on the day she turns 20 and therefore has the right to modify herself.A few reasons I loved this book:The main character is relatable and flawed. She's an ordinary person who thinks she can't make a difference because everyone around her is exceptional. Her journey to discover the power of one person to make a difference is one that we can all go on with her. No super powers. No extraordinary skills. Just one person trying to make the world a better place. I love a good super powers or alien tech book, but it's also nice to feel like you can be on a journey of discovery and growth with someone real.The world-building is top-notch, consistent, and very credible. Straus builds her future world on the foundation of our New York so that you can recognize and envision everything she describes. For example, the lower caste Prole use the flooded subway tunnels to move around the city undetected. Lower Manhattan is surrounded by marshes and fisheries that feed the city while at the same time, serving as a flood barrier. Meanwhile, the upper class inhabits an infrastructure in the top third of the city, where the people get around through an interconnected system of glass tunnels and roof farms. Everything is about protecting the population from exposure. Straus also invented an entire language for the Prole, which is a conglomerate of the many languages that are shared in a diverse city.Straus does a lot of speculating about the unforeseen consequences of what we do today to the future. She hits on sensitive topics in a way that's matter-of-fact and without being preachy. There is no clear political slant here, but rather a conglomerate of possible outcomes of today's decisions that really makes you think. Particularly disturbing is the control parents have over their children and how their decisions, made with the best of intentions, can have disastrous consequences. I found technology around consent and how that impacts relationships to be particularly unsettling.This book is appropriate for 16 and up. It was refreshing to read a book with a college-age main character. I don't see many of these and this felt like the right age for Leandrea to be grappling with her power in the world and her ability to change the future just as she reaches the age of majority.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BillAdams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBTB2YTSB6CSY6LSDRNP4ZX3Z6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ETLBS3PG0RKJ?ASIN=B0B9RG47LN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2022",
                "reviewTitle": "4.0 out of 5 stars Dystopian Sci-fi with Deeper Themes",
                "reviewText": "This is a rousing action story starring a young woman in near-future New York City when most young people are \"modified.\" Modification involves early neurological programming. Mods selected by your parents can nullify sexual desire until you're married, for example, or make you allergic to alcohol. On the positive side, parents might choose heightened academic prowess for you, along with a healthy body immune from disease, of course.The mods are offered by an evil corporation, of course, \"ReInception,\" which colludes with the government to manage the citizens. The heroine is unmodified, her parents having rejected the technology. Nevertheless, she teams up with an underclass \"Prole\" (they live underground, of course) to expose the conspiracy and set the world right.Harmonies from movies like Inception, Gattaca, Blade Runner, Neuromancer and Clockwork Orange flow over a counterpoint of racial and social inequality, predatory capitalism and authoritarian government. One also hears notes of George Orwell and H.G. Wells. It's a dizzying mash-up of ideas propelled by Jason Bourne-like chases. It can be enjoyed for the catchy tune or for the underlying harmonies.--William X Adams, author of \"Alien Dream Machine.\"",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3DKUEJNIN4Y2XU2JDZSGOXEIHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LIDZLILLS7E0?ASIN=B0B9RG47LN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Imaginative",
                "reviewText": "Reinception was one of my favorite books. Exhausting yet exhilarating",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jackFitz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESZRA73LXYWCWKMVMSTT5RFN3SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SSYYQZSFVUPQ?ASIN=B0B9RG47LN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Good read for a teenager. Not so much for the older crowd.",
                "reviewText": "Easy read. The beginning is slow, but picks up towards the end. There are better choices.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Topaz Selman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGCSQXBV6WNSVAUE55BSUWJMM5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IN6SUXZ7F5FM?ASIN=B0B9RG47LN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2022",
                "reviewTitle": "5.0 out of 5 stars This book is a real page turner, the beginning of a saga that I look to read in the future",
                "reviewText": "This is a gripping modern day saga in the modality of the modern day 'Hunger Games' and the Classic 'Valley of the Blind' and 'Them'. I read the book in two days, just couldn't put it down. Here a hero and heroine from two worlds that have been artificially created and separated, come to understand each other's sensibilities and needs, see beyond prejudices and outer appearances, to value the other and to work towards greater understanding of common roots. The work speaks to issues and conflicts facing us today, but told in a fictional style that welcomes discussion and acceptance.ReInception refers to a technology that modifies human behavior in a world of 'Big Brother', and the Classic Orville '1984'. There is no privacy. Highlighting the ethics surrounding designer genetics, in 'Reinception' parents can modify minor children genetically and behaviorally. The heroine, Leandra, comes from parents who are conscientious objectors, who have not bought into the system, so no surprise that she is an independent thinker and can break ranks. Her counterpart hero, Prol, emerges as a powerful, independent and sensitive partner.So without revealing more of the plot, I hope others buy and enjoy.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHABPAO36W5BJOP7322MADFU35XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QYHOXFXBI8VZ?ASIN=B0B9RG47LN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2022",
                "reviewTitle": "5.0 out of 5 stars A vision of the future in league with the greats.",
                "reviewText": "Sarena Straus takes her place alongside Aldous Huxley, George Orwell, and Kurt Vonnegut with ReINCEPTION. She continues their prognosis of things to come for a new millennium. Whereas “Harrison Bergeron” gave a peak through the sheers of the future world, ReINCEPTION throws the curtains wide open. The view is as scary as Vonnegut suggested over sixty years ago.Straus offers a look at a world different and yet familiar to us today. Her vision is plausible today hinging the combining of corporate and government to control all aspects of life. The new language she created for this effort is navigable, yet slow in its first flushes. The reader is quickly drawn into this world seeing the seeds of dystopia planted in our present times with the outcome realized in the world of ReINCEPTION.Straus’ message might soon be lost but for her tight writing and rich, fast-paced character development. The reader is afraid to look up from the page for fear of missing something. I closed the last page and anxiously await Book 2 of this trilogy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZUGFX4QKN3OKXAE2WGZ4T66TWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMDLTNYJT671E?ASIN=B0B9RG47LN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy Read, Well Developed Main Characters",
                "reviewText": "‘A’ for characters, plot and romance… interesting dystopian setting with believable characters and plot. Not highly technical and a little predictable but an entertaining book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. M. Bennison",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2022",
                "reviewTitle": "Gripping!",
                "reviewText": "ReINCEPCION has everything I love in futuristic sci-fi: a gripping premise, great world-building, a heroine I can root for and an alluring (if antagonistic) ally with his own dark secrets.The book offers a fascinating (and at times horrifying) glimpse of New York in the not-too-distant future where a machine designed to “fix” bad habits and addictions has become an insidious tool to control undesirable behaviours and radical thinking.Having trouble losing weight? Can’t focus in school? Don’t like the colour of your eyes?ReINCEPCION offers a quick and easy “fix” through permanent behavioural and physical modifications known as mods. Parents can even “modify” their children so they can’t drink…have sex…or question their assigned gender.Orwell’s Big Brother meets Divergent when upper caste Leandrea and the genetically-modified Prole worker Ward risk their lives to expose the lies and rot at the heart of this dystopian world.I’m hooked and can’t wait to see what happens next. Please let there be a sequel…and soon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika Anne Livingstone",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 25, 2022",
                "reviewTitle": "Great sci-fi debut by hot new author",
                "reviewText": "\"What did you like or dislike? What did you use this product for?\"Well, Amazon, I used this product for reading, mainly, and for blowing my darn mind.In a futurist reimagine of a climate-addled and tech-elevated New York, the gap between the haves and have-nots has increased tenfold. Haves can have their eye colour changed, modify their bodies with any trend, and even change their minds and habits at will. Meanwhile, the have-nots are indentured, fitted with tracking devices, and controlled like cattle. When an unmodified upper class girl suffers a tragic event, she begins to unravel the depths of the social injustices in her world, and who is profiting from them. With her newfound ally, a mysterious (and strangely charming) savant, she must stop ReInception before it takes away the human part of us that can never be replaced.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}