{
    "remaining_requests": 1400,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hammer-God-Arthur-C-Clarke-ebook/dp/B07H17TRDS",
    "body": {
        "name": "The Hammer of God",
        "price": "$7.59",
        "originalPrice": "",
        "rawPrice": 7.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hammer-God-Arthur-C-Clarke-ebook/dp/B07H17TRDS",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71Uls4SNGxL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Arthur C. Clarke",
            "link": "https://www.amazon.com/Arthur-C-Clarke/e/B000APF21M/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 915,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07H17TRDS"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ RosettaBooks (November 30, 2012)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 30, 2012"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1297 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 210 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,405 in Kindle Store (See Top 100 in Kindle Store) #79 in Science Fiction Adventure #87 in Post-Apocalyptic Science Fiction (Kindle Store) #228 in Science Fiction Adventures"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 915 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUUXXJ6DZF42I2QY57JCTDGCY2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BOGL0PM12PND?ASIN=B07H17TRDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars good fiction",
                "reviewText": "An interesting take on the a future take on an ELE. Movie buffs might remember “Armageddon” and “Deep Impact”. Here’s a little different look by one of Sci-fis best authors. Good read, lots of twists",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. Yoshida",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFORMPU7WPFKC6UYD44RHIDJK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UVSAMN6WCHC9?ASIN=B07H17TRDS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2022",
                "reviewTitle": "4.0 out of 5 stars excellent book, poor OCR",
                "reviewText": "This is a great book, one that I have read and enjoyed many times before, so I recommend the content to all - but the OCR job is bad, resulting in many blatant errors (such as names missing capitalization) that suggest that no one even proofread this output",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "clean it up",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSUIQBGVM4BMZQFJOGIOG353AYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DJZSIL30PD0M?ASIN=B07H17TRDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars exciting",
                "reviewText": "This book makes you think about all the things floating in space and what could happen if any of it fell to earth in a populated area.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYX5YPJDOOWS6KA37IEPN2FIDGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P8RM4903EP4G?ASIN=B07H17TRDS",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2020",
                "reviewTitle": "3.0 out of 5 stars The better 'Comet Imperiling Earth' book is \"Lucifer's Hammer\"",
                "reviewText": "I read both books many years ago and was trying to recall what the differences were, so I bought e-versions and read them again.Clarke is a well-established and prolific SciFi writer. His style is straightforward and he doesn't get into florid descriptions. The story moves along smoothly and it was written such that there was no confusion about what was happening at any time, and yet a month or so after reading it, it is difficult for me to describe what occurred. It is like drinking a glass of properly-treated water. It goes down well, but then... try to describe its taste.The story is essentially this: (SPOILERS)A comet is hurtling toward Earth. Robert Singh, who won a race on the moon and was married twice, is on the ship which is going to nudge it from its path. Various setbacks occur. The comet narrowly misses Earth.The story had some distracting elements such as \"Chrislam\", the amalgamation of Islam and Christianity. Clarke himself said he was \"fascinated by God\" but if he knew a little about either Islam and/or Christianity he would have opted for a different hybrid because these two faiths' core beliefs are absolutely incompatible. Christianity believes Jesus is the Son of God, of one being with The Father, born of the virgin Mary. Islam relegates Jesus to the status of a great prophet only, not Divine, because God can not have a son. There's no way to reconcile these differences without gutting each faith and making them both meaningless.If Clark had written that Judaism and Islam combined it would take much less suspension of disbelief, because neither religion believes in the Divinity of Jesus. It's an unforced error. Anyway, the choice to make a hybrid religion was done only so there'd be a joint-\"villain\" to blame for sabotage of the mission against the comet. The story needed fanatics who believed it was God's will to cleanse Earth with a comet.Clark also has a fascination with open marriages and polyamory. I seem to recall reading such description of characters' relationship choices in other books of his. It doesn't explain characters' choices or actions so much as it is just a reflection of what Clarke sees as humanity's future (de)valuation of what the Left calls 'cis-heteronormative' relationships. Characters don't get themselves locked into relationships any longer than utility deems necessary. Individual readers may have feelings about the morality of that but Clark just writes it as a matter-of fact.The better novel of this specific disaster-type is Larry Niven and Jerry Pournelle's \"Lucifer's Hammer\". The details provided in this book describe the (co-) discover of the comet's reactions to his discovery, initially dizzy with pride and excitement, then quasi-guilty and horrified. It describes (in pre-internet terms, no less!) the media handling and how people react to the news individually and as groups; how they prepare actively or how they rationalize not doing so. The comet's impact and after-effects are described realistically, meaning that people who might think only of tsunamis and earthquakes and craters (the comet calves) ALSO learn that an ocean impact of this magnitude can send mud from the seafloor up into space, where it freezes as pellets before coming back down and pelting folks with frozen mud bits before all the rain starts.Yes, rain, lots of rain, from all the ocean water thrown upwards, then coming back down. And then there'll be global cooling as Earth's albedo changes, making winter survival tough.That's amid the power outages, widespread destruction of urban centers, looting and the utilization of cannibalism by a warlord to control his troops and subjugate local survivors.Lucifer's Hammer also has religious fanatics who believe God intended the comet to destroy the wickedness of civilization, and their perceived purpose in the post-apocalyptic milieu is to destroy the last-surviving source of electrical power, a nuclear power plant.Hammer of God: ~200pgs. Lucifer's Hammer: ~650 pgs. The latter was more entertaining and was more like a journey instead of a short trip. If you love SciFi, I advise you read them both and make the comparison for yourself.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raja Jain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6GNL573TRAP4LKPOA4XA6SBOEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX3K7297FXTFY?ASIN=B07H17TRDS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2022",
                "reviewTitle": "4.0 out of 5 stars fast paced but a good story",
                "reviewText": "Days, months, or years covered in several sentences. Character development was okay and the detail around the science and physics were vague and felt like a reach. Nonetheless, the suspense and build up were fun. Really casual Sci-fi read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "smalltowncat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHGL6ZN7OZ2TQPH5DFGT347662A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R160EUAXMSNT2B?ASIN=B07H17TRDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Timely",
                "reviewText": "One of the great novels that would be timely, no matter the year (1993). An asteroid on a collision course with Earth. Panic-stricken population, scientists working to prevent collision and religious fanatics sure that it is God's will. Colonization of the Moon and Mars, and a World Governing Body are the only differences. It's still a relevant story of astronomy and new discoveries, of the impediment of politics, religion and money, of men and women working against the odds to safeguard mankind and of the courage of which ordinary people are capable.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BigOrangeDave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBQXGWIQPHB57G6JWDZ6IQFOFEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GXARYNRYCG7H?ASIN=B07H17TRDS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2018",
                "reviewTitle": "4.0 out of 5 stars Save the world in a matter of fact manner.",
                "reviewText": "A solid story well grounded in science. There were a couple of chapters (lunar marathon, mini tiger pet, founder of chrislam) that seemed a bit out of place; almost like an idea for a short story came to him while writing the book and he just went with it. The Chrislam angle did cone back to play a key role as things unfolded.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristin K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVWMQKR72FF7DCKHWEGIFWL462Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38K47W1CHBDML?ASIN=B07H17TRDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Like it's said: Classic, Vintage Clarke",
                "reviewText": "Fun, very readable, and filled with clearly researched science. But none of the science is shoved in your face, like Clarke was good at doing: story is first and foremost, or at least the pacing and the emotional ups-and-downs, very balanced. Very exciting, playful book. Highly recommend if a fan of Clarke, or quick reads, or science fiction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maikel Rosa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 2, 2023",
                "reviewTitle": "Ainda tô esperando o impacto",
                "reviewText": "Uma coisa interessante de quando tu começa a ler várias obras de ume mesme autore é detectar a linha de raciocínio que costuma costurar as narrativas.Este livro foi como um déjà vu literário. Embora com um plot bem diferente, a história teve muitas características em comum com “As fontes do paraíso”, do mesmo autor:- o forte tecniquês, às vezes exaustivo;- a “virada” em torno dos 70% da história, testando nossa paciência até lá;- a preocupação com a plausibilidade das leis da física, maior até do que com a dos personagens;- a alfinetada sutil no pensamento religioso, em contrapartida ao científico.Aqui, ao invés de um elevador espacial, o grande projeto do nosso “herói” (sempre um homem em posição de prestígio) é desviar o curso de um asteroide cuja órbita prevê um encontro cataclísmico com a Terra.Como no outro romance, a religião também ameaça frustrar os interesses da humanidade pra garantir a “salvação” das almas, deixando que Deus decida os nossos destinos — neste caso, uma deusa, já que o asteroide foi batizado com o nome da deidade hinduísta Kali.Jamais diria que foi uma leitura ruim, mas minha expectativa de uma história com mais emoção do que preciosismo foi frustrada mais uma vez.Por outro lado, adorei as previsões do autor sobre o nosso futuro tecnológico e a credibilidade dos dados astronômicos, o que já era de se esperar desse grande nome do hard SciFi.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richieparf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 28, 2021",
                "reviewTitle": "A wonderful fix for apocalypse addicts",
                "reviewText": "Those familiar with Arthur C Clarke's other work will find in The Hammer of God everything that they have come to expect from one of science fiction's definitive authors. In his care over the minute scientific detail of each event he describes, his ability to string together different scenarios into a compelling narrative, and his willingness to explore the ethical complexities posed by humanity's future development, Clarke is unmatched.The Hammer of God depicts the efforts of mankind to avoid destruction by a potentially Earth-shattering asteroid impact. Today, alongside climate change, this is probably our most familiar end-of-the-world scenario, but as Clarke's introductory and concluding remarks in this edition make clear, at the time it was not fully accepted that the dinosaurs had met their end from an asteroid impact, let alone that humanity might do the same. Even for the reader who has seen the world end this way on screen and in written form multiple times, this story feels fresh and frightening. Don't be surprised after reading to find yourself searching the internet to try and work out which of our Solar System's many orbiting fragments is due to crash into us first.Clarke's story is situated in the twenty-second century. Humans have established settlements on the Moon and on Mars, and can travel around the Solar System with comparative ease, but ultimately all are reliant on Earth's more bountiful resources. Our protagonist, scientist Robert Singh, is one those to have ventured into space. In the book's early chapters, we find him running (or bouncing) marathons on the moon, and taking his family to Mars.When the villain of the piece - our asteroid - emerges from near Jupiter and starts to make its way Earthwards, Singh leads the mission to try and deflect it. Here, Clarke is in his element, with rockets, explosives and stoic determination each employed to try and save the Earth. Accidents of humanity - fundamentalism, error - meet with accidents of science - the unpredictability of space - to get in his way, and to make this book tense, gripping, and eerily convincing.It is not a completely flawless work. Clarke is most comfortable as a short story writer, and there are times when parts of this book feel like short pieces strung together rather than one convincing narrative. Singh's marathon exploits and his family life feel at times disconnected from his scientific mission. Nevertheless, these are minor gripes in what is otherwise a must-read for lovers of drama and science fiction alike.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 9, 2020",
                "reviewTitle": "One of his best",
                "reviewText": "As with all Clarke's work well worth a read and I'd you haven't read it for some worth re4eading",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ulises dcc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 3, 2017",
                "reviewTitle": "Otra obra maestra de Clarke",
                "reviewText": "Arthur vuelve a narrar de forma extraordinaria un futuro exterior para la humanidad, recurriendo siempre a diversos recursos literarios, te mantiene en expectativa y en algunos casos su humor rompe la tension.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Puneet Gautam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 16, 2018",
                "reviewTitle": "A very good read",
                "reviewText": "A very good read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}