{
    "remaining_requests": 1545,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Most-Unlikely-Hero-Vol-Sci-Fi-ebook/dp/B01MZYDUY6",
    "body": {
        "name": "A Most Unlikely Hero, Vol. 1: A Sci-Fi Harem Light Novel",
        "price": "$2.99",
        "originalPrice": "",
        "rawPrice": 2.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Most-Unlikely-Hero-Vol-Sci-Fi-ebook/dp/B01MZYDUY6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81g8Ya2HMjL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brandon Varnell",
            "link": "https://www.amazon.com/Brandon-Varnell/e/B00IQM7BEC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 641,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01MZYDUY6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Kitsune Incorporated (February 15, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 15, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 15652 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 237 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#511,401 in Kindle Store (See Top 100 in Kindle Store) #2,528 in Alien Invasion Science Fiction #3,389 in First Contact Science Fiction (Books) #3,415 in First Contact Science Fiction eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 641 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Justice107",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWJIVGGKLQS56HAZSN73ZELTGFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH6IBHJ8D8HP7?ASIN=B01MZYDUY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2019",
                "reviewTitle": "5.0 out of 5 stars Wannabe Hero Meets Alien Beauty",
                "reviewText": "This story borrows from the 'To Love Ru' franchise, but rearranges the settings and tweaks the characters to where they are not absolute clones of the characters that inspired their creation.The setting is in the future where mankind has populated Mars and colonized much of its own solar system. The male lead is not a love struck buffoon but an aspiring inventor drunk on matching his father's heroic legacy. However, his buffoonish antics cause considerable amount of damage which effectively ends his efforts to enter law enforcement. Upon being fired, he stumbles upon the female lead character and nurses her back to heal. Namely by feeding her.The female lead character is nearly identical to her LaLa counterpart. While not using a phone to summon her inventions, she uses a scientific wand. Maintaining the airheaded personality, but the author gives a greater passion towards being a fellow inventor which offers a commonplace interest to draw in the male character.The male character has no real love interest he is currently in pursuit of. Focused largely on become a hero. That means no Haruna clone. At least this point in time. There is the devoted sister who is friends with the character equivalent to Saki Tenjouin with that weird laughter but is given a connection to the main male character to make her as a love interest. The low IQ great warrior Zastin has a counterpart as well in this story who is good for a laugh.The author took a bit more care towards these characters by not offering a fanservice clone to Love Ru. Gone are the constant nude scenes inserted at every given opportunity. Some of those do take place suggestive situations, but its not carrying on needlessly one after another. I actually like this version better simply because the characters are treated with more dignity to them. However, it is very obvious this is a differing clone version of a already existing franchise. A ditzy runaway alien beauty, a galaxy conquering father(only mentioned in this volume), and male protagonist with the various human supporting characters. I enjoyed it. Most fans of 'To Love Ru' would probably enjoy it too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEENI5K72VR3QOQVVZJRO7NNHLNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33RVUWKZFU8BC?ASIN=B01MZYDUY6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2018",
                "reviewTitle": "4.0 out of 5 stars My Impression (Take with a grain of salt)",
                "reviewText": "Now let me just say that by no means was I not impressed with this book, in fact, I quite enjoyed it. Also, keep in mind I tend to be a glass half full kind of guy so don't expect a rant. this novel hit my expectations quite pleasantly. The setting is very interesting and the author did an incredible job of fleshing out the world (Mars City) without it coming at the cost of the story and characters, especially given the length he had for the novel.The Mc is also good, while he does come off as a bit Op (Especially at the end) it is not outside of acceptable reason, plus his status as being, powerful and a genius but destructive and unwilling to follow orders is a nice pairing of traits. The other characters are fun too and I look forward to seeing more of them as well. The series does have a good deal in common with To Love Ru from this first volume, However that hardly means it done in a poor manner (And once more I've only read Volume 1)However, I have three real.. not complaints but criticisms 1. The Mc seems to view attraction incredibly negatively blaming hormone for everything as well as thinking other scum for showing interest. (While looking down on someone for that or showing displeasure is acceptable;e he comes of as someone who thinks a stare is that of automatic dehumanization.) Whats worse is he seems to displise having even basic attraction even within his own mind. While feeling guilt of slight shame is acceptble he goes far above this as if it were a crime in his opinion to have such thoughts. However, this is a small complaint and easily acceptable.This is more of a warning really but regularly a description a action, sight or thought of something compared to something scientific and grossly over exaggerated, While this isn't bad in and of itself it does happen very often and can become slightly cringy, especially if every third one were to be described in a simpler ways it would make the comparisons to Sci-fi like things more endearing.Finally is my only real complaint and that is the black and white of the Main heroine situation, while her actions and reasoning are completely valid I do feel that the importance of the circumstance showed has been flushed out more.Maybe Spoiler: Azazel made it clear he knew the actions he and the other bodyguards were taking were wrong and cruel when in reality the circumstance was far from such. While not being morally acceptable to the heroine a simple statement of the importance of an arranged marriage would've been far more compelling then painting king Lucifer a bad, evil king who cares nothing for his daughter as but a pawn.Instead, it would've been interesting to explore the reasoning even if only vaguely of the necessity of such, as nobles and royalty of notable upstanding throughout history have always given up certain freedoms for the betterment of their people. Especially considering the king's position was earned through virtue of his skill and without a proper heir of which the people will accept it would create a galactic civil war costing the life on an unimaginable scale. in comparison to that the MC's reprimanding of them as insulting of them seems unjustified. since someone as smart as him who aims to be a hero should recognize the plight of Lucifer even if he doesn't like him for viewing his daughter as such given what information he knows.Its also comes off as a bit annoying how he hold so much sympathy and empathy for the heroine but nobody else. (His superior or Azazel.) Somebody as smart as him whose goal is to be a hero should be able to at least understand the ramifications his actions but instead ignores or straight refuses others commands and cause destruction and then demean other views as primitive or outdated without considering the rhyme or reason or difference in the hierarchy of the aliens or the heroines significances within said hierarchy,However, I feel like this topic was only touch on barely and that the MC was agitated so more than likely I will be pleasantly surprised in the next volume to see a level-headed MC Understand the situation of it all. I could've seen Azazel saying something along the lines of you are a foolish child... arrogant and ignorrant to king Lucifer's plight. However, I do not dislike that. Your loyalty to the princess is true and your resolve admirble.All in all, I did quite enjoy this novel and fully intend to read the next three.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. R. Newcomb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQAYM5UBVKNIEF3OFY4WV2W6RQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJL5QE8DWNNX5?ASIN=B01MZYDUY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Trouble (To-Rabu-Ru) In Space",
                "reviewText": "As many other reviewers have mentioned, this is heavily inspired by the infamous Japanese manga/anime series 'To Love Ru' and 'To Love Ru: Darkness' to the point where certain elements are a near-direct steal. But...It's not quite the same cast and it's definitely not the same story. Oh, most of the main characters from the source material are present (and it was a lot of fun identifying them), but there are some significant differences, particularly in the hero's and main heroine's families, and also in the setting. And of course, the hero is an entirely different (and frankly far more interesting) character.If you have read and enjoyed the original, I'd recommend this one. More action, a much more enjoyable hero, and some really fun divergences into other fantasy realms make this series a lot of fun to read. And it's definitely more family-friendly than the original! If, on the other hand, you've never read the original, I still recommend this one, if only because it's a pretty darn good story in its own right and I'm enjoying the hero's development. I hope Mr. Varnell keeps up with this series - I'm really curious to see what happens when Alex finally unlocks some of those seals.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 12, 2020",
                "reviewTitle": "For anime lovers",
                "reviewText": "Good story and characters. MC is ok and Gabrielle is so bubbly and adorable. Love the cyberpunk-ish world set in mars.Check out the audiobook. Its amazing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anakin Dragon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 9, 2020",
                "reviewTitle": "A great romcom(?) novel",
                "reviewText": "As promised, this is like a Sci-Fi version of \"To Love-Ru\". The story is pretty close, but (again - as promised) with a much better MC/protagonist. It's a lot more fun to read with the characters' quirks and the well thought out backstory.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 11, 2018",
                "reviewTitle": "Great read",
                "reviewText": "I have read all the American Fox series then came to this book, so glad I did. Hoping for the next book soon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ceridan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 24, 2017",
                "reviewTitle": "A most unlikely hero indeed.",
                "reviewText": "This story is basically To Love Ru if the male protagonist was also an inventor and the alien female was from an angel themed race instead of the daemon themed Deviluke. Oh and said alien female makes me think of a certain silver haired nun for some reason.Unlike the American Kitsune series(by the same author), this book does not have constant 4th wall breaks.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rycott",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 6, 2017",
                "reviewTitle": "A fun action/ecchi light novel.",
                "reviewText": "If your a fan of anime and manga, especially To Love-Ru, then you will most likely find this story highly enjoyable as well. It takes a similar premise as To Love-Ru but has a much more likable protagonist, a cute heroine and a nice spread of other characters that are yet to be fully fleshed out but are enjoyable enough to make you want to find out more.It has good comedy and action scenes and plenty of ecchi for people who enjoy that kind of thing. And I get the feeling it will ramp up even more as the volumes move along.There is plenty of foreshadowing of future developments to keep you coming back for more volumes in the future.Good stuff.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}