{
    "remaining_requests": 1357,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bad-Weather-Friend-Dean-Koontz-ebook/dp/B0C2VYV9KD",
    "body": {
        "name": "The Bad Weather Friend",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bad-Weather-Friend-Dean-Koontz-ebook/dp/B0C2VYV9KD",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81GkJIs4EtL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Dean Koontz",
            "link": "https://www.amazon.com/Dean-Koontz/e/B000APG4T6/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 15632,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Benny is so nice they feel compelled to destroy him, but he has a friend who should scare the hell out of them in this breathtaking new kind of thriller by #1 New York Times bestselling master of suspense Dean Koontz.Benny Catspaw’s perpetually sunny disposition is tested when he loses his job, his reputation, his fiancée, and his favorite chair. He’s not paranoid. Someone is out to get him. He just doesn’t know who or why. Then Benny receives an inheritance from an uncle he’s never heard of: a giant crate and a video message. All will be well in time.How strange—though it’s a blessing, his uncle promises. Stranger yet is what’s inside the crate. He’s a seven-foot-tall self-described “bad weather friend” named Spike whose mission is to help people who are just too good for this world. Spike will take care of it. He’ll find Benny’s enemies. He’ll deal with them. This might be satisfying if Spike wasn’t such a menacing presence with terrifying techniques of intimidation.In the company of Spike and a fascinated young waitress-cum-PI-in-training named Harper, Benny plunges into a perilous high-speed adventure, the likes of which never would have crossed the mind of a decent guy like him. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C2VYV9KD"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Thomas & Mercer (February 1, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 1, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4342 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 374 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1662517777"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14 in Kindle Store (See Top 100 in Kindle Store) #1 in Science Fiction Adventure #1 in Action Thriller Fiction #1 in Suspense Action Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 15,632 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/670e0f72-8933-4d67-9b58-d02571744b9a.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bethany T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7B2SI3IYO6TJ6P2G3GOJYDLPXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QMHH9W96UFMK?ASIN=B0C2VYV9KD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Kitschy sci-fi masterpiece",
                "reviewText": "I got the Kindle edition via Prime First Reads. Prior to this, I had read some of the Odd Thomas books, but so long ago that I don't remember much about them, other than they were better than expected.Concurrently, I have a paperback copy of Gustav Meyrink's \"Golem\" which is written in German, and I have to force myself to read it. I was so intrigued by the description of \"The Bad Weather Friend\" because it sounded like it was going to be about a Golem. There are some indications that the Spike character might have somewhat of the role of a Golem...a few hints here and there, but really, it is its own type of entity. Frankly, when I started this book, I had to force myself to keep reading it, as it truly was more cumbersome to read this, which is written in English that I use everyday, than it is to read something in a language I was somewhat raised with, but no longer use everyday! There's a ton of very uncommon and unusual words in this book. I highly recommend getting the Kindle copy of this because you can highlight the word and get a definition--usually the definition included \"(archaic)\" or \"(dated)\". So its full of archaic and outdated words, but in a sense, that it refreshing and I appreciate it. Almost all of the pop culture references were Midcentury. There's tons of little references to old songs, art, and bizarre names that mean things in other languages, or almost mean something in another language. There's little jokes or Easter eggs that reinforce the true meaning of the name, but for a lot of the readers, even with the reinforcements, I think the joke/ reference will be missed. An example was a character named Theron who is described as \"beast,\" with that name, or rather Therion meaning beast in Greek. Usually, when a foreign phrase is used in dialog, the translation is given later in the dialog; its just the names that go untranslated, but accompanied by hints, like they are insider's jokes for the initiated.It reminds me of 1940s sci-fi in the way it is written. That was my earliest impression, even before much that could be considered sci-fi had happened. Very retro. Even has omniscient narrator sequences. By the end, there's a lot of really retro sci-fi stuff along with an undercurrent of politics (specifically anti-capitalism). Talk of secret societies that use algorithms to repress nice people. Really the closest thing I can compare this book to would be \"Illuminatus! Trilogy\" by Wilson and Shea. Bizarre, weird, highly intelligent, odd yet meaningful names, politicized, sci-fi, historically rooted, occult, eschatological. Bad Weather Friend is an easier read in comparison, and I did get into it by the final third of the book.Despite the dated cultural references and vocabulary, there are some very current themes in this book, including individuals being targeted via algorithms, and the dangers and consequences of EVs. There are several other themes in this book, including home design and origami (of metals, money, and space-time) but I am not trying to write a book here in this review!One little incident from the book nags at me, I will try to describe it in a way that doesn't spoil anything for a prospective reader, and in hopes that it will help inform at the time it is read. There's an incident where a character gives himself an antidote to a very specific toxin. Something we don't really work with much these days. Back when we did, if the rabbit died, the worker took the antidote. But suppose that the rabbit died of natural causes, not a toxic leak. If that happened, and the worker took the antidote, he would die unless exposed to the toxin. I assume the author is aware of all this, but was afraid to spell it out, or maybe the author had the correct intuition of what happens in these circumstances but didn't know as a matter of absolute fact. Either way, the characters were unaware and assumed incorrectly in regards to the means of a death.Bottom line: this book is superbly well written, sometimes in the same way that TV commercials for big insurance companies are well written, but it was initially difficult for me to get interested in it. Its difficult in the way it is difficult to read some older sci-fi stuff. It is very clever and I loved it for what it is. A lot of smart humor. Many deep insights. Kitschy at times. One of those rare books that I found myself highlighting with various colors, and typing notes into. One of those rare books that I surely will reread in the future. One that will stick with me.",
                "reviewVotes": "98 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEEZK55D4Y2KTHYKL6FAMXZ4ROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32OUCF8Z8KHBE?ASIN=B0C2VYV9KD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "4.0 out of 5 stars A Fast Engaging Read",
                "reviewText": "I am utterly amazed at how fast I read this book!! I believe I read the whole thing in about 5 hours?? It just gripped me from the very beginning and didn't let go. At all. And even better is the fact I really liked Benny the main character. In many ways he reminds me of myself. I have autism so I often can be confused by other people if they are not clear in what they are trying to say or convey. Like that opening scene where Benny is talking to his boss at the real estate agency. That conversation would have confused me too... I also would have been confused about the why. Because his boss had not explained it at all. Which I certainly feel is unfair...But I loved the writing style in here. The story flows so smoothly and one can read it super fast plus the story is so interesting. It doesn't stall either but keeps going. Lots of stuff happens, some of it weird and of a supernatural nature. There is definitely some weird stuff in here. Unexpected stuff.So why did I rate it 4 stars and not 5? Well lets just say I don't exactly understand the core message in here. The thing about nice people being a threat. I guess I sort of understand it but its more I don't believe it. I think those rich people are too busy doing rich people stuff to care about some small time guy just trying to live his little life. Maybe it he was running for office or something he would be a threat but how many people does a real estate agent actually meet? still this was a very fun story to read. Very entertaining.But the author is right that nice people are often mistreated by others. They are seen as easy targets. Unfortunately.",
                "reviewVotes": "135 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lonnie-The GreatNorthernTroll-Moore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRHAQEWZCXORTO7JBU2B5JNQDMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJUIWOK0PYLL3?ASIN=B0C2VYV9KD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars This book cracks me up and is nothing like you've ever read before.",
                "reviewText": "The moment I laid my eyes on the first page of this book, you could've colored me intrigued. Intrigued enough for me to move this book up to first place on my favorites for the year!!! I often have trouble writing reviews but not this review as it practically wrote itself, 😆. I've actually never read anything quite like it before. I might just be the fact that I've only read 3 other books by Dean Koontz but I doubt it, as they've all been different. And the time spent in Benny's memories at Briarbush Academy intrigued me more than ever 🤔. As Dean Koontz holds his cards close to his chest, not planning to reveal anything 'til the very twisty end!Just know this book cracks me up not only is it totally insanely fun, but, like I've already stated I've never read anything quite like this novel before, and, I can safely say, neither have you!Although there's a plethora of quotes to choose from, these are the ones that caught my eye. Grab the book and discover your own favorites:Harper seemed to have discarded her heretofore professional conduct in favor of full-on Nancy Drew enthusiasm.“Trust me, Benjamin, and I will always keep a kindliness of heart toward you even when your behavior is vexatious.”The best they could do to cope with this fear was open another Coke, drop another aspirin, and hope for inebriation.“White chocolate sucks. It isn’t really chocolate. White chocolate is a fraud.”",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shareen Douglas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2024",
                "reviewTitle": "A Bad Weather Friend Indeed...",
                "reviewText": "This book answers the question why bad things happen to good people in a playful way and yet still manages to make it work out for the protagonist in the end. A pleasant read indeed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs J E-P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "Quirky and intriguing",
                "reviewText": "Benjamin Catspaw is a really nice guy, which is about to ruin his life. Without explanation or expectation, he loses his job, his girlfriend and his future. But he also gains something that will change his life for the better, it’s just that he’s not yet sure that he trusts it.Benny has had an interesting life and as he struggles to come to terms with his current predicament, he recalls the defining incidents and moments from his life.Intriguing, as his past and ‘gift’ are revealed. Humour and breaking the fourth wall add an extra dimension to Koontz’s traditional tales of suspense and intrigue. Fun to read and really enjoyable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ray",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 12, 2024",
                "reviewTitle": "Kooky Koontz combo of just about all Koontz story lines.",
                "reviewText": "First class word smith like Koontz made me smile for at least a third of the book. He has amazing ability to say the oddest things. Lots of words which are American vernacular I had to look up.So many characters and very modern movie like execution, felt like a script at times. It is certainly a style that almost went overboard in later parts of the story. Overall a really fun ride. All your familiar characters are there in one form or another.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patti Ham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Pretty good easy read",
                "reviewText": "Good story, easy to read. A little bit 'out there ' not entirely my cup of tea, but still a good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darth Gixxer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "Not what you might expect…but no worse for that",
                "reviewText": "This isn’t a normal thriller. Or horror, sci-fi or whatever.What it is, though, is beautifully crafted, engaging, funny and heart-warming.You know how it’s going to end reasonably early but that doesn’t spoil it. It’s not the destination, it’s the marvellously described journey that matters.It’s a great read. Try it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}