{
    "remaining_requests": 1411,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Institute-Stephen-King-audiobook/dp/B07N99GY6J",
    "body": {
        "name": "The Institute: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Institute-Stephen-King-audiobook/dp/B07N99GY6J",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51sgU3xi12L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephen King",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Stephen+King&search-alias=audible"
        },
        "brand": "Stephen King&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 58112,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A 2020 Thriller/Suspense Audie Award winner!A New York Times 100 Notable Books of 2019 selectionFrom number one New York Times best-selling author Stephen King, the most riveting and unforgettable story of kids confronting evil since It. “This is King at his best” (The St. Louis Post-Dispatch). In the middle of the night, in a house on a quiet street in suburban Minneapolis, intruders silently murder Luke Ellis' parents and load him into a black SUV. The operation takes less than two minutes. Luke will wake up at The Institute, in a room that looks just like his own, except there's no window. And outside his door are other doors, behind which are other kids with special talents - telekinesis and telepathy - who got to this place the same way Luke did: Kalisha, Nick, George, Iris, and 10-year-old Avery Dixon. They are all in Front Half. Others, Luke learns, graduated to Back Half, \"like the roach motel,\" Kalisha says. \"You check in, but you don't check out.\"In this most sinister of institutions, the director, Mrs. Sigsby, and her staff are ruthlessly dedicated to extracting from these children the force of their extranormal gifts. There are no scruples here. If you go along, you get tokens for the vending machines. If you don't, punishment is brutal. As each new victim disappears to Back Half, Luke becomes more and more desperate to get out and get help. But no one has ever escaped from the Institute.As psychically terrifying as Firestarter, and with the spectacular kid power of It, The Institute is “is another winner: creepy and touching and horrifyingly believable, all at once” (The Boston Globe). Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "18 hours and 59 minutes"
            },
            {
                "name": "Author",
                "value": "Stephen King"
            },
            {
                "name": "Narrator",
                "value": "Santino Fontana"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 10, 2019"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07N99GY6J"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#887 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Genetic Engineering Science Fiction (Books) #16 in Supernatural Thrillers (Audible Books & Originals) #45 in Psychological Thrillers (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephen L. DaltonStephen L. Dalton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3W46QI7OV7LGM4FQZHBNFCQAVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFPZLOVGDOSCP?ASIN=B07N99GY6J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2019",
                "reviewTitle": "5.0 out of 5 stars The Institute Depicts Monsters that Aren’t Supernatural",
                "reviewText": "IntroductionThe Institute depicts monsters that aren’t supernatural, but instead, look just like you and me. In this review, I’ll give an overview of this novel without spoilers while expressing my opinion about his latest thriller.I have read most of Mr. King’s book, and this can stand toe-to-toe with the best of them. The kids are the heart and soul of this story. Their stories will tug at your heartstrings.SummaryMysterious individuals sneak into a home at night and kill the parents of a genius child prodigy named Luke Ellis. These individuals then kidnapped Luke and put him in The Institute in the backwoods of Maine with other kids that also have abilities like telekinesis and telepathy. Now Avery, Iris, Luke, and multiple other children must find a way out of this sinister institute that seeks to exploit their abilities, even though no one has ever successfully escaped before.NarrationThe narration is in the third person by an outside, unknown perspective. It gives great detail on how each character focused on sees the world. For example, the parents of Luke are both proud of and scared for their child. Tim Jamieson, a drifter with a law enforcement background, who takes on the job of “night knocker,” has a pessimistic outlook on the world that gradually brightens the longer he stays in DuPray, South Carolina.SettingThe book is set in modern-day, as it mentions and takes a few jabs at Donald Trump as the president. This drives the underlying plot about the horror of abducting children and treating them as a means to an end. Stephen King has criticized the Trump administration for inhumane acts for “the greater good,” a similar theme expressed in The Institute. The book, according to The Washington Post Review, calls out “the inhumane treatment of children and the loss of a moral compass for those who inflict it.”ThemeJust as It and some of his other works, The Institute has a side theme that emphasizes working together can be more powerful than we realize. The Institute also talks about how even the tiniest choices can lead to marvelous possibilities and circumstances.GenreThe Institute’s genre is “horror.” In fact, The Institute won the Goodreads Choice Award in the Horror category, garnering nearly 40,000 more votes than its closest competitor, even beating out King’s son Joe Hill’s Full Throttle.King’s other works that fall into this genre have shown to have compelling, edge-of-your-seat plots, but this is considered one of his scariest. The horror of the underlying message of this latest work and the possible posers of our government, give readers more chills than killer clowns, vampires, rabid dogs, and ghosts.AuthorStephen King has shaped a generation with the over fifty books he has sold all over the world. Some of his most famous novels like It, The Shining, 11/22/63, and The Stand, have moved on to other forms of media like movies and television series. Though it has many of the same foundational themes and ideas that King’s other novels have, The Institute tells a different story in a chilling way that will keep you up at night.PlotThe longer Luke stays in the institute, the more he learns about the sinister system and how it’s structured. Obedient kids are treated with tokens for various treats at a vending machine, while those who aren’t compliant get punished, often severely.The agents in the institute conduct sordid experiments on the inhabitants to strengthen their abilities, or so it would seem. However, some of the children believe it is just sadistic torture.My OpinionSome of the main characters include Luke Ellis, Kalisha, Avery Dixon, Iris, George, Nick, Tim Jamieson, Mrs. Sigsby, and Trevor Stackhouse.The director, Mrs. Sigsby, is tasked with running cruel experiments on these extraordinary children. If I were casting a movie or TV series for this book, I would choose Linda Hunt “Hetty Lange” from NCIS: Los Angeles to star in her role. Just put her in a red pantsuit and stand back!I would probably cast Dean Norris, the Town Councilman from Under the Dome as Trevor Stackhouse, the Security Supervisor. You might also remember him playing the drug enforcement agent in Breaking Bad. Likewise, I believe Ryan Gosling would fit the part of Tim Jamieson very well. Just my opinion, of course.My favorite would have to be Luke Ellis, as he was an enthusiastic and bright young kid who slowly changes. Luke might be played best by an unknown, but I believe Finn Wolfhard, Mike Wheeler in Stranger Things could also pull off the part.The main characters interact similarly to two people in a chess match: each has to make a move and be able to predict what the other will do. Any of the cast of child actors from Stranger Things would fit right into this story.If you’re someone who likes to read about the horrors hidden within our society, then The Institute will be a good read for you. I encourage others to read this book, as it makes you think about the world around us as well as what it’s becoming. The initiation of change can’t come without awareness, first.I’ll happily read more from Stephen King because he tells what seems like regular stories in such a unique perspective that it makes those stories intriguing. I’m one of the “constant readers” who would buy if he published a new book every week.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61FQFFmBkiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Russ Stevens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGERWCOE2BP4PGBU3FVPVAOWMNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XPYHG9KNQBYA?ASIN=B07N99GY6J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "Thought it wasn’t delivered, but actually was delivered earlier today. Great shipping.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda SmithBrenda Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWSLZI6JJ7LVGWJI3G3ZINKE5WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPNRPH27H9JDI?ASIN=B07N99GY6J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Engrossing read",
                "reviewText": "The story begins with ex-police officer Tim Jamieson hitchhiking his way from Florida to New York, only to find himself in the middle of nowhere in South Carolina. Here he takes on a job he’s extremely overqualified for as a night knocker, which is basically foot patrol, checking on businesses and any criminal activity after hours, for this small town police department. He meets a variety of colorful and diverse characters, which King expertly brings to life.We’re then introduced to 12 year old prodigy Luke Ellis, destined for MIT, whose life is forever changed when he’s kidnapped in the middle of the night without a trace. He awakes in a facility hidden in the middle of the woods in Maine, where he discovers he’s not the only child taken for their extraordinary abilities, specifically telepathy and telekinesis. Here they’re subjected to a plethora of tests and experiments no one should ever have to endure.The story comes full circle when Luke, in his quest to free not only himself but the other children, crosses paths with Tim and they all band together to fight the evil that has taken hold of them, the secret government program known as The Institute.This is a LONG and somewhat slow read (as many King books are), but once the action picks up, it no longer feels that way. It’s engaging and thought provoking, with several references throughout to some of his older works. While it wasn’t my favorite King book, it was still an engrossing read that will have you questioning some of what plagues our world now.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IqOkiI4cL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "C Wm (Andy) Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF7I7LZDDTOCHRMHUMOBXHFTKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15W89N6MIHY9H?ASIN=B07N99GY6J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2019",
                "reviewTitle": "5.0 out of 5 stars King Brings Us Back to His Roots....",
                "reviewText": "As I sometimes do, I’m going to open myself up to you in a way that may, or may not, resonate. I hope it does, but I know it is probable that detractors will hurl insults my way, as they toss expletives at the master of horror himself. Wish I could state that in so doing I share a common ground with King, but, frankly, I am no more qualified to walk in his shadow as a writer than I am to walk in the shadow of Saint Peter as a Christian.So, why am I such a fan of Stephen King? I became a fan not due to his fiction. That writing took years of exposure before he won me over. His nonfiction writing, though, went straight to my heart. You see, I am a bit old-fashioned when it comes to fiction and writing. I loved some fiction, such as Old Yeller and Shane, but, my interest always was oriented toward the nonfiction tales by the likes of John Goddard (Go North, Young Man), Eric Collier (Three Against the Wilderness) and Bradford Angier (several books on living off the land).Then, one day, I read “The Stand.” That book was the culmination of everything I felt a novel should be, written in exactly the right language and flow.In recent years, King has penned a vast number of tales that tickled that nerve hidden deep inside me. While I enjoyed most all of them, not one of them satisfied that itch deep inside. Until, perhaps, “The Institute.Once again, King is not the ‘artist’ on par with James Michener or John Steinbeck or F. Scott Fitzgerald. When it comes to plain English writing, especially the sort where the writer stays outside the story and lets his characters get through to us so we can see the world through their eyes, though, no master storyteller comes close to Stephen King, in my humble opinion. So, as you peruse the review below, know that I am prejudiced in favor of Stephen King.In “The Institute,” we begin our journey in a small village of South Carolina. The opening is a masterful way to tug us along as we get to know a key figure and setting. Later, we meet our protagonist in Minneapolis and still later we get to know him (Luke) in Maine. To expound further would lead to spoilers, which I refuse to do…BLUSH FACTOR: If you’ve never read a Stephen king book, it might surprise you to learn the master of horror does not write for children or for people whose ears are sensitive to foul language. Yet, I found myself enthralled by yet another novel by one of my favorite authors.POV: Presented in third person point of view.WRITING & EDITING: In my opinion, no writer alive today gets into the heads of his subjects and tells their story to us better than does Stephen King. I marvel in considering how perfectly he presents these kids in their own words. I mean, King is in his seventies, how in the world can he so perfectly sound as though he is one of those kids?BOTTOM LINE:As enthralled as I am by this latest offering from Stephen King, it should be obvious I am rating it five stars out of five.",
                "reviewVotes": "830 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tambria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Great book",
                "reviewText": "Loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 15, 2022",
                "reviewTitle": "Es muy practico y como el libro de bolsillo",
                "reviewText": "Me gusta leer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JenniferT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 17, 2024",
                "reviewTitle": "Loved it",
                "reviewText": "I've read a lot of mediocre books recently and this is the first book that has properly grabbed me for a few months.I was sucked into the story of Tim in the early stages and then our main protagonist, Luke.From the opening chapters, you would have no clue how this story was to unfold if it wasn't for the book's blurb. It's fantastical but real, horrible but kind and captivating throughout.It's on the longer side and I'm glad I had the time to really get into it and finish it in 2 days. So glad to have picked this book as my next read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "manfort",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 18, 2023",
                "reviewTitle": "Großartige Geschichte vom Meister des Horrors",
                "reviewText": "Dieses Buch hat mich wirklich gefesselt. Vom Anfang bis zum Ende eine wahrhaftig tolle Geschichte, die nur aus der Feder von Stephen King stammen konnte.Die Story wirkt sehr glaubwürdig und es würde mich nicht wirklich wundern, wenn es so etwas geben würde. Ich hoffe jedoch nicht.Eine sehr spannende Erzählung mit vielen unterschiedlichen Charakteren, die man fast glaubt zu kennen.Ich habe viele seiner Romane gelesen, nicht alle, aber halt viele. Ich bin nie enttäuscht worden, so auch mit diesem Roman. Wirklich klasse geschrieben.5 Sterne von mir, Prädikat: Lesenswert...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lasne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 24, 2023",
                "reviewTitle": "Produit conforme",
                "reviewText": "Produit conforme à la description",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}