{
    "remaining_requests": 1426,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/HALO-Fall-of-Reach-Eric-Nylund-audiobook/dp/B07LH67B7W",
    "body": {
        "name": "HALO: The Fall of Reach: HALO, Book 1",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/HALO-Fall-of-Reach-Eric-Nylund-audiobook/dp/B07LH67B7W",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51jrXOqbOqL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Eric Nylund",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Eric+Nylund&search-alias=audible"
        },
        "brand": "Eric Nylund&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 3637,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The New York Times best-selling origin story of the Master Chief - part of the expanded universe based on the award-winning video game series Halo!The 26th century. Humanity has expanded beyond Earth’s system to hundreds of planets that colonists now call home. But the United Earth Government and the United Nations Space Command is struggling to control this vast empire. After exhausting all strategies to keep seething colonial insurrections from exploding into a full-blown interplanetary civil war, the UNSC has one last hope. At the Office of Naval Intelligence, Dr. Catherine Halsey has been hard at work on a top-secret program that could bring an end to the conflict...and it starts with 75 children, among them a six-year-old boy named John. And Halsey could never guess that this child will eventually become the final hope against an even greater peril engulfing the galaxy - the inexorable confrontation with a theocratic military alliance of alien races known as the Covenant.This is the electrifying origin story of Spartan John-117 - the Master Chief - and of his legendary, unstoppable heroism in leading the resistance against humanity’s possible extinction. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "TV, Movie, Video Game Adaptations",
                "link": "https://www.amazon.com/Movie-Tie-Ins-Genre-Fiction-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=4497"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 3 minutes"
            },
            {
                "name": "Author",
                "value": "Eric Nylund"
            },
            {
                "name": "Narrator",
                "value": "Todd McLaren"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 01, 2019"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio/Halo Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07LH67B7W"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#400 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Movie, TV & Video Game Tie-In Fiction #5 in Military Science Fiction (Audible Books & Originals) #7 in TV, Movie & Game Tie-In Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David B Sager",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHC4WRRX3DQERONOL5JSIMCECEVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NYD4NS3NPQ1?ASIN=B07LH67B7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2023",
                "reviewTitle": "5.0 out of 5 stars great book, that breathed life into a hollow Bungie-shell.",
                "reviewText": "the writing is not good.developing a character that isn't ever allowed to have character.countless things have been changed in this book prior to this version.which is good .. but not because of Bungie.you see, Bunnies were full of themselves.They believed they made a great game because they found what they could not envision by finding what works and following it's lead.and because of this, they felt they were the only ones that determined what the story was.they did not support, approve or like the book.and especially did not like keeping things canon between the games and books.Bunjie was in the works to ruin the canon of the books forever.but 343 Industries understood Halo and how having a story that expans beyong the viewbox of the games was always a major reason Halo was so good.it allowed the fans, to follow story, lore, character arches etc. and wonder, imagine and understand the very complete and thought-out world of Halo.343i are the savers of a retro boomer-shooter fps game that was only planned to be left behind.they where able to look at what is a very old, poorly aged game series and brought every ounce of the greatness that was inlaid within those old stumbling in the dark, 'sounded good on paper' early 3D video games.but because the boomer-era bungie-Halo games first and foremost were meaningfully actualized 'on paper' 343i drew upon that, and aligned the franchise with all the lore and love put into the books and foundation of the games.it's with great appreciation that 343i worked lovingly hard to take the Halo serious and raise it from the remnants of the Pentium-Era. to raise Halo to the realms of great science-fiction literature where this first novel unvailed the sure complete and expansive universe that is Halo.and the direction id Software is taking the story within the newest Halo game made by them has been wonderful to struggle within John 117, and know the Everdeem Hollow where Master Chief begins and ends eternally.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Marsh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2C2FRXWNRBNT7NO2HZHZMRPSQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J9JG7VLQ8RWK?ASIN=B07LH67B7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Quality Condition, Quality Content",
                "reviewText": "The book came well packaged with no damage. The cover art is vibrant and exactly as shown.Upon opening the box I was met with the smell of a brand new book. I got to break the spine in and dive into it. I read through the entire story in two days, and even though it was quick it was well worth the read. Amazing story with updated and reworked events to include the expansions that the series has seen through the years. This book is a great starting place to follow the Halo series, whether new or a returning fan.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emphatic Titan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDBULILAGM6H4AMVXGRCBNX6QWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8F6V2UEFM29X?ASIN=B07LH67B7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Lays the ground work for Halo",
                "reviewText": "I read this book years ago and thoroughly enjoyed it. Nylund is an excellent writer and does a great job at capturing the deprevaity of the covenant. The book does a phenomenal job at at providing us insight into the spartan program and the candidates training at a very young age. It shows the early life of John 117 along with blue team as well as giving you an insight to his mind and the spartan program. It also displays the mother-ish relationship between Halsey and the Spartans. A must read for Halo fans",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jake",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOO2N3KCVDO4YUWWRZRTFI4SKJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QG523C3QQ4DC?ASIN=B07LH67B7W",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Good Read",
                "reviewText": "Read it before. Halo shaped my love for first-person shooters and sci-fi. So yeah, why not buy the book?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Uri Joe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK6GEKJ3HY5HFCJINTNU3APRBBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REFKB1N7SZ7S9?ASIN=B07LH67B7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Exremely engaging book!",
                "reviewText": "From the start, as the Master Chief and his team kill countless Grunts, you can feel the adrenaline that the Chief would have felt... and that's it... you are hooked. So many close calls and near-death experiences keep you, the reader, on edge. You have the chance to experience the life of a legend, to walk in his shoes. All of the experiences you and the Cheif go through give immeasurable value to the Halo games. Unfortunately, I almost wish I could forget the book and read it again to have the same thrill as the first time I read it. All around an amazing book.The only notable flaw with the events of the game is halo reach. In the game, noble 6 gives Cortana to the pillar of Autumn that had been stationed for restorations, but in this book, the pillar of Autumn never actually enters into the planet's atmosphere plus Cortana had been given to the chief a while before the battle of reach, but that is it.I would rate this book a 6 out of 5 stars. Would read again... for the 5th time... I'm not a psychopath... I promise... read this book",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Ken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCIEKHKWI4VVJ3UCFSVNY2AUK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MAOD0EFFT97X?ASIN=B07LH67B7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent",
                "reviewText": "I dont normally spend this much on a book, or at least if it's in my library, I dont. However I started watch the series HALO and now I'm hooked. This is a great series so far but its just getting started. Oh to be a millionaire and be able to afford all the series at once. I'm going to continue to buy these one at a time and slow my reading speed so I might be able to afford the next one. I am in my 60s and living cheap so everything counts at th his age. Thanks for a great read and I'll be back for more.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCF3QNPCOZ7DH3COA4RHHU4NVCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24A00708KEVXX?ASIN=B07LH67B7W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2023",
                "reviewTitle": "5.0 out of 5 stars W book",
                "reviewText": "Amazingly written. After playing every game growing up and know much of the lore, it was amazing to read this book and see all of the information that I have been learning throughout the games. Perfect depictions of space battles and the SPARTANS and how they work are written to perfection. My absolute go to series for sci-fi battles and future depictions of the Human race.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Drew’s",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 26, 2023",
                "reviewTitle": "Good book",
                "reviewText": "Needs to be packed better when shipped but thankfully there was no damage",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Artur Perbone",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 2, 2021",
                "reviewTitle": "A nice read for Halo fans",
                "reviewText": "Bought it for Kindle and loved it. Tells a lot about the Spartan IIs and their first contacts with the Covenant and of course the Fall of Reach",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "eval",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 12, 2023",
                "reviewTitle": "awesome book",
                "reviewText": "I am currently reinstalling halo tmcc again and am reading this book damn awesome.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I. Jones",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 9, 2023",
                "reviewTitle": "Gripping account of humanity in peril",
                "reviewText": "If I said I haven’t read much sci-fi since I was a teenager I’d be lying because in the last year I’ve read ten novels in The Expanse series (and watched the TV series on Amazon Prime). Then I started watching the Halo series on Amazon Prime and decided to read this book, not realising that there are about twenty volumes in the Halo series, written by different authors. Very much a team effort, like the Spartans, who are the elite super-soldiers protecting us from the Covenant – the evil aliens who want to wipe out humanity.First, let me offload some gripes and prejudices. According to the “fore world”, this book was conceived and written in four months – and it shows. In some places the writing is a bit sloppy. We’re told several times that the Spartans have standing orders to seize any alien technology they can get their hands on. Fine. We only needed to hear that once. Every chapter begins with a precise location and date for the action, down to the exact hour, yet despite that the author and the backup team manage to lose a decade during the course of the novel. John – the Master Chief – and the other Spartans are kidnapped as six-year-olds in 2517. The main action takes place in 2552. According to my arithmetic that’s 35 years later, yet a key character is convinced that the gap is only 25 years. It means that characters are ten years older than the author apparently thinks. We have senior officers calling John “son” when he’s 41 years old, which is really really patronising given his martial prowess! Remember, he and his comrades performed their first successful mission against the aliens as 14-year-olds. Another gripe – or prejudice – is that the prevailing culture in 2552 is pure American. This novel seems to have been written in 2001. Twenty-odd years later, the chances of the US providing the dominant culture over the next five hundred years seem increasingly remote. Specifically, we’re given a “Pentagon” culture that in many ways feels a bit like the US in the 1960s Vietnam rather than the twenty-first, never mind, the twenty-sixth century. I say that because despite some notable victories, humanity is losing this war against the Covenant, and the top brass are getting increasingly desperate. One more gripe is about technology. As in The Expanse series, we have a strange mix of futuristic technology (spaceships that can travel in another dimension and colonisation of distant planets) and contemporary hardware (guns that fire bullets, electric cars). There is AI but even the most sophisticated AI beings are only there to assist humans. They haven’t taken over yet. You can’t help wondering why all the fighting isn’t being done by drones and robots and these AI beings rather than by people. But that’s the problem: if the available technology was used to its fullest extent this would be a novel about machines rather than about humans.Having said all that, the novel is an enjoyable piece of escapism with some great action and some genuinely compelling characters. There’s Dr Catherine Halsey, the enigmatic genius scientist who conceived the Spartan programme. We’ve not been told anything about her origins in this volume, maybe that will come later, but she has a brilliant mind and she seems to be committed to saving humanity from destruction – by any means necessary. John, who becomes leader of the Spartans, is shown as flawed and vulnerable. He’s not the biggest, fastest or strongest Spartan, but he has deeper qualities that make him the natural leader. Then we have the AI, Cortana, who turns out to be a very human piece of software. And Captain Jacob Keyes, the pipe-smoking officer who does what Admiral Horatio Nelson in another war said we should all do – our “duty”.I would recommend this novel to anyone who enjoys science fiction or action and adventure stuff. I understand that this is not the first Halo novel to be written but it is some kind of prequel, so I’m wondering which way to go next. I will definitely read more Halo novels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sacul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 24, 2023",
                "reviewTitle": "Must read if Fan or not of Halo",
                "reviewText": "I've played every Halo Game so far, saw all Movies and TV Shows and now got interested into the Books.And Damn that was a good decision.The narative is great. It gives you a much better insight on the Spartans and the Project behind them.For anyone interested in the Lore of Halo, don't be afraid to read it.The pacing is great, story is great.I'm sincerely in Love and will read all the other Books.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}