{
    "remaining_requests": 1672,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trust-Pulitzer-Prize-Winner-Hernan/dp/0593420322",
    "body": {
        "name": "Trust (Pulitzer Prize Winner)",
        "price": "$11.83",
        "originalPrice": "",
        "rawPrice": 11.83,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trust-Pulitzer-Prize-Winner-Hernan/dp/0593420322",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91F6NVlGGjL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Hernan Diaz",
            "link": "https://www.amazon.com/Hernan-Diaz/e/B00U9P6ROO/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 23414,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 19 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Publishing Group (May 2, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593420322"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593420324"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.11 x 1.08 x 7.99 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#298 in Books (See Top 100 in Books) #5 in Biographical Fiction (Books) #22 in Family Life Fiction (Books) #69 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 23,414 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/acb95b68-d487-44b0-b469-63b03819a1da.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b371c269-a23b-4e47-83b7-db7bb25bf38f.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/320553c5-a689-41de-afe9-fa7a35207a23.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f258f821-ae4d-4546-8a72-3a21acf3c0e3.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/64e50ff1-ff7c-4d4c-a4bf-d38d3f32808e.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "robin friedman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENBSJOBQIUYW5UK3ESTAF7ECSGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T86DZVDJBZTR?ASIN=0593420322",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Storytelling On Wall Street",
                "reviewText": "Herman Diaz's 2023 Pulitzer Prize winning novel \"Trust\" absorbed me from beginning to end. For several days, I was captivated -- couldn't wait to get to it. This is a rarity for me. \"Trust\" is largely set in the financial district of New York City in the years surrounding the Great Depression.Here is a bare-bones summary of the story. The main character is a financier and trader, Andrew Bevel, the latest, and last, of a line of traders in his family. The reclusive Bevel amasses a large fortune during the 1920s and also manages to make money during the early stages of the Depression. Bevel's wife, Mildred, is the daughter of another New York State family with wealth and with intellectual interests. While Bevel concentrates on making his fortune, Mildred promotes educational, artistic, and cultural endeavors, particularly the development of 20th Century classical music. When Mildred dies in a Swiss sanatorium, in the 1930s, Bevel carries on but is somewhat less successful than in the days with his wife. After Bevel's death and lengthy wrangling over his estate, his palatial New York City home is turned into a museum.As is pointed out through \"Trust\", American literature has many works about New York City, the wealthy classes, the financial markets, and the nature of capitalism. This novel brings to it subject a strong sense of perspectivism. Bevel's story is told in four voices by four individuals, each with their own distinct voice and background. Each story has commonalities, but each is also different in terms of what happened and in terms of human relationships. The reader is left to think through the stories to come to an understanding of events and people. Showing and considering different points of view is integral to the humanities, whether history, literature, or philosophy, and to this novel. \"Trust\" considers city life, capitalism and greed, the arts, marriage, the relationship between imagination and realism, and more within its complex structure. It is challenging and mostly effective.Each of the four storytellers are fascinating both as writers and as themselves. The first, Harold Vanner, was a minor novelist of the day who wrote a heavily fictionalized novella about the Bevels titled \"Bonds\". It was fascinating to get hints about Vanner through the book and to read his account. The second part, \"My Life\" was written by Andrew Bevel himself, with help, and tells his story from his perspective and to rebut Vanner's book.The third and longest story is \"A Memoir, Remembered\" by Ida Partenza. She tells her tale from the standpoint of a 70 year old successful author. Partenza had been raised in poverty in Brooklyn by her father, an anarchist. At the age of 23, Bevel had hired her to help write his Autobiography. Partenza discusses her life with her father, how she came to be hired by Bevel, and how she became fascinated by the writing project and shaped it to her own as well as to Bevel's ends. The final section of the book, \"Futures\" consists of diary entries by Midred during her time in the Swiss sanatorium just before her death. Midred has a different perspective on the story and on her relationship with Bevel than do the other three storytellers.The reader will be encouraged to think about the world of financial trusts and about whom to trust among the four narrators, with their differing aims and perspectives. In his \"Phaedrus\", Plato has Socrates say that the written word can be revealing but also narrowing in its fixity.With the many earlier literary antecedents to Diaz's novel, I was reminded most of \"Martin Dressler: The Tale of an American Dreamer\" by Steven Millhauser which won the 1997 Pulitzer Prize for fiction. Martin Dressler is an American entrepreneur who, unlike Bevel was born to modest means. Dressler reaches the American dream of riches in New York City by founding a series of hotels before his businesses and his personal life come crashing down on his head. The story is a mix of realism and surrealism which captured something of the themes and locations of \"Trust\" in its own way. Unfortunately \"Martin Dressler\" has fallen into neglect. It deserves to be read both in it own right and as another voice on the themes of \"Trust\".\"Trust\" is a challenging, provocative novel about an aspect of the American dream and the American experience.Robin Friedman",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "caryl sitter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJDROTAR2TGIFQSUTLRS5C5ZYNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E21DN4L3DUXD?ASIN=0593420322",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Gilded Age wealth. mystical mathematics and odd characters.",
                "reviewText": "I was raised in New York City not too long after the GreatDepression. I could walk the streets of the ultra-rich, live with parents who made it to mid- middle-class, went to college with idealists and bohemians, enjoyed the museums and libraries, and knew people whose personalities struck me as odd. I learned about the Depression from people who lived through it and never recovered. I loved learning about it all. I found this book fascinating and strongly recommend it to those fascinated with the wonderful tv shows and movies that feature these subjects. It should also particularly interest those with mathematical inclinations plus mystical properties.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPU5YELBVUKG64WSI2DM762MOGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GKYJ53X5IIH1?ASIN=0593420322",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Must be committed",
                "reviewText": "Trust is an exceptional story within a story, within a story. Well written and so deserving of the praise. But, you have to push through parts to get to the best parts. The book highlights the challenges of being a woman, an immigrant and a working poor person at a time when the American dream was reserved for European men of renowned families…with a twist at the end. I loved all the financial analysis of the times when the stock market was unregulated and it was truly the Wild West of finance. The financial crisis of 2008 was very similar to the bust of 1929 and the care and research done to explain the similarities is so appreciated at a time when we still struggle with these concepts. Well done.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "anapurna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAKLVGZG5BDR7V33MHNYLJ7S4OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SZU6NBJOTS1U?ASIN=0593420322",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2023",
                "reviewTitle": "3.0 out of 5 stars Too Many Cooks Spoil the Broth",
                "reviewText": "'Trust' by Diaz was long listed for the Booker Prize in 2022. It is a serious fictional work about capitalism, money and one of the richest and greatest stock traders/manipulators of all time. The first third of the novel is written by a fictional writer (not the author) in pretty straightforward narrative form and the writing is impeccable and quite inventive. We learn a great deal about the investor- Benjamin Rask, his family, his trades, his peculiar and idiosyncratic detached lifestyle, and his marrying a woman who also shares some of his quirks, if not particular strong feelings for him. Then the 'novel within the novel' ends and a brief autobiography by Mr. Rask (named Brevel in the book) commences. The writing here is rather listless, and little is added to the first part of the work. As this section concludes, a longer- in fact the longest section of the entire novel takes place, written by the young female secretary of Mr. Brevel in his later years. Frankly, I found this long section to be tired and uninspired, and it appears Hernan Diaz created this long section as a counterpoint to the capitalist system as we know it in the U.S. The secretary's father is a staunch communist and so it is ironic that the secretary is working for the biggest 'capitalist pig' on the planet. The secretary becomes the moral force of the work, and her opinions take on greater urgency as the work progresses. Or at least that is the intended hope of the author, as I read it. \"Trust\" then concludes with some journal entries written by the wife of Mr. Brevel. Honestly, I could have done without the four section vehicle of the work. It did no favors in showing me the 'truth' of who Mr. Brevel/Rask really was. Perhaps Mr. Diaz, who is a fine writer, felt that he could not write this novel in a traditionally narrative form and utilized the technique of multiple forms to showcase his work. As I read the later sections I asked myself the following questions. Why not include the secretary (and bring her in earlier than after Mrs. Brevel's death) in the original chapters of the original work? Perhaps the diaries of Mrs. Brevel could also have been incorporated as well, without resorting to the four separate narratives. I believe the book is important and has much to contribute to the novels about early 20th century capitalism in this country, so it is still a compelling read. Yet, I wonder how much more enjoyable it would have been if it had stuck to one narrative, instead of running on four tracks at once.",
                "reviewVotes": "109 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regis C Stirling",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBUAZ3YJKWIHQTX43LDND7XLZXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TUO7EVHIKTB0?ASIN=0593420322",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Book club book",
                "reviewText": "It was a hard read and I am still not sure I understand everything. Our meeting is soon. I hope that helps.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morley Brown",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "GOOD READ",
                "reviewText": "GOOD READ",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 29, 2023",
                "reviewTitle": "Compra en formato Kindle",
                "reviewText": "Me gustó mucho el libro",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank Bullit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 12, 2024",
                "reviewTitle": "Alternativo",
                "reviewText": "Sorprende il lettore con lo stile di scrittura alternativo, mai visto prima una cosa così. Tanta inventiva, argomento attuale, bella storia, conclusione stupenda.Voto 10",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maud ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 27, 2024",
                "reviewTitle": "America' s wealth : how it all started.",
                "reviewText": "The different meanings of TRUST : financiers build trusts and to do so they need to trust people and to be trusted.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig Hall",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 15, 2024",
                "reviewTitle": "More than one truth",
                "reviewText": "Whilst this novel is set against the backdrop of the financial markets of the early 20th century, it is really about differing views of truth and self justification. There are 4 versions of the ‘same’ story - one definitely fictionalised and the other versions are from different perspectives - the main character, his biographer and his wife. It opens up ideas of how truth can evolve over time to make us feel better about ourselves.I notice a few reviewers complain there is a publishing error in their Kindle version and that the authors notes are still there. These reviewers missed the fact that this is intentional - and the fact the second book is unfinished becomes clear in the third book. It is much to big an issue to get by the many editors if it were a fault.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}