{
    "remaining_requests": 1430,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Quantum-Love-Story-Novel-ebook/dp/B0C4FKZ8QN",
    "body": {
        "name": "A Quantum Love Story: A Novel",
        "price": "$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Quantum-Love-Story-Novel-ebook/dp/B0C4FKZ8QN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71J2l-J3uHL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mike Chen",
            "link": "https://www.amazon.com/Mike-Chen/e/B07DV37WM8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 27,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A cozy sci-fi novel from the New York Times bestselling author of Star Wars: BrotherhoodThe only thing harder than finding someone in a time loop is losing them.Grieving her best friend's recent death, neuroscientist Mariana Pineda’s ready to give up everything to start anew. Even her career—after one last week consulting at a top secret particle accelerator.Except the strangest thing happens: a man stops her…and claims they've met before. Carter Cho knows who she is, why she's mourning, why she's there. And he needs Mariana to remember everything he’s saying.Because time is about to loop.In a flash of energy, it’s Monday morning. Again. Together, Mariana and Carter enter an inevitable life, four days at a time, over and over, without permanence except for what they share.But just as they figure out this new life, everything changes. Because Carter's memories of the time loop are slowly disappearing. And their only chance at happiness is breaking out of the loop—forever.“This unusual and satisfying near-future time-travel adventure fires on all cylinders.” —Publishers WeeklyAlso by Mike Chen:HERE AND NOW AND THENA BEGINNING AT THE ENDWE COULD BE HEROESLIGHT YEARS FROM HOMEVAMPIRE WEEKEND Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C4FKZ8QN"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ MIRA (January 30, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 30, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1010 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 364 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#64,686 in Kindle Store (See Top 100 in Kindle Store) #58 in Humorous Science Fiction (Kindle Store) #198 in Humorous Science Fiction (Books) #199 in Time Travel Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 27 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Here and Now and Then A Beginning at the End We Could Be Heroes Light Years from Home Vampire Weekend A Quantum Love Story Enter worlds of warped time and space with more sci-fi reads from Mike Chen He’ll go anywhere and any when to save his daughter Four survivors come together as the country rebuilds in the aftermath of a devastating pandemic. An extraordinary and emotional adventure about unlikely friends and the power of choosing who you want to be. Every family has issues. Most can’t blame them on extraterrestrials. Being a vampire is far from glamorous…but it can be pretty punk rock. The only thing harder than finding someone in a time loop is losing them.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/3b7fcb5b-8a4b-451d-a623-d37d02936846.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/02fbe469-2c18-4ef8-9a2d-95b67cf4be8b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fbcfefb0-f264-46b0-a525-a49f0c368233.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f1b616e8-f705-4c81-b329-df152d9a50ee.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/99c02897-102c-45f2-8973-7807c56e38ce.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/98c66bdc-4327-42b4-ac6b-48075c058fb3.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cf13fe36-4eb8-4264-a8a1-16a1b523675e.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6c8cf727-d332-4b93-bd80-df2995ec6f6a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bcc518eb-434f-4a26-a00e-a6343ae32c58.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8034a7ac-8c5d-445b-b685-78e4ea49bf8a.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Fifi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4PXXYB4YPROU63LXHRV2KRNOAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUSGCQFKPB1FY?ASIN=B0C4FKZ8QN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Love a book about time, and then add romance!",
                "reviewText": "Carter has been stuck in a time loop that ends with an explosion, literally. He’s gone through it six times and knows exactly what will happen each time. This time, Carter decides to deviate, which causes him to accidentally bump into a gal called Mariana. And he realizes where she’s going is near where the explosion will happen and he wonders if there’s a connection.Mariana has been going through the motions ever since her stepsister Shay went missing(presumed dead) 3 months ago and is ready to resign from her job. She decided to give it four more days, especially when her group of scientists are invited to go see The Hawke Accelerator, the place where Shay wanted to work. Where she meets Carter who seems to know her and is trying to convince her she’s in a time loop by putting her in the exact spot he was to help her remember. She remembers and now they have to work together to figure out how to get out of this time loop.That was a very long summary 😂 I love books that deal with time, and add romance to it, even better!I really enjoyed this book! It did have a little bit too much scientific jargon for me, but I really enjoyed the story and these two people just trying soooo hard to get out of this time loop. And then the adventures they go on just to take a break and live! The relationship they build over time and the romance is so sweet and also bittersweet. The way the story progresses, you’re basically stuck in this time loop too just wondering if we will ever get out, and you think they got it, when suddenly the time loop starts over and there’s just so many layers to get to the point that would solve it that I understand how Carter would feel down sometimes and want to give up.Carter Cho made me think of Remy from Ratatouille 😂 His love for food and how he’s so offended by Mariana’s reaction to food and how he teaches her to savor the moment, and enjoy it, sustenance versus like a shake, what flavors do you taste or smell, etc. He is seriously just so adorkable and endearing and I just loved Carter so so much!Mariana was more of the type A personality, but she also was going through grief after losing her closest friend and sister three months ago. She changed so much through this story. She allowed herself to live, to actually look at Carter differently especially after Shay always gave her a hard time of not giving guys a chance and being too picky for her own good, she started to savor moments like Carter, and I loved just seeing how her relationship with Carter changed.And that ending! I love bittersweet endings and this one was just perfect for me 👌🏻 Heartbreaking and yet a happy ending!If you enjoy books that involve time, and romance, then check this one out!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen's LibraryKaren's Library",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLSMQWBCMAAKOKZIIORED5ZYLOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK54FJSPNV7P5?ASIN=B0C4FKZ8QN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Such a satisfying read!",
                "reviewText": "I’m a fan of Mike Chen’s and this is the 5th book I’ve read of his. I prefer his sci-fi books and usually end up loving those. This book… IS definitely one of those!In a near future, Carter and Mariana find themselves stuck in a four day time-loop where they are living the same four days over and over again. Think Groundhog’s Day but with science. But there are major surprises along the way that make this story so unique and completely different from the classic GHD storyline.Carter and Mariana are the only ones who can remember what happened during each of the previous time loops so they work to try to figure out how to stop the loops, and fall in love with each other a little more each loop.Chen has done it once again by bringing in such amazing loving characters, you have to stay just to see how their story ends.And the food! If you’re a foodie, read this book! If you love science, read this book. If you love futuristic science fiction, read this book. If you love time travel, read this book. If you love romance, read this book!I love futuristic Sci-Fi, science, and time travel. When the science goes over my head, yes, I glaze over, but I still love it!!This book was such a satisfying read for me and I’ll be raving about it for some time!*Thanks so much to Mira Books and NetGalley for the gifted eGalley!*",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61UuOYXvHPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "NeetaNeeta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWHWPOPDPQTLWWALKBYFA3JP6WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HM3CU42ZHDUZ?ASIN=B0C4FKZ8QN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Cozy scifi with a hint of romance",
                "reviewText": "𝘊𝘰𝘻𝘺 𝘚𝘤𝘪-𝘍𝘪 • 𝘛𝘪𝘮𝘦 𝘓𝘰𝘰𝘱 • 𝘚𝘛𝘌𝘔 𝘙𝘰𝘮𝘢𝘯𝘤𝘦 • 𝘈𝘐𝘕𝘦𝘢𝘳 𝘍𝘶𝘵𝘶𝘳𝘦 • 𝘊𝘰𝘯𝘵𝘦𝘮𝘱𝘰𝘳𝘢𝘳𝘺 𝘍𝘪𝘤𝘵𝘪𝘰𝘯 • 𝘎𝘢𝘴𝘵𝘳𝘰𝘯𝘰𝘮𝘪𝘤𝘗𝘶𝘣 𝘋𝘢𝘵𝘦: 30 𝘑𝘢𝘯𝘶𝘢𝘳𝘺 2024I think of this as cozy sci-fi more than romance as the love story was secondary to the time loop plot. “Cozy sci-fi” applies because of the budding romance/sparks, personal introspection, endearing pets, and food/cooking elements. I loved when Carter and Mariana were working together, splurging on new cuisines, jetting cross continents, and plotting new paths forward, and I would have loved to see more of that storyline develop in a future Epilogue or bonus chapter(s).Synopsis:Mariana is a neuroscientist working at a startup that has discovered a way to relive the past by imprinting vivid memories into the brain’s permanent record. Carter is a foodie with Michelin chef aspirations and a photographic memory. His day job: lab tech at a particle accelerator, where an inevitable accident is about to occur.When Carter and then Mariana get stuck in the cross-hairs, they find themselves stuck in an infinite time loop, cursed to repeat the 4 days leading up to the explosion that renders the entire facility a pile of rubble. As they try to figure out what went wrong and how to correct it, they will learn more about themselves and each other.Small gripe: the science aspects were confusing as can be the case with paradox of time loops. I found that if I thought too hard I had questions I couldn’t resolve re: how it all worked.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81N1dgg7J2L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}