{
    "remaining_requests": 1367,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Seventh-Dimension-Young-Adult-Fantasy-ebook/dp/B009R8Q1WC",
    "body": {
        "name": "Seventh Dimension - The Door: A Young Adult Fantasy (Seventh Dimension Series Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Seventh-Dimension-Young-Adult-Fantasy-ebook/dp/B009R8Q1WC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91c6dqrGCfL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lorilyn Roberts",
            "link": "https://www.amazon.com/Lorilyn-Roberts/e/B002K8S2Y6/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 439,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Religion & Spirituality",
                "link": "https://www.amazon.com/Religion-Spirituality-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158280011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B009R8Q1WC"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Rear Guard Publishing, Inc.; 2nd edition (December 19, 2013)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ December 19, 2013"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3564 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 242 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0989142604"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,319 Free in Kindle Store (See Top 100 in Kindle Store) #7 in Christian Futuristic Fiction #22 in Christian Fantasy (Kindle Store) #27 in Religious Science Fiction & Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 439 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Much-Afraid, Seventh Dimension Lowly , Seventh Dimension Cherios, Seventh Dimension Baruch, Seventh Dimension",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/856412d8-38f5-441f-be85-127f7651635f.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/80b32a66-5753-43e6-9f17-3599069654c5.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/1a566549-2b37-42f5-9b18-5aa4b0551433.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/ed5325b5-ce4c-45ce-a3f7-f63cdd22829c.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "CHRISTIAN FANTASY SERIES BASED ON BIBLICAL PRINCIPLES! AGES TEN AND UP TIME IS AN ILLUSION UNTIL GOD'S APPOINTED TIME. “Long ago, a magical king was born in a kingdom where animals talked and intellect sparred with spirituality. It was a time when truth transcended culture, forgiveness won battles, and love conquered a young girl’s heart.” But lest I get ahead of myself, let me start from the beginning—which happened a long, long, long time ago. So long ago, I barely remember the beginning of my journey to the Seventh Dimension.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/c4d4a74d-ac30-4a60-9bce-5a9bbc6791ee.__CR3,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/856412d8-38f5-441f-be85-127f7651635f.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/80b32a66-5753-43e6-9f17-3599069654c5.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/1a566549-2b37-42f5-9b18-5aa4b0551433.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/ed5325b5-ce4c-45ce-a3f7-f63cdd22829c.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/c4d4a74d-ac30-4a60-9bce-5a9bbc6791ee.__CR3,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GlendaGlenda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFULM6JOIPP3M6GVGTMG66D6KB6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D5JU4TF64IGF?ASIN=B009R8Q1WC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2016",
                "reviewTitle": "5.0 out of 5 stars Unexpectedly Strange and Fantastic At The Same Time!",
                "reviewText": "In an author's note, the author shares the intended audience for this book... the Debut of the Seventh Dimension series... For every child who struggles with doubt, for every kid who has been bullied, for every teen who comes from a broken home, and for every young adult who longs to be understood— this book is for you.Personally, I think that about covers all of us, don't you? At least at one time or another, especially as teens, we have been one of those children she wants to reach... For many, who will know who they are, I'll recommend this to you as a \"must read!\"Shale Snyder was an unhappy girl--unhappy at home, at school, and now she'd had a curse placed on her after she had fallen, holding a friend's dog, and it had been killed. Two years later, Judd still hated her and was harassing her, the latest by sneaking up to her in the halls of school, touching her, and then moving away quickly so nobody noticed other than Shale who, at first, wasn't sure who was doing this--though she had a good guess...Now she felt like her only friend was her Diary, always opening with Dear DOG... (And although she spelled His name backwards in case anybody ever read it, God listened to her thoughts as she wrote to Him...)It was on the day that she'd found an old book she always loved, The Donkey and the King, that she found a straight pin that her mother must have lost, and started carrying it with her... that led to her becoming frustrated and angrily using that pin on the back of Judd, her enemy, who had once again been playing games!As often happens, though, she was the one who got in trouble!But it had started when one of her teachers had accused her in class of plagiarizing her paper on as you like it! By that time she was so upset that when Judd started again, she turned, followed him and stuck that pin deep into his back!It got much worse, she had been suspended, her parents didn't support her, and her best friend's parents told her she couldn't be her friend anymore!That was the day that Much Afraid came... She had barked outside her door long enough until Shale followed him, on and on, but then her foot caught in a hole and she fell. When she woke up, she heard a lady talking...Shale had crossed a portal and wound up in a beautiful garden where she found animals--that could talk! She realized that they seemed to be the animals that were in her favorite book when she was a child, and wondered if she was dreaming.But she was here now, so she started talking to the donkey and discovered that, indeed, his name was Baruch! They told her she was in the King's garden and they roamed around for awhile, talking more, until...The Crows Came!And they were afraid and left the Garden...until they came to another garden that Baruch recognized when he had been led to meet the King...They went on...always searching...meeting dangers...until they found themselves in Jerusalem...and discovered that Shale's father had his home there, although he was not there at the time...But Shale longed to find the King and, one day, they saw him in the distance... And listened while Christ, after his time in the wilderness, was tempted...Roberts has intertwined the events of Christ's life so skillfully that you find that you are walking in Shale's footsteps, seeing everything new as she was... It's magical, fantastical, and so very, very, memorable... and this is only the first book in the series! I'm excited about the book, a young adult story that is bound to attract young readers through the age of 99... We are all looking to find the King and in this journey into a fantasy set in Jerusalem, you may indeed find Him...I must add this to my personal favorites for 2016...and it just might be at the top! Get this book as a gift for your teens...and read it also! It's beautifully written, and beautifully inspired. I think you'll agree with me if you decide to meet Baruch and have him help you through the journey. Highly, highly recommended. And see my blog for unexpected happenings while writing this review...GABixlerReviews",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51hdjM0-hLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Steiner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRIHVEZ6C3LFSF2WCG6MKOOHZVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROEAB5HASI7UV?ASIN=B009R8Q1WC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2013",
                "reviewTitle": "4.0 out of 5 stars Seventh Dimension--the Door",
                "reviewText": "Note: I received this book as a free Kindle download on Amazon.com\"Seventh Dimension--The Door\" is a YA fantasy involving 3 different realities. On earth, Shale Snyder is a bullied, misunderstood young girl who sometimes makes very poor choices. She stumbles into The Garden where she meets some talking animals--a donkey and a rabbit. In the Seventh Dimension she is transported to ancient Jerusalem around the time of Jesus Christ. For most of the book, Shale is in the Seventh Dimension. What is the Seventh Dimension? The book explains that in the last couple of chapters, and I don't think I'll say the answer now so it is not spoiled for the reader.Some of The Players:*Shale Snyder--confused, angry girl who has been bullied*Judd and Chumana--neighbors who hate and pick on Shale. Judd also appears in the Seventh Dimension under a different guise.*Rachel--Shale's best friend on earth*Much-Afraid--cute dog, the first animal to talk to Shale*Baruch--a donkey that loves to eat apples and allows Shale to ride him*Cherios--a white garden bunny who keeps herself fastidiously clean*Daniel--befriends Shale in The Seventh Dimension*Lowly--a little pigSurprising things keep happening to Shale. The book deals with the subject of bullying. Demons who are called Underlings are compared to bullies. Bitterness, anger and the need to forgive others are additional topics the book addresses. Shale's growth in the book is dependent on her responses to The King. She is often reminded to not let anyone steal her joy. Shale witnesses several Biblical events that impact her greatly. Will Shale be a Daughter of the King?A favorite quote: \"After months of worry that he would be turned into bacon, Lowly made a surprise announcement, 'The king loves me, even a lowly pig like me.'\"The author, Lorilyn Roberts does a faithful job of weaving Biblical truths into the story. She also quotes from Shakespeare, refers to Anne Frank's diary, and includes other literary references. I hope to see more from her in the future. One problem spot--the fruit that Eve ate in the Garden of Eden is referred to more than once as an apple. The Bible does not specify that it was an apple, and I was a little sad to see that perpetuated in this book. However, that is one small detail, and the book is still well worth reading.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cu's Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE2CE2EV3VTZDN2LHDP2O3TBGCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XG57MAX8B6EN?ASIN=B009R8Q1WC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2018",
                "reviewTitle": "5.0 out of 5 stars An Amazing Story with an Amazing Message",
                "reviewText": "***My copy of this book was not purchased on Amazon***The Door is the first book by Lorilyn Roberts I'd had the pleasure of reading. And it was really long overdue really. Fans of Christian Fiction are going to love this book. A modern-day girl, Shale, is transported back to the time when Jesus of Nazareth walked the Earth. In the few years she spends stuck in this time, she not only learns more about those around her, but she learns more about herself as well.This book is beautifully written, and descriptive enough that the reader sees and feels everything going on. I found no errors in this book. Though, the fact that not Shale, nor Daniel, who are both from our time, don't know the King is Jesus bothered me. I can almost let Shale get away with it, but even Atheists know who Jesus is and what the Bible says he did. The fact that Daniel has no idea bothered more than a little bit. Daniel is a Jew, and while the Jews don't claim Jesus as their Messiah, they know the things he was said to have done. So Daniel being a devout Jew and not knowing who Jesus was bothered me.The Door has many life lessons that most young people are either not taught these days or ignore, but they are needed to know. It also teaches Christians young and old that their God is forgiving, if they only seek to be forgiven. I would absolutely recommend this book to anyone of any spiritual path. This book is a great story for all people.All in all, this book was a great read and I wish I had the others in the series to finish the story.I give this book 5 of 5 paws and hope Ms. Roberts continues to teach her God's teachings to those young and old.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Orith Cunningham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 8, 2015",
                "reviewTitle": "Three Stars",
                "reviewText": "Yes, don't forget to read The King of these books",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yun",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 9, 2015",
                "reviewTitle": "Das geht mal gar nicht ...",
                "reviewText": "Die Charaktere sind zwar gut und auch die Story im Hinblick auf den Fantasyteil ist in Ordnung. Aber dieses Buch hat die Prämisse, Jugendliche an das Christentum heranzuführen. Dabei hetzt es allerdings gegen den Islam und stellt das Judentum als verbohrt dar. Für mich ist es deshalb kein gutes Buch für Jugendliche, da die Toleranz anderen Religionen gegenüber absolut fehlt und hier Engstirnigkeit geprädigt wird, ja, Meinungen werden einem geradezu aufgedrückt und andere Religionen diffamiert. Wo bleibt da die Religionsfreiheit? Muss man in der heutigen Zeit anderen Religionen wirklich noch mit solchen Vorurteilen begegnen?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 21, 2016",
                "reviewTitle": "Captivating",
                "reviewText": "This story is bitter-sweet. Initially there is a sense of hopelessness and darkness, but then Shale enters the 7th dimension and slowly becomes transformed with who and what she finds there. An endearing book for all ages",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yvonne Lee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2017",
                "reviewTitle": "It was Okay.",
                "reviewText": "I loved the Christian message in the book. It was woven into the story beautifully. I didn't feel it was being pushed down my neck. In fact some of the scriptures used by the author really spoke to me.That said, I found the story a little weird, and at times annoyingly disjointed. Nevertheless, I continued reading to the end. I guess that says something about the captivating quality of the story...even if weird. But that's only my opinion.I found myself comparing it to Alice in Wonderland, but with a Christian message. I hated Alice in Wonderland!The way the story ended was good. Took me by surprise, I like that.If you like Alice in Wonderland, you'll like this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}