{
    "remaining_requests": 1372,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Disturbance-Hard-Science-Fiction-ebook/dp/B09YCBBDHF",
    "body": {
        "name": "The Disturbance: Hard Science Fiction",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Disturbance-Hard-Science-Fiction-ebook/dp/B09YCBBDHF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61X9mwc-EkL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brandon Q. Morris",
            "link": "https://www.amazon.com/Brandon-Q-Morris/e/B01N7UFRX4/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1361,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09YCBBDHF"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Hard-SF.com (April 30, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 30, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1028 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 402 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#37,090 in Kindle Store (See Top 100 in Kindle Store) #133 in Space Exploration Science Fiction eBooks #160 in Hard Science Fiction (Kindle Store) #310 in Hard Science Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,361 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKXWP6ZPLDMLE2EBFB76R44Y2QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFO8MWTC5S0JS?ASIN=B09YCBBDHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Patience",
                "reviewText": "Well, I’m glad I stuck through the first part of the book. It was an incredibly dry read until the action started. I gave the author 5 stars because I understand why it had to be so dry until the action started so I’d know the technicalities behind what was going on, yet… was it necessary? I’m a forever student, so learning new things on top of what I already understand isn’t a bad thing. I do caution others who are looking into reading this, that this is indeed hard science fiction. Also, if you don’t have a fundamental grasp on some physics and/or space science this book might not be for you. I’m hoping the second book has more adventure and less subtle, manipulative elements of teaching.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie - Long Island, NY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHN7Y3PRCETVAZWUKWSM2OHXZTVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34I3OA2DQHJ38?ASIN=B09YCBBDHF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Looking forward to book #2",
                "reviewText": "I’d started then stopped & this time I finally finished the book & was more than happy I did.Truly looking forward to the next installment.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Talisker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESAAKRQIQNFCRLIF63V3W3MJODQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C49EDQNPKXJ8?ASIN=B09YCBBDHF",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2022",
                "reviewTitle": "3.0 out of 5 stars Good science not so good writing",
                "reviewText": "It is a bit much. The main idea about an observatory at the sun focal point is well known and described in various papers and I was sorry the author didn’t explore that more. The idea of the true nature of the crew was good and well thought out. The physics expressed by Newton was good, although needlessly repetitive. The DFD is an experimental concept that in no way can produce the levels of thrust stated thanks to the physics that define just how much inertial mass for propellant you would need. The missions Ops team, CapCom, MOM, et al, was very thin and does those who are in that role a disservice. They are not so dumb, and are in fact , very involved in the physics and details of a mission at a very a deep level. The idea of AlphaOmega was not interesting and even weird. It could have been deleted without changing the story in any important way. The date 2079 was way off…add 200 years; my mortgage will be paid off at about then. The so call quantum aspects…entanglement on steroids, let’s say - was over the top. Ok, fiction again, I get it. But it ultimately reads like one of those pop gee- wiz science books so prevalent these days. Prove it, even the smallest aspect of it, and I might believe it. Lastly, the writing needs work; perhaps a good editor that can straighten out the entanglement - no pun intended - of the dialogue and plot. I could barely finish the novel; by the end it had become predictable and boring.The author has written a wide range of sci-fi novels and I truly admire him for all that. He has a vision and dedication. But to make it work with the public at large, he needs to focus his vision. He should re-read Arthur C Clark. A contemporary writer he might want to read might be Adrian Tchaikovsky.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTQIB2N2IKU7PYNLCTHVZH4HW7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R381EYQLH0VLSQ?ASIN=B09YCBBDHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2022",
                "reviewTitle": "5.0 out of 5 stars Not a who-dun-it but a why-dun-it!",
                "reviewText": "The 4 astronauts are part if a mission in 2094 to use a series of probes to create a fractional lens that will allow them to look back in time. Ilan Chatterbe, is behind the mission and Christine and he plan on going back to the origin -the big bang - to see how the universe was created.Meanwhile in 2079, mission control are following the mission. However what happens on the mission in 2094 also appears to be happening in 2079!While the others Anton, Benjamin, and David are out checking the probes, Christine is analyzing the data. However, when they return, there appears to have been an explosion that killed Christine and damaged the ship and her capsule. It is suspected that Christine may have attempted to kill herself and destroy the ship -but why?At the same time, cause and effect appears to be running in the wrong direction every now and then - for example doors open before the button is pressed to tell them to...Also the structure of Christine's capsule appears to breaking down.What is going on?This intriguing tale combines suspense, intrigue, double crosses, kidnaps and other peculiar happenings with an overzealous leader, and quantum entanglement of an unusual order.....All is revealed as the story slowly unfolds......A highly entertaining novel that is an enjoyable and thought provoking read.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Oshoway",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIPGZK5CSWY2HFQ4EHK6K4GLRZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ2GLDJ56OT8A?ASIN=B09YCBBDHF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Very good hard-sf!",
                "reviewText": "I enjoyed the story very much. I began to suspect a disturbance in the quantum field of the story when Eric replaced David and everyone's memories were a little scrambled. I would give five stars for the story line on the Shepherd, but only 3.5 to 4 stars for the story line with Rachel and Mission Control, hence the 4 stars overall. I feel the Shepherd could stand on its own with a little more development of the characters, whereas the Rachel part of the story didn't really add much to advancing the story. Except for the suspicions aroused by the date discrepancies. I love true hard-sf. I will definitely add this author to my list of favorites. I really, really want to know what Christine discovered at the end (or is it beginning?) of the cosmos.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIS5VLB5EQ5LFBNB6JPMCPCAF4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CUCV47B2KPFN?ASIN=B09YCBBDHF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2022",
                "reviewTitle": "5.0 out of 5 stars Would be an incredible movie if done right",
                "reviewText": "I enjoyed this book but I had a hard time painting the pictures in my mind of what the characters looked like physically, details of the different spacecrafts, etc. I feel a hollywood production of it would really bring the authors vision to life and build the suspense it needs for a story like this to create the affect I could tell the author was going for. I think the problem was trying to wrap my head around how an SGL would work to see back in time. Anyway, I just bought the second one and excited to see where this goes!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2023",
                "reviewTitle": "Great hard SF!",
                "reviewText": "For those like me, who enjoy hard science fiction, this author always delivers. I loved his space exploration/First contact Solar system series and Ice moon series in particular. This new serie is a good one as well as is the recent Lost Moon.Most SF are basically earth regular themes like battles, wars and the evil Alien monsters, soap opera in Space vs on Earth...Hard SF is very hard to find as the author needs extensive knowledge of science which is definitely the case for M. Morris.I find that his newer books include more AI and in a very realistic non sensationalistic way. I love the way it makes me think about what is consciousness and how it expands beyond humans.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 5, 2023",
                "reviewTitle": "Bestenfalls al dente",
                "reviewText": "Leichter Lesestoff für Zwischendurch und nicht wirklich das angepriesene \"hard scifi\". Das liegt hauptsächlich daran, dass der Author eine Idee in dieses Buch pressen wollte, die eigentlich gar nichts zur eigentlichen Erzählung beiträgt. Vermutlich sollte das Problem von Langzeitweltraumreisen und deren Auswirkung auf Organismen dadurch behandelt werden. Der gewählte Ansatz wird dabei jedoch direkt, also durch den Author, zu einem Problem aus Sicht der Charaktere deklariert ohne wirklich die Substanz (und da gäbe es tatsächlich inhaltliches Potential) zu behandeln. Die \"Auflösungen\" werden dadurch zum Klischee und hinterlassen einen mit wenig Neuem nach dem Ende des Buchs. Und ds ist schade, da der titelgebende und auch als Idee ansprechende \"Protagonist\" vollkommen in den Hintergrund gedrängt wird.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Avid Reader ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 28, 2022",
                "reviewTitle": "Delivers The Goods",
                "reviewText": "There are a number of intriguing twists in this well told adventure. A bunch of intrepid explorers, delving into the mysteries of time and space, are faced with a set of problems - solving them is, of course, crucial to the success of their mission. The reader is in for a number of surprises as the plot progresses. There are some heart-stopping moments for the crew (and the reader, of course!) so be prepared for the adrenalin rushes.I particularly enjoyed the final section. In a way, it was surplus to requirements.... but SO appreciated! I'm reading number 2 soon. Can't wait!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janeway",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 16, 2022",
                "reviewTitle": "Boring",
                "reviewText": "Extremely boring, very weak plot, no character devopment, no reason whatsoever to read this book but the fact that I had paid for it. I wanted at least to know how it ended but it was not worth it. Hard science fiction should not mean throwing in a lot of science bubble and nothing else",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "monte8888",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 29, 2022",
                "reviewTitle": "always immensely enjoyable",
                "reviewText": "Brandon Q Morris is always the consummate author, filing his novels with complex questions and complex characters trying to answer them. great value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}