{
    "remaining_requests": 1465,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Supergirl-Woman-Tomorrow-Tom-King/dp/1779515685",
    "body": {
        "name": "Supergirl: Woman of Tomorrow",
        "price": "$11.79",
        "originalPrice": "$19.99",
        "rawPrice": 11.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Supergirl-Woman-Tomorrow-Tom-King/dp/1779515685",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51xhEIXmsOL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51cwDcBo-QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d0Y6TLDCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51edM7C7y6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mUfki i-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fC1a0PwqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51O6bDVJOHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tom King",
            "link": "https://www.amazon.com/Tom-King/e/B0066F3XJS/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 1220,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ DC Comics (July 26, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 224 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1779515685"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1779515681"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 13.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.61 x 0.39 x 10.16 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,413 in Books (See Top 100 in Books) #9 in DC Comics & Graphic Novels #11 in Science Fiction Graphic Novels (Books) #47 in Superhero Comics & Graphic Novels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 1,220 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott Slemmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNNA6PWC526R4M5PMM72PZCPX2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14F30ULCKFDSQ?ASIN=1779515685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2023",
                "reviewTitle": "5.0 out of 5 stars King and Evely's masterwork",
                "reviewText": "Our plot: It's Supergirl's 21st birthday, and she's decided to get drunk to celebrate! But it's really hard to get Kryptonians drunk, so she takes her super-dog Krypto and travels to a far distant planet under a red sun so she can lose most of her powers. And once Kara's gotten there and gotten thoroughly sloshed, she gets roped into helping out a young alien teenager named Ruthye Marye Knoll. Ruthye's father was murdered by a creep called Krem of the Yellow Hills, and she wants revenge more than anything in the galaxy. But a teenaged girl can't kill a killer without help, and she wants the Maid of Might's aid in her quest.Well, that's nice, kid, but Supergirl isn't really for hire, and she doesn't kill. So she's gonna hop into her spaceship and fly back to somewhere with a yellow sun and -- and that's when Krem of the Yellow Hills shows up and shoots Supergirl with a few arrows. Luckily, even mostly unpowered Kryptonians are tough enough to survive arrows -- but Krypto isn't so tough against Krem's poisoned arrows -- and even worse, Krem steals Supergirl's spaceship, too! Well, Kara still isn't willing to kill Krem, but she does need to find out what poison he used so someone can brew up an antidote for Krypto, so she decides to accompany Ruthye to help apprehend the killer.What follows is a lengthy mission across space as Supergirl and Ruthye pursue Krem. That includes traveling coach on a space freighter filled with sometimes hostile aliens. That includes visiting a small town of little blue aliens who like to appear friendly and are very definitely not friendly. That includes learning of the monstrous depravity and cruelty visited upon dozens of innocent worlds by Krem's new allies in Barbond's Brigands. That includes getting stranded on a planet orbiting a deadly green Kryptonite sun. It includes outrunning certain death. It includes battling an alien armada. It includes watching a friend die. It includes making the ultimate decision: life or death.Tom King's comics tend to focus on the dark inner psyches of his characters, usually B-level or lower superheroes, like the Vision, Mister Miracle, and the Omega Men. We get less of that here, partly because angsty Supergirl has been done plenty of times and it's no longer interesting, and partly because Ruthye is actually the lead character of the book. Ruthye narrates the tale, Ruthye is in the story from the beginning to the end, Ruthye is the one who learns and grows as a character.Not that Supergirl is a bit player in the tale. She does a lot to smooth the path they take -- Kryptonian strength, flight, speed, and other powers help a lot, of course. She also has a nose for justice that leads her to work to punish wrongdoers, as well as a compassionate heart that helps her to comfort those who are suffering. She has her moments of darkness, too, particularly when she remembers the slow, painful death of Argo City, the final remnant of Krypton, the few survivors dying of Kryptonite radiation, no matter what is done to help.King also admits that the plot is a loose homage to Charles Portis' Western novel \"True Grit,\" which may give you a hint of some -- but definitely not all -- of the story beats.Bilquis Evely's art is worth admiring, too. It's very much unlike anything we've seen in comics in ages. The art style has its roots in the late 19th century and early 20th, particularly in Art Nouveau, and character design pulls its influences from the past, too. Though Supergirl's costume is the classic and traditional superhero outfit, most of the rest of the characters draw inspiration from the art of Charles Dana Gibson, particularly his glamorous Gibson Girls. That means everyone is beautiful (okay, everyone except the alien monsters), the eyes are riveting, and the hair is flowing and luxurious.That turn-of-the-century design aesthetic dominates the rest of the book, too. Many costumes are ornate and old-fashioned, like they came out of illustrations for an old planetary romance. Some of the spaceships have sails. The alien town of Maypole looks like one of the American small towns in Ray Bradbury stories.Evely's gorgeous artwork probably gets more attention than King's storytelling -- but that's okay, because her art is genuinely amazing, and probably did more to sell the book to many readers than anything else.Should you read it? Heck, yeah, kids, get yourself a copy and get busy reading.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yadira",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6A6FDUOBB6FPUSZ6QPDDVM2YKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5IKNYGXD98SN?ASIN=1779515685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Profound storytelling",
                "reviewText": "I’ll be honest. When I started the book I was enthralled by Evely’s artwork. But I thought I was going to be reading a book about more punches and kicks, so I was a bit bored with the start of the book. I am so glad I kept going allowing the storytelling, depicted amazingly by Evely, to change it around for me. As I moved from book to book I started seeing the story in another way - that the journey to your ‘goal’ can be as important as accomplishing that goal. It was after reading the 3rd or 4th account of Krem of the Yellow Hills‘ actions, and seeing how the aftermath of each people’s experience were measured against Kara herself and her own story - BOOM! light bulb went off and I was left feeling stupid for not appreciating the nuance of it. It was a beautiful and bittersweet story. I loved Ruthye’s honesty and straightforwardness. I cried during Kara’s backstory, thinking about my own daughter, asking myself ‘if she were to ever be thrown into equally harsh experiences, could she persevere like her’. I hope she would. I loved the dynamic between Ruthye and Kara, especially at the very end. When put into perspective against the entire journey I actually had a good laugh.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "@gr8tcmxbookthts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPSJ32HRHS6W3FU4TZZNPQGQV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R253ORQDSYVRQ1?ASIN=1779515685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Supergirl at her vulnerable best.",
                "reviewText": "One of the best Supergirl stories out there. Tom king is at top form on this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Enrique",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYXNZI36DLXKHZKSCLIP2IW2Z4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VAYL581AJS9F?ASIN=1779515685",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars fresh new take. loved it!",
                "reviewText": "There was a great message here. I felt at times that there was a lot of side story telling and lost me a couple of times but I see the reason for it as I got to the end. Overall a great read and I am excited with future books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jean Carlo Lopez Oshima",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEFGM7ZWP7XWWWLNZD5XBPFVSZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB6SEP7Z5PACF?ASIN=1779515685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2023",
                "reviewTitle": "5.0 out of 5 stars A Heartfelt and Grand Adventure in SPAAAAAAAACE!",
                "reviewText": "I love Tom King as a writer, we should just start calling him King Tom at this point. His Supergirl story is just...everything. You don't need to be a fan following some plot that is 4+ years long to get drawn in and love the story. Anyone could pick it up and just sail away into this amazing cosmic adventure. Grand, heartfelt, profound and just a fun romp through a universe teeming with wonder, danger and adventure. Bilquis Everly's artwork is just the stuff of magic, carefully considered lines and museum level panels that take your breath away. Matheus Lopes' coloring is nothing to sneeze at either, he provides the emotional spectrum in color to punctuate every scene. This Absolutely deserves the Absolute edition treatment.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy Stevens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECL2QNQ35UTOYX35D43ZCASFWMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPUIOV204YVSW?ASIN=1779515685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Epic from the first to last page.",
                "reviewText": "This is a beautiful drawn and written story that showcases Supergirl in a way you haven’t seen before. Perfect book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Crystal Cheung",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP6GOBLFC4Q6GHLMIQUNGKIX6PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R363BPISQDV2UH?ASIN=1779515685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent artwork and characterisations!",
                "reviewText": "Finally I see a writer who treats Supergirl as an independent and unique character, not the mere cousin of someone else. This Supergirl has a huge capability to understand pain and suffering and losses, though she might be slightly arrogant and impatient sometimes to her enemies. This is what makes her an unique and interesting character with depth.Many many kudos to the artist for not sexualising Kara, portraying her in a respectful manner, and her highly detailed drawings! I also admire all colour palettes used in this run that brings out the cosmic, dreamy vibre. As a lover of visual art, I would say the artwork is pure perfection.Overall, this is an excellent run and the reading experience is a very pleasant one! This is definitely my favourite run!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J McNee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPUMQ7S2QNIGJEP4RM37EH3MC7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LE2LHLX622SO?ASIN=1779515685",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Kara Steps Things Up",
                "reviewText": "Supergirl meets \"True Grit\". One of the better DC collected runs in ages.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "christopher cordick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2024",
                "reviewTitle": "Fantastic story and beautiful art",
                "reviewText": "Great read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CARLOS G SERNA CAMPOS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 11, 2024",
                "reviewTitle": "bueno",
                "reviewText": "me gusto mucho mdfuckers",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guilherme",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 3, 2023",
                "reviewTitle": "A humanidade da Supergirl \"em prova\"!",
                "reviewText": "Quando Kara Zor-El completa 21 anos, ela parte para um planeta que orbita um sol vermelho. Sem os benefícios que a radiação amarela traz para seu corpo, ela pode ter experiências com aquilo que não está acostumada.Ocorre que sua história se cruzará com uma recente tragédia de onde se encontra. Uma jovem garota chamada Ruthye está na busca de um mercenário que possa lhe trazer uma sensação de justiça após encontrar seu pai assassinado em suas terras, e será aí que a Supergirl passará a agir. A trama é narrada através das lembranças da menina, sendo que somos levados a acreditar que a Garota de Aço presenciará e fará coisas que não estamos acostumados a ver.Posso estar enganado, mas a sensação da leitura me fez pensar numa trama de “(re)amadurecimento”, colocando a todo momento a personagem a prova do que poderia fazê-la subverter os seus princípios, porém, demonstrando que sua compaixão é muito maior do que os outros esperam.Ao longo dos oito capítulos, Ruthye e Kara vivenciarão experiências que colocam a prova a “humanidade” da Supergirl, veremos facetas nunca antes imaginadas e como Tom King consegue trabalhar com estes conceitos de uma forma que entregue uma história ao seu estilo (sem perder a essência que estamos acostumados com a personagem).O que merece destaque é a arte da Bilquis Evely (com cores de Mat Lopes)! Ela apresentou um trabalho belíssimo com enquadramentos que refletem a força que o roteiro tem, assim como vimos em “O Sonhar” recentemente.Esta publicação foi indicada ao Prêmio Eisner 2022 na categoria Melhor Minissérie, demonstrando ser um bom material para quem quer ler algo da personagem sem a necessidade de conhecimento prévio.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "Another Tom King master class",
                "reviewText": "Tom King does it again! A wonderful character study of who Supegirl is as a character in a space western story. The art is also gorgeous",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 18, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "I love Tom King and his take on Supergirl make me love him even more",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.70",
                "sellerName": "A Squared W LLC",
                "sellerRating": "5"
            }
        ]
    }
}