{
    "remaining_requests": 1378,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ministry-Future-Novel/dp/B08K1YZBYN",
    "body": {
        "name": "The Ministry for the Future: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ministry-Future-Novel/dp/B08K1YZBYN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41EspGVHUmL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kim Stanley Robinson",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Kim+Stanley+Robinson&search-alias=audible"
        },
        "brand": "Kim Stanley Robinson&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8925,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From legendary science-fiction author Kim Stanley Robinson comes a remarkable vision of climate change over the coming decades. The Ministry for the Future is a masterpiece of the imagination, using fictional eyewitness accounts to tell the story of how climate change will affect us all. Its setting is not a desolate, post-apocalyptic world, but a future that is almost upon us - and in which we might just overcome the extraordinary challenges we face.It is a novel both immediate and impactful, desperate and hopeful in equal measure, and it is one of the most powerful and original books on climate change ever written.One of Barack Obama's Favorite Books of 2020\"If I could get policymakers, and citizens, everywhere to read just one book this year, it would be Kim Stanley Robinson’s The Ministry for the Future.\" (Ezra Klein)\"The best science fiction-nonfiction novel I’ve ever read.\" (Jonathan Lethem, Vanity Fair)\"A breathtaking look at the challenges that face our planet in all their sprawling magnitude and also in their intimate, individual moments of humanity.\" (Booklist, starred)Also by Kim Stanley Robinson:Red MoonNew York 21402312AuroraShaman Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16272"
            },
            {
                "name": "Hard Science Fiction",
                "link": "https://www.amazon.com/High-Tech-Science-Fiction-Books/b?ie=UTF8&node=16286"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "20 hours and 42 minutes"
            },
            {
                "name": "Author",
                "value": "Kim Stanley Robinson"
            },
            {
                "name": "Narrator",
                "value": "Jennifer Fitzgerald, Fajer Al-Kaisi, Ramon de Ocampo, Gary Bennett, Raphael Corkhill, Barrie Kreinik, Natasha Soudek, Nikki Massoud, Joniece Abbott Pratt, Inés del Castillo, Vikas Adam"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 06, 2020"
            },
            {
                "name": "Publisher",
                "value": "Orbit"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08K1YZBYN"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,282 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #33 in Hard Science Fiction (Audible Books & Originals) #73 in Post-Apocalyptic Science Fiction (Audible Books & Originals) #74 in Hard Science Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL6TWUCGTOR5GZELQHXNVW4QCYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34652D00SHJ4C?ASIN=B08K1YZBYN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2020",
                "reviewTitle": "5.0 out of 5 stars We can fix this",
                "reviewText": "60 Billion dollars a year is a lot of money.That simple point is at the heart of my thoughts on The Ministry for the Future, a new work by Kim Stanley Robinson, which I've just finished. Before the review, some caveats. I have read several of the author's novels - 2312, New York 2140, Red Moon. I like them all. This one is not bad. I bought it. You should buy it, too.That said: The Ministry for the Future is different. It is a collection of vignettes and reports from a variety of sources and perspectives (even the sun gets to have its say) amounting to a loose, mostly unconnected set of storylines with lightweight characterizations and a plot with less of a traditional narrative flow. It throws out economic theories, technical solutions, and proposed political changes to address the challenge of climate change, but none in great detail. Another critic said the book still 'oddly works' despite these flaws and I have to agree. I think it works because it is a broad survey of a more hopeful future in which humanity actually addresses and turns the corner on climate change and all of these little reports collectively add up to a positive outcome. That's encouraging and that is what makes it fun to read. Most fiction on this topic is decidedly dystopian. This book is optimistic. Refreshing, to say the least.It's still odd because a typical novel has more structure, more compelling characters (that you want to root for), and their journey and struggles, dangers and risks get more attention - like the author's other books. I came away wondering why one character was such a focus, their story not all that inspiring or sympathetic. Whereas another far more interesting character doing more risky and morally ambiguous activities is barely mentioned, their shadowy side only briefly mentioned. This second character is truly interesting, but we learn very little about them.The organizational geek in me keeps coming back to that $60 billion a year. That's the notional budget of the Ministry for the Future, a global agency set up to represent the future humans that don't yet have a voice but will be impacted by climate change. It's a fascinating idea, but this notional ministry gets very little substantive treatment. It has an office in Zurich. An Irish woman as director whose chief skill seems to be glaring at people she doesn't agree with. There are a dozen directors (biblical metaphor?) who engage in periodic brainstorming sessions. There are brief vignettes of various initiatives overt and otherwise, but not so much substantive discussion of what, how, and why it works. And that's a shame because we probably need such an agency in the future. But what is described on these pages is what I would think of as a small nonprofit with a venture capital portfolio. It's not an agency with a $60B budget.Consider what $60 billion will get you. The US Department of Energy has 14,000 employees, 95,000 contractors, 80+ labs around the country and does cutting edge research and development (okay, nuclear weapons, but also advanced solar, etc.). It also supports an academic research network - and it does all of that for about half of our notional Ministry for the Future's budget. I know a certain Fortune 500 IT technology company with over 500,000 employees around the world and the revenue supporting this vast organization is less than $45B and that includes a margin. The U.S. Air Force has a budget of roughly $160B a year (a lot more, of course, than the Ministry for the Future), but that gets you 5,000+ high tech aircraft, 320,000+ uniformed airmen(people?) and a civilian workforce of 320,000 - and of course the power of enough advanced high-tech weaponry to dominate any adversary anywhere in the world (for at least a few more years anyway). You get the point, I hope. You can do a lot with $60 billion a year.A Ministry for the Future with a budget of $60 billion is going to be a busy place. Whoever is in charge is going to be spending a lot of their time overseeing the different divisions that spend this much money, visiting key projects, negotiating major agreements. They are not just going to be holding a monthly staff meeting to brainstorm ideas or hosting the occasional conference. All of the vignettes and initiatives mentioned are projects funded by the Ministry for the Future, but the dots aren't quite connected. Running such an agency is going to be a 24x7 job and that person is going to have to know the details, all of them. And with public funding, there will be a governing body that requires endless reporting and likely has different stakeholders with different agendas and conflicts, not to mention audits. You don't get that much public money for free. Maybe that's too much to envision and manage in a novel, but, again, we just might need a Ministry for the Future - in the near future. I wanted to see the idea developed more, much less the seen and unseen struggles of what it tries to accomplish and how it works with all of the other state and non-state actors that make-up the global community.I'll close with my recommendation to buy the book. Despite some gaps and flaws and my very minor criticism, it 'oddly works', as they say. It adds up to a positive narrative of how we might possibly deal with global warming, which is all too rare these days and that, by itself, is worth the price of admission. Some of the projects to save the Earth are inspiring. If it gets you thinking that we can collectively solve this problem (global warming), then that by itself qualifies this book as a masterpiece, despite its flaws. So, go buy it. Start imaging a future that is more optimistic and less dystopian.",
                "reviewVotes": "306 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GGreene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVR3NP2JCP3M6MPIPLHPR2VEUHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PLJ3ANVX82WU?ASIN=B08K1YZBYN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 24, 2021",
                "reviewTitle": "4.0 out of 5 stars I’m a Kim Stanley Robinson fan―NOT his best work, tho (as always) interesting & worth a read.",
                "reviewText": "From the Mars Trilogy thru his recent focus on global climate change, KSR has been an important SciFi voice on “the future”. What he says is always worth thinking about―even if just to sharpen one’s own, perhaps contrasting, views. That’s true of this book, too, & while it’s in some ways rather a disappointing read, it makes a lasting impression. In KSR’s best work, his ideas on an “ideal” society are built seamlessly into the fictional “world” & the narrative shows how the techno-economic structure actually works―a sort of proof-of-concept. This book, however, lacks any real narrative structure―really, just a sequence of vignettes, each describing some aspect of a strategy to deal w/ climate change. A lot of nice ideas―but the main ones don’t really seem to fit together as a coherent decarbonization story. Two key ideas are: (1) blockchain-based platforms for ”carbon coin”, a digital currency to incentivize decarbonization, & “YourLock”, a distributed social-finance system; & (2) E.O. Wilson’s beautiful “Half-Earth” vision of a rewilded planet with human populations concentrated in mega-cities (where health, education, & infrastructure can be efficiently scaled), & everywhere else a nature-preserve/carbon-sink. But vast blockchain networks & megacities would be hugely energy-intensive. Where’s this energy coming from? KSR’s idea is, more or less, (3): pave over the planet w/ low energy-density renewables like solar & wind. But “eco-modernists” like Bill Gates & other energy realists convincingly argue that this won’t be sufficient to support a technologically-advanced society. Therefore ideas (1) & (2) don’t work, either. So, when greenhouse gas concentrations actually begin to decline at the end of the book, it’s a kind of phony deus ex machina happy ending. Unedifying, especially since KSR is usually so good at scientifically well-founded world-building. There’s an alternative to KSR’s idea (3) that would support (1) & (2). Following the eco-modernists, supplement renewables w/ higher energy-density technologies. For example, leverage emerging “small modular reactor” nuclear technology (mass-produced, always-on, & safe) for local electrification of homes, offices, & production facilities (minimizing dependence on a grid & battery storage). Then use some of this power to make hydrogen & other “electrofuels” (“drop-in” replacements for petroleum liquids in current jet & automotive engines & fuel distribution networks) for transportation. So, given KSR’s clear intent to propose strategies to prevent catastrophic climate change, why not consider these high energy-density technologies? Perhaps because KSR views “degrowth” as an ideal―a steady-state, no-change economy in static balance w/ nature. But is this really desirable? Ignoring climate externalities for the moment, economic growth is a good thing. It generates resources to improve material living standards, expand healthcare & education, & broaden access to leisure & cultural activities―all benefits that people everywhere value. Indeed, eco-modernists emphasize that, as a matter of social justice, the living standards of the rest of the world must rise to match those of the richest 10%. This requires economic growth. In fact, as shown by UN & World Bank data, 50 years of “neoliberal” globalization (scornfully dismissed by KSR) have disproportionately benefited the world’s poorer regions, lifting (literally!) billions out of extreme poverty. With this in mind, “degrowth” is justified ONLY if necessary to achieve global decarbonization. This is just not the case. Vaclav Smil’s analyses of historical “energy transitions” show how markets (i.e., people participating in social exchange) respond to increases in energy costs (due to resource constraints, shifts in trade patterns, government policies, &c) by evolving new sources & technologies. So, rather than a static “degrowth” equilibrium, it’s surely better to change incentives (via carbon taxes, green technology subsidies, even KSR’s “carbon coin”, &c) & transition to “clean growth” featuring nuclear electrification & electrofuels, as well as renewables. As in past energy transitions, living-standard gains can continue, even accelerate, as these innovations drive new industries & opportunities. Finally, & very important, a growing economy will make it easier to compensate (via social transfers & re-skilling) those who are initially disadvantaged by decarbonization policies.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AJC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "So real. Essential for “knowing thy enemy”",
                "reviewText": "Not a feel good story. The hard truths we ignore as humans today are brilliantly manifested in thos cautionary tale. Hindsight is 20:20 - Kim Stanley provides this for the reader. You will be inspired and angry.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JenniferB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 10, 2022",
                "reviewTitle": "Lectura indispensable",
                "reviewText": "De pesadilla inicial a posibles soluciones al cambio climático que, aunque las presenta en forma de ficción, podrían ser viables de verdad. Ojalá todos los políticos y banqueros leyeran este libro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve Betts",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 26, 2024",
                "reviewTitle": "Amazing well thought out near future",
                "reviewText": "I liked the many scenarios written in first person. These were interwoven into the main story line. When I started reading them I thought them strange, but as I got into the book came to enjoy them. The world will go through something like this if we are to survive climate change.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 5, 2023",
                "reviewTitle": "Hat super geklappt",
                "reviewText": "Meine Nichte ist von dem Buch sehr begeistert",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 16, 2023",
                "reviewTitle": "Un libro de posibilidades.",
                "reviewText": "Este libro trata sobre la crisis climática, es ficción, pero podría convertirse fácilmente en realidad, se cuenta a través de los ojos de muchos personajes a través de capítulos cortos que mantienen la historia en movimiento rápido y hacen que el libro sea difícil de dejar.Gran historia, bien contada, muy recomendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}