{
    "remaining_requests": 1462,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Authority-Novel-Southern-Reach-Trilogy-ebook/dp/B00GET18P2",
    "body": {
        "name": "Authority: A Novel (The Southern Reach Trilogy Book 2)",
        "price": "$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Authority-Novel-Southern-Reach-Trilogy-ebook/dp/B00GET18P2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Os0a0gLBL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jeff VanderMeer",
            "link": "https://www.amazon.com/Jeff-VanderMeer/e/B000APJW4U/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 9535,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "After thirty years, the only human engagement with Area X—a seemingly malevolent landscape surrounded by an invisible border and mysteriously wiped clean of all signs of civilization—has been a series of expeditions overseen by a government agency so secret it has almost been forgotten: the Southern Reach. Following the tumultuous twelfth expedition chronicled in Annihilation, the agency is in complete disarray. John Rodrigues (aka \"Control\") is the Southern Reach's newly appointed head. Working with a distrustful but desperate team, a series of frustrating interrogations, a cache of hidden notes, and hours of profoundly troubling video footage, Control begins to penetrate the secrets of Area X. But with each discovery he must confront disturbing truths about himself and the agency he's pledged to serve. In Authority, the second volume of Jeff VanderMeer's Southern Reach trilogy, Area X's most disturbing questions are answered . . . but the answers are far from reassuring. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00GET18P2"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ FSG Originals (May 6, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 6, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1250 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 353 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#35,422 in Kindle Store (See Top 100 in Kindle Store) #27 in Action & Adventure Literary Fiction #172 in Mystery, Thriller & Suspense Literary Fiction #346 in Exploration Science Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 9,535 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "B. Capossere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJIPQY4UD6ZS2ATZPPUSQYEVSQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T7RK4EHGAGNK?ASIN=B00GET18P2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2014",
                "reviewTitle": "5.0 out of 5 stars loved Annihilation love-loved Authority (at this rate, I may have to marry the third book in the trilogy),",
                "reviewText": "In Annihilation, Jeff VanderMeer’s first book in the SOUTHERN REACH trilogy, the reader got to travel along (via a first-person POV) with the twelfth exploratory expedition into Area X, a region of the U.S. that was mysteriously cut off from the rest of civilization several decades ago via a strange barrier that has only one entry/exit. None of the prior expeditions ended well, and neither does the twelfth, which discovers amidst the pristine wilderness (cleaned completely of any taint of prior human existence—no toxic metals, no pollution) an underground structure they eventually descend into. Have I mentioned the expedition does not end well?Authority, the second book in the series, picks up soon after the end of Annihilation. Our POV guide in that first book was the biologist (each of the four women were known solely by professional title) and in VanderMeer’s follow-up, she, along with the anthropologist and the surveyor, have somehow made their way unnoticed back into the world from Area X and had been picked up by the organization in charge of investigating the mystery—the Southern Reach. None of the three have any memory of how they got where they were found, or of what happened to the psychologist, laying one mystery atop another. Somebody has to figure out how these three women got out of Area X with nobody seeing them (despite the massive round-the-clock surveillance of the border—with cool lasers even!), what happened to the fourth, and oh yeah, what the hell is going on that a portion of our world is being wholly reshaped.Enter Control. Known as a “fixer” in the larger agency the Southern Reach sits within, Control (a childhood nickname he has taken to heart) is sent in as the new Director to clean things up and start getting usable information about Area X. He employs several methods to do so. One is a series of interviews with the biologist, finally given a name in this book. Two is going through the reports of the prior Director and of the previous expeditions. And three is getting hands-on in the Southern Reach organization—taking his own trip to the Area X entrance, seeing the lab and samples room, and meeting with the scientists. None of this is made easier by a demoralized staff, a resentful Assistant Director, and an interrogation subject that seems to have had her memory wiped. Or by the pressure of his boss (known only as the Voice) who is a tad bit demanding or his mother, a star agent in the agency who told poor Control this assignment was his “last chance” to prove himself.I don’t want to say much more about the plot because one, it should just be left for the reader to enjoy without even minor spoilers and two, much of what is revealed in Authority casts a whole new light upon the events of Annihilation, and lest anyone reading this has yet to read the first book, I don’t want to ruin that effect. So here endeth the synopsis.As for why I loved it—oh, so many reasons. First and foremost is the masterful sense of dread that utterly permeates the novel. At the core of the dread, of course, is Area X, akin to a virulent illness that struck an isolated area but which everyone fears might leak through the containment area. If it hasn’t already. That fear is what lends a taste of menace to every small detail regarding possible vectors. What about that potted plant in the old Director’s office? Why did the author just describe the front lawn—is there something I should see there? What about that smeared mosquito on the windshield, why bother with such a tiny detail? What is that strange smell that keeps cropping up; is it really just a cleaning liquid? Should the border guards really be eating those white rabbits? Why are birds mentioned so often? Should I pay more attention to that ant crawling on that woman’s neck? Why does that dead mosquito now have mold on it? What about the water stains on the ceiling tiles? Time and time again, a mundane detail of setting is lent a patina of horror merely due to context.Beyond what emanates from Area X’s existence, the secrets within secrets, the agency factions, the pressure exerted on Control by Voice, his mother, his family legacy within the agency, all add to the tension so that if the reader isn’t questioning whether some detail is a sign of Area X’s reach, he/she is worrying if some detail is a sign of active obstruction—why does the old Director’s cell phone keep showing up, who is the Voice really, where does that ladder go, are those stains on the carpet coffee or blood, why is it so hard to find the janitor, who is planting bugs, who is ransacking an office, why is the Assistant Director so actively hostile, why did the old Director hide her notes. And the list of questions goes on and on as the suspicion grows, until one wonders, like Control, if they are adding a weight of importance to inconsequential actions and sights. Is it just paranoia?And of course, the horror also grows thanks to some old-style actual horror moments—grotesque images, strange words written in strange places, a Blair Witch-like video record, swinging light bulbs, weird noises, flickering fluorescents, nightmares, breathing in the dark. And more.So creepy. Oh so creepy. Wonderfully, deliciously, constantly creepy.Beyond the atmosphere, I also loved the many resonances that echo throughout the novel. The white rabbits for instance, used in an experiment years ago and still popping up. Besides the way they add to the pervading dread, what a perfect animal choice. You can’t think “white rabbit” without thinking of Alice’s introduction to Wonderland—a world of the strange and macabre. Or (though I suppose this might be age-dependent) of Jefferson Airplane’s “White Rabbit”, with its pills and chessboard and mother and fungus and mouse, all of which make an appearance in Authority (and maybe too a white knight and red queen?). Or the aforementioned birds: the several bird sightings, the biologist calling herself “ghost bird”, Control thinking he’d “fly free above the Southern Reach, swooping down from some remote perch to manage things,” an albatross.Or as well, all the many, many references to failed communications: attempts that are incomplete or only half-understood, missed phone calls, scattered words overheard, files that are missing or incomplete, videos with gaps in them. The reader is faced with the same, not just through the character’s third person narrative but by the structure of the narrative as well, which moves back and forth in time, introduces the beginnings of conversations but skips over the ensuing dialogue. The reader again begins to feel like control: “That kind of self-control had made him look not just at the words but at the pauses between them . . . The ghost was right there, in the transcripts . . . moving through the text. Things that showed themselves in the empty spaces . . . the undercurrents and hidden references.” Soon one begins to wonder if Area X is not merely an environmental event but a linguistic/mental one, or perhaps this is a self-imposed plague: “he used the internet solely for research and admin. He believed a kind of fragmentation had crept into people’s minds in the modern era.” Language—its limits, its biases—played a large role in Annihilation and it does here as well. What does it mean, for instance, beyond those references, that characters in book one are known by their jobs, and here one is known as “Control”? Does it matter that it was a name he was given? Or that he now chooses to use it? Does it say something about him or only seem to (there are lots of references to masks as well—are names merely one kind?). What does it mean that the biologist gives herself a new name? Or that the Assistant Director says Control should call her “Patience” rather than her real name, Grace.I could go on; there are many such examples. But I won’t. Suffice to say an attentive reader will be greatly reward with this richly layered book.VanderMeer shows a nice insight into regular ole mortal issues as well, whether it be office politics, humanity’s tendency when faced with something inexplicable to try and “blast it to hell,” the inertia of organizations and the way they break down as the people within them seek their own agendas and/or fail to communicate, people’s contrary desires with regard to true wilderness: [they] want to be close to but not part of. They didn’t want the fearful unknown of a ‘pristine wilderness.’ They didn’t want a soulless artificial life, either.” How the trappings of science, with its white coats and sparkling glassware and “cathedral” of a lab and bespectacled actors, often presents an exclusively rational and perpetually moving forward image that hides the truth that it can be as much a superstition or faith fumbling in the darkness toward some sort of answers. And then of course, there is the age-old insight into family, the way family molds us into who we are, whether we run toward or away from them.The basic building blocks of the novel, as with the first book, are near-perfect: pace, characterization, structure, style, language (listen to the sound quality, for instance, of “the havoc of their passage). Plot-wise, those readers of book one desiring some answers will find many here. And most, if not all, the new mysteries set in place in Authority are resolved by the end, though of course leaving room for book three. Just as with Authority, I think this book could easily end as it does (though granted, many people might be ticked off it had).I loved Annihilation, as I said in our earlier review of it, but I love-loved Authority (at this rate, I may have to marry the third book in the trilogy), and with that final book coming in the fall, VanderMeer very well may end up with three titles on my Best of the Year list. A must-read.(first appeared on fantasyliterature.com)",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sneaky Burrito",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRC2S3IHH73QEVR4HTAS77MHNPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8SYSY4WUUJVE?ASIN=B00GET18P2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2017",
                "reviewTitle": "4.0 out of 5 stars overall quite nice, but not as compelling for me as book one",
                "reviewText": "I read the first volume in the Southern Reach trilogy (Annihilation) in record time (for me). Since I had also purchased this book, I dived right into it. There were parts that reminded me of the first book, and there were story connections, but this book wasn't quite as enthralling to me as was Annihilation.In Annihilation, we followed a single character (\"the biologist\") through Area X, a pristine wilderness separated from the rest of the country by a barrier with a nature we never really understand (perhaps because even people in the world of the story don't fully understand it, either). In this book, we focus on a different character, John (who insists on being called \"Control,\" which sounds rather silly, but later in the book he begins to question the choice of this nickname and what it implies about him and his mission). He has been sent to be the director of the Southern Reach area (basically an installation/organization that protects and defends the Area X border) after the previous director (who was a character in book one) has disappeared. He encounters a lot of hostilities from the assistant director (Grace) and a lot of odd characters among his new subordinates/coworkers. Although in fairness, you would have to be eccentric to accept a position at a place like Southern Reach and stay there for any length of time.My favorite parts of the book are when Control is gathering information. Whether that is watching videos from expeditions to Area X, or going through items and papers from the Director's office (which is now his office), or interviewing the biologist from the previous expedition, or taking a tour of the scientific research facilities and trying to make sense of all the weirdness -- these were the bits of the story I was most interested in. And when the story was heavy with those bits of information, I read with complete attention, often late at night, and didn't want to put the book down. Those parts carried me through the other parts, too, in a sense.But then, there were the other parts, when Control went home from work. Or flashbacks to his past (perhaps triggered by the fact that he spent some of his childhood in the area nearby). I just don't have the same level of interest in reading about getting drunk at bars, memories of past one-night stands, etc.The biologist in Annihilation had a lot of flashbacks, too. But they were more interesting to me. They gave the reader a sense of why someone would agree to go on what could very well be a suicide mission. The biologist was a flawed person and the flashbacks and personal thoughts helped us see her flaws, helped us understand her better. I never really felt the same connection with Control. He had a flaw that Grace confronts him with and that flaw has definitely shaped his career. So in a sense, some of the background information helps us explain how he got where he is. But, when he was in a position to take the job or not, it wasn't the same as the biologist deciding to go on the expedition. It might well have been a dead end, career-wise, but that's not the same as risking one's life. And thus, I just wasn't as interested in his past. I didn't find him as compelling.If these books are meant to be character studies, well, they certainly achieve that aim. Control is a complex character and he is sympathetic (and not just because he is the reader's proxy in an unfamiliar situation). You do get the sense that he wants to solve mysteries associated with Area X and Southern Reach, itself. And since you, as the reader, want those answers as well, you are rooting for him.I have some issues with Control's mother, as a character. She is some sort of secret agent who can't ever talk about her position but seems to be rather high up at a place called \"Central,\" which seems to have authority over Southern Reach facilities and personnel. She is able to pull strings to get Control the Director's position at Southern Reach. Or something. But she also goes out in the field on missions a lot, or something. It just seems to be inconsistent with the things I know (or think I know) about the way government agencies work. The director and higher-ups in the CIA don't go undercover. Those are desk/meeting types of jobs. And CIA officials, I would assume, don't appoint their children to important posts. I think there are laws against that.There were not necessarily a lot of answers in Annihilation. You get a few in Authority, but there are also new questions raised. I was satisfied with the balance here. There's still one book left (I'm already partway through it), after all.Random other notes: This is basically set in our world; Area X and its border are the only unnatural things. So not a lot of worldbuilding has to be done for outside the Southern Reach facility. The writing style is quite good. I never felt like I missed anything or had to go back and reread it, so I got through the book quickly. (I actually liked the writing style so much I put a bunch of Mr. Vandermeer's other books on my wish list, even though they stray a bit from my usual fare.) The mysteries of Area X and surrounding the biologist as well as the former director are compelling. At first I thought the side characters (scientists, etc.) were just strange, but you learn by the end of the book that they have reasons for being that way, and I ended up thinking their quirks were well done. So there is still a lot to like here. But it is also a different book from Annihilation. (On the other hand, I'm not sure a different expedition getting lost in Area X would have made a good sequel, so maybe this is where the series HAD to go.)In the end, I did enjoy this enough to immediately continue on to book 3.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blanca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 17, 2024",
                "reviewTitle": "Es una reimpresión de Amazon de mala calidad",
                "reviewText": "No es el original",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 11, 2019",
                "reviewTitle": "Para completar la trilogía",
                "reviewText": "El producto llegó en buen estado y tiene una portada muy bonita",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Monali",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 29, 2020",
                "reviewTitle": "Happy",
                "reviewText": "Good condition & great read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 12, 2018",
                "reviewTitle": "Doubles down on the Odd",
                "reviewText": "I started this immediately after finishing Annihilation and didn't put it down for nearly 50 pages. I don't really know how to explain how bizarrely addicting these books are. Authority is pretty different than Annihilation in setting but it never abandons the atmosphere of the universe it lives in and instead builds upon it without removing the mystery of it all.It's quite a bit more \"twisty\" than Annihilation and somehow even more \"odd\".Read every single one of these books in this series, the freshest series I've read in a long while.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pedro gapski",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 26, 2018",
                "reviewTitle": "Very interesting reading",
                "reviewText": "A nice plot, written with a refreshing style. The story is well planned, with a good mix of science fiction and human urges. A very entertaining book overall.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}