{
    "remaining_requests": 1667,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Snow-Crash-Neal-Stephenson-audiobook/dp/B00005NZJA",
    "body": {
        "name": "Snow Crash",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Snow-Crash-Neal-Stephenson-audiobook/dp/B00005NZJA",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51F-1GJA2ML.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Neal Stephenson",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Neal+Stephenson"
        },
        "brand": "Neal Stephenson",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 18199,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "FOR USE IN SCHOOLS AND LIBRARIES ONLY. Weaving contemporary imagery with Sumerian myths and virtual reality, this fast-paced novel of life in the near-future information age offers a hip vision of what's right around the corner in cyberspace. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "17 hours and 3 minutes"
            },
            {
                "name": "Author",
                "value": "Neal Stephenson"
            },
            {
                "name": "Narrator",
                "value": "Jonathan Davis"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 31, 2000"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00005NZJA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,264 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #27 in Hard Science Fiction (Audible Books & Originals) #50 in Hard Science Fiction (Books) #99 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David Mccowan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY7TCPYNJVUZEY4F4A3AJLMVG6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15RTBKD5BEZGP?ASIN=B00005NZJA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars TL;DR Read if you program and like Science Fiction.",
                "reviewText": "TL;DR Read if you program and like Science Fiction. Read if you like Cyber Punk. Read if you want to read a VR classic. Read if you are a Neal Stephenson fan.Yes, the book was written in 1992 and is not well regarded outside of Stephenson Fans but I think it is classic. I’ve read it multiple times. Reading it now in 2023 makes me want to go on several rants. I won’t.It is well-written, fast-paced. Mainstream Cyberpunk, but not Cliché.The world-building is top notch and while Stephenson gets some things he was written wrong about religion I understand how his research led him there. You see some of the beginnings of Stephenson’s blending of Science Fiction and historical fiction that he would do in Cryptonomicon, and what would later become his speculative fiction style.Insert rants about New Perspectives on Paul, Tongues, Catholic Mystics, Facebook now Meta, and National Debt here.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert M. Deatrick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELT4PUBFINYUGRR2YS3OMMPHZJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IM056KKYYC9U?ASIN=B00005NZJA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Second only to Crypto",
                "reviewText": "As original and foresightful as Gibson and easier to comprehend the science (fiction?).Took away a star for a plot oversight…he presents Enki as an historical protagonist of the human plight, suggesting that he wrote a “program” that would save us from the Ashera bio-virus, but previously offers an account of his bent to incest-pedo behavior.This is a huge red flag that Enki himself was infected with the bio-virus. Hence, his “program” (termed “me” in this book as well as in ancient written evidence), would’ve been the product of Asheric viral influence. This makes sense when observing the historic results of our species. Self-destruction is self-evident and self-replicating.He also misinterprets the underlying function of religion, generally and specifically, which is yet another Asheric mind control tool (weapon?), whether mono- or polytheistic. Again, self-destructive and divisive.From reading much of his works I am confident Stephenson is infinitely smarter than I am, so how could he miss this? Besides these minor flaws, the work is insightful, educational, and entertaining. Highly recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriel Claycamp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG73Y7QIZACCTWLMFZBEGS3X6LPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I06N71F5N4UL?ASIN=B00005NZJA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars One of the greatest books of all time",
                "reviewText": "An amazing story, that continues to be more and more real as days go on.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DMG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2E55XXUYYB4S25YBW4UEHL37SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R8F7IMCATRB8?ASIN=B00005NZJA",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2015",
                "reviewTitle": "3.0 out of 5 stars Engaging theme, initially interesting plot, bad ending.",
                "reviewText": "I will next read Neuromancer (get ready, Amazon) after I found myself strongly agreeing with Psychlist's review of Jan 3, '15. I felt that Snowcrash had a good theme, which to me was based on an extreme overextended analogy between Computer viruses, memes or mind viruses, and the old fashioned DNA/RNA kind. That is what speculative sci/fi is supposed to trade on anyway. But like most all the successful writers of future history, the author only extends popular and famous trends to their extreme ends. It kinda reminds me of novels about the 21st century, written at the same time as this book (1989-1992), in which the Soviet Union played a prominent role.The tech displayed in Snowcrash is dated now, as other reviewers observed. Action scenes are well-written and engaging. The book starts off like Hollywood, with the reader dropped into a crazy action scene in which some of the basic tenets of the book are laid out. The over-the-top action is self deprecating where it needs to be to maintain suspension of disbelief. The fist half of the book reads like a 'who-is-doing-it' thriller as the funky good guys learn more of what is going on and make contacts with the good honchos whose work they are inadvertently doing. Protagonist (yes, that is the family name of the main character) also gets to know the violent bad guys and their special powers as the first half of the story unfolds.Spoiler AlertThe mid section is dominated by discussions between Protagonist and a Watson-like archival program, called the Librarian, who informs Protagonist of the connection, down through history of between various viruses; starting with a space borne \"metavirus\" that seeds all life; going to an improbable theory that, in the beginning, human language tended to coalesce rather than fragment; turning to Sumerian myths and a putative Enki, who was a neurolinguistic hacker who wrote a mind blowing incantation that literally tore the fabric of his culture to pieces, causing Babel and the break up of humanity into competing tribes (something deemed good because unity was causing stagnation): then on to classical antiquity in which champions of the old unity battled those who liked the competing/warring states state of affairs; finally to the present in which the big bad guy has gotten his mitts on the Ancient Sumerian written viruses and is using them to reestablish a unified world of babbling fools under his power. He infects computers with advanced malware, and infects hackers directly with a bitmap that hits their optic nerves, because they have \"bits and bytes wired into their psyche\" after lifetimes of coding. The rest of us he can mumble the Sumerian verbal malware to and it goes right to our brain bios and scrambles our internal logic.Where is the Government of the United States of America in all this? It has apparently become a willing and minor accomplice to the big bad guy, and the US Navy is nowhere about when a flotilla of millions of his infected South and East Asian refugees (called 'refus\") are about to be dumped onto CA by him. The language used at first to describe this made me wonder if a bit of \"Camp of the Saints\" was coming at me, but given that Protagonist is black/Korean and the big bad guy is a Texan who goes by the name \"L. Bob,\" this was a false supposition. The author even throws in a scene in which a straw-man racist-bigot becomes sushi at the end of Protagonist's katana.L. Bob and the President of the US, who no one recognizes until he reminds them, are in the plot together, and are trying to disempower the good guys--the Mafia and a Hong Kong magnate (I assume Triad, for the power he wields) who just want a peaceful breakup of the country and world in \"franchulates,\" sovereign little territorial bits of turf. I forgot to diagram the plot as I read. This would have helped keep things in perspective.The book did end all too abruptly with L. Bob, and presumably the nondescript POTUS, dying on the LAX runway as their getaway jet is smashed by a good \"rat-thing,\" a dead dog, reanimated like RoboCop, and able crack the sound barrier when excited (here, fido, lets play your favorite, chase and catch the 9mm bullet). Our Protagonist had exited the book many pages earlier after thwarting a logic bomb attempt to fry the minds of the World's code writers. A tertiary character, the head of the good Mafia, though an old man, defeats L. Bob's best, glass knife wielding, henchman extraordinaire on the tarmac, and then the secondary character, a girl named \"Y.T.\" walks out of LAX to get a ride home with her mom in the last sentence. It just felt like an editor told the author that he had to end the novel before it passed 500 paperback pages. The novel could have used a summary chapter to explain how his future world was ordered, and just what was the 'good' outcome, the events leading up to it, we could anticipate, and a bit on how all the main characters lived happily ever after, I'm so old fashioned.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rico",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIKWQCKWUPOCSQ6A6HSKE37A4MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35PQ324HMN1KG?ASIN=B00005NZJA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Def if you’re a fan of D&D and Cyberpunk!",
                "reviewText": "Read it when I was young. Read again as I got older. Def wanted a physical copy. Very narrative and adventurous. A must read for the sci-fi lore fans! Many thanks!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucca Canizela De Camargo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 22, 2022",
                "reviewTitle": "Superb",
                "reviewText": "Espetacular novel!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rajeev Nair",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 5, 2024",
                "reviewTitle": "Book received in good condition",
                "reviewText": "Book received in good condition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Mighty Neiner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 24, 2024",
                "reviewTitle": "Extrem gute Qualität, unglaublich aktuell.",
                "reviewText": "Die Deluxe Version ist der Hammer, hochqualitativst und sehr schön zum Ansehen. Aber nicht nur zum Ansehen taugt der Schinken, der dieses Buch ist, nein! Auch lesen kann man jenes, und man wird nicht enttäuscht werden. 5/5",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacques De Wilde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 8, 2022",
                "reviewTitle": "Le classique pour comprendre le concept de métaverse",
                "reviewText": "C’est à parieur de ce roman d’anticipation que les GAFA et autres acteurs du numérique envisagent l’avenir. Pour autant, cet opus réserve des surprises bien différentes et, avouons-le, plus humaines et prometteuses. À lire en anglais si possible.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 11, 2021",
                "reviewTitle": "La nascita di metaverse e avatar",
                "reviewText": "È un libro storico che per primo introduce il concetto di metaverse (ora ripreso per realizzarlo davvero) e di avatar (già usato in un videogioco, come citato dall'autore, ma non sviluppato con le diverse implicazioni).Ha un andamento discontinuo alternando momenti di grande tensione (spesso inutili per lo svolgimento della linea narrativa, ma molto godibili), con momenti da pseudo-cultura (per altro documentata). Apre interessanti possibilità e riflessioni su metaverse, ma anche sullo sviluppo della società, che nei successivi 30 anni stiamo vedendo che si stanno indirizzando nelle direzioni che qui vengono esplorate nelle diverse implicazioni. Potrebbe ad alcuni sembrare troppo discontinuo, ma le occasioni di riflessione sono interessanti e molti meccanismi narrativi decisamente coinvolgenti.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}