{
    "remaining_requests": 1424,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Acceptance-Novel-Southern-Reach-Trilogy/dp/0374104115",
    "body": {
        "name": "Acceptance: A Novel (The Southern Reach Series, 3)",
        "price": "$11.28$11.28",
        "originalPrice": "",
        "rawPrice": 11.28,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Acceptance-Novel-Southern-Reach-Trilogy/dp/0374104115",
        "soldBy": {
            "sellerID": "A2R3KHREW2AKQK",
            "name": "WeSaveBooks",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2R3KHREW2AKQK&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Ve5YV7DnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Kl3CxdYFL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jeff VanderMeer",
            "link": "https://www.amazon.com/Jeff-VanderMeer/e/B000APJW4U/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "WeSaveBooks",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 7625,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “A satisfying conclusion to this captivating trilogy” ―Booklist“This trilogy is that rare thing--a set in which the whole is as great as the parts.” ―Publishers Weekly“I'm loving The Southern Reach trilogy by Jeff VanderMeer. Creepy and fascinating.” ―Stephen King on The Southern Reach Trilogy“Chilling.” ―Julie Bosman, New York Times on The Southern Reach Trilogy“VanderMeer masterfully conjures up an atmosphere of both metaphysical dread and visceral tension . . . Annihilation is a novel in which facts are undermined and doubt instilled at almost every turn. It's about science as a way of not only thinking but feeling, rather than science as a means of becoming certain about the world. . . . Ingenious.” ―Laura Miller, Salon on The Southern Reach Trilogy“A clear triumph for Vandermeer . . . a compelling, elegant, and existential story . . . .The solitary voice of its post-humanist narrator is both deeply flawed and deeply trustworthy--a difficult and excellent balance in a novel whose world is built seamlessly and whose symbols are rich and dark.” ―Lydia Millet, LA Times on The Southern Reach Trilogy“A book about an intelligent, deadly fungus makes for an enthralling read--trust us.” ―Tara Wanda Merrigan, GQ on The Southern Reach Trilogy“[A] strange, clever, off-putting, maddening, claustrophobic, occasionally beautiful, occasionally disturbing and altogether fantastic book . . . Annihilation is a book meant for gulping--for going in head-first and not coming up for air until you hit the back cover.” ―Jason Sheehan, NPR Books on The Southern Reach Trilogy“Successfully creepy, an old-style gothic horror novel set in a not-too-distant future. The best bits turn your mind inside out.” ―Sara Sklaroff, The Washington Post on The Southern Reach Trilogy“If J.J. Abrams-style by-the-numbers stories of shadowy organizations and science magic have let you down one too many times, then Annihilation will be more like a revelation. VanderMeer peels back the skin of the everyday, and gives you a glimpse of a world where science really is stretching the bounds of our knowledge--sometimes to the point where we can't ever be the same . . . [Annihilation] will make you believe in the power of science mysteries again.” ―Annalee Nevitz, io9 on The Southern Reach Trilogy“Fans of the Lost TV series . . . this one is for you.” ―Molly Driscoll, Christian Science Monitor on The Southern Reach Trilogy“What frightens you? According to many psychologists, our most widely shared phobia is the fear of falling. Jeff VanderMeer's novel Annihilation taps into that bottomless terror . . . VanderMeer ups the book's eeriness quotient with the smoothest of skill, the subtlest of grace. His prose makes the horrific beautiful.” ―Nisi Shawl, Seattle Times on The Southern Reach Trilogy“Much of the flora and fauna seem familiar, but that's what's so fascinating about the carnage that VanderMeer sets loose. He has created a science fiction story about a world much like our own.” ―John Domini, Miami Herald on The Southern Reach Trilogy“Annihilation feels akin to isolated sci-fi terrors of Alien . . . teases and terrifies and fascinates.” ―Kevin Nguyen, Grantland on The Southern Reach Trilogy“The plot moves quickly and has all the fantastic elements you'd ever want--biological contaminants, peculiar creatures, mysterious deaths--but it's the novel's unbearable dread that lingers with me days after I've finished it.” ―Justin Alvarez, The Paris Review on The Southern Reach Trilogy“Jeff VanderMeer ventures on to strange ground in this enigmatic story.” ―Alex Good, The Toronto Star on The Southern Reach Trilogy“[VanderMeer's] writing is courageously imaginative, fiercely unformulaic, and utterly immersive. You don't read Jeff VanderMeer, you experience him.” ―Paul Goat Allen, The Barnes & Noble Book Blog on The Southern Reach Trilogy“The first book in what may be a modern classic of post-apocalyptic sci-fi . . . .Annihilation's story struck me hard and pulled me in fast. I haven't had a reading experience this creepy, intense, and edge-of-your-seat since H.P. Lovecraft's At the Mountains of Madness.” ―Paul Schwartz, UR Chicago on The Southern Reach Trilogy“Annihilation is smart, tense and utterly engrossing.” ―Mike Reynolds, Bookgasm on The Southern Reach Trilogy“Master of the literary headtrip Jeff VanderMeeer's Annihilation is simply unlike anything you've read before. It gnaws away at your nerves with a slow-building sense of dread and impending madness.” ―Marc Savlov, Kirkus Reviews on The Southern Reach Trilogy“VanderMeer both defies and challenges genre boundaries, forcing readers to forget about traditional tropes and clichés and simply enjoy the storytelling.” ―John DeNardo, Kirkus \"Best Bets for Speculative Fiction Books, February 2014 on The Southern Reach Trilogy“A gripping fantasy thriller, Annihilation is thoroughly suspenseful.” ―Heather Paulson, Booklist on The Southern Reach Trilogy“After their high-risk expedition disintegrates, it's every scientist for herself in this wonderfully creepy blend of horror and science fiction. . . . Speculative fiction at its most transfixing.” ―Kirkus (Starred Review) on The Southern Reach Trilogy“A gripping fantasy thriller, Annihilation is thoroughly suspenseful. In a manner similar to H. G. Wells' in The Island of Dr. Moreau (1896), VanderMeer weaves together an otherworldly tale of the supernatural and the half-human. Delightfully, this page-turner is the first in a trilogy.” ―Heather Paulson, ALA Booklist (Starred Review) on The Southern Reach Trilogy“Brilliant . . . ever-more-terrifying, yet ever-more-transcendent . . . .Using evocative descriptions of the biologist's outer and inner worlds, masterful psychological insight, and intellectual observations both profound and disturbing--calling Lovecraft to mind and Borges--VanderMeer unfolds a tale as satisfying as it is richly imagined.” ―Publishers Weekly on The Southern Reach Trilogy“In much of Jeff VanderMeer's work, a kind of radiance lies beating beneath the surface of the words. Here in Annihilation, it shines through with warm blazing incandescence. This is one of a grand writer's finest and most dazzling books.” ―Peter Straub, author of Lost Boy, Lost Girl on The Southern Reach Trilogy“One of those books where it all comes together--the story and the prose and the ideas, all braided into a triple helix that gives rise to something vibrant and alive. Something that grows, word-by-word, into powerful, tangled vines that creep into your mind and take hold of it. Annihilation is brilliant and atmospheric, a novel that has the force of myth.” ―Charles Yu, author of How to Live in a Science Fictional Universe on The Southern Reach Trilogy“A dazzling book . . . haunted and haunting.” ―Kelly Link, author of Magic for Beginners on The Southern Reach Trilogy“A tense and chilling psychological thriller about an unraveling expedition and the strangeness within us. A little Kubrick, a lot Lovecraft, the novel builds with an unbearable tension and a claustrophobic dread that linger long afterward. I loved it.” ―Lauren Beukes, author of The Shining Girls on The Southern Reach Trilogy“The great thing about Annihilation is the strange, elusive, and paranoid world that it creates. . . .I can't wait for the next one.” ―Brian Evenson, author of Last Days on The Southern Reach Trilogy“It's been a long time since a book filled me with this kind of palpable, wondrous disquiet, a feeling that started on the first page and that I'm not sure I've yet shaken.” ―Matt Bell, author of In the House upon the Dirt between the Lake and the Woods on The Southern Reach Trilogy“This swift surreal suspense novel reads as if Verne or Wellsian adventurers exploring a mysterious island had warped through into a Kafkaesque nightmare world. The reader will want to stay trapped with the Biologist to find the answers to Area X's mysteries.” ―Kim Stanley Robinson, author of the Mars trilogy“Unsettling and un-put-downable like an old-fashioned adventure story, only weirder, beautifully written and not at all old-fashioned.” ―Karen Joy Fowler, BookPage on The Southern Reach Trilogy“The prose is phenomenal . . . it toyed with my imagination in ways that haven't happened since A Wrinkle in Time.” ―Madison Vain, Entertainment Weekly on The Southern Reach Trilogy“Its deepest terror lies in its exploration of . . . the human heart, and the terror that can grow from the ways in which we are untrue to each other, and to ourselves.” ―Jared Bland, The Globe and Mail on The Southern Reach Trilogy“VanderMeer's masterful command of the plot, his cast of characters, and the increasingly desperate situation will leave the reader desperate for the final volume in the trilogy.” ―Publishers Weekly on The Southern Reach Trilogy“What frightens you? According to many psychologists, our most widely shared phobia is the fear of falling. Jeff VanderMeer's Annihilation taps into that bottomless terror . . . VanderMeer ups the book's eeriness quotient with the smoothest of skill, the subtlest of grace. His prose makes the horrific beautiful.” ―Nisi Shawl, The Seattle Times on The Southern Reach Trilogy“There's something Poe-like in this tightening, increasingly paranoid focus . . . the payoff is absolutely worth the patience.” ―N.K. Jemisin, The New York Times on The Southern Reach Trilogy About the Author Jeff VanderMeeris the author of Hummingbird Salamander, the Borne novels (Borne, The Strange Bird, and Dead Astronauts), and The Southern Reach Trilogy (Annihilation, Authority, and Acceptance), the first volume of which won the Nebula Award and the Shirley Jackson Award and was adapted into a movie by Alex Garland. He speaks and writes frequently about issues relating to climate change as well as urban rewilding. He lives in Tallahassee, Florida, on the edge of a ravine, with his wife, Ann VanderMeer, and their cat, Neo. Excerpt. © Reprinted by permission. All rights reserved. AcceptanceBy Jeff VandermeerFarrar, Straus and GirouxCopyright © 2014 VanderMeer Creative, Inc.All rights reserved.ISBN: 978-0-374-10411-5ContentsTitle Page, Copyright Notice, Dedication, 000X: The Director, Twelfth Expedition, Part I: Range Light, 0001: The Lighthouse Keeper, 0002: Ghost Bird, 0003: The Director, 0004: The Lighthouse Keeper, 0005: Control, 0006: The Director, 0007: The Lighthouse Keeper, 0008: Ghost Bird, 0009: The Director, 0010: Control, Part II: Fixed Light, 01: The Brightness, 02: The Moaning Creature, 03: The Island, 04: The Owl, 05: The Seeker & Surveillance Bandits, 06: The Passage of Time, and Pain, Part III: Occulting Light, 0011: Ghost Bird, 0012: The Lighthouse Keeper, 0013: Control, 0014: The Director, 0015: The Lighthouse Keeper, 0016: Ghost Bird, 0017: The Director, 0018: The Lighthouse Keeper, 0019: Control, 0020: The Director, 0021: The Lighthouse Keeper, 0022: Ghost Bird, 0023: The Director, 0024: The Lighthouse Keeper, 0025: Control, 0026: The Director, 0027: The Lighthouse Keeper, 0028: Ghost Bird, 000X: The Director, Acknowledgments, Also by Jeff VanderMeer, A Note About the Author, Praise for the Southern Reach Trilogy, Copyright, CHAPTER 1PART I RANGE LIGHT0001: THE LIGHTHOUSE KEEPEROverhauled the lens machinery and cleaned the lens. Fixed the water pipe in the garden. Small repair to the gate. Organized the tools and shovels etc. in the shed. S&SB visit. Need to requisition paint for daymark—black eroded on seaward side. Also need nails and to check the western siren again. Sighted: pelicans, moorhens, some kind of warbler, blackbirds beyond number, sanderlings, a royal tern, an osprey, flickers, cormorants, bluebirds, pigmy rattlesnake (at the fence—remember), rabbit or two, white-tailed deer, and near dawn, on the trail, many an armadillo.That winter morning, the wind was cold against the collar of Saul Evans's coat as he trudged down the trail toward the lighthouse. There had been a storm the night before, and down and to his left, the ocean lay gray and roiling against the dull blue of the sky, seen through the rustle and sway of the sea oats. Driftwood and bottles and faded white buoys and a dead hammerhead shark had washed up in the aftermath, tangled among snarls of seaweed, but no real damage either here or in the village.At his feet lay bramble and the thick gray of thistles that would bloom purple in the spring and summer. To his right, the ponds were dark with the muttering complaints of grebes and buffleheads. Blackbirds plunged the thin branches of trees down, exploded upward in panic at his passage, settled back into garrulous communities. The brisk, fresh salt smell to the air had an edge of flame: a burning smell from some nearby house or still-smoldering bonfire.Saul had lived in the lighthouse for four years before he'd met Charlie, and he lived there still, but last night he'd stayed in the village a half mile away, in Charlie's cottage. A new thing this, not agreed to with words, but with Charlie pulling him back to bed when he'd been about to put on his clothes and leave. A welcome thing that put an awkward half smile on Saul's face.Charlie'd barely stirred as Saul had gotten up, dressed, made eggs for breakfast. He'd served Charlie a generous portion with a slice of orange, kept hot under a bowl, and left a little note beside the toaster, bread at the ready. As he'd left, he'd turned to look at the man sprawled on his back half in and half out of the sheets. Even into his late thirties, Charlie had the lean, muscular torso, strong shoulders, and stout legs of a man who had spent much of his adult life on boats, hauling in nets, and the flat belly of someone who didn't spend too many nights out drinking.A quiet click of the door, then whistling into the wind like an idiot as soon as he'd taken a few steps—thanking the God who'd made him, in the end, so lucky, even if in such a delayed and unexpected way. Some things came to you late, but late was better than never.Soon the lighthouse rose solid and tall above him. It served as a daymark so boats could navigate the shallows, but also was lit at night half the week, corresponding to the schedules of commercial traffic farther out to sea. He knew every step of its stairs, every room inside its stone-and-brick walls, every crack and bit of spackle. The spectacular four- ton lens, or beacon, at the top had its own unique signature, and he had hundreds of ways to adjust its light. A first-order lens, over a century old.As a preacher he thought he had known a kind of peace, a kind of calling, but only after his self-exile, giving all of that up, had Saul truly found what he was looking for. It had taken more than a year for him to understand why: Preaching had been projecting out, imposing himself on the world, with the world then projecting onto him. But tending to the lighthouse—that was a way of looking inward and it felt less arrogant. Here, he knew nothing but the practical, learned from his predecessor: how to maintain the lens, the precise workings of the ventilator and the lens-access panel, how to maintain the grounds, how to fix all the things that broke—scores of daily tasks. He welcomed each part of the routine, relished how it gave him no time to think about the past, and didn't mind sometimes working long hours—especially now, in the afterglow of Charlie's embrace.But that afterglow faded when he saw what awaited him in the gravel parking lot, inside the crisp white fence that surrounded the lighthouse and the grounds. A familiar beat-up station wagon stood there, and beside it the usual two Séance & Science Brigade recruits. They'd snuck up on him again, crept in to ruin his good mood, and even piled their equipment beside the car already—no doubt in a hurry to start. He waved to them from afar in a halfhearted way.They were always present now, taking measurements and photographs, dictating statements into their bulky tape recorders, making their amateur movies. Intent on finding ... what? He knew the history of the coast here, the way that distance and silence magnified the mundane. How into those spaces and the fog and the empty line of the beach thoughts could turn to the uncanny and begin to create a story out of nothing.Saul took his time because he found them tiresome and increasingly predictable. They traveled in pairs, so they could have their séance and their science both, and he sometimes wondered about their conversations—how full of contradictions they must be, like the arguments going on inside his head toward the end of his ministry. Lately the same two had come by: a man and a woman, both in their twenties, although sometimes they seemed more like teenagers, a boy and girl who'd run away from home dragging a store-bought chemistry set and a Ouija board behind them.Henry and Suzanne. Although Saul had assumed the woman was the superstitious one, it turned out she was the scientist—of what?—and the man was the investigator of the uncanny. Henry spoke with a slight accent, one Saul couldn't place, that put an emphatic stamp of authority on everything he said. He was plump, as clean-shaven as Saul was bearded, with shadows under his pale blue eyes, black hair in a modified bowl cut with bangs that obscured a pale, unusually long forehead. Henry didn't seem to care about worldly things, like the winter weather, because he always wore some variation on a delicate blue button-down silk shirt with dress slacks. The shiny black boots with zippers down the side weren't for trails but for city streets.Suzanne seemed more like what people today called a hippie but would've called a communist or bohemian when Saul was growing up. She had blond hair and wore a white embroidered peasant blouse and a brown suede skirt down below the knee, to meet the calf-high tan boots that completed her uniform. A few like her had wandered into his ministry from time to time—lost, living in their own heads, waiting for something to ignite them. The frailty of her form made her somehow more Henry's twin, not less.The two had never given him their last names, although one or the other had said something that sounded like \"Serum-list\" once, which made no sense. Saul didn't really want to know them better, if he was honest, had taken to calling them \"the Light Brigade\" behind their backs, as in \"lightweights.\"When he finally stood in front of them, Saul greeted them with a nod and a gruff hello, and they acted, as they often did, like he was a clerk in the village grocery store and the lighthouse a business that offered some service to the public. Without the twins' permit from the parks service, he would have shut the door in their faces.\"Saul, you don't look very happy even though it is a beautiful day,\" Henry said.\"Saul, it's a beautiful day,\" Suzanne added.He managed a nod and a sour smile, which set them both off into paroxysms of laughter. He ignored that.But they continued to talk as Saul unlocked the door. They always wanted to talk, even though he'd have preferred that they just got on with their business. This time it was about something called \"necromantic doubling,\" which had to do with building a room of mirrors and darkness as far as he could tell. It was a strange term and he ignored their explanations, saw no way in which it had any relationship to the beacon or his life at the lighthouse.People weren't ignorant here, but they were superstitious, and given that the sea could claim lives, who could blame them. What was the harm of a good-luck charm worn on a necklace, or saying a few words in prayer to keep a loved one safe? Interlopers trying to make sense of things, trying to \"analyze and survey\" as Suzanne had put it, turned people off because it trivialized the tragedies to come. But like those annoying rats of the sky, the seagulls, you got used to the Light Brigade after a while. On dreary days he had almost learned not to begrudge the company. Why do you see the speck in your neighbor's eye but not notice the log in your own eye?\"Henry thinks the beacon could operate much like such a room,\" Suzanne said, as if this was some major and astounding discovery. Her enthusiasm struck him as serious and authentic and yet also frivolous and amateurish. Sometimes they reminded him of the traveling preachers who set up tents at the edges of small towns and had the fervor of their convictions but not much else. Sometimes he even believed they were charlatans. The first time he'd met them, Saul thought Henry had said they were studying the refraction of light in a prison.\"Are you familiar with these theories?\" Suzanne asked as they started to climb; she was lightly adorned with a camera strapped around her neck and a suitcase in one hand. Henry was trying not to seem winded, and said nothing. He was wrestling with heavy equipment, some of it in a box: mics, headphones, UV light readers, 8mm film, and a couple of machines featuring dials, knobs, and other indicators.\"No,\" Saul said, mostly to be contrary, because Suzanne often treated him like someone without culture, mistook his brusqueness for ignorance, his casual clothes as belonging to a simple man. Besides, the less he said, the more relaxed they were around him. It'd been the same with potential donors as a preacher. And the truth was, he didn't know what she was talking about, just as he hadn't known what Henry meant when he'd said they were studying the \"taywah\" or \"terror\" of the region, even when he'd spelled it out as t-e-r-r-o-i-r.\"Prebiotic particles,\" Henry managed in a jovial if wheezy tone. \"Ghost energy.\"As Suzanne backed that up with a longish lecture about mirrors and things that could peer out of mirrors and how you might look at something sideways and know more about its true nature than head-on, he wondered if Henry and Suzanne were lovers; her sudden enthusiasm for the séance part of the brigade might have a fairly prosaic origin. That would also explain their hysterical laughter down below. An ungenerous thought, but he'd wanted to bask in the afterglow of the night with Charlie.\"Meet you up there,\" he said finally, having had enough, and leaped up the stairs, taking them two at a time while Henry and Suzanne labored below, soon out of sight. He wanted as much time at the top without them as possible. The government would retire him at fifty, mandatory, but he planned to be as in shape then as now. Despite the twinge in his joints.At the top, hardly even breathing heavy, Saul was happy to find the lantern room as he'd left it, with the lens bag placed over the beacon, to avoid both scratching and discoloration from the sun. All he had to do was open the lens curtains around the parapet to let in light. His concession to Henry, for just a few hours a day.Once, from this vantage, he'd seen something vast rippling through the water beyond the sandbars, a kind of shadow, the grayness so dark and deep it had formed a thick, smooth shape against the blue. Even with his binoculars he could not tell what creature it was, or what it might become if he stared at it long enough. Didn't know if eventually it had scattered into a thousand shapes, revealed as a school of fish, or if the color of the water, the sharpness of the light, changed and made it disappear, revealed as an illusion. In that tension between what he could and couldn't know about even the mundane world, he felt at home in a way he would not have five years ago. He needed no greater mysteries now than those moments when the world seemed as miraculous as in his old sermons. And it was a good story for down at the village bar, the kind of story they expected from the lighthouse keeper, if anyone expected anything from him at all.\"So that's why it's of interest to us, what with the way the lens wound up here, and how that relates to the whole history of both lighthouses,\" Suzanne said from behind him. She had been having a conversation with Saul in his absence, apparently, and seemed to believe he had been responding. Behind her, Henry was about ready to collapse, although the trek had become a regular routine.When he'd dropped the equipment and regained his breath, Henry said, \"You have a marvelous view from up here.\" He always said this, and Saul had stopped giving a polite response, or any response.\"How long are you here for this time?\" Saul asked. This particular stint had already lasted two weeks, and he'd put off asking, fearing the answer.Henry's shadow-circled gaze narrowed. \"This time our permit allows us access through the end of the year.\" Some old injury or accident of birth meant his head was bent to the right, especially when he spoke, right ear almost touching the upward slope of his shoulder. It gave him a mechanical aspect.\"Just a reminder: You can touch the beacon, but you can't in any way interfere with its function.\" Saul had repeated this warning every day since they'd come back. Sometimes in the past they'd had strange ideas about what they could and could not do.\"Relax, Saul,\" Suzanne said, and he gritted his teeth at her use of his first name. At the beginning, they'd called him Mr. Evans, which he preferred.He took more than the usual juvenile pleasure in positioning them on the rug, beneath which lay a trapdoor and a converted watch room that had once held the supplies needed to maintain the light before the advent of automation. Keeping the room from them felt like keeping a compartment of his mind hidden from their experiments. Besides, if these two were as observant as they seemed to think they were, they would have realized what the sudden cramping of the stairs near the top meant.When he was satisfied they had settled in and were unlikely to disturb anything, he gave them a nod and left. Halfway down, he thought he heard a breaking sound from above. It did not repeat. He hesitated, then shrugged it off, continued to the bottom of the spiral stairs.* * *Below, Saul busied himself with the grounds and organizing the toolshed, which had become a mess. More than one hiker wandering through had seemed surprised to find a lighthouse keeper walking the grounds around the tower as if he were a hermit crab without its shell, but in fact there was a lot of maintenance required due to the way storms and the salt air could wear down everything if he wasn't vigilant. In the summer, it was harder, with the heat and the biting flies.The girl, Gloria, snuck up on him while he was inspecting the boat he kept behind the shed. The shed abutted a ridge of soil and coquina parallel to the beach and a line of rocks stretching out to sea. At high tide, the sea flowed up to reinvigorate tidal pools full of sea anemones, starfish, blue crabs, snails, and sea cucumbers.She was a solid, tall presence for her age, big for nine—\"Nine and a half!\"—and although Gloria sometimes wobbled on those rocks there was rarely any wobble in her young mind, which Saul admired. His own middle-aged brain sometimes slipped a gear or two.So there she was again, a sturdy figure on the rocks, in her winter-weather gear—jeans, hooded jacket and sweater underneath, thick boots for wide feet—as he finished with the boat and brought compost around back in the wheelbarrow. She was talking to him. She was always talking to him, ever since she'd started coming by about a year ago.\"You know my ancestors lived here,\" she said. \"Mama says they lived right here, where the lighthouse is.\" She had a deep and level voice for one so young, which sometimes startled him.\"So did mine, child,\" Saul told her, upturning the wheelbarrow load into the compost pile. Although truth was, the other side of his family had been an odd combination of rumrunners and fanatics who he liked to say, down at the bar, \"had come to this land fleeing religious freedom.\"After considering Saul's assertion for a moment, Gloria said, \"Not before mine.\"\"Does it matter?\" He noticed he'd missed some caulking on the boat. (Continues...)Excerpted from Acceptance by Jeff Vandermeer. Copyright © 2014 VanderMeer Creative, Inc.. Excerpted by permission of Farrar, Straus and Giroux. All rights reserved. No part of this excerpt may be reproduced or reprinted without permission in writing from the publisher.Excerpts are provided by Dial-A-Book Inc. solely for the personal use of visitors to this web site. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 51 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 51 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 11 hrs 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The New York Timesbestselling final installment of Jeff VanderMeer’s wildy popular Southern Reach Trilogy It is winter in Area X, the mysterious wilderness that has defied explanation for thirty years, rebuffing expedition after expedition, refusing to reveal its secrets. As Area X expands, the agency tasked with investigating and overseeing it--the Southern Reach--has collapsed on itself in confusion. Now one last, desperate team crosses the border, determined to reach a remote island that may hold the answers they've been seeking. If they fail, the outer world is in peril.Meanwhile, Acceptance tunnels ever deeper into the circumstances surrounding the creation of Area X--what initiated this unnatural upheaval? Among the many who have tried, who has gotten close to understanding Area X--and who may have been corrupted by it?In this New York Times bestselling final installment of Jeff VanderMeer's Southern Reach trilogy, the mysteries of Area X may be solved, but their consequences and implications are no less profound--or terrifying. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ FSG Originals; First Edition (September 2, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0374104115"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0374104115"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.95 x 7.45 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,985 in Books (See Top 100 in Books) #259 in Exploration Science Fiction #1,521 in American Literature (Books) #1,765 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 7,625 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "iank",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOS7X6OJIHMKCBOM6QN57HVGSNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F8NJPWY60743?ASIN=0374104115",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2014",
                "reviewTitle": "5.0 out of 5 stars Unforgettable Surreal Fiction",
                "reviewText": "Jeff VanderMeer's Southern Reach trilogy, of which Acceptance is the last book, is unusual in my experience. I don't usually like surreal or \"fantastic\" fiction. I don't usually like the ambiguous and dream like quality of this style of fiction. Although I had tried VanderMeer's earlier book Finch , I didn't finish it. The Southern Reach Trilogy was different however.VanderMeer is a master of describing the atmosphere of place. In both Annihilation (the first book of the trilogy) and Acceptance VanderMeer writes about a version of Northern Florida's \"Forgotten Coast\" that has become Area X. His description of the pristine wilderness of Area X, combined with the lurking menace is compelling and unforgettable. I found VanderMeer's description of the Forgotten Coast so strong and compelling that I looked it up on the web and would like to visit someday.In the second book of the trilogy, Authority , the setting is the Southern Reach, an organization that was created to research Area X. Instead of the description of wilderness, there is a description of a claustrophobic institution and bureaucracy, with, again, Area X the lurking menace in the background. I found the warping of the Southern Reach and of the people who work there uncomfortable reading. Authority was the bridge novel between the start and end of the trilogy and I didn't like it as much as Annihilation and Acceptance.The characters in Acceptance are Control (the Southern Reach Director John Rodriguez from Authority), Ghost Bird, an avatar of the Biologist from Authority, the Psychologist, and Southern Reach Director, who lead the expedition in Annihilation and Grace, the Southern Reach second in command under Control and the Psychologist.A minor digression: Normally I have an almost allergic reaction to writing in the second person (\"You find yourself in a large automobile. And you ask yourself...\") VanderMeer is the first writer that I've read where I felt that the second person perspective worked well. In Acceptance VanderMeer uses the second person in the sections on the Psychologist. The narrative was easier to follow since the second person signaled a switch to the Psychologist's world.The setting in Acceptance moves between the Psychologist when she was director at the Southern Reach and Area X. Acceptance provides background on Area X before it was walled off by \"The Border\". We learn about the lighthouse keeper and others who lived in Area X. We also see the growth of Area X and the arrival of The Border. But there are no clear answers as to what precisely Area X is and the mechanism of its formation. There are suggestions and sketches of what it might be and who created it. But Area X is never completely fathomed.Humans create stories to explain what they can't understand. Modern science has allowed much of our common world to be explained by a rational structure. What we know and can understand is still limited. The universe remains a strange and unexplained place. In the Southern Reach trilogy Area X is beyond human understanding and exists via forces that humans can only glimpse.What stands out in these books are the characters and the spaces they inhabit: the Southern Reach, Area X and Central (the parent organization of the Southern Reach). We see some of the inner lives of the characters, how their environment warps them and how they evolve and change. The plot of the Southern Reach trilogy is ambiguous, but what is unforgettable is the characters and the pristine menace of Area X's Forgotten Coast.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C.L.Cohen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGW65JA2F7UP4TI63D5WVHF2TEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VKMH52LJ6921?ASIN=0374104115",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 16, 2015",
                "reviewTitle": "4.0 out of 5 stars Acceptance: Sometimes Difficult to Accept",
                "reviewText": "Jeff Vandermeer’s Acceptance completes the Southern Reach Trilogy with detailed descriptions and complex sentences, sucking us into a world that’s changing. Here is where we expect answers, demand resolutions to the why those changes occur and what will happen to the major characters: the Biologist, Control, the Lighthouse Keeper, the Psychologist, and her assistant, Grace. Yet here is where we find true changes; changes in perspective on the landscapes of Area X, and changes in point of view.The first book, Annihilation, is written from the first-person point of view of the Biologist on the twelfth expedition into Area X. Authority, the second book, is written from the limited third-person point of view of Control as he struggles in his new position as Director of Southern Reach. As changes have occurred within Area X, the border expanding, the wildlife being absorbed and mutated, so do changes in perspective occur within the book. Acceptance includes multiple points of view: the Biologist’s first-person perspective AND the third-person limited from Control’s eyes. Acceptance adds the third-person point of view through the Lighthouse Keeper and we see the Psychologist’s childhood in ground zero of Area X and learn about the strange Science and Séance Brigade through his eyes. But the changes don’t stop there. A second-person point of view is added which observes the Psychologist prior to the twelfth expedition. The unknown voice speaks directly to the Psychologist and we have to wonder who this new speaker is? We can only assume it is the voice of Area X’s creator, but this is never confirmed. This whole jumping back and forth between different types of viewpoints creates a feeling of unease in the reader and pulls you into the chaos and confusion of those expedition members who came back from Area X different, changed, damage psychologically and physically so that they died in less than a year. All accept for Lowry, who continues his deranged pursuit of conquering Area X from the safe distance of Central…or is it a controlled lab so his own changes can be easily observed?The affect is unnerving as we scramble over these changes in point of view, changes in Area X and changes in us, because of the answers we are compelled to seek. Like Control, who clutches Whitby’s terroir report, we seek answers to our questions: Who or what is behind the changes in Area X? What does it mean for humanity? But like the Lighthouse Keeper’s father told him, “Once the questions snuck in, whatever had been certain became uncertain. Questions opened the way for doubt.” So we follow the Lighthouse Keeper into the cryptic world of Area X as it impregnates Earth with – we know not what - and are only partially satisfied with the answers.Answers, like candy, often leave us with more questions, and though this is true in the world of Jeff Vandermeer’s Acceptance, it is perhaps the most original dystopian I have read in a long time. The writing style, the characters and the plot are compelling and definitely worth the read!Rhodes FitzWilliam",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 11, 2019",
                "reviewTitle": "Excelente compra",
                "reviewText": "Excelente libro, las portadas son geniales y el libro llegó en perfectas condiciones",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 5, 2017",
                "reviewTitle": "Amazing book!",
                "reviewText": "This book is simply an amazing end to an amazing trilogy. Let's hope the movie can hold the expectation created.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 13, 2018",
                "reviewTitle": "Caps off an insane trip of what it means to be an individual.",
                "reviewText": "A little more like Annihilation than Authority but still it's own thing.Annihilation (self-discovery, sci-fi mind bender)Authority (Paranoid sci-fi thriller)Acceptance (Horror tinged discovery of what it means to be an individual?)I can't stress how addicting these 3 books are, each time I've sat down with them I read anywhere from 50-80 pages.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 17, 2019",
                "reviewTitle": "Long delivery time",
                "reviewText": "Book delivered in good condition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Micha Frommeyer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 25, 2018",
                "reviewTitle": "Intensives Finale der Serie",
                "reviewText": "\"Acceptance\", das dritte und letzte Buch der Southern-Reach Trilogie, führt die Serie zu einem intensiven Schluss. Es liefert auch Antworten oder doch zumindest Andeutungen zu den offenen Fragen der ersten beiden Teile, z.B. zur Entstehung der Area X. Dabei sind es die verschiedenen Erzählperspektiven, die bei manchen Rezensenten zu Verwirrung führten, die das Buch interessant machen: Wie erlebte der Leuchtturmwärter Saul Evans die Entstehung der Area X? Was passierte mit der Biologin nach \"Annihilation\"? (Achtung Spoiler: Grandios ist der Brief bzw. das Testament der Biologin über ihre Zeit auf der Insel und die mögliche Wiederbegegnung mit ihrem verschollenen Mann.) Man muss sich allerdings auf die veränderte Erzähltechnik einlassen: Wo \"Annihilation\" eine treibende Handlung aus der Sicht nur einer Protagonistin hatte, ist \"Acceptance\" ein Kaleidoskop. Die Antworten, die man erhält, darf man sich allerdings nicht wie eine allwissende Erklärung vorstellen, es gibt keinen Professor Dumbledore, der am Ende alle Fragen in einfachen Worten erläutert. Vielmehr haben einzelne Charaktere jeweils ihren Moment der Erkenntnis, typischerweise wenn sie gerade auf die eine oder andere Art eine besonders enge Verbindung zur Area X haben. Und in manchen Punkten verbleibt am Ende Unsicherheit. Es gibt auch keinen Endkampf oder dergleichen. Das ist dem Buch oder der Trilogie als ganzer aber nicht abträglich - im Gegenteil!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}