{
    "remaining_requests": 1397,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wielders-Woe-Jeffery-Roarke-Jr-ebook/dp/B0C6QTDY9H",
    "body": {
        "name": "Wielders of Woe: Inferno",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wielders-Woe-Jeffery-Roarke-Jr-ebook/dp/B0C6QTDY9H",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91dZSzTRVqL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jeffery Roarke Jr",
            "link": "https://www.amazon.com/Jeffery-Roarke-Jr/e/B0C3RG1MDS/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 21,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Hero. Savior. Heir. Traitor. Exile. Kell.When he won the war, Prince Halcion Skyborn was ready to become the Crown Prince of the Empire of Athos. But life would never be that easy and the political minds would make sure of that. He was close to uprooting the sitting High Minister, who's twisted interpretation of the Code of Athos, the defining doctrine for the people, sent the Empire on a dangerous path to where it had never gone before. On the cusp of confronting him in front of the Imperial Council and steering the Empire back on track, unfathomable news is brought to light and Hal is accused of having a hand in it. Now, the very people who sang songs of his triumph and showered him with love, hate him.Stripped away of his Fire Wielding magic, the very thing that made him unique, and feared, Hal is sent to the dreaded Ashlands of Asha, where the former prince is forced to brave the dangers in the inhospitable land of perpetual ash. Its kill or be killed and any step could be the last. In a quest to understand what happened, what went wrong, Hal learns that there is more to him than just wielding magic. With bits of information left by his late mother, he must search for the truth about his ancient ancestors and the celestials they mingled with millenniums ago if he wants to regain the powers bestowed to him by blood and defeat the evil that threatens the ashy planet itself. But he must prove to himself, and the masters of centuries past, that he can master the Inferno.Try as he might, the echoes of a Primordial god threaten to bend the will of the galaxy’s inhabitants to its desire. Will he succumb to the same fate? Or resist the madness that tries to warp his mind?",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C6QTDY9H"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 30, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5218 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 431 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,401,014 in Kindle Store (See Top 100 in Kindle Store) #3,480 in Galactic Empire Science Fiction eBooks #3,746 in Galactic Empire Science Fiction #9,622 in Space Opera Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 21 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bethuel Kibet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ6KNM6JNWB3RRUFHBNYP74OC6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AWOG52ER5III?ASIN=B0C6QTDY9H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Intriguing!",
                "reviewText": "\"Wielders of Woe: Inferno\" by Jeffery Roarke Jr. is a rollercoaster ride through a world of intrigue, betrayal, and fire-wielding magic that will have you hooked from the first page. I mean, who doesn't love a good tale of royal intrigue, hidden plots, and cosmic conflicts, right?What I absolutely adored about this book is its ability to keep you on your toes. Just when you think you've got a handle on things, Roarke throws in a curveball that leaves you flipping through pages faster than a caffeinated squirrel. The pacing is like a well-choreographed dance – it ebbs and flows, building tension and releasing it with perfectly timed twists.And the world-building? Oh, let me tell you, it's as rich and vivid as a double chocolate fudge cake. From the Empire of Athos with its shady council to the enigmatic Ashlands that send shivers down your spine, every detail is meticulously crafted. You'll find yourself completely immersed in a universe that's equal parts fantastical and relatable, and that's a rare gem in the world of fantasy literature.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "booksfromtenelan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVC3JFRID2UXFHT6LCBQNZJW3GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XKT1DAO3VPXY?ASIN=B0C6QTDY9H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Lots of action",
                "reviewText": "Firstborn of Emperor Tiberius, Halcion Skyborn is about to go back home after winning a war to prove himself and show everyone he is the right heir to the throne.However, not everyone agrees with this, and upon returning back he will realize many things have changed. Not only his father is ill, but the powers have been transferred to someone who has their own agenda and is ready to change even the Code to get what they want.When his existence becomes a threat for this person, Halcion is exiled to the Ashlands, a place from where nobody has ever returned. There he will follow a lead left by his mother, passed away some time before the events in the book take place, discovering things about his powers and his past that will change his life forever. With the help of an old friend and a few new ones, he will have to once again prove himself and save not only the Ashlands but the rest of the empire as well.I don't read a lot of sci-fi, and I have to say that this way very easy for me to follow. The storyline is quite interesting, and if you are a fan of secret identities, you will probably enjoy this. I liked Halcion's growth throughout the book, and how he was a little too proud at first but at the end he is more mature and probably more worthy of the throne.This book is also full of action. There are so many fights, and there is never a dull moment. As a reader who enjoyed more character-driven books, this was probably the only thing that prevented me from fully enjoying the book. It was difficult for me to care about the characters, and I wish there had been more moments where they actually bonded and we could see their relationships more.Still, I would definitely recommend this book if you are more plo-driven and like action over other things.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.J.M.J.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI3RG2MLVY53VNGNDX324KUDOPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXG541ID8JUHX?ASIN=B0C6QTDY9H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Explore New Worlds.",
                "reviewText": "I loved this book. It had everything, action, adventure and my favorite, a new world to discover! The world-building by Mr. Roarke is phenomenal! His vivid descriptions painted an interesting picture in my mind, allowing me to easily visualize the fiery landscapes,battles, and complex magical systems within the story.The character development was great. Kael was well written, relatable and compelling. I found myself rooting for him as he faced numerous challenges to uncover the truth about his powers. The supporting cast had their own unique contributions to the narrative and I hope to see more of them in future books. A great new addition to the fantasy book genre. What an amazing new series that sets readers on a thrilling journey through the realms of fire and magic and fascinating new worlds. Great Read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/619p9fgwDCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bXxZEPxvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raisa M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTGSBYM4U6OY7CHNX62B62CBU4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C7L19Z1T7U9K?ASIN=B0C6QTDY9H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Action-packed adventure!",
                "reviewText": "\"Wielders of Woe: Inferno\" by Jeffery Roarke Jr. is a blend of science-fiction, fantasy, and action. The story opens with Prince Halcion, heir to the throne, who returns home from war, victorious. As he strives to prove that he is a worthy heir to the throne, there is an assassination, and he finds himself on the run and stripped of his powers.What follows is a story of courage and adventure, betrayals and allies. Roarke offers just the right balance between supernatural elements, political intrigue, and epic battles. The author skillfully draws you in, giving you the impression that you think you know what's happening next, only to be surprised by a plot twist.As far as heroes go, you can't help but like Halcion. Despite the various challenges he goes through, he doesn't stop fighting. This was a solid book with an interesting plot. However, I would have loved for the characters to have a bit more depth to them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Emperador",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2ZXQSYGNOYLX6VT4HK4DGZ7LYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B9MQPXNA9HTC?ASIN=B0C6QTDY9H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing epic fantasy",
                "reviewText": "Filled with action and suspense, Wielders of Woe:Inferno takes the reader to different worlds while exposing plots of espionage and deceit. The story has many twists and turns, leaving it hard to know who to trust.The author writes a very detailed, complex epic with descriptions so vivid that you feel like you are in the middle of the action.I found the book hard to put down except when I needed a chance for my heart rate to return to normal.With interplanetary wars, sibling rivalry, murder, romance, and adventurous treks, this novel has something for everyone who enjoys a bit of fantasy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Toft-NielsenPaul Toft-Nielsen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBAL7YYX2CGSFSI465TXFSOOUQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH9B8P7CO2QI0?ASIN=B0C6QTDY9H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Such a fantastic read!",
                "reviewText": "I loved this book. From the first chapter it hooked me and refused to let me go until I finished it. The details were amazingly put together allowing me put every scene together as if it was a movie. The plot was just as great, keeping you engaged and wondering about what would happen next. I still remember the scenes fondly that gave me goosebumps! The characters made you feel what they felt, which really made you connect to them. I can’t wait for a reread down the road and relive this wonderful journey until the next book comes out!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71gBeBu9dqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GoodReaderGoodReader",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 29, 2024",
                "reviewTitle": "Great space fantasy!",
                "reviewText": "\"Wielders of Woe: Inferno\" by Jeffery Roarke Jr. was part of my self-imposed science fiction marathon during the last september. This one takes you on a cosmic journey with a prince, a sprawling empire, and enough political drama to make a soap opera blush.Our tale kicks off with a Prince, Hal for the pals, on a goodwill tour to handle a rebellious family causing a stir in the Empire. Now, I won't spill the cosmic beans on the specifics – that's your job. But trust me, it's a big deal, the kind that echoes across galaxies.After some diplomatic hustle, Hall comes back with more than just a souvenir keychain – he's got higher fame and everyone singing his praises. He's thinking, \"Yep, I just secured my throne ticket.\"But hold up, back on the capital planet, political shenanigans are afoot. There's a schemer in town, playing chess with the empire's succession, and Hall is smack in the middle. Now he's got to juggle securing his heir status, deciphering political mysteries, and figuring out what his rivals are scheming. Intergalactic politics – not exactly a walk in the space park.Jeffrey Ro Jr. serves up a narrative with hints of Timothy Zahn, crafting an atmosphere through dialogue and character feels. It's like cooking a gourmet meal with minimal ingredients – you'll need some imagination lifting, but it's worth it.Now, fair warning, this feels like a first book – the potential is there, but it's like a cake not fully baked. There are moments where things move faster than a hyperspace jump, and you might need to hit the brakes and reread a bit. It's not a deal-breaker; consider it a pit stop in your intergalactic road trip.Prince Hall – the dude has aspirations, but initially, you're like, \"Bro, what's going on in that head of yours?\" There's character growth, and by the end, you're practically his space therapist.Jeffrey Ro Jr. clearly has a plot map, and he sprinkles it with neat twists. It's an enjoyable read, but like an interstellar Tinder date, you know there's potential for something even better in the future. I'm stoked for the sequel – bring it on, Jeffery! If you're into space operas with a dash of fantasy, political intrigue, and a plot that does the space tango, give \"Wielders of Woe: Inferno\" a spin. Beam me up, Hal!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61JlNmMZUNL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aditya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 4, 2023",
                "reviewTitle": "There are no spoilers of any kind below!",
                "reviewText": "A very exhilarating and fun novel to read. There was close to no dull moment in the book. I love fantasy books and whenever I come across a good one it becomes one of my top recommendations until a better one comes along. For now that spot is with this book.The book's remarkable attribute resides in its captivating archetypal main character, epitomizing the classic hero's journey, once more set in exile but fueled by an exceptionally unique determination. The author also skillfully creates a diverse supporting cast, igniting readers' imagination and immersing them further into the narrative. Among the ensemble are valiant warriors, enigmatic whisperers, and a formidable wielder of fire, adding depth and intrigue to the story.The book is beautifully written and I will recommend it to everyone who loves fantasy(like me). This book will not disappoint. Lastly, much gratitude to the author for writing such a beautiful book for us the readers.Thank youHappy Reading",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rahul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 2, 2023",
                "reviewTitle": "A Fiery Symphony of Magic and Betrayal",
                "reviewText": "Jeffery A. Roarke Jr. embarks readers on an enchanting odyssey through a realm of magic, treachery, and self-discovery. At the heart of the story stands Prince Halcion Skyborn, empyrean by birth and wielder by nature, a character whose spirit and determination refuse to bow to the cruelty of fate. Exiled and stripped of his fire-wielding abilities, he embodies a blend of ambition, selflessness, and unwavering courage. As the narrative unfolds, readers witness Halcion's transformation, not just as a prince seeking his rightful place on the throne but as a hero destined to challenge the darkness that threatens his people.The author's skillful storytelling effortlessly transports us from sprawling battles to intimate, emotionally charged moments. With prose that dances with vivid descriptions, we are drawn into the clash of cosmic entities, the depths of forbidden forests, and the echoes of long-lost prophecies. The battle scenes are so vividly depicted that it feels like the characters are fighting right in front of our eyes, as if in augmented reality. An anime based on this captivating world would be a visual feast, bringing the stunning visualizations to life in a way that would leave audiences spellbound.One of the novel's most captivating aspects lies in the rich tapestry of characters that fill its pages. From allies forged in the crucible of adversity to foes shrouded in deception, each figure bears a distinct essence that adds depth and intrigue to the narrative. As readers, we find ourselves torn between loyalty and suspicion, mirroring Halcion's journey of discerning friend from foe in a landscape teeming with shadows.As the Prince navigates the intricate maze of betrayal and sacrifice, the world-building stands tall as a testament to Roarke Jr.'s talent. The universe he crafts brims with life, its interconnected web of nations, magic, and ancient lore serving as an immersive playground for the imagination.\"Wielders of Woe: Inferno\" is a story about bravery and strength, but it also explores the idea of power and how it can lead to corruption. The book shows us how greed, revenge, and deceit can affect people, reminding us that there is a delicate balance between good and bad in the real world.Even though the story takes us through exciting battles and magical places, the author, Roarke Jr., connects us deeply to the characters' emotions. When they succeed, we feel like we've won too, and when they face hardships, it touches our hearts, creating a strong bond that lasts beyond the book's ending.If you enjoy fiction, you will love every page of this lengthy book and may even feel like it never ends.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Purnima Khanna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 3, 2023",
                "reviewTitle": "A treat for fantasy lovers",
                "reviewText": "What an action packed roller coaster ride Jeffery Roarke's \"Wielders of Woe: Inferno\" is!A complex yet strong and gripping plot, well crafted and well developed characters, impactful writing style make the book a masterpiece. The story picks up pace from the very first page andrevolves around the brave, gritty, determined and strong protagonist, Prince Halcolin and his journey of reclaiming his empire from the enemies.There is no dearth of action, adventure and suspense. A must read for all the fantasy lovers out there.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}