{
    "remaining_requests": 1415,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hitchhikers-Guide-Galaxy/dp/B0009JKV9W",
    "body": {
        "name": "The Hitchhiker's Guide to the Galaxy",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hitchhikers-Guide-Galaxy/dp/B0009JKV9W",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51b09NRSkiL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Douglas Adams",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Douglas+Adams&search-alias=audible"
        },
        "brand": "Douglas Adams&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 25146,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Seconds before the Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker's Guide to the Galaxy who, for the last 15 years, has been posing as an out-of-work actor. Together this dynamic pair begin a journey through space aided by quotes from The Hitchhiker's Guide (\"A towel is about the most massively useful thing an interstellar hitchhiker can have.\") and a galaxy full of fellow travelers: Zaphod Beeblebrox, the two-headed, three-armed ex-hippie and totally out-to-lunch president of the galaxy; Trillian, Zaphod's girlfriend (formally Tricia McMillan), whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; and Veet Voojagig, a former graduate student who is obsessed with the disappearance of all the ballpoint pens he bought over the years.Where are these pens? Why are we born? Why do we die? Why do we spend so much time in between wearing digital watches? For all the answers stick your thumb to the stars. And don't forget to bring a towel! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Humor & Satire",
                "link": "https://www.amazon.com/Comic-Literature-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4465"
            },
            {
                "name": "Humorous",
                "link": "https://www.amazon.com/Humorous-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159382011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "5 hours and 51 minutes"
            },
            {
                "name": "Author",
                "value": "Douglas Adams"
            },
            {
                "name": "Narrator",
                "value": "Stephen Fry"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 28, 2005"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0009JKV9W"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#214 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Humorous Science Fiction (Audible Books & Originals) #2 in Humorous Science Fiction (Books) #2 in Humorous Fiction & Satire"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robert Downs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLAJKD4O5ILP3K76OBGHB4QO34Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BAU5AMTSCMXF?ASIN=B0009JKV9W",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 8, 2013",
                "reviewTitle": "4.0 out of 5 stars Definite Glitches In Our Universe",
                "reviewText": "I once believed I was an alien life form, albeit I was in third grade at the time, and thus subject to the ramifications of peer pressure, which sometimes contradicts common sense. Having watched enough cartoons, along with enough animated movies and not so animated ones, I even resorted to the beep-beep noise used by The Road Runner and unintelligent Martians. It was not one of my prouder moments, but looking back on it now, probably showed my ability to suspend disbelief, and helped sprout the seeds of my imagination. Since then, I've developed the spine of a porcupine, I can spit nails, and I have the hard exterior shell of a Plexiglas spacecraft, so I guess the cycle is complete and all is right with the cosmos.But there are definite glitches in our universe, as evidenced in THE HITCHHIKER'S GUIDE TO THE GALAXY. First, we have the demolishment of the Earth for a galactic freeway or hyperspace bypass. We find out our intelligence level has been exceeded by mice and dolphins, and that dolphins tried to warn us multiple times of our impending doom, but gave up when their form of communication was not acknowledged and accepted our offerings of fish instead. Ford Prefect is alive and well, is not to be confused with the failed Ford model, and in multiple cases, his intelligence exceeds that of the protagonist, Arthur Dent. The plot becomes a bit discombobulated and farfetched at times and sometimes powered by the Infinite Improbability Drive, but that only adds to the wackiness and pleasure of the overall experience.Even towels are magically transformed to \"the most massively useful thing an interstellar hitchhiker can have.\" And you just might need one to stifle your laughter, grins, and outright guffaws at some of the hilarious discussions presented in this fun, quirky read. Where, in the end, \"I came for a week and got stuck for fifteen years.\"\"Resistance is useless!\" So you should just sit back and enjoy yourself, albeit from another planet like Mars or Pluto, and where the future is not mired by a hyperspace bypass. Of course, there's always the possibility that introverts may rule this particular universe, and this brings me to one of my favorite lines of this tale: \"If they don't keep on exercising their lips, he thought, their brains start working.\" So, in that regard, I will continue to exercise my brain through the absence of moving my lips, except when I have something intelligent, relevant, or interesting to say, or when I occasionally forget that my mouth is moving.If you have a wickedly morbid, sarcastic sense of humor, this book is definitely for you. Since I laugh so often I sometimes don't even know why I'm laughing, I rather enjoyed this read. And you can too, for the measly sum of less than thirty Altairian dollars a day. \"So long and thanks for all the fish.\"Robert DownsAuthor of Falling Immortality: Casey Holden, Private Investigator",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TATAQ0AH9NR9?ASIN=B0009JKV9W",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2019",
                "reviewTitle": "5.0 out of 5 stars A light-hearted, adventure story about an imaginative fellow who goes on a long trip with friends.",
                "reviewText": "The Hitchhiker's Guide to the Galaxy, by Douglas Adams, published in 1979 is a thrilling work of science-fiction and highly entertaining to read. It is a well-written book, with a surplus of thought-provoking ideas. The prose conceals flashes of brilliance and unearths pearls of wisdom. The characters are themselves illuminating, with respect to their sharp perceptions, astute assessments of the situation, quick reactions, and outright candor. You get the impression that the story could very easily have been about a likable group of college students who plan to go on a road trip for spring break, so that they can experience all that life has to offer, let off a little steam, and reduce some stress before final exams. But, alas, the book is more complicated than that. It is more like, what if you know for certain that identifiable flying objects piloted by alien beings are in close proximity, and you have the coded electronic transporter boarding pass device, granting you unlimited access to go anywhere in the universe, right there in your hot little hand. You find that this quite interesting group of individuals demonstrates great camaraderie and superlative rapport in their timely interactions. They provide keen insight, regarding their interpretations of recent events and take on a variety of pertinent subjects. Such as: \"what should we do next in order to survive imminent disaster?\" Basically, they learn to get along exceedingly well together as they travel through the galaxy in a space ship they've somehow managed to commandeer and fly out to distant points as yet unknown. The space ship, incidentally, as it turns out, incorporates the latest and greatest technology ever seen anywhere. Again, the book is cleverly written, of a deeply philosophical nature, and incredibly fun to read. I'd recommend it to anyone. \"The Restaurant at the End of the Universe\" is the next title in the book series. R. Royce saw the note attached to the refrigerator with a small magnetic ornament in the shape of a wild-flower. It read, \"We decided to let you sleep in. Be back in a jiffy with your truck of chinchillas.\" \"Good morning, Royce,\" said Cornelius Korn. \"Are you ready to travel?\" \"Where is everyone?\" asked Royce. \"They went to gas up the vehicles for the trip to Minnesota. As you know we need to deliver four truck-loads of the cute, cuddly critters to the new chinchilla ranch up near the Canadian border,\" explained Korn. \"I thought we were still in the early planning stages for that assignment,\" said Royce. \"How'd you get the ball rolling so fast?\" \"In case you weren't aware, the democratic process can work miracles in times of great need. The majority voted we go now,\" said Korn. \"Plus, we have just received a sizable cash advance on our proceeds, the amount we get upon final delivery.\" \"Apparently, you didn't need my vote,\" said Royce. \"Doesn't matter. I'm all for the plan.\" \"The Montana rancher sold us all of his chinchillas, but he's holding on to the minks and sables,\" said Korn. \"Makes perfect sense to me,\" said Royce. You can make very expensive, complete fur coats out of mink or sable. They manufacture the chinchilla fur hides into fashionable leather coat collars, hats, gloves, and accessories. It involves different manufacturing processes entirely.\" \"Some people keep them as pets, as well,\" added Korn. \"They're docile, playful, and curious. Intelligent creatures.\" \"You say that we're delivering paired couples of chinchillas to the rancher in Minnesota?\" asked Royce. \"And we get a share of the profits for the first litters?\" \"That's right,\" said Korn. \"$20 bonus, for each baby chinchilla born upon or after arrival at the destination. $80 each, for the red-haired, striped, or spotted blondes. That's because they're rarer breeds and much in demand.\" \"I can see how this venture might prove profitable,\" said Royce. \"What do the girls have to say about our travel prospects? \"Mostly, they want to experience fine dining along the way, stay in scenic hotels, and go to the International Mall in Minneapolis,\" said Korn. \"Who can argue with their logic?\" \"Not me,\" said Royce. \"Here they are now. Let's get this show on the road. Shall we?\" \"We're all fueled up and ready to roll,\" said Raquel Remington. \"I've been thinking about those chinchillas. Maybe we should do some additional research.\" \"I agree,\" said Alexis Sue Shell. \"There may be a big demand for chinchilla oil in the field of medicine.\" \"Or, for the wild, musky chinchilla scent, in the perfumery industry,\" continued Raquel. \"We'll definitely have to look into the matter and make discrete inquiries accordingly,\" said Korn, nonchalantly. Which probably meant that he had other sticks in the fire, as well. For all they knew, he might already have sold some of the cute, furry creatures to NASA for their Mission to Mars program. His next detour: The Biology Unit, Life Support Section, Advanced Obscure Scientific Research Corporation, a subsidiary of NASA. It was inevitable, and so conveniently nearby the chinchilla ranch.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rhonda caplan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2022",
                "reviewTitle": "I do not \"love\" sci-fi.",
                "reviewText": "My son (my only child) passed away Feb 24,2022...this apparently from what his friends tell me was one of his favorites...as the back cover states, 42 is the answer.He was 42 when he passed away...I was a voracious reader pre pandemic..not so much now.This is the first in a series of 5..it is tongue in cheek.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darlan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 14, 2021",
                "reviewTitle": "Muito bom o livro",
                "reviewText": "Sem dúvida nenhuma é um ícone geek. Achei o livro bastante interessante e original. Para os leitores não muito hábeis com o inglês pode ser bem difícil de ler pois, não há uma estória contínua para ajudar no entendimento dos termos. Tem algumas tiradas engraçadas, mas não leia esperando morrer de rir. Mas em resumo aconselho a leitura por ser um clássico.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Promit Das",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 4, 2024",
                "reviewTitle": "42",
                "reviewText": "It is the Answer to the Ultimate Question of Life, the Universe, and Everything.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 9, 2024",
                "reviewTitle": "Nice read",
                "reviewText": "My granddaughter loved reading it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yarp",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on October 6, 2023",
                "reviewTitle": "great writing, pretty bad edition.",
                "reviewText": "First I think someone should correct the review below saying the book was separated, incase someone gets confused. The Hitchhiker's Guide to the Galaxy was of course a single volume to which there are four sequals with different titles, and of course there are editions which collect all five under the title of the first.The review doesn't seem to mention that the one he bought claimed to be a collected edition, but that research he suggests should lead most people to expect that if it is not mentioned to contain give books then you are getting the first book in a single volume (not \"separated\", but not collected with the others).I don't say any of this in mean spirit, just incase anyone misunderstands that review to assume the FIRST book was divided in five here.Anyway. the story is great :) excellent. possibly \"essential\" reading, and it seems to be all here. I bought the Mass Market Paperback editions of the original trilogy (OF THREE) published by Del Ray and, as I should have expected, they aren't so great. very thin covers, very narrow borders which make it a little uncomfortable to read and mean that where you have to open it so wide the spine probably won't last many readings as the books themselves seem to be made pretty cheaply.it's not terrible and not bad for half the price of the standard (much nicer) paperbacks, but if you want editions that will last to be read many times, I'd go for the pricier editions. I'm only deducting a single star as they're not terrible and of course the contents of the book are 5 star without question!If like me you are only interested in the first three books, then Gollancz has some nice (and not too chunky) hardback editions for around the same price as the current main paperbacks as part of their excellent SF Masterworks collection, and it seems they have just released a new edition of this first book in their latest style with new art, so I am assuming the other two will follow in the not-too-distant future. I'm going to return these flimsy paperbacks and collect these new Gollancz editions as they come out (but they are very unlikely to have either 'So Long and Thanks for All the Fish' or 'Mostly Harmless' in that same line, so if you're a collector type who wants them all uniform, best go for the nice paperback box set :) )",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}