{
    "remaining_requests": 1566,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/American-Science-Fiction-Destination-Conscience/dp/159853159X",
    "body": {
        "name": "American Science Fiction: Five Classic Novels 1956-58 (LOA #228): Double Star / The Stars My Destination / A Case of Conscience / Who? / The Big Time ... America Classic Science Fiction Collection)",
        "price": "$25.18$25.18",
        "originalPrice": "",
        "rawPrice": 25.18,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/American-Science-Fiction-Destination-Conscience/dp/159853159X",
        "soldBy": {
            "sellerID": "A2BZJ3OE7RA6B",
            "name": "SFBayGoodwill",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2BZJ3OE7RA6B"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61LJC5Kw1FL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Various",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Various&text=Various&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "SFBayGoodwill",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 26,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 16 hrs 8 mins",
            "$3.99 delivery February 23 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Library of America; First Edition (September 27, 2012)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 950 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 159853159X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1598531596"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.55 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.12 x 1.35 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#339,689 in Books (See Top 100 in Books) #135 in Science Fiction Short Stories #846 in Science Fiction Anthologies (Books) #3,618 in Short Stories Anthologies"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 26 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Isaac E.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3YI5OZD26Q7YHGO6XUHMEJPGSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LI5F9NQCW69R?ASIN=159853159X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2017",
                "reviewTitle": "5.0 out of 5 stars I also read \"double star\" and find that also is a great novel with some really nice and fluent narrative",
                "reviewText": "I bought this book mostly because I was looking for \"the stars my destination\" but it is impossible to get it in spanish. Just for that novel this book is more than worth the price, I also read \"double star\" and find that also is a great novel with some really nice and fluent narrative.I'll check out the rest of the novels later for what I already dear I can say that this book will not disappoint any science fiction fan.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM4RHMZU7Z3Y5ZIAQP45ULNGU3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FI77MHPT9Q27?ASIN=159853159X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2021",
                "reviewTitle": "5.0 out of 5 stars A nice hard cover book",
                "reviewText": "I was pleased that this book was a very high quality, good looking book for the price. I look forward to reading the short stories published in it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat Hauldren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT2JICJJJN25ZETHFMU65ZD4RZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34JK78NR3X997?ASIN=159853159X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2020",
                "reviewTitle": "5.0 out of 5 stars Timeless classics",
                "reviewText": "I'd read these stories before a very long time ago but did not own them. Now I do and I am very happy to have this collection on my bookshelf.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nerine Dorman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEST422ZHE4AHSHVS26JQMC3R2QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QIYEW3FB2DLS?ASIN=159853159X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2012",
                "reviewTitle": "5.0 out of 5 stars Encapsulates the spirit of an era",
                "reviewText": "Double Star by Robert A HeinlenLaurence, or \"the great Lorenzo\" might not admit it to himself, but he's a washed-up has-been of an actor not quite succeeding at eking out a living. That is, until he runs into a potential employer who isn't quite whom he appears to be. Soon Lorenzo is studying for the greatest role he's likely ever to play, and the stakes have become far higher than he expected. Heinlen explores the notions of the self in double star, and how one person quite literally becomes another. This is a story of personal alchemy, and the psychological changes the protagonist undergoes are far more vast than the ones that are merely skin-deep. Double Star is best described as a futuristic political thriller, and delivers a satisfying close leaving me with much to mull over.The Stars My Destination by Alfred BesterThis is yet another novel that I've heard much about that I'm glad I've had an opportunity to read. At the end of the day I'm a bit torn how I feel about the story, and need a bit more time to reflect on how everything fits together. Gully Foyle behaves more as an anti-hero rather than protagonist, though readers can't help but cheer for his efforts, I'm sure. He comes across a bit as an imp of the perverse, upsetting the cosmic apple cart in the process. He begins his journey at the bottom--a victim--but by the time the story draws to a close he takes on almost godlike proportions. Bester envisions an almost dystopian future, and the concept of jaunting is certainly a fascinating one with far-reaching implications. This story touches on a lot of sociological issues, and makes me think a lot of Ayn Rand's fiction for some reason. The telling itself leaves me a bit cold, however, as we're experiencing the world through an omniscient third-person viewpoint. This might, however, be my contemporary tastes coming into play, however. At an rate, The Stars My Destination is a powerful story that will stay with me for a long time.A Case of Conscience by James BlishIn this novel, Blish answers the question of \"What if there were sentient life on another planet?\" A thoroughly uncomfortable story that reprises the disastrous consequences of the Spanish conquest of South America, A Case of Conscience examines the repercussions of human contact on the planet of Lithia. All four scientists who numbered among the initial contact expedition to Lithia are changed. Our primary character is a Jesuit priest and scientist, Father Ruez-Sanchez, and the very basis of his faith is called into question by the inhabitants of Lithia, who possess absolutely no faith as a reason for moral guidance. A gift given to him by a well-meaning Lithian in turn has unintended consequences. At a glance, this story pokes at reason vs. faith, but at heart remains a cautionary tale about the dangers of subjective thinking. The world-building of Lithia is hauntingly beautiful, a kind of savage Garden of Eden. This is, as always, a difficult story to read, and one that can definitely lead to lively discussions.Who? By Algis BudrysThis is another story that's fascinating to read in the aftermath of the Cold War. Lucas Martino was a genius scientist working on a top-secret project near the enemy lines when things went awry, and he was horribly injured in the resultant explosion. This was exactly the gap the Soviets were looking for, and they picked him up, and patched him up. The only complication for him was that he was almost unidentifiable--much of him had become mechanical. Now he became a bone of contention between the two sides. The Soviet colonel Azarin doesn't want to let Martino return. What I appreciate about how this story is written is Budrys understands how to use the different viewpoint characters with their unreliable viewpoints to the best effect to create tension. Right up until the last, we are never entirely sure just *who* the mostly mechanical man is.The Big Time by Fritz LeiberThe last of the novels included in this collection, The Big Time is also my least favourite. To be honest, I struggled to keep up with the cast of characters, terms and settings. I also suspect the fault lies with the reader and not so much the author. That being said, Leiber does a fascinating job of mashing up different eras with his characters, and leaves me guessing the whole time with regard to what's actually going on. For some bizarre reason, I'm reminded of Anthony Burgess's A Clockwork Orange in the telling. Still, there is something enigmatic about The Big Time that I enjoyed, and I'm glad I read it.I'll be honest, I wouldn't ordinarily have picked up these novels on their own. When I was a kid I read *a lot* of SF. I didn't always *get* what I was reading (as in the cultural/historical contexts) but was nonetheless utterly fascinated by the imaginations of these classic authors. So, I'll admit that the idea to have five classic novels lumped together offered the incentive for me to bite, and consider reading these novels in clump to gain some sort of comparative perspective.On a very shallow level, I find it fascinating to see authors try to envision future technology. Now, many decades since these novels were published, things have turned out very differently. Small details, such as *how* we communicate, and how we store and retrieve information--I don't think many could conceive of these possibilities back then, and it shows.Sociologically speaking, there was so much emphasis on the implied threat of the Cold War, of capitalism vs. communism. Now, in our post-modern world, it's more the War on Terror that seems to have captured mankind's fixation. With Soviets out of the picture, we look with a wary eye toward China.What is also apparent to me, as both editor and reader, is how our language usage has shifted, especially when employing point of view within genre fiction. For that very reason, I did find some of these stories a bit more challenging than others.Another point of difference is how women are portrayed in SF. For some reason the discrimination didn't bother me as much when I was a teen exploring classic SF for the first time. But now, the lack of three-dimensional female characters bothered me.My final verdict: if you're a serious collector of genre fiction, or are looking to get stuck into a decent collection as a first intro, you can't do wrong with this selection. There's a strong cross-section, memorable characters and thought-provoking stories. I appreciated the ride very much and am glad I invested the time in the reading. I might not have gelled with each author's style as much, but sometimes there are reads that are important as snapshots of a particular zeitgeist, and this anthology says a lot about the hopes and dreams of the 1950s.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert Plautz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5MV6YNTHAPZPIEENAAHNC7VJTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z2B7X9YLPXS6?ASIN=159853159X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2013",
                "reviewTitle": "5.0 out of 5 stars five stars practically by default",
                "reviewText": "Editor Gary K. Wolfe has said that he collected these works (including those in the first volume) not as \"greatest hits,\" but rather to showcase the breadth and depth of this literary genre in the 1950s CE. For me as amateur lit consumer, I tend to trust that any editor selected for an LoA imprint will be more than worth her salt. Leiber's The Big Time had me wondering if I had to rethink this heuristic. But, as a loyal LoA fan(atic), I slogged through to the end. Lo! having \"got\" it, a second read-through had me shaking my head with that sense of wonder of the non-author as to how in Hades do they do such magics? End here with a nudge-nudge to the LoA people to hurry with a follow-up double-header from the 1960s CE.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Arp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH656XI7Q6BTYG5TWD47GW4A2DBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MSHAGSEAXDKA?ASIN=159853159X",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2021",
                "reviewTitle": "2.0 out of 5 stars Boring",
                "reviewText": "The story selection was boring. I thought, for example, the \"The Star's My Destination\" was a different story. This no doubt influenced my rating.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rose zimbardo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZKIAI3PZ3RSLIFAKXMVC62LWTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q5NIB2YQULVK?ASIN=159853159X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2013",
                "reviewTitle": "3.0 out of 5 stars American Science Fiction",
                "reviewText": "I cannot rate this because kit was a gift to my son, who is a Science Fiction enthusiast. I myself am not.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kayla's Reads and Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2QGEDRSNFIYR5GUDP6IHQYBLGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O7WU7LY21B3Z?ASIN=159853159X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2015",
                "reviewTitle": "3.0 out of 5 stars 3.5 stars",
                "reviewText": "*NOTE: This is my husband, Seth's review, as he is helping me catch up on my review pile.*3.5 Stars.While not an elegant title for a book, it is quite accurate. Once you crack it open you find quite a few stories in it. The running time on this book if you are going to read it from cover to cover is quite long. You’re looking at a little over 20 hours of reading, possibly more.The first story in this collection is Double Star by Robert Heinlein. It follows the life of a has been actor who takes on a role of a lifetime. Quite literally it seems. While slow paced, it has a knack of keeping you interested to find out what happens to ‘The Great Lorenzo’. Overall, the story seems quite credible for science fiction. It keeps away from anything too exotic like light speed travel and all the other staples of sci-fi stories like giant star ships etc. The only thing unrealistic about it is the presence if aliens on Mars, but as this was something written back in the 50’s it’s to be expected seeing as how practically all planets in the solar system were perceived as being inhabited. I give this story in the collection a 4/5.The second story in this collection is The Stars My Destination by Alfred Bester. This covers an alternate history where sometime after man began to colonize other planets in the solar system and the asteroid belt, they discovered how to teleport(jaunt). This has a huge impact on how the world economy works. Cities spring up in unlikely places. Roads are left in disrepair. Telepathy becomes a thing with some people as well. This story focuses on the life of Gully Foyle who is left to die in space only to eventually track down and get his vengeance on those who left him to die. This story is much faster paced than the last one, which was a nice respite. I give this one as well a 4/5.The third story in this collection is A Case of Conscience by James Blish. This one follows the story of three men contacting an alien race for man for the first time. They aren’t nearly as advanced as man is in some aspects of technology because the planet they evolved on didn’t have enough heavy metals to do much with. But they had managed to develop flight with what was available to them. The three men observe and collect information on the aliens up until they have to leave. Upon leaving they are gifted with one of the alien young to take back to Earth with them. While I enjoyed this story somewhat, it left me wanting more from it I think. I can’t explain what. Anyways, I give this one a 3.5/5.The fourth story in this collection is WHO? By Algis Budrys. This one follows a cold war scenario with more technology than was available in our history. A man who was thought to have been dead was brought back from Russia, but his identity can’t be confirmed because all his identifying characteristics have been replaced by mechanical items. No teeth, no fingerprints, even his eyes have been replaced. As such, he is under suspicion for the whole rest of his life on whether he is an American or in reality a Russian spy. I also give this one a 3.5/5.The last story in this long winded collection is The Big Time by Fritz Leiber. It covers something called the Change War. It follows an entertainer who is stuck outside of space and time along with several others. They ostensibly ‘entertain’ time travelers who combat different scenarios in history where things could have gone horribly wrong. To be honest, I thought it was a quite boring story and was just glad to be done with this collection. I give this one a 2/5.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jean Rosales",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 3, 2023",
                "reviewTitle": "Excelentes clásicos",
                "reviewText": "Como producto de la Library of America, es un libro de pasta dura con hojas de gran calidad. El tipo de letra es un poco más pequeño del que yo esperaba, aunque de todas formas es fácil de leer. Las 5 novelas son clásicos de la ciencia ficción, con la posible excepción de Who?, que sin embargo fue nominada al Hugo en 1959. The Stars my Destination no fue nominada a ningún premio en su momento, pero sin duda es una de las novelas de ciencia ficción más importantes de los 50's. Double Star, A Case of Conscience y The Big Time fueron ganadoras del Hugo en el 56, 59 y 58, respectivamente, por lo que tienen grandes méritos, sobre todo A Case of Conscience.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$19.93",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            }
        ]
    }
}