{
    "remaining_requests": 1670,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wanderers-Chuck-Wendig-audiobook/dp/B07N7LXVF9",
    "body": {
        "name": "Wanderers: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wanderers-Chuck-Wendig-audiobook/dp/B07N7LXVF9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41vM-VsyROL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Chuck Wendig",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Chuck+Wendig"
        },
        "brand": "Chuck Wendig",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6329,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A decadent rock star. A deeply religious radio host. A disgraced scientist. And a teenage girl who may be the world’s last hope. From the mind of Chuck Wendig comes \"a magnum opus...a story about survival that’s not just about you and me, but all of us, together\" (Kirkus Reviews starred review).Nominated for the Bram Stoker AwardNamed one of the Best Books of the Year by:The Washington PostNPR The Dallas Morning NewsKirkus ReviewsPublishers WeeklyLibrary Journal Polygon Shana wakes up one morning to discover her little sister in the grip of a strange malady. She appears to be sleepwalking. She cannot talk and cannot be woken up. And she is heading with inexorable determination to a destination that only she knows. But Shana and her sister are not alone. Soon, they are joined by a flock of sleepwalkers from across America, on the same mysterious journey. And like Shana, there are other \"shepherds\" who follow the flock to protect their friends and family on the long dark road ahead.For as the sleepwalking phenomenon awakens terror and violence in America, the real danger may not be the epidemic but the fear of it. With society collapsing all around them - and an ultraviolent militia threatening to exterminate them - the fate of the sleepwalkers depends on unraveling the mystery behind the epidemic. The terrifying secret will either tear the nation apart - or bring the survivors together to remake a shattered world.In development for TV by Glen Mazzara, executive producer of The Walking Dead Look for the sequel in 2022 Praise for Wanderers\"This career-defining epic deserves its inevitable comparisons to Stephen King’s The Stand.\" (Publishers Weekly starred review)\"A suspenseful, twisty, satisfying, surprising, thought-provoking epic.\" (Harlan Coben, number one New York Times best-selling author of Run Away)\"A true tour de force.\" (Erin Morgenstern, New York Times best-selling author of The Night Circus)\"A masterpiece with prose as sharp and heartbreaking as Station Eleven.\" (Peng Shepherd, author of The Book of M)\"A magnum opus.... It reminded me of Stephen King’s The Stand - but dare I say, this story is even better.\" (James Rollins, number one New York Times best-selling author of Crucible)\"An inventive, fierce, uncompromising, stay-up-way-past-bedtime masterwork.\" (Paul Tremblay, author of A Head Full of Ghosts and The Cabin at the End of the World)\"An American epic for these times.\" (Charles Soule, author of The Oracle Year) Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thriller-Suspense-Action-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159268011"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Action-Adventure/b/ref=dp_bc_aui_C_5?ie=UTF8&node=10159270011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "32 hours and 22 minutes"
            },
            {
                "name": "Author",
                "value": "Chuck Wendig"
            },
            {
                "name": "Narrator",
                "value": "Dominic Hoffman, Xe Sands"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "July 02, 2019"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07N7LXVF9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,594 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #67 in Action Thriller & Suspense Fiction #79 in Post-Apocalyptic Science Fiction (Audible Books & Originals) #170 in Post-Apocalyptic Science Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "T. Sparks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYX4N2Z3XFXKUMG5GMUZRXHMWBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXKA1V6ZJLORN?ASIN=B07N7LXVF9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2019",
                "reviewTitle": "5.0 out of 5 stars Thought-provoking, violent, and ultimately hopeful, Wanderers was a blast!",
                "reviewText": "It’s been years since I’ve read a book I would consider calling “epic,” and now Wanderers has finally checked that box. This book is epic in every sense of the word. The scope is mind boggling, the heady combination of future tech and a terrifying fungus plague provided hours of entertainment, the cast of characters is huge and diverse, and finally, Wendig’s vision of a possible future-end-of-the-world scenario scared me to death! Add in plenty of violence, a tantalizing mystery, and a chilling look at the future of politics in America, and you have a big, brash, ballsy book that, despite its blockbuster appearance, is well crafted and carefully thought out.And before I go any further, I have to mention that if you are a reader who reacts negatively to triggers—murder, graphic violence, suicide attempts, rape, torture, racial slurs, etc—then this book is probably not going to be for you. I think Wendig includes every single trigger out there in his story, which worked for me, but it’s not going to work for everyone. You have been warned.As for the plot, I’ll give you the bare bones version. One day in June, something strange begins to happen. A young girl named Nessie from a small town in Pennsylvania wakes up one morning and walks away from her home, barefoot and in her pajamas. Her sister Shana tries to stop her, but Nessie keeps walking, oblivious to her surroundings, intent on going...somewhere. It’s as if she’s sleepwalking with her eyes open. Terrified and confused, Shana decides to follow her, and by doing so becomes the first of the shepherds. Later, other walkers join Nessie as they inexorably make their way west, and Shana is joined by other shepherds, family and friends of the walkers who simply want to protect them.At the same time, a deadly fungal infection is starting to spread throughout the United States. Slowly at first, with only one or two cases identified, the CDC is brought in to try and stop it from spreading. The first symptoms of the disease are cold-like: stuffy nose and watery eyes, followed by the appearance of a white, powdery substance around the mouth and nose. Eventually symptoms similar to dementia emerge, and the afflicted person goes crazy. There is no cure, and preliminary calculations by scientists are alarming: the entire human race is at risk.Benji Ray works with the CDC and is brought on to help with the outbreak. Working with a predictive machine intelligence called Black Swan, Benji and Black Swan’s creator, a whip-smart woman named Sadie Emeka, delve into the mysteries of White Mask, the moniker for the disease. Are the walkers somehow connected to White Mask? And how does Black Swan fit in? As the ranks of walkers keep growing, and White Mask continues to spread, Benji and his team must find some answers fast—before things fall apart for good. Wanderers is a sprawling, multi-character story that takes its time developing. When the sleepwalkers start walking (and keep walking), you get the sense that this isn’t going to be a fast-paced, action-packed story. And in the beginning, it isn’t. Wendig has lots of moving parts that he not only has to introduce, but eventually connect together, and I thought he did a bang up job of it. The story never felt slow, even though it took some time to introduce all the characters, tell their backstories, and drop hints about what's going on. The mystery of the walkers isn’t revealed until way into the story, but that was OK, because there is so much good stuff that comes before that reveal. And by the time things go bad—and they do—you’re truly invested in the characters and what’s happening to them. That makes some of the less savory events even worse because you like these people.Wendig has always been open with his fans when it comes to his opinions about such things as social media, right wing politics, and other touchy subjects, and he definitely takes this opportunity to inject those opinions into his story. One of the characters is a thinly-veiled Trump-like presidential candidate who is trying to unseat a woman president in the upcoming election. Trump fans are not going to like this portrayal of far right values and political beliefs, although it certainly made for a fantastic—and scary!—story element. In the world of Wanderers, the United States (and much later, the rest of the world) is literally falling apart, and while Wendig’s story might seem fantastical and ridiculous, there is an eerie feeling that our society is heading in that direction, and maybe this should be read as a cautionary tale. (And aren’t all dystopians cautionary tales, after all?)Lots of reviewers are comparing this book to Stephen King’s The Stand, and for me it was the way Wendig wrote and developed his characters that most reminded me of King’s style of storytelling. He’s got nearly 800 pages to work on those characters, and by the end of the story I was practically yelling at the book when bad things started to happen to them. Some of my favorites were Benji, a black man who not only struggles for respect in his field, even after he’s proven himself, but his faith in God is also tested, as things start to go downhill and he sees how truly evil people can be. I also loved Marcy, a tough, ex-cop who suffered a terrible head injury on the job and now has a plate in her head. Marcy has a different reason for being drawn to the walkers and joining the shepherds, and boy she goes through a lot in this story! Oh, and I haven’t even mentioned Pete Corley, an aging gay rock star who nearly steals the show, or Matthew Bird, a mild-mannered pastor who is seduced by fame and fortune and gets caught up with the wrong people.There were a few things in the story that were never explained. Marcy has a special connection to the walkers that no one else seems to have, and I don't think the reason behind it was ever revealed. There's also a weird section near the end that had a Matrix-like, alternate reality feel to it. It does give the reader much more explanation about why the walkers are walking and where they're going, but it almost felt like the story took a weird turn into fantasy at that point. And I was confused by something that happened to Shana at the end as well. But honestly, these unexplained elements didn't kill the story for me, obviously. I'm still giving the book five stars and chalking it up to the mysteries of science!My review has barely scratched the surface of this book. There’s just too much to talk about without this evolving into a Wanderers-length book review. Bottom line: I loved this book, and I'm excited for Chuck's next one!Big thanks to the publisher for supplying a review copy.",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBN6YBWGXD4DXCBETMPOE2NDRPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3191VBXLLSKVL?ASIN=B07N7LXVF9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Gripping story",
                "reviewText": "I couldn't put this book down, even though it was at times a very heavy read. It was a story that had many plausible elements. It had me feeling so much dread, but I also enjoyed several of the characters quite a bit. Not a light read, that's for sure. Too reflective of reality to be an escape. It is very well written, and sheds light on the very real political divide in our country, as well as the effects of mass disinformation and ignorance.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMQ2MKNNNNAALEB3ZG5SGPCYD6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUJCHNK43YL12?ASIN=B07N7LXVF9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2023",
                "reviewTitle": "5.0 out of 5 stars absolutely awestruck",
                "reviewText": "This book blew my mind in a way no other book ever has. Wendig created believable characters, unforeseen plot twists, and a scarily realistic vision for humanity’s future. He called to light the impending issues of this Earth in a thrilling story, and I’m HERE for it. I highly recommend this book and I will immediately be reading the next one.The characters seem rich and true, and Wendig has a way of showcasing these people with just enough detail so that you feel you really know them, but without bogging the plot down. The way he intertwined everybody’s tales, tied up the story, and came to a very interesting and satisfying conclusion is just *chef’s kiss*.Thanks Chuck, you brought me 10 steps closer to being a bookworm again and I’m going to be so lost when I’m done with these stories.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jon Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJCMOWKT67P5QGAO5R6VG6BL3JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTNOYZK2Y0V3O?ASIN=B07N7LXVF9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 6, 2019",
                "reviewTitle": "5.0 out of 5 stars Definitely a modern day apocalypse novel that makes a person think.",
                "reviewText": "I had to sit back and consider this novel.To be honest, I caught on to what was going on until the last moment, but the story itself was exceptionally entertaining with caveats of lessons left behind that one hopes will not be glossed over in the mind of the reader.Is this a horror story?Yes.But the horror is sublime in that it is a story of what could happen all on its own. And therein lies the horror.Mister Wendig takes all that many ignore about our world and brings it out in all its glorious and darkest sights. It has everything we have today, mixed together in such a way as to create his particular horror.These are things, that could happen if just the wrong thing occurs on the worst possible day, with the worse possible people mixed in with it.And that's the horror.The science fiction elements are subtle throughout the story, although obvious in their showing in the book. And this is where Chuck Wendig truly shows his mastery of storytelling. He mixes it in so well as a part of the background among the people, victims and villains all in such a way as to create a truly grand showing of life.To give a modern day example, we saw this in Katrina and what happened after that hurricane passed over.We saw it with the insanity of Waco.We see it today in our news and politics.We see it in the good that people do, just casually carrying out their lives.We see the happiness we have in our pets.And yes, we see it with the love we have with each other.And the anger.Wendig has taken this, the modern day of the early 21st Century, with Internet included, and its social sites, and intertwined them in such a way as to give the reader the feeling of being involved, even as you witness the good and evil within the book.This is why I call it a masterpiece. And it should remain so for a very long time.I've heard people say that it's on par with Stephen King's \"The Stand.\"I respectfully disagree.It's today's own version of an apocalypse story.But as I said, the horror is much more subtle.It's when we go outside and look around us that one can see where the horror really begins.And we don't even need the science fiction within the story for it to happen.And why, after a person reads it, realizes that deep down, the horror doesn't end.And why I'll read the book again in the future.",
                "reviewVotes": "152 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Newm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 25, 2023",
                "reviewTitle": "Make time to read this, you won't want to put it down.",
                "reviewText": "The characters are wonderfully drawn, the science well-researched, and the plot keeps the reader on edge the whole way through.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Agustín GalvánAgustín Galván",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 27, 2019",
                "reviewTitle": "What a enjoyable end of our world!",
                "reviewText": "You will laugh, cry, fear, gasp, throw the book far away from you just to go running for it because you need to know what happens next.And also you will chill, and enjoy and have a nice time with all the characters, the story, the writer.A classic? Time will (surely) tell...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wd8v3JPZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xavier Hugonet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 30, 2019",
                "reviewTitle": "Apocalyptic story in a social media age",
                "reviewText": "First, let me put there that this is a great work.When confronted with something like a 800+ pages book, I always wonder if it will be worth the time invested. This one is worth it.This isn’t the first magnum opus I’ve read. As a matter of fact, many reviewers compare Wanderers with Stephen King’s The Stand. However, I do not think that comparison appropriate.Sure, both books have a large cast of well developed characters, with evolving motivations. Both show us a version of the apocalypse. But, the similarities end there.As great as it is, The Stand tells us a pretty straightforward story of a battle of good against evil in a post-apocalyptic world. Wanderers shows us the apocalypse unfolding through the eyes of its characters, and all isn’t black or white either.The first part of the book is pretty extraordinary, as Chuck Wendig put a lot of scientific research into it. We follow CDC teams trying to make sense of what’s happening, and we learn as much as we’re entertained. Sure, we learn about horrible potentially world ending diseases, but it’s still pretty fascinating. The supernatural has no place in this book.The second part can’t be commented in a spoiler free review, but let’s say that the story offers a fair amount of twists all along its 800 pages.Also, Wanderers was written in 2018. It’s an apocalyptic tale in a social media world. A world where populism rears its ugly head, and where some pretty shady politicians take center stage. Religion is present in it but, unlike how it is in The Stand, it’s not central to the story and the motivation of the characters. Religion is present in the book as it’s present in our society today.Reading the reviews first made me think I was going to read an updated version of Stephen King’s masterpiece. I didn’t mind (who would ?), but be assured that it ended up being something completely different.Finally, a 800 pages book needs to be a page turner or, let’s be honest, we never get to finish it. I’ve read it in four days. Chuck Wendig became that good at word slinging. Kudos, as well, to his publisher who, unlike what was done to Stephen King at the time of The Stand’s first release, didn’t ask him to trim down the page count.Treat yourself to this book. You’ll be in for a hell of a ride.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tennille",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 18, 2022",
                "reviewTitle": "Excellent story",
                "reviewText": "I’m not finished yet but really enjoying the storyline. Post apocalyptic fiction is my favorite genre",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Espinosa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 31, 2021",
                "reviewTitle": "Aproveché un gran descuento",
                "reviewText": "Compré este libro de pasta dura y 800 páginas ¡en menos de $200! Son de esas ofertas que no puedes dejar pasar, ya sea para uno mismo o para regalar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}