{
    "remaining_requests": 1655,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Infection-Essential-Post-Apocalyptic-Survival-Sympatico-ebook/dp/B01FYBBC2Y",
    "body": {
        "name": "Infection: A Post-Apocalyptic Survival Novel (Sympatico Syndrome Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Infection-Essential-Post-Apocalyptic-Survival-Sympatico-ebook/dp/B01FYBBC2Y",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81UN58yQyzL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "M.P. McDonald",
            "link": "https://www.amazon.com/M-P-McDonald/e/B003VL0TF6/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4075,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "For fans of Stephen King's The Stand or William Forstchen's One Second AfterThey weren't ready for the apocalypse but ready or not, it was coming...Faced with the very real possibility of extinction of the human race, Cole Evans has only one chance to save his family and survive — a safe haven on an isolated, hard to reach island. No one realizes there's a deadly illness spreading like wildfire until it's too late. With few symptoms, victims literally drop dead after a brief surge of energy. Within days, the virus tears through the population of the United States and the world. Can Cole convince his brother that the danger is real and that there's enough space for his family as well? And, can they all reach the island before the lights go out for them ... forever?Get this exciting post-apocalyptic thriller today. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01FYBBC2Y"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ MPMcD Publishing (August 12, 2016)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ August 12, 2016"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 931 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 270 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,170 in Kindle Store (See Top 100 in Kindle Store) #102 in Dystopian Science Fiction (Kindle Store) #138 in Science Fiction Adventure #140 in Post-Apocalyptic Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,075 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Swine Flu didn't scare former epidemiologist Cole Evans. Ebola didn't frighten him either. Sympatico Syndrome terrified him. The deadly virus was like if Ebola and the Spanish Flu had a baby and Sympatico Syndrome was the lethal offspring. It races through the population with the contagious of measles. With an over 95% mortality rate, the only way to survive is to flee to the most isolated place you can find. Given a few days advance warning from a former colleague, Ellie, Cole knows he must find a safe haven — and find it fast! For Cole, that's an isolated island a mile off-shore in Green Bay. His son, Hunter, is away at college halfway across the country, and what seems like an easy feat for him to get home soon turns into a harrowing nightmare of a journey. Cole's brother and his family live nearby, but convincing them that this virus is real and they must drop everything and get to safety before the virus infects them all is easier said than done. They aren't ready to give up their jobs, or home, and pull their kids from school on a vague warning from someone they have never met. Can he get everyone to safety in time?",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/6c23de61-88f6-48e6-bc2e-2b9b0272548a.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/6c23de61-88f6-48e6-bc2e-2b9b0272548a.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/38f74feb-e0f4-4a7f-8bf7-474577cf8660.__CR0,0,600,180_PT0_SX600_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGI5F5MGYTIJZLESQV5OQDJSMOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LNAC19CP60UQ?ASIN=B01FYBBC2Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent character driven book! A must read!",
                "reviewText": "Many of this genre are light on character development, but this book shines! You really get to know each of these human and deeply flawed individuals struggling to survive and hold themselves together despite their circumstances.I am excited to read the next installment once I have the funds to do so! Thank you to the author for making this available and for showcasing her talent!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara Avrams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYMZQD6RE57K5MXDRYL76L3JDDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4O1FWW39QZXJ?ASIN=B01FYBBC2Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars I liked the book",
                "reviewText": "It seems a bit too optimistic, but we shall see after reading the next in the series. I is a good story with lots of possibilities.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFPSMM2TQJSSBMBPUYE7H6ULK6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SK39WSP76M3Y?ASIN=B01FYBBC2Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Can’t put down",
                "reviewText": "Very well written and captivating. By the end of chapter 2, I was so involved with the characters I couldn’t put the book down. Everything flows and is so believable that you feel like you’re right there in the story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4OE5EP5LUJQBFYEFQM4ZOVJV7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GU0BXM7XVGF0?ASIN=B01FYBBC2Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent book!",
                "reviewText": "This book is hard to put down. It is fast paced, exciting, scary, informative and fun sad as well. Plan to start Book 2 tonight!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Skee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGRHVDR5CUOG5B2BE7YPVZ2QPBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AQDEESUIO548?ASIN=B01FYBBC2Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars recommend Infection",
                "reviewText": "This was a fast and easy read, engrossing and well paced. The parallel stories were cleverly interwoven. I recommend it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JimFoxy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6VUXVZBKQOYTKNKVV5N3IX7T5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYEPP3DA0JZCZ?ASIN=B01FYBBC2Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2018",
                "reviewTitle": "4.0 out of 5 stars Exciting Novel",
                "reviewText": "Infection: A Post-Apocalyptic Survival Novel by M.P. McDonald The subtitle pretty much gives the basic plot away. Like Stephen King's \"The Stand,\" or a myriad of others in this genre, a bio-engineered virus escapes from a government lab. In this novel, the reason for the escape seems to be carelessness or incompetence, not malice. But the end result is an infection that is 98% lethal, with an incubation period of perhaps weeks, few diagnostic symptoms prior to catastrophic hemorrhaging and death. Disease victims seem to experience euphoria and a desire for social contact. The latter effect s implied in the name, \"Sympatico Syndrome.\" Cole Evans, the main protagonist, is a trained epidemiologist with experience with the Ebola virus in the field. He is friends with Elly Johnson, who works with the Center for Disease Control (CDC), on temporary duty in Chicago. These two, plus Cole's son, Hunter, his brother's family, and three other survivors make up the tiny circle on which the book is focused.What I Liked: While the general plot is not original, to say the least, it is in the specifics that make or break a novel, since few are totally original. \"Infection\" handles the specifics pretty well. McDonald has crafted an interesting page-turner. The Sympatico Syndrome hits like a sledgehammer and spreads like wildfire. Even people who understand the principles of preventing viral transmission take the needed precautions too late. Cole and Elly are exceptions and Cole's family take his advice, even though it sounds crazy to them. They survive. One girl survives without special precautions, so she is apparently one of the 2% that have natural immunity. I liked the flow of the narrative, the dialogue, and the plot. It kept my interest throughout. Cole is a believable hero. No superman, he nevertheless has the leadership skills and knowledge necessary to ensure his own survival and save many of those close to him. Things I did not like: The editing was not great. Probably worse than average for a self-published book. It seemed to me that the plague spread incredibly fast. For example, Hunter Evans left his college campus and drove toward the island retreat. But within two days, even on remote farms, everyone was already dead and rotting. I don't think that this kind of rapid spread is possible. Two months, Yes. Two weeks, maybe. Two days, no. A great deal of space is spent itemizing the supplies Cole and his extended family packed into their rental truck. Of course, they thought they were packing for months of seclusion on an island. But tit turns out that in a couple of weeks, most people would be dead and the supplies of the nation are free for the taking. Since the author knows what will happen, I am surprised that she devoted so much space to the supplies that they packed. In contrast, Elly has almost noting but some masks and gloves in her hotel room, but she does fine by merely waiting a couple of days for everyone to die, then taking what she needs. Sheltering in place seems to be a viable option, particularly in this case. But in a more realistic situation she would have to shelter for months, and food would have been a real problem and possibly water, if the utilities began to fail. The novel is a rather linear plot of problems encountered, problems solved. The conclusion is merely the solution of the problem of getting the main characters to the island retreat. I would have liked to see a bit more character growth. I did see a bit in the case of Cole and his brother. Elly seemed to be amazingly unreflective. Her main emotion seemed to be fear mixed with stoicism. She does find the fortitude to kill a man in self-defense, which is a stretch for a person trained to save lives. But even in this crisis, she seems to not reflect on what she had to do, show remorse, or be greatly affected at all. I think a sort of mental numbness would be a defense mechanism, and is not unrealistic. I saw this in the Vietnam War. But too much numbness makes for an uninteresting story. Editing was not great. Yes, I know that professional editing is expensive. Yes, I know that even good editors miss some problems. But a thorough edit, focusing on comma rules, would help this novel greatly.Conclusion: I liked this book. It is not a deep, introspective study. But I have a weakness for stories of survival against impossible odds. Readers should be aware that this book is the introduction of a series, and does not resolve the root problem of how to survive in a post-apocalyptic world. It does not ask, much less try to answer, the deep questions that such a plague poses. But it does provide a diverting read, and perhaps that is enough.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "claudette valliere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKCJXG2UQWWIRS6VYEJF2OOFCFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H3BYI9KSF8NE?ASIN=B01FYBBC2Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2018",
                "reviewTitle": "5.0 out of 5 stars Thumbs up",
                "reviewText": "Damned good read. Spoiler alert.This one starts with Cole Evans getting a call from his old friend and colleague Elly Jackson. Jackson is in Chicago and works for the CDC. There is a new plague out there that turns people into happy partiers until they drop dead. Its been named Sympatico Syndrome and Elly will be trapped in Chicago on the eighteenth floor of her hotel. She will eventually make it out and meet a kid named Jake. A kid who is a survivor.Cole lives in lower Wisconsin and was in the Navy and is an epidimologist. He and Elly worked together in Africa fighting the Ebola plague. Cole retired from the nave to spend more time with his son Hunter who is in college in Colorado. Coles wife died so its just he and his son Hunter. Right now Cole will be heading to his brother Sean's house. He needs to let Sean know what going on and they all need to bug out to a island that their Uncle John left to Cole. The island should be safe.Sean isn't pleased with what Cole has to say but he knows if Cole is worried he and his wife Jenna should also be worried. His electrical business will suffer if Cole's warning turn out to be false, but if true he and his family need to bug out now.Both Sean, his wife and Cole head out to buy as much food, water, guns any and all gear as they can find before the rest of the population gets a clue about what is really going on.Hunter gets a call from Cole. Cole tells him to leave college now. Pack everything he will need to include food, water, clothes and anything else he might need. He tells Hunter to use the card he gave him. Hunter hates college but is good with his hands. He heads right out and gets everything he needs to include a bow, arrows but no gun. He is a good archer and things the bow and arrows will come in handy for hunting and self defense. Of course an arrow can't compete with a bullet but it is some form of self defense.Hunter will be making his way home by car as Cole, Sean, his wife Jenna and Sean's two kids Trent and Piper will be heading for the island. Sean rents a huge truck to haul all the supplies they bought. Cole told no one what he was doing because Elly told him if he did the food in the stores would be gone leaving Cole and his people without any way to feed themselves. Cole didn't like it but he knew it was the right thing to do for the safety of he and his family.So being a damned fine read.This one has Cole, Sean, Hunter, Jenna, Trent, Piper, a dog named Buddy, a girl named Sophie who Hunter saved, horses they use when the car is out of gas, an Elly and Jake using a boat to get across the great lakes, Cole, Sean and the family arriving on the island, a caretaker named Joe who joins them, the happy people who drop dead and Cole Evans doing his best to protect his family, wait for his son, survive and stay alive.Five Stars.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wooster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYOEIJJ6J2Q4SUQH5I6S7OVRCAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XS6K8RA3DLM7?ASIN=B01FYBBC2Y",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2023",
                "reviewTitle": "3.0 out of 5 stars Fairly Good PA Story: Pandemic",
                "reviewText": "A quick killing virus wipes out Chicago, Denver and the Midwest (we’re not told of what was happening in the rest of the country/world). The (dozen or so) main characters of the story struggle (in three different groups) to find their way to safety on a lake island in Upper Michigan.When I was reading this book, I kept thinking that this story seems a little juvenile (like it was probably written for teens and young adults). I'm old, but I kept reading to the end…..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "avie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 29, 2021",
                "reviewTitle": "Another great author to enjoy!",
                "reviewText": "This is really a can't put down book and at a time of lock down it is great to have a new author. You just hope it turns out well . Looking forward to the next book. Thanks so much for this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca Saunders",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 25, 2023",
                "reviewTitle": "Fantastic",
                "reviewText": "Loved this book , found it hard to put down ,and am ready to read any other books by this author .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin Hansen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 30, 2018",
                "reviewTitle": "Incredible fast paced book",
                "reviewText": "This book held me by the throat from the first page. I felt that I was with Cole, Sean and Hunter as they tried to escape and survive the horrific events unfolding around them. You can taste the fear on your tongue as the reader kept pacing and fighting with them to survive. So happy Elly met Jake and they survived also. Hunter and Sophie helping each other to make it alive. It ended with joy and a deep sadness. Must buy the next novel to continue the story, believe me, it’s that good.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 4, 2023",
                "reviewTitle": "😱",
                "reviewText": "Post apocalyptic story with a decent twist. It's not much like the others of the same genre.Really decent story line and not just all doom and gloom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elouise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 16, 2019",
                "reviewTitle": "Very good read",
                "reviewText": "Post apocalyptic tale that keeps you interested throughout. Riveting. Great descriptive prose, easy to read and picture what's going on. Liked it very much.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}