{
    "remaining_requests": 1682,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ferryman-Novel-Justin-Cronin-ebook/dp/B0B8GZ58DK",
    "body": {
        "name": "The Ferryman: A Novel",
        "price": "$13.99",
        "originalPrice": "",
        "rawPrice": 13.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ferryman-Novel-Justin-Cronin-ebook/dp/B0B8GZ58DK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71yW9s8oocL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Justin Cronin",
            "link": "https://www.amazon.com/Justin-Cronin/e/B001H6J17E/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 6725,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER • “Next to impossible to put down . . . exciting, mysterious, and totally satisfying.”—STEPHEN KING From the author of The Passage comes a riveting standalone novel about a group of survivors on a hidden island utopia—where the truth isn’t what it seems.A POLYGON BEST BOOK OF THE YEARFounded by the mysterious genius known as the Designer, the archipelago of Prospera lies hidden from the horrors of a deteriorating outside world. In this island paradise, Prospera’s lucky citizens enjoy long, fulfilling lives until the monitors embedded in their forearms, meant to measure their physical health and psychological well-being, fall below 10 percent. Then they retire themselves, embarking on a ferry ride to the island known as the Nursery, where their failing bodies are renewed, their memories are wiped clean, and they are readied to restart life afresh. Proctor Bennett, of the Department of Social Contracts, has a satisfying career as a ferryman, gently shepherding people through the retirement process—and, when necessary, enforcing it. But all is not well with Proctor. For one thing, he’s been dreaming—which is supposed to be impossible in Prospera. For another, his monitor percentage has begun to drop alarmingly fast. And then comes the day he is summoned to retire his own father, who gives him a disturbing and cryptic message before being wrestled onto the ferry.Meanwhile, something is stirring. The Support Staff, ordinary men and women who provide the labor to keep Prospera running, have begun to question their place in the social order. Unrest is building, and there are rumors spreading of a resistance group—known as “Arrivalists”—who may be fomenting revolution. Soon Proctor finds himself questioning everything he once believed, entangled with a much bigger cause than he realized—and on a desperate mission to uncover the truth. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B8GZ58DK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Ballantine Books (May 2, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 2, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 6556 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 530 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0593722647"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21,125 in Kindle Store (See Top 100 in Kindle Store) #191 in Dystopian Science Fiction (Kindle Store) #240 in Post-Apocalyptic Science Fiction (Kindle Store) #271 in Dystopian Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 6,725 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1744dda5-a166-436d-883f-cd2d2b0e201f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52920cb5-5433-42c2-b6e6-11474417c988.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f04536e9-ae5c-45e5-9b61-7181b25191a0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c35166fa-26a6-4caf-9dbc-fae7aed54954.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4909cb3e-2d6b-4199-81d6-0dac96c865a7.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jenny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXT7HVCFXBVHCC64WV3RCVY4VLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KNMXGRE77IDY?ASIN=B0B8GZ58DK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Like Floating in a Sea of Stars",
                "reviewText": "I love Justin Cronin specifically for his trilogy The Passage. When I saw he released a standalone I had to get my hands on it. The story follows our main character Proctor Bennett as he navigates Prospera. Justin Cronin has an amazing ability to build a world. I disagree with the readers that stated the book dropped off at the tail end. I felt the opposite I was gripped by the challenges the characters faced in their world and as they grappled changes being thrown at them left and right. There were moments that made me angry or frustrated with Proctor and isn't that just the sign of a great author? Cronin made Proctor come to life, and because of that you would get frustrated with his character. The ending had me conflicted but in the best way possible. Pick it up and you will not put it back down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Asheley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7HK4R3QRQ242BG3OLN2FWJFCVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GU5PKVCZ52ZW?ASIN=B0B8GZ58DK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Sort of like Inception, sort of like The Matrix",
                "reviewText": "At two places in this story, I had to regroup a bit because what I thought was happening wasn’t actually happening. Once you get about halfway into it, the story begins to feel like a cross between the movies Inception and The Matrix, which are some of my favorites-but definitely confusing. This was when the story started confusing me just as well, just a bit. There’s a lot of talk about what’s a dream vs what’s real, and if I let myself really try to understand every detail, I got bogged down. But this worked itself out by the end and there are great, discussable themes in here. Themes like social and class divides, climate, and the love we have for both our real and our found families. Most of all, I think I loved the different iterations of each character.I think Cronin did something special here. I need to go back and read his other work-this is my first book by him",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIX6YSXLC6335XK5D52LTBATEGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW6J6722ANQ8I?ASIN=B0B8GZ58DK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Really stuck with me and made me think",
                "reviewText": "This one stuck with me. First I liked the story, then about 2/3 of the way through the book it got really confusing and I was questioning whether I liked it or not. I kept going and closer to the end it was all cleared up and started making sense. By the time I finished I was back to really liking the story. I don't want to say why it was confusing since that would spoil it for others. I will say that you need to just keep reading. It is worth in the end.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPQOSMYPYRUV75BSAXVFADFFKFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZW364JZ9ENN1?ASIN=B0B8GZ58DK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "3.0 out of 5 stars Be prepared for a wild ride",
                "reviewText": "Justin Cronin is a good writer, but he tries to do an awful lot in \"The Ferryman\". The book begins like a typical dystopian novel set on a mythical island named Prospera. There are two classes: the aristocratic class and the worker class. The workers live on a different island connected to Prospera by a causeway. The workers serve the Prosperans as domestics, waiters, mechanics, etc.Proctor Bennett is a ferryman, one who is in charge of accompanying those who are too elderly to be viable Prosperan citizens to be \"reconstituted\". Maybe to come back as young adoptees to those aristocrats who want children. Well, it gets interesting when Proctor is assigned to shepherd his father to the ferry. His father gets upset and starts babbling things about the Oranios. It is only now that the reader finds that all is not as it seems in Prospera. Or anywhere else for that matter.Spoiler alert: We find eventually that Prospera only lives in the minds of those in stasis aboard a mammoth space ark named The Oranios. The Oranios carries 800 souls on a voyage to save humanity from extinction as a result of climate change. On board are not only the workers necessary for starting a new civilization on a habitable alien world but also the small group of financiers who made the Oranios and the voyage possible.Thus, we come to the problem: The Ferryman has a micro plot and a macro plot. We the readers are sucked into one and are traded off to the other. Complicated? Yes. Convoluted? A matter of opinion. To me, it is worth the read. The first plot is compelling. The second, not so much. The characters are fascinating. The book almost seems like an \"exercise\" in science fiction writing. Of course, the author is like the ferryman. In charge. The readers are like the working class. Just along for the ride.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Walter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCAJMWIGKTO6FE7VHGIZDRBPARA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MY3CAAFP7NYS?ASIN=B0B8GZ58DK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars A Bit Confusing But Worth It In The End",
                "reviewText": "I’m not a big fan of dream sequences in books, especially if they don’t move the plot along. I had to put that aside for this book once I realized what I was reading (which took a while but I’m glad I stayed with it). As Biggie famously rapped: It was all a dream!This book begins in a utopian civilization where everyone is happy and successful and unstressed. If that seems too good to be true, of course it is. You’ll soon find out why. But even that explanation isn’t the real truth because there’s yet another surprise. Wake up! There’s another one.The plot unpeels like an onion. And just when you think you’ve reached the core, well, maybe you finally have. If it all sounds esoteric, it was. But by the end, I got it. And was happy I invested 2 weeks into this epic book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mrsbo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGORGGW546TYH2W4XHUTTOEO4GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAVKW2OL6U5OD?ASIN=B0B8GZ58DK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars loved it as much as the passage",
                "reviewText": "I loved the Passage and didn’t even realize this book had come out. The sci-fi element is enjoyable and is often my hook, but Cronin just creates such endearing relationships and characters. Love this guys writing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chuck McDonald",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 19, 2023",
                "reviewTitle": "Fantastic novel",
                "reviewText": "Like the Passage trilogy, this book just grabs you from the beginning and doesn't let go until the end. I really enjoy Justin Cronin's writing style and character development and it's in full force here. It's a great feeling to invest time in a book and not have any disappointment when you finally put it down. Looking forward to what the author does next.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ziggy Nixon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 2, 2024",
                "reviewTitle": "Un voyage surnaturel et absolument mystérieux !",
                "reviewText": "Une expérience absolument délicieusement éthérée. J'étais à la fois fasciné mais aussi souvent inconfortablement incertain de ce qui était réel et de ce qui ne l'était pas. Le mystère est si fort que j'ai longtemps senti qu'il s'agissait véritablement d'une histoire à la limite de l'horreur, comme un cauchemar devenu réalité. Une superbe lecture qui m'a tenu en haleine jusqu'au bout !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shaun Hudson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 1, 2023",
                "reviewTitle": "New favourite",
                "reviewText": "As a world builder Justin Cronin is amazing, though its in the humane little moments where he truly shines, and no more so than in extended dialogue sections that feel alive, and entirely organic.This is the first book I've read of his, and am now moving onto his acclaimed horror trilogy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heinrichson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 27, 2023",
                "reviewTitle": "Die Faszination von \"The Ferryman\"",
                "reviewText": "\"The Ferryman: A Novel\" von Justin Cronin hat mich von Anfang an begeistert. Im Vergleich zur \"Passage\"-Trilogie von Justin Cronin, die ich ebenfalls liebe und wärmstens empfehlen kann, präsentiert sich \"The Ferryman\" in einem völlig neuen Licht. Während die \"Passage\"-Trilogie eher dem Horrorgenre zuzuordnen ist, betritt \"The Ferryman\" neue Pfade und zieht den Leser mit seiner einzigartig beschriebenen Welt in den Bann.Die Welt, die der Autor hier entwirft, ist äußerst fantasievoll und wunderschön beschrieben. Die Charaktere sind sorgfältig ausgearbeitet und ihre Entwicklung wird mit viel Detailreichtum dargestellt. Die Geschichte ist ein wahrhaftiges Puzzle aus Facetten, das immer neue Aspekte offenbart und den Leser in ein mysteriöses und spannendes Universum entführt.Die Erzählung hat eine faszinierende Art, den Leser in den Bann zu ziehen. Es ist, als ob nichts so ist, wie es auf den ersten Blick erscheint. Man taucht ein in die Tiefe der Geschichte und kann das Buch kaum aus der Hand legen. Ich konnte förmlich spüren, wie mich die Handlung in ihren Sog zog, und wollte unbedingt wissen, wie es weitergeht.\"The Ferryman\" taucht tief in die menschliche Natur ein und erforscht eine Vielzahl von Facetten – von Gier über Trauer bis hin zur Suche nach Sinn und Bedeutung. Die Geschichte behandelt diese Themen auf faszinierende Weise und gibt dem Leser Raum für Reflexion.Bis zum Ende hin bleibt das Buch ein wahres Juwel. Die Geschichte ist kunstvoll gestaltet, reich an Tiefe und Vielschichtigkeit. \"The Ferrymanl\" hat mich auf eine Reise mitgenommen, die ich nicht vergessen werde. Ein absolutes Muss für alle, die nach einer literarischen Erfahrung suchen, die sie in ihren Bann zieht und nicht mehr loslässt.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 17, 2023",
                "reviewTitle": "Nothing is as it seems",
                "reviewText": "The beautiful people live on an island paradise, enjoying long, fulfilling lives. Then they retire themselves and ride the ferry to the Nursery, where their bodies are renewed and their memories are purged, so they can begin a new life, innocent and refreshed.Meanwhile, average people, the support staff, inhabit a crowded, slum-like neighboring island.But nothing is as it seems.This beautifully written, thought provoking story, explores many aspects of the human condition; greed, grief, and the search for meaning. It's not an easy read: the book has a literary feel, explores heavy emotional terrain, and the author has created a many layered reality. So those seeking a quick escapist read might not be satisfied with this tale. However, others will be captivated by the beauty and wisdom of this story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}