{
    "remaining_requests": 1571,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Five-Years-After-Matherson-Novel/dp/B0BFFL5HQP",
    "body": {
        "name": "Five Years After: A John Matherson Novel, Book 4",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Five-Years-After-Matherson-Novel/dp/B0BFFL5HQP",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51cHdvl4raL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "William R. Forstchen",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=William+R.+Forstchen"
        },
        "brand": "William R. Forstchen",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1451,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From William R. Forstchen, the New York Times bestselling author of the One Second After series, comes Five Years After, a near-future thriller where John Matherson must contend with new threats to the fragile civilization that he helped rebuild.Five years after The Final Day, the Republic of New America has all but collapsed into regional powers and the world at large is struggling to remain stable as regional conflicts ravage the post EMP landscape. After several years attempting to lead a quiet life, John Matherson receives the news that the President is dying from a possible assassination attempt, and is asked to step in to negotiate with what appears to be a new military power hidden in the wreckage of the world.Pulled back into the fray, John struggles to hold the tottering Republic together. Facing threats on multiple fronts, he races against time to stop another EMP attack on the former United States and China, putting years of progress at risk. With so much of his work under threat, John must find the strength within to start over, so that he can save the country and the people that he holds dear from even greater calamity.A Macmillan Audio production from Forge Books. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Technothrillers",
                "link": "https://www.amazon.com/Technothrillers-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10497"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours"
            },
            {
                "name": "Author",
                "value": "William R. Forstchen"
            },
            {
                "name": "Narrator",
                "value": "Bronson Pinchot"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 22, 2023"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BFFL5HQP"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,371 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #11 in Technothrillers (Audible Books & Originals) #22 in Technothrillers (Books) #24 in Post-Apocalyptic Science Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dan Berger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLSC3ZESDAQWTZ3JNTDE7TUBU2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRKXU7RWJFXFO?ASIN=B0BFFL5HQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Unputdownable",
                "reviewText": "I'm glad to see another installment in this series, the granddaddy of modern American apocalyptic scenarios. Inspired by the government report of the threat of EMP strikes, it had the poor fortune to be released at the same time as the official 9/11 report, if memory serves. And no one paid attention.This saga spins a depressingly realistic forecast of what would happen if such an attack - a few nukes detonated high above the country - knocked down the entire grid, fried most electronics and plunged us back into the 19th century without warning.In the first three books we watch the massive die-off from starvation and lack of medicine, the battles against a now hostile outside, and the resourcefulness of those in a small North Carolina town struggling to survive and provide for itself.Century-old journals in the college library contain now-valuable plans for basic power generation. Some tech types discover early-generation computer equipment stacked in college basements didn't get fried and is salvageable, and work at booting it.Five years later, John Matherson is running the small Black Mountain college he used to teach at. The population and food supply have stabilized. Many people died during the starvation years at the outset and there are fewer mouths to feed. Meanwhile local agriculture has kicked in. Everybody farms now. The college teaches a core of Western-civ style liberal arts, but is mostly about practical skills.He's also vice-president of the New Republic, which is trying but not succeeding to restore Constitutional order.Forstchen has updated the scenario modestly, alluding to events that hadn't happened in the mid-2000s when he started the series, such as the COVID pandemic and the rise of China. We learn a little more about the disaster worldwide: which nations were struck, which weren't, and who benefited.Matherson and his second wife Makala, a nurse he met on The Day and now the town's chief medical figure, have a 2-year-old toddler. Matherson is still haunted by the memory of his daughter Jennifer, a diabetic who died for lack of insulin.Everyone grieves such losses. People generally have a new look, one familiar from photos of the Civil War era or the Depression - angular cheekbones and drawn faces, a look of having survived starvation that never really goes away.Matherson, called to the New Republic's headquarters - an underground Cold War bastion near Gettysburg - is stunned to learn another governmental power has survived all this time through the chaos, its power intact. What's up with that? And what are its plans?The earlier books focused significantly on Matherson's leading Black Mountain defense in the chaos after The Day.Now, that's less a priority. Matherson still has the militia, the core of which are his students. But Matherson has turned over command to younger people. Young people, with the strength to farm and fight, are the most valuable resource, and are adapting better to the world after the fall. Matherson knows he and other older folks see too many ghosts.He's more preoccupied here with the political and philosophical issues, as he struggles to preserve civilian government while confronting a general with greater strength and a chillingly realistic outlook. (And an unlimited supply of fine English cigarettes.)As he faced some chilling choices in earlier books, as he took the most difficult tasks upon himself for the sake of the community, he must now do that again, on a much larger scale.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wesley J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6HT74D26Q4ASP5I45J6AVI7TUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X1CJZUR0RSIP?ASIN=B0BFFL5HQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Lol, I'll be waiting...",
                "reviewText": "Great read! I hope the story continues, but we don't have to wait 5 years for the next episode... :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFDBDX65KEHXEUP63GXCYSILLQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K789KVAZZCP4?ASIN=B0BFFL5HQP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars Damned Good",
                "reviewText": "This tale took an unexpected turn. John Matherson took on people with more power and the intrigue was deep and thick. Overall, the EMP that started this series was a background fact, but not the center of attention. Good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott L. Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMVGUGENQJOSUODRBC3YM5UPP4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JE3LEM0YX9CE?ASIN=B0BFFL5HQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A great continuation of saga",
                "reviewText": "Very thought provoking addition to the EMP saga. In today’s world political situation this story could be very real. We will never know until…..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "david cater",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFJWBOGVYLL7RM5IR4JY6PW4P3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QJ9TH62NCYC7?ASIN=B0BFFL5HQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Worth finishing the series",
                "reviewText": "As good as previous books in series, enjoyed them all. All of them were thought provoking and enlightening. Doubt there will be another chapter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MSHusker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI76SCJMZKKROTWM3MRQM4XELIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IVR3DIOI11AT?ASIN=B0BFFL5HQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic Finale",
                "reviewText": "Wow what an earth shattering conclusion to the four book series. The rest of the series was well written. The book really is a political masterpiece.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raymond Ford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPGKDFFA6P243ZRVCOYW2KJAL5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BTPYOL92A0A1?ASIN=B0BFFL5HQP",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "3.0 out of 5 stars Not as good as the rest of the series",
                "reviewText": "I love this series of books. Great premise awesome writing characters are easy to connect with. I can't say enough about how much I love this storyline. But, this book feels like the author lived through covid and thought it was a good idea to add a man-made disease to his post emp world. If you crave more of the series it's OK but if you really love the story like I do, I'd suggest you read other/similar books like 48 hours. Great book written by the same author with a different take on almost the same idea.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KateTWales",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ6AOGQVDLHDRXZ7DSBLUP24BGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MTFFSM98GKO9?ASIN=B0BFFL5HQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "All of the books in this series are outstanding!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Corrie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 9, 2023",
                "reviewTitle": "Good book, felt too short",
                "reviewText": "If you're looking at reviews for this book you've almost certainly read the previous three in the series. In that case just get it, it's as good as the rest and a fitting end to the series. (although it certainly isn't a hard ending, the door is wide open for more installments to the series)My only complaint about this one is that it just felt too short. It felt like just as it was picking up it was already starting to wind down to the conclusion. It's probably best that the author leave us wanting more than drawing it out too much, but I could read another 10 books in this universe and knowing I have to wait potentially years for another left me sad.Good book, read it and head its warnings.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BC6915",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 26, 2023",
                "reviewTitle": "As USUAL...EXCELLENT",
                "reviewText": "I just had to read Forstchen's latest installment in the life of John Matherson. The first 3 books left me wanting more. Five Years After delivered an excellent thriller story with an unexpected twist at the end. It is a sad reality that western governments are stuck with their collective heads in the sand, while global elites work hand in glove with the WEF to \"reset \"the modern world, a world with one HUGE Achilles heel, ELECTRICITY, without it we are all thrown back to the stone age. Rest assured that these same governments are well prepared and supplied to survive any EMP attack while the rest of us are left to fend for ourselves. I hope that everyone reads \"The Matherson\" novels and hopefully open their eyes to the danger as well as the fact that no government will be coming to help us should the grid collapse.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Girard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 6, 2023",
                "reviewTitle": "Belle continuité !!",
                "reviewText": "Un beau plaisirs de retrouver ses personnages si attachants !!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 8, 2023",
                "reviewTitle": "Excellent book",
                "reviewText": "Very entertaining",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colleen  McIntosh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 15, 2023",
                "reviewTitle": "Love love love this series",
                "reviewText": "Highly recommend this entire series. If, you weren’t a prepper before reading it you’d become one imho. Very well written and laid out 8n terms of what could come to expect in this particular scenario.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}