{
    "remaining_requests": 1416,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Confluence-Linesman-Novel-Book-3-ebook/dp/B01COJUHFM",
    "body": {
        "name": "Confluence (A Linesman Novel Book 3)",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Confluence-Linesman-Novel-Book-3-ebook/dp/B01COJUHFM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81yeq1j1owL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "S. K. Dunstall",
            "link": "https://www.amazon.com/S-K-Dunstall/e/B00QRDSJY8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 900,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this captivating Linesman novel from the national bestselling author of Alliance, Ean Lambert finds himself caught in a dangerous fight for political power... The lines. Mysterious yet familiar: the key to controlling every ship in the galaxy. Once they were thought of as tools, but since linesman Ean Lambert discovered strange new lines in an alien vessel, they have become so much more—symbols of a power too great to ignore. While the Crown Princess of Lancia seeks to share the new technology, her father, the Emperor, has other plans. His latest political maneuverings seem to be tilting the balance of control to Lancia’s favor—a move that not all members of the New Alliance are looking upon favorably. As tensions mount, Ean and his former shipmates must unite to avert a disastrous conflict: the princess working within the tumultuous Alliance, Ean seeking the help of the impatient alien ships, and Ean’s close friend and bodyguard, Radko, embarking on a mysterious and perilous mission. But the biggest threat comes from an unexpected source. Someone is trying to take down the New Alliance from within—and will use anything, even the lines themselves, to ensure its destruction...",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01COJUHFM"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Ace (November 29, 2016)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 29, 2016"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 969 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 402 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#259,576 in Kindle Store (See Top 100 in Kindle Store) #2,074 in First Contact Science Fiction eBooks #2,264 in Exploration Science Fiction #2,664 in Space Opera Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 900 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sherry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3DXCKQLETLRPTINAKDS25A7ZZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R333P82T2ZCOG9?ASIN=B01COJUHFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars More Line Twelve please!",
                "reviewText": "I just finished re-reading all three books in the Linesman series and the only thing I can say is “More Line Twelve please!”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Normal Human",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZ2LUPZWVKUSUM3CSWAZDFRCFPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PDFAEWRVJZHJ?ASIN=B01COJUHFM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2019",
                "reviewTitle": "4.0 out of 5 stars Good except for the romance",
                "reviewText": "The plots are intricate and even though we switch perspectives a lot, I never found it confusing and always knew who was speaking and where they were. The emotional througjlines between lines and humans are good and I like where this series is headed vis a vie non-human intelligence.[MINOR SPOILERS] However, both the romances are very poorly written. The super savvy princess is in love with her established father figure is a gross trope, and the dynamic is almost Anne Mcaffrey-like in its cringe factor. It also doesn't fit with any of the rest of the book. Politically, it would be a terrible idea to marry your fleet admiral. He's already established as her father figure (the ages are unclear, but it was mentioned previously that he basically raised her) but making him into her lover reeks of the \"men and women can't be friends without sex\" trope which is one of my most hated.The other pairing is politically ok, but not great ssecurity-wise. They also don't really earn it. Like, they definitely spend a lot of time in the same room together and they've each saved each other's life, but besides some weirdly jealous glaring when someone else is called his girlfriend, it was not foreshadowed at all. (Jealousy as an indicator of love is also one of my least favorite tropes). The fact that she has been contractually obligated to almost never leave his side for 3 books makes it feel kinda stockholm-y too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mabg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAWAXEYKUGM5BW6B5OCEMXZQE2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LRQDER3NW4US?ASIN=B01COJUHFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2021",
                "reviewTitle": "5.0 out of 5 stars a fast-paced, confidently written story",
                "reviewText": "with lots of action to draw the reader along, and an interesting setup with the line ships. The characters are appealing, especially Ean (though he’s a Very Nice guy and far too virtuous to be real), and he’s definitely balanced by Jordan Rossi. Rossi is an odd character—both a thoroughly nasty person and an excellent linesman who’s always responsible about his work. I was surprised that neither Sale nor Radko had smacked Rossi down for calling them “Sweetheart.” They are tough competent women and I would have expected them both to cut him off at the knees.At any rate, I enjoyed the series and will look for the authors’ other books.SPOILER BEGINSI also didn’t understand the lack of sanctions against Rossi after he attacked Ean. Ean could have been killed and yet the officers said barely anything about it and certainly didn’t punish Rossi for it? That was just not believable to me. First off, if Rossi had killed or badly injured Ean, the New Alliance would have no one who could move the alien fleet or interpret between the fleet and the New Alliance government. Second, this inaction undermined Ean with the trainees even worse than Rossi’s snide little comments already had (and I have no idea why those were tolerated either). It was like everyone just said, “Oh that’s just Rossi being Rossi,” and let it go. Did not make sense to me at all.SPOILER ENDS",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara Elness",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYACBORJHMSPMR7ZV5U7GX6NCQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32JPIXHF2HW2R?ASIN=B01COJUHFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2017",
                "reviewTitle": "5.0 out of 5 stars Fantastic SciFi Adventure",
                "reviewText": "What an awesome conclusion to a fantastic trilogy, but I’ve heard there may be more in the Linesman universe, so I’m keeping my fingers crossed. Ean is still learning as he works with the alien lines and teaching more linesmen how to communicate with them. The New Alliance is threatened by their enemies, but then there is suspected treachery from within. Ean’s friend and bodyguard Radko is sent on a mission to purchase a report with information on linesman experiments, which turns into a much bigger issue. Then there is the arrival of Emperor Yu, with his best friend in tow. All of Yu’s political intrigue is interfering with the progress Princess Michelle has made for Lancia with their allies in the New Alliance. When someone tries to steal one of the smaller alien ships, things become even more dangerous, and some of the new linesmen trainees seem to be causing dissent as well. It will take all of Ean’s shipmates on the Lancastrian Princess and especially Ean, to get through this uncertain time and find the threat from within. I loved this series - the outstanding world building, the wonderful characters, and all of the action kept me reading nonstop. I really hope there is more because I’ll certainly be happy to jump on it as soon as I get word that it is available.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary K. Swanson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL73XZBHSIFGOZP3YYQGHQID7QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RRYU4C0U1YOP?ASIN=B01COJUHFM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 23, 2017",
                "reviewTitle": "5.0 out of 5 stars The Best of the Series, But Read Them All",
                "reviewText": "The final book in the trio was the best written, as I might expect, and I felt it really wrapped up the story in a satisfying way without making future books impossible.I read all three of the Linesman books in less than a week. What drew me forward was the evolving story of the ship lines and the development of character relationships--a slow build toward understanding and trust that is completely different from so many stories where people bond into a team for no perceptible reason.Political intrigue is a theme, as well as developing self-confidence and strength. The main character is a classic engineer/programmer/savant, completely immersed in his work, but is kind and caring when he interacts with others.There are no sex scenes, but there are a couple of very slow burn romances I enjoyed. The violence is not graphic, though it has an impact.Scenes and dialog are well-written. There are very, very few copyediting issues, (none that I noticed), and the writing is practically transparent. I love that. These books are all about story.As others have commented, the female characters in this story are strong, whether they are good guys or bad guys. I was a little surprised to find a future with emperors and planets on which women are merely partners to men, but the narrative voice disapproved of those, so it didn't reduce my enjoyment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 7, 2018",
                "reviewTitle": "Wonderful ending",
                "reviewText": "This was a wonderful ending to a great series, one I highly recommend. The only downside is that there isn't another book in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 15, 2017",
                "reviewTitle": "Enjoyable continuation of a very good series",
                "reviewText": "I have just re-read the three books currently in this series. This author is now on my automatic buy list. Really enjoyable continuation of the current story arc. I am pleased to note some of the plot developments that happened in this book (I am a closet romantic, so these pleased me) and the obvious need for more books to finish the story off. I really enjoy visiting this universe and the books are still as enjoyable to me as the first time I read them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.A.SPRIGGS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 6, 2023",
                "reviewTitle": "Another great book",
                "reviewText": "This is such an excellent series. The world building is seamless and the storyline unique and imaginative. I loved the concept and the author's wrote a story that kept me engaged until the very end. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A1",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 16, 2019",
                "reviewTitle": "enjoyable and quite unique storyline",
                "reviewText": "enjoyable and quite unique storyline, bought sequels",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 16, 2017",
                "reviewTitle": "Very satisfying ending.",
                "reviewText": "Wonderful conclusion to one of the best new sci-fi stories out there. Kudos to the Dunstall sisters! Very satisfying ending. Keep writing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}