{
    "remaining_requests": 1399,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Spice-Must-Flow-Novels-Visionary/dp/0593472993",
    "body": {
        "name": "The Spice Must Flow: The Story of Dune, from Cult Novels to Visionary Sci-Fi Movies",
        "price": "$14.99$14.99$13.50$13.50$14.99",
        "originalPrice": "$18.00",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Spice-Must-Flow-Novels-Visionary/dp/0593472993",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81mfTPwfCNL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ryan Britt",
            "link": "https://www.amazon.com/Ryan-Britt/e/B019ZZN9MQ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Little Naks of Gifts and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 22,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Lively and entertaining… Britt’s book should appeal to “Dune” aficionados and newbies alike.” —Associated Press\"A gripping guide to the past, present, and future of Frank Herbert’s science fiction epic. Britt traces Dune’s journey to ubiquitousness, from its humble beginnings with an automotive repair manual publisher to its flurry of adaptations by the likes of David Lynch and Denis Villeneuve. The Spice Must Flow also interrogates why Dune endures, with Britt advancing a compelling argument that Herbert laid the groundwork for strains of feminist and ecological science fiction yet to come. Exhaustively researched and entertainingly told.\" —Esquire“This is quite simply a remarkable book…there may be a more comprehensive book about the Dune novels and films, but for right now, this book ranks number one.” —Booklist (STARRED REVIEW)\"[E]ngaging and timely...full of the fan joy and insider knowledge that readers want.\" —Library Journal (STARRED REVIEW)“Britt provides an entertaining crash course on Frank Herbert’s Dune series…The result is a riveting testament to the saga’s enduring appeal.”—Publishers Weekly\"The Spice Must Flow takes a daunting wealth of subject matter and makes it an accessible, illuminating read that never lets you get lost in the sands.\" —Mashable\"A wonderfully enjoyable companion guide to Dune... Touching on everything from the nonfiction magazine article that was the earliest version of Dune, to the turbulent attempts to adapt the novel into a film, Britt also gives welcome space to how Herbert’s sandworm-populated, drugged-up sci-fi saga serves as 'an ecological guide to the future.'\" —HeatMap\"Excellently researched, pulling on not just many historical articles and interviews, but also brand-new interviews with all three Paul Atreides’ (Timothée Chalamet, Kyle MacLachlan, and Alec Newman), directors Denis Villeneuve, John Harrison, and Frank Pavich; and many more members of the Dune universe... this book is the perfect gift for yourself or fellow Dune fan!\" —Dune News Net\"A comprehensive, hugely enjoyable study of the entire history of Dune... [A] humor-filled but deeply respectful approach to Herbert and the universe he created.\" —Film Stage“A deep dive into the Dune-iverse that is a compelling achievement. Ryan Britt gets down to the granular level, giving usa sandworm’s perspective of the planet we love. Kull wahad!”—Kyle MacLachlan About the Author Ryan Britt is the author of Phasers on Stun! and Luke Skywalker Can’t Read. His writing has appeared in Esquire, Vulture, StarTrek.com, SyFy Wire, Den of Geek!, Inverse, The New York Times, and Fatherly, where he is a senior editor. Excerpt. © Reprinted by permission. All rights reserved. 1Frank Herbert's BeardThe real-life origins of Dune.To begin your study of the life of Muad'Dib, then, take care that you first place him in his time.-Princess IrulanDespite how many times Herbert has described his leap from nonfiction article pitch to epic science fiction novel, that pivot still seems bonkers. Imagine a struggling essayist-behind on IRS payments, in need of steady work-saying to themselves: \"Oh, I couldn't sell this very specific newspaper article to anybody, and my agent hates it. Maybe I'll just turn it into the greatest sci-fi novel of all time instead.\"Herbert didn't use those exact words, but that's effectively what happened. And, based on his history of making grandiose statements early in his life, you can almost imagine him saying something close to this ridiculous. On his eighth birthday, he told everyone he was going to be a writer, and by nineteen years old, he had landed a job as a journalist in Southern California, working for The Glendale Star. The story of Frank Herbert's success is very much a study in \"fake it till you make it,\" but it did take him a while to make it.It's hard to pinpoint an exact moment when Dune began. Was it when Herbert was born? Was it at his eighth-birthday party? Or was it, as many Herbert experts have claimed, when he met psychologists Ralph and Irene Slattery in 1949? These are the two people who introduced him to the work of Carl Jung and got him into Zen concepts. Without those two things, you don't have Dune, so really, they must be the most important people in his life, right? What about the moment he was discharged from the navy, early in 1941, for medical reasons? That's got to be it! Had Herbert served longer in the navy, everything would have been different!Or maybe none of those things matter. If Dune does one thing remarkably well, it's that it makes the shape of our lives seem like the opposite of an accident. For all the prescient paradoxes that Paul finds himself in (am I remembering the future, living in the future, or just way too high?), the themes of Dune seem to prove that fate doesn't exist and that destiny is still a choice. At some point, Herbert decided he wanted to write about sand dunes. And that started in the summer of 1957, with Frank Herbert, in the air.Frank Herbert was flying high above the coastal town of Florence, Oregon, staring down at sand dunes, keenly interested in observing the crucial feature of these specific mounds of sand. Although their advance was glacially slow, these dunes were in fact moving. Like Paul Atreides riding in an ornithopter, surveying the desert of the planet Arrakis for the first time, Herbert wasn't the pilot of this aircraft, but rather, a passenger of a small Cessna. He'd chartered this plane for the specific purpose of observing these unique dunes because he planned on writing a sprawling nonfiction article about the phenomenon, titled \"They Stopped the Moving Sands.\" This ambitious piece of journalism was destined to fail and be reborn as the greatest science fiction novel of all time. But as the thirty-six-year-old Herbert leaned out of the small plane, he couldn't know his future. All he could feel was the wind in his hair and bits of sand blowing through his beard.Or maybe not. We don't know how much sand Herbert got in his beard that day, because we don't really know how big his beard was at that moment. In fact, he'd started wearing a beard less than a year prior. Today, Frank Herbert's beard is part of the defining image of the author, but it became his self-described \"trademark\" only much later. In 1957, it was a new part of his image, an intellectual affect he was trying out, partly to appease a German book publisher. Frank Herbert's agent, Lurton Blassingame, believed that \"readers in Europe expected writers to have beards,\" and so, in 1956 Herbert grew a beard specifically for an author photograph on the German edition of his speculative submarine novel The Dragon in the Sea. Throughout his correspondence over his entire life, there are several instances of Herbert's complaining about intellectual and artistic \"poseurs.\" Like Elvis wearing leather or MC Hammer pants, one part of Herbert's enduring image began as a pose. He didn't grow a beard because he was a beatnik intellectual at heart. He grew it because he wanted to seem that way. From beneath a famous mustache, Kurt Vonnegut once said, \"We are what we pretend to be, so we must be careful about what we pretend to be.\"Frank Herbert started pretending to be Frank Herbert right before he had the first imaginative spark that became the fire that lit up Dune. From the start of his professional fiction-writing career in 1945, with a short-story sale to Esquire, to 1963, when \"Dune World\" was first serialized in Analog, Herbert published over twenty stories and countless nonfiction articles and essays. According to most photographic evidence and eyewitness accounts, Frank Herbert did not spontaneously sprout his now-famous huge, bushy beard as soon as Dune was published in book form in 1965. Like those slowly advancing sand dunes, that huge beard became part of his legend gradually. By the 1970s, he was the messiah of Dune, but in 1957, he was an eccentric guy chartering a plane for a nonfiction article he hadn't even sold and would in fact never sell. When we think of Frank Herbert today, we think of a visionary novelist, not an absent-minded freelance essayist, willing to blow grocery money on an airplane rental to get a bird's-eye view of some sand and the plants with which it battled. Historically, the more heroic and professorial Herbert is the one that stuck: the jolly wizard, the man who created a specific blend of fictional spice that many of us crave, savor, and perhaps even need to survive.In fairness, this retroactive visage of Herbert isn't a phenomenon limited just to him. When it comes to deceased white male novelists, these are the two types available: with facial hair and not. You don't see a lot of clean-shaven images of Charles Dickens, and the thought of Mark Twain (or Vonnegut) without a mustache feels somehow wrong, and maybe a tiny bit obscene. While some male authors remain slightly immune to this phenomenon, for the most part, if an author is a man, white, and dead, his facial hair becomes part of his immortal visage. In 1920, Herbert wasn't born with this beard, and in 1984, just two years before his death, he shaved it off completely. In between these moments are the deserts and oases that make up his entire life. He was a journalist, an inventor, a gardener, an ecologist, a political theorist, a lecturer, and a father. But for most humans, that multifaceted person doesn't really exist. It's hard to picture this energetic thirty-six-year-old guy leaning out of that plane in 1957. Envisioning the older Herbert, the thoughtful author, is easier. In terms of the never-ending retrospective of Herbert's lifework, that younger version of him isn't just unbearded; he's basically faceless. Frank Herbert's entire life can be reduced to one simple fact: He was the guy who wrote Dune.The ghost of Frank Herbert is probably fine with this lack of nuance. After all, many authors are widely known by only one book, as though their entire lives were just a series of events manipulated by fate to get them to put those words on the page. We think of Herman Melville (another giant beard) as the person who wrote Moby-Dick, even though in his lifetime, nobody really liked that book. What makes Herbert's status as the real-life messiah of Dune singular is that he basically elucidated this exact kind of historical revisionism, step by step, in his Dune novels. \"The man must recognize the myth he is living in,\" Herbert said in 1969. \"One of the threads in the story is to trace a possible way a messiah is created in our society, and I hope I was successful in making it believable.\" For most critics, writers, artists, and fans, Herbert's entire life is just a way to talk about how he made Dune. And at some point, Herbert cultivated that perception, while his most famous books showed how the tricks of historical revisionism and reduction works.The first Dune is remembered for many things, but its structure, in a sense, is a dual biography of a fictional messiah. On the one hand, the book takes us through a conventional third-person story about a fifteen-year-old named Paul Atreides, who, by the end of the novel (spoiler alert!), becomes emperor of the universe. But layered alongside the present-tense story are hints-mostly in the form of faux-historical epigraphs-of a distant future in which the truth of this tale will become scripture. As a biographer, Princess Irulan doesn't tell us that Paul will become the messiah; she assumes you already know. This framing mechanism is uniquely brilliant because it allows Herbert to doubly immerse the reader in all sorts of narrative tricks. Just as Conan Doyle created Dr. Watson, a cipher through which we understand Sherlock Holmes, or Fitzgerald needed Nick to bring Jay Gatsby to life, Herbert crafted a future-tense religious status quo to make his science fiction world seem more explicable. This move also changed the way the reader glimpsed the adventure. Instead of wondering what was going to happen next, most of us, without even noticing, turned the pages of Dune to discover why things ended up the way they did.And so, in charting the entire journey of Dune, from its origins in the mind of Frank Herbert to the most recent incarnations of this fictional universe in new novels, and on screens large and small, the myth of Frank Herbert can't be fully separated from the \"truth\" of his \"real\" life. Like Paul, Herbert was just too damn good at blending mundane truth and outlandish myth. We can try to pull apart the moments in the story that don't make sense, but the glue of Herbert's self-made myth is shockingly strong. A full biography of the man would perhaps be more accurate, but it would also distract us from the myth in which he lived: the idea that he was destined to become the bearded messiah who created Dune. In other words, we can't talk about the history of Dune by pretending like the myths of the present don't color our perception of the past. The existence of Dune seems to travel back in time to a point where Frank Herbert hadn't even created it yet. This isn't literally true, of course, but what's fascinating about the life of Frank Herbert is that even before he wrote Dune, he was clearly getting ready to write Dune. Princess Irulan tells us that the reader should remember that although Paul was born and raised on Caladan, he's from the planet Arrakis. In all myths, there's a before and after. And knowing the after part almost certainly obscures our objectivity on the stuff that happened before.\"Six years of research had preceded the day I sat down to put the story together,\" Herbert said in 1984. \"The interweaving of the many plot layers I had planned required a degree of concentration I had never before experienced.\" Objectively, six years feels roughly correct. However, in 1969, in one interview, Herbert claimed he'd been obsessed with sand dunes for \"fifteen years,\" going back to \"'53.\" If this is true, the earliest research for Dune would almost certainly involve an even younger, and almost certainly unbearded, Frank Herbert. But overall, his self-woven myth tends to stay consistent with 1957, because that's the point in time in which Herbert seriously researched what would become Dune. That's when he chartered that plane, and that's when he started asking his agent to help sell the article: six years before the first installment of \"Dune World\" was published in Analog. Frank Herbert may have become obsessed with sand dunes in 1953, but the legend of the creation of Dune begins in 1957.\"The idea came from an article-I was going to do an article, which I never did-about the control of sand dunes,\" Herbert explained in 1969. \"What many people don't realize is that the United States has pioneered in this, how to control the flow of sand dunes, and it started up here at Florence, Oregon. . . . I got fascinated by sand dunes, because I'm always fascinated by the idea of something that is either seen in miniature and then can be expanded to the macrocosm.\"Soon Herbert turned that obsession, complete with its beautiful analogy, into a sales pitch. At the time, Herbert was entirely freelance and without a steady job. And, like many desperate writers trying to provide for their families, he was pitching wild, big ideas before he'd written anything. To his agent, he framed the possible nonfiction exposé as a human-interest story, chock-full of surprising earth science.\"The small Oregon coastal town of Florence is the scene of an unsung victory in the fight that men have been waging since before the dawn of recorded history,\" Herbert wrote to his agent on July 11, 1957. \"The fight is with moving sand-with the dunes.\"The concept, as Herbert saw it, was an untold journalistic tale of the triumph of science and human ingenuity in concert with a harmonious grasp of the natural world. Although the sand dunes were moving slowly, if left unchecked, over time these dunes would cause desolation, which, at the time, had been well documented in Asia and other parts of the world. Like climate change itself, you don't see the slow advance of one changing element causing damage and death. But it will happen eventually.So the victory Herbert was referring to was that a research station run by the US Department of Agriculture had figured out how to prevent all this impending chaos: by literally halting the advance of sand dunes. Historically, this had never happened before. In the Sahara, and elsewhere, human life had a hard time surviving, in a traditional sense, because of the slow and deadly march of sand dunes. But what the dry-land ecologists of the USDA south of Florence had determined was exactly how to stop the dunes from moving, by planting a specific type of poverty grass, known as Danthonia spicata. This grass essentially fought the sand dunes and stopped those dunes in their tracks.As his son Brian later pointed out, in 1957, Herbert's background in ecology was borderline nonexistent. Again, the myth of the writing of Dune has taught us that Frank Herbert was immersed in cutting-edge ecological theories, but the truth is, before this moment, he knew \"comparatively little about the complex ecosystems of deserts.\" And his interest in the USDA project wasn't something he sought out on his own. Herbert was tipped off by a former colleague who had worked with him on a political campaign in Oregon. Just before fighting to write an article about grass beating back sand, Herbert had been a speechwriter for the Republican candidate Phil Hitchcock, a former member of the Oregon senate, who had run, unsuccessfully, in the 1956 primaries to become a US senator. Had Herbert's gig as a political speechwriter for Hitchcock continued, there's every reason to believe he would have never had the downtime or inclination to check out the USDA dune project. If Hitchcock had been elected to the US Senate, Herbert would have been retained as a speechwriter, since he would have been partially credited with making that election a victory. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 48 mins",
            "FREE delivery March 2 - 9 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 6",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Geek-culture expert Ryan Britt takes us behind the pages and scenes of the science-fiction phenomenon Dune, charting the series' life from cult sci-fi novels to some of the most visionary movies of all time. Using original, deep-access reporting, extensive research, and insightful commentary, The Spice Must Flow brings the true popularity of Dune out into the light for the very first time. With original interviews with the beloved actors and directors behind the films—including Timothée Chalamet, Kyle Maclachlan, Denis Villeneuve, Patrick Stewart, Rebecca Ferguson, Alec Newman, and many more— The Spice Must Flow also examines the far-reaching influence of Dune on art, music, politics, and, most notably, its status as the first ecological science-fiction story specifically concerned with climate change. Britt skillfully and entertainingly guides readers through the history of how the Dune universe has unfolded, including the novel’s unlikely evolution from a failed piece of journalism about Oregon sand dunes into an epic science-fiction story, the way Herbert’s work inspired George Lucas, untold stories from the 1984 David Lynch film, the knife-edge balance between blockbuster hit and indie film Timothée Chalamet brings to the 2021 movie, and the exciting future of the franchise. Through a blend of narrative, oral history elements, and fascinating trivia, The Spice Must Flow is the new essential guide to the behind-the-scenes story of Dune. The fiction of Dune is deadly serious, but the real-life story of how it came into existence is full of wonder, surprises, and spice. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Humor & Entertainment",
                "link": "https://www.amazon.com/Entertainment-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=86"
            },
            {
                "name": "Movies",
                "link": "https://www.amazon.com/Movies-Entertainment-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Plume (September 26, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 288 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593472993"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593472996"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.76 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#106,014 in Books (See Top 100 in Books) #29 in Science Fiction & Fantasy Literary Criticism (Books) #55 in Science Fiction History & Criticism #300 in Popular Culture in Social Sciences"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 22 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5bb56b97-bc65-49c4-ac5b-f9d5ff973f1d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2440e83-34ef-4087-99dc-4feab80ad7d6.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/907a5de9-f123-4a01-87b9-6ab96a99d1a9.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e9e0fafb-0555-4dce-b9ea-d7bd3701e785.__CR0,0,300,300_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Man of La Book",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJ6HRHDMONUH5CE32QV4ECNW5QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20HG84UH9UUJ?ASIN=0593472993",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Great Book Even if you didn't read Dune",
                "reviewText": "The Spice Must Flow: The Story of Dune, from Cult Novels to Visionary Sci-Fi Movies by Ryan Britt traces how Dune became the phenomena it is, from books to TV shows and films. Mr. Britt is a “geek-culture expert”, writer, editor, and teacher.Even though I’ve never read Dune by Frank Herbert, I did enjoy the movies and show. I tried to read the book but was unsuccessful. However, I know that eventually I’ll get there.In The Spice Must Flow, author Ryan Britt examines the influence of the beloved series in all forms of media. Art, music, politics, extended universe, and the inspiration it provided to such luminaries as David Lynch and George Lucas.Mr. Britt had access to many people for this behind-the-scenes look. The leading actors of the shows and films, as well as those in the publishing industry. Mostly, however, Dune has been one of the first successful works of art concerned with ecology and climate change.It is obvious that the author is very dedicated and excited about the book’s subject. He is also a good and enthusiastic writer that kept my attention without going on tangents or supplying too much fan-service. He does not judge the works in any media form, even the books written by Herbert, his son Brian Herbert, or Kevin J. Anderson who continued the series.The book looks at the sci-fi market, the green movement, publishing, studio politics, as well the characters in the book. I enjoyed this book as a well-written, informative guide to the Dune universe in all its form.One does not need to be a fan, or have knowledge of any of the stories before reading this book, even though it will certainly help. If you’re looking for an insightful crash course before delving into this huge universe, this will do it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D&S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC2QLLP7BA6FSBOUFLLJHNZKZDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROZ9PJH8TP3TC?ASIN=0593472993",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Loved it!",
                "reviewText": "The Spice Must Flow@ryan BrittLoved this!Ryan has written a book that appeals to me on multiple levels. First, it’s a well constructed book that has the feel of a biography or documentary. The key though is that Ryan makes it very accessible. It’s not overly geeky… just geeky enough. It’s not overly pedantic … but shares trivia in more of a journalistic form.The second level was how he revealed whole new levels of understanding for me. Now I’ll admit, I came to Dune via Lynch’s movie… then read the book. Maybe that makes means I’m not eligible to be a true fan. But Ryan helped me feel included, welcomed. His enthusiasm for Herbert’s book was infectious not snobby.But I think it was the honest and convincing explanation of how the book came to be written and its subsequent revisionist interpretations. I found that fascinating.All in all… loved the book. Happy @bookmattic persuaded me to read it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen's LibraryKaren's Library",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLSMQWBCMAAKOKZIIORED5ZYLOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32POEKKMS36LH?ASIN=0593472993",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Perfect for the Dune-Obsessed!",
                "reviewText": "I’m not a big reader of non-fiction, but I am Dune obsessed. I’m always looking for articles that are anything Dune related, and I’ve read every Dune book (all 26 of them) several times. I’ve read Dune itself maybe 20 times throughout the decades. I’ve watched the Dune movies (both the 1984 and 2021 versions), and the 2 miniseries, so many times I couldn’t begin to tell you how many times.I love Dune. I love everything related to Dune. I think I have something like 7 or 8 editions of just Dune, not counting how many editions I have of Dune Messiah, and Children of Dune.So when I picked up Ryan Britt’s The Spice Must Flow, I was in Dune heaven. So many tidbits I had no idea about from how Dune came to be in Frank Herbert’s mind, to how each movie came to be made (or not made in most cases). There are wonderful interviews with many of the stars cast in the movies and miniseries. So. Much. Dune!!If you enjoy Dune, I highly recommend The Spice Must Flow for all of the behind the scenes extras!*Thanks so much to Plume and Penguin Random House for the gifted early copy!*",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/713IwX3-tZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Crane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX6QNNZEL3GR7O5KIU5VEJSBCSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R326X5HB76UJPE?ASIN=0593472993",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book!",
                "reviewText": "Very well-researched and put together. Easy read, with an engaging style. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERKOMC3WBJDLG6EAXCEPLQ7YO3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1M3ZOS2QXIIXH?ASIN=0593472993",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Engaging and entertaining history of Dune and the road to becoming a pop culture fixture",
                "reviewText": "In The Spice Must Flow: The Story of Dune, from Cult Novels to Visionary Sci-Fi Movies (2023), Ryan Britt has written an engaging and entertaining history of Frank Herbert’s Dune and the winding road it has taken to become a pop culture fixture. Its clever chapter titles and charming tone make for an enjoyable read. Weaving interviews with analysis and humorous commentary, Britt brings together a wide range of materials to explore the history of Dune, and he manages to make the feat look effortless!Thirteen chapters cover the different stages in the life of this famous science fiction story, from its origins in Frank Herbert’s imagination to the new adaptation and beyond. There are fun tidbits about things such as how Duke Leto and Lady Jessica emerged from characters that had been more dull in Herbert’s earlier drafts, the importance of cover art to audiences, and what George Lucas thought about spice in Star Wars. Insightful lines include “Just because something was a science fiction movie, crafted by an auteur, and possessed striking (or goofy) production design does not mean that movie was good” (pg 119)—is this a reference to the unmade Alejandro Jodorowsky project, the David Lynch film, or something else? You’ll have to find out!A clear fan of science fiction more broadly, Britt leverages his knowledge to pop in references to other media and draw connections between various points that readers may not have made themselves. He brings a contemporary perspective to the story and isn’t afraid to call things out when necessary. His strong and personable writer’s voice—especially in some cheeky footnotes—breathes life into the story, even when the facts are familiar.With the new film adaptation by Villeneuve re-awakening interest in Dune, Britt offers an entertaining and insightful look at the history and possible future of this still-relevant novel and its offshoots. Britt’s book will appeal to a wide range of audiences, from devoted fans of the novel to those who have just heard about it enough to be curious what the big deal is. Hopefully this convinces them it’s a must-read that’s still going strong! Thanks to Britt for providing me an advanced copy as a thank you for doing an interview with him.[This is an excerpt of my full review on the DuneScholar website.]",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}