{
    "remaining_requests": 1531,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Deadlands-Novel-Victoria-Miluch-ebook/dp/B0BMHYGXZ3",
    "body": {
        "name": "Deadlands: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Deadlands-Novel-Victoria-Miluch-ebook/dp/B0BMHYGXZ3",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/716nvLOXcjL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Victoria Miluch",
            "link": "https://www.amazon.com/Victoria-Miluch/e/B0C37Z5M87/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 3001,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From debut author Victoria Miluch comes the riveting story of a girl on the cusp of womanhood living in an arid wasteland and the encounter with two outsiders that upends her understanding of the world beyond it.Only the most hardened survivalists can endure living in the scorched deadlands of the former state of Arizona. Among them is nineteen-year-old Georgia Reno, who lives in an isolated desert settlement with her father and younger brother. Roads don’t exist here; visitors are more dark fairy tale than reality.But when two mysterious strangers arrive on their land, Georgia begins to question her sheltered existence. Soon, her tentative curiosity blooms into a fledgling desire to leave the settlement, even if it means venturing into a world her father has only ever warned against.As their tenuous situation deteriorates, Georgia uncovers secrets about the visitors that could threaten her family’s fragile existence in the desert. But to leave the newcomers at the hands of her father could put everyone’s lives at risk—and force Georgia into an impossible decision.Welcome to the deadlands, where survival is never guaranteed…and loyalty is put to the ultimate test. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BMHYGXZ3"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (October 1, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 1, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 6328 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 254 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1662511280"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#71,129 in Kindle Store (See Top 100 in Kindle Store) #534 in Women's Literary Fiction #587 in Coming of Age Fiction (Kindle Store) #789 in Dystopian Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.6 3.6 out of 5 stars 3,001 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/540b8829-164a-4c9f-8c55-2995ec83cbfa.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kimberly Wiedemeier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO56NEXG3NFRLNA74BSPUJZYT3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZGA5I6RX1E3J?ASIN=B0BMHYGXZ3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars mysterious and wholly engaging",
                "reviewText": "Excellent read that builds in suspense, with a provocative and thoughtful ending. I’m a sucker for metaphorical writing styles and Miluch is a master: “My skin the sand, my breath hot wind, the thuds of my feet the pulse of the planet churning forward mutely, drying to dust and dirt.”",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Becky Wells",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW2UZ5JASRHPGZN2Y3S7GNGW6GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37CWMVPA2DL1F?ASIN=B0BMHYGXZ3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2023",
                "reviewTitle": "3.0 out of 5 stars Just OK",
                "reviewText": "I kept waiting for something to happen. It's a slow slow slooooooow build, all the while it's becoming more and more obvious at least one thing we are building toward. Then it happens, and goes on for a couple more chapters, then it's over. At first the endlessly long descriptions of what the main character is thinking and feeling are interesting, haunting. Then it just feels like inaction. There are glaring incongruities throughout the story. A twenty year old woman who spent her entire life knowing less than six people, survivalists in a desert settlement, has dreams of the ocean she's never seen or experienced? She doesn't know what mustard is, but she knows what a hot dog is? She's experienced nothing social ever, but has no trouble with long conversations with strangers, reading their facial expressions, and even intimacy. The story ends up not being about \"the story\". It's just about the girl, which again, is confusing and incongruous and inconsistent. Her part of the story personalized it for sure, but the action, the things that she was reacting to, just never developed, and then they just cut off without resolution. It was really disappointing, because I liked Victoria Miluch's writing a great deal. Deadlands just didn't come together well.",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tim Patterson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSGVNELPD62GHJZDSZC4PH2TA4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IBGY4STLF8S5?ASIN=B0BMHYGXZ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars lost in the future desert",
                "reviewText": "I couldn’t put this engaging dread future story down. I felt the dryness of the desert, the heat of the day and the strangeness of the scenario as seen and felt from the perspective of a teenage girl. Beautiful writing, vivid descriptions and a plot that kept the pages turning. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vienne Suzette",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI6OZJKWOO3MSCNAJL2GFKTQF4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R7JAQ559GVAP?ASIN=B0BMHYGXZ3",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2023",
                "reviewTitle": "2.0 out of 5 stars Too long and drawn out",
                "reviewText": "I did read all the way to the end, but it was a struggle. If I’d have given up on it, I would’ve given it only one star. I wouldn’t recommend this book. It just seemed like a long drawn out nothingness. Here’s one quote from the book: “The day feels distended, strange and endless. It feels like we’ve been here for days, for years, like we’ve always been here.” p167 of 250. That’s how it felt reading it, too! Here’s another example of the writing: “The longer we walk, the farther away we get from Dad, not only by miles but by a unit of measure that’s deeper and more ancient. It’s as though eons have passed since we’ve left. As though millions of tectonic plates have collided to make mountains, followed by millions of floods that eroded those mountains away. As though generations of brachiopods and fanged fish and giant plodding mammals have lived and reproduced and died, have decomposed into the dirt and left only shells and bones behind, hard minerals replacing soft tissue, lying buried until people unearthed them and put them in museums, sweeping clean a slate for another billion years of the same thing happening, events repeating into a future I can’t see, even in this wide expanse, this endless horizon of desert. Sometimes it feels like that, like we’ve moved from one geologic period to the next and there’s no trace of anyone we’ve left behind left on Earth.” P 231 of 250 Again, that’s how bad it felt reading this book, too. If you can enjoy reading that type of description for 250 pages, maybe you’ll like this book.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5OX5Y65Z3ZWX64D7QAGMIX3PMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M96BUH12YAWZ?ASIN=B0BMHYGXZ3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Survivors or Hostages?",
                "reviewText": "Georgia's family lives in the Deadlands - the only inhabitants of a deserted settlement in what used to be Arizona. Georgia knows no other life than this one - one where her father rules both her and her brother, telling them what to do, what to think, how to feel. Then outsiders appear, a journalist and her husband looking to write a story on the original settlement. The facade Georgia has lived with is starting to crack, and she can almost see an alternate path - one not created by her father. But these are the Deadlands, and there's no way out...Part apocalyptic, part coming of age, part mystery, this novel heads in several different directions all at once. Some of the pieces of the puzzle make more sense than others, but most of them move us towards what is eventually an inevitable conclusion. My biggest complaint are all the loose ends left - the book ends rather abruptly and little is explained.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bonnye Reed Fry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLT2B7PVEJFXVCM4HXIMHOZOYPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REBSNI7E1VDSU?ASIN=B0BMHYGXZ3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "3.0 out of 5 stars Too close to home",
                "reviewText": "I received a complimentary electronic copy of this novel from AmazonPrime First Reads, author Victoria Miluch, and publisher Lake Union Publishing. Thank you all for sharing your hard work with me. I loved the writing style of Ms. Miluch, and adore most referrals from Lake Union Publishing, so was really zipped on this novel despite the title. Born and raised in the high plains deserts of New Mexico, I did not realize just how dystopian this read was going to be. I took several stabs at it and really did try, folks, but could not finish. Sorry. I'm sure it's a good tale and told well, but it's too close to my reality to allow myself to be absorbed in it. I will try again, in WINTER.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EricP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7XLIVTZQPNXDNSY5CRJMEJUESA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R1AOYK0YCBXD?ASIN=B0BMHYGXZ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "5.0 out of 5 stars The writing style draws you in",
                "reviewText": "Quite an interesting storyline. I found the writing style to be a draw, as well. The detail describing the Arizona terrain, the beauty of the barren desert, the noises that fill the air. It's like you are there experiencing the story in person. No spoilers, but the few characters there are just come to life as you read. Quite a unique experience I've not encountered in quite some time.As the story starts, you may wonder what's happened to the world. What is the whole backstory here. Some questions are answered as you read; some aren't. Left me feeling a bit unsettled, but not in a bad way. It's like your first roller coaster ride when you think... I'm not sure what just happened, but I am sure I want to do that again!If you like futuristic, quasi post-apocalyptic reads, this will certainly entertain.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judivii ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "Weird story",
                "reviewText": "Weird story that didn't really lead to a conclusion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 16, 2023",
                "reviewTitle": "Stifling and atmospheric",
                "reviewText": "This book is set in a mid-future beset by heat, climate refugees and a variety of ways of addressing these. It's not about that though, that is the background for one young woman's story. Georgia lives in the Deadlands with her father and brother. Having watched a documentary about cult leaders on the weekend, I couldn't help but compare her father with a cult leader. The beginning of the book is compelling, the writing tight and descriptive and the menace starts to creep in. The middle is a little slow, but also atmospheric and claustrophobic. I kept wondering how a setting where they were always outside could feel so hot and close. I loved the ending. Despite the heavy topics this book is not hopeless about humanity's future, or the things we are doing and not doing to try to limit the damage we are doing.I somehow got this book both an an Amazon First read and from NetGalley. I must have loved the description both times I read it, and it did not disappoint.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 16, 2023",
                "reviewTitle": "Bystander Protagonist, Flaws in Logic, Loose Ends",
                "reviewText": "I really wanted to enjoy this book. I found the scenario interesting, and I loved learning about how the characters lived. There's also some great descriptions along with a very well-developed writing style.That being said, there was very little plot. The inciting incident seemed to happen around the protagonist rather than to the protagonist. Even in the ending, it was other characters that resolved the climax, and the protagonist really just felt like she was along for the long, slow ride. Additionally, the protagonist has absolutely zero personality. I couldn't help but feel like maybe the story should have been recast from a different perspective.There were flaws of logic throughout the book. Things like what the character would realistically know or not know, or the fact that the paranoid Dad wouldn't think to quarantine someone he thought for sure was sick.Nothing was shocking or surprising in the book, and in the end, there are so many loose ends.Finally, a pet peeve, the author spells things out in a few places and treats the readers like they are dumb. I hate when authors connect the dots for us instead of letting us, with our own intelligence, realize it for ourselves.It was an interesting book, and I would have rated it 2.5 if I could. It just really fell short for me and didn't reach its full potential. I don't think I would read a sequel, though I may try other future novels as the author gets more experienced with writing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chimneyman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 14, 2023",
                "reviewTitle": "Rather inconsequential",
                "reviewText": "Although this book held my attention to the end, I didn't really feel that it had anything important to say about its subject matter. The plot lines, and especially the reactions of the two strangers, were barely plausible but I think they served their purpose well enough as hooks on which to hang the story of the survivalist family's dynamics.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie Gall",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 11, 2023",
                "reviewTitle": "Bit of a slow burn",
                "reviewText": "Would like to have had an epilogue from Wulf's POV. Interesting depiction of where we are heading. Reminded me of the old movie 'lost in the desert' at times",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}