{
    "remaining_requests": 1363,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Network-Effect/dp/B084QBWBSV",
    "body": {
        "name": "Network Effect",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Network-Effect/dp/B084QBWBSV",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51O0P-GJ2ZL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Martha Wells",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Martha+Wells&search-alias=audible"
        },
        "brand": "Martha Wells&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 22894,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Martha Wells' New York Times and USA Today best-selling Murderbot series exploded onto the scene in 2017, and the world has not been the same, since.Murderbot returns in its highly anticipated, first full-length stand-alone novel, Network Effect.You know that feeling when you’re at work and you’ve had enough of people, and then the boss walks in with yet another job that needs to be done right this second or the world will end, but all you want to do is go home and binge your favorite shows? And you're a sentient murder machine programmed for destruction? Congratulations, you're Murderbot.Come for the pew-pew space battles, stay for the most relatable AI you’ll listen to this century.I’m usually alone in my head, and that’s where 90-plus percent of my problems are.When Murderbot's human associates (not friends, never friends) are captured and another not-friend from its past requires urgent assistance, Murderbot must choose between inertia and drastic action.Drastic action it is, then. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "12 hours and 47 minutes"
            },
            {
                "name": "Author",
                "value": "Martha Wells"
            },
            {
                "name": "Narrator",
                "value": "Kevin R. Free"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 05, 2020"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B084QBWBSV"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#209 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Hard Science Fiction (Audible Books & Originals) #5 in Hard Science Fiction (Books) #5 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michael Lynn McGuire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV2C7F5C3SWNVJAYRZOU7ORTWYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V7I4GYMRVDO7?ASIN=B084QBWBSV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Book number five of a seven book series of science fiction novellas, short stories, and novels",
                "reviewText": "Book number five of a seven book series of science fiction novellas, short stories, and full length novels according to the publishing date. However, this is book number six of the seven book series according to series chronological date. I reread the well printed and well bound hardcover published by Tor in 2020 that I bought new from Amazon. I purchased the hardcover since it was cheaper than the trade paperback at the time. The series won the 2021 Hugo for the best series. I have all seven books in the series and am reading the seventh book now.Dr. Arada really wants Murderbot to stop calling hostile people \"Targets\". But, Dr. Arada is a terminal optimist. Murderbot is providing security for Dr. Arada's latest planetary survey when they are held up for food and ransom by a gang in a large boat on a water world. Dr. Thiego was attempting to negotiate with the Targets when the leader shot Murderbot. Murderbot seems to always be the first to get shot. And the last to get shot. As Murderbot resolves the situation, they launch their vessel from the ocean, and join the tractorship in orbit. They return to the Preservation system but are kidnapped almost as soon as they emerge from the wormhole by a unknown spaceship and are dragged back into the wormhole to an unknown system.Murderbot is a SecUnit, similar to a T-800 Terminator with a cloned and severely modified human brain. The brain is supplemented by the AIs in the cpu embedded in its head. There are lungs, there is a blood mixture with a synthetic, there is human skin over the entire body, there is a face, there is hair on the head and eyebrows. Everything else is machine. Somehow, the blood is enriched with electricity as there is no stomach or intestines. But, there are arteries and veins to keep the skin and brain alive. It has a energy gun in each arm and several cameras. The SecUnit can sustain severe damage to everything but the head and still survive.There is a personal MedSystem that continuously monitors the health of the SecUnit and gives constant updates to the SecUnit. And controls the clamps on the various arteries and veins throughout the torso and extremities of the SecUnit in case of damage. And shuts down the SecUnit in case of total system failure. Or reboots the SecUnit if needed.There is a personal SecSystem that has a threat awareness module that continuously updates the SecUnit on any and all threats it perceives. And monitors and controls up to thirty drones.There is a Governor that monitors what the SecUnit is doing versus the current orders (verbal or embedded) and punishes it using pain sensors in the human brain until it complies. And the governor will fry the brain of the SecUnit when if it leaves the vicinity of the controlling authority or the controlling authority leaves vicinity of the SecUnit.Murderbot is a self named SecUnit due to an unfortunate circumstance with 57 miners on a remote moon. It has hacked its governor and no longer allows the governor to give it orders or inflict pain. It prefers to internally watch its 35,000 hours of downloaded media such as episodes of \"The Rise and Fall of Sanctuary Moon\" and \"WorldHoppers (aka Stargate)\". Even though it has a face, it does not like to interface with humans, yes, very introverted. It will follow human orders if it sees fit to do so.Murderbot is an incredibly interesting character. It handles horrible situations easily and personal interactions difficultly. Like I said, interesting.Quotes from the book:1. \"I am actually alone in my head, and that’s where 90 plus percent of my problems are.\"2. \"Anyone who thinks machine intelligences don’t have emotions needs to be in this very uncomfortable room right now.\"3. \"There is a lot about what is going on here that I don’t understand. But I am participating anyway.\"Warning: There is violence and death in the books. Books one through four are a series of novellas, not regular length books. Book five is a regular length novel, book six is back to the novella, and book seven is a full length novel. You can buy a collection of the first four hardbacks at a nice discount.There is a free short story \"Home: Habitat, Range, Niche, Territory\" between books four and five.My rating: 6 out of 5 stars",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Harmeling",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXWPZUNUSRJYI6IORGTYHSWUBTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R9DJZYJRPLAK?ASIN=B084QBWBSV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars LOVE this series!",
                "reviewText": "I love this series of books! Murderbot is, like the rest of us, just trying to figure out life and get through each day albeit while dealing with more life and death situations than most of us. While the stories are set in interstellar space, we can all relate to the struggle of communicating and interacting with people, though Murderbot does it with more sarcasm and snark than the average human. Highly relatable characters and a great read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Keymer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEGAEX7UAR7F44D4GMV5UQZJZBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P49RVK0BYC4Q?ASIN=B084QBWBSV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2022",
                "reviewTitle": "4.0 out of 5 stars I LIKE IT",
                "reviewText": "This is the fifth entry in the Murderbot Diaries series. At 350 pages, it seems to be the only full-length novel in the series. The previous four were novellas, 172 pages or less, as is a subsequent book, Fugitive Telemetry (2021), which came out last year. Network Effect won the 2021 Nebula, Hugo, and Locus awards for best science fiction novel, and the Murderbot Diaries series won a Hugo in 2021 as best series. The only book in the series that I’ve read is this one. I picked it up on the basis of an approving comment from a reviewer I respect –Michael Dirda?- who praised the series’ treatment of its alien protagonist.The protagonist is the narrator. Murderbot. It’s a cyborg, an amalgam of human and manufactured parts, produced as a Security Unit, owned by a corporation or individual who bought it just as you might buy an inanimate object –a lawnmower, for instance-- or just as slaveowners bought their slaves not all that far back in our history. The Unit’s owner can order it to do anything the owner wishes as long as it doesn’t conflict with a few basic pre-programmed prohibitions. Units aren’t seen as persons. When not in use, they can be put to sleep. When damaged, they can be discarded, even have parts cannibalized to build a new Unit. This Unit, the narrator, has no personal identifier. When other characters in the narrative speak of it, it’s “it” or “SecUnit,” which is what it was manufactured as, but not what it any longer is.In an earlier installment, SecUnit found a way to dismantle its governor module. Since then, it’s been rogue, a free standing, self-directing entity, no longer a commodity or possession. As time goes on, the Unit has started to build relationships with people, a few, some humans and at least one fellow AI. It finds this new emotional baggage disturbing and inconvenient at times. Choices were simpler when it was just a tool, a super-efficient killing machine. The humans with whom he interacts find it puzzling too. Some trust it. Others see it as something like a pit bull –it may not be threatening now, but you can’t trust its reactions under stress—and you don’t know how it feels about humans for the simple reason it’s not one.That’s the backstory to Network Effect, which starts with the hostile takeover of the research vessel that Murderbot and several humans are traveling in. Their ship caught in the grip of a transport beam, and Murderbot and one of the humans, Amena, are drawn into an alien spaceship. The ship soon moves into a wormhole, which renders any prospect of outside rescue nugatory until the ship reenters normal space. Murderbot and Amena discover that the ship itself has been taken captive. They rescue two of the original crew members and Murderbot discovers that the ship was once controlled by his AI friend, a robot ship pilot (the ship was its body) named ART.The aliens have killed ART but ART left behind code that allows Murderbot to resuscitate him, minus memory of the time ART was out of commission. Murderbot discovers also that ART sicced the aliens on Murderbot’s ship before it self-destructed itself because ART thought Murderbot could defeat the aliens and knew it could not. From there on, the plot takes off. The alien invaders are defeated. ART is restored to control of its vessel, which is awesomely powerful. The ship descends to the colony from which the aliens, infected descendants of the colony’s original settlers, came to rescue ART’s captured crew, who are being held hostage there. They’re rescued, Murderbot is taken. ART goes to attack with all its awesome capabilities. Aided by another SecUnit whose governor unit Murderbot disables, and using a clever trick involving the creation of a second software version of its bot self, so that temporarily Murderbot can operate in two places at once, Murderbot escapes. The humans return home and Murderbot accepts an offer from ART to travel with it on its next mission.If you grew up like I did, cutting your eyeteeth on a steady diet of sci fi and fantasy, you realize, of course, that Network Effect is space opera, with all the fights and feints and whizbang flash that genre demands. But the science in Network Effect is less preposterous than, that in, say, the novels of E. E. “Doc” Smith, Edmond Hamilton or Jack Williamson and the characters are much better developed. Or perhaps I should say, Murderbot’s character is. The humans in the story are pretty much window dressing and ART is as much a conceit as it is a person. But Murderbot is genuine. Reviewers have commented on it one of the more human and believable fleshings out of what a non-human being, forced to operate in a human world, might behave like and think (and feel too). Murderbot is also appealing, especially in those moments when it is trying to figure out how to live as ally and friend(?) with those perplexing and often irritating human beings who are around it.The human universe in which these characters move is heavily corporatized, a dog eat dog environment. Look high enough up the ladder, to Murderbot’s former corporate owners for example, and it’s Murderbot who emerges as the human one –just not, you know, human.I guess what I’m trying to say is that though not great literature, this is good –by which I mean interesting, even engrossing—reading, and it appeals to us on two counts: our love of adventure (story-telling) and our curiosity about the different. It reminded me vaguely of Iain M. Banks’s standalone novel of the future, Feersum Enjin (1994), one of whose narrators was a self-taught machine. Banks was a better writer and imaginer than Wells is, at least on the basis of this novel, but Wells is no slouch. But then, I have a high tolerance for what I once labeled “junk literature” –sci fi and fantasy, sea stories, spy thrillers, westerns and romance novels. Those were the books I used to cycle down to reality after long hours in grad school reading fifteenth-century chronicles in Spanish, French and Latin. Until I change my ways and convert to reading only the likes of Proust or Henry James, I guess I’ll keep looking for the small pleasures of formula fiction when it’s done well. As done here.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNPP3MYZTUY4K52QD3AFDO7JEIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PFEYYHNT8OGV?ASIN=B084QBWBSV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Great series!",
                "reviewText": "I've seen this series pop up from tome to tome over the years, but did not decide to start it until a few days ago. Man I've been flying through these books. So much fun. Great sci fi stuff. It reads like a TV series. Starting the next book now!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hope E. Ring",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGAACRAF6B6KGJHSJBKQ4CQFNJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R161WGFARK5XSY?ASIN=B084QBWBSV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Best yet!",
                "reviewText": "Obviously, read these in order.The first four volumes of this series are very well done, but novella length. This full length novel goes far deeper in both plot and character development, and is wonderfully satisfying. Fast paced, with new characters and old favorites, it raises eternal questions. What does it mean to be human? What does it mean to love? High",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Coffeeman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2KKVV6KDFGO7CVAFE2MAGWWQXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DLTZAKV6ZHD4?ASIN=B084QBWBSV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Isaac Asimov channels Alan Dean Foster and Robert Heinlein",
                "reviewText": "I’ve been reading Science Fiction since the sixties. I started Murderbot on a whim, and glad I did. Martha Wells creates a page-turner novel in a well delineated, broad universe, with believable characters, both human and other, and manages to stir in social and political commentary as well. It has been years since I have read science fiction that is so well developed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Ross",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "looking for adult SF?",
                "reviewText": "Unusually credible SF universe. Characterization rich, deep, thought-provoking. Plenty of action. Plenty of surprises. Seamlessly conceived and executed.Outstanding work, Mdme Wells!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rodrigo Menendez Arzac",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 13, 2022",
                "reviewTitle": "Excelente serie",
                "reviewText": "Espere hasta leer esta novela después de haber leído los otros cuatro cuentos cortos para poder escribir mi reseña y puedo decir que toda la serie de Murderbot es excelente. Aunque el precio de los primeros 4 cuentos es alto considerando que no son novelas sino cuentos cortos, la verdad es que se disfrutan tanto que al final vale la pena el gasto. Creo que serían mucho más atractivas para el público en general si sacaran un paquete de la serie completa a un precio más razonable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sally L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "A joy from start to finish.",
                "reviewText": "Murderbot stories never fail to disappoint. There are some series where you just want to stay in the story forever, the characters and the world building are so compelling. I've nearly caught up now and having to wait between books is going to be annoying.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 13, 2022",
                "reviewTitle": "Very intriguing AI perspective",
                "reviewText": "This book should be on the reading list for AI researchers who aspire to develop true AI entity. As robotics and AI engineer, I thoroughly enjoyed this book and this series so far. Many technical details were quite realistic and plausible.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gregory ruck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 21, 2020",
                "reviewTitle": "Détente",
                "reviewText": "Agréable plongée dans la saga murderbot",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}