{
    "remaining_requests": 1403,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Time-Travel-MEGAPACK-Classic-Science-ebook/dp/B00DAJEOD2",
    "body": {
        "name": "The Time Travel MEGAPACK ®: 26 Modern and Classic Science Fiction Stories",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Time-Travel-MEGAPACK-Classic-Science-ebook/dp/B00DAJEOD2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61M349ha2eL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Edward M. Lerner",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=Edward+M.+Lerner&text=Edward+M.+Lerner&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 1060,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Time travel is one of the staples of science fiction, right up there with aliens, space opera, and robots. Most science fiction authors have written at least one time travel story. This collection samples some of the best.TIME OUT, by Edward M. LernerTHESE STONES WILL REMEMBER, by Reginald BretnorPROJECT MASTODON, by John Gregory Betancourt12:01 P.M., by Richard A. LupoffTIME CONSIDERED AS A SERIES OF THERMITE BURNS IN NO PARTICULAR ORDER, by Damien BroderickTIME AND TIME AGAIN, by H. Beam PiperTRY, TRY AGAIN, by John Gregory BetancourtTHE ETERNAL WALL, by Raymond Z. GallunTHE MAN FROM TIME, by Frank Belknap LongOF TIME AND TEXAS, by William F. NolanTHE EDGE OF THE KNIFE, by H. Beam PiperTHROUGH TIME AND SPACE WITH FERDINAND FEGHOOT (10), by Grendel BriartonTIME BUM, by C.M. KornbluthNEBOGIPFEL AT THE END OF TIME, by Richard A. LupoffUNBORN TOMORROW, by Mack ReynoldsLOST IN THE FUTURE, by John Victor PetersonTHE WINDS OF TIME, by James H. SchmitzARMAGEDDON -- 2419 A.D., by Philip Francis NowlanTHE MAN WHO SAW THE FUTURE, by Edmond HamiltonA TRAVELER IN TIME, by August DerlethTHROUGH TIME AND SPACE WITH FERDINAND FEGHOOT (71), by Grendel BriartonFLIGHT FROM TOMORROW, by H. Beam PiperIN THE CRACKS OF TIME, by David GraceSWEEP ME TO MY REVENGE!, by Darrell SchweitzerTHE SOLID MEN, by C.J. HendersonTHROUGH TIME AND SPACE WITH FERDINAND FEGHOOT (Epsilon), by Grendel BriartonAnd don't forget to search this ebook store for \"Wildside Megapack\" to see many more entries in this series, covering westerns, mysteries, science fiction, pulp fiction, and much, much more! Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00DAJEOD2"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Wildside Press (June 7, 2013)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 7, 2013"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1072 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 476 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#232,454 in Kindle Store (See Top 100 in Kindle Store) #363 in Horror Short Stories #10,001 in Horror Literature & Fiction #12,408 in Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 1,060 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Karl Janssen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEN7YT5ZS4SXPJPSOFXY7T6MPRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO41EEGSI9MM1?ASIN=B00DAJEOD2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2014",
                "reviewTitle": "4.0 out of 5 stars Diverse in setting, style, and quality",
                "reviewText": "This e-book file is one of many \"Megapacks\" offered by Wildside Press, a publisher that reprints content from classic pulp fiction magazines. Editor John Gregory Betancourt, who runs Wildside, has compiled 26 tales of time travel that were originally published from 1928 to 2013. These stories range in size from several novella-length works to three installments of the Ferdinand Feghoot series of one-page jokes that culminate in groan-inducing puns.The subject of time travel is open to infinite possibilities, and the stories in this collection cover an appropriately broad sweep of settings, from the Pliocene Epoch in Clifford D. Simak's \"Project Mastodon\" to the demise, from old age, of the known universe in the trippy \"Nebogipfel at the End of Time\" by Richard A. Lupoff. Despite such epic parameters, however, a lot of the stories here fail to impress with their utilization of the time travel element. In many cases, time travel is merely used as a tangential plot device in an otherwise run-of-the-mill adventure story, or as a means of setting up the punchline of a joke. Such stories rise to the level of clever, but strive for little more. One time traveler longs to escape his shrewish sister; another visits Oktoberfest; yet another becomes a con artist. The oldest story in the book, \"Armageddon 2419 A.D.,\" is the debut adventure of Buck Rogers in the 25th century. Unfortunately, it's one of the weaker entries in the book, an uninspired military adventure that capitalizes on the \"yellow peril\" paranoia of its day by depicting a world ruled by an evil Chinese empire.A few of the better selections do make the extra effort to really explore the scientific possibilities of time travel and the conundrums it may cause. The best story in the book doesn't contain any time travel at all, but it nonetheless pushes the envelope of the genre. In H. Beam Piper's expertly crafted \"The Edge of the Knife,\" a history professor's unexplained visions of future world history end up jeopardizing his career. Two other Piper stories are also among the collection's best: \"Time and Time Again,\" in which a grown man's consciousness is transported thirty years backward into his own childhood body, and \"The Flight from Tomorrow,\" in which a deposed dictator from a hundred centuries in the future escapes his enemies by traveling to the past. In another excellent selection, \"The Eternal Wall\" by Raymond Z. Gallun, a present-day man dies in a car accident, only to have his mummified corpse revived a million years in the future. The collection's most recent story--Edward M. Lerner's 2013 novella \"Time Out\"--is a crafty and thought-provoking exploration of the mystifying problems that arise when you mess with the continuity of time. I wouldn't be surprised to see a film adaptation in its future.Like any other genre or period of literature, probably 90 percent of what was published during the pulp fiction era was garbage. Wildside Press performs a valuable service by not only resurrecting stories from these long-lost magazines but also curatorially separating the wheat from the chaff. Nevertheless, Wildside publishes such a large quantity of work that some mediocre content is bound to sneak in. Perhaps the true value of these Megapacks lies simply in the pleasure of making unexpected discoveries like--in my case--the works of Piper. Yet even the mediocre stories offer a pleasant glimpse into the glory days of the pulps. Reading this collection is a bit like sifting for gems in a bucket of corn. It's the gems that make the book worth its purchase price, but the corn delivers its own brand of satisfying nourishment.The Kindle file has a lot of typographical errors; not enough to hinder understanding, but enough to annoy. One of the shortest stories was pasted twice, so it appears duplicated in its entirety. The copy I downloaded even had the wrong cover image. Wildside publishes good stuff, but they should pay more attention to quality control.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff Soyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESJJXNS4SITPALQQGREPU7CUZ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39IKWVXS6SNUF?ASIN=B00DAJEOD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2013",
                "reviewTitle": "5.0 out of 5 stars 99-Cents For Hours of Pleasurable Reading",
                "reviewText": "As a science fiction fan, one of my favorite sub-genres is time travel. I've always been intrigued by the idea of it, probably ever since I read H.G. Well's <em>The Time Machine</em> when I was about 10-years-old and happened to see the movie shortly thereafter.So, I had a hankering to read some more such stories this Summer and picked-up (okay, downloaded) a couple of very reasonably priced Kindle collections.I've completed the first book I bought, The Time Travel Megapack, which gives you 26 very good stories featuring all flavors of time travel. Some are serious, some not so serious. Almost all are a very good read. Note that most of these stories are not \"moldy oldies\" dug-up from the public domain pit but are often very recently published in SF magazines.Note: I'm not a physicist, so I don't concern myself (when reading escapist literature) with the plausibility of \"how\" the author's time machine works. I just enjoy the ride.Here's the best part: You get hours (and I do mean hours, this is a big book) of pleasure for 99-cents! I heartily recommend it.",
                "reviewVotes": "52 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bert Springwell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP3QZKTIRQMAALQ42PRP2DYU7VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DWJR6GZQF2AS?ASIN=B00DAJEOD2",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2016",
                "reviewTitle": "3.0 out of 5 stars A few gems, a lot of filler, some stinkers.",
                "reviewText": "There's a few gems in here, both classics and newer stories. \"These Stones Will Remember\" has a haunting poignancy. \"12:01 P.M\" and \"Time and Time Again\" are both firsts in what are now very common time travel scenarios (The 'Groundhog Day' and the 'Peggy Sue'). \"The Eternal Wall\" is an odd one, but I like the dark ending. \"Sweep Me to My Revenge!\" is an amusing story involving Shakespeare and Marlowe.The rest are mostly either forgettable or actively bad. \"Armageddon -- 2419 A.D\" was impressive in that the author took a fun plot and sapped all its life through his dull, detached writing. \"In the Cracks of Time\" is an interesting premise, but is missing a story (it feels like an intro). \"The Solid Men\" is borderline incoherent. \"Nebogiphfel at the End of Time\" IS incoherent.For $0.99, you get your money's worth, but this could easily have been a four or five star collection if the publishers had been a little more discriminating in their public domain stories.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNIKGQR6TDF7WSQU342KC6RKKNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTX61SJHEVVQ6?ASIN=B00DAJEOD2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2022",
                "reviewTitle": "4.0 out of 5 stars A good collection of different takes in Time Travel",
                "reviewText": "A good collection of Time Travel stories which I enjoyed. I got the urge to read some stories on this subject after listening toTime Machine Tales by Nahin on Audible which creatively discusses time travel by using a vast amount of time travel stories as examples and the physics behind them, pro and con.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ancient Mage",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHONRBVFSCN342YL36RIJCAT5CVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WPBE5EFMB4LQ?ASIN=B00DAJEOD2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2015",
                "reviewTitle": "5.0 out of 5 stars A virtual time machine of time travel stories.",
                "reviewText": "This is a collection of stories written by various authors. Some of the stories are very good. None of them are bad.You might say that the Time Travel Megapack is a time machine itself, because the stories were written at vastly different time periods. You're in a double time machine yourself, looking at the past and the future from the different perspectives of the past and present. Read a story and guess when it was written. You may be surprised.You'll find stories from the 1920's on. The first Buck Rogers story is here (though the author doesn't yet call him Buck). I found it fascinating that the story was written in 1928, but the author calls the First World War \"The First World War\" even though there wasn't yet a second war (and he wasn't the first to do so). You will also find stories written quite recently.There's lot here and you can't go wrong.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 15, 2017",
                "reviewTitle": "Four Stars",
                "reviewText": "Wonderful short stories that stimulate the imagination",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vinod",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 18, 2015",
                "reviewTitle": "Three Stars",
                "reviewText": "For its low price, the book is worth your TIME, especially while TRAVEL-ling",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rubinstein",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 24, 2014",
                "reviewTitle": "Rapporto qualità/prezzo imbattibile.",
                "reviewText": "Tutta la serie dei \"Megapack\" offre a prezzi straordinari raccolte di racconto e romanzi brevi assai pregevoli. In particolare le antologie e le monografie fantascientifiche. Consigliatissimo a tutti gli appassionati del genere.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kraus",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 21, 2014",
                "reviewTitle": "Just a cool collection!",
                "reviewText": "Until I read this book, I thought, if you know one or two timetravel-stories, you know them all...In this book, none of the stories is like the other and nearly all of them are really worth reading!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nikestardreamer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 28, 2013",
                "reviewTitle": "Du bon et du moins bon",
                "reviewText": "Certaines histoires sont intéressantes, mériteraient même d'être développées ; mais d'autres n'ont pas grand intérêt et on a beaucoup de mal à entrer dans l'histoire !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}