{
    "remaining_requests": 1677,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Tuf-Voyaging-George-R-Martin/dp/0345537998",
    "body": {
        "name": "Tuf Voyaging: A Novel",
        "price": "$6.83",
        "originalPrice": "",
        "rawPrice": 6.83,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Tuf-Voyaging-George-R-Martin/dp/0345537998",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "Only 6 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Az8lJFRWL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61euIuGNPrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qd1DogmLL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "George R. R. Martin",
            "link": "https://www.amazon.com/George-R-R-Martin/e/B000APIGH4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2412,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 19 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b?ie=UTF8&node=720360"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bantam; NO-VALUE edition (January 29, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 448 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0345537998"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0345537997"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.06 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.15 x 9.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#242,973 in Books (See Top 100 in Books) #608 in Science Fiction Anthologies (Books) #4,289 in Space Operas #6,642 in Science Fiction Adventures"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,412 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lora S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZL7PB4UL47R3E24ENBLOLK6DVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GIA0RLAK0MXH?ASIN=0345537998",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Tuf outsmarts them every time",
                "reviewText": "Tuf Voyaging is a book of science fiction short stories that are all connected by the main character, Haviland Tuf. This one dates from earlier in G.R.R. Martin’s career.In the first story, Tuf appears to be almost a minor character to begin with. He owns a small trading ship that a somewhat unscrupulous character hires to take a party of mostly researchers to salvage what appears to be an antique and maybe derelict warship. This ship reminds me a bit of the red planet in the Dragonriders of Pern series. It is not a planet, nor is it red. But it periodically approaches the planet it orbits to rain down various plagues on it that devastate the remains of the population that has been building up since its last visit. The researchers believe it may be what they call a ‘seedship’ left over from a long-ago war whose purpose was to get rid of the population of the planet that is its target making it safe to sow new lifeforms on it that will eventually make it habitable for humans. They think they will be able to sell it for a lot of money even if it is only a burnt-out relic. And if it is still functional, they expect vast riches from it.The researchers, and the people they have hired, are everything from clueless to downright evil, and they have abused poor Tuf and his cats mightily on the voyage. But the seedship, though its crew is long dead, has formidable defenses built into it. The members of the research team are insufficiently careful of these defenses and each other. It doesn’t take long before Tuf and his cats are the only people alive on the ship.Tuf decides to drop trading as a career and take up bioengineering.In the remainder of the stories, Tuf travels the galaxy, or at least part of it, in the seedship having various adventures which his increasing bioengineering skills help him out with. Based on the offers to buy the ship, the researchers were correct about its monetary value – poor folks.His most frequent encounters are with the planet S’uthlam, where he originally takes the ship to be repaired, updated, and cleaned. The S’uthlamese have an excellent technological reputation, which is why Tuf takes the ship there. But they also have a massive overpopulation problem caused by their primary religion. They believe it is the duty of sentient life to keep breeding, forcing them to evolve, until they ultimately achieve godhood. While this doesn’t seem to me to be that good, it is the best reason I have heard yet for refusal to curb overpopulation.They insist he sell them his ship, the Ark (although how that will help them, I’m not sure). When he refuses, they threaten to confiscate it. And they take one of his cats hostage. He finally outwits them on that pass, creates several new varieties of food products to help with their growing food shortage, and leaves with a promise to come back with half of the enormous payment for the upgrades to the ship within five years.After several visits to other planets to earn the money to pay for the repairs to the ship and at least one more visit to S’uthlam with new solutions to the famine problem which don’t really solve anything, Tuf returns one more time, only to encounter a new fleet of warships and an impending war with S’uthlam’s neighbors. This time he is closely watched by his friend, the former portmaster, Tolly Mune, who is now the First Councilor as he crafts the ultimate solution for S’uthlam’s problems, once again having to outsmart everyone to avert the worst outcomes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chip Hunter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBO7THEB7TRCR6J4A2HGBVKDZFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R332W17NR1MNCK?ASIN=0345537998",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2017",
                "reviewTitle": "4.0 out of 5 stars Some light-hearted and thoughtful work from Martin's early career.",
                "reviewText": "TUF VOYAGING collects seven short stories centered around Haviland Tuf and his adventures traveling the galaxy as an ecological engineer. Tuf is a strange man by anyone’s standards, not your typical hero. Intelligent, educated, and serious, Tuf is the sort that says what he means and means what he says. He is also notably unsocial, seeming to suffer from a particularly potent case of Asperger syndrome, and definitely preferring the company of this cats to that of other humans. Most disturbing of all though, is his complete confidence in himself and his apparent disdain for the views of others. As these stories progress, Tuf begins to develop a god-complex, showing an amazing conceit as he travels the cosmos conducting ecology-changing experiments, often covertly or against his customers’ wishes. Still, he is the lone protagonist in these stories, and readers can’t help but cheer for this unlikeable man.The first and longest of the short stories in the collection is “The Plague Star”, where we are introduced to the Ark, a 1000-year-old warship of Old Earth with immense powers to conduct biological warfare and ecological engineering. Haviland Tuf travels with a motley crew of would-be exploiters to take control of this invaluable relic. His companions in this endeavor are Rica Dawnstar, Celise Waan, Kaj Nevis, Jefri Lion, and Anittas, a well-developed group of interesting characters who end up double-crossing one another to gain ownership of their discovery. In the end, only Tuf survives and takes sole control of the Ark, setting the stage for the rest of the stories here.In “Loaves and Fishes”, Tuf bring the Ark to the planet of S’uthlam, where he solicits repairs to his long-neglected ship. When the powers-that-be realize the power of the Ark and its potential to help S’uthlam with its overpopulation problem, they conspire take control of the ship. Despite this, Tuf conducts a little ecological engineering to stave off an imminent lack of food before making his escape.In “Guardians”, Tuf is asked to help save the world of Namor from a horrible proliferation of monsters that is threatening their civilization. Monster that seem to be rapidly evolving to defeat the impressive technology of the humans are emerging from the sea. Tuf is at first perplexed, but eventually realizes he is up against a sentient race, not mindless monsters. He helps arrange a truce between the people of Namor and this misunderstood race they were battling, thus saving the day. This is perhaps the only example of Tuf using his powers for an unqualified good. Here we are introduced to another key character, the psionic cat, Dax.Tuf ends up returning to S’uthlam in “Second Helpings”, where he finds that overpopulation once again threatens the planet. Tuf also finds that he has himself become somewhat of a cultural icon as the story of his first visit to the planet was made into a box office hit. Wishing to repay his debt to S’uthlam for repairing the Ark, Tuf instead finds himself threatened with seizure and forced to discover a solution to the coming food shortages. Again Tuf works his miracles, this time providing S’uthlam with less-than-desirable, but near-inexhaustible food sources.“A Beast for Norn” is perhaps my favorite of the stories in the collection. Here, Tuf is recruited to provide fearsome monsters that will help a ruling family earn prestige on a world where pit-fighting animals is the custom for determining political pecking order. Tuf obliges, but sneakily works in some ecological engineering to change the planet’s environment so as not to support the types of beasts suited for pit fighting. This story provides the most glaring example of Tuf’s growing conceit. His solution to stop what he views as a barbaric practice is to transform a planet’s ecology, against the will of the planet’s inhabitants shows Tuf’s god-complex.In a rather strange story called “Call Him Moses”, Tuf encounters an anti-technology cult that has been based on a false prophet and his false signs. Tuf responds with his own set of “plagues”, using his powers as an ecological engineer to prevent the radical cult from taking over a world.Finally, in “Manna From Heaven”, Tuf returns to S’uthlam, this time as a prisoner of the powerful S’uthlamese military, who are determined to claim the Ark and use it to help their once-again-near-starvation world. Tuf realizes that the likely outcome of S’uthlam controlling the Ark would be for them to use it against their neighbors to aquire more habitable planets. He is able to convene a treaty summit with leaders from these other planets and wagers that he will be able to once and for all solve S’uthlam’s overpopulation problem. This time his engineered food source, addictive and abundant, also contains chemical birth control. Here we see another example of Tuf’s willingness to perpetrate his radical solutions on entire peoples without their consent.George RR Martin is no doubt one of the most imaginative and talented authors of our time. TUF VOYAGING is a fine example of his lighter fare. This is thought-provoking, enjoyable, and easy reading. Nothing dark, nothing serious, just fun.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JustSomeGuyWhoLovesTech",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG6XPAPJ6YHMEHNUNWDLFU43EQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD0HYSB37BPYH?ASIN=0345537998",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Tuf is the stuff!",
                "reviewText": "In a bizarre turn of events a down on his luck short-hop trader ends up owning one of the last generation Eco ships. Inside it’s arsenal are some of the most violent creatures in the galaxy and somehow, Tuf figures out a way to make himself one of the most sought out, and wanted, starship captain. He is determined to use the ship, now his ship, to help planetary citizens improve their lot; for a small fee of course. After all, running a kilometers-long generation ship filled with until numbers of creatures held in stasis requires currency. Not to mention much needed repairs. Tuf manages to out maneuver again and again those who would thwart his new calling. Riding a,one with Tuf? Why his beloved cats of course. It’s a purrfect partnership. Fun fun series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lawman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 13, 2023",
                "reviewTitle": "A good creative read",
                "reviewText": "Took me a little time to get into the book but after a little while came to appreciate the humour and creativity in the writing. Absorbed me in another world and great fun.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BigFatBastard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 13, 2020",
                "reviewTitle": "Excellent series...",
                "reviewText": "Excellent series of short stories, wish there where more...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Divyanshu T.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 1, 2019",
                "reviewTitle": "A delightful read",
                "reviewText": "Science fiction at it's very best. Easy to follow for a casual reader and at the same time deeply engrossing to any avid sci-fi fan. GRRM may not venture out of Westeros soon but don't let it cool you. He knows his science well. Never needed to suspend my disbelief for long",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Ogilvie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on March 5, 2019",
                "reviewTitle": "Fun reading!",
                "reviewText": "Tuf obtains a huge ecological engieering ship and with it, and his cats, he has a number of strange adventures. It was fun and light reading. Each story is independent.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marina udeev",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on June 25, 2017",
                "reviewTitle": "commento a caldo",
                "reviewText": "Lo stile del libro è completamente diverso dal Trono di Spade. Ci sono solo i dialoghi. Non mi è piaciuto piu dai tanto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.00",
                "sellerName": "Orion LLC",
                "sellerRating": "4.5"
            }
        ]
    }
}