{
    "remaining_requests": 1671,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sea-of-Tranquility-A-Novel/dp/B099FHNDP8",
    "body": {
        "name": "Sea of Tranquility: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sea-of-Tranquility-A-Novel/dp/B099FHNDP8",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61Eunh9SwkL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emily St. John Mandel",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Emily+St.+John+Mandel"
        },
        "brand": "Emily St. John Mandel",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 26184,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER The award-winning, best-selling author of Station Eleven and The Glass Hotel returns with a novel of art, time travel, love, and plague that takes the reader from Vancouver Island in 1912 to a dark colony on the moon five hundred years later, unfurling a story of humanity across centuries and space. One of the Best Books of the Year: The New York Times, NPR, GoodReads “One of [Mandel’s] finest novels and one of her most satisfying forays into the arena of speculative fiction yet.” —The New York Times Edwin St. Andrew is eighteen years old when he crosses the Atlantic by steamship, exiled from polite society following an ill-conceived diatribe at a dinner party. He enters the forest, spellbound by the beauty of the Canadian wilderness, and suddenly hears the notes of a violin echoing in an airship terminal—an experience that shocks him to his core. Two centuries later a famous writer named Olive Llewellyn is on a book tour. She’s traveling all over Earth, but her home is the second moon colony, a place of white stone, spired towers, and artificial beauty. Within the text of Olive’s best-selling pandemic novel lies a strange passage: a man plays his violin for change in the echoing corridor of an airship terminal as the trees of a forest rise around him. When Gaspery-Jacques Roberts, a detective in the black-skied Night City, is hired to investigate an anomaly in the North American wilderness, he uncovers a series of lives upended: The exiled son of an earl driven to madness, a writer trapped far from home as a pandemic ravages Earth, and a childhood friend from the Night City who, like Gaspery himself, has glimpsed the chance to do something extraordinary that will disrupt the timeline of the universe. A virtuoso performance that is as human and tender as it is intellectually playful, Sea of Tranquility is a novel of time travel and metaphysics that precisely captures the reality of our current moment. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Metaphysical & Visionary",
                "link": "https://www.amazon.com/Metaphysical-Visionary-Fiction/b?ie=UTF8&node=271587011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "5 hours and 47 minutes"
            },
            {
                "name": "Author",
                "value": "Emily St. John Mandel"
            },
            {
                "name": "Narrator",
                "value": "John Lee, Dylan Moore, Arthur Morey, Kirsten Potter"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "April 05, 2022"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B099FHNDP8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#211 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Time Travel Science Fiction (Audible Books & Originals) #2 in Time Travel Fiction #3 in Post-Apocalyptic Science Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "vmhutch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXR5QSKAJKPS2HXQECODSI45HOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFBI7LBW1TZAA?ASIN=B099FHNDP8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars What a fabulous author",
                "reviewText": "I remember buying Station 11 and then putting off reading it for about a year. It was so highly reviewed, but the storyline just did not interest me. One day after I'd finished another book I picked it up and I couldn't put it down. What a wonderful book. Then I watch the television show and it was pretty good, too, but it's not a surprise it was nowhere near as good as the book. So that brings me to this book. Once again I wasn't too interested in the storyline. I don't much care for time travel books. Frequently they become just a little too convoluted and if there isn't really a good payoff what's the point of jumping around back and forth? But I remembered feeling so rewarded when I read Station 11 that I decided to crack it open and get to reading it. Sea of Tranquility is a fabulous book. The end just ties everything together. So don't drop out. Stick it out. It seems like it might be just a little disjointed and the chapter numbering is really unusual. Your reward is to feel so very good at the end of her novels, because there's just a goodness in them. It's not pollyannish. It's hard to describe. She's such a wonderful author. She asks such profound things about humanity in such a clear and simple straightforward way. Can't wait to see what she does next.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EthanEthan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH25FB5EAAE5OPYNROJMTZ2GFEQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFBAM249EB62Y?ASIN=B099FHNDP8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2022",
                "reviewTitle": "4.0 out of 5 stars \"...a mastery of craft and plotting.\"",
                "reviewText": "\"A life lived in simulation is still a life.\"Emily St. John Mandel is an author who has been on my radar for several years. I've seen glowing reviews of her previous novels The Glass Hotel and Station Eleven, but I've never gotten around to reading them. Like other much-hyped books, I added them to my TBR list and then ignored them. Her latest novel, Sea of Tranquility, was published earlier this year, and the reviews have been glowing once again. Comparisons to David Mitchell's Cloud Atlas, a novel that both mesmerized and confounded me, piqued my interest even more. I decided it was finally time to read a Mandel novel, and Sea of Tranquility would be a perfect place to begin.What is reality? How do we decipher what is valid from what is imagined? These questions mark the impetus of this novel. It opens in 1912 with Edwin, a young man who has been castigated from his family and his home country in embarrassment. He couldn't keep his mouth shut, and now he finds himself halfway across the world, landing in Western Canada's wilderness. As he wanders the forest, Edwin steps into a place that leaves him questioning his very sanity. \"He steps forward into a flash of darkness, like sudden blindness or an eclipse. He has an impression of being in some vast interior, something like a train station or a cathedral, and there are notes of violin music, there are other people around him, and then an incomprehensible sound—.\"Just as we begin to grapple with the implications of what Edwin experiences, Mandel thrusts us forward a hundred years. We see a composer giving a lecture about his composition that centers around a video recorded by his sister. In the recording, she is seen walking through the forest when time and space seem to blip. Again, before we have time to wrestle with what we read, Mandel moves us forward to the year 2203. We meet a novelist who is on a book tour promoting her latest work. The tour has taken her from her home on a moon colony back to earth. As she laments missing her family, news breaks of a plague beginning to spread on the planet. In a fiction that mirrors Madel's own reality, the author must face promoting her book amongst the spread of a life-threatening illness.It isn't until the mid-point of the novel that things begin to come into focus. We land in the year 2401, to a world (galaxy may be more apt) that is completely transformed. Humanity exists in domed colonies, a reality that is both alien and familiar. Gaspery, a man we've seen glimpses of in the preceding stories, is fully introduced as a nightwatchman of a hotel, a job he hates. His sister works at a more exciting, but secretive, gig as a scientist who has been investigating anomalies in time and space. She reveals to Gaspery that different centuries and realities are bleeding into each other, an oddity that is without explanation. Gaspery, desperate to shake his dead-end job, agrees to assist her in traveling across time to get to the bottom of this strange aberration.With Sea of Tranquility Emily St. John Mandel takes her readers on a journey across time and space, daring us to ask big questions and to find answers nestled in unlikely places. From a sheer construction standpoint, the novel is a mastery of craft and plotting. Each story corresponds to the next and vice versa creating a nesting doll effect. Yes, other authors have used this device before, but perhaps none to such a rewarding effect. I'll admit to being a bit discombobulated at first. It was hard to see the forest from the trees, especially as Mandel thrust us forward in time with each new section. This confusion is resolved by introducing a character who is able to traverse time, giving us readers someone to help make sense of how everything is connected. Despite the narrative wizardry at play here, Mandel manages to ground her work in characters who glimmer with reality, even when that reality is so different from our own. Ultimately it is the way these characters, love, and lament that makes Sea of Tranquility truly shine.",
                "reviewVotes": "93 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81pr-nxtv1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Milburn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3MFUHGIXOZMYFMF4WFEU4HH6EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VKM7BKGP8PD1?ASIN=B099FHNDP8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars literary sci-fi that will blow your mind",
                "reviewText": "I just loved this. It is a short read but full of ideas. written in a style where I never really knew where it was going but in the end everything seemed like an obvious fit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Lentz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUBGMHV64LP44YCYFGVNB5PB7FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M81QY8N965C9?ASIN=B099FHNDP8",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "3.0 out of 5 stars A disappointment",
                "reviewText": "I really enjoyed Station Eleven, maybe because I read it in the early part of the Covid 19 pandemic. But this one not so much.I realize that framing the story as speculative fiction was just a mechanism to convey a message. But I’m not a fan of time travel stories. They can be unnecessarily convoluted and gimmicky not to mention implausible. This was however just one symptom of what I felt was weak world building. The scenes set in future times were much like the present but they also relied on unrealistic technologies again like time travel and artificial gravity.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danilo Moret",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 22, 2023",
                "reviewTitle": "Great read",
                "reviewText": "Pacing is great, increasing gradually, and when the story jumps around it’s easy to follow and keep interested. The parallels to our recent moment in history are great. I’m avoiding the story so nothing is spoiled, so just dive in and have fun.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bogblast",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 10, 2022",
                "reviewTitle": "When the Moon Hits Your Eye like a Big Time-travelling Pizza Pie",
                "reviewText": "I enjoyed this book - and I guess if i get tired of reading so many time-travel stories like this one, I can just go back in history where there are fewer. (joke) The quasi-autobiographical aspect of this book, where an author is on a book tour after writing a very popular novel about a pandemic, is quite enjoyable, as Ms. St. John Mandel appears to be having some fun at the expense of the fans and critics of her previous book Station Eleven (including me!).",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kofi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 15, 2024",
                "reviewTitle": "Beautiful!",
                "reviewText": "What a beautiful book! Refreshingly unpathetic, thus refreshingly un-American (well, she's Canadian, and it shows): the story doesn't need any villains and heroes, nor any action at all. And yet in no way boring, on the contrary. Great concept, great story, great writing.Let me see what else Madame St John Mandel has published...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina Marchand",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 18, 2023",
                "reviewTitle": "great book",
                "reviewText": "I liked the strange twists and turns and unexpected events. it's never boring and makes you think. a bit slow at first, but then everything comes together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian Payton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 23, 2023",
                "reviewTitle": "A gentle and heartwarming time travel tale",
                "reviewText": "A short and very satisfying story about time travel. It was never Gaspery-Jacques Roberts’ plan to work for the Time Institute, but through a casual combination of circumstances, that’s exactly what he finds himself doing - investigating an anomaly that spans centuries and touches several people’s lives.What I liked most about this book is the delicate and thoughtful writing of the characters. Emily St. John Mandel has such a light touch with her characters, that each seems to have an authentic emotional presence. I especially liked Olive Llewellyn, whose presence was a gentle foundation for some of the plot.The plot was intriguing, and well supported by the structure of the book, which pivots around the central chapter, making the second half of the book into a satisfying and drawn out resolution of the first half.This is a short book that touches on a number of ideas - and for me that left a few things that needed a little more explanation or exploration. And for stalwarts of the time-travel subgenre of science fiction, the reveal at the end won’t come as a particular surprise. These are the only things that prevented me giving a 5-star review. This is the first Emily St. John Mandel book that I’ve read, and I will certainly be putting her others on my to-be-read list.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}