{
    "remaining_requests": 1431,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Aliens-Mail-Order-Bride-Romance-Novella-ebook/dp/B0771X4NKL",
    "body": {
        "name": "The Alien's Mail-Order Bride: A Sci-Fi Alien Romance Novella (Risdaverse)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Aliens-Mail-Order-Bride-Romance-Novella-ebook/dp/B0771X4NKL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81xrrJwmqBL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ruby Dixon",
            "link": "https://www.amazon.com/Ruby-Dixon/e/B00PJ7HCDM/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3646,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Though still carrying the scars of his past as an intergalactic soldier, Emvor doesn’t mind the quiet of his chosen life as a farmer. He doesn’t even mind that most nights are lonely on remote Cassa, but he does need help around his farm. A mail-order bride from his homeworld seems like the perfect solution. She’ll be a tall, sturdy female to help with the chores and bear his children.Unfortunately, the person that arrives is Nicola. She’s small, delicate…and human. She also knows nothing about farming, and she's lied and deceived her way across the galaxy to get to Cassa so she can hide from those that would capture her. She's a problem, and also the most enticing thing he's ever seen.Now Emvor has to decide…can he keep the woman who’s nothing like what he asked for but is everything he needs?",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Romance",
                "link": "https://www.amazon.com/Romance-Contemporary-Historical-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=158566011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0771X4NKL"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (October 30, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 30, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1612 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 67 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,876 in Kindle Store (See Top 100 in Kindle Store) #210 in Two-Hour Romance Short Reads #225 in Science Fiction Romance (Books) #253 in Science Fiction Romance (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 3,646 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "OlyBabs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVR5XIWG553PYLZQYFRKMPJJ4DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5NFTVP65DVRF?ASIN=B0771X4NKL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Grumpy / Sunshine",
                "reviewText": "If Grumpy/Sunshine is your fave trope, this one is for you. Short and sweet, with a good dose of spice. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peggy M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDZ2JIPALSGCVXCODCV6V6T6JRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15HT0R09ZYF1D?ASIN=B0771X4NKL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2022",
                "reviewTitle": "4.0 out of 5 stars I enjoyed this story very much",
                "reviewText": "After reading ‘Bad guy’ I got curious about this series, especially after meeting a couple of the ‘Risdaverse’ series in this story. I wanted to read more about this special world.I must say that I really enjoyed this story. It may only be a novella length story but it was well developed. The story was light, fun but it also had emotional elements in it.Alien soldier Emvor is living a peaceful life on a farmer planet but after many lovely nights, he decides that he wants a wife. So he orders a mail-order bride, he expects a strong, mesakkah woman (someone like him, a blue-skinned alien with horns and a tail) but soon after her arrival Emvor discovers that his new bride is a human!! A small, fragile female. Someone who can’t help him on the farm. What will he do now?Just like so many other human women, Nicola was abducted by aliens. She was only 12 years old but she was one of the ‘lucky’ ones. She was a slave to a kind, alien lady and she had a ‘good’ life. But her owner is getting old and so Nicola has to look for another place to stay. The universe is a dangerous place for a human so Nicola has to be very careful. Luckily for Nicola, Emvor may be grumpy and silent but he has a good heart and so he lets her stay with him after he discovers her secret and promise to help her look for a new husband. Meanwhile, Nicola is staying in his house. Soon, both of them discover that they like each other company. They may be different but they still share some things too. Will Emvor change his mind and keep Nicola as a wife or not?‘The alien’s mail-order bride’ was an entertaining and well written story. It’s not so long but it had everything in it that I liked in my stories. You got both POV’s.I liked both main characters very much. Emvor was an ex-soldier, who had scars in his face and a limp. He was a grumpy, silent, lonely alien guy but he was also a hard worker, honest and respectful. He was just a good guy.Nicola was such a positive, cheery, sweet character! I really loved her. She was just looking for a place to call home. It was so sweet to see how she was turning Emvor’s house into a home. They were perfect for each other. We got to read a bit about both their past but not in great detail but I didn’t mind that. There was a steamy sex scene at the end of the story.I’m happy that I tried this story. It was just what I was looking for. A light, fun and quick read.(But be warned, these stories are very addictive!! After finishing this one, I bought a few more and have already read two more stories.)",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Holly J. Stevens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVVFAJ7D2MT6CLC4OXWHWBSI7ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGN9RBE44KJ0F?ASIN=B0771X4NKL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars The Alien's Mail Order Bride",
                "reviewText": "He's a broken warrior turned struggling farmer who needs a help mate and wife. He makes a deal for a woman of his race, but a tiny human female arrives instead. She's too weak to help with the farm, so he intends to find someone else to take her off his hands. Then she captures his heart!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sherrejon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHORG455LCH6ALAQLB2YVEE77S7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QXKCBU6KLCP1?ASIN=B0771X4NKL",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2023",
                "reviewTitle": "3.0 out of 5 stars 3.5 stars",
                "reviewText": "I wish this was longer 😭 I was left hanging 😭.Emvor is a messakah alien and is waiting for his bride to arrive. He needs help around the farm and companionship. In fact, he doesn’t even care what his blue bride-to-be looks like; he just needs someone around. He’s ex-military and is scarred from it, which is why he thinks he’s not handsome, but he’s alone, and that’s why he ordered a bride.When his bride arrives, he notices something’s off- she’s limiting her movements and isn’t talking much. It isn’t until they arrive to his farm that his bride takes off her mask… she’s not an alien; she’s a human, and she’s looking for safety.Nicola’s (24) ready to get married and have kids, which is what Emvor’s looking for. Her previous owner considered her a pet, but ever since she died, Nicola’s had to fend for herself. She needs stability and hopes to find it with Emvor.But Emvor needs someone bigger and stronger than Nicola 😬. He’s willing to help her look for a suitable man to marry.If only he could ignore the feelings he’s feeling 👀I loved/liked:-how jealous Emvor gets 🤣. This alien gets jealous of his own thoughts 🤣😅—the tension/buildup👀. Yes, it’s a short book, but it mostly focuses on their relationship—the breeeeding aspect 😉—the 🔥. Sigh. They’re learning each other, and even though he’s not a virgin (she is), he’s never been with a human.—learning how to kiss 🔥 and learning what that little nub is hidden 🥵—Emvor’s regret over being with others 💁🏻‍♀️. Manhooooars all around could learn from this 🤷🏻‍♀️. He wishes he didn’t have the experience he’s experienced, even though it’s been a really long timeWhat I wanted more of: SPOILERS—there’s breeeeding but we don’t see it 😑. It ends so abruptly—no epilogue/rushed ending 😐. We don’t see what happens after they’re finally intimate 😭. Babies? Marriage? We don’t see it 😭 it we just had one extra page, I would’ve been happierOverall, I really enjoyed this ❤️ I just wish we had an epilogue 😭",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG353ZYKDZXEGGD3FRRW32QZA42A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33ERV8KVORFD7?ASIN=B0771X4NKL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars heart warming read",
                "reviewText": "I really liked this heart warming read. It was short and very sweet. I am glad I got the chance to read this short novella. I liked Nicola she was strong, determined and kind. And he was a strong, gruff, and yet caring. Even though it was very short i came away satisfied with the book. It is a great short alien romance book if you don’t have time to read a fullLength novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Layla",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Amazing Author!",
                "reviewText": "I love all of Ruby's books!She makes that perfect blend between Alien/Human Romance.I loved this book so much that it was worth buying it rather than just renting it on my Kindle.I read it again from time to time.Such an easy read as well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cazabell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2021",
                "reviewTitle": "5 stars",
                "reviewText": "Fantastic short story. Loved Nicola and Emvor, they are just so sweet!. Definitely recommend this sweet and sexy novella and only wish it was longer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonia Fernandes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 13, 2018",
                "reviewTitle": "Love you",
                "reviewText": "Like all the books by author Ruby Dixon, this shows us that differences can be overcome, Emvor wanted a woman, a working partner, not a mate. Found everything in Nicola and much more. Read all the books in this series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Imee-B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 2, 2017",
                "reviewTitle": "***unexpected***",
                "reviewText": "Omg i love alien's mail order bride, its short sweet and delicious. Emvor got more than he wished in her human bride Nicola. She is sweet and cooks a lot when stressed lol thanks Ruby this is fantastic little gem of a story and i hope you will give us more novellas in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 12, 2019",
                "reviewTitle": "Nicola and Emvor",
                "reviewText": "Emvor is a soldier turn farmer in a remote planet and after years of solitude he has decided to get himself a wife. A Mesakka female will be strong enough to helping around the farm and worm his bed. The last thing he expects is a small, flat face and pale human. Nicola is a human kidnapped as a child and living as a pet for a rich old Mesakka female. But her owner is now dead and her safe existence is now now....non existent. Under disguise she travels to a isolated planet to marry a alien and finally find a secure place to call home. Heartwarming quick read. Highly recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}