{
    "remaining_requests": 1637,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Childhoods-End-Sir-Arthur-C-Clarke-audio/dp/B001JK64M8",
    "body": {
        "name": "Childhood's End",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Childhoods-End-Sir-Arthur-C-Clarke-audio/dp/B001JK64M8",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/516WC3ZZ6lL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Arthur C. Clarke",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Arthur+C.+Clarke&search-alias=audible"
        },
        "brand": "Arthur C. Clarke&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 13029,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The Overlords appeared suddenly over every city - intellectually, technologically, and militarily superior to humankind. Benevolent, they made few demands: unify earth, eliminate poverty, and end war. With little rebellion, humankind agreed, and a golden age began. But at what cost? With the advent of peace, man ceases to strive for creative greatness, and a malaise settles over the human race. To those who resist, it becomes evident that the Overlords have an agenda of their own.As civilization approaches the crossroads, will the Overlords spell the end for humankind...or the beginning?BONUS AUDIO: Includes an exclusive introduction by Hugo Award-winning author Robert J. Sawyer, who explains why this novel, written in the 1950s, is still relevant today. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16272"
            },
            {
                "name": "Hard Science Fiction",
                "link": "https://www.amazon.com/High-Tech-Science-Fiction-Books/b?ie=UTF8&node=16286"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 43 minutes"
            },
            {
                "name": "Author",
                "value": "Arthur C. Clarke"
            },
            {
                "name": "Narrator",
                "value": "Eric Michael Summerer, Robert J. Sawyer - introduction"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 28, 2008"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B001JK64M8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,833 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #45 in Hard Science Fiction (Audible Books & Originals) #113 in Classic Literature #117 in Hard Science Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David Sheppard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3QLFFHZ2EUSCCAV736I5FLPRSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15GMG7RHNGKL3?ASIN=B001JK64M8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2013",
                "reviewTitle": "5.0 out of 5 stars Wonderful, And May Be Prophetic",
                "reviewText": "[A word of warning: This review contains all manner of spoilers.]I read Arthur C. Clarke's Childhood's End many years ago. I also read it to my son when he was eight. So why did I come back to a book that was originally published in 1953, read it yet again, and feel it necessary to write a review?What got me thinking about Childhood's End again is the emergence of the Internet as force for change within the Global Community. Also, my limited experience teaching university students impressed upon me the impact that the Internet is having on the minds of our young people.As a novelist myself and an author of a book on how to write a novel, I first must say that Childhood's End is marvelously plotted. It starts off with a startling revelation: Earth is not only being visited by extraterrestrials, called Overlords, but they have come to take over the world, prevent our annihilation, and impose restrictions on human activities that will insure not only our survival but also that we prosper. This then locks the conflict (first plot point) between humans and ET, and as with so much of Clarke's fiction, the conflict is at a relatively low level. ET, or the Overlords in this case, is here to help.When one group, the Freedom League, wishes to oppose the Overlords more forcefully, they are soon subdued, non-violently. The one thing the Overlords will not do is show themselves. Humans make an attempt at seeing one of them, but don't get away with it. As a result, the Overlords agree to let them see them, but not for another fifty years, two generations. This then is the second plot point, which occurs 20% of the way through the story, a little short of where you'd expect it.As time drags on, humanity loses its edge. We are no longer as creative as we once were, and culturally we have stagnated. Utopia is never all it's cracked up to be. And the time finally comes when the Overlords reveal their physical selves, and a strange sight they are, and yet immediately recognizable. They are the very image of Satan, red skin, horns, and pointed tail, leathery wings. No wonder they'd been so secretive. However, since they had shown their goodwill through the years, little was made of their \"coincidental\" resemblance to an ancient symbol of evil. This revelation comes at the 1/3 point and a little beyond what we'd think of as the second plot point and well short of 1/2 point that we'd think of as the third plot point.At the mid-point of the novel, we get a true reversal. At a party, guests play a game similar to a Ouija Board. One of the participants asks, \"Which star is the Overlords' home?\" And the answer they get back is \"NGS 549672.\" Only one of the guests realizes that this is a database entry for a star forty lightyears away in the constellation Carina. This person then starts making plans to stowaway on the next Overlord spaceship to their home. The Overlords have subdued the humans up until this point, but now one of them is on the hunt to find out more than the Overlords wish them to know. This is plot point three.Just before the three-quarters point, one of the earthlings stows away on the Overlords' spaceship and leaves earth with them. His journey there and back will take eighty years, Earth time, but just a few months in relativistic time above the rocket traveling at close to the speed of light. Just a little later, at the three-quarters point in the novel, a strange event occurs. An Overlord saves one of the human children. For some reason the Overlords believe he is special. And then children all over the world start having strange dreams and developing telekinetic powers. This is what the Overlords have waited for all this time.At the end of the novel, we learn that what the story has been about all along is the children. The human race is entering a new phase, one that will only manifest in our children. They are becoming something other than human beings and metamorphosing into something that transcends human existence. It's as if the worm finally becames a butterfly. And we learn that those who have been known as the Overlords are actually only caretakers of the human race while it undergoes the transformation into something spiritually superior to human beings. The children no longer relate to their parents, and the parents have no knowledge of their children. It's a clean break.As it turns out, the Overlords are a tragic species. They cannot and never will make the transformation to this higher plane. And they take their orders from yet a higher power, the power that then comes for the children of mankind. The Overlords are a dead-end species from another world and can only witness the process, foster it, but never undergo it themselves.The denouement comes with the man who had hitched a ride on the Overlords spaceship and gone to their home planet. He returns after eighty years, having seen the home of the Overloads and what a magnificent species they are. But he is the only human being left on earth, and he witnesses the end of the human race.One other interesting facet of Clarke's novel is that, since the story is spread over 150 years or so, he uses a series of third-person limited narrations. He skips from character to character as his story dictates. He even uses a couple of the Overlords as point-of-view characters. This he does with skill, so it never seems artificial or lacking knowledge of craft. Always professionally executed.Perhaps you can now see why I was so interested in taking another look at this story. Our children of today are growing up in the presence of the Internet, something no science fiction writer saw coming. And yet, it seems to me that Arthur C. Clarke did, in a sense, see it coming in this story. Our texting, blogging, FaceBooking neophytes to the human race are a strange species with unusual powers developed by virtue of the Internet. They are leaving us behind, and heaven knows what they'll become in the future. It does appear that they are making a clean break from what the human race has been. Let's just hope that they can store away a little of our humanity for future reference.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aistė",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOYN2EIRYFI7U3AM352NS5BGN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28L7YH8HBGG9J?ASIN=B001JK64M8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Slightly disappointing",
                "reviewText": "I was waiting for some turn of events, for something to happen, but it never came. The book was building up hopes and then giving slight disappointments.Also, it was probably meant to show some amazing achievement for humanity, but it rather feels like horror and opposite of progress.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher P.Christopher P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7OOMU3ZRM72R2E5BW3EWPDM2LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MBHWPIV7VAH?ASIN=B001JK64M8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2022",
                "reviewTitle": "5.0 out of 5 stars A Childhood Favorite Lost and Found: “Childhood’s End” by Arthur C. Clarke",
                "reviewText": "I first read Arthur C. Clarke’s “Childhood’s End” when I was myself a child. My brother and I were in a race to read all of the world’s “greatest literature”, and this book had come up as one example of the great Science Fiction of all time. It also happened to be available in our hometown’s library, which is a primary concern when the only transportation you can access is a bike.It was a small book, so it received a slot somewhere between “Don Quixote” and Machiavelli’s “The Prince”. In our family we were forbidden to watch movies, so I had never even heard of “2001: A Space Odyssey.” Nothing prepared me for the experience of Clarke’s writing.In the prologue “great ships descended in their overwhelming majesty.” Then we skip over the first encounter and go right to the Secretary-General of the United Nations, Stormgren, being carried up in a metal bubble to attend his regularly-scheduled meeting with the alien Karellan, “fifty kilometers above the earth” (p. 20). As always, their conversation takes place by way of a “vision screen” which allows Stormgren to be seen but which obscures Karellan.What is Karellan? What does he look like? What is desired by the alien race that he represents?Clarke masterfully lets us develop our own inquiries. Slowly he answers them, but in a way that raises still more questions. The revelation of Karellan’s true form is particularly effective when realized this way.The story jumps over decades. The questions grow deeper. Clarke is the teacher. It is the questions that matter, the answers are beside the point.It is a strange story to read in our day, when easy answers are always at our fingertips. Why did Stanley Kubrick choose to collaborate with a writer who had a reputation as a recluse? You can Google it. We have facts at our fingertips. The answers come to us instantaneous, like our burgers and our fries.This alien race to which Karellan belongs, our Overlords, give us the power to see into the past using an instrument—“nothing more than a television receiver”—“on permanent loan to the World History Foundation” (p. 74). Upon seeing the “true beginnings of the world’s great faiths … mankind’s multitudinous messiahs … lost their divinity” (p. 74-75). Knowledge comes at the cost of the ancient gods.There is a kind of utopia that emerges, well in line with millennial theology but equally comfortable to those who prefer Hegel or historical materialism. Clarke takes no position. It is enough to show that the human race “matures.”Clarke manages to maintain tension by continuously drawing attention to the question, “What lies at the end of progress?” An uneasiness predominates, reaching into dinner parties, family life, unsettling leisure. A weight presses down upon humanity.Clarke takes us through to the end, answers all of the questions that he can with the objectivity of an impartial observer. He delivers fireworks and foreboding in equal measure.C.S. Lewis supposedly said, in 1956, that this book, “Childhood’s End,” is the greatest Science Fiction of all. He certainly called it “AN ABSOLUTE CORKER!” (along with a lot of other praise in a 1953 personal letter to Joy Davidman-Gresham).Returning to the novel now, as an adult, I value the questions that Clarke raises. More than that, I get lost in his thoughts, swept away.I cannot imagine a maturity that comes from knowing all of the answers, that exists in possessing the technology which delivers to us our daily bread. Progress is not “the true and only heaven”, much as Christopher Lasch argued.There remains something wonderful to be found in not knowing it all, in wondering how it all turns out. It is still hidden there, beckoning to us, patiently waiting for us to look up from our electronic screens long enough to notice that a universe more vast than any ocean exists. The mind has room enough to roam.There is a magnificence in raising questions, in puzzling over mysteries, in imagining. “I think, therefore I am.”Arthur C. Clarke certainly understood that. In writing “Childhood’s End” he performs a miracle, a story that is as enjoyable closer to the end of life as it is nearer to its beginning. It is the best kind of speculation.",
                "reviewVotes": "44 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/718t9YHK1iL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jazz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2023",
                "reviewTitle": "One of my top 10 books of all time.",
                "reviewText": "This is my favorite Clarke novel.I first read it back in 1976 for grade 11 English class as part of the curriculum.I've read the book about half a dozen times since then over the years and I am amazed andget something new out of it each time.I believe it has something to do with age. I was 16 when I first read it, and at the age of 64, I am ready to read it once again as my perspective on life and the world has changed over the years as it does for most as we go through life. In doing so, I suspect that I may come away with yet a different reaction to the book itself and the true meaning of the book on a much more personal level?I won't go into detail in terms of providing a review of the book itself as it would be a long one.The best I can say is that get what you can from other reviews, purchase the book, read it and decide for yourself. I personally would not classify it as Science Fiction, but rather a book about humanity.I have no complaints about this book at all, and that is rare in that you can usually find a flaw or two along the way in the best of books. I didn't with Childhood's End.For me, it was one of those rare books that had me stop along the way to ponder what I had just read.I love that in a book.I would certainly recommend this book to anyone as I consider it a classic, and for me,Arthur C. Clarkes best.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo Gutnik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 2, 2023",
                "reviewTitle": "A Book that sticks into you",
                "reviewText": "There's readings you know when it ends. Otherwise there are those which keep open on your mind forever. Sir Arthur C. Clarke are an author that knows how to push your buttons. Read it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 7, 2022",
                "reviewTitle": "Buen libro",
                "reviewText": "Tiene el sello característico de Clarke: Mucha intriga en la trama y finales pésimos. Pero no deja de ser interesante el planteamiento que realiza.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Escobar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 18, 2024",
                "reviewTitle": "The blueprint for Three-Body Problem",
                "reviewText": "Never read anything by Arthur C. Clarke before outside his anthologies of weird non-fiction, but this was a smooth, beautiful read. Old-fashioned for sure, but a science fiction cornerstone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on March 25, 2019",
                "reviewTitle": "Un gran clásico de la ciencia ficción",
                "reviewText": "Es increíble que este libro tenga tantos años... Me ha gustado mucho, la verdad. Me ha parecido increíble como el contexto de la novela evoluciona a la vez que los acontecimientos de forma muy natural. Es verdad que el final podría ser un poco más directo, pero no desmerece para nada el libro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}