{
    "remaining_requests": 1536,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Looked-Beyond-Stars-Sheena-Meyer/dp/1700075721",
    "body": {
        "name": "The Girl Who Looked Beyond The Stars (Sheena Meyer)",
        "price": "$9.24$9.24",
        "originalPrice": "",
        "rawPrice": 9.24,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Looked-Beyond-Stars-Sheena-Meyer/dp/1700075721",
        "soldBy": {
            "sellerID": "A1ZWVJTZO5RWFA",
            "name": "ZBK Wholesale",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZWVJTZO5RWFA&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41AosI7PhnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41BzPlhqcVL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "L. B. Anne",
            "link": "https://www.amazon.com/L-B-Anne/e/B07Q2XH1NY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ZBK Wholesale",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3245,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review ★★★★★ Reviewed By Kristen Van Kampen (Teen Reviewer) for Readers' FavoriteWhen The Girl Who Looked Beyond the Stars by L. B. Anne begins, Sheena Meyer is just an ordinary girl, but that doesn't last long. Her life changes when her father gets in a car accident and she goes to the hospital to see him, where she also sees a glowing creature that miraculously heals her dad. It is also the first time she meets Mr. Tobias, who says she's a gleamer who can see things normal people can't. Suddenly, mystical things keep happening to her, including vivid dreams that come true, text messages from an unknown number, and she meets a mysterious new girl who acts oddly. Then, in one of her talks with Mr. Tobias, she learns that something called the Murk is coming for her. What will she do?With interesting scenes and well-developed characters, The Girl Who Looked Beyond the Stars by L. B. Anne is a very enjoyable read. The book has a good balance of thrilling and dramatic scenes and funny parts that make the book exciting without making it too intense. The characters were very likable and relatable, and I thought the way the characters interacted was very realistic, especially between Sheena and her mother. I also loved the way Sheena and her friends were very close and joked around with each other. The book was very well written and I liked the narration style from Sheena's perspective. The story is original, suspenseful, and has a very interesting plot. I was hooked by the first page and didn't want to stop reading. I would definitely recommend this book.★★★★★ Safe, clean, great reads for middle schoolers! Amazon ReviewerI have a 13 year old daughter who loves to read but we are really cautious over what she reads. She is also really picky about what she reads so finding something we approve and she likes can be a challenge. I read all 3 books in the series before giving them to her and loved them myself! They're we're a fun light read as an adult and they were safe but interesting for a middle schooler to read. The first day I had her start reading she read 11 chapters in The Girl Who Looked Beyond the Stars because she couldn't put it down! She can't wait to read more and says she'll finish all 3 quick because they're so good and she has to know what happens! Also love that the main characters are black and they talk about curly hair, it's great for my daughter to read books with characters who represent what she looks like. Thankful I found these books for my daughter!★★★★★ I'm just elated mother who wanted to extend her light to you on behalf of my little Queen! I purchased The Girl Who Looked Beyond the Stars in May 2021 for my daughter's monthly book haul. I have only one word to describe her reaction: GLUED!From beginning to end, my daughter was enthused and couldn't help but share how much Sheena and herself are alike. I can't thank you enough for creating such a phenomenal series. You've given young ladies of color the opportunity to see themselves in world of fantasy that doesn't showcase melanin enough.Your voice has impacted my daughter's life and for that we are ETERNALLY grateful!My daughter is eager to continue the series. We extend our love and light ALWAYS in ALL WAYS!"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 5 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 5 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"This story is a captivating blend of Christian science fiction, fantasy, and mystery. For 11-14-year-old readers who enjoy books such as A Wrinkle In Time.\"\"Do you believe in angels?\"\"The Girl Who Captured the Stars, the first book in author L.B. Anne's Sheena Meyer series is fantastic! I like how Sheena figures out she has powers, and how she trusts her friends but wants to protect them also. Some parts of the story are sad. Some parts of the story are scary. But some parts of the story are so funny, they made me laugh out loud!\" Amazon Reviewer\"What am I?\"Sheena Meyer is the girl who brings an extra lunch to school each day just in case someone doesn't have lunch. She's also the girl who questions and investigates everything, driving her parents and teachers nuts. She spends most days waiting for some grand event to happen and change her life, but she won't have to wait much longer.The Murk is coming for her because of a gift she doesn't know she has.Nine years ago an angel appeared in front of select kids all over the world. In Michigan, it appeared in a willow tree in front of a four-year-old little girl. She's the only child who saw it, the one with the gift. Sheena is now thirteen and has since forgotten what she saw. But things change when her father is in a terrible accident, and she witnesses a supernatural being save him.\"I saw what you did. Come Back!\"An elderly man, a peculiar new kid at school, and mysterious text messages will change everything Sheena has ever believed in, sweeping her out of a humdrum, teenage, existence, and setting in motion what one little girl's destiny can mean to the world.★★★★★Safe, clean, great reads for middle schoolers! Amazon ReviewerI have a 13 year old daughter who loves to read but we are really cautious over what she reads. She is also really picky about what she reads so finding something we approve and she likes can be a challenge. I read all 3 books in the series before giving them to her and loved them myself! They are a fun light read as an adult and they were safe but interesting for a middle schooler to read. The first day I had her start reading she read 11 chapters in The Girl Who Looked Beyond the Stars because she could not put it down! She can't wait to read more and says she will finish all 3 quick because they are so good and she has to know what happens! Also love that the main characters are black and they talk about curly hair, it is great for my daughter to read books with characters who represent what she looks like. Thankful I found these books for my daughter!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Independently published (October 28, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 181 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1700075721"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1700075727"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 10 - 12 years, from customers"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.46 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,549 in Books (See Top 100 in Books) #1 in Teen & Young Adult Christian Fantasy #1 in Teen & Young Adult Christian Science Fiction #23 in Teen & Young Adult Coming of Age Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 3,245 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/ee03620b-5612-4339-8eee-deb6193720a0.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Micah Munroe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5DFIY6I2FXRBDKPI72SNS6KGZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28ACQP43N28ML?ASIN=1700075721",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Lord this is good",
                "reviewText": "I’m buying this for my daughters.I’m probably gonna buy all the series for them.These days it seems the world‘s gone crazy, dark, and terrible. This is a book about being light in the darkness. I love it.This has the flavor of Madeline L’Engle reborn.Relevant for kids. Right on the truth too. Close enough that you think it was written by somebody who was there.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "babycakes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGD3SIVTNRWYW4DHRIHPC24UY4BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UB12HSOGMBT4?ASIN=1700075721",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great",
                "reviewText": "Granddaughter loves the author",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Silver",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHEJDAJGWHVVNGIBKMZMP3WMHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38O8U5H4TERRJ?ASIN=1700075721",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars My daughter loved it.",
                "reviewText": "I handed this book to my daughter (12) on her way up to bed last night. She didn't come down this morning until noon because she'd stayed up late reading it, then picked it back up first thing when she woke up to finish it off. I asked her what she thought, and she immediately asked for the rest of the series. Sounds like a 5 star book to me!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jodi Cerda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNNELRJO3YUJEHEBDXNP6ZRXJ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V8EEL1HQ2II7?ASIN=1700075721",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars Good but confusing",
                "reviewText": "My 12 year old loves to read. She said that the book was good but a little confusing at times. She also said that it could be a bit scary for younger readers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELQ3EK2M57NY6DG35TDZRT6JA5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWUJ48OUVK691?ASIN=1700075721",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars best first book",
                "reviewText": "Today was my first time using Amazon reader. It had me addicted to the story ! Thank you Amazon.Earlier, I had nothing to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIV23O65HRUXCBSCBIVQBQG243Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFKFXLIN5HD37?ASIN=1700075721",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 14, 2023",
                "reviewTitle": "5.0 out of 5 stars A Dream Come True",
                "reviewText": "Wow! What a riveting story. I have dreamt of a Christian fantasy and may have found it in this book series.I started reading this, as a 50+ yr old great aunt, to make sure it would be ok for my great niece to read and have ended up loving it myself! The characters are well rounded, the use of spiritual concepts so far are appropriate for youth and I appreciate that the parents and adults are mainly depicted as allies albeit protective. I hope this continues to be a book for young people that portrays parents and adults in harmony and protective authority over the youth in their sphere of influence. Cannot wait to read more. Excellent easy to read, and exciting adventure.So far, this will be on my Christmas list for a number of youth in my circle of friends and family.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mabg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAWAXEYKUGM5BW6B5OCEMXZQE2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PUY1SIBERX6U?ASIN=1700075721",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2021",
                "reviewTitle": "5.0 out of 5 stars well written",
                "reviewText": "Character-driven teen/preteen story about angels. Christianity is definitely in there, but not pushy, just as the ground of Sheena’s life. Sheena is an interesting person, at once strong for justice and caring about others, while also flawed and human. Her relationships with other kids are also outside the usual mode: she sees the cliques at school very clearly but also feels she shares something with all of them. She has few friends but lots of people she interacts with, and cares a lot for the little boy next door, while also sometimes wishing he’d leave her alone. It’s a more balanced portrayal than most, and her emotions and reactions feel age-appropriate and right for who she is. The author walks a fine line very skillfully. My one con is the book feels a little slow. The mystery is introduced around the halfway point, which is a little late, and Sheena doesn’t really get much further than understanding there are unusual spiritual forces interested in her. I wish we’d gotten a fuller picture than that of what was happening before breaking for book two. I’ll read another one because I enjoy the author’s portrayal of Sheena, and hope that more happens in the next entry.A very small niggle that has nothing much to do with the story:A Vow of Purity ceremony (a promise by a young girl to stay chaste before marriage, made to her dad) is mentioned early on and I thought, as I always do: “Why don’t evangelical boys take the same Vow of Purity to their moms? Isn’t a boy’s purity expected to be just as much a part of his faith as a girl’s is? And what better way to help remind a boy to respect women than by having him make a vow to his mother?” Doubt it will happen, but I really wish those expectations and promises were more balanced. . .",
                "reviewVotes": "63 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lenae Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECENONMIQWTYAYDCAY4ZBIV5LFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHA8MSDTCAST7?ASIN=1700075721",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Review",
                "reviewText": "My granddaughter loved this book",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad k",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2023",
                "reviewTitle": "Great book.",
                "reviewText": "This book was purchased for our niece and she absolutely loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MrsGamb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 11, 2022",
                "reviewTitle": "Great book",
                "reviewText": "My 13yo daughter absolutely loved this story and has asked for more by the same author for Christmas. She said it was hard to put down!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richa yadav",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 10, 2022",
                "reviewTitle": "It was good",
                "reviewText": "It was a good read but again I wouldn’t read more than 1 chapter at a time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cathy F",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2023",
                "reviewTitle": "Great book",
                "reviewText": "Daughter loved this book, will be buying the rest of the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Snowdrop",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2023",
                "reviewTitle": "Bought for my granddaughters",
                "reviewText": "Sent to Canada as a gift for my granddaughter’s",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.78",
                "sellerName": "ZBK Books",
                "sellerRating": "4.5"
            }
        ]
    }
}