{
    "remaining_requests": 1414,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Babble-Visionary-Fiction-Novel-Science/dp/1930328125",
    "body": {
        "name": "Babble: A Visionary Fiction Novel with a Science Fiction Theme (The Cosmic Conspiracy Series)",
        "price": "$13.95 $12.56",
        "originalPrice": "",
        "rawPrice": 13.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Babble-Visionary-Fiction-Novel-Science/dp/1930328125",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41jgVAlIY1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51JjgKl-hmL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "W. Bradford Swift",
            "link": "https://www.amazon.com/W-Bradford-Swift/e/B001JPA0CI/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by -Bookworm-.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 64,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 50 mins",
            "FREE delivery Wednesday, February 28.",
            "Or fastest delivery Tuesday, February 20. Order within 3 hrs 50 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "One young boy is the key to the universe.On the brink of a new age, the human race leaps forward into the evolutionary void, changing the course of history forever. For young Bobbie Cagle, the normal difficulties of growing up are overshadowed by his unique condition. Bobbie’s inability to communicate normally is misdiagnosed for years as autism, and masks the great part in history he is destined to play. His unique ability to create beautiful works of art is just the tip of the iceberg. Coveted by those who would use him for their own purpose, Bobbie and his mother flee their home out of desperation. In the course of their escape, the truth behind Bobbie’s gift and the effects it may have on the planet begin to the reveal themselves, as the future of the humanity hangs in the balance. Find out what fate has in store for the human race and grab your copy of Babble today! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Porpoise Publishing (September 4, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 246 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1930328125"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1930328129"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.56 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#716,780 in Books (See Top 100 in Books) #1,313 in Metaphysical & Visionary Fiction (Books) #2,763 in Alien Invasion Science Fiction #3,640 in First Contact Science Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 64 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marie B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFRMBXM2U3MO34THRJ3236RWKJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36PJL53KKYK2Q?ASIN=1930328125",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2016",
                "reviewTitle": "5.0 out of 5 stars I disliked having to put the story down after lunch break ...",
                "reviewText": "Babble – Book 1I did pre-order this book, and then received a pre-release copy from the author in exchange for an honest review. My review is based on the pre-release copy.Overall, I would have to give this a rating of 4.7 out of 5 stars.I sank into the story right away. I disliked having to put the story down after lunch break was over or to actually get a few hours of sleep before having to work in the morning.There were only a handful of instances where I noticed a wrong word or an apostrophe-s instead of just the single s on the end of a plural word. (One instance nearing the end was let’s instead of lets.) Beginning or end quote marks were missing from dialogue sections maybe seven or eight times that I noticed. And there was one instance about 27% of the way through where the wrong character name was used in an action.I did have an issue sometimes knowing when the point of view changed between characters, but I discovered it’s because the large font size that I have to use prevented me from seeing the multiple line spaces between those sections. When I changed the font size smaller close to normal settings, I saw the adequate spacing. So this issue did not count against my rating, but it could be an issue for others who also have to use one of the large font sizes.One item that definitely affected my final rating and sticks in my mind is the character of Arnez. He starts out feeling like an older frat-boy who is in a boring government job. And then he suddenly turns nasty and rude, and then flip-flops for a fair part of the story. I got thrown out of the story a few times as he’d pendulum shift.Even with those few issues, I still greatly enjoyed the story. And since the name (inside the book) indicates that it is book one in a series, I will pay close attention to the author’s newsletter for the next installments. ~grin~",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIRA7H2D5XKP4AWE55ZJB3GQURQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KAC36BAABC7T?ASIN=1930328125",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2022",
                "reviewTitle": "4.0 out of 5 stars Humanity's potential for evolution and the Earth’s divine relation to the cosmos",
                "reviewText": "For Angie Cagle and her son, Brian, life on the run has become normal. As the story unfolds, we find out that Bobbie has a very unusual way of speaking, and a peculiar obsession with building towers. Is it the gift of tongues? Autism? Something else? Whatever it is, a lot of people are interested. A medical institution. A charismatic church. Bobbie’s former husband. Homeland Security. And Angie is trying to protect Bobbie from all of them.After a decade on the run, everyone seems to be closing in on them. Bobbie is sixteen and his mom is determined to stay a step ahead while they travel to a mysterious place in West Virginia. Part action adventure, sci-fi, visionary, and mystery, the story provides plenty of character and action. It asks interesting, philosophical questions about humanity’s potential for evolution, and the Earth’s divine relation to the cosmos.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVNQCO2A7NJS6TIWXFD7SIXZEQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZWACRHSHTI7X?ASIN=1930328125",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2019",
                "reviewTitle": "5.0 out of 5 stars Bobbie and his mom are on the run from the government.",
                "reviewText": "Bobbie seemed to be an autistic child who had a gift for building towers. His mother finds trying to keep him safe is a dangerous proposition. Excellent book with some real thought provoking ideas.Read and enjoy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dennis Moss",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4VFNSQMWWVFUNMZFZSMAKR2OOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VPFEAX0EISR?ASIN=1930328125",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Boy becomes a man!",
                "reviewText": "I enjoyed reading this book. It was a coming to life novel. A young boy become a man even though he didn't know he was. I would read other books from Orrin. Thank you for letting me in first!.I received a free copy of this book via Booksprout and am voluntarily leaving a review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Archbishop",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF6R3TJ367AAJSK4H5TZV5TBSEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FLIZDSWIV7WY?ASIN=1930328125",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2019",
                "reviewTitle": "5.0 out of 5 stars Communication is important",
                "reviewText": "For the record, I received an Advanced Review Copy of this book with the request that I leave a voluntary honest review for other potential readers. Having said that, here is my honest opinion and review of this book. I like this story. The plot is rather unique and not similar to anything that I can recall ever reading before. Is has plenty of interesting twists and turns to keep you guessing where the story goes next. A child and his mother following a path to Destiny that can only be picked up intuitively. Each of the characters is well developed and has his or her role well thought out along with their motivations. The development over the course of the story is well balanced with the information needed arriving just when it is needed. This strange future world is well constructed and plays out very convincingly. The writing is good and easy to read while the pace of the story builds well until the climax. All in all a very good read and well worth the time to read it. I am looking forward to the sequel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen Siddall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKQHBJ3DPV6WC2FM4DCKK5RILZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CLTOU1XYASFX?ASIN=1930328125",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2019",
                "reviewTitle": "4.0 out of 5 stars It's a Thriller! It's a Mystery! It's the start of an epic SciFi tale!",
                "reviewText": "Angela and Brian Cagle were happy. An unlikely match, they had worked hard to make their marriage work, and when Bobbie was born, their happiness just expanded.As Bobbie grows, he begins to exhibit some unusual traits. As an infant and toddler, he doesn’t develop speech as expected but babbles in an extraordinary way that the members of the Cagles’ charismatic church family claim is “speaking in tongues.” But the babbling doesn’t fit the known patterns for it to be glossolalia. Too, the boy doesn’t engage with others at all but has spells that come over him in which he repeatedly builds towers out of bits and pieces he finds at hand.Against Brian’s wishes, Angie takes the boy to the nearby university medical research hospital to try and determine why their son is the way his is. But when Homeland Security takes an inexplicable interest in Bobbie, too, Angela grabs the boy and flees leaving Brian and everyone she knows and loves behind.Now, after a decade on the run, they are closing in and Bobbie’s father is with them. As Bobbie approaches his sixteenth birthday, things are starting to come together, leading them to a mysterious location in the West Virginia mountains.This story is definitely not over! The action was fast and tense and as much as Angie is in the dark about what is going on with her son, the reader is as well. Is the human race ready to evolve to a new level? Are aliens guiding our development? Is it God’s plan? The story is well written, entertaining, and fresh. Recommended for a variety of readers because this is a thriller, a mystery, and an epic scifi tale!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}