{
    "remaining_requests": 1454,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Gathering-Blue-Lois-Lowry-audiobook/dp/B001G8MAPI",
    "body": {
        "name": "Gathering Blue",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Gathering-Blue-Lois-Lowry-audiobook/dp/B001G8MAPI",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51CDwSqcR4L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lois Lowry",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Lois+Lowry&search-alias=audible"
        },
        "brand": "Lois Lowry&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 8660,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Lois Lowry’s Gathering Blue continues the quartet beginning with the quintessential dystopian novel, The Giver, followed by Messenger and Son.Kira, an orphan with a twisted leg, lives in a world where the weak are cast aside. She fears for her future until she is spared by the all-powerful Council of Guardians. Kira is a gifted weaver and is given a task that no other community member can do. While her talent keeps her alive and brings certain privileges, Kira soon realizes she is surrounded by many mysteries and secrets. No one must know of her plans to uncover the truth about her world and see what places exist beyond. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            },
            {
                "name": "Social & Family Issues",
                "link": "https://www.amazon.com/Teen-Young-Adult-Social-Family-Issue-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10368546011"
            },
            {
                "name": "Family",
                "link": "https://www.amazon.com/Teen-Young-Adult-Family-Fiction/b/ref=dp_bc_aui_C_5?ie=UTF8&node=10368555011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "5 hours and 27 minutes"
            },
            {
                "name": "Author",
                "value": "Lois Lowry"
            },
            {
                "name": "Narrator",
                "value": "Katherine Borowitz"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 16, 2008"
            },
            {
                "name": "Publisher",
                "value": "Listening Library"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B001G8MAPI"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,367 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Teen & Young Adult Fiction on Disabilities (Books) #46 in Family Life Fiction for Children #72 in Teen & Young Adult Family Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shaunabee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2YIO2Q3KJTUOZQMR6AB57KXP7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14X2ISBMBXW7E?ASIN=B001G8MAPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2016",
                "reviewTitle": "5.0 out of 5 stars Don't end your Lois Lowry experience with The Giver - Gathering Blue will keep you looking forward to more",
                "reviewText": "I have always loved to read, but after becoming a mother, working in a very demanding profession that requires extended deployments each year, and working towards my master's degree at night, I found myself failing to devote much of my very little free time to reading. Last year, I decided to change that and sought to find recommended series that would draw me in with great characters, a fascinating story line, and intriguing implications about real life.My favorite series of all time has been the Ender's Quartet and I also really enjoyed other Young Adult (YA), Apocalyptic, Utopian,or Futuristic series like the Hunger Games. In all of my searches and the many \"Top 10/Top 100\" lists that I came across, The Giver Quartet was among the top choices for both teenagers and adults.Before I get into some of the more detailed review (and potentially spoilers), if you only want to know the basics, here it is: The book Gathering Blue follows The Giver very well. It is an easy to read book, as is the entire series, and if you are an avid reader like me, you could finish the entire series within a weekend. Gathering Blue, which appears to lead the reader into a completely different world from The Giver, ends with a twist that ties the two books and the series together. I thoroughly enjoyed the characters and the plot and would highly recommend this for anyone looking to find a series worth spending time on.Now, for more detail.Like many others who have read Gathering Blue, I consider The Giver one of the truly great books that everyone should read. I had read George Orwell's 1984 in the past, but found that The Giver was an even more powerful story. Gathering Blue does not have quite the impact on the reader as The Giver, but I think part of that may be due simply to the fact that it is in the shadow of The Giver and not read as a a separate story. If this were read on it's own, I think it might be even more highly thought of. That being said, it is difficult to review this book without comparing it to The Giver.The society outlined at the beginning of the book does not appear to be living in such a compelling state of deprivation as what was introduced in The Giver. Kira, the lead character, is endearing as a tough heroine facing an unsympathetic world. She can be related to and she is likeable. The futuristic world that Lois Lowry describes is not unrealistic and does not require the reader to understand a completely foreign world. It could very easily be a version of our own world in the future. For readers who have enjoyed Game of Thrones, Ender's Game, or Dune, this world does not rely heavily upon sci-fi or fantasy ideas. It feels familiar and real, enabling the reader to be transported easily into this brutish and complex survivalist world. Where the Giver was more futuristic, this world in Gathering Blue appears to be more primal.What I like about this world and this story is that it does feel very much like one of many versions of our own earth's future. Kira lives in a community that does not accept her due to her disability, despite her special talent for embroidery. After suffering through tragedy and being forced to face a challenge for her property, Kira is brought into a world that she had no idea existed. I enjoyed that Lowry tied in our own world so well to the book, to include what Kira describes as the song and images which tell the \"story of mankind\".The story was enjoyable, easy to follow, and draws the reader in. Yet, the favorite part about this book is that it is tied to The Giver at the very end. I won't spoil that ending for you, but I will reassure readers that this book provides an intriguing and heartfelt story that leads right into the third book (Messenger). If you enjoyed The Giver, definitely don't miss out on the rest of the series.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Finish.your.fing.book ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3HFG76OHEKZEAKYMJ6CARQ4W3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UH03JZK1N8I6?ASIN=B001G8MAPI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars A mellow read",
                "reviewText": "I enjoyed the story because it had a unique view. It had a very similar concept to the first book . However, I found many parts a bit slow and could understand why it wouldn’t be for everyone. I still was satisfied even though there were a few moments I wish were discussed further. Similar to the first book the ending is open ended. Which is fine, but the more it’s done throughout the series. The lazier it feels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEG7L73Z2YRAHGRHZRXACZ5R5B4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH4DOEWSVAKTU?ASIN=B001G8MAPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Good book",
                "reviewText": "Book arrived as said",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NY knitter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWO6QGNMDOLXS2QYXUKXJD4X43Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RL4TMC9XEH3Y?ASIN=B001G8MAPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2015",
                "reviewTitle": "5.0 out of 5 stars Amazing Novel!!! Kept my life going!",
                "reviewText": "The Book , Gathering Blue, by Lois Lowry, is the second book in the Newbery winning, The Giver quartet. Gathering Blue is rich with detail, it causes the reader to feel like he is \"inside\" the book or to \"feel\" what is in the book. An Example,\"He went to a shelf above the table where he kept his tools and took down a piece of light-colored pine small enough to fit into the palm of his hand (Page 116-117.) Gathering Blue and The Giver both have lessons the author is trying to point out. Gathering Blue is trying to say that someone with a disability can still do big things. The Giver is saying that taking away hate and anger also takes away joy. Both books are based in communities with flaws. The Giver's community is governed well and has mass production of food and people, but lacks memory and emotion. The Gathering Blue community has lack of food and control.This novel starts off with Kira, the dreadfully disabled young girl at birth, who lost her mother from sickness three days earlier. Kira finds Vandara, a tough young women who killed a bear bear-handed, and the other nasty mothers at her land. Vandara want use Kira's land to make a pen for the tykes (little kids.) Vandara takes the problem to the council of guardians, who gave Kira the title of weaver, because of her great abilities. Kira was given the task of repairing the singer's robe. One problem: Kira does not know the art of dying threads. Kira must learn from old Annabella, who lives deep in the woods. Kira is left to find out a peculiar mystery that can change her life. The plot of this novel is very gripping and brings the reader to the story world.The details of this book are interesting because of the author's sense of natural surroundings. The author uses the \"show not tell\" method really well and makes the emotion stand out. The author explains the detail without getting off topic. One example of this, \"Although thick trees shaded the path and they could hear rustling in the undergrowth and unfamiliar cries of forest birds, nothing seemed threatening\" (Page 87.) This detailed sentence expresses a bunch of different ideas in one sentence, as in them being cautious and alert.I would recommend this book because of the how to author creates her characters. My favorite character is Matt. He is a funny, overjoyed character with an accent. He is always making jokes and is always their to help. An example of this, \"Me and Branchie, us is tough. We only look wee\"(Page 86.)Matt changes and becomes less childish and more serious as the book progresses and the next book, Messenger, which Matt is the main character.I would overall recommend this book to fans of well-written science fiction. Gathering Blue consists of enough detail, setting, and character detail and creativity that anyone would enjoy this book after reading The Giver. It is important to read these book in order because The Giver is the beginning of the saga of an long adventure and dangerous trades.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tammy Murray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN5MACORPMYJVWECML3QXYVTVLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GBQEVV51EY76?ASIN=B001G8MAPI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars why are they all open ended?",
                "reviewText": "This is the second book in a series that I cannot put down. They both have unuasual open endings. I hope that by the last book there will be some closure%",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley McLaughlin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 4, 2023",
                "reviewTitle": "Great series",
                "reviewText": "Loved the book , arrived in great condition as well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Isabel L C",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 15, 2022",
                "reviewTitle": "Exatamente o produto anunciado",
                "reviewText": "Avaliação do objeto: chegou em perfeito estado físico. É exatamente o livro descrito e apresentado nas imagens.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roopa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 5, 2023",
                "reviewTitle": "Story of resilience of a girl",
                "reviewText": "Story describes the struggle of physically handicapped Kira. Interesting read. Though I liked Giver and Messenger the best in the quartet",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lourdes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 26, 2020",
                "reviewTitle": "interesante libro",
                "reviewText": "Me gustó el tamaño y el tipo de letra. Facil de llevar y liviano",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Amandism",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 10, 2017",
                "reviewTitle": "One of the greatest book series of all time",
                "reviewText": "This may be aimed at YA but truely it is for all ages.It is thought provoking and the writing is just beautiful to read.The world that Lois Lowry creates is one of true brilliance.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}