{
    "remaining_requests": 1601,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Boy-His-Dog-End-World-ebook/dp/B07FHYLY31",
    "body": {
        "name": "A Boy and His Dog at the End of the World: A Novel",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Boy-His-Dog-End-World-ebook/dp/B07FHYLY31",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81dyWK9qzdL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "C. A. Fletcher",
            "link": "https://www.amazon.com/C-A-Fletcher/e/B07HM22FF3/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4897,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07FHYLY31"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Orbit; Illustrated edition (April 23, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 23, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3368 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 418 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#63,225 in Kindle Store (See Top 100 in Kindle Store) #451 in Contemporary Literary Fiction #710 in Dystopian Science Fiction (Kindle Store) #727 in Dystopian Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,897 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A Boy And His Dog At The End of The World",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/50c1bcf6-a341-46a3-8791-e20d893864e6._CR0,0,1080,1080_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/adeb5813-33b1-46b9-94c4-e3ab6ac9fbff._CR0,0,1080,1080_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0731c152-5880-4fd7-83b7-eed882b89601._CR0,0,1080,1080_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/50c1bcf6-a341-46a3-8791-e20d893864e6._CR0,0,1080,1080_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/adeb5813-33b1-46b9-94c4-e3ab6ac9fbff._CR0,0,1080,1080_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0731c152-5880-4fd7-83b7-eed882b89601._CR0,0,1080,1080_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Elisabeth Carey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHUGKXFMIR6BIX3DBCUHR4BEN4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFTE93HDDWHNU?ASIN=B07FHYLY31",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2022",
                "reviewTitle": "5.0 out of 5 stars A post-apocalyptic journey across Britain",
                "reviewText": "Griz's family lives on a little island in the Outer Hebrides, on a mostly depopulated Earth. Over a century before, something unknown, but referred to as the Gelding, caused the human reproduction rate to plummet to almost nothing. Griz's ancestors were among those who, as the population crashed, moved to remote areas where they wouldn't meet other people accidentally. The family consists of Griz, Griz's parents, and brother and sister Ferg and Bar. There was another sister, Joy, not much older than Griz, who is the youngest..Griz tells us the heartbreaking story of his sister Joy chasing a kite that got loose, and accidentally tumbling over the cliff.Between the rocks and the powerful surf, she couldn't survive, and they could never recover her body.One day, a ship with red sails arrives in their little harbor, carrying a man called Brand, who says he wants to trade. Brand, we soon learn, is a charmer, a storyteller, a liar, and a thief.This is where our story really starts, and it's a story told entirely, with one small exception near the end, from Griz's viewpoint, in a notebook that he carries with him.Brand adds color, fun, and a little news to the day, because strangers showing up is the only way to learn of what's happening away from their own island and their near neighbors, the Lewismen, on a nearby island. They all like Brand, and there is much talk about trading--but one of the things Brand wants to trade for is one of Griz's own two dogs, two small terriers called Jip and Jess. Brand wants Jess, because Jess is female, and dogs Gmuch as humans have dramatically collapsed in numbers. Griz says no. Everyone else says Jess is Griz's, and Griz won't give her up, ever.Brand laughs it off.Brand is invited to join them for dinner, and he brings his own contribution, something they've never had before, that he picked up in Spain--marmalade. They all eat and enjoy it, but Griz broke a tooth the day before, and the sweetness is too much for that broken tooth. Griz eats less than anyone else. Griz wakes up before everyone else, too--to find Brand is leaving, and all of Griz's family is sleeping very very deeply. He struggles to wake them, fearing they may not, and when his father is awake, they discover how much Brand has stolen, including all the fish they would have been both eating and trading in the coming weeks.And Jess. Jip is still present, but Jess is gone. And Griz sees Brand's red sails just about to disappear over the horizon. Jip and Griz quickly set off in the sailboat Sweethope, Griz's own boat, following Brand.What follows is a hard chase, with stops at places Griz never knew of, or had only read of in books gathered from \"viking\" abandoned towns and scattered abandoned buildings. There are several encounters with Brand, who proves to be in some ways cultured and educated, and who keeps insisting that Jess is his because he stole her, that he's not a monster, and that Griz, with no trace of beard at all, is obviously too young to be pursuing him, and needs to turn around and go home. He also tells Griz, repeatedly, that he's not a monster, a claim that Griz has good reason to doubt.Griz continues the pursuit, and learns a great deal about the way the world has changed. Harrowing encounters included an encounter with wild pigs, that he wouldn't have survived except for the chance arrival of a French woman who says her name is \"John Dark,\" or something that sounds like that. Griz does mention in passing, in the notebook he carries, that that's not what she really said, but what she really said was no more her real name than \"John Dark,\" but it was a good name and what she chose to be called.We see a depopulated England, and life (other than human) prevailing, and find both terrible and wonderful things, such as the Homely House. There are disturbing remnants of how people chose to face the end of their world, and some of the ways people are choosing to survive are disturbing too.All along the way, there are secrets to be discovered, and secrets to be revealed. including Griz's own. Griz also finds a lot to think about, how dogs have been with humans from the beginning, and were betrayed by humans in the end. We learn about the Freemen, who apparently maintained underground, electronic brains--as long as possible, until the last people who knew how died. And now, at least some of the Freeman are spreading la peste, the plague, the actual plague.I mentioned that Griz has a secret, but there's also another, major, secret, very important to Griz, that needs to be discovered.This was a slow read for me, because it's a post-apocalyptic novel, of exactly the kind I don't enjoy nearly so much as when I was a teenager living through the Cold War. (Okay, yes, the Cold War may be back again, but I no longer want to focus on the aftermath of it going hot in some way when I'm reading for leisure.) But this one was recommended by a friend, whose judgment on this I trust, and the trust was not misplaced. Even though I took a few breaks, I kept returning to it, because, yes, it's worth it.Also, all dogs encountered in the course of the book are alive and well at the end. Yes, that's something I require, to consider a book readable.Recommended.I bought this book.",
                "reviewVotes": "86 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denver Hawkeye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJW72PODO6FGYQMPUKWV4FF7ZYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33VYAH2PBXNHZ?ASIN=B07FHYLY31",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars An interesting dystopia",
                "reviewText": "Set in a world where nearly the whole population has been wiped out, this book only has a handful of characters from beginning to end. If there hadn't been a couple of dogs, I probably would have given up on the book. Inventive and memorable. Three and a half stars rounded up to four stars 🌟.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kdawg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6SINRA2G6JTNCEDFIXACLC563Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZLCRWSIT5P99?ASIN=B07FHYLY31",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars loved this",
                "reviewText": "Ok the cliffhanger sentences had me reading way into the night!! Was completely surprised….wait I don’t want to give that away you will just have to read it for yourself! You will not regret it! Thanks C.A. For a great adventure and perspective!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chefnash51",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEJDL3NNYZZ3YOA4JLRV2FGHXMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PTNT997PK4DG?ASIN=B07FHYLY31",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic. From beginning to end.",
                "reviewText": "Loved this book, couldn’t put it down. The story tugs at you… looking forward to more from this author",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Marx",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJA34IMOLDHW5P26LEZOVIZZNAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KTBL3FC0S2X0?ASIN=B07FHYLY31",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2020",
                "reviewTitle": "3.0 out of 5 stars Conflicted about whether or not to recommend this book",
                "reviewText": "First off, no spoilers.With that said, it's probably not the best idea to prominently feature a quote from Entertainment Weekly saying there's a \"gut-punch twist\" and even worse to open the book and have the first thing you see be the author's request to keep spoilers \"a bit of a secret between us\". That sets up expectations that most novels could never hope to live up to. And this book doesn't live up to those expectations.There are at least two revelations that are presented as shocking, but in both circumstances, it was easy to guess long before the actual revelations what was going to happen. And that was because of the overuse (to a ridiculous degree) of foreshadowing. The author can barely write two sentences without saying things like, \"When the sun went down, I didn't realize that would be the last time I saw sunshine until the next morning.\" Seriously, it got extremely annoying. Hinting at future troubles is a classic device in fiction, but this author keeps doing it multiple times in every chapter, making it ineffective and frustrating. Unfortunately, a lot of the writing felt amateurish like that.I enjoyed reading the book for the most part, but I can't imagine I would ever read it again. When I finished the last page, which ended with a god-awful pun that I'm sure was meant to sound deep and memorable, I immediately thought, \"I'll be donating this to Goodwill.\" I didn't really understand the point of the book at all. There were so many questions left unanswered, and I just got very irritated by the writer's habit of stating things for dramatic effect only to clarify later what really happened (which in almost every case wasn't dramatic at all). The fact that this is ostensibly a journal written by the main character after the events happened makes it all the more gimmicky.So I guess in writing this review I have decided: I would not recommend this book. I'm staying with three stars, because I did enjoy much of it and I wouldn't consider it a bad book by any means. But I'd never read this author again or reread this book. It was pretty pointless.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PJD1967",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 2, 2024",
                "reviewTitle": "A wonderful read",
                "reviewText": "I only chose the book due the high number of positive reviews. I normally read historical fiction by the likes of Cornwell or Scarrow. Although I'm only halfway through, I have to say this is a fantastic read. The book draws you into a post apocalyptic world that is not the usual and all to often post war mad max cliché. As a dog owner, I instantly related to the plight of the main protagonist, and am curious to see the outcome of his quest to reunite with his beloved dog. Well done on a great piece of fiction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "José Victor Vitorino Guimarães",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 10, 2019",
                "reviewTitle": "Its just great enough to earn a 6 star....",
                "reviewText": "The book is great, has good suspense, action and plot reveals to make you want to read and read until you see the book ended.I was fully engaged by this book, i felt the plot was awsome on tis own and even if the world creating wasnt big, it did seem to fit the narrative. I did predict some of the plot afther 50% of the kindle but that did not stop me from loving the book, i recomend it to everyone.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Badke",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 22, 2019",
                "reviewTitle": "No zombies here",
                "reviewText": "An end of the world story with no zombies? And no mutants and no crazy gangs driving around in messed up cars? Can it really be a post-apocalyptic story without at least zombies?It certainly can, and it is better because of it. This is a quest story with a difference: Our hero isn't looking for a way to restore the world (too late for that), he just wants to get his stolen dog back. This leads to adventure and suffering and friendship and growth for the hero, in a world that is no longer owned by humans, or even much interested in them.The story is very well told. There is enough detail about the radically changed landscape to provide a rich background, but that is just the canvas on which the author paints a vivid portrait of our hero, Griz. There are very few other humans in the story (or the world, for that matter). We get to know Griz as a very strong and determined person, making mistakes, enduring losses and pain, sometimes surprised by beauty and joy, but always true to the goal of finding the stolen dog.This is a beautifully written and moving story. Highly recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AmazonKunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 9, 2020",
                "reviewTitle": "great story with two unexpected twists",
                "reviewText": "The story has a good pace which never makes it boring up to the very end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 10, 2019",
                "reviewTitle": "Absolutely loved this book!!!",
                "reviewText": "I absolutely loved this book, from beginning to end, and I had to force myself to put it down every time I had to. I found it by chance and it ended up being the best story I've read in a long time. The love for the dogs shown along the lines, and the way they're the central part of the story got to me very deeply since my dog is my family too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}