{
    "remaining_requests": 1385,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trapped-Nowhere-Turn-Thrilling-Post-Apocalyptic-ebook/dp/B0CQ3GPFVN",
    "body": {
        "name": "Trapped: Nowhere to Turn Book 4: (A Thrilling Post-Apocalyptic Series)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trapped-Nowhere-Turn-Thrilling-Post-Apocalyptic-ebook/dp/B0CQ3GPFVN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/914O+OBcY6L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stacey Upton",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_ebooks_1?ie=UTF8&field-author=Stacey+Upton&text=Stacey+Upton&sort=relevancerank&search-alias=digital-text"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 1,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "With her home under siege and her children in mortal danger, Mara's retreat from the homestead is necessary, but it comes at a great physical, mental and emotional cost. In Tennessee, Mara's sister Deb must go to great lengths to save the life of her friend, but doing so puts her into a life-or-death situation that she may not be able to escape. Logan, meanwhile, is once again in pursuit of Braden, desperate to rescue him from the clutches of a foe willing to use an innocent child as a pawn in a game of cat and mouse.The #1 best-selling and most prolific post-apocalyptic author Mike Kraus - working with Stacey Upton - brings a new gripping tale of destruction, survival and humanity like no one else can.A series of global earthquakes cascade across the world, their ferocity unmatched by any other natural disaster in human history. Cities are turned to rubble in moments, deep bunkers are sealed shut in an instant, tens of millions are dead in the first hours, and as aftershocks threaten to further destabilize what remains, those few who survived are forced to navigate a broken country.On her Virginia homestead, Mara Padgett faces an impossible task: keeping her three children safe as food runs low and desperation runs high. Separated by hundreds of miles from his wife at their homestead, Logan barely survives a plane crash and takes a young orphan under his wing, but must soon choose between the child's welfare and quickly returning to his own family.Meanwhile, Mara's sister Deb is one of the few to have survived the cataclysmic tremors triggered by the New Madrid fault line that left much of the East Coast in ruins. With nothing left for her in Memphis, she embarks on a perilous trek across the ruined landscape to join her sister in Virginia, though what she finds along the way will test her in ways she can never imagine.In Washington, D.C., geologist Ripley Baxter is buried alive in the remains of the White House bunker, with the President presumed dead and no hope for rescue. She must summon the strength to free herself from the rubble or face a slow, agonizing death, but nothing has prepared her for the journey - and obstacles - she will face along the way.***Mike Kraus & Muonic Press are the #1 producing and selling indie press publishing post-apocalyptic tales, and since publishing his first series, Mike has sold over three and a quarter million books - for good reason. Mike's post-apocalyptic tales speak to what readers treasure most - realistic characters, the triumph of hope in the face of adversity, and storylines that are eerily in tune with what could really happen.Since capturing audience’s attention with Final Dawn in 2012, Kraus has captivated and delighted his readers, both with his solo projects like Epoch's End, The End of All things, Surviving the Fall and No Sanctuary, and with his co-authored projects with authors like BK Boes, Kate Pickford, Justin Bell, Kenny Soward, Tara Ellis, Stephanie Mylchreest and others on titles such as It Falls Apart, Zero Hour, MELT, Flashpoint and Weathering the Storm. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157305011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CQ3GPFVN"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Muonic Press Inc (February 16, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 16, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3077 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 340 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,436 in Kindle Store (See Top 100 in Kindle Store) #4 in Technothrillers (Books) #5 in Technothrillers (Kindle Store) #9 in Science Fiction Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 1 rating"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}