{
    "remaining_requests": 1659,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hench-A-Novel/dp/B082YGDV5P",
    "body": {
        "name": "Hench: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hench-A-Novel/dp/B082YGDV5P",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51WQUHxt TL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Natalie Zina Walschots",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Natalie+Zina+Walschots&search-alias=audible"
        },
        "brand": "Natalie Zina Walschots&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1921,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“This book is fast, furious, compelling, and angry as hell.\" (Seanan McGuire, New York Times best-selling author) The Boys meets My Year of Rest and Relaxation in this smart, imaginative, and evocative novel of love, betrayal, revenge, and redemption, told with razor-sharp wit and affection, in which a young woman discovers the greatest superpower - for good or ill - is a properly executed spreadsheet. Anna does boring things for terrible people because even criminals need office help and she needs a job. Working for a monster lurking beneath the surface of the world isn’t glamorous. But is it really worse than working for an oil conglomerate or an insurance company? In this economy? As a temp, she’s just a cog in the machine. But when she finally gets a promising assignment, everything goes very wrong, and an encounter with the so-called “hero” leaves her badly injured. And, to her horror, compared to the other bodies strewn about, she’s the lucky one. So, of course, then she gets laid off. With no money and no mobility, with only her anger and internet research acumen, she discovers her suffering at the hands of a hero is far from unique. When people start listening to the story that her data tells, she realizes she might not be as powerless as she thinks. Because the key to everything is data: knowing how to collate it, how to manipulate it, and how to weaponize it. By tallying up the human cost these caped forces of nature wreak upon the world, she discovers that the line between good and evil is mostly marketing. And with social media and viral videos, she can control that appearance. It’s not too long before she’s employed once more, this time by one of the worst villains on earth. As she becomes an increasingly valuable lieutenant, she might just save the world. A sharp, witty, modern debut, Hench explores the individual cost of justice through a fascinating mix of millennial office politics, heroism measured through data science, body horror, and a profound misunderstanding of quantum mechanics. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Science-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16190"
            },
            {
                "name": "Superheroes",
                "link": "https://www.amazon.com/Superhero-Science-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9059889011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 14 minutes"
            },
            {
                "name": "Author",
                "value": "Natalie Zina Walschots"
            },
            {
                "name": "Narrator",
                "value": "Alex McKenna"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 22, 2020"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B082YGDV5P"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,454 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #52 in Superhero Fantasy #414 in Superhero Science Fiction #831 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kayem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTBO4CFS4LGBYSIP777Q6MUO5EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OOC6E6LHJD4K?ASIN=B082YGDV5P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Violence, vengeance, and a nervous look at my social media accounts",
                "reviewText": "I bought this book after it was recommended to me and I wound up staying up late to finish it. I loved it! I was a skosh annoyed that the book ended sooner than I expected (though that was mostly my Kindle saying it was 91% completed because I didn't realize there was a short story at the end), but the book absolutely didn't end on a cliffhanger.It was the kind of ending that yes, didn't tie up everything (which would require it to end \"and then everyone died\" or \"and then the heat death of the universe happened\" for any book to do that). But it was the kind of ending that was satisfying because it closes out that specific story being told and leaves the possibility open for more, which is fun to consider and speculate on. The story was Anna's attempts to take down Supercollider and it told that story, while setting up the possibility of sequels telling new stories.So I wasn't going to write a review of this book, but I made the mistake of looking at some of the one star reviews and I'm really puzzled. I don't know if people didn't finish the book, only skimmed it, heard about it secondhand, or what because a lot of the elements they complain about not being a thing are very much a thing in the book.Warning! Spoilers ahead!On the complaint that Anna was part of a kidnapping plot of the mayor's kid and held the mind control doohickey at him and is therefore a villain and not a good person and/or the story would be better if she was simply an innocent bystander:First of all, she was a temp hired to do spreadsheets and the villain ordered her to attend an in-person event under false pretenses simply because he wanted a woman there so he could look like a progressive villain. Which was explicitly stated in the book. And, having finished the book less than 12 hours ago, I distinctly remember that the villain shoved the doohickey into her hands as she tried to prevent him from doing so, then she stood there in shock trying to figure out what to do and then the heroes burst in and all hell broke loose. Hardly part of a mastermind plot.However, that's just petty details. Anna never once paints herself as an innocent bystander. She freely admits to being a hench. The entire point, which was discussed over and over and over, is that **it shouldn't matter if she was an innocent bystander.** Permanent physical disability and a lifetime of pain is not justified for a temp job doing spreadsheets, regardless of who she works for, whether it's a supervillain or a mundane corporation that does villainous things. Her femur was shattered into pieces (google spiral fracture) which required a lot of emergency surgery, metal rods, physical therapy, and a lifetime of pain and physical disability simply because the superhero did not care enough about how much damage his super strength inflicted on the bodies of normal people.On the complaint that the book ignored all the collateral damage from the villains and therefore the heroes are saving lives:The book covered this in great detail in multiple chapters. It was explicitly stated that the numbers for collateral damage caused by the villains were far less than those caused by the heroes, regardless of whether the plots succeeded. The book even had a part where the greater supervillain community, save some D-listers desperate to raise their cred, long stopped engaging in mass bloodshed because the cost was too high. And even when the villains caused collateral damage, it was often limited to their henches, whereas the superheroes didn't discriminate. Anna also did not approve of how some villains used henches as cannon fodder, but she still did the numbers.The book also discussed how Supercollider caused significantly greater injuries and property damage when his sidekick was working with him because, even though his sidekick was essentially The Flash, Supercollider, smashed buildings and spines without caution if his sidekick was even slightly in danger. This was discussed as a problem because it meant Supercollider cared more about the safety of one person with superpowers than the dozens of normal people who couldn't survive his backhand or a building collapsing on them (BTW, many of those people were innocent bystanders so no sympathy for them, I guess?).The book also talked about how Quantum Entanglement actually wasn't one of those superheroes. She went out of her way to NOT harm bystanders, showing that causing so much death and destruction was a choice the superheroes made because they didn't feel the consequences of their actions.On the complaint that Anna is a bad person because she never felt remorse:I mean, that's straight up incorrect. She spent a lot of time feeling remorse. That was an enormous part of her struggle as a character.On the complaint that Anna didn't have PTSD:Again, incorrect. She had it in spades. She had panic attacks and nightmares from the start. I guess people must have also missed the part where, after the superhero kidnapped her, imprisoned her, tortured her, and was having her lobotomized, she had PTSD flashbacks when encountering specific smells or going for a walk.On the complaint that people chose to be villains:In the third act, the book revealed and discussed how this wasn't necessarily the case. The organization that oversaw the selecting and training of superheroes (the Draft) also trained supervillains, many of those they trained (which were usually taken as young children) did not get to choose their path. At best, the Draft was actively engaged in creating supervillains.On the complaint that Quantum Entanglement never felt remorse for selling out for petty reasons:I mean, she did. But she was also trapped in a relationship with an abuser (Supercollider) for years, being part of the coverups of his crimes, literally used her powers to make it look like he could fly so the Draft could market him as a better hero, so it was less about selling out for petty reasons than it was refusing to be part of criminal acts, for which she was punished by being framed for murder. It was literally in the book.On the complaint that Anna was a shitty friend:She readily admitted it and tried to make amends, but decided to respect June's wishes to distance herself from Anna. Which, by the way, happened after their reconciliation. June said the reason she couldn't be friends anymore wasn't because Anna was a shitty friend, but because she couldn't bear the emotional toll of the possibility of again watching Anna get dragged away by the superhero's goons to be tortured.On the complaint that Anna was never arrested for the incident with the mayor's kid:The police declined to press charges, given the scope of her injuries, but also because they and Supercollider, who was with the police in her hospital room (dressed as a police officer with them) wanted her to say it was the villain who injured her so they could cover it up. That was a huge part of the book: the corruption in the police, the Draft, and the superhero community covering up the crimes of superheroes.Here's the thing about this book: it's not clean and tidy. It does not paint a world of Superman and Lex Luthor, where Lex is always up to something nefarious and Superman always foils him and no one gets hurt. The book is more like the real world, where almost everyone has driven over the speed limit or taken a post-it from work, or took an extra five minutes on their break, or worked for an employer who uses forced labor practices. No one is an innocent bystander and no one deserves to have their lives crushed because titans with too much power don't care where they step.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Space Gandalf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGBYBIPG5NGRE5PHTH6GXBPPDKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FEA6TOKNRLE0?ASIN=B082YGDV5P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2021",
                "reviewTitle": "4.0 out of 5 stars A bitter, violent, thoughtful and funny adventure that will scramble your sense of morality",
                "reviewText": "I haven't finished a book for enjoyment in waaay too long. \"Hench\" easily resolved that with its funny, bitter and real world- building. As I was reading it I imagined many inferior versions of itself. One version would have reveled in the silliness of the premise without making the details jump out so poetically or detailing the different forms of pain of its lead characters. Real-life sidekicks and henches as constantly at-risk temp workers is a fascinating concept for exploring marginalization, financial precarity, and feeling like you'll never amount to anything. But it also could have been so much more cartoonish and goofy than it ended up being. I also could have imagined a Zack Snyder-y dark and gritty version of this book that took Anna's glory in \"badness\" up to 11 and smoothed out the weird humor and rough edges. Again, the real book is so much better than this. I had a few quibbles with the trajectory of the book, the way the dark humor and offkilter observations were replaced with \"let's get to it\" action over time - it absolutely made sense for Anna's progression but i missed the old style. I also found some of the romantic progressions - and the way Anna constantly crushes on friends and enemies - a little unnecessary. Still, this book is so worth reading, even if you aren't a superhero fan - we all live in a world Marvel and DC have conquered and are in that way more like Anna than we'd like to admit. Living in their shadows, begging for their scraps of fame and success, cleaning up their messes. I'm grateful for this thought provoking fun. It's a reminder to always look at the bigger picture, the true effects of those who are trying to help.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BookwormBlues",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEPZVFBAQ3AAVN3LUNJ7DKCO55Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL6XM0SCPQ1DB?ASIN=B082YGDV5P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2021",
                "reviewTitle": "5.0 out of 5 stars What an incredible debut!",
                "reviewText": "I am not a big superhero person. I don’t actively go out and look for superhero books or watch superhero movies. They can be entertaining, but they aren’t really my bag of oats. However, when I saw Hench, I was exactly in the sort of mood to read something that isn’t my typical. I also kind of really like stories about antiheroes or “the bad guy” and this seemed to slot right into both of those categories quite nicely.More, I love moral ambiguity, and you really get a lot of that in Hench.Anna works as a hench, or think of her as technical support/office grunt for supervillains (you also learn about “meat”. Think: hired muscle.). Anna’s sort of a data genius, which ends up being the core of the book later on. Anyway, Anna works as a hench for a supervillain. Things go awry and she ends up getting seriously injured. In her recuperation process, she starts studying these streams of data, which is the pin around which the whole book turns.I hesitate to say more. Discovery is half the fun.Anna, however, works for the bad guy, which means some of the things she does are questionable and may or may not make you a bit squeamish. That being said, while you go into this book knowing from page one that Anna works for the “bad guy”, the so called “good guys” don’t look that good for long. In fact, the way the author created this equal playing field across the spectrum for all of her characters was nothing short of spectacular.While Anna has this dark, sarcastic sense of humor that really jived with me on a personal level (I instantly clicked with her), I spent as much time reading this book laughing at her sarcasm as I did thinking deeper thoughts about good and evil, and the so-called cost of both. I was quite amazed by how Walschots managed to provoke so many deeper thoughts and analysis from me, while making me laugh at the same time.Anna, as I mentioned, is a character I loved, and while this is a book about superheroes and supervillains, this is ultimately the story of a woman who is stuck between the two and becomes a power in her own right. As a hench, she is behind the scenes, one of the people who are basically hired to make a supervillain look important. However, as the book advances, she turns out to be more than what she seems, and her personal evolution truly is something to behold.Hench is a book that works on several levels. First, it’s a fun superhero vs. supervillain romp, and if you want to read it for that, then I advise you to go for it, because it really is good. However, I really enjoyed the deeper themes here. What is a superhero, and what is a supervillain, and who determines who fits where, and why?Walschots is a fantastic author, who has a knack for really nailing a character’s voice. There is absolutely no one else but Anna who can speak, act, and think like Anna, and I loved how unique that made her. She made the entire book shine, whether she was laying on the couch recovering from surgery, or working in an office setting, or making really tough decisions and backing up her supervillain. She’s just who she is, and I love books who have characters unique enough to own the story they are set in.What I loved about this book was how the author managed to humanize all these characters who are, by definition, somewhat beyond humanity. Suddenly, under Walschots deft hand, they are just people doing what people do. The office workers required to back these supers up, the muscle that fights for them, the people who fill these jobs are just humans. They worry about rent, they worry about bills, they go to temp agencies to try to find jobs so they can make ends meet. The superheroes/supervillains do not look so glamorous after reading Hench. They seem, if anything, like CEOs of companies more than anything else.The ending of the book was fantastic, as was everything else. Unexpected and a (sort of) win for the people I was hoping would come out ahead. However, my one disappointment was that the book ended. I was having so much fun with Anna and her crew, I didn’t want to leave them.Hench was an unexpected delight. It was funny and thought provoking, and sort of flipped the script on supers in a way I truly enjoyed. More, I loved Anna. I mean, I truly loved this character. She just made the entire book, which was already good, positively glow.Hench was a book I did not expect to like, but it ended up being one of the highlights of my reading year so far. I cannot recommend this one highly enough.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zara Zimmer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 27, 2022",
                "reviewTitle": "A really fun time",
                "reviewText": "I'm only a third of the way through the book but I had to put it down mid chapter and mid laugh to write this review.I'm enjoying every aspect it. The writing is humorous and relatable, as are the characters. I find myself smiling and laughing out loud.I will be very sad when I finish reading this. I need the author to come out with 100 more books right now so I can dive into all of them with absolute abandon.And the lgbt bits make my queer little heart so happy.My only less than positive note is that the edges of the paper the pages are printed on is very rough and uneven which can make it difficult for me to turn the page easily.Overall, all I can say is I love you, Natalie Zina Walschots.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 24, 2023",
                "reviewTitle": "Excellent book, great viewpoint",
                "reviewText": "This was great, tight writing, interesting characters that feel really real and managed to do the hero/villain genre justice at the same time as subverting it a bit.Read it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rene Berlin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 16, 2020",
                "reviewTitle": "Stories about superheroes and villains?",
                "reviewText": "Definitely only for people who like stories about superheroes and villains. But it's well written and even though it was a mistake for me, I finished reading it. So if you like stories like this, you should grab it, otherwise stay away. I'll give 3 points because it's written really well and excitingly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barnesm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 9, 2021",
                "reviewTitle": "I have a HENCH you'll love this",
                "reviewText": "In a media landscape overflowing with superhero stories, looking at you marvel, DC etc... HENCH gives us something a little different. Anna Tromedlov doesn't test as superpowered, doesn't posses a quirk, isn't the test subject of a super serum experiment she is a temp. Well educated, experienced with navigating the processes and software of the modern world. She just happens to be employed as a temp by supervillains. I imagine they pay better than the sanctimonious superhero organisations like 'The Draft' and certainly less nauseating to work for.So you can imagine when the world's apex hero Supercollider attackers her employer and injures her, ending her employment, her medical bills and frustrations pile up.Anna uses her skills to pull together the 'injury report' which highlights to dollars and 'lifehours' how much these heroes cost society more than the crimes the supervillains commit.This helps her find new employment with the Uber-supervillain 'Leviathan' who thanks to his resources, her own impressive skills, and hatred of Supercollider finds a more effective way to end a hero's journey, slowly and painfully.There are all the trappings of the genre, the fights, the hi-teck gadgets and cars, and the faceless muscle nicknamed in this story as 'the meat', and of course the supporting Henches. Not henchmen as thankfully gender parity seems to an accepted principle after all when one of her fellow henches states \"Anna we're the bad guys\" Anna replies \"That doesn't mean we're inconsiderate dicks\".Anna's growth as a character and the prices she pays for that growth, the cast of supporting characters and their individual traits and stories puts this well above a lot of the narratives that feature spandex in the descriptions. Also any Author who includes a Farscape quote by the protagonist knows the way to get my attention.A great read that I hope will make anyone who reads it a bit kinder to any temps they work with, now excuse me I am off to play Evil Genius on the computer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly Nickerson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 22, 2021",
                "reviewTitle": "Fun Read",
                "reviewText": "I loved this book. I read it as part of the Canada reads finalist group of books, and it was in my top 2 of the 5. It took a couple of chapters to adapt to the superhero genre, but after that, it was one of those books you can't wait to return to. I hope there is a sequel.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}