{
    "remaining_requests": 1663,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Upgrade-A-Novel/dp/B09L9V486F",
    "body": {
        "name": "Upgrade: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Upgrade-A-Novel/dp/B09L9V486F",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/417w0EOF1JL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Blake Crouch",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Blake+Crouch&search-alias=audible"
        },
        "brand": "Blake Crouch&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 11597,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER “If Michael Crichton had written a superhero novel, it would look a lot like Upgrade.”—The New York Times Book Review“You don’t so much sympathize with the main character as live inside his skin.”—DIANA GABALDON, #1 New York Times bestselling author of the Outlander series“Mysterious, fascinating, and deeply moving—exploring the very nature of what it means to be human.”—ALEX MICHAELIDES, #1 New York Times bestselling author of The Silent Patient and The MaidenONE OF THE BEST BOOKS OF THE YEAR: Time, She ReadsThe mind-blowing new thriller from the New York Times bestselling author of Dark Matter and Recursion—currently in development as a motion picture at Steven Spielberg's Amblin Partners“You are the next step in human evolution.”At first, Logan Ramsay isn’t sure if anything’s different. He just feels a little . . . sharper. Better able to concentrate. Better at multitasking. Reading a bit faster, memorizing better, needing less sleep.But before long, he can’t deny it: Something’s happening to his brain. To his body. He’s starting to see the world, and those around him—even those he loves most—in whole new ways.The truth is, Logan’s genome has been hacked. And there’s a reason he’s been targeted for this upgrade. A reason that goes back decades to the darkest part of his past, and a horrific family legacy.Worse still, what’s happening to him is just the first step in a much larger plan, one that will inflict the same changes on humanity at large—at a terrifying cost.Because of his new abilities, Logan’s the one person in the world capable of stopping what’s been set in motion. But to have a chance at winning this war, he’ll have to become something other than himself. Maybe even something other than human.And even as he’s fighting, he can’t help wondering: what if humanity’s only hope for a future really does lie in engineering our own evolution?Intimate in scale yet epic in scope, Upgrade is an intricately plotted, lightning-fast tale that charts one man’s thrilling transformation, even as it asks us to ponder the limits of our humanity—and our boundless potential. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 47 minutes"
            },
            {
                "name": "Author",
                "value": "Blake Crouch"
            },
            {
                "name": "Narrator",
                "value": "Henry Levya"
            },
            {
                "name": "Audible.com Release Date",
                "value": "July 12, 2022"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09L9V486F"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,227 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #32 in Technothrillers (Audible Books & Originals) #75 in Technothrillers (Books) #176 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "V. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESIXLGG7V4WWIZ4OVUSHOWURAJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMRNZIQYCW4ZC?ASIN=B09L9V486F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2022",
                "reviewTitle": "5.0 out of 5 stars An Intelligent and Insightful Masterpiece - MUST READ",
                "reviewText": "‘Upgrade’ by Blake Crouch is a masterclass in how to write a riveting, edge of your seat, page turning work of art. It is a book that will have you calling in sick to work because you can’t bear to put it down… and I may be talking from experience. As per the other recent titles from Mr Crouch, such as ‘Dark Matter’ and ‘Recursion’, this book contains a skilled blend of different genres from science fiction to suspense, medical thriller to dystopian fantasy. Our protagonist is likeable but flawed, and the villain is nuanced and to some extent relatable. The world building is meticulous and secondary characters are bought to life with Mr Crouch’s consummate writing. The only reason that I am going to give this a 4.5 out of 5 stars is the moments where the technical writing overwhelms the narrative, as I got a little lost with all the acronyms. After a while I just skimmed over these parts and don’t think I lost anything from the experience.Set in the not too distant future, our narrator is Logan Ramsay, is an agent with the American Gene Protection Agency (GPA). Around twenty years before the start of the book a revolutionary, biological DNA modifier system called Scythe was discovered and patented. Its introduction had heralded a new era of gene editing and delivery across the world, and it also led to catastrophic results. You see, there was a bacterial leaf blight affecting the Indica rice crops in Zhao Qing, China. The scientist who created Scythe decided that by genetically modifying locusts to carry a virus to the rice paddies, the gene modifications could augment the plants resistance to the blight without making any other changes. Whilst the lab results worked perfectly, the actual application had devastating results with the viral-control systems developing mutations that caused the genes necessary for seed production to be eradicated from the plants. The virus then generalised and begun cross-species virus transmission which infected and targeting other food crops.‘ During the next seven years, each growing season yielded less and less, and before the locusts were finally eradicated, China’s strategic grain supply was critically depleted.The famine spread to every continent and affected every human being in one way or another. When you wipe out millions of hectares of crops, it changes where the rain falls. When you destroy rice paddies, you destroy everything that needs them to live.Two hundred million people starved to death, but that number doesn’t come close to the total impact of the chaos we unchained. The downstream effect on economies, healthcare systems, entire species, and the biosphere itself was incalculable. ’This time became known as The Great Starvation and caused unsanctioned gene editing to be outlawed. The GPA was founded to track down dark gene labs and the scientists who illegally run them to ensure that nothing like the events in Zhao Qing can happen again. Logan thinks of his time in the GPA as penance. When he was younger, he had wanted to be a geneticist, following in the footsteps of his world-famous mother, Miriam Ramsay. While Miriam was an absolute juggernaut in the field of genetics with a mind unrivalled and an ambition to match, she was also the creator of Scythe and the virus that caused The Great Starvation.‘ “She was a god. The world’s preeminent cell biologist. She’d already made a billion dollars off The Story of You, her ancestry and genetic testing company. Her Scythe patents were even more lucrative.” ’During a raid on a dark gene lab, Logan is hurt and wakes up in hospital with severe injuries and the risk of being exposed to an engineered virus. After experiencing dangerous flu like symptoms, including a temperature of 106.1F, Logan is cleared of any DNA modifications and released from isolation. Returning to his loving family, wife Beth and daughter Ava, he settles seamlessly back into homelife whilst recovering from his injuries and awaiting to go back to work. The only problem is that he is experiencing intermittent bone deep aches and pains that seem to have no cause. This is the first sign of the extraordinary alterations that are occurring in Logan’s body. Soon he is reading faster, interpreting micro-expressions on people’s faces and comprehending material beyond his previous understanding. As the ‘upgrade’ continues, Logan is captured by the GPA, imprisoned and studied by the very people whom he has dedicated the past fifteen years of his life to, and he starts to understand the fear that drives the agency and his superiors.Logan escapes but can’t return to his family for fear of putting them in danger. Instead, he embarks on a journey to find out who hacked his genome and forced the ‘upgrade’ on him and what the ultimate goal is. Along the way, he realises that the entire world’s future balances precariously on the edge of the abyss, without change, the planet and humankind is doomed to extinction within the next one hundred and fifty years. But what change needs to happen to ensure humanities survival is the question. As Logan grapples with what to do, he is forced to come face to face with how much of himself he is willing to sacrifice to protect his family.Ultimately this book is a warning to us all as to how fragile our world is and without change, we will be sentencing our children to the end of the human civilisation as we know it. The gripping narrative has a profound message at its core. That it is time to set up and take accountability for the mistakes of our past to ensure we all have future. It never felt like Mr Crouch was lecturing to the reader, instead, the social responsibility threads were skilfully woven throughout the story.Overall, 'Upgrade' was simply a masterpiece. The writing is engaging, the characters brilliantly executed, and the world building perfectly realised. Yes, this book does have a message about our likely future if we don’t change our ways, but do not let that detract you. It is still an incredible story, the action is fast paced the plotline is riveting, and it is everything I have come to expect from Blake Crouch. Be warned, you will run the length and breadth of emotions reading this book but, in the end, it will give you hope. I need to say that I am in awe of the talent that Mr Crouch has and will happily read anything he has written.4.5 out of 5 stars! Rounded to 5 stars.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve McMoy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX5FYPX3O2BU5GEA7PIRGUJ6NEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YZU5PALWSIRW?ASIN=B09L9V486F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Great Reading",
                "reviewText": "It’s all been said already. An important novel.The only criticism is that it has the predictable climax with machine guns and explosives. It has the all-too-familiar feel of being intentioned for film.The story is so much better than that. Will no author have the integrity to deny Hollywood’s titillation requirement of 17-year-old males?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPQOSMYPYRUV75BSAXVFADFFKFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B83FIB99PYTA?ASIN=B09L9V486F",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2023",
                "reviewTitle": "3.0 out of 5 stars Uneven, but worth reading",
                "reviewText": "Blake Crouch tends to write quick reads for odd reasons. Not only does he push the action, but the terminology and concepts he explores are so obtuse, one (at least me) tends to skim of some of what he writes because they are hard to understand. \"Upgrade\" is not different. The main character's mother is a super genius. Despite the fact that her gene tampering has killed millions, she engineers a genetic upgrade for her two living children in hopes of saving the human race from the ravages of climate change. Then she promptly dies of a terminal illness.The two siblings, Logan and Kara, have differing opinions on how to use their mother's gift. Kara thinks that the gift of greater intellect and physical abilities should be used to save humanity. Logan thinks that passing along this upgrade will only cause more problems. Thus, the two are at odds with one another--sometimes violently. This is the premise of the story.I find the premise flawed. And if both children are as smart as they are supposed to be, they will also see the flaw. However, that is not to be. And that is the problem with the story.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deb STL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJDC7ADM5JASKDVEXGTMFMAROXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RC4L04GDLY0P9?ASIN=B09L9V486F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Engrossing, fascinating, absorbing!!",
                "reviewText": "A part of me wants to say that this book is so cool and fascinating and another part wants to say it's a horror story that is scary and chilling. I don't know what part is in the majority at this point but it is truly a novel that will make you think and examine what is a possibility in our human being's future. Another thought I had was that if our brains are capable of such intelligence then why aren't human beings smarter than where most of us are on the IQ scale? Shouldn't we all be at the minimum of the genius scale by now in our evolution?What I will say now is that I loved this book and can't wait to read it again. It is definitely at the top of my favorite books I've ever read, probably in my top 10. I am very drawn to books with intelligent characters and themes that make you think. It's set sometime in the future but the author doesn't say how far. My guess would be between 30-60 years in the future. Genetic altering is done so often that they've made a branch of the government to handle illegal tampering with genetics. The main character is Logan Ramsey. At the start of the book he is not genius smart but he's no dummy either. His mom is a genius with a 180 IQ. OK here is where there will be some spoilers so beware.... She believes that the way to save the human race is through intelligence. So she has worked for around 20 years to come up with a way to change both Logan's and his sister Kara's genome. An Upgrade to make them geniuses. Well not only are they geniuses but they surpass their mom's IQ and not by a little. The down side is the more intelligent they get the more emotions and empathy go out the window. The mom has come up with the formula for changing the entire human race with this Upgrade but she hasn't come up with a delivery method. She is hoping that with their upgrades her children with figure that out. Now here's where that action comes in. Logan thinks it's a terrible idea and wants to destroy all the information for the formula. Kara thinks it's a good idea. This is the conundrum. This is where the race begins to either stop Kara or watch the human race transform. It's a great ride. I don't know the accuracy of the science. Are we capable of transforming our DNA now? Will we be capable in the future? What will happen if all the science in this book is accurate and comes to pass? I highly recommend this novel and give it 5 stars.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "martin denis sarkissian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2023",
                "reviewTitle": "Nice",
                "reviewText": "Item as described, perfect condition reads amazingly well. Would by from this seller again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Xorsh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 1, 2023",
                "reviewTitle": "Dilema sobre la ingeniería genética",
                "reviewText": "Muy bien escrito; Crouch nos da personajes sólidos, de carne y hueso. Un futuro distópico de alta probabilidad, enfrentando dilemas morales sobre el destino de la especie humana. Lectura fácil, que me llevó 4 o 5 horas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nigel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 7, 2024",
                "reviewTitle": "Enjoyed",
                "reviewText": "Immensely enjoyed. It made me want to read a lot more of Blake Crouch's books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 8, 2023",
                "reviewTitle": "Ennuyeux",
                "reviewText": "J’ai eu du mal à aller jusqu’au bout. Le concept est plutôt bien trouvé, mais le traitement est soporifique. Dommage.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sabari Vishnu Jayanthan Jaikrishnan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 1, 2022",
                "reviewTitle": "Fantastic Book to read",
                "reviewText": "The storyline, plot, character-narration is awesome. Blake Crouch never disappoint us with his mesmerising climaxes. This book would be even better for biology nerds.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}