{
    "remaining_requests": 1572,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Impossible-Brightness-Jessica-Bryant-Klagmann-ebook/dp/B0BZ566L2F",
    "body": {
        "name": "This Impossible Brightness: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Impossible-Brightness-Jessica-Bryant-Klagmann-ebook/dp/B0BZ566L2F",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/9197uFJizoL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jessica Bryant Klagmann",
            "link": "https://www.amazon.com/Jessica-Bryant-Klagmann/e/B0C8FD4T13/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 3567,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BZ566L2F"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Lake Union Publishing (February 1, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 1, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5553 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 308 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#510 in Kindle Store (See Top 100 in Kindle Store) #2 in Dystopian Science Fiction (Kindle Store) #5 in Dystopian Fiction (Books) #7 in Women's Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 3,567 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/b97befb7-48f2-4a3c-bcd0-7634abb79cb8.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Anne B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHULK2NGSSI4G7O3H6AVBJE2JTMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U36MJMCNDQYS?ASIN=B0BZ566L2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible story with powerful human impact",
                "reviewText": "This is one of the best stories I have read in a long time. I could not put it down and read it in one day. Alma is a shy empath who has lost her fiance and is unable to cope in crowds. She moves to a small island off of Maine to small town where she has some family. Her story starts in 2026 and tells about the impact the rising sea is having on coastal areas. There is also a magical/supernatural element related to strange radio messages centered on an old relay tower above the town. When three town residents and her dog die on a strange day, only she can see and remember them. She spends the next ten years learning and telling their stories as the town is slowly destroyed by the encroaching sea.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. Blevins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5OZRDARE5O55VBCRBHWGYCO5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KYKOIEHPXO4Q?ASIN=B0BZ566L2F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Definitely different",
                "reviewText": "Although this book is Dystopian Fiction which I usually do not like, this book intrigued me. I kept reading hoping to understand what was happening. I am not sure I ever did understand it.Alma Hughes has a gift or a curse, depending on how you look at it. She can feel the feelings of others. However, it is overwhelming and she searches for places to be alone. In the past, she had met a boy who understood her and kept in touch with him via short wave radio for many years. They eventually got together; but on a hike in the mountains, he disappeared and she was lost for days. When she was rescued, she connected with a stray dog and took him as her own. She and Jupiter were to remain together.She wanted to get away and took a chance on going to a remote island in the North Atlantic where her aunt and uncle lived in a small village. The land is changing as the rising waters and fierce storms ravaged the area. Whole islands and towns disappeared as the earth began to die. The villagers were not willing to give up and were isolated on their island. However, there is something strange about the island. The villagers could hear voices coming through their appliances, walls, etc. The voices were coming from short wave radios from the present, past, and future. Could she find Alex in the Echoes or would she only find heartbreak again?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "garagon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNL6DBLZOEUR2OABR7EFM7JZA5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVMWOYGAJYHDZ?ASIN=B0BZ566L2F",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "3.0 out of 5 stars A very slow read, an allegory",
                "reviewText": "I’m a fast reader, but this book was a slog. There were parts that made me wonder where the story was eventually going, but there were also parts that were written so beautifully and rang true to me.It’s never explained why Alma got to stand between the living and the dead in the small town of Violette. The rational part of my brain really needs an explanation. The scientific discourse about sound waves started nicely, but fell flat in the end. There is this impossible brightness, and then the sound (which is dissected through several experiments), like the event in which the Echoes died. Like the one in which Alma’s fiancee disappeared. Like lightning and the sudden shocking occurrences in life. I get the idea, but the nuances aren’t tied together in the book.On the other hand, the creative part of my brain understands that we are all both real (alive/palpable) and unreal (dead/a reverberation of a thought) depending on who perceives us. I am real to my family, an echo to the rest of the world.The book is full of stories within stories, flashbacks within flashbacks. There were parts where I no longer cared about the details of a character’s story, and after mulling it over, I decided it was the way these stories were arranged… or not arranged. Another reviewer used the word “disjointed”. I agree. When it got to the part where I was supposed to know why Alma ran away from her old life, I was so tired from peeling story after little story that I just read the first sentence of every paragraph — and I think that was supposed to be the most important part, the motivation and impetus that started everything.I don’t feel that there was anything maliciously political on the author’s part in putting the story in a dystopian setting. Alma, as one of the Echoes noticed, had magic. And this magic shines in that setting. It is a dull shine, however. Alma’s ardent desire for solitude kept her from growing this magic. It would have been a better read, to watch Alma come into her own in the prime of her life and have that juxtaposition between science and magic, the ending of the world and the mysticism of what’s left behind. Instead, Alma only gets old and eventually gets found and taken away from the place she escaped into. She spent her life running and hiding, and it seems to me that was not the point of the novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spencer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEK7T7X5KWNBUTAAT3YCF7ORTZEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WR2DUC1YJKGF?ASIN=B0BZ566L2F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful and transporting and deeply true",
                "reviewText": "This is a gorgeous, sad, moving, hopeful book about the things that really matter.From what I can tell by reading reviews, with the exception of a few people who just don't like books that are more slidey or heavy or \"weird\", most of the people who don't like this book largely don't like it because they either truly do not believe humans are the cause of catastrophic and accelerating climate change, or because they know in their hearts that this is true but can't bear looking directly at it.So if you don't like books that aren't completely literal, plot driven, or fluffy, sure, skip it for that reason, I guess. Otherwise, you know yourself well enough to know what you believe is true, and how well you can tolerate dwelling in the complexity and enormity of truth.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "s.lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6DSCLA3MDF43RXG6X7GIKZCS3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPX1EHIIL88GY?ASIN=B0BZ566L2F",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "2.0 out of 5 stars So disappointing",
                "reviewText": "The premise is intriguing, and the writing is polished. When considering this book, the characters seemed engaging and I read with the interest until the story became darker and more disjointed. In the end, I felt as though I had been duped into reading a very negative polemic on climate change wrapped in the guise of a story with magical elements. Alma, the primary focus of the book, is emotionally broken and retreats to an island where she has relatives. I was lulled into thinking that the environment would provide some healing and Alma's experiences would help her mature and work through her grief. Instead, Alma becomes increasingly selfish and self-focused under the guise of needing \"space\" and becoming the mouthpiece for the Echoes (a few dead people and an animal that only Alma can see). Alma's life on the island ends sometime in the distant future in a dystopian world where there seems to be no hope. Other readers have commented on the themes of loneliness and environmental disasters, but these topics were presented from a decidedly fatalistic view.",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2024",
                "reviewTitle": "There's magic here",
                "reviewText": "A very unusual, unanticipated tale. To start I just couldn't get into it, but I'm glad I persisted. Jessica leads us through the past and the future in her narrative of her protagonist's uncommon and esoteric life. The characterisation of both the living and the echoes is fascinating. At times I found the plot hard to follow, not grasping whether a persona was alive or in the echo realm, but it all tied up in the end.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hschmeid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 13, 2024",
                "reviewTitle": "Beautiful. Utterly beautiful.",
                "reviewText": "This wonderful tale is almost as if Patricia McKillip decided to write a magic realism story about being alone in the middle of people, and grief, and ghosts, and memory, and what it means to listen, shot through with hope, in a world that’s being destroyed and/or forgotten. If you like the prologue, you will love it. It has an absolute ripper of an opening paragraph, which is exactly how far *I* read to decide I wanted to buy it: “Esmée Taylor was making a sandwich when the teakettle told her the ship was going down. Moments later, she was tying her boots, and it was still talking to her from the stove top, broadcasting a distress call that no one else from town would hear. They were all dancing anyway.”But perhaps don’t read it at work like I did. Trying to NOT have my normal reaction to something like this (a good cry) because I was At Work was… difficult. Very difficult.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Chamney",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2024",
                "reviewTitle": "Not my cup of tea",
                "reviewText": "After reading the synopsis, I was hoping this book would be magical. Instead I found it just weird. If not fantasy, I like to read something suspenseful, dramatic, funny or even sexy. This book was none of those things. It was a book about dealing with loss and about climate change. I found it slow in parts and was happy when it ended, so I could move on to something else. Was it well written...I guess but it just wasn't my cup of tea.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs Emma Murch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 19, 2024",
                "reviewTitle": "Beautiful read",
                "reviewText": "📚 Book Review 📚What a memorable book: haunting, atmospheric, expressive and moving. This really is a beautiful story which is hard to pinpoint to a specific category.We follow the life of Alma who moves to an island after the disappearance and probable death of the fiancé she loves. She is haunted by her loss and seeks solace in the nature and people she finds around the island Violette, which she now calls home.Whilst there, we learn that for many years, the people who live there claim to have heard echoes and messages sent from the imposing radio tower through their own home appliances. Messages that foretell of disaster and whispers from those who have been lost.This is a piece of special writing, in so many levels. The natural impact of global warming is described carefully and without lecture over a number of decades. The most impactful part of this tale for me, is the emotional and beautiful description of love and loss. How those of us who have lost someone we love so deeply, will strive to keep hold of them, their essence and their scent, for as long as we possibly can.I have never read a book that encompasses the yearning after loss that follows you at every point, at every day before. That is to say, this is not a depressing read; it’s really beautiful and I couldn’t stop reading. Alma, works hard to help those she cares for, even when that means her own happiness is affected.Add this to your tbr, you won’t regret it 🐬Thanks to Amazon Kindle for this pre-release book on kindle 🥰 part of Amazon First Reads⭐️⭐️⭐️⭐️⭐️",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kitten DebKitten Deb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 8, 2024",
                "reviewTitle": "A beautiful book that begs to be reread and shared",
                "reviewText": "This is a truly beautifully written book about grief, friendship and the fragility of people, animals and the planet. It’s hard to narrow it down into one genre as it encompasses so many, and it’s definitely a book I will reread in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zyyPZu3kL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}