{
    "remaining_requests": 1662,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ready-Player-One-Ernest-Cline-audiobook/dp/B005HG7BWC",
    "body": {
        "name": "Ready Player One",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ready-Player-One-Ernest-Cline-audiobook/dp/B005HG7BWC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51w-LTOOkSL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ernest Cline",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ernest+Cline"
        },
        "brand": "Ernest Cline",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 149129,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER Now a major motion picture directed by Steven Spielberg. “Enchanting . . . Willy Wonka meets The Matrix.”—USA Today “As one adventure leads expertly to the next, time simply evaporates.”—Entertainment Weekly A world at stake. A quest for the ultimate prize. Are you ready? In the year 2045, reality is an ugly place. The only time Wade Watts really feels alive is when he’s jacked into the OASIS, a vast virtual world where most of humanity spends their days. When the eccentric creator of the OASIS dies, he leaves behind a series of fiendish puzzles, based on his obsession with the pop culture of decades past. Whoever is first to solve them will inherit his vast fortune—and control of the OASIS itself. Then Wade cracks the first clue. Suddenly he’s beset by rivals who’ll kill to take this prize. The race is on—and the only way to survive is to win. NAMED ONE OF THE BEST BOOKS OF THE YEAR BY Entertainment Weekly San Francisco Chronicle Village Voice Chicago Sun-Times iO9 The AV Club “Delightful . . . the grown-up’s Harry Potter.”—HuffPost “An addictive read . . . part intergalactic scavenger hunt, part romance, and all heart.”—CNN “A most excellent ride . . . Cline stuffs his novel with a cornucopia of pop culture, as if to wink to the reader.”—Boston Globe “Ridiculously fun and large-hearted . . . Cline is that rare writer who can translate his own dorky enthusiasms into prose that’s both hilarious and compassionate.”—NPR “[A] fantastic page-turner . . . starts out like a simple bit of fun and winds up feeling like a rich and plausible picture of future friendships in a world not too distant from our own.”—iO9 Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 40 minutes"
            },
            {
                "name": "Author",
                "value": "Ernest Cline"
            },
            {
                "name": "Narrator",
                "value": "Wil Wheaton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 16, 2011"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B005HG7BWC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#297 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #5 in Dystopian Science Fiction (Audible Books & Originals) #5 in Hard Science Fiction (Audible Books & Originals) #8 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Moon Donkey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6PELMNBGRKKRCD63WKM6GJWKDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6FHXG6TRFVLQ?ASIN=B005HG7BWC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2012",
                "reviewTitle": "5.0 out of 5 stars So good it will make your eyes bleed!",
                "reviewText": "Freaking SpectacularReady Player One is one heck of a great book. Freakishly great. My initial reaction after finishing it was that it is a Hall of Fame inductee. Yeah... it was that good.Oh - and I should mention that I was very honored to learn that my scores of review groupies voted me the greatest reviewer of all time. The usual response to something like that would be to say \"I'm humbled.\" You know... that is what you always hear from sports figures, actors, and politicians when the win something. \"I'm very humbled... \" they say. Was I humbled? Heck no! That word isn't even in my dictionary! You are darn right I'm the greatest reviewer of all time! Humbled? Bah... more like - what took you so long to figure that out?! I mean what the heck... isn't it obvious? There should be two categories of reviews on Amazon. One for Moondonkey, and one for everyone else. In fact, Amazon should put a \"Moondonkey\" option under the search menu. Anyway... thank you for the honor. Yes, I am the greatest reviewer of all time.Back to Ready Player One. You know - I suppose it helped that I grew up in the 80's and could recognize most of the references. In fact, I think I have The Tomb of Horrors in my basement somewhere. I looked up the image on Goggle and was like... Dude... I think I've got that. Why do I have that? Because I'm Moondonkey, that's why! Why wouldn't I have it?I heard that they might make this book into a movie. If they do, I hope they don't themselves too seriously and just let it fly. If done right, it would be hilarious. If not, something like this could easily go off the tracks. However, to do it correctly, I suspect that the producers would have to get the rights to use material from a lot of sources - Star Wars, Star Trek, Battlestar Galactica just to name a few. The final battle is a perfect example... ideally you would want ships from all three flying around blowing stuff up.I imagine the film starting with some green Apple IIe letters on a black screen - something to introduce the audience to the basic plot details. Then a cut to black and an awesome 80's song. Not sure which song- I'm open to suggestions (BTW - anyone else surprised that Mr. Roboto wasn't mentioned in the book?). I don't think that would be a good intro though... it has to be something fast-paced with a big punch right off the bat. FADE IN ...How about Journey - Don't Stop Believin' for starting at the final scene and rolling into the credits. Awesome.Bonnie Tyler - Holding Out for a Hero. Maybe for final battle between Z and Sorrento while stuff blows up all over the place. Awesome.The intro is the tough one. It has to punch you in the face right away.... Just like the Star Wars into does... BAM! I was thinking maybe The Cars - Magic, but I don't know... I'm just not sold on it. I also looked at selections from Cinderella, Poison, and Bon Jovi. Not sure about those either. I even looked at the author's website, where he has a \"playlist\" of songs listed. Frankly, I didn't see anything that would make a good intro. Billy Idol? Anvil of Crom has a particular appeal, but it starts slow and was already used in Conan.Another song with some merit is Kenny Loggins - Danger Zone. Except that it is a Top Gun song. However, if you listen to the beat of Danger Zone and Magic, you get the idea. Fast paced. Upbeat.Hmmm... perhaps Holding Out for a Hero would work for the intro... maybe use it again during the last battle when Z has his \"Neo\" moment and turns to face the enemy. I think the beginning would have to be rewritten though... action right away.Oh - and the big robot that Z uses at the end (whatever the name is)... I Googled an image of that thing and I don't think it works. First, too cheesey. Second, too obscure. Change it up. My vote is for Unicron instead.I don't think that sticking strictly to songs mentioned in the book is a good idea.UPDATE 3/26/2015So I hear Steven Spielberg is going to direct Ready Player One. Frankly, that’s about as good of a choice as any given his background. However, I still have a hard time trusting him not to screw it up. Therefore, I’ve taken the liberty to write me own screen play for the film… well maybe not an entire screen play… or maybe even very much of what would generally pass for a screen play… but I did spend some serious time in front of my computer screening music and considering scenes. What? That’s crazy? Hey – it is more than you did so stop talking and let me finish…Here is the problem – some of the content of the book is just too “geek fringe” for a good film. Did I just invent that term? Probably, I’m on the cutting edge of pop culture you know. I should trademark that. For example, Rush 2112 is just too far out there to be effective.So here are some thoughts in no particular order:One thing I’d add would be a Roller Rink scene with Z and Art3mis. There is a part in the book when they are sort of “dating” (but not really). I envision a compilation of Z and Art3mis doing “together” type activities set to REO Speedwagon Can’t Fight This Feeling. However, the first chorus of the song (at exactly 1:29) MUST climax to an initial shot of a disco ball on a ceiling and then pan down to the two of them doing a couples skate at a virtual roller rink. Or perhaps we see the ball first, then a shot of hands holding followed by a pan out to the larger rink. I mean come on – who didn’t couples skate to REO Speedwagon in the 80’s?Another one - when Z and Art3mis dance at Og’s party… how about Forever Young by Alphaville? Yeah… I know… amazing huh?I’m still a fan of using Holding Out for a Hero by Bonnie Tyler to intro the film. Read the following while playing the song and stick with me here… No, I’m serious. Print out this review and hold it in your hand while listening to the song.I’m waiting…Ok… are you ready now?FADE IN to “Ready Player One .” in green Apple IIe letters on a black screen. The period at the end is flashing on and off. (cue the music)INTERIOR DOCKING BAY (first stanza…. Da…da….da..da..da….. at .06)) Close-up shot of boots walking (space pilot in suit) (second stanza…Da…da…da..da..da… at .09) Close-up shot adjusting space gloves… (third stanza…Da…da….da…da.da… at .12) Close up shot of name tag on uniformed chest “Parzival”Then we see the back of the pilot climbing a ladder and getting into an 80’s version Battlestar Galactica fighter. Pilot adjusts controls, prepares for flights, etc… hand pushes forward accelerator.(music – intense drumbeat….Dadadadadadadaadadad at .30 seconds) – ship blasts through launch tunnel and out into space…As the Battlestar Galactica fades in distance in field of stars, Z is initially alone in space for perhaps 5-10 seconds. Then, at around the .40 to .45 mark he is intercepted by some Star Wars X-Wing fighters or something. Ships engage thrusters and fly into battle with various other ships…Where have all the good men goneAnd where are all the gods?Where's the street-wise HerculesTo fight the rising odds?Isn't there a white knight upon a fiery steed?Late at night I toss and I turn and I dreamof what I need(chorus)Z fires to the pace of the drumbeat at .55-.56 (music…dum…dum..dee…dum…dum…dee…dum)…(music… “I need a hero…. Symbol clash!)… Target ship explodes at .58-.59 (like a tie fighter exploding in Star Wars) and Z’s ship flights through the cloud immediately after, but before the vocals kick in again. Maybe it could have even been Aech joining him and blowing up the enemy to save his butt or something. …(lyrics)…I'm holding out for a hero 'til the end of the nightHe's gotta be strongAnd he's gotta be fastAnd he's gotta be fresh from the fightI need a hero …EXTERIOR – (symbol clash!)…Z blasts another ship in pace with the music…at 1.11…(lyrics)…I'm holding out for a hero 'til the morning lightHe's gotta be sureAnd it's gotta be soonAnd he's gotta be larger than life…..Then we see Aech and Z in a larger battle scene filled with ships from Star Trek, Star Wars, Battlestar Galactica, Babylon 5, etc. Maybe even some transformers and other robots flying around.Take it from there…Does this match the intro of the book? No. But there is no immediate spark at the book’s beginning. A Ready Player One movie should intro like Star Wars – A New Hope …Bam! Right into the action. Or Goonies – where the intro is a jail escape and chase to music. This should be like that. Are you reading this Spielberg? You should be. You should probably be making me a job offer this is so good.I’ve considered how to explain Z having the resources to be in this environment at the beginning. I don’t know… maybe Aech brought him along on a “quest” or invited him to play an online “game” with him. The scene could end with Z thanking Aech for the opportunity or something.The point of this is that the intensity of the opening scene can be matched at the end when Z turns to face Sorrento and then becomes Ultraman. Again… que the music and open the can…The key to the Ultraman battle sequence (I still think Unicron is a better choice) is not the fight itself… it is the personality of the characters in that moment. Think Darth Vader in Empire. It is about the personality behind the mask.Again… the following from Holding Out for a Hero:…(lyrics)Somewhere after midnightIn my wildest fantasySomewhere just beyond my reachThere's someone reaching back for meRacing on the thunder and rising with the heatIt's gonna take a superman to sweep me off my feet…We hear the last part as the camera pans back to Art3mis watching the fight and we can see in her character that she has fallen for Z as she watches him rail against Sorrento in a match to the death… I imagine a zoom shot of Art3mis… maybe in her robot suit… maybe not… but the shot MIMICS the VADER shot at the end of Jedi when Vader weighs his choice between Luke and the Emperor… The intensity of that last scene in Star Wars was not the duel, it was the conflict that we saw in Vader’s eyes – even without seeing his eyes. In fact, this scene could be a a blatent imitation of that scene... this is an homage to 80's pop culture, right? Personally, I’d prefer that Art3mis still be in robot form and the camera focusing on the blank lenses of the robot eyes… yet implying sight behind the eyes as she watches Z in battle…",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Walker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPHFOOJHSUZWUGE6PFWZLOKDN7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTWV5VUCXHUH1?ASIN=B005HG7BWC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2019",
                "reviewTitle": "5.0 out of 5 stars Epic treasure quest in a virtual world marinated in 1980s nostalgia",
                "reviewText": "By the mid-21st century, the Internet has become largely subsumed as the transport layer for the OASIS (Ontologically Anthropocentric Sensory Immersive Simulation), a massively multiuser online virtual reality environment originally developed as a multiplayer game, but which rapidly evolved into a platform for commerce, education, social interaction, and entertainment used by billions of people around the world. The OASIS supports immersive virtual reality, limited only by the user's budget for hardware used to access the network. With top-of-the-line visors and sound systems, body motion sensors, and haptic feedback, coupled to a powerful interface console, a highly faithful experience was possible. The OASIS was the creation of James Halliday, a legendary super-nerd who made his first fortune designing videogames for home computers in the 1980s, and then re-launched his company in 2012 as Gregarious Simulation Systems (GSS), with the OASIS as its sole product. The OASIS was entirely open source: users could change things within the multitude of worlds within the system (within the limits set by those who created them), or create their own new worlds. Using a distributed computing architecture which pushed much of the processing power to the edge of the network, on users' own consoles, the system was able to grow without bound without requiring commensurate growth in GSS data centres. And it was free, or almost so. To access the OASIS, you paid only a one-time lifetime sign-up fee of twenty-five cents, just like the quarter you used to drop into the slot of an arcade videogame. Users paid nothing to use the OASIS itself: their only costs were the hardware they used to connect (which varied widely in cost and quality of the experience) and the bandwidth to connect to the network. But since most of the processing was done locally, the latter cost was modest. GSS made its money selling or renting virtual real estate (“surreal estate”) within the simulation. If you wanted to open, say, a shopping mall or build your own Fortress of Solitude on an asteroid, you had to pay GSS for the territory. GSS also sold virtual goods: clothes, magical artefacts, weapons, vehicles of all kinds, and buildings. Most were modestly priced, but since they cost nothing to manufacture, were pure profit to the company.As the OASIS permeated society, GSS prospered. Halliday remained the majority shareholder in the company, having bought back the share once owned by his co-founder and partner Ogden (“Og”) Morrow, after what was rumoured to be a dispute between the two the details of which had never been revealed. By 2040, Halliday's fortune, almost all in GSS stock, had grown to more than two hundred and forty billion dollars. And then, after fifteen years of self-imposed isolation which some said was due to insanity, Halliday died of cancer. He was a bachelor, with no living relatives, no heirs, and, it was said, no friends. His death was announced on the OASIS in a five minute video titled Anaorak's Invitation (“Anorak” was the name of Halliday's all-powerful avatar within the OASIS). In the film, Halliday announces that his will places his entire fortune in escrow until somebody completes the quest he has programmed within the OASIS:“Three hidden keys open three secret gates,Wherein the errant will be tested for worthy traits,And those with the skill to survive these straits,Will reach The End where the prize awaits.”The prize is Halliday's entire fortune and, with it, super-user control of the principal medium of human interaction, business, and even politics. Before fading out, Halliday shows three keys: copper, jade, and crystal, which must be obtained to open the three gates. Only after passing through the gates and passing the tests within them, will the intrepid paladin obtain the Easter egg hidden within the OASIS and gain control of it. Halliday provided a link to Anorak's Almanac, more than a thousand pages of journal entries made during his life, many of which reflect his obsession with 1980s popular culture, science fiction and fantasy, videogames, movies, music, and comic books. The clues to finding the keys and the Egg were widely believed to be within this rambling, disjointed document.Given the stakes, and the contest's being open to anybody in the OASIS, what immediately came to be called the Hunt became a social phenomenon, all-consuming to some. Egg hunters, or “gunters”, immersed themselves in Halliday's journal and every pop culture reference within it, however obscure. All of this material was freely available on the OASIS, and gunters memorised every detail of anything which had caught Halliday's attention. As time passed, and nobody succeeded in finding even the copper key (Halliday's memorial site displayed a scoreboard of those who achieved goals in the Hunt, so far blank), many lost interest in the Hunt, but a dedicated hard core persisted, often to the exclusion of all other diversions. Some gunters banded together into “clans”, some very large, agreeing to exchange information and, if one found the Egg, to share the proceeds with all members. More sinister were the activities of Innovative Online Industries—IOI—a global Internet and communications company which controlled much of the backbone that underlay the OASIS. It had assembled a large team of paid employees, backed by the research and database facilities of IOI, with their sole mission to find the Egg and turn control of the OASIS over to IOI. These players, all with identical avatars and names consisting of their six-digit IOI employee numbers, all of which began with the digit “6”, were called “sixers” or, more often in the gunter argot, “Sux0rz”.Gunters detested IOI and the sixers, because it was no secret that if they found the Egg, IOI's intention was to close the architecture of the OASIS, begin to charge fees for access, plaster everything with advertising, destroy anonymity, snoop indiscriminately, and use their monopoly power to put their thumb on the scale of all forms of communication including political discourse. (Fortunately, that couldn't happen to us with today's enlightened, progressive Silicon Valley overlords.) But IOI's financial resources were such that whenever a rare and powerful magical artefact (many of which had been created by Halliday in the original OASIS, usually requiring the completion of a quest to obtain, but freely transferrable thereafter) came up for auction, IOI was usually able to outbid even the largest gunter clans and add it to their arsenal.Wade Watts, a lone gunter whose avatar is named Parzival, became obsessed with the Hunt on the day of Halliday's death, and, years later, devotes almost every minute of his life not spent sleeping or in school (like many, he attends school in the OASIS, and is now in the last year of high school) on the Hunt, reading and re-reading Anorak's Almanac, reading, listening to, playing, and viewing everything mentioned therein, to the extent he can recite the dialogue of the movies from memory. He makes copious notes in his “grail diary”, named after the one kept by Indiana Jones. His friends, none of whom he has ever met in person, are all gunters who congregate on-line in virtual reality chat rooms such as that run by his best friend, Aech.Then, one day, bored to tears and daydreaming in Latin class, Parzival has a flash of insight. Putting together a message buried in the Almanac that he and many other gunters had discovered but failed to understand, with a bit of Latin and his encyclopedic knowledge of role playing games, he decodes the clue and, after a demanding test, finds himself in possession of the Copper Key. His name, alone, now appears at the top of the scoreboard, with 10,000 points. The path to the First Gate was now open.Discovery of the Copper Key was a sensation: suddenly Parzival, a humble level 10 gunter, is a worldwide celebrity (although his real identity remains unknown, as he refuses all media offers which would reveal or compromise it). Knowing that the key can be found re-energises other gunters, not to speak of IOI, and Parzival's footprints in the OASIS are scrupulously examined for clues to his achievement. (Finding a key and opening a gate does not render it unavailable to others. Those who subsequently pass the tests will receive their own copies of the key, although there is a point bonus for finding it first.)So begins an epic quest by Parzival and other gunters, contending with the evil minions of IOI, whose potential gain is so high and ethics so low that the risks may extend beyond the OASIS into the real world. For the reader, it is a nostalgic romp through every aspect of the popular culture of the 1980s: the formative era of personal computing and gaming. The level of detail is just staggering: this may be the geekiest nerdfest ever published. Heck, there's even a reference to an erstwhile Autodesk employee! The only goof I noted is a mention of the “screech of a 300-baud modem during the log-in sequence”. Three hundred baud modems did not have the characteristic squawk and screech sync-up of faster modems which employ trellis coding. While there are a multitude of references to details which will make people who were there, then, smile, readers who were not immersed in the 1980s and/or less familiar with its cultural minutiæ can still enjoy the challenges, puzzles solved, intrigue, action, and epic virtual reality battles which make up the chronicle of the Hunt. The conclusion is particularly satisfying: there may be a bigger world than even the OASIS.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Madison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKM2W7CDNICKN6URZDWMBYYBEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13VQ9BDX653RV?ASIN=B005HG7BWC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars a very good read!",
                "reviewText": "4/5⭐️i really really enjoyed this book. it was one that i had always been intrigued by, especially because i had heard so many great things about it, and it was such a fun and geeky read. my dad is a huge 80 and 90s geek so i was blessed with a lot of knowledge that is referenced in this book and i always find it really cool when authors can make references to things that only a specific group of people will understand. it’s like you sort of have an inside joke with the author as you are reading the story.i loved the dystopian vibes of this book, although it did feel a bit repetitive at times, i did love the story and the different twists and turns that the story took. i thought the characters were enjoyable and well rounded, despite feeling like wade was very conveniently lucky throughout the whole book. i really loved the message and the theme of this book as well. i’ve heard the second one isnt as good, so i likely won’t read that one but i do really want to watch this movie!“that was when i realized, as terrifying and painful as reality can be, it’s also the only place where you can find true happiness. because reality is real.”",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aaron reaney",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Better than the film",
                "reviewText": "I know I'm well behind with this but i'd only ever watched the film which I still think is a great film but after reading this I think it could have been lot better I also believe it would make a great tv series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "harish gupta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 20, 2023",
                "reviewTitle": "One of the Best Sci-fi books available on market!!",
                "reviewText": "Ready Player One is a thrilling adventure with an intriguing plot, captivating characters, and a unique virtual world. Cline's writing style is exciting and fast-paced, drawing readers into the virtual world of the OASIS. The characters are well-developed and real, and the book has great depth and detail. The story is full of suspense and surprise, and readers will find themselves rooting for Wade and his friends as they battle the corporate villains.It follows the story of Wade Watts, a teenage orphan living in a crowded future-world where the only escape is the virtual universe of the OASIS. When the creator of the OASIS dies, he leaves a challenge to find an Easter egg hidden within the virtual world. When Wade finds the egg, he must battle a powerful corporation to prevent them from taking over the OASIS and destroying it.Overall, Ready Player One is a great read for fans of science fiction and virtual reality. It is a captivating adventure that will keep readers hooked from beginning to end. Highly recommended!Thank you",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "liv",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 16, 2023",
                "reviewTitle": "Gift",
                "reviewText": "Gifted my older brother this book as he loves the movie, he was mighty pleased!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meine Bücherwürmer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 27, 2022",
                "reviewTitle": "Ein wilder Ritt",
                "reviewText": "Im Jahr 2045 verbringt ein Großteil der Menschheit seine Zeit in der virtuellen Welt der OASIS, alleine schon um der harten Realität einer zugrunde gehenden Welt zu entkommen. Allerdings bietet die OASIS nicht nur Unterhaltung in Form von Spielen und Filmen, sondern auch Arbeitsplätze und Bildungsangebote. Wade Watts ist praktisch in der OASIS groß geworden. Vor einer Weile hat er dann auch die Gelegenheit genutzt und ist von seiner realen Schule in eine virtuelle Schule in der OASIS gewechselt. Neben der Schule verbringt Wade seine gesamte Zeit mit der Suche nach einem Easter Egg in der virtuellen Realität. Der OASIS-Erschaffer James Halliday ist fünf Jahre zuvor verstorben und hat in seinem Testament verfügt, dass sein gesamtes Vermögen und seine Mehrheitsanteile an der OASIS an denjenigen Spieler gehen, der zuerst ein von ihm verstecktes Easter Egg aufspüren kann. Anfangs war das Interesse an der Eierjagd riesengroß. Doch nachdem jahrelang keine Spur gefunden werden konnte, haben die meisten Menschen das Interesse verloren. Lediglich die Firma IOI, die die OASIS übernehmen und wirtschaftlich ausbeuten möchte, beschäftigt noch professionelle Spieler, die für sie das Easter Egg aufspüren sollen.Wade hat sich inzwischen unglaublich viel Wissen über James Halliday und dessen Lieblingsepoche, die 80er Jahre, angeeignet. Aber da er nicht über das nötige Geld verfügt, um seinen virtuellen Avatar in der OASIS herumzuteleportieren, kann er sich nicht auf den unzähligen Planeten umschauen, sondern sitzt jeden Tag auf den Schulplaneten Ludus fest. Doch dann kommt ihm eine unglaubliche Erkenntnis. Das erste Rätsel auf der Suche nach dem Easter Egg spricht vom Lernen und könnte sich somit auf genau diesen Schulplaneten beziehen. Wade lässt eine Suchsoftware eine Karte des Planeten scannen und wird tatsächlich fündig. Eine Nachbildung des berüchtigten Tomb of Horrors aus einer alten Dungeons & Dragons-Erweiterung befindet sich auf einem Wald auf der anderen Seite des Planeten und somit in greifbarer Nähe.Dank der im Netz zu findenden Spielanleitung kann sich Wade mit seinem schwächlichen Avatar an allen Fallen vorbei bis ins Zentrum des Dungeons bewegen. Dort erwartet ihn jedoch eine Überraschung. Anstatt gegen einen untoten Zauberer kämpfen zu müssen, muss er diesen an einem alten Spielautomaten schlagen. Glücklicherweise sind antike Videospiele genau Wades Steckenpferd. So gelingt es ihm knapp den Zauberer zu schlagen, der sich sogleich in eine Nachbildung von James Halliday verwandelt, die ihm gratuliert und einen Schlüssel überreicht. Kaum ist der James Halliday wieder verschwunden, stürmt Art3mis ins Grabmal. Die hochlevelige Spielerin ist im Netz bekannt und auch Wade gehört zu ihren Bewunderern. So bringt er erst einmal auch kein Wort raus, als Art3mis wissen will, was er hier zu suchen hat.2018 erschien ein Film von Regisseur Steven Spielberg basierend auf Ready Player One. Am Drehbuch schrieb Ernest Cline mit. Auch wenn vom Buch hauptsächlich einige Grundideen und die Charaktere übernommen wurden, ist das Ergebnis extrem sehenswert. Buch und Film enthalten komplett unterschiedliche Aufgaben für die Easter Egg Jäger und viele neue Referenzen auf die 80er Jahre Popkultur. So wird das Vergnügen verdoppelt, anstatt dass man sich über eine halbherzige Filmadaption ärgern muss.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcelo L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 28, 2020",
                "reviewTitle": "Fascinante, mucho mejor que la película",
                "reviewText": "Me gustó la película y compre este libro a pedido de mi hijo de 13 años que quería leerlo antes de atacar Ready Player 2. Empecé a leerlo para ver de qué iba y cuan diferente era de la película y... wow! qué buen libro!Me encantó. El detalle y el realismo de la historia son sorprendentes. Sobre todo al principio. En el último tercio del libro, ya es más necesario utilizar \"suspense of disbelief\", pero seguí disfrutando el libro hasta el final.El libro aclara muchas cosas algo incomprensibles o expuestas muy simplemente en la película.Aunque creo que es recomendable para adolescentes, el libro no esquiva cuestiones más...\"complicadas\".580 páginas que se hacen cortas...",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}