{
    "remaining_requests": 1657,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mountain-Sea-Novel-Ray-Nayler/dp/1250872278",
    "body": {
        "name": "Mountain in the Sea",
        "price": "$11.96$11.96",
        "originalPrice": "",
        "rawPrice": 11.96,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mountain-Sea-Novel-Ray-Nayler/dp/1250872278",
        "soldBy": {
            "sellerID": "A32UWF11CYXVV6",
            "name": "Goodwill Southern California",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A32UWF11CYXVV6"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51cx5ng9ojL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51EKgsriHpL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ray Nayler",
            "link": "https://www.amazon.com/Ray-Nayler/e/B008LTR0XM/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill Southern California",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2316,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 17 mins",
            "$3.99 delivery February 28 - March 5."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Picador (May 30, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 464 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250872278"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250872272"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 15.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.35 x 1.2 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,858 in Books (See Top 100 in Books) #101 in Technothrillers (Books) #202 in Space Marine Science Fiction #1,282 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,316 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Praise for The Mountain in the Sea: A Novel by Ray Nayler",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc0b7d4f-63f9-4bfb-bedb-027473c4bef8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cfe0e924-83ca-4c14-aec4-32d1d4dc3276.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00de4357-bcbd-4e2f-a21c-66eff23f734d.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc0b7d4f-63f9-4bfb-bedb-027473c4bef8.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cfe0e924-83ca-4c14-aec4-32d1d4dc3276.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00de4357-bcbd-4e2f-a21c-66eff23f734d.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Casey Dorman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCDENKWLU37ZBSS6RNZ2VGZU7MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13CAVC7TOKLZ9?ASIN=1250872278",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars A profound read",
                "reviewText": "When Dune was first published in 1965, I was 22 years old. I remember the sense of intrigue and wonder I experienced trying to figure out the minds of the Fremen, the desert people, or the Bene Gesserit, the matriarchal order that used a special arresting voice, and not least of all the Sand Worms, and how they all affected one another, often under the influence of the exotic Spice. In the sixties, when we were learning that the mind had depths that could be explored, though not necessarily understood, under the influence of spice-like hallucinogens, Dune added another mysterious dimension to experience.Reading Ray Nayler’s The Mountain in the Sea reminded me of that experience reading Dune decades ago. It opened up another world, another way to experience the world, but this time that new perspective didn’t require traveling to a fictitious, distant planet. It was the world of a conscious, intelligent octopus here in earth’s oceans. Nayler takes us inside the minds of a number of his characters. In fact, much of the intrigue of the book is experiencing the central situation from myriad perspectives, each of them with a different and only partial understanding, almost none of them cognizant of each other. There is a mysterious woman, whose identity is never revealed, even her actual face being disguised, who works for an unidentified but powerful organization and orders the death of nearly everyone she talks to after they have served whatever purpose she needs them for. We go inside the minds of the people she uses, but neither they nor we, the reader, comprehend the larger picture that is determining her decisions.On the island of Con Dao, where research on the octopuses takes place, the main character of the novel, Doctor Ha Nguyen, an earnest marine scientist, narrates her own story as she tries to figure out why she has been given her position, what her employer’s motives are, and what kind of people she is working with, which are an AI emulation of a human and a dedicated guard/assassin who protects the island and the project. As we follow the progress in establishing communication with the octopuses, we also follow the progress of a captive fisherman, who is determined to reach the island, and in doing so, we get a first-hand look at the predatory behavior of humans toward life in the sea.Besides the motivations of the various human players in the story, the chief mysteries involve understanding both Evrim, the AI emulation and the octopuses, that is, comprehending how they think and understand their world. We never really do. As in real life, we are unable to get beyond our own human, anthropocentric perspective, although Ha Nguyen goes far enough to understand such limitations, and at the end of the book, remains determined to break out of her human perspective.While Dune was wildly imaginative, but scientifically implausible, The Mountain in the Sea attempts to stick reasonably close to science, both with regard to AIs, which is as much a theme of the book as the octopuses, as well as with regard to the latter. The science appears mostly in the reflections of Ha Nguyen and Dr. Arnkatla Minervudottir-Chan, the designer of both Evrim, the AI, and the octopus research project. There is an emphasis upon symbols and communication that reflects the point of view of Eduardo Kohn’s How Forests Think, a book without which Nayler says “this book would not have been possible.” (I’ve ordered the book) This emphasis may have slanted Nayler’s view to make the octopuses more like humans than they actually are, but it provides a common ground for understanding between species, without which some of the meaning of the story might be lacking. Stanislaw Lem’s depiction of aliens in stories such as Solaris and The Invincible, which makes their way of thinking and understanding the world incomprehensible to humans, may be more the truth, than a common ground of symbols, but future research will tell.The effort to stretch our own minds to understand the world from the point of view of another species, either an organic one, such as octopuses or an inorganic one, such as Evrim, the AI, is an experience that science fiction, more than any other realm at the moment, can bring to us (although AI developments are rapidly catching up with sci-fi). A human insight on which The Mountain in the Sea directs a spotlight, is that humans are predators, and we are prone to see the world through the lens of a predator, i.e., what profits our survival, especially access to food, but also territory, power, and dominance, is what determines our relationship with other species, either animal or plant. Any human who has hunted another animal (and I suppose those that hunt for plants, such as mushrooms or edible tubers, are the same) has had the experience of tunneling their vision so that they don’t notice the beauty or uniqueness of the natural world around them while they are “on the hunt.” When I was a young man, I gave up underwater spearfishing, because the underwater world had lost its beauty and charm to me when I hunted. I returned to just looking and exploring. So, like most really good books, The Mountain in the Sea causes us to examine our own psyche as well as those of the non-humans the book is “about.”I’ve read some fantastic science fiction in the last few years. Writers such as Arkady Martine, Julie E. Czerneda, Sylvain Neuvel, and Adrian Tschaikowsky have broken new ground, either in terms of the concepts they’ve written about or their elegant or original styles of writing. Ray Nayler joins this group on both counts, conceptually and literarily. I was brought back to the kind of writing that made me think and wonder. Reading The Mountain in the Sea is a profound experience.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruykann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAM26TXA5X3TM4I3DFNWXH45CSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20VWTWKILLV8R?ASIN=1250872278",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Well done",
                "reviewText": "Overall, very well written and interestingly contemplative. Not a five star because a bit self absorbed and dominated by guilt and loneliness for my taste. Just not particular themes I find compelling. If you like Octopi 🐙 consciousness then check out Adrian Tchaikovsky’s Children of Time series.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt Bille",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK3HMYPDLWVNDF3SCMGMZIJQWQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B6KPIM9UEFPM?ASIN=1250872278",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Original, brilliant, profound novel of first contact - on Earth",
                "reviewText": "Nayler, an author of acclaimed short fiction, delivers a first novel that’s original, superbly written, and profound, showing extensive research and a fearless approach to the largest of themes – consciousness, sentience, and life.We’re in a world set just far enough in the future for the creation of Evrim, the world’s first and only sentient android (such creations were immediately outlawed). The world has been reshaped by wars but remains functional, with greater roles for international authorities (governmental and corporate) plus a powerful cyber empire based in Tibet. Transport is largely AI-driven, and advanced drones and other gadgets are ubiquitous. Nayler chillingly depicts life on an AI-driven fishing vessel where the crew are slaves, never setting foot ashore and unable to communicate. On one such ship, fisherman Eiko learns from his Vietnamese friend Son the legend of a shapeshifting sea monster at the Con Dao Archipelago. This is where Dr. Ha Nyguen has just been hired to investigate what may be a sentient octopus species. Nayler works through the factors that have kept octopuses from having a civilization: short lives, no parent-child bond, and lack of symbolic communication. The author repeatedly and effectively shows how hard it may be for humans to understand the thinking of any alien species, as theory after theory goes bust.With Ha on the remote atoll are only Evrim and Altantseteg, the enigmatic guard who commands an array of automated defenses. Also in the cast are Ha’s long distance friend Kamran, the cybergenius Rustem, the DIANIMA corporation’s scientist Arnkatia Minervudotter-Chan, and a mysterious woman hidden by an AI facemask who ruthlessly manipulates people for DIANIMA’s benefit. Nayler introduces the “point five,” an AI companion sophisticated enough to have discussions, arguments, and pass almost any Turing test, and we’re not always sure who is actually human. One of Nayler’s fascinating explorations concerns what tips the scale to sentience: why Evrim is an autonomous intelligent being and other constructs, cyber or physical, are not.The octopuses are not what you’d expect. They are trying to understand us, as Ha and Evrim try to understand them. There are echoes here of other interesting works: Star Trek TNG (although the gap between android and human is greater than Data showed us), Alien, and the film A Cold Night’s Death are a few. The various stories collide, literally, at a point where we find out what’s really happening on the island, who’s in charge, and key characters’ real motivations, all of which come as revelations.This isn’t a novel you can read casually. Nayler’s prose is inventive and highly effective without ever becoming flowery. Every paragraph is there for a reason, and the reader needs to pay attention. The technical and philosophical details are well thought out and often provocative. Excerpts from the books of Drs. Nyguen and Minervudotter-Chan give essential insights into the characters’ thinking as well as their world. The result is a masterpiece of suspenseful and thoughtful storytelling.My last thought is that Nayler needs to keep tight control when this book is optioned for a film. A studio’s first instinct will be to make it a monster movie, which is like making Moby Dick an Ahab-vs-whale contest while ignoring the many layers that make the tale profound and unique. I wish him luck.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "fryjord",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX2AC6CE4WYBBT6TKEEMCGGNG3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YMND1COCP4DD?ASIN=1250872278",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars A beautiful and insightful examination of consciousness and embodiment",
                "reviewText": "This is one of the best books I've read in quite some time, and I'm still thinking about it more than a month after I finished it. The book examines questions of consciousness and communication through both an AI character and an evolved form of octopus that has developed language skills. What I think the book does so beautifully is get at just how impossible it would likely be for us to truly understand something fully sentient yet so different from us. It's a book that will stay with you and made me grapple with ideas I'm still working through.Oh, and it's also entertaining! I shouldn't forget that part :)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 14, 2023",
                "reviewTitle": "Gripping Sci fi thriller and more",
                "reviewText": "This was a great read. As a big fan of mainly non fiction books about consciousness, philosophy, AI, animals, the environment et al this book touched on all of it. Trying to branch out more into fiction, this book had great underlying concepts wrapped up in a futuristic dystopian setting. Fast paced and small chapters kept my fingers flipping. One of my all time favs for sure. Well done! Oh and I really like 🐙",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Russell Archer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 23, 2023",
                "reviewTitle": "A page turner and page stopper",
                "reviewText": "This environmental and AI thriller is difficult to put down but also as the author challenges the reader to attempt to think from outside of one's own embodied reality, one finds oneself pausing to reflect.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oscar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 9, 2023",
                "reviewTitle": "Libro innovador",
                "reviewText": "Uno de los mejores libros de ciencia ficción.Te reta a pensar cómo sería una sociedad inteligente y nuestra relación con ella.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 8, 2023",
                "reviewTitle": "Very interesting read",
                "reviewText": "Has a lover of all things octopus. This book peaked my interest but went beyond that with its fascinating storylines and creative characters.Highly recommended, and I hope there is a sequel 😀",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BügelnBügelnBügeln",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 19, 2023",
                "reviewTitle": "Being conscious about consciousness",
                "reviewText": "A fine book about transhuman consciousness with many inspiring insights. There is love and respect for all beeings, packed in an adventurous story. I liked it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}