{
    "remaining_requests": 1471,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Frankenstein-Mary-Shelley-ebook/dp/B076QD62Q2",
    "body": {
        "name": "Frankenstein",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Frankenstein-Mary-Shelley-ebook/dp/B076QD62Q2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81zFedw-09L._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mary Shelley",
            "link": "https://www.amazon.com/Mary-Shelley/e/B00R1DJSQQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 23939,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Frankenstein; or, The Modern Prometheus, generally known as Frankenstein, is a novel written by the British author Mary Shelley. The title of the novel refers to a scientist, Victor Frankenstein, who learns how to create life and creates a being in the likeness of man, but larger than average and more powerful. In popular culture, people have tended to refer to the Creature as \"Frankenstein\", despite this being the name of the scientist. Frankenstein is a novel infused with some elements of the Gothic novel and the Romantic movement. It was also a warning against the \"over-reaching\" of modern man and the Industrial Revolution, alluded to in the novel's subtitle, The Modern Prometheus. The story has had an influence across literature and popular culture and spawned a complete genre of horror stories and films. It is arguably considered the first fully realized science fiction novel.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B076QD62Q2"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ FrontPage Publishing (January 8, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 8, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 963 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 113 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1981286586"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#889 Free in Kindle Store (See Top 100 in Kindle Store) #1 in Classic Short Stories #13 in Single Authors Short Stories"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 23,939 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Israel Drazin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB3BFPZ6Z6HTHBTW2O2TLKH3N2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAXLE4HP14YGG?ASIN=B076QD62Q2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2011",
                "reviewTitle": "5.0 out of 5 stars The true story of Frankenstein and its meaning for us today",
                "reviewText": "Readers will be surprised to read this nineteenth century \"horror story,\" because the English woman Mary W. Shelley (1797-1851) did not write this book as it is shown in the many motion pictures that were made of it. She published this gothic tale, which many scholars see as the earliest version of a science fiction novel when she was only 21. Scholars think that she wrote it as an attack against the emerging industrial revolution, but perhaps, as we will see, it is more than that. The story is written in the delightful style of its time, like the mystery tale of the Englishman Wilke Collins, which was serialized in 1859-1860 and published in 1860, The Woman in White, which some scholars say is the first detective story, while others give the honor to Edgar Allan Poe (1809-1849).Mary Shelley became the wife of the famous poet Percy Shelley after writing her novel. She subtitled it The Modern Prometheus. According to some but not all Greek myths, Prometheus was a giant who created people and latter brought them fire. It appears that the Prometheus in the tale is the creator Frankenstein, who was not a giant in height, but in intellect. Most people consider Prometheus a hero, but not Shelley. She thought of fire as being bad because it caused people to kill and eat animals and gave people more implements with which to wage war and murder people. Frankenstein tells the story to a man who saved him while he is pursuing the man he created. He warns the man not to pursue scientific goals that will harm humanity. The Shelley story is about an educated man of science who was born in Switzerland and educated in a German university, who is interested in helping people. Everyone who meets him likes him. He comes from an educated amicable family who love him, and he loves them. He searches for an answer to what is life. He wonders if he can create life, and succeeds in doing so. He creates an eight-foot man, who is never named in the novel. He is repulsed by the man he creates and thinks of him as a monster as soon as the man is alive. All people who later see his creation are also repulsed and this causes the man to hide and live alone and it accounts for the profound loneliness that the man feels. His creator becomes depressed at what he has done, rushes away from his lab, and is sick in bed for four months. He is Frankenstein. The unnamed man he created leaves. Frankenstein returns home from Germany and discovers that someone killed his younger brother. He is convinced that the man he created did it, and pursues him to kill him. He meets his creation and is unable to harm him because the man is larger and stronger than he. His creation tells Frankenstein that he killed his brother by mistake. The boy saw him, was disgusted at seeing him, and started shouting. All he did was place his hand over the boy's mouth. He tells how he has been traveling about for more than a year, found that every human despises him, and has become very lonely. He begs Frankenstein to make him a female companion because he, like the biblical Adam, can't live alone. Frankenstein agrees. However, when he finishes making the female he becomes frightened that two monsters, as he thinks of them, could harm mankind. So he destroys the female. The man he created is enraged and vows vengeance against Frankenstein for destroying his life. What happens to Frankenstein and the man he created, I will leave for readers to read and enjoy. Will the creation carry out his threat? If yes, how? Which of the two will outlive the other? What will the survivor do? Is it right to call Frankenstein's creation a monster because of the way he looks? Readers may also want to ask themselves: is Mary Shelly's pessimistic approach to scientific advances justified? Perhaps there is another interpretation of the story. It may be an examination with comments upon the creation of man. The first biblical creation Adam is unnamed, like Frankenstein's creation. Although most people think his name is Adam, the Hebrew word adam actually means \"human.\" There is an ancient Jewish legend that when God decided to create this adam, the angels objected that people were not sufficiently good. This parallels the rejection of Frankenstein's creation by society. Like Frankenstein's creation, the adam was also lonely and wants a companion. Today, many people, like Frankenstein's creation feel alienated and lonely, and live a life without meaning. This is something to think about.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy Ruback",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED7PB24XN5SUPEOLKEGF75I65VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX2UTT5LZL9ZJ?ASIN=B076QD62Q2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Book Club book choice.",
                "reviewText": "I've never read Mary Shelley's Frankenstein, so my son and I chose this book as our book club of the month read. I'm enjoying this read. It's intriguing, personable, and a fast read. I would recommend it to anyone who wants a little mystery, intrigue, and a slight hint of terror.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noonski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL3EXU2O4VBPFZ2VWA5LSB3FOIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38B4HRV3WHW4?ASIN=B076QD62Q2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2015",
                "reviewTitle": "4.0 out of 5 stars An Unexpected Surprise",
                "reviewText": "First, a note about the cover of the Penguin Classic Deluxe Edition: I’ve noticed in several other reviews of various books in this series that readers have negatively commented on the “cartoonish” like covers. Personally, I happen to like most of the covers in the Classic Deluxe series because they are bright and fun. Sure, it is nice to own a nice edition of a favorite classic. Yet, I don’t see the harm in the fun covers — there’s no rule that says that because something is a classic that it has to be bound with a stodgy, serious cover. Maybe the comic-like covers will catch someone’s interest, someone who might not normally read a book. Getting someone to read a book is the most important thing, right?In the introduction to this particular edition, author Elizabeth Kostova (who wrote a modern take on the Dracula story: “The Historian”), says that she picked up the book to reread, to refresh her memory, and as she was reading it she realized that she wasn’t rereading it at all. She’d never read it. She realized that she knew the myth of Frankenstein, the Hollywood version, the Halloween version, the bolt through the neck version. What she knew (or thought she knew) had come from pop culture.I knew that I had never read Frankenstein. It was always on my ‘to read …sometime” list. I couldn’t pass up the cover, so I bought the book. Like Ms Kostova, I felt that I knew the story of Frankenstein and his monster. Growing up in the 1970s, with all the weekend and late-night sci-fi/horror movies, I’d seen the old Bela Lugosi version, and many of the various other old black-and-white retellings. And lets not forget the Mel Brooks adaptation (which I was fairly certain had little to do with Shelley’s novel).When I sat down to read the book, I was drawn into the tale by the letters of Captain R. Walton, who is on an expedition to find his way through the icy waters of the north. Walton catches a glimpse of the monster, and not long afterwards rescues Victor Frankenstein from the icy water.The book is broken into three parts: Part One is mostly told via letters from Walton to his sister; Part Two is Victor Frankenstein’s narrative for the first part, then the monster’s narrative for the second half. Part Three takes up the story with Frankenstein again, ending with a few letters from Walton.There are several more detailed summaries of the plot, so I won’t go into much detail. However, there are a few things that I think are important to know (they are, in a slight way, spoilers — but, I promise not to give any of the major points away).The book is quite noticeably different from the Hollywood myth that most of us grew up learning. There’s no scene where Frankenstein is in a tower awaiting lightening, there’s no evil madness to him — he looks at making a creature as a scientific enquiry, rather than anything with evil intentions. There is no Ygor/Igor. There’s no little girl who hands the monster a flower. And, most astonishing: the monster speaks — eloquently.There are several gaps, parts where the reader just has to let the story unfold without pausing to think to rationally about it (the lack of detail on how the monster was created, the way the monster was educated and learned to speak and read, etc.) Don’t get caught up in trying to accept the logic — it’s not there. Just follow the tale, don’t think too deeply about how the monster learned so much from watching a family. Just go with it. The gaps aren’t really that important.What is important is that our pop culture has distorted the story so much that when one hears the word “Frankenstein” one thinks of the monster, not the doctor. In the novel, the monster is never given a name - he is simply referred to as monster, daemon, creature, horror. And, our pop culture version of the story has taken away the deep philosophical aspects of the novel. And, we’ve learned that the creature is the ‘bad guy’, but, there’s much to be said about Victor Frankenstein - most of it not nice. In many ways, he is the ‘bad guy’ of the story. He’s so intent on bringing a creature to life that when he does and sees how ugly and horrid the creature is, he immediately abandons it, leaving the monster to fend for himself. Frankenstein is relieved that the monster disappeared and barely gives him much thought until tragedy strikes the Frankenstein home. Two years have passed and monster and creator finally meet, and the monster speaks what I find to be one of the saddest things I’ve read. Frankenstein is angry at what his monster had done, and wants to kill him. In reply: “‘I expected this reception,’ said the daemon. ‘All men hate the wretched; how, then, must I be hated, who am miserable beyond all living things! … Remember that I am your creature; I ought to be thy Adam, but I am rather the fallen angel, whom thou drivest from joy for no misdeed. Everywhere I see bliss, from which I alone am irrevocably excluded. I was benevolent and good; misery made me a fiend.”The monster believes that if Victor will make him a wife, he will have someone to share his misery and torment with — they will be bound by their both being outcasts. Frankenstein first agrees to create a bride, but then realizes he cannot do so, for he might make more evil creatures.What is most interesting to me is that the Doctor is really a whiny, narcissistic man; he made the creature, and ran off immediately afterwards, abandoning the monster. When the monster does some bad things, Frankenstein takes no responsibility — he never thinks “maybe if I stayed and taught him what it was like to be human, he might have had a chance.” Instead, he let the monster loose in the world, and because of the creatures size and hideous features, he’s attacked and chased off everywhere he goes. He doesn’t learn about life from a benevolent creator — he learns about life from the flawed humans that inhabit the earth. But Frankenstein moans and groans about how tragic his life has become because of the monster without every really acknowledging his own lack of responsibility. In a way, part of the idea of the creature’s character comes down to the old Nature versus Nurture argument. In this case there was no nurture — he only had the horrified reactions of people to learn from. As the monster says “All men hate the wretched.”I was surprised to find that I disliked the Doctor so much. While I can’t say that I found the murderous monster lovable, there was certainly something very sympathetic about him. Frankenstein spends pages lamenting the misery of his life, yet it is a ‘woe is me’ type of lament. The creature seems more philosophical about his wretched existence and suffering — the monster isn’t about a bit of whining and lamenting, but he seems to have learned things about life that Frankenstein (the supposedly more educated one) fails to grasp.There are a few flaws in the tale — I’ve mentioned some above (i.e. how the monster learns to read and write). But there are some technical flaws as well — it’s difficult to keep track of how much time has passed. Sometimes it seems very long, until it’s mentioned only a few months have passed. Other times, years have passed with barely a mention. Frankenstein was a young man, in his mid-twenties when he created the monster, though it was tough to tell how old he was at the end. Stylistically, the novel is by turns engrossing, followed by a several pages that seem to drag on and on, making the pacing of the novel feel uneven. Yet, in spite of these small flaws, the story is much deeper in meaning, more philosophical in nature than I expected. It’s a novel that could lead to good conversations about the nature of good and evil, about who was the real monster of the story, and did Doctor or monster learn anything of value along the way.Most importantly, the legend of Frankenstein in our culture is one of horror — it’s often called a horror novel. But, it really isn’t. There is a bit of violence, though not graphic at all. Mostly, it’s a meditation on good and evil, life and death, and what we should or shouldn’t do if we have the power to do something. The story just happens to have a monster as one of the main characters. It’s not a story that would give you bad dreams, or make you feel fearful if you were home alone.I’m glad the comic-book cover captured my attention, and that I got around to reading the story sooner rather than later. I think it is a story that will keep me thinking for some time to come. I highly recommend the story (in whatever edition fits your budget or catches your fancy.) I give the story 4.5/5 stars.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nilton C. Teixeira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Outstanding creativity!",
                "reviewText": "“Frankenstein has done more than any other story to define the anxieties of modern life. But it’s what it tells us about compassion that we need now more than ever.”, by Rebecca Lawrence (BBC Culture - June 13, 2018)If you think that because you have watched the movie adaptations you can skip this book, then you don’t know what you are missing.The movie obscured Shelley’s intentions.This is not a horror book.It’s a drama at its finest.The writing is fascinating!And if you add the audiobook narrated by Dan Stevens you will be transported to the era and be totally involved in the emotional rollercoaster.The writing is complex and vivid and expresses the anguish of both monster and creator.I thought the story was exceptionally well told and the writing definitely brought it to life.What I enjoyed the most is that we have the monster’s perspective.What an incredible imagination!The author was 18 years old and this book was written in 1818, so take that into consideration.What a great read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudio Albarrán",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 19, 2023",
                "reviewTitle": "Excelente relación calidad-precio",
                "reviewText": "Es una edición bonita, de buena calidad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mad Mel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2024",
                "reviewTitle": "Beautiful Book",
                "reviewText": "Will buy more of the Chiltern Classics as they are lovely.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stanislas Jacob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 30, 2024",
                "reviewTitle": "Bonne qualité",
                "reviewText": "Rien de spécial à dire, le livre est en bon état, écriture un peu petites selon les personnes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UjjalGanguly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 23, 2024",
                "reviewTitle": "A masterpiece",
                "reviewText": "This is a timeless classic. There are so many layers and dimensions to this story. A must read for al ages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}