{
    "remaining_requests": 1628,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Red-Gold-Science-Fiction-Novel-ebook/dp/B0CC5RGYXT",
    "body": {
        "name": "Red Gold: A Hard Science Fiction Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Red-Gold-Science-Fiction-Novel-ebook/dp/B0CC5RGYXT",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/714fWgGrUiL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ido Sharon",
            "link": "https://www.amazon.com/Ido-Sharon/e/B0CCF1KXRR/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 46,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "To save the Earth, they must first land on the Red Planet.Mars. The next frontier. When people talk about the Red Planet and human salvation, they talk about colonization [transference] – as if that is mankind’s only hope of surviving the ecological threats facing Earth. But they are wrong. The answer doesn’t lie in moving humanity across the stars to settle its red soil.Rather, it is the Red Planet’s gold.An astronomical discovery on the precipice of global calamity has set two scientists on the path to human salvation. Using their newfound knowledge, they are certain they can utilize Martian resources to solve Earth’s greenhouse crisis and spare the planet – and humankind along with it. But reaching Mars proves to be just one obstacle out of many, and their time is running out.Will their resourcefulness be enough to save the planet, or are the odds stacked too high against them for mankind to survive? Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CC5RGYXT"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 1, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1387 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 362 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B0CCCPKTJ3"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#412,153 in Kindle Store (See Top 100 in Kindle Store) #566 in Colonization Science Fiction #813 in Colonization Science Fiction eBooks #1,043 in Hard Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 46 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "farmerglen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3OGBVCYHPC575UA6VXL6ZLQBAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24D9B30EN4I4E?ASIN=B0CC5RGYXT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars A formidable story",
                "reviewText": "I say this was a formidable story because it shows what can happen when all the countries of our world could stop all the fighting over trivial ideals that don’t matter in the long run.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gustave Hakushu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEK5762AOU3NAZOHWAUB3OXI73A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15XHY7C7QEN9?ASIN=B0CC5RGYXT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Deeply insightful",
                "reviewText": "Ido Sharon's 'Red Gold' embarks on a captivating odyssey that traverses the cosmos while delving into the depths of ecological perils faced by our home planet. In this hard science fiction masterpiece, the notion of human survival takes an unexpected turn, centered not on colonizing Mars, but on harnessing its most precious secret: gold. The novel unfurls in a future fraught with environmental catastrophe, where Earth's salvation hangs in the balance. Sharon's storytelling prowess weaves a narrative web around two brilliant scientists whose discovery shatters the conventional wisdom surrounding Mars' role in our destiny. The plot unfolds with gripping intensity, as the scientists race against time and formidable challenges to decipher the hidden potential of the Red Planet's resources. 'Red Gold' transcends mere science fiction; it's a thrilling contemplation on human resourcefulness and the power of ingenuity. Sharon skillfully balances hard science with compelling characters, plunging readers into a world of scientific intrigue and cosmic possibilities. As the protagonists grapple with monumental questions, the novel ignites a fascination for the universe's enigmas while reminding us that sometimes, salvation lies in the most unexpected of places.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob Heede",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPFYAPNEFUR3RKF5RY3FV4LWQHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AFDOJT4D4N1Q?ASIN=B0CC5RGYXT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Knowing a thing does not mean understanding it.",
                "reviewText": "Very intriguing novel AND scientific premise. What if you could eliminate all the obstacles present in our understanding of physics? Amazing technological advances would take place, if only the laws of physics weren’t absolute. If only!Now move forward with that thought and develop the exact technology required to make those laws NOT absolute. Each advancement achieved by manipulating the laws of physics would, in and of itself, make the NEXT achievement, previously known to be impossible, possible.Building on the knowledge of each new discovery, nothing would impossible, just not yet realized. Like I said in the title, knowing a thing is not the same as understanding a thing.Follow the author on a “hard science” journey to achieve that which we currently believe to be impossible. Watch YOUR imagination take flight with trips to the moon in less than a day, trips to Mars in a week (currently takes about 13 months). Near light speed travel makes Star Trek, less of a fantasy and more of a possibility. Where will your imagination take you? Theirs took these two young Israeli men to the stars and rich beyond their wildest dreams. And the got the girls too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruce C. Ross",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4MDPCQVRR5ZOHRD7Z6APNJOB5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R161NEN8NWN89K?ASIN=B0CC5RGYXT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars intriguing novel, lots of hard (and imaginary) science",
                "reviewText": "I enjoyed this unique novel, and one of the most intriguing aspects was it made me reconsider my reluctance to accept the often hysterical arguments for global warming. I don’t doubt that mankind is contributing to the overall rise, but when “global warming zealots” try to cancel or shout down any opposing views, as a scientist their behavior has saddened and sickened me.This novel presents one possible result of global warming, and one (almost magical) potential solution. But it IS thought-provoking and well worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMDU43GLJVATNG34ZPTTBTOX7VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B41219A2H786?ASIN=B0CC5RGYXT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Okay, but repetitive",
                "reviewText": "The book is well written, but the story line is a little tired and overused.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Hecht",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFUADW73HRJITFD7UKOADWVO5JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R161NLPK59DW2R?ASIN=B0CC5RGYXT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars The author is scientist.",
                "reviewText": "One of the best science fiction books I’ve ever read, the author is a scientist, so it’s not only mad sci-fi ideas, many logical factors were inserted in this book.I couldn’t stop reading till I got to the end.Highly recommend.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sofia Petrovna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2AFLWCKAMIQUMEXQU4BDY3A5XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EFV6BNILKVBZ?ASIN=B0CC5RGYXT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars They have a means of space travel and all they think about is how to save to world",
                "reviewText": "I am trying to remember ever seeing a book so immersed in describing global warming and its consequences. Just like the author says, we all know what it means and what will happen, but we are doing our own things, occupying our minds with something else. This book will awaken your minds to the matter.“Sometimes we hear on the news that global temperatures will rise by a single degree over twenty years. Usually, when I hear this, I tell myself: ‘one degree? That is not terrible, I can barely feel one degree.’ Do you know how much energy a single global degree represents?” Adam asked, answering his own question after a brief pause. “That energy is equivalent to 400 million atomic bombs13 such as the one the United States dropped on Hiroshima. Not one bomb, not a thousand bombs, not a million bombs and not one hundred million bombs — four hundred million atomic bombs.”“We humans,” added Nadav, “can’t really grasp such huge numbers. It is perhaps easier to understand this figure in a different way: a single degree rise in global temperature is like dropping an atomic bomb for every twenty people living in the world today.”I had to place this quote here because it had the biggest impact on me. It's from a conversation the characters are having about saving the world with their invention. They have a powerful technology in their hands and they can get a Nobel prize for it, but instead, they decide not to share it. They want to make a company and use the technology to go to the Moon for some material that can produce green energy that will not add to global warming. They have a means of space travel and all they think about is how to save to world.I like how it's all detailed and scientifically explained.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}