{
    "remaining_requests": 1401,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Never-Hero-Chronicles-Jonathan-Tibbs-ebook/dp/B00NK1GLM2",
    "body": {
        "name": "The Never Hero (Chronicles Of Jonathan Tibbs Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Never-Hero-Chronicles-Jonathan-Tibbs-ebook/dp/B00NK1GLM2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/917lxlUz56L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "T. Ellery Hodges",
            "link": "https://www.amazon.com/T-Ellery-Hodges/e/B00NK8D5CO/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3429,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Teen-Young-Adults-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3511261011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00NK1GLM2"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Foggy Night Publishing, LLC.; 1st edition (September 12, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 12, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2170 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 386 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#43,658 in Kindle Store (See Top 100 in Kindle Store) #11 in Teen & Young Adult Superhero Fiction #15 in Teen & Young Adult Time Travel eBooks #24 in Teen & Young Adult Aliens eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,429 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/a81d088d-1052-4f24-a818-d355188292e9.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/1e06ec36-72a3-4ae2-a7a3-a560850aa4e9.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/49fb4b9d-9abf-4acd-bad8-e2a005210e0f.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Josiah Ploeger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXDPDUZ3W5E4SKVIVFKEYBSPMXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15AQ27ZR6HDRI?ASIN=B00NK1GLM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved It",
                "reviewText": "Been a bit since I dipped into science fiction and this was a great one to do it with. Character development was excellent and realistic and the plot is very interesting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Floryie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETYZHIN3WSHOSVOKIWWQU2UYVQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HXNP85JSINQO?ASIN=B00NK1GLM2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 16, 2015",
                "reviewTitle": "4.0 out of 5 stars A Hero who is never remembered has a coming of age story for the readers.",
                "reviewText": "I went into the book expecting a perfect hero but what I got was a perfectly portrayed one with personal baggage and issues. Jonathan was well developed in stages with his calm demeanour and his slow realisation that he has to do everything possible in order to survive. He is never heroic in any of the scenes but he rocks as a hero in my opinion. The side characters add a much needed check on the crazy goings on at intervals. Wow, Grant totally irked me with his attitude while Paige made me love her with her vulnerability hidden under a tough exterior. Hayden and Collin added the required nerdy-ness to the story. Leah seems to be a mystery whose character is slightly revealed at the end.The book is so appropriately named. Jonathan will never be the hero because people forget his heroics. That made me sad because I feel the protagonist has to have some encouragement from the people for risking his life every time. The prologue was mysterious and had me thinking in terms of What, Why, How etc., Then the tale started off slowly and picked up pace with my interest being piqued when Jonathan started to become the \"super\" hero. The ending has me questioning Leah, Heyer and the other mysterious persons in the book.In short, I had a good time seeing Jonathan turn his life over to Heyer for mankind's protection.My rating : 3.5/5My reread factor : 3/5Floryie",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mandy chavis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOPSWWJ3E7BGBQR6VNVMNCA552A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LT5GFMYEILBZ?ASIN=B00NK1GLM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow grim coming of age scifi",
                "reviewText": "Enjoyed the book, will be reading the rest of the series. Enjoyed the sidekicks and their discussions of the superhero troupes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B-Macker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTHIVJIGGHCJPL2QOYFIF3OEYIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O21KR3CKQF7W?ASIN=B00NK1GLM2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2016",
                "reviewTitle": "5.0 out of 5 stars A tip of the hat to you, Mr. Hodges",
                "reviewText": "What I enjoyed most:• I very much enjoyed the author’s weaving of the main storyline with Joseph Campbell’s monomyth perspective (The Hero’s Journey), as explained by the supporting cast. This is hard to accomplish without becoming pedantic, and Mr. Hodges managed it wonderfully.Note: As a Christian, I am very interested in how the author is going to execute his secondary characters’ retelling of the Gospel as a graphic novel. (For those who are not Christians, Christ is often seen as just one more example of the Hero’s Journey. Conversely, for Christians, all the other stories that follow this pattern [Moses, Star Wars, Esther, Superman, Ulysseus] speak to humankind’s fundamental desire for a savior and point back to--or forward to--the Christ.) I did appreciate that the author made his Christian character authentic and layered, not just a stock character.• The writing is very good. In places, it is suberb. I even reread a couple of pages just to enjoy the quality of it, and I rarely do that. In particular, it seemed to me that the author has a real gift for inner dialogue and psychological exposition.• The book is polished. There are a few typos, sure, but those show up even in NYT bestsellers.Other observations:• The plot is fine, but there are not too many twists, and you can see those coming. Plot is not a problem, but it may be an area for improvement.• The book probably deserves a rating of PG13. Some foul language, which I don’t favor, but I have to acknowledge that the usage of profanity was thankfully not profligate. Its use was judicious. The same is true for the sexual content in the book; it may not be necessary, but it serves the plot.In conclusion, it’s an impressive debut. Some authors, ruminating over and developing a book concept for years, produce a great first novel. Then the second novel, produced under time pressure, is not up to that standard. My advice to Mr. Hodges: take your time if you can afford to do so. You are a strong talent, and I want to see your best. Your writing is worth the wait. Good luck!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StubsNY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIJFA44E5PEJ46VVGM4JZHJ4AAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PH2LEFUL3BOA?ASIN=B00NK1GLM2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2015",
                "reviewTitle": "4.0 out of 5 stars A decent read, with some stylistic quirks, and an exceptional ending that demands a sequel.",
                "reviewText": "The story in a sentence: college kid becomes the defender of Earth against the big monsters but no one will ever know since when he wins everything reverts back to before the fight.I would give five stars for the last two-three chapter developments that made me immediately go online and search for the sequel, which is still being finished. Do your work well, TE Hodges, make sure you are satisfied that your creations would be satisfied, as well as your readers.Anyway, there was seemingly a conscious trade-off between story pace and development and the author chose development, I was able to skip some paragraphs and not miss any story. Hodges' pace is steady throughout the book and he is gifted in setting a temporal scene. Tibbs, the earstwhile hero, is actually not the most developed character in the book.Over the last few chapters, Hodges divulges the background as to why there are battles, which is truly bizarre and probably would not stand up to a rigorous thesis defense but this does not significantly detract from the story. The love interest is a 'plant'. Battles have been going on for generations and there are other battles with other earth defenders going on.SPOILER -- it would be impossible to continue this review without playing the spoiler but the best part of th book was the ending, leaving me wanting more. Kudos.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colin Ball",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 6, 2021",
                "reviewTitle": "Quality",
                "reviewText": "I've read this book several times now, going back every so often to refresh it in my mind. Why it's never been picked as a film or series eludes me.Jonathan Tibbs is a 22 year old student forced to fight against a force he doesn't understand for reasons he doesn't know, just fight or die, either way no one will ever know what he's done to save them.An excellent story, well written with a flawed hero at its centre. Just someone trying to do their best.Read it and the sequels, trust me!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Slashtrack",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 2, 2018",
                "reviewTitle": "Rocky fights a xenomorph (no spoilers)",
                "reviewText": "A really great read. I liked how the moral and philosophical implications raised by the plot are satisfyingly explored. While the ending may seem a little rushed with a big info dump, its implications could develop some interesting situations in the future. Waiting eagerly for volume 2.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 10, 2017",
                "reviewTitle": "NEVER HERO THE BEST BOOK EVER",
                "reviewText": "It is one of the best superhero books I ever read, and it is not a superhero book at the same time. It is like Logan - it is a superhero movie but it is not. The conflict is soberb, Jonathan is an amazing character, completely focus on his mission as soon as he knows the consequences to others, which I call \"Little Girls's Guilt Factor\" on my account. Jonathan is in a trap and he just don't care because going out is too much suffering to everyone he cares about. He is clever but not clever boring, his angry is like fuel but it is not a supernatural thing that makes him a \"Supersamurai\". Very credlble character. Love the book and read it 3 times.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eileen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 19, 2017",
                "reviewTitle": "Gripping and intriguing story",
                "reviewText": "I loved this book from beginning to end. The story is gripping and intriguing. I recommended it to my friend and gave her the book as a present. Now we're both looking forward to book two.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 30, 2016",
                "reviewTitle": "Read it",
                "reviewText": "I gave this novel 5 stars because... well there are a few great novels that you read where you can't put the book down, the plot or/and characters are immortalised in your memory, or you have to read the novel over and over again just to put your mind back into that world again. The Never Hero is one of these books where both the characters and plot are stuck in my head and I have not been able to put this book down since I bought it. I suspect that I will read this novel numerous times in the coming years and enjoy every second.This novel is set in the modern world wherein a young adult is forced into a situation witch he doesnt want but can understand. Contains unexpected plot twists and a protagonist who is realistic and unusual.However, I am me and you are not therefore your tastes do not follow my own. But this was an amazing read and I have already recommended it to my friends and now to you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}