{
    "remaining_requests": 1553,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shipstar-Science-Fiction-Novel-Heaven-ebook/dp/B00FUWFADU",
    "body": {
        "name": "Shipstar: A Science Fiction Novel (Bowl of Heaven Book 2)",
        "price": "$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shipstar-Science-Fiction-Novel-Heaven-ebook/dp/B00FUWFADU",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91ZoHcttojL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gregory Benford",
            "link": "https://www.amazon.com/Gregory-Benford/e/B000APBPJK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1097,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The dramatic sequel to Larry Niven and Gregory Benford's New York Times bestselling novel, Bowl of HeavenScience fiction masters Larry Niven (Ringworld) and Gregory Benford (Timescape) continue the thrilling adventure of a human expedition to another star system that is jeopardized by an encounter with an astonishingly immense artifact in interstellar space: a bowl-shaped structure cupping a star, with a habitable area equivalent to many millions of Earths. And which, tantalizingly, is on a direct path heading toward the same system the human ship is to colonize.Investigating the Bowl, or Shipstar, the human explorers are separated—one group captured by the gigantic structure's alien inhabitants, the other pursued across its strange and dangerous landscape—while the mystery of the Shipstar's origins and purpose propel the human voyagers toward discoveries that transform their understanding of their place in the universe.At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00FUWFADU"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Tor Books; Reissue edition (April 8, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 8, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2007 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#600,785 in Kindle Store (See Top 100 in Kindle Store) #1,408 in Hard Science Fiction (Kindle Store) #2,994 in Hard Science Fiction (Books) #3,955 in First Contact Science Fiction eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,097 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sotto voce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPR3DAGWZHHNZW2LBMTXU3PLSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MYZKLM4HWT0J?ASIN=B00FUWFADU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2014",
                "reviewTitle": "5.0 out of 5 stars Very interesting change up ... hi-fidelity sci-fi",
                "reviewText": "If you think you know your tech sci-fi stuff, here is a story to expand your imaginings. It is the only tech sci-fi that I've read that provides CAD modeling illustrations at critical technical concept junctures to describe what it would otherwise take a 1000 words to explain poorly. The story has the legs to follow in the tradition of Arthur C. Clarke's Rama saga plus Stephen Baxter at his best. This kind of mental fodder entertainment is hard to find and it pops. The first installment of this story, The Bowl of Heaven, was badly panned by reviewers. I didn't read it because of the hammering. At first ... I wasn't getting in to Shipstar and was thinking the Bowl of Heaven reviewers had nailed it. Then about 50-100 pages in, it hooked me.Any sci-fi that pushes the boundaries of basic concepts gets my attention. Shipstar does that on many levels with theory made manifest, a crisp narrative, and reasonably well developed characters. The book is carried by the author's extrapolations into far future technology, the fringes of today's theoretical speculation.This is a step function change-up on the static dynamics of the Dyson-sphere or Ringworld-like constructs. Shipstar is an ancient, dynamically integrated sun and semi-sphere relic ... thus ... the `Shipstar'. The relic is propelled through the galaxy using the star as the engine. The Shipstar has magnanimously collected whole civilizations into its near-Earth habitable construct where there exists sentient rules and hierarchy. The relic has the surface area of tens of thousands of Earths and remains only sparsely inhabited by the relic's strange collection of 'adopted' life forms.The human ship that stumbles up on the relic is a deep space expedition that happens on the relic. The Earth ships flight path is ploteted directly to the Shipstar that's more or less half way to the final destination of the Earth ship.Physics, astrophysics, hyper-engineering, exobiology, antiquity, evolution, governance and behaviors are mashed up in a compelling read. This is techie sci-fi extraordinaire.5 Star excellent entertainment! I do hope the authors persevere criticism to continue the tale.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas E. Glover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENUWZC5WMPUOVXUS5RCWEPV3GIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ARI7B2ZGWHZF?ASIN=B00FUWFADU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 14, 2015",
                "reviewTitle": "4.0 out of 5 stars Good read, could have been Awesome",
                "reviewText": "This is a worthy sequel to Bowl of Heaven, with more plusses than minuses overall. One the plus side: The narrative kept my interest throughout; the science part of the story is strong, i.e. big, imaginative ideas, with a reasonable level of plausibility. I felt there were a lot of minuses, only a few worth mentioning (others fall into the nitpicky category, but exist nonetheless): Behavior of and human interaction with the Folk was not the way I would imagine it; the dialogue style used by the authors for scenes with humans and aliens was weak, even terrible at times; and, one of the stronger subplots through most of the book involved Cliff and his cat-and-mouse game eluding the Folk, which suddenly and unceremoniously fizzled out at the end....that part was a real let-down for me. Finally, I was hoping for (and pretty much expecting) the story to peak with a big showdown between the Folk and Sunseeker/Redwing, which did not happen. The whole reason for Sunseeker to fly into the jet and wreak havoc was to send a message to the Folk, which I assumed was set-up for a stand-off, which would have been great drama and fun to read...but alas, the authors introduced a new alien species at the end that diffused the situation, which I felt deprived the reader from experiencing a good ol' fashioned humans-outmaneuver-powerful aliens ending. I deducted a star from my rating for this reason alone, but liked the overall story enough to ignore my other complaints and give this read 4 stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kpar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYOJOQXHTQVD3LAGX43O4UW4SVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CEMI0EZG0WZE?ASIN=B00FUWFADU",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2015",
                "reviewTitle": "3.0 out of 5 stars An improvement over the first novel in the series, but...",
                "reviewText": "Better than the first installment on this story. The editing is better, and the descriptive language is better, although still a bit wanting. The premise is that a ramscoop starship, traveling to a sun with a habitable planet named Glory, encounters a solar system sized artifact, gravitationally balanced with the thrust of an induced solar flare, driving the whole contraption through the galaxy.A cross between Larry Niven's famous \"Ringworld\" and a Dyson Sphere, the Shipstar, also referred to in the previous novel as \"The Bowl of Heaven\" carries as passengers a number of intelligent species, all held in servitude by the Folk, or Birdfolk.In the first novel, two bands of humans board the artifact, one immediately falling into the grasp of the Folk, then escaping, while the other party manages to avoid capture. This story describes the interaction between the humans on the run and the varied intelligences on the Bowl, many of whom chafe under the rule of the Folk.At times both derivative and imaginative, this story could be significantly better in the descriptions of the environment, for example, in a number of places, the position of the sun is referred to, relative to the placement of the protagonists, but a little thought makes one realize that it would be anincorrect placement. In other places in the book, there are mentions of places, alien species, and unique conditions that are not fully explained until later in the story. I understand that this is a standard science-fiction fare, requiring the reader to figure out what is going on (like any Philip K. Dick story), here it is a major annoyance, when the author(s) have already placed you in the action, but are leaving out relevant items- failing to build a mental picture.At least the book ends in a typical Niven fashion, leaving tantalizing hints of greater mysteries.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Big Bill",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 5, 2014",
                "reviewTitle": "Lets go Bowl-ing!",
                "reviewText": "Follow up book to Bowl of Heaven elaborates on things happening in the first book. The Bowl is an intergalactic vehiclethat is and has traversed the galaxy and has encountered life of many kinds. In the second book we find out that thereis a lot more to the mysterious Bowl and its beings than was first thought. The beings that appeared to be in charge are nothing more than servants of the real powers , who have reasons of their own to interface with the human travellers. The book wrappedup the story and that may be the end of the two book series. However , the humans , at the end of book two , are about to split their force ; some to stay on the bowl and colonize , and some to relight the torch and head off towards a planetdesignated as Glory. Still plenty of story left , if they wish to write it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "robin street",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 2, 2015",
                "reviewTitle": "enjoyable and easy to identify with",
                "reviewText": "This pair of books are in my top fifty collection, a Niven/ Benford collaboration is bound to produce some thing special and different. The human players in the two tales are very believable, enjoyable and easy to identify with. These two books can be enjoyed by any one with an imagination, no requirement for understanding of the physics/ engineering of the bowl is necessary to enjoy and be entertained as a reader.Please enjoyRobin",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 7, 2015",
                "reviewTitle": "Superb",
                "reviewText": "I am really enjoying this series and cannot wait for the next one. The imagination involved in creating the Bowl and its inhabitants is truly amazing. Science fiction at its best",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave in Merrickville",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 24, 2017",
                "reviewTitle": "I recommend it.",
                "reviewText": "This is entertaining read! I recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Latenighter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 16, 2016",
                "reviewTitle": "Bit too technical for me.",
                "reviewText": "I'm not sure how much of this story is down to Larry Niven. It had too much technical description for my taste. Also, I didn't know it was part of a series, and I think I should have read the earlier book first. It was obvious that a lot had happened to the protagonists earlier that I didn't know about. Good setting, interesting aliens.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}