{
    "remaining_requests": 1444,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fox-Wife-Novel-Yangsze-Choo-ebook/dp/B0C2MX9J7R",
    "body": {
        "name": "The Fox Wife: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fox-Wife-Novel-Yangsze-Choo-ebook/dp/B0C2MX9J7R",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71VM-tfv4EL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Yangsze Choo",
            "link": "https://www.amazon.com/Yangsze-Choo/e/B00B4EASW6/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 21,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Some people think foxes are similar to ghosts because we go around collecting qi, but nothing could be further than the truth. We are living creatures, just like you, only usually better looking . . .Manchuria, 1908.In the last years of the dying Qing Empire, a courtesan is found frozen in a doorway. Her death is clouded by rumors of foxes, which are believed to lure people by transforming themselves into beautiful women and handsome men. Bao, a detective with an uncanny ability to sniff out the truth, is hired to uncover the dead woman’s identity. Since childhood, Bao has been intrigued by the fox gods, yet they’ve remained tantalizingly out of reach—until, perhaps, now.Meanwhile, a family who owns a famous Chinese medicine shop can cure ailments but can’t escape the curse that afflicts them—their eldest sons die before their twenty-fourth birthdays. When a disruptively winsome servant named Snow enters their household, the family’s luck seems to change—or does it?Snow is a creature of many secrets, but most of all she’s a mother seeking vengeance for her lost child. Hunting a murderer, she will follow the trail from northern China to Japan, while Bao follows doggedly behind. Navigating the myths and misconceptions of fox spirits, both Snow and Bao will encounter old friends and new foes, even as more deaths occur.New York Times bestselling author Yangsze Choo brilliantly explores a world of mortals andspirits, humans and beasts, and their dazzling intersection. Epic in scope and full of singular, unforgettable characters, The Fox Wife is a stunning novel about old loves and second chances, the depths of maternal love, and ancient folktales that may very well be true. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C2MX9J7R"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Henry Holt and Co. (February 13, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 13, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 10666 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 392 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1529429757"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,929 in Kindle Store (See Top 100 in Kindle Store) #16 in Mystery, Thriller & Suspense Literary Fiction #26 in Historical Literary Fiction #27 in Fairy Tale Fantasy (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 21 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2533358-51a1-46c7-9051-1dbe0712d6f1.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36b30fa4-f131-408b-9d9f-eb74e2c73524.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d47c0cef-3e15-4f2f-a587-d9e0870d2585.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d448f230-3c27-45ae-bde4-f2b60bec8ef6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6450055b-a808-445e-858e-244a5acbbfd4.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Beata Garrett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE4X2JNOFXCPUH5Y2U7WOYSCUQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A7UYIMVUOHCA?ASIN=B0C2MX9J7R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars An immersive historical fairy tale",
                "reviewText": "Set in China during the end of the Qing Dynasty, The Fox Wife is narrated from dual perspectives and tells a tale of lost love, regret, and revenge. Choo’s writing and characters were so compelling to me and I ended up loving so many unexpected twists and characters. This is the perfect book for those looking for a bit of mystery, some folklore, and a slower story that’s sometimes deeply sad and introspective, but which has a dash of comfort.One of the things I loved so much about this book is how both Snow (the fox lady) and Bao (the detective/fixer) have such strong and unique narrative voices but both of them are the same in many ways–-both suffering from the loss of a loved one that was taken from them and both on a journey to fill that hole in themselves one way or another. They were both a delight to read, with Snow’s chapters in particular being such cliffhangers, while Bao’s are more bittersweet and melancholic. I enjoy that although Bao ends up finding more and more about Snow, his chapters are still very much about him.This book truly is a journey that crosses the Chinese countryside and cities. It’s fascinating to see both a revenge tale and a missing person case interwoven like two train tracks merging into one. Along the way, there’s plenty of interesting characters both narrators encountered and I loved how each side character lent a certain atmosphere to the scene of the book. It felt like a Studio Ghibli movie in a way, where the side characters don’t stick around for long but they leave an impression even if you don’t necessarily learn anything incredibly interesting about them.Choo’s writing is immersive and it feels like she’s telling the reader a great bedtime story or fairytale. The folklore and myths surrounding fox spirits, gods, etc. are done really well and with an expansiveness I haven’t seen in other stories about East Asian fox mythology. It also makes for great humorous moments and really fun mini stories. It’s also interesting to see how human faith in them has wavered over time and how that reflects how China was rapidly transforming as the Qing Dynasty would be known as the final dynasty.It’s very fitting then that this historical backdrop, a farewell of sorts, reflects the emotional state of its protagonists at times. I loved how clever Snow was but how much compassion she had too for those who earned her trust and how Bao was similarly an old man trying to do good things and unexpectedly finding purpose again. These are two characters that have lived a rich, full life and are at the end of them in one way or another, and they have to confront this emptiness (be it death or toss of home and unfulfillment) that awaits them and which has haunted them for a while.There are bright and lovely moments in The Fox Wife, but not so much that I ever felt that it took away from the main story. Every action the characters (including the side characters) took felt right, even if it was one they would regret later. That being said, the plot had a bunch of surprising twists near the end that I loved and which took the story in a wholly original direction.The Fox Wife is a book I can see myself revisiting bits of, especially Snow’s chapters, just to feel and re-experience Choo’s writing. Sometimes chaotic and funny, other times melancholy and poignant, this book took me on an excellent journey I won’t forget.Thanks to NetGalley and Henry Holt and Co. for an ARC in exchange for my honest review!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StoryBook Lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBDW6XTAPJ73CAVPKMEHSND2IUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13JPS2AWF3XPY?ASIN=B0C2MX9J7R",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Historical Magical Realism",
                "reviewText": "The Fox Wife draws you into turn of the century China, in 1908 and a world of magical realism where the fox spirit really exists. According to Chinese folklore, the fox spirit is a shifter that can appear as a beautiful person who enchants humans. Like folklore in many other cultures, this fox is a trickster who can charm people to give them their desires. The story is written from two opposing points of view. It begins with Bao, a sixty-year-old detective who has the uncanny ability to recognize lies when he hears them. He is brought in to find out the identity of a dead woman. With this beginning, one might expect a mystery novel, but this task is merely an event that evolves into a quest to find two people who he begins to believe are fox spirits. The story than switches to Snow who is a woman searching to avenge the death of her daughter.Snow is written in the first person and the reader is privy to her anguish, thirst for revenge, and empathy with humans. It is through her character that we learn about fox folklore and how foxes have to carefully behave to avoid being caught. The fox characters, mirror the role of women in that society for they also have to live carefully by the rules and can be so easily mistreated. We sympathize with her for her loss of her child and empathize with her attempt on the 1000-year quest of righteous behavior.Bao, on the other hand, is written in the third person and his story wanders between the present day, childhood memories and strange dreams. As a child, he prayed to a fox god and believes that his uncanny talent is fox given. I found him a quite interesting character and couldn't wait for him to find all the characters that he was destined to meet up with.The author does a fantastic job of world building. The turn of the century Asian scenery is easily visualized. The characters are written with depth, and I loved reading about all the major characters. Unfortunately, this book is a slow read. It meanders through several smaller plots and takes a bit too long to reach its conclusion. For that reason, it might not be your cup of tea. However, if you don't mind the slower pace, it is a fantastic book.I wish to thank the publishers, Henry Holt and Company along with NetGalley for both a PDF review copy of the book and access to the audiobook. I alternated between the two formats. The audiobook is narrated by the author herself. Choo has a soothing voice. Although her storytelling is expressive, she does not differentiate her voice between the various characters. For that reason, it is sometimes hard to follow the audiobook. She would have been better served to have a professional narrator. I loved the book, and I gave the text edition of this book four stars. However, I recommend that most people would enjoy the text editions more than the audiobook. If you are a folklore fan, or a lover of historical fiction and magical realism, this is a book for you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}