{
    "remaining_requests": 1611,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Social-Fiction-Chantal-Montellier/dp/1681377403",
    "body": {
        "name": "Social Fiction (New York Review Comics)",
        "price": "$17.39",
        "originalPrice": "",
        "rawPrice": 17.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Social-Fiction-Chantal-Montellier/dp/1681377403",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81qbLlK4a8L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Chantal Montellier",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Chantal+Montellier&text=Chantal+Montellier&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 10,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Authoritarianism and resistance to it are twin threads that run through the dystopias of Social Fiction.... Montellier’s drawings favor clean, symmetrical lines and a meticulous attention to detail....The dialogue is beautifully and idiomatically rendered in English by the poet Geoffrey Brock, who also contributes an introductory note and an interview with the author.\" —Laila Lalami, The Nation\"Montellier is no prophet, but rather a feminist and an anti-fascist. Her dystopias of the ’70s and early ‘80s address political, social and technological conditions which follow from patriarchy. Her alternate futures are real because they flow from our present, and her insights remain relevant and profound.” —Helen Chazan, The Comics Journal“There's anger in Social Fiction by Chantal Montellier but it's tinged with a wry sadness...which I think is best summed up by this quote: '...the betrayals of the 'leftist' government and the destruction of working-class communities upset and revolted me.'\" —Clark Burscough, The Comics Journal \"The Best of 2023, As Decreed by Our Contributors\" \"I loved this. Montellier’s shade of political disillusionment has a strikingly Ballardian sheen—dilapidation preoccupied with the appearance of function—with gorgeous cartooning. 'Dear Collaborators' might be the best one-page comic I’ve ever read.\" —Hagai Palevsky“A pioneering woman in French comics […] Montellier, who is now 76, is not as flashy and action-oriented as her male counterparts of the era. What comes through in these stories is her dark humor, feminism, and still-relevant political allegories about government control over our lives. We’re fortunate this work has finally been translated.” —Matt Bors, Bors Comics“Hauntingly farsighted satire…, which still feels vibrant and at the same time prophetic.” —Emmet O’Cuana and Kumar Sivasubramanian, Deconstructing Comics “This book collects together the 70s and 80s dystopian visions of the pioneering French feminist cartoonist Chantal Montellier in the form of three novellas. With its focus on the horrors of totalitarianism...it is gripping and sometimes darkly funny.” —Rachel Cooke, The Guardian “Rachel Cooke’s Best Graphic Novels of 2023”“Published together in English for the first time, this spiky collection of three science fiction graphic novellas from Montellier, one of the few women published in the famed French comics magazine Métal Hurlant in its heyday, makes a case for her place as one of the publication’s brightest creators. . . . Montellier’s firm line and punk ethos recall the early, science fiction–themed installments of Love and Rockets, but her vision is far bleaker, fueled by political rage, satirical wit, and a full-bore feminist drive. The anarchic sensibility feels both of its time and eerily prescient. It’s a thrilling introduction to an unmissable comics talent.” —Publishers Weekly\"Montellier's 'dirty future' is not just dirty, it is barely functional. The dystopia in Social Fiction droops from the loosening tape that holds it together, yet people still comply. Like most Métal hurlant contributors, Montellier lived through 1968, but unlike nearly all of them, she worked extensively in radical leftist venues prior to her narrative strip work; the sigh behind her pestilent societies is that of faded promise.\" —Joe McCulloch, The Comics Journal\"The perils of totalitarianism take center stage in this collection of grimly humorous science-fiction novellas…Montellier emerges as a true visionary of the graphic-novel medium and the science-fiction genre in these captivating tales of human beings struggling to retain their dignity under repressive regimes.\" —Tom Batten, Library Journal About the Author Chantal Montellier is a French novelist, painter, and comics creator. Montellier began working as an editorial cartoonist in 1972, with work appearing in newspapers and magazines such as Politis, L'Humanité, and Marianne. A contributor to the renowned comics magazine Métal Hurlant and one of the most active female comics creators in France, Montellier is known for her realist drawing style and her engagement with political and feminist themes in her work. Geoffrey Brock is the author of two books of poetry, most recently Voices Bright Flags, and the translator of a number of books, including the NYRB Classics and NYR Children's Collection editions of Carlo Collodi’s Pinnochio and the NYRC edition of The Tenderness of Stones."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 18 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Appearing together in English for the first time, three politically charged sci-fi graphic novellas by a pioneering French comics artist.Dark, smart, and indomitably cool, the ’70s and ’80s dystopian visions of Chantal Montellier still unsettle.Visitors to an underground mall must recreate civilization after a nuclear strike may have wiped out the rest of humanity. Newlyweds find themselves implicated in a government eugenics program. A disembodied authority reprimands a man for stepping out of view of a security camera.In this collection of three novellas—Wonder City, Shelter, and 1996—published together in English for the first time, Montellier’s blend of dark humor, gripping storytelling, and consistent focus on the perils of totalitarianism shows her to be a master of both comics and science fiction.Social Fiction includes a Q&A between Chantal Montellier and Geoffrey Brock. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ New York Review Comics (July 25, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 200 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1681377403"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1681377407"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.32 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.03 x 0.66 x 9.24 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#663,642 in Books (See Top 100 in Books) #610 in Contemporary Women Graphic Novels (Books) #3,140 in Science Fiction Manga (Books) #3,163 in Science Fiction Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 10 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. HigginsJ. Higgins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYXG7EPNPUFIVW4ZO4OE6MQADYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X430QQLFINP3?ASIN=1681377403",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "5.0 out of 5 stars English translation of 1970s and 1980s comics from 'Metal Hurlant'",
                "reviewText": "Those old enough to remember reading ‘Heavy Metal’ magazine in the late 1970s and early 1980s likely remember the comic ‘1996’ by the French artist Chantal Montellier. ‘1996’ depicted various goings-on in a dystopian, near-future New York City where life was anything but precious, and the ruling class indifferent to the sufferings of the less well-off. Montellier used a distinctive black-and-white, ‘gritty’ drawing style that contrasted with the more polished artwork then appearing in the magazine.Issued in July 2023, and coinciding with the unfortunate cancellation of ‘Heavy Metal’ magazine by its publisher Massive, ‘Social Fiction’ compiles English translations of all of the episodes of ‘1996’, as well as two other comics that Montellier published in France in ‘Metal Hurlant’ in the early 1980s: ‘Wonder City’ and ‘Shelter’.One drawback to this trade paperback from New York Review Comics (an imprint of the New York Review of Books) is that at 7 x 9 inches it’s considerably smaller than the dimensions of the magazines in which the comics originally were printed. As a result, the panels and their text have a cramped presentation that can make reading more laborious than I prefer. Too, the finer details of Montellier’s draftsmanship, particularly in ‘Shelter’, tend to get lost in the downsizing.One area where this presentation gains favor, is in its elimination of the phonetic, mangled English translation that ‘Heavy Metal’ editors Sean Kelly and Valerie Marchant sometimes substituted for selected ‘1996’ episodes (National Lampoon executives Matty Simmons and Leonard Mogel appointed Kelly and Marchant to helm 'Heavy Metal' because Kelly and Marchant spoke fluent French).Why Kelly and Marchant substituted the dialogue text is a mystery; they probably thought it was 'hip'. Well, with ‘Social Fiction’ you get a straight English translation, which makes understanding ‘1996’ much, much easier.Who will like ‘Social Fiction’ ? Well, fans of the early years of ‘Heavy Metal’ once again will enjoy perusing the adventures of ‘1996’ and the black humor that Montellier brought to her depictions of a near-future, dystopian New York City. ‘Wonder City’ and ‘Shelter’ also deliver cutting, satirical dissections of late 20th century society, from an unapologetically feminist perspective.As for younger readers, I’m guessing indie comics hipsters may recognize ‘Social Fiction’ as a fine vehicle by which they can further their hipness. That’s fine, as long as the hipsters recognize that the book is very ‘French’ in its attitudes………",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51dmCAM1tLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61o4ErQGdNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81IrN0v8rXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81QmEF6OamL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81mnMap6nyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "nadrad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSP6XKKEW2SUI4XUDFZ6GTKWDTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ENAK7Y79YJ34?ASIN=1681377403",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome social review",
                "reviewText": "Should be required reading in high schools. Think 1984.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}