{
    "remaining_requests": 1398,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mindwalker-Kate-Dylan-ebook/dp/B09X5B994T",
    "body": {
        "name": "Mindwalker: The action-packed dystopian science-fiction novel",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mindwalker-Kate-Dylan-ebook/dp/B09X5B994T",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81S0LZuum2L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kate Dylan",
            "link": "https://www.amazon.com/Kate-Dylan/e/B07RLK9LMB/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 192,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09X5B994T"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Hodderscape (September 1, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 1, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3098 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 315 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#304,328 in Kindle Store (See Top 100 in Kindle Store) #728 in Cyberpunk Science Fiction (Kindle Store) #1,145 in Cyberpunk Science Fiction (Books) #3,926 in Science Fiction Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 192 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED3XQOZPODEOSU4IH7INOZVSLVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JOG7QRIWGEZB?ASIN=B09X5B994T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Read this. I'm asking you nicely.",
                "reviewText": "Genius, fast-paced, full mi of suspense, heroinism, wit, and tech, with a touch of emotion and love. It should be a movie.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaitlyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRD35OXAHRX6WZRYBYS3CKD3SIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3515CPYQ081O8?ASIN=B09X5B994T",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Fun and exciting — snarky MC!",
                "reviewText": "3.5 stars. I enjoyed this one! Great worldbuilding, snarky narration, and an interesting plot. The romantic relationship fell a little flat for me and I wish the book had been longer with a deeper emotional plot but it was a quick and entertaining read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Edmund",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCZERNJOXNOVCXZ4NZKIAITHEAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BA9169Z1WIVB?ASIN=B09X5B994T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Walk Your Mind into This Book",
                "reviewText": "Mindwalker has the perfect sci-fi blend of being action packed and fun, while still having some (hence the name I guess) mind-bending technology themes that sent my brain spiralling. If I'm honest the first few chapters gave me the illusion that the book was mostly just going to be a fun romp, but by the end I was reeling from the thematic development which touched on autonomy, mind control, propaganda, conspiracy and free-will.That's not to say the story is a staid preachy affair, there are plenty of explosions and Goddam Dylan did not hold back with some of the action - I did think this book would make an awesome movie, but possibly with an R rating!Now normally with series or potential series I don't really like the trope of book one being a tight action story and then the World Building gets expanded the author gets to bore me to death with later books, but I am BEGGING for this world to be expanded on in later books, there is so much to be built on and this trope is exactly what I want to happen. Mindwalker is a fairly tight affair in terms of world-building, there's just enough exposition to make the world 'pop' but I'm keen for more. In conclusion this book is great, sci-fi is great, mind-control is scary , Ryder Stone is possibly the biggest block of cheese name in YA, but we can't all be perfect - Read this book!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CapnMarrrrk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFEFGEAFTDGIMIOPDS6BTP3U2XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6RG8XEL99I3E?ASIN=B09X5B994T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2023",
                "reviewTitle": "5.0 out of 5 stars A Gripping Action Adventure",
                "reviewText": "I got hipped to this book by Kate herself in the newly minted BlueSky Book Club. Promotion is HARD! I'm glad she did because I thoroughly enjoyed the book. It has everything I like in Dystopian Cyberpunk stories: Plucky hero, evil corporations, post-post apocalyptic world building, narrative twists/turns, sudden reveals. Good Stuff! The story held me and forced me to drop my plans and read it. So yeah. If you want to spend a day jumping into a thrill-ride of a story this is the books for you. That said, I'm really looking forward to the sequel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7ITS5IBHG5I2A3MXDVCKLT5G6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T9RAMJ9EC2J4?ASIN=B09X5B994T",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2022",
                "reviewTitle": "4.0 out of 5 stars A Fun, Thought Provoking Sci-Fi",
                "reviewText": "“Do not let them rule you.Do not let them own you.Do not surrender control.”This was one of my Goldsboro subscription books and honestly when I first saw that this was a selection, I was a little apprehensive. I don’t read a lot of YA anymore and have become very selective of the few I do pick up, and I had never heard of this book. I read the synopsis and early reviews were pretty good, so I decided to give it a go and I really was surprised by how much I enjoyed this.This is a sci-fi novel about this young girl named Sil Sarrah and she works for this company called Syntex. They have a program called the Walker program where young people are fitted with these devices in their heads that allow them to take over certain people’s minds and help them survive on missions. Sil is the best Walker that Syntex has seen in a while, she’s never lost a person and she plans to keep it that way.However, a mission ends up going left and she is now being accused of going rogue and being a spy. Now the organization that she’s given so much of her life to is after her and she is forced to flee the only place she has known for 10 years. Desperate to clear her name, she infiltrates this secret agency whose whole mission is to tear down Syntex. While there, she learns things that bring everything she has been taught into question.I really enjoyed Sil as the main character. She feels young, because she is, but she actually was really quick witted and had a lot of intelligence for a character so young. She made pretty sound decisions and she was fearless, which is something I like to see in these types of novels. You could also see how much she cared about her friends and despite certain things unfolding, she always thought of them and tried to protect them.While this is YA, I think this has great crossover appeal. There is a bit of a quick romance that develops, but I didn’t think it was too bad and I wouldn’t say it’s instalove. I actually was okay with the relationship. It doesn’t take over the story, but it is there for people who like that in their stories and I was lowkey rooting for the couple. I liked them together and I love how the author handled this in the end, it was very realistic and is not something I see often in YA.The best part of this book is the world building and the technology, which are my favorite parts of sci-fi stories. The Walker program that Syntex has created is actually brilliant when thinking of it purely from a technology standpoint. The way people have the ability to enter other people’s minds and help them survive dangerous missions is something that I could see coming in handy in very specific situations, but overall it leads to some pretty big ethical issues and questions. The biggest problem is when it comes to consent and how consent is thrown out the window when a company has the ability to enter your mind and how they may not always have permission to do that. I can’t talk too much about this without getting into spoilers, but I loved the conversations this book was having.The book was also discussing how a lot of big businesses, especially ones that create technology, get away with doing a lot of bad stuff with little to no repercussions. It’s also difficult because in this world that Dylan has created, there are some great things that technology has given them, things that even save people lives, but there is always a downside to technological advance and that’s mostly how the people at the top will find a way to exploit it and it almost always affects those on the bottom rungs of society.The other way this book deals with consent is how it deals with how a company like Syntex gets “consent” from these young kids to be apart of this Walker program. It’s important to note that Walkers don’t have a long life expectancy, they normally don’t live past the age of 19. Laws have been created in this world so that kids can give consent, meaning they don’t need their parents permission to get a dangerous device that kills them by 19 implanted in their brains.I found the story itself really exciting. By the time we got to the end of the story, I was so invested and there were a couple of moments that genuinely shocked me, moments I didn’t see coming at all. I do wish the very end of the book was a bit more dynamic, but overall, this was a super strong book and I’m definitely going to be keeping my eye on Dylan for any future releases.“For better or worse, I’m living the final act of the future I chose. The legacy I chose. Now I just have to make it count for something.”CW for death, violence, and graphic medical descriptions.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HeartFullOfBooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDKWXY6SGLAYVVD64XMHXRIZJMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RY360B3O7UUE?ASIN=B09X5B994T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2023",
                "reviewTitle": "5.0 out of 5 stars excellent sci-fi!",
                "reviewText": "I really enjoyed this fast-paced sci-fi, with a badass main character driven by strong beliefs, and who’ll do whatever’s necessary. This is an excellent YA sci-fi! I can’t wait for the sequel!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelsey Morris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGT3LDJRE3NUCGLAMM3I7QSEP7WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13XC2BGUTR0KD?ASIN=B09X5B994T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Phenomenal",
                "reviewText": "I haven't read a book since December, I've been in a horrible reading slump. Yesterday while on tiktok I saw this book and thought why not try it. I just finished this book and I am so happy I did. There wasn't a slow moment out of this entire book, it was a fast paced, thrill ride that I could not put down. Definitely recommend. Definitely five stars from me",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Borszik",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG674BMVPLS3GPTTDWILZ5XYQ4PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24CSSN7DGLRF0?ASIN=B09X5B994T",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2022",
                "reviewTitle": "5.0 out of 5 stars The story line gets ++ and the writing style gets ++++",
                "reviewText": "My deep dive in reading sci-fi literature has brought me to this intriguing book which had me hooked in the first chapter of the Kindle sample. The style is sooooo refreshing! Plus, I had fallen in love with Sil’s hair colour and now that I finished the book, I must say the plot has a few unexpected turns that just kept me glued to the screen of my iPad. I thank the FB group International Sci Fi and Fantasy Book Club for the recommendation and hope Kate writes another book in the genre and maybe even ventures writing for an adult audience - I’ll promise I buy it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amazon customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 14, 2023",
                "reviewTitle": "Enjoyable and fast-paced",
                "reviewText": "Interesting plot and characters. Very enjoyable read overall.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 9, 2023",
                "reviewTitle": "A great read",
                "reviewText": "A great, dystopian sci-fi novel. Really explored some interesting concepts, some great moments I didn't see coming. I loved this book- it was a great step to get me back into reading. First fiction book I've finished for a long time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N Hatchman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 15, 2023",
                "reviewTitle": "A wild ride through dystopian tech",
                "reviewText": "I love a fast-paced, tightly plotted novel, and Mindwalker was an absolute thrill from start to finish. If you love a good sci fi story, you MUST read this one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lora - My_last_writes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 21, 2022",
                "reviewTitle": "Top 5 of 2022",
                "reviewText": "Addictive, fast paced, action packed brilliance, Mindwalker had me on the edge of my seat, filled with twists that I didn't see coming.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ThereisalwaystimeforbooksThereisalwaystimeforbooks",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2023",
                "reviewTitle": "Incredible debut!",
                "reviewText": "I love love love this book! This book is action packed with advanced tech, kick ass leads and an incredible storyline! Initially the gorgeous cover pulled me in when I saw a reel on Bookstagram, so I read the blurb and made an impulse purchase there and then. I have zero regrets!I loved Sil, she is the selfless heroine who wants to do right for her family, friends and the world. Ryder is the intriguing rogue who shows her a new perspective and sparks fly.I would say this book is YA in the romance department, there are intense feelings but the sexy scenes are fade to black with the details.A fantastic debut book all in all as it gave me THE FEELING. The one where I need to read it as quick as possible because it’s so good but I also don’t want it to end!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71DVrD0fCqL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}