{
    "remaining_requests": 1436,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Captivating-Stories-Curious-Kids-Unbelievable/dp/B0CLHB1QJ3",
    "body": {
        "name": "Captivating Stories for Curious Kids: Unbelievable Tales From History, Science and the Strange World We Live In",
        "price": "$11.90",
        "originalPrice": "",
        "rawPrice": 11.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Captivating-Stories-Curious-Kids-Unbelievable/dp/B0CLHB1QJ3",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51QhGf9f AL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61NK4Zb4EWL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Chris Munoz",
            "link": "https://www.amazon.com/Chris-Munoz/e/B0CLP5M2V7/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 203,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 53 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CLHB1QJ3"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Independently published (October 20, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 146 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8864926154"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 7 - 10 years, from customers"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.33 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,724 in Books (See Top 100 in Books) #1 in Children's Buddhist Fiction #1 in Children's Buddhism Books #1 in Children's Eastern Religions Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 203 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Venture into the Unknown with Great Explorers Go on an expedition through time, following in the footsteps of legendary explorers like Ernest Shackleton, Christopher Columbus and Sacagawea. Each story is designed to fascinate, inform, and inspire. Uncover hidden gems of history. The Greats Who Transformed Their Fields Introducing exceptional people who have made a huge impact on our world. From Michael Jordan's record-shattering feats to Thomas Edison's light-bulb moments and Dr. Seuss's whimsical worlds, get to know the stories behind these iconic figures. These easy-to-digest stories can serve as powerful lessons of perseverance, innovation, and creativity. Discover the Bizarre Quirks of Our World Prepare for your mind to be boggled by a collection of stories about the most unbelievable and curious events and creatures. Learn about Australia's infamous Emu War, the Spirit Phone that purported to communicate with the dead, and the dancing plague that left an entire town in frenzied motion. These tales will have you questioning and marveling at the strange world we live in.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/dff51fce-a342-4295-9265-c4dc32681d17.__CR0,0,640,640_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/fd5c7b35-9379-4edf-8cf5-fa4980b437da.__CR0,0,1400,1400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/a3ecc7f4-7913-45a2-ae06-47018aad0b6c.__CR0,0,1400,1400_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/4af592b6-f5b5-4aef-9cdd-b5e8e06151dd.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/dff51fce-a342-4295-9265-c4dc32681d17.__CR0,0,640,640_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/fd5c7b35-9379-4edf-8cf5-fa4980b437da.__CR0,0,1400,1400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/a3ecc7f4-7913-45a2-ae06-47018aad0b6c.__CR0,0,1400,1400_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP4B5IBEVYL3CMX5BOOKCPJGFNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C1IXUWPVTE6E?ASIN=B0CLHB1QJ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Its a Winner !!!",
                "reviewText": "I purchased this for my 10 yr old . He loves reading and learning fun facts and I truly scored with this book ! Ordered on a Thursday and it arrived on Friday .As soon as I gave him the book - he did not put it down ! Finished it all ! He truly enjoyed each story. Highly recommend !",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samantha Gordon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRMR3BU2XG5ZDEUAC7M6DH4RTXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18XN53XCSGB1P?ASIN=B0CLHB1QJ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing Compilation of Factual and Informative Stories that keep Your Child Wanting to Read More!",
                "reviewText": "You guys!?! I was so impressed with 'Captivating Stories for Curious Kids' by Chris Munoz! I have never been so content with any book I have bought for my kids because halfway through I have lost their attention. This book is a compilation of short stories that challenge your child with critical thinking skills and keeping them entertained (\"The truth is stranger than fiction\" included in the introduction). These short stories cover a wide variety of topics including the animal kingdom's story of \"The real Winnie the Pooh\", stories of accomplishments such as the first recorded journey across America, and even the weird ways people entertain themselves like people trying to create phones to talk to the dead! A great feature in the book is that it is so attention-grabbing! For instance, at the conclusion of the prolog states, \"If you want to be entertained, read on.\" My daughter was saying, \"Well, go on Mommy, turn the page!\" These stories are told about factual events that happened in history that I was not even aware of! One of those was the short-story, \"The Spirit Phone\" which is about Thomas Edison's oddest idea that he never had a chance to finish, a phone to talk to the dead! True Story! But if your little buddy loves animals like mine do? This entire compilation of short stories is worth ordering for the tale, \"Unlikely Friends\", that is about a 600-lb baby hippo named Owen that washed up with the debri on the coastlands of Indonesia, Sri Lanka, Thailand, and India after the Indian Ocean Tsunami on December 26, 2004, who found his best friend \"Mzee\" (an old Aldabra tortoise) he met at the sanctuary he called his new home! Not only do these stories teach facts and informs us about history, but helps with seeing the world in a new way, makes the reader wonder, look closer, and ask more questions, and most of all, that everyone has their own unique story. These stories will show that real life can sometimes be stranger than fiction!",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Huda Zahid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNUXXA4J3MTTWMNULPCANXJ2PKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4ZDIHVOG9XNU?ASIN=B0CLHB1QJ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "5.0 out of 5 stars A skillfully blend of knowledge and amusement",
                "reviewText": "This remarkable book stimulates young minds through compelling and educational explorations of science, history, and exceptional characters. It is the best way to create a passion for reading and to reduce screen time among kids who always have electronic devices in their hands. I babysit my youngest and funniest cousin, who never stops asking questions. I bought it for her to satisfy her natural curiosity. We read together in the evening. The first chapter about the life of historical figure Alexander Hamilton impressed her. Now, she is convinced that getting an education is essential as it opens doors to various opportunities in life. She became intrigued by the nickname of immortal jellyfish due to the polyp and medusa stages of the jellyfish. She enjoyed reading about the orange-throwing culture in Italy. The fourth chapter about Michael Jordan gives the best life goals message to the kids: \"Work hard to fulfill your dreams.\" We finished the first four chapters and enjoyed our company, which helped my cousin boost her confidence. We plan to read together the following weekend to learn more things.Consequently, the writer did an excellent job of balancing curiosity and valuable knowledge, carefully considering and researching every word. This book is an essential resource for parents and educators, offering an engaging approach to motivate and develop young brains through stories of unique heroes told in accessible language. The book also serves as a treasure hunt for the kids, making them feel like they are on an adventure to discover new and exciting things and unlock their hidden potential skills.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mzeidan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE74CIIOXYTHFC6GD6YLEQ3GGFFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U29V1FOBDVAZ?ASIN=B0CLHB1QJ3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Captivating Stories for Curious Kids",
                "reviewText": "Captivating Stories for Curious Kids\" is a delightful collection that lives up to its title. This book is a treasure trove of engaging tales that captivate young minds and encourage curiosity.Each story within this anthology is carefully crafted to entertain and educate children. The diversity of narratives ensures that there's something for every young reader, from adventurous tales to heartwarming stories that impart valuable life lessons.The writing style is wonderfully accessible for kids, employing vivid imagery and relatable characters that make the stories come alive. The book not only sparks imagination but also encourages children to ask questions, explore new ideas, and learn about the world around them.The stories' length and pacing are perfectly suited for short reading sessions, making it an ideal choice for both individual reading and shared storytelling moments. Additionally, the vibrant illustrations complement the narratives, enhancing the overall reading experience.\"Captivating Stories for Curious Kids\" is a fantastic addition to any child's library. It fosters a love for reading, sparks curiosity, and leaves a lasting impact on young readers by nurturing their imagination and thirst for knowledge.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}