{
    "remaining_requests": 1569,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/H-Beam-Piper-Megapack-Classic-ebook/dp/B00BPZF234",
    "body": {
        "name": "The H. Beam Piper Megapack: 33 Classic Science Fiction Novels and Short Stories",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/H-Beam-Piper-Megapack-Classic-ebook/dp/B00BPZF234",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51dSuyQAjML._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "H. Beam Piper",
            "link": "https://www.amazon.com/H-Beam-Piper/e/B000APKFF0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 629,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00BPZF234"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Wildside Press (March 6, 2013)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 6, 2013"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3002 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 1774 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#85,108 in Kindle Store (See Top 100 in Kindle Store) #83 in Science Fiction Anthologies (Kindle Store) #209 in Science Fiction Anthologies (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 629 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Karl Janssen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEN7YT5ZS4SXPJPSOFXY7T6MPRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FWZTYDR2QYCK?ASIN=B00BPZF234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2018",
                "reviewTitle": "5.0 out of 5 stars Nearly his complete works",
                "reviewText": "The publisher Wildside Press has produced an extensive line of inexpensive ebook collections of genre fiction resurrected from the pages of vintage pulp fiction magazines. Their Megapack series includes dozens of science fiction titles, including both multi-author anthologies and collections devoted to individual authors. Among those featured in the latter category is H. Beam Piper, an exceptional sci-fi author who was active from the late 1940s until his death in 1960. The H. Beam Piper Megapack is essentially a complete works collection of Piper’s writings up to 1963 (several of his works were published posthumously). His works published after that date were likely omitted due to copyright restrictions. Rather than list what’s in the Megapack, it’s quicker just to state what is missing: Piper’s novels The Other Human Race (a.k.a. Fuzzy Sapiens) and Fuzzies and Other People, from his Fuzzies series; his novellas Gunpowder God and Down Styphon!, which were eventually combined into a novel, Lord Kalvan of Otherwhen; and his novel First Cycle, which was completed posthumously by another author and published in the early 1980s.What this Megapack does include is a lot of fantastic science fiction. Piper is a master at creating well-thought-out worlds rich in intricate detail. His two main personal interests were collecting firearms and libertarian politics, so naturally many of his stories deal with political or military matters. Piper often crafts Byzantine interplanetary bureaucracies just to prove a point about democracy vs. autocracy or capitalism vs. socialism, for example, but in the process he never fails to fully flesh out the social, cultural, religious, and economic dimensions of his fictional worlds as well.Piper published two major science fiction series. The first is the Paratime series, which was briefly introduced in his 1948 story “He Walked Around the Horses,” but really gets into full swing with the novella Police Operation, published later that year. In this fictional universe, the Paratime Police patrol the multitude of alternate timelines that result from myriad deviations in historical events. Time Crime, Genesis, and Last Enemy are other fine entries in this series. Piper’s other series is his Terro-Human Future History, which chronicles the future of mankind from the present Atomic Age to over 300 centuries in the future. Piper mapped out a complex chronology of mankind’s interstellar diaspora, which he revealed in an essay, “The Future History,” published in the fanzine Zenith (not available in this Megapack, but you can find it for free online). The Future History stories are only loosely connected, so they can be enjoyed individually or as part of the grand whole. Among his best works are Omnilingual and Little Fuzzy, the latter being the first of a trilogy of Fuzzies novels that are a subset of the Future History timeline.The H. Beam Piper Megapack also includes two non-science fiction works by Piper: Murder in the Gunroom, a mystery novel; and Rebel Raider, a nonfiction biographical narrative of Confederate commander John Singleton Mosby; the latter of which is actually quite entertaining. By giving this collection a five-star rating, I don’t mean to imply that every selection is a masterpiece. In fact, Murder in the Gunroom, A Slave Is a Slave, Day of the Moron, and The Keeper are not very good, and some other selections are merely passable. Overall, however, if you are going to purchase a retrospective collection of a science fiction writer’s work, this is a great one to buy. Following the career trajectory of Piper’s visionary adventures is a wild and enjoyable ride.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I am Blind Man",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBVSJJIELTD52P67XFD32D4CEDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VMMX81CSJ6SQ?ASIN=B00BPZF234",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2013",
                "reviewTitle": "4.0 out of 5 stars A Quick Review.",
                "reviewText": "This is an updated review. When I first purchased this book I did a quick review based on the fact that I had read a number of H. Beam Piper stories before and I knew that they were in this collection and I wanted to let people know that the stories were good and that they should download the collection. Some people liked my review and some didn't.Since then I've gotten into the book and am enjoying it. The megapack layout is good and its table of contents is helpful. As I've been reading the book I've discovered that I had read a number of other stories than what I had initially recognized. I've never been great with titles and names. Amongst the other stories that I had read before was HE WALKED AROUND THE HORSES (a story based on historical fact with a parallel dimension twist) and THE MERCENARIES (which is a interesting look at a future world where scientific researchers maintain their independence from government interference by becoming a state unto themselves and what they have to do to remain independent). Both stories are interesting but different.As I stated in my initial review I was introduced to H. Beam Piper about a year ago when I downloaded the Third Science Fiction Megapack. That anthology included 'Little Fuzzy'. Personally I loved the story and I found it to be the best story in the whole collection. The story is well written, engaging and it kept me enthralled. I found that by the end of reading it I wanted to read more of H. Piper Beam and it motivated me to 'google' him on the web. It was with disappointment that I learned that he had died decades ago.Still 'Little Fuzzy' had captured my interest with the author and I decided I wanted more. At the time I hoped that a megapack collection of his work would come out and now, thankfully it did. I'm a little disappointed that this collection doesn't include the sequels to 'Little Fuzzy' (which are available but at full price) but I was pleased to see that it included a number of stories that I had seen good write up about.Another story in the collection that I have read is OOMPHEL IN THE SKY. This is a fun story about a future distant world where man has come into conflict with the natives and it demonstrates that thinking outside the box can be beneficial, if it is accompanied by understanding and respect. While not as long as 'Little Fuzzy' it is a very good read.Additionally, H. Beam Piper wrote a number of stories dealing with time travel or more correctly, as he called it `paratime' travel. This was his concept and he ran with it. So far I've read three stories in the collection based on `paratime' travel. It is an interesting concept which I will not get into here, but will say that the author develops the plot theme well. Here his writing does get a little wordy as he tries to explain things but it is still readable and more importantly enjoyable.I hope this review helps. The collection is inexpensive and the content enjoyable. Give it a try.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHA7V3STO2OWSIZ6NWYACJFPU62A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CN1ROL7LDB9H?ASIN=B00BPZF234",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars A Super Value",
                "reviewText": "The H. Beam Piper megapack 33 has so many good short and not so short stories with entertaining plots. It has great entertainment value, especially at its low price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay Harper",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 6, 2023",
                "reviewTitle": "Contains complete novels such as Uller Uprising, as well as short stories",
                "reviewText": "I already owned almost every story in this collection. I wanted an electronic copy as my old paperbacks are falling apart and are no longer in print. Great stories for a great price. You can't go wrong.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Komiker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 13, 2015",
                "reviewTitle": "Super",
                "reviewText": "Einfach klasse, so viele tolle Geschichten und Romane von einem so guten und nicht so bekannten Autor in diesem Paket lesen zu können.Wärmstens empfohlen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo Maragna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 21, 2014",
                "reviewTitle": "Nice example of classic science fiction",
                "reviewText": "Space age interstellar warships mixed in with dimensional time police and pipe smoking guys with slide rules at work during the cocktail hour. Add in a gun geek's catalogue of weaponry, and you see the 1950's dragged into the future. An enjoyable read and a megapack bargain.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rubinstein",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 4, 2014",
                "reviewTitle": "Vale il prezzo, e anche di più",
                "reviewText": "Un'altra bella raccolta monografica della serie \"Megapack\". Dopo Philip Dick e Robert Sheckley, anche l'assai meno conosciuto (almeno da noi in Italia) H. Beam Piper riceve il dovuto omaggio. La raccolta è molto completa e voluminosa (si superano abbondantemente le 1000 pagine). Quello che in realtà mi fa abbassare il giudizio sono... i contenuti. Probabilmente, la formazione hard-sf di Piper, e le sue fin troppo astruse teorie sui viaggi temporali, sono il motivo per cui non ha avuto il successo dei suoi più illustri colleghi nominati all'inizio. Alcuni racconti, in effetti, sono tutt'altro che divertenti, e si perdono in elucubrazioni scientifico-filosofiche che rallentano terribilmente la narrazione.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. G. Milner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 8, 2013",
                "reviewTitle": "It has its flaws but the price can't be faulted.",
                "reviewText": "The bad things about this book are:1. The story (novella, really) Little Fuzzy is a repeat from one of the SF Megapacks.2. There are a few serious formatting errors, in one case involving the repetition of a big chunk of a novella.3. 10% of the book is non-SF. I am still going to read that, to see how the author's style works, but it isn't part of the genre. Though to be fair, this is a megapack of the author rather than SF specifically.That said, you really can't go wrong for 59 pence. It's a huge long book with a great number of stories which explore the various future history concepts of the author. I just wish the stories dealing with the Terran Federation and Space Vikings had been presented in logical date order.Will you like it?Written between the late 40s and early 60s, it is quite old fashioned in terms of the technology. Computers barely get a look in. That is of its era.The social attitudes are moderately advanced for the time. \"Girls\" actually can do stuff in some of the stories, they aren't just for decoration. The general feeling is communitarian libertarian republican. Lots of guns and self-made men, who extol hard work and education and still care about their community.The stories whip along at a good pace and will not fail to excite and carry your interest.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}