{
    "remaining_requests": 1412,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Micro-Novel-Michael-Crichton-ebook/dp/B0053JJLLC",
    "body": {
        "name": "Micro: A Novel",
        "price": "$1.99",
        "originalPrice": "",
        "rawPrice": 1.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Micro-Novel-Michael-Crichton-ebook/dp/B0053JJLLC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71K6+Lxvn6L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michael Crichton",
            "link": "https://www.amazon.com/Michael-Crichton/e/B000APZK46/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 6490,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In the vein of Jurassic Park, this high-concept thriller follows a group of graduate students lured to Hawaii to work for a mysterious biotech company—only to find themselves cast out into the rain forest, with nothing but their scientific expertise and wits to protect them.In the lush forests of Oahu, groundbreaking technology has ushered in a revolutionary era of biological prospecting, feeding a search for priceless drugs and applications on a scale beyond anything previously imagined. In Cambridge, Massachusetts, seven graduate students at the forefront of their fields are recruited by a pioneering microbiology start-up, Nanigen MicroTechnologies, which dispatches the group to a mysterious lab in Hawaii. But once in the rainforest, the scientists are thrust into a hostile wilderness that reveals surprising dangers at every turn. Armed only with their knowledge of the natural world, they find themselves prey to a technology of radical and unbridled powerAn instant classic, Micro pits nature against technology in vintage Michael Crichton fashion. Completed by visionary science writer Richard Preston, this boundary-pushing thriller melds scientific fact with pulse-pounding fiction to create yet another masterpiece of sophisticated, cutting-edge entertainment.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0053JJLLC"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harper; Reprint edition (November 22, 2011)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 22, 2011"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1906 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 563 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0007350007"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,571 in Kindle Store (See Top 100 in Kindle Store) #1 in Read & Listen for $14.99 or Less #5 in Read & Listen for Less #6 in Technothrillers (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 6,490 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. Rock",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDER42DBQ2ZOSRUDXSI22CFIHOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35GVFY3TY9Y6X?ASIN=B0053JJLLC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars My fovorite of Crichton's novels",
                "reviewText": "My fovorite of Crichton's novels and probably his Scariest",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "benjamin bannister",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNRBTSF72OCUH3QDSVF5AJQIXFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R96DAPZU0CB10?ASIN=B0053JJLLC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2017",
                "reviewTitle": "4.0 out of 5 stars An Exciting New Adventure From The Mind Of Michael Crichton",
                "reviewText": "I went into 'Micro' knowing full well that Michael Crichton left a draft manuscript on his computer, and that it was Richard Preston who filled in the story. If you go in knowing that, you can set your expectations properly.— STORY —The story of Micro is high-concept: a Rated-R version of 'Honey, I Shrunk The Kids.' What would happen if you took that old movie, kept the adventure, but had very serious consequences? That's Micro. After a mysterious introduction to hook you in, Micro follows the story of seven scientists with various specialties relating to the fields of biology. They are recruited as potential job candidates by a big corporation when something happens, and they are stuck as shrunken people. Using their brains, they have to work together with their specialized knowledge to escape the harrowing real world of Mother Nature.The concept of shrunken people is a big stretch but go with it. This book explores that concept as realistically as possible, with Michael Crichton bringing some real world science to help sell it.— DRAFT —Knowing that this was still in draft mode, I'm sure Crichton still had a lot of research to do to explain and convince us of certain plot elements. Because of this, the story is not as fully detailed as a typical Crichton book. I think Richard Preston did his best to translate and get across what I can only assume were ideas that were still in development.The writing and dialogue seemed... simplistic. I think I'm not the only one with this opinion. It reads very high school. I'm not sure if this was because it was rushed, or because they wanted the writing at a level that would reach a larger audience. In any case, I'm just glad that we got one more Michael Crichton book.— SUMMARY —If you want a fun adventure story, Micro is for you. The book reads almost like a screenplay, and I could already imagine the soon-to-be-released DreamWorks film. Recommended.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "One More Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOK2ZMZVGINPP633QTKQU72IV4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FOUU1HBVX43B?ASIN=B0053JJLLC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2018",
                "reviewTitle": "3.0 out of 5 stars Good Enough...Not Great",
                "reviewText": "Knowing this novel wasn’t entirely authored by Crichton, may he Rest In Peace, made me skeptical going in, though I have enjoyed the bit of Preston I’ve read over the years. MC certainly had a knack for weaving complicated scientific subjects with fiction - just enough explanation without being boring or overwhelming to those unfamiliar. Here, the overall pace of the novel just felt off.Upfront, most of this review dwells on the negatives, however, I did read through until the end. It was -just- interesting enough to keep the page-turning happening.Spoilers to follow:-The Shrinking. For some reason, this took me by surprise, which in itself is a rarity - not enough coffee when I read the beginning is my guess. I almost put the book down, visions of the horrible ‘Honey, I Shrunk the Kids’ film crowding my head. I decided to continue for another 50 pages, and ended up reading through to the end, so...-There’s a few characters that provide so little to the book, it’s a wonder they didn’t get cut in editing, or at the very least combined with others to make for a smoother read, such as with the shrunken group. I never found that MC wrote hugely fleshed out characters, but here, calling most of them one-dimensional might be too kind. I found no attachment to anyone in the group whatsoever; not that I wanted them to be hurt or die, but when they succeeded at something, or lost someone, the feeling evoked was, ‘ok, next page’, as opposed to actively rooting for them, being relieved, upset, angry, happy, -emotional-!-A couple characters exist simply as expositional vehicles, rather than having such information be delivered via narration; after the third or fourth time this happened, all I could do was shake my head. It felt unnatural...people don’t often speak this way. One or two others were used only for their research specialty, period, which was convenient for convenience’s sake.Furthermore, their acceptance of what had happened, their adjustment to it, as well as many of the dangerous issues they encountered, the deaths of their fellow lab acquaintances, they all pretty much rolled with, even the whiny/pessimistic characters.-The setting itself, within the forest, was the best character for me, and despite how some of the information was related (unnatural character-speak), I really enjoyed the science and technological aspects! Though the book was over 500 pages (per my Kindle), it felt as though it needed to be longer, as so much page-time was action-oriented. I wanted to know more about the processes involved with the shrinking, the environment they were in, the robot and other tech created. It’s this that kept me turning the page, not the characters. The one exception was Rourke...he could’ve been a novella on his own. Instead, he was introduced very, very late, and (it seems) died soon after.-There were a number of times I wondered about the logical thought processes of the characters. For example, at the beginning, I felt Peter was really, really jumping the gun with the evidence he had...but the shrinking had to get started somehow, I suppose. Good thing for the plot that Drake quickly turned into a “mwah-ha-ha” villain! And then Danny, at the end...I don’t understand why they just let him stay like that in Rourke’s home, what with his arm, not even in the magnet room...but here again, the story had to start its conclusion somehow, no?In the end, Micro did provide some interesting action, and a couple of surprises within its pages. For sure, it brings a load of nightmare fuel, depending on your personal fears. The science, the tech, and the setting were all fantastic, and I wanted more. The characters were nearly translucent, the plot roller-coastered from believable to plausible to ridiculous several times, and the overall writing simply wasn’t as smooth as you’d expect from either Crichton or Preston. Worth a read if you buy it on sale or borrow it from a friend or library.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWCJ5DKDR75B474URF76IIS2QSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22W27MK8XST7S?ASIN=B0053JJLLC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Adventure in the micro world of nature",
                "reviewText": "Micro is a book that Michael Crichton started and Richard Preston finished. A group of graduate students are invited to visit Hawaii to consider working for a robotics company doing drug research. But the evil CEO abandons them in the Hawaiian rain forest with little chance of survival. Their wits and knowledge of the natural world are tested as they fight to survive. Continuous action and good character development make for an interesting read, although the premise is a little far fetched.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CBinMV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ5EZRW6BB3LRF6YUXQNFZWHQQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RDSYRDTXBUPZ?ASIN=B0053JJLLC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2023",
                "reviewTitle": "4.0 out of 5 stars A little far fetched, but a good read.",
                "reviewText": "A little far fetched, but a good read. It's amazing how many different theories are associated with electricity and magnets. The CERN collider for example, The book was a very good read, even though I thought it was a little far fetched, but who knows maybe some labratory somewhere or cadenstine goverment project is performing these experiments. The story made me think on an old MAD magazine spoof of the movie Fantastic Voyage. The lab where the project was based was callled L.S.M.F.T, which stood for Labratory Section for making Folks Tiny. LSMFT was the slogan for the cigarettes, Lucky Strike. In closing. I really enjoyed reading the book and would recommend it for folks with an interest in science.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "davidj",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTMYHRLSLGZRZVYZMDJXEATGOLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPV83AGRT9KUW?ASIN=B0053JJLLC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Deal!!!",
                "reviewText": "Book was 100% as advertised. New and arrived in New condition, before the estamated delivery date.First Edition Hardcover for 1/2 the price of paperback!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7QF76IWX6HADSCW5C5M2EZMSVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RXRZNAZAUA6X?ASIN=B0053JJLLC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2023",
                "reviewTitle": "5.0 out of 5 stars Riveting plot",
                "reviewText": "I enjoyed this book from start to finish. I always find the most interesting books have a plausible storyline. With current advancements in electronics, and science in general it's feasible that human greed could make this fiction a reality.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Centre dentaire faust inc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 28, 2022",
                "reviewTitle": "captivant",
                "reviewText": "Le livre prend véritablement son envol au milieu du récit et malgré des raccourcis utiles finit véritablement à nous captiver jusqu’à la fin .Pas le meilleur de Crichton mais certainement un très bon livre à lire si on aime la science fiction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ivan Rolf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 29, 2021",
                "reviewTitle": "éeee.... fraco mas serve para o propósito",
                "reviewText": "Definitivamente não é um Crichton. Depois de ter revisitado os livros do Jurassic Park, quis continuar na esteira do Crichton e esse não tinha lido. Realmente, o Richard Preston partiu de uma ideia inacabada e montou uma estrutura em volta dela. Embora muito mais implausível do que os outros romances do Crichton, o que faz mais diferença é a grosseria das cenas, muitas vezes extrapolando na violência e acaba distraindo da trama e jogando na cara que você não está lendo o Crichton.Serve como um passatempo, mas não tem nem um décimo do charme do nosso querido autor.Na verdade, se a propaganda desse livro fosse honesta, deveria ser um livro do Richard Preston, baseada num esboço de Michael Crichton, e não colocar o nome desse último como autor.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 6, 2018",
                "reviewTitle": "Romanzo di avventura molto piacevole",
                "reviewText": "una volta iniziato a leggere non ci si può più staccare dal libro. le descrizioni minuziose fanno sì che ci si immerga completamente nell'ambientazione! Lo consiglio vivamente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 23, 2019",
                "reviewTitle": "A Good Use of Resources for the Micro Folk",
                "reviewText": "I really enjoyed the storyline and how the story evolved. Even though it is a fictional tale it came across as being feasible. An enthralling tale typical of Michael Crichton. A great story well worth purchasing and reading. Would love to see this as a film",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 11, 2016",
                "reviewTitle": "Una maravilla de libro",
                "reviewText": "Me llegó enseguida y está perfecto.No me gusta casi nada leer y este libro lo compré casi por obligación de la escuela de idiomas, y ha sido ESTUPENDO!!! Un libro MUY recomendable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}