{
    "remaining_requests": 1631,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Homebound-Lydia-Hope-ebook/dp/B083JLYGSQ",
    "body": {
        "name": "Homebound: A Sci-Fi Romance Novel (Rix Universe Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Homebound-Lydia-Hope-ebook/dp/B083JLYGSQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/918u2C0ZHVL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lydia Hope",
            "link": "https://www.amazon.com/Lydia-Hope/e/B0847HPNS3/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2092,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B083JLYGSQ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (January 5, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 5, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2954 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 539 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B084DGQG1X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,015 in Kindle Store (See Top 100 in Kindle Store) #203 in Dystopian Science Fiction (Kindle Store) #282 in Dystopian Fiction (Books) #358 in Science Fiction Romance (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,092 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "decster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMG2FDROFN5BW4Z6BRXGPS4XFRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVHHIDTDUAOFT?ASIN=B083JLYGSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Surprising and very well developed",
                "reviewText": "I didn’t “jump” to read this book, by an author I’d never read before, but it was absolutely riveting. The main characters were very well developed. The storyline started slow and grew as the tale unfolded, racing at the end like a huge wave or a crescendo of epic proportions.I have questions about some of the secondary characters, and I really hope the kitten will be okay.I hope there will be more books, even ancillary editions.I’m off to find more books by this author",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lola E",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHL6YNUYH3SFI2ZJ6Z4UQ7UJOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR9ONHI762TA?ASIN=B083JLYGSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars 5 STARSS",
                "reviewText": "Girll I need a second book!!! I recently been getting into alien books and most of them the plot is sex but in the book you can see the buildup and how they get to that point, you fell their emotional connection, the trust….I LOVED ITTTT",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Himantra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKYB2DVV4YB3FM4XBQU42O625FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R190X6ZIBNTD7C?ASIN=B083JLYGSQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 18, 2020",
                "reviewTitle": "4.0 out of 5 stars I enjoyed it a lot despite some huge flaws",
                "reviewText": "This was a very hard book to rate. Truthfully, it probably deserves 3 stars, but I enjoyed the romance between the main character, Gemma, and the alien hero, Simon, so much I bumped it up a star.The TL;DR, spoiler free review is that if you enjoy alien romances between a human female, and a male alien who clearly is culturally different, and have enough word count to really show the growth of affection between the two instead of insta-love/lust, then you'll enjoy this. And if this is the most important thing you're looking for, you can hopefully overlook the vague world building and the horrendous grammar, word choice, and syntax mistakes.However, (and now we get into spoiler territory) the reason this book probably deserves 3 stars is because those flaws are really hard to overlook.The grammar, syntax, and word choice errors are astounding and confusing. And should have been caught by a good editor. For example, there are a few times \"can\" is used instead of \"could\". A few times the author inexplicably jumps into present tense. The author uses words incorrectly. For example, Gemma and many others are called migrants, but they're not. They're refugees. Their homes have been destroyed and they fled to the city (country?) where they now live. Also, once, the author uses the slang term \"peeps\" and it was for the word \"people\". It was such a strange, out of nowhere term to use, not even used in dialogue, and was never used again. The author uses \"weeny\" instead of \"teeny\". These errors really threw me out of the story and I had to reread sentences.Gemma, as a heroine, came off laughably naive at points. She has a horrible life and yet she hasn't become bitter, overwhelmingly depressed, etc. She reminded me of a fairytale heroine, like Snow White or Cinderella, where their main character traits was being doormats but yet still compassionate and kind to everyone. She even sings when she cleans. The way she reacts to the OO sexually assaulting her was mind boggling. The man suddenly outright gripes her breast and she freezes not because of fear or anger but she was curious to see how far he'd go?! What?? As for looks, the thing I know best is that she's extremely thin and yet has huge breasts. The amount of times her huge breasts are mentioned by men or herself was laughable. Also, she was thin from starvation, but her breasts don't shrink? That's not how that works. She also agrees to go with Simon to his home planet with no questions! She doesn't ask about his planet's laws. Would she even be considered autonomous? Does Simon even have a mate and kids back on his planet? Do they practice monogamy or harems or polyamory? We don't know and neither does Gemma. I ask more questions ordering off an Ala Carte menu than Gemma did about her potential new life!Which leads me to the other major flaw. The vague world building. It's strange because on one hand, the author is very good at making prison life come alive, as well as the desperation in Gemma's world. This is obviously an Earth in decline, just after some horrible catastrophe and probably before another one. But what are the rules and parameters of this world? We never know. Where is Gemma exactly, besides Earth? Is she in the US? Is there a US? Is there a government? There's some authority body because people are given prison terms, but we never know by whom. At one point, there's a violent riot in the streets between aliens and humans. The next day, the alien offenders are in jail with prison sentences! That's an insane turn around! Did they even get a trial?Are the aliens citizens? How long has it been since first contact? People seem used to some aliens but not others. Why? If some species of aliens are causing so much unrest by assaulting people on the streets, why are they allowed to come onto the planet at all? None of these questions are answered and there's no way to glean the answer from the book.The highlight of the book, and what enraptured me, was when Gemma and Simon interact. Simon proved an interesting hero. He's an alien, and he IS alien. His culture, morals, and sensibilities are vastly different from humans, so it was great to see him slowly warm to Gemma and finally fall in love with her. Their relationship was really what kept me going, because it's really rare to get a well developed, \"slow burn\" alien romance. For that alone, I recommend this book.I wish we could have gotten more; where we see Gemma arrive at the Rix planet, and her adjustments to her new life, and see her relationship with Simon developed in the new environment. Maybe someday there'll be a sequel.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Etzweiler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZFB7BC3VLMUNVBF2DZKLAK7DMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHOBCE4JXY5G9?ASIN=B083JLYGSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Beautifully riveting",
                "reviewText": "I love my aliens and their cultures as divergent as feasible from humans, and this author delivers with gratifying intensity. The slow burn is equally satisfying.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cattledogtheory",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHB732UJVP66AFYZCOH2TCSYN3RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QRLVWTJDA5Y5?ASIN=B083JLYGSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars extremely good. terrific writing.",
                "reviewText": "I enjoyed this so much. Great writing. The author is a gem. I can’t wait to read the next book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie Reads & Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDMAVXKRPPL5CVMGPZM6WOMZMQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VYL8NQRZTNE3?ASIN=B083JLYGSQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2023",
                "reviewTitle": "5.0 out of 5 stars My first venture into aliens and I loved it",
                "reviewText": "I have technically read other alien books but the aliens in those as the love interest were human looking. I never thought I would enjoy a book that had the MMC not looking human. But Lydia Hope creates Simon and I loved him. I couldn't imagine as I started the book, when he was initially described, ever feeling like I could get into this book. I almost quit but the story and Gemma were compelling enough for me to try and I'm so glad I did. I struggled with the toothless MMC but luckily that was made right later haha. This was such a fun ride. Aliens, danger, risks, adventure...An FMC who was the perfect mix of strength and vulnerability. I had so much fun reading this and am glad I saw this recommended.Random side note...how are we going to talk about Gemma's eyes being Grey but the cover shows a woman with brown eyes?",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3L2BAUNCDSRBNQJXEXZGHWFEJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PMV11UUZ82FC?ASIN=B083JLYGSQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Great series",
                "reviewText": "This is a review of the audible version. I liked the narrator and her many interpretations of the books characters. Liked the story and the characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "7Susanna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEIKOF6X2AGOP4A4TJGFTDVKEIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TW2FTU5OX4UL?ASIN=B083JLYGSQ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2021",
                "reviewTitle": "3.0 out of 5 stars I WANTED to give 5 stars but... ☆☆☆, not ☆☆☆☆☆",
                "reviewText": "Great concept - totally unexpected! Wonderful story telling, good pacing and really builds to a great conclusion.But. Yeah, a big \"but\". It's obvious that the book was not proofread. It's also obvious that spell check was used. But spell check doesn't catch homophones (words that sound alike but have different spellings and meanings) like using \"taught\" when it's obvious it's \"taut\". Then there were writing errors where the sentence would be about the female character but in a compound sentence, the pronoun \"her\" mysteriously shifts to \"him\". Arrrrgh! These sorts of mistakes make me crazy. They're extremely distracting and interrupt the flow of my reading. Not to mention I have to stop and figure out what the author really meant.I normally overlook a few simple errors but I took two stars off for bad or no proofing. It's too bad because this is an otherwise GREAT STORY! I'm bored with alien romances but this is in a category of its own.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Carrier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 16, 2023",
                "reviewTitle": "I am confused... it ended abruptly!",
                "reviewText": "Don’t get me wrong, the plot deserves all 5 stars but, after reading so many pages with detailed descriptions, I can’t seem to understand why the end is brought without any preamble, so few interaction between the protagonists. I mean, there is not even the words “The End” written nor is there any afterword from the author! Could it be that it’s incomplete? Will read the next plot of the same world, I hope to find answers there.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lenore",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 26, 2022",
                "reviewTitle": "homebound",
                "reviewText": "Let me preface this review by saying at one point I got so excited reading this book I accidentally punched the wall beside me and gained a decent bruise. It was beyond worth it.I’m completely awed by Lydia Hope’s ability to create complex and truly *alien* characters, which goes far beyond what I ever expected. Gemma and Simon’s interactions were alternating enchanting, surreal, heartwarming, and even at times mildly disturbing. How well the Rix species was portrayed as not only physically different but also emotionally and morally different from humans was endlessly fascinating and you can tell a lot of thought went into everything involved.Truly my only complaint is wishing for some sort of epilogue. I wanted so badly to see how the characters end up after the events of the story. Though is it really a complaint if I’m just wishing for MORE?Now I’ll just eagerly dream of what adventures, species, and characters the author will gift us with next 💕",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luma_yumin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 24, 2022",
                "reviewTitle": "Perfeito!",
                "reviewText": "Me prendeu desde o começo até o fim.perfeito.uma pena a escritora não ter mais livros do que os dois,eu adoraria ler,já sou fã.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "caroline",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 10, 2024",
                "reviewTitle": "Loved it.",
                "reviewText": "Only my second dip into anotherworldly romance book and homebound did not dissapoint. This sweet story was glued to my hands. I felt so invested in the characters and the ending was chefs kiss. Ticked all the boxes. Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 22, 2023",
                "reviewTitle": "Pourquoi ce livre n'est-il pas plus connu ?!",
                "reviewText": "Je ne lis pas de science-fiction habituellement. Uniquement de la fantasy médiévale. Mais je suis tellement heureuse d'avoir donné sa chance à cette pépite ! Un trésor méconnu, tout comme les personnages qui y prennent vie. Ce livre m'a tenue éveillée tard dans la nuit et m'a appelée aux petites heures du jour tellement j'avais hâte de connaître la suite.Pas de chichis, l'histoire n'est pas forcée mais s'écoule naturellement, les personnages sont attachants, même les plus insignifiants sont intéressants.Gemma et Simon sont un couple tellement fort.Gemma est fragile, désespérée, pas taillée pour survivre sur cette Terre à l'agonie. Simon n'est plus qu'une coguille vide, avec la mort pour seul horizon, lorsqu'ils se rencontrent. Mais peu à peu ils vont reprendre vie l'un et l'autre, nous tenant en haleine jusqu'à la dernière page.J'ai hâte de decouvrir le prochain tome, une autre histoire, mais je fais confiance à l'auteure.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}