{
    "remaining_requests": 1463,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Guide-Writing-Fantasy-Science-Fiction/dp/1440501459",
    "body": {
        "name": "The Guide to Writing Fantasy and Science Fiction: 6 Steps to Writing and Publishing Your Bestseller!",
        "price": "$15.99$15.99",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Guide-Writing-Fantasy-Science-Fiction/dp/1440501459",
        "soldBy": {
            "sellerID": "A1YMX44V84N7KV",
            "name": "McGhee Family Bookstore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1YMX44V84N7KV&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81yimqA5nyL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Philip Athans",
            "link": "https://www.amazon.com/Philip-Athans/e/B004MLU4EK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "McGhee Family Bookstore",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 227,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 12 hrs 41 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 11 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Adams Media (July 18, 2010)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1440501459"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1440501456"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.6 x 8.44 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#297,004 in Books (See Top 100 in Books) #49 in Science Fiction & Fantasy Writing #332 in Words, Language & Grammar Reference"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 227 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Athena ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ7QVT7NIEKZWZZBVG4I7HV4HGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R128NUDN59A7Y4?ASIN=1440501459",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2022",
                "reviewTitle": "5.0 out of 5 stars Starting Point, Basic Overview",
                "reviewText": "I ordered this used in good condition and it did arrive quickly and with small cover defects. There were no notes inside.I ordered this alongside a few other creative writing fantasy books because I've had multiple creative writing courses and none allowed fantasy. So with that said, this is more of a literal beginning point. It overviews the basics of fantasy, and it doesnt include any writing technique or heavy story building guides. There are no prompts. This is what you read before you even begin your work, and if you have not had any courses, and if you are brand new to fantasy. If you feel you are overwhelmed, I think this would be helpful to recenter yourself.I read this alongside Putting the Fact in Fantasy, and I believe that book would follow this one pretty nicely. This being a beginning, and Fact in Fantasy being a more inspiring read for when you're ready to create your fantasy world and characters, but needed a lil direction.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JP Georgia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH27TB6DY2BEEGFCHQU5FBORAUJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH92Q6FMIRA4N?ASIN=1440501459",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2020",
                "reviewTitle": "5.0 out of 5 stars Nice book warded me to my senses",
                "reviewText": "I thoroughly enjoyed the book. I had started an outline for a short story I intended to submit to Asimov's. After chapter 29, I began to reconsider my enthusiasm for my story. After chapter 32, I said, \"To Hell with the idea. I'm 70-years old, and I don't want to die in pain.\" It's a decrepit publishing world. I don't want a potentially sleazy agent, and I don't want to go to conventions. I'll write just to pass the time. Nobody will miss me, so what?",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "treeoflife",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEJB5J5M6X2WPK2DJBOPFTXTPDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QQSZ4B618D3S?ASIN=1440501459",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 9, 2011",
                "reviewTitle": "4.0 out of 5 stars Solid, a good read, but would've liked more detail",
                "reviewText": "Overall a decent read... I ate it up in a couple of days. There are certainly some solid pieces of advise on a variety of things, and the author has a good sense of humour (I guess you'd have to trying to make a living in this genre).It does in my opinion weigh a bit more to the Fantasy side of things, than the Sci-fi side, but that didn't bother me personally.What I didn't like is that it's fairly vague on some major issues. The section on publishing was very high-level, what one would expect in a \"Publishing for Dummies\" book. The guy is (was) an insider, so I wanted a few more juicy tidbits and secrets. He only hinted at some brutal realities in the industry, so I wonder if the editor held him back there. Regardless, I started reading his blog, which is a bit more bold and answers more questions.A solid 4 stars.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel A Dworkin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPG46KE7U7W2G2HQ55PL6RRPHOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15RE8XQC8HW7J?ASIN=1440501459",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 27, 2018",
                "reviewTitle": "5.0 out of 5 stars Must have for aspiring fantasy / sci fi writers",
                "reviewText": "This is the best comprehensive guide to writing sci fi and fantasy I've seen out there. What makes it so good is that the explanations and hints aren't full of fluff, and they give great examples and comparisons, allowing the guide to be condensed to a manageable size. It is easy to reference the sections you want. It covers everything from plot, characters, world-building, to publishing. Really, it covers it all. I was so impressed I bought a copy for a friend of mine in a workshop I attend. If only it did spell check and grammar checks on my writing I'd be set.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terrance H. Heath",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK44PSBNXEARP5OBHORPPMD6Y7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R82QZZ2NCER2H?ASIN=1440501459",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2011",
                "reviewTitle": "3.0 out of 5 stars The Sample Was Great, But....",
                "reviewText": "I'm not sure about the rest of the book, and not sure when/if I'll read the rest of it. I downloaded the sample onto my Kindle a few weeks ago. I finally got around to reading it, and thoroughly enjoyed it. The introduction by R.S. Salvatore and the first chapter by Athans convinced me that the rest of the book would definitely be worth a read. It sounds like just what I need to help me with a story I've begun sketching out and plan to start writing soon.So, after reading the sample, I tried to buy the book on my Kindle only to get a message that the book was not available. I looked at the website, and it was indeed not available on Kindle. Not available anymore, anyway. It was when I downloaded the sample. I guess between now and then the publisher decided to yank it. (Just from Kindle, though, since I've found it on other sites, in formats I can't read on the Kindle but can read on other devices.)I've ordered the hard copy version, which is \"shipping soon,\" and I may be reading it by the end of the week. In the meantime, I'm already reading another similar book that is available on Kindle now.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WyoGal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH63YMQRTZ7YNV6Z7PYZEZ4YQ5SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26E49EJSCA08F?ASIN=1440501459",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2015",
                "reviewTitle": "5.0 out of 5 stars This book challenges writers to sharpen their tools",
                "reviewText": "With humor, blunt advice, warnings, and fantastic examples, the author shares insights into the craft of creating a story and how to best work with agents and editors, specifically in the science fiction/fantasy genre. The suggestions for improving characters and creating consistent and plausible worlds are helpful and motivating. I am inspired to continue working on my story. I've learned more about how to keep on writing even when I feel stuck, how to liven things up, how to evaluate my progress, and how to direct my efforts when revising. The guide reads like a personal conversation with an expert. Grab a drink, get ready to take notes, and make like a sponge to soak up wisdom from a collection of well-respected professionals.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Z. Gorman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESABJQFDX6HP5QZ5LEUNP4UUJFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SYVM2I2LIRUQ?ASIN=1440501459",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2010",
                "reviewTitle": "5.0 out of 5 stars Comprehensive and easy to consume",
                "reviewText": "I read a couple books about how to write novels and was really dying for a book that has specific advice about writing fantasy and science fiction novels. I found this one and I must say that I was not disappointed. I bought a Kindle version and read it over the span of a week. This is indeed a comprehensive guide to writing fantasies and sci-fi. It dives deep into the genre and talks about just anything you may think of that matters. It certainly has answered all of my basic questions. The book may not provide all the concrete instructions on how to do this or that but it definitely tells you what to pay attention to. The author has an easy-going, honest and personable tone throughout, making the book easy to consume.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael C. Haensel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESV3U7ITMZXZY4IRAH3ACNAWIRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT7Y9YDTYMK8T?ASIN=1440501459",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2015",
                "reviewTitle": "4.0 out of 5 stars A thoroughly worthwhile overview, will save a lot of time figuring out what questions to ask",
                "reviewText": "Much of the challenge of doing something new is figuring out what you don't know. Athans explains what kinds of questions you need to answer for your book in all stages, from developing the first idea to submitting for publication. This book is about the big picture, not details. That said, it's a very worthwhile resource. Because of this book, you'll know which direction to go and what questions to ask, and that is well worth the asking price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 22, 2023",
                "reviewTitle": "The Simplest Structure",
                "reviewText": "Not all non-fiction books can achieve what this book has in terms of structure. I used to write stories many years ago and this book reminds me of myself in those days within the capacity of being a writer. As a direct result of finding this book I have taken up writing again and I don't feel I'd encounter writers block. I thoroughly recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 12, 2021",
                "reviewTitle": "très utile",
                "reviewText": "correspond à mes attentes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 27, 2015",
                "reviewTitle": "I really enjoyed this book because unlike Orson Scott Card's book",
                "reviewText": "I really enjoyed this book because unlike Orson Scott Card's book, it leans more towards fantasy development than science fiction, and goes more in depth.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 4, 2017",
                "reviewTitle": "A worthwhile read",
                "reviewText": "Athans has published a well-written, informative book. It was a relatively quick read, and went into several aspects including character, world building and plot.My only gripe would perhaps be that because so many areas were covered, there was relatively little depth in any of them. The book was not too long that elaboration would be too much. Nevertheless I enjoyed it, and many queries I had were answered (and, at £0.99, it's a bargain!)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 22, 2013",
                "reviewTitle": "Better than others on writing advice for SF&F",
                "reviewText": "The other, I would say 'authoritative' guideline is Orson Scott Card's; however, Card's is advice on somewhat classic SF&F. This book has a much more contemporary approach and is more applicable to today's readers and multitudes of SF&F sub-genres.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$11.04",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            }
        ]
    }
}