{
    "remaining_requests": 1489,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Lost-World-Michael-Crichton-audiobook/dp/B0011FSS66",
    "body": {
        "name": "The Lost World",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Lost-World-Michael-Crichton-audiobook/dp/B0011FSS66",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51738W0J8yL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michael Crichton",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Michael+Crichton"
        },
        "brand": "Michael Crichton",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 13523,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "It is now six years since the secret disaster at Jurassic Park, six years since the extraordinary dream of science and imagination came to a crashing end - the dinosaurs destroyed, the park dismantled, the island indefinitely closed to the public. But there are rumors that something has survived. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 18 minutes"
            },
            {
                "name": "Author",
                "value": "Michael Crichton"
            },
            {
                "name": "Narrator",
                "value": "Scott Brick"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 17, 2007"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0011FSS66"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,533 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #160 in Science Fiction (Audible Books & Originals) #175 in Suspense (Audible Books & Originals) #304 in Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BigCat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3FAMEKLPPLNTUMTRBPAVBPIFJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G90797EEGV2R?ASIN=B0011FSS66",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars superb!",
                "reviewText": "\"Jurassic Park: The Lost World\" by Michael Crichton is a thrilling sequel that lives up to its predecessor's legacy. Crichton masterfully continues the story of a world where dinosaurs roam again, weaving a narrative that is both intellectually stimulating and heart-poundingly exciting. His detailed research and rich storytelling make the book not just a journey back in time but also a thought-provoking exploration of scientific ethics and the unpredictability of nature. The characters are well-developed, and the plot twists keep you on the edge of your seat. This book is a must-read for anyone who loves science fiction combined with adventure.AI disclosure: I asked ChatGPT to write this review for me since I was on vacation and did not want to think too much. That said I agree with every word.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stewart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4T2GTX66PUPWQYWJNUHJCFJAEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VB1TSME0FHW0?ASIN=B0011FSS66",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Book",
                "reviewText": "It is vastly different from the movie. It's interesting to know where Michael Crichton wanted the stories to go.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7CUNMAM4M5A6CJOFICF62YE6OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R0YZG3WO5KKS?ASIN=B0011FSS66",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2020",
                "reviewTitle": "4.0 out of 5 stars Dinosaurs, prions, and thieving geneticists",
                "reviewText": "I first read this book around 1996. I reread this in 2020, and my memory of the book had long been overridden by the Lost World movie, which has a little in common with this book. I also read Arthur Conan Doyle’s Lost World (from 1912) right before rereading this book, and Lost World Jurassic Park is thankfully much less racist than that one.This sequel to Jurassic Park was not as exciting or as fun as the original Jurassic Park, but it was still good. The plot focuses on several scientists/teachers/professors: Thorne, a wealthy retired professor who now builds highly complex RVs, Richard Levine, a paleontologist, Sarah Harding, a carnivorous animal behavior specialist of some sort, and Ian Malcolm, who we all thought was killed off in the original Jurassic Park (or at least that is what JP book says), but has somehow recovered and is now back to being a mathematics professor. The book also has two children tag along, perhaps as an effort to convince parents that the future movie version of Lost World was family friendly and meant for kids, Arby and Kelly. Past me might have said the kids are annoying and shouldn’t be included, but I actually found that the kids were fine and once again ended up being the much needed computer experts. I especially liked Arby, who has a complicated childhood as an only child with professional yet mostly absentee parents. (Your mileage may vary – the movie version of kids I think was rolled into one child who may or may not have been a little annoying. The kids in the book were fine with me.)The plot focuses on Thorne, Malcolm, and Eddie Carr, an engineer, (and the kids, hiding in the RV) traveling to Isla Sorna (Site B) to rescue Dr. Levine. Sarah Harding shows up a few hours later, to join in the rescue attempt, by hitching a ride with geneticist Lewis Dodgson (the guy who was trying to steal the Dino embryos in the first Jurassic Park book). Dodgson, along with two other colleagues, is still trying to get his own dinos by stealing eggs.Site B was the breeding laboratory for dinosaurs that were then transferred to Jurassic Park, and like most things involving genetics, there was a lot of trial and error before getting things right. This site was abandoned after the whole InGen was shut down after the every of Jurassic Park, and many dinosaurs got out and are now living and breeding on the island (this is background, not part of the actual book plot, although I would read that book).The plot mostly focuses on a.) finding Dr. Levine, b.) studying the behavior of dinosaurs in the “wild”, c.) understanding what is causing the dinos to act more erratic than usual , d.) surviving, and e.) not being killed off by “the bad guys”. The bad guys were never really a threat to anyone except Sarah Harding on the boat, and unlike the movie, there wasn’t a whole troop of guys with guns trying to kill the dinosaurs, mostly just Dodgson, who was trying to steal eggs.Since I’ve just read A.C. Doyle’s Lost World, I would like to mention that Crichton’s Lost World has many more dinosaurs, fewer highly problematic “ape-men” (none), and was a whole lot less racist. I thought Isla Sorna having sheer cliffs making an entrance or exit to the island hazardous was similar to Doyle’s Lost World plateau, but there were not that many similarities between the two. The only small criticism for this book is that the ending seemed anti-climatic to me. There are no big discoveries (other than prion disease, which I had no idea what I prion was when I was 15-16 years old reading this book, but I do now), no big resolutions. This book did not seem that suspenseful, and I was never that worried for most of the protagonists, but that might be because I’ve already read this book and seen the movie.All the familiar dinosaurs from Jurassic Park are back – T-rexes, hadrosaurs, velociraptors, triceratops, as well as a pair of camouflaging predators that can match their backgrounds like chameleons or octopi. Is this a feature of the Indominous Rex in Jurassic World? I’m not sure.Lost World Jurassic Park was fun, escapism fiction for me, and I’m glad I reread it. I struggle with some of Crichton’s later works, when scientists somehow are always the “bad guys”, climate-change denial runs rampant (State of Fear), evil scientists are working on human-chimp hybrids (Next), and I don’t even remember what scientists did wrong in Micro, only that almost all of them were killed off in horrific ways. Those books turned me off to Crichton’s work in general. But, after rereading this one, I think I might continue my reread of Michael Crichton. The two Jurassic Park novels may well be the first science fiction books I ever read, and I have a special place in my heart for these two books.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "legend",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEO7MJOA3TOCRNWETQ5KL7SUVJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R334HD7OHMFHYE?ASIN=B0011FSS66",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic book",
                "reviewText": "I love the book versions of Jurassic Park! Very suspenseful and informative. I can see how the movie versions were altered from bits of the books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ken Fontenot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCMQ3QI7EO36INOBY7WU5S22UUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX8K22SBMEP89?ASIN=B0011FSS66",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 7, 2007",
                "reviewTitle": "5.0 out of 5 stars As Usual.....",
                "reviewText": "\"The Lost World\" was much better on paper than it was on film. The film took a great deal of liberties with the story, going as far as adding entirely new characters and plotlines as well as borrowing from \"Jurassic Park\" to move the story along. This review, however, is of Michael Crichton's wonderful book and not the film loosely based on it.I'm one of those people who usually sees a film before I read the book it is based on. With the \"Jurassic Park\" flicks, I really enjoyed the first one and hated the second one. With this in mind I was hesitant to pick up either of Crichton's dino books. After reading \"Jurassic Park\" though, I found that not only was the story different, it was much better. That made me wonder if \"The Lost World\" would do the same. As expected, \"The Lost World\" did not let me down. It was almost entirely different from the film. The primary plot of this story is that one Richard Levine is curious to find out if a \"lost world\" actually exists. He has been researching odd animal findings in and around Costa Rica and believes that somehow a few dinosaurs actually survived extinction. Not knowing about John Hammond's business venture in building a dinosaur park where dinos actually exist, he picks the brain of Dr. Ian Malcolm in hopes to convince him to help him seek out this \"lost world.\" Of course, Malcolm is the wonderfully cynical mathematician from \"Jurassic Park.\" He was thought to be dead but through the wonders of the written word, Crichton revives him. As Levine presses Malcolm for help, he eventually decides to go it alone and ends up trapped on Isla Sorna, also known as Site B. At this point the story drops (for the most part) all arguments over evolution and extinction and becomes a rescue mission. Malcolm, along with the likeable Dr. Thorne, the headstrong Dr. Harding, field technician Eddie Carr and two very intelligent stowaways, sets out to save Levine's life and hopefully protect the secrets of Site B.Of course, no Crichton novel is worth a dime without a decent villain. In this case, we revisit BioSyn's Lewis Dodgson, the catalyst for most of the chaos in the first book. He, along with two counterparts, sets out to collect a few eggs from Site B for his own gain. Dodgson is sinister, calculating and very sure of himself. I'll let you find out for yourself just how much of a problem he becomes in the \"lost world.\"As in \"Jurassic Park,\" Crichton often goes off on long scientific tangents explaining the habits of lions and jackals in Africa. He also gives drawn out explanations on why or why not the dinosaurs were wiped out by asteroids. But just like in his first dino book, Crichton pours out this information in a way that, to me, doesn't bring the action to a screeching halt. I enjoy reading these little tidbits of scientific information, but I can see where others might find them to be a bit too much info to take in while your being attacked by velociraptors.Many reviewers find this book to be subpar. I think a lot of that has to do with the fact that it is a sequel. Sure, Malcolm shouldn't be back in action, but he's such a fun character that I'm willing to let Crichton slide here. I'll also concede that doctors Harding and Thorne closely resemble Grant and Sattler from the first book. I'll also admit that the two kids are nothing more than a rehash of Hammond's grandchildren. However, Crichton puts a very good spin on an old tale with \"The Lost World.\" In my opinion it moves at a much faster pace than its predecessor. Although the characters aren't very well developed, we are given enough information to care about or hate most of them. Also, there are quite a few differences between the actions and even the biological makeup of many of the dinos in this book and \"Jurassic Park,\" but these differences do help to move the book along.\"The Lost World\" isn't a perfect book. It revisits old territory but still manages to give the reader a lesson or two about extinction and chaos theory. I give it five stars because it works wonderfully as an action yarn and it's nice to catch up with one of my favorite characters, Ian Malcolm.Highly recommended.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 20, 2023",
                "reviewTitle": "Ideal",
                "reviewText": "El libro me llegó al siguiente día y hasta donde voy está super interesante, no daré spoilers pero es sorprendente desde el capítulo uno",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vitor Pezzuti dos Santos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 1, 2021",
                "reviewTitle": "Excelente",
                "reviewText": "O produto veio muito bem embalado, plastificado e conservado. Nenhuma reclamação de minha parte!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle-klant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on October 28, 2023",
                "reviewTitle": "Whatever you have seen in the movie....",
                "reviewText": "It is not at all as in the book. The book is waaaay better! i plowed trough it in a single day, absolutely loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sandeep k.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 1, 2023",
                "reviewTitle": "It's awesome",
                "reviewText": "It's very different from the movie but it's wonderful and amazing experience",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 21, 2022",
                "reviewTitle": "A delight, 5 stars!",
                "reviewText": "Having enjoyed Jurassic Park I was eager to dive into this one and wow, this was equally as thrilling as book one.This author is an absolute master of raising your anxiety and creating tension you feel you can touch.This book is fantastic in so many ways. It gets right under your skin and it's frightening but equally it's making you think about science, the planet, our existence.Ian Malcolm goes down as an unforgettable character for me. What a legend.And while there was traces of it in book one, this book has amazing females characters. I've many complaints regarding male authors and their female characters but credit where its due, Crichton nails it. There's no damsels in distress here. I hope teen girls are picking this book up and being inspired by the confident inspirational females in this book.This duology was a delight. I've no idea why I waited so long to read it.Five stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}