{
    "remaining_requests": 1664,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/City-Ember-First-Book/dp/0375822747",
    "body": {
        "name": "The City of Ember (The City of Ember Book 1)",
        "price": "$8.99$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/City-Ember-First-Book/dp/0375822747",
        "soldBy": {
            "sellerID": "A1OVE6SOYPPH9T",
            "name": "RNA TRADE LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1OVE6SOYPPH9T&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71fmLhEPDRL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jeanne DuPrau",
            "link": "https://www.amazon.com/Jeanne-DuPrau/e/B001H6S166/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "RNA TRADE LLC",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 8256,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 18 mins",
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b?ie=UTF8&node=4"
            },
            {
                "name": "Growing Up & Facts of Life",
                "link": "https://www.amazon.com/Issues-Childrens-Books/b?ie=UTF8&node=1084192"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0375822747"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Yearling; First Edition (May 25, 2004)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 270 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780375822742"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0375822742"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9 - 12 years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 680L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 6.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.62 x 7.63 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,364 in Books (See Top 100 in Books) #123 in Children's Friendship Books #167 in Children's Fantasy & Magic Books #194 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 8,256 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "THE CITY OF EMBER THE PEOPLE OF SPARKS THE DIAMOND OF DARKHOLD THE PROPHET OF YONWOOD THE CITY OF EMBER COMPLETE BOXED SET Read all the books in the series! Book 1 Book 2 Book 3 Prequel All four adventures bound together for the very first time!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/898e8795-34e9-4073-b0d8-dcba3c4a6ced.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5d0cfc1-170e-4e32-9560-ea63225ab533.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7907da52-ce76-478a-b2fa-5417588cccda.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/872d3364-e89a-4f13-999a-9725c37c9f68.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9073025f-b441-4b4c-9939-f1dfe188775a.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mary Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY7Z7SBWUVXFNFRWXZJNK2DFMWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMVHYW3CLBGGX?ASIN=0375822747",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Kept my 9 year old engaged!",
                "reviewText": "We’ve been looking for. Book to get our 9 year old away from the graphic novel type books. He’s at a ninth grade reading level, but has the maturity of a 9 year old… which is great, but we would like him reading real books not just comic style ones. He loved Last kids on Earth and I’d say City of Ember is the step up reading level wise! Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika N. Yontz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENIF2JVN6OAQMCEWY3XF62FY5IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BXPHQ3GDUYP5?ASIN=0375822747",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2021",
                "reviewTitle": "5.0 out of 5 stars Great book summary!",
                "reviewText": "The City of EmberBy: Jeanne DuPrauWarning: it tells about the end of the book. In the City of Ember it is told upon creation that no one can leave for at least two hundred years or two hundred twenty. On assignment day it is 241. Doon and Lina are trying to get out of Ember and the light does not come from the sky, the light comes from the street in the ground and it goes out every now and then. The time that passes is not even a year. The setting reminds me of real life a little bit. When I read the book, I felt excited and happy. I felt the feeling of being sad, happy, and scared. The author used this approach in feelings because he wanted to change it up throughout the book. Lina and Doon are the main characters. Lina is white with blond hair. Her mom and dad died so she had just her grandmother. Her Grandmother died too! Lina has a sister named Poppy and another person named Mrs. Modo. Lina is twelve. She is nice and she likes to make friends. Doon is white with black hair. Then author didn’t talk much about his parents. He does not have any brothers nor sisters. Doon is usually with Lina. He is also really friendly and likes to make friends too. He is twelve too. Doon works as a pipeworker and Lina works as messenger. I enjoyed all the characters. Doon and Lina would like to find another safe place. Doon and Lina try to get out of Ember. Lina and Doom travel through a journey of pipes that became the escape from Embers. I did like the book from beginning to the end. I would not change any part. I would recommend it to friends, and I look forward to reading the next three books.This report is by Bennett Keagan Porter",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FTLOE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY272H3VM7O2ZZXQPWBEHZMMFOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R323J80ZB11ZG8?ASIN=0375822747",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 27, 2015",
                "reviewTitle": "4.0 out of 5 stars A lovely book that reminds me of Ella Enchanted, Walk Two Moons and Hatchet!",
                "reviewText": "I. The Beginning: Did It Hook Me?It actually did. I was curious to see why the \"Builders\" would go to such extreme lengths to have a society live on the basis of a lie, hoping they would somehow make it to the world above. It seemed like a far-fetched idea at the beginning of the book, but as it continued I easily suspended belief.❤ ❤ ❤ ❤ ❤ ❤ ❤II. The Characters: Could I Relate to Them?Absolutely. I absolutely loved Lina, Doon (can't figure out how his name is pronounced lol), her grandmother, and Poppy. I do feel the woman she ends up moving in with could've been fleshed out more (forgot her name), but overall the characters had \"weight\" to them.This book, while for children, was a great read because the characters not only behaved as children, but took on adult responsibilities as Ember dictated. I loved seeing Lina as a responsible mother figure for her mother, but also child enough to buy the colored pencils.Doon was such a lovable character. He honestly feels like the one person every child wants that believes their crazy/outlandish ideas and listens. I felt for him, related to his anger he felt and how he wanted to be taken seriously. I feel in so many ways I am like Doon and really loved his story.Grandmother was an absolute joy, though her exit from the book did seem sudden and underdeveloped. I liked her madness; it seemed real and added a certain suspense to the novel.Overall, this book is a very solid read.❤ ❤ ❤ ❤ ❤ ❤ ❤III. The Plot: Was It Well Paced?Absolutely! I was frustrated because I didn't have much time to commit to this book initially, but I was finally able to sit down and get into it (on March 6, 2015) it finished it that day! This book has no lags, isn't necessarily action packed, but makes use of every sentence.This book was refreshing and warm. I felt like the author wrote it with her heart, body and soul; if I had read this as a child, I am sure it would've been one of my favorites. I mean, I'm an adult and I love this book!The alternative POV's are executed perfectly in this book. In some books, actually in many current YA books, can be tedious and gimmicky. The dual-narrative in this book is necessary to tell two different stories about two people who have the audacity to pay attention and hope for more.This book is a new favorite of mine.❤ ❤ ❤ ❤ ❤ ❤ ❤IV. World Building: Did I \"Get\" It?There were some plot holes, but I figure they will be answered in the second book. Overall, I understood the society of Ember and have a general idea of how it works. It would've been nice to get the reasoning for the jobs in Ember, along with the significance of kids starting work at age 12, but these weren't major issues of mine. I don't understand how Doon and Lina were able to see Ember from above, but the people of Ember couldn't see the sky far above them. Also, if they can drop a note into Ember, how is it rain or other things don't fall into the city?❤ ❤ ❤ ❤ ❤ ❤ ❤V. The Ending: Did It Make Sense?It did. This is the kind of book that makes you want to read the next one. I wanted to know more about Lina's caregiver, but the story line didn't go that way; I can't wait to see what happens in book two!❤ ❤ ❤ ❤ ❤ ❤ ❤VI. OverallThis is a very solid read that not only left me smiling, but has me anxious to read the next book in the series!I highly recommend!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chicago reviewa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT7JVP6KY6TT2SCAIXKLEIU4T4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IPC33MDPCJHC?ASIN=0375822747",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Engaging family read aloud or read alone chapter book.",
                "reviewText": "If your looking to transport yourself immediately into a whole new world under the earths surface than read The City of Ember. The City of Ember is an engaging chapter book that we enjoyed reading as a read aloud together. This mom couldn't wait to pick up the book every night. We've also heard nothing but rave reviews from my neices and nephew after gifting them this book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "michelle chapman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 29, 2023",
                "reviewTitle": "Great read",
                "reviewText": "Such a great story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "F",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 31, 2023",
                "reviewTitle": "Nice",
                "reviewText": "This is such a nice story that I will hold with me for a long time. The atmosphere is incredible and the plot has such a good balance of elements like action, danger and thinking, and lightheartedness, fantasy and hope.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aishwarya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 24, 2022",
                "reviewTitle": "My 11year old loved it and made me buy the entire series .",
                "reviewText": "Tried the author for the first time .. I am made to buy the whole series ..my 11year old says its Fantastic",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pierluigi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on May 2, 2019",
                "reviewTitle": "A very nice novel for young kids, with some non-trivial issues tackled",
                "reviewText": "Great novel for kids, especially if read by parents to the kids. Age bracket: 8-9 (with parental guidance) or 10-14 otherwise.What I particularly like about the novel is the interesting issues that it actually confronts of a limited-resources environment, something that it is hard for our children to fathom, used as they are to total abundance of \"stuff\" of all sorts. It makes them understand that the fact that our supermarkets are filled to the brim with all sorts of goods should not be taken for granted and that in general resources are limited. Then I also like the style of narration, that starts out at a relatively slow pace, to pick up speed gradually.A great book, quite different from the mainstream \"superheroes\" or \"magicians\" or \"wimpy kid diaries\", which are entertaining, but typically (with some exceptions) do not stimulate critical thinking and actual personal growth.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on August 28, 2022",
                "reviewTitle": "Good book",
                "reviewText": "Good shipping, book undamaged and great book Reccomend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$3.92",
                "sellerName": "Red's Corner",
                "sellerRating": "4.5"
            }
        ]
    }
}