{
    "remaining_requests": 1641,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Live-Safely-Science-Fictional-Universe/dp/0307739457",
    "body": {
        "name": "How to Live Safely in a Science Fictional Universe: A Novel",
        "price": "$13.79$13.79",
        "originalPrice": "",
        "rawPrice": 13.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Live-Safely-Science-Fictional-Universe/dp/0307739457",
        "soldBy": {
            "sellerID": "A34MOU1WOG7LRW",
            "name": "Zoom Books Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A34MOU1WOG7LRW&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61Ng6x9+OVL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Charles Yu",
            "link": "https://www.amazon.com/Charles-Yu/e/B001IGUV4A/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Zoom Books Company",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 1024,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 15 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 16 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage (June 28, 2011)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0307739457"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0307739452"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.02 x 0.75 x 7.97 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#106,960 in Books (See Top 100 in Books) #2,504 in Space Operas #3,832 in Science Fiction Adventures #7,491 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 1,024 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David Evans",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX6EOFCLO4MKEMEOWRTBY3PGWYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24U3C3UO13TAH?ASIN=0307739457",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2010",
                "reviewTitle": "5.0 out of 5 stars reflections on loss and on fathers & sons, within an awesome, creative, & funny time-traveling framework",
                "reviewText": "I have a limited tolerance for science fiction. I loved Lethem's Gun, with Occasional Music (crime noir in sci-fi setting) and liked his As She Climbed Across the Table (sci-fi relationship story, maybe). I enjoyed Gibson's Neuromancer . At the high risk of sounding pretentious, I like \"literary science fiction\"; Yu, in his interview at the end of the book, describes his inspiration, a book that \"handled actual science...without watering it down, and yet it was clearly Serious Fiction, ... the kind that was in the Sunday book review sections.\" This book definitely falls in that category.The main character, Charles Yu, is a time machine technician in a science fictional universe. He has spent the last decade living in his time machine (a little bigger than a telephone booth), racing around and saving clients who get stuck. For example, Linus Skywalker going back in time to try and kill his father Luke: \"You have no idea what it's like, man. To grow up with the freaking savior of the universe as your dad\" (p13). Or a woman who wants to have been there when her grandmother died. (But while you can visit the past, you can't change it or you risk splitting off into a parallel universe in which the past was as you have changed it...or something.)I loved two things about this book. First, the science fiction is so fun. I laughed out loud several times. From running into Luke Skywalker's patricidal son to making out with some alien (\"Not human exactly. Humanish. Close enough that she looked awesome... She was a good kisser. I just hope that was her mouth\" p52) to Charles's manager, \"an old copy of Microsoft Middle Manager 3.0 ... The only thing is, and this isn't really that big a deal, is that Phil thinks he's a real person\" (p40). Lots of managerial \"yo dog\" and \"I'm still your homie?\" ensues.Second, so much of the book resonated emotionally. In the margins of my copy, I over and over have jotted down notes of empathy. \"My thoughts, normally bunched together, wrapped in gauze, insistent, urgent, impatient, one moment to the next, living in what I realize is, in essence, a constant state of emergency\" (p122). \"I bet there's a secret door! This is so cool! I'm so smart! It's like my very own adventure story. ... The only problem is that the TM-31 [where the book is] is nowhere to be found. I guess I'm not so smart. I am kind of an idiot\" (p128). While I didn't love the main character, I feel him.Occasionally, early in the book, I wished for more action. And I don't really understand what happened at the end. But it was still totally worth the ride, and I'll check out Yu's earlier short story collection, as well as Saunders' Civil War Land in Bad Decline , which Yu cites as an inspiration in his interview at the end.Finally, one of my favorite passages: \"I modified it slightly to pry open really tiny temporary quantum windows into other universes, through which I am able to spy on my alternate selves. I've seen thirty-nine of them, these varieties of me, and about thirty-fave of them seem like total jerks. I guess I've come to terms with that, with what it probably means. If 89.7 percent of the other versions of you are [jerks], chances are you aren't exactly mister personality yourself\" (p10).Note on objectionable content: Some reference to the existence of sex with robots but not explicit. A smattering of strong language.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Don",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLIUCQTU5AYHPLMVEX2YNH2V4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLLE9YMPYNT3Z?ASIN=0307739457",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2012",
                "reviewTitle": "4.0 out of 5 stars A stellar debut novel, at turns both hilarious and moving.",
                "reviewText": "I thoroughly enjoyed this book. The premise seemed wonderfully nutty: Take a universe populated with the standard sci-fi tropes and concepts, then set a story inside it, fully self-aware of its genre trappings. I also noted the metafictional conceit of the main character being one Charles Yu (the author of this novel). As it turns out, the meta goes even deeper with that, as \"How to Live Safely...\" is also a book which exists in the narrative itself - specifically, one that is being created/written by the author/protagonist by the very act of, and at the same time as, his reading of it. This is the kind of thing you'd better be prepared for: Seriously, totally nuts.What's even better is that this mind-bending and often hilarious approach is only one side to the novel. The other side, as it turns out, is much more introspective and even slightly morose; we discover that time machines, for instance, are fueled not by some made-up radioactive isotope - but by the extraordinarily powerful elements of memory and regret. We're told that 99% of people who use a time machine never visit the far-flung future or the historical past - but instead return to the scene of their worst mistake, again and again. Knowing human nature, this immediately rang as profoundly, instinctively true. The main plot of the book concerns not a time-space battle between warring factions or any other overplayed, meaningless trope - but rather the protagonist's search for his father (whom he only ever connected with when they were trying to were trying to build that first time machine in their garage), and what was lost. Most of us, we are told, are trapped in our own time loops, and they're ones of our own making.It's not a perfect book; after introducing richly funny bits in the beginning like meeting Luke Skywalker's kid son, bratty and resentful, the author seemingly forgets this element - the idea of a universe which casually contains not just sci-fi concepts like time-travel, but also sci-fi characters such as those from the Star Wars franchise. Granted, an overabundance of such would have devolved the novel into yet another goofy SF parody, and the novel that we have is one I much prefer, but it would have been nice to see that delicious concept used just a little bit more than it is.That said, this was an incredibly engaging, incredibly compelling novel. I can't wait to see what Yu does next.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alain Nisen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 17, 2020",
                "reviewTitle": "Bonne condition",
                "reviewText": "Livre neuf",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dirk V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 15, 2020",
                "reviewTitle": "Great twist ...",
                "reviewText": "Interesting, sometimes a bit unpolished but certainly with a great finish. The way the author describes the search of a son for his father by putting it in a science fiction / tone traveling context is pretty clever and it totally works for me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TRC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 15, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Good buy, thank you !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lachlan ferguson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 25, 2016",
                "reviewTitle": "A fantastic read. Very meta and I love meta.",
                "reviewText": "fantastic book. very odd but very interesting. The ideas are wonderful and it really is a weird enjoyable read. Anyone who likes weird meta stories would love this.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Herbst",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 30, 2012",
                "reviewTitle": "Destined to be cult.",
                "reviewText": "\"When it happens, this is what happens: I shoot myself. 'Not, you know, my self self. I shoot my future self. He steps out of a time machine, introduces himself as Charles Yu. What else am I supposed to do? I kill him. I kill my own future.\"More on that laterCharles Yu's book is hard to discribe.With only TAMMY - a slightly tearful computer with self-esteem issues - a software boss called Phil - Microsoft Middle Manager 3.0(who thinks it is human!Hilarious)and ED an nonexistent but \"ontologically valid\" dog for company, fixing time machines is a lonely business Charles.He's spent the better part of a decade spying on 39 different versions of himself in alternate universes (and discovered that 35 of them are total jerks). And he's kind of fallen in love with TAMMY, which is bad because she \"doesn't have a module for that\".That is his work place:\"Minor Universe 31 is a vast story-space on the outskirts of fiction, where paradox fluctuates like the stock market, lonely sexbots beckon failed protagonists, and time travel is serious business. Every day, people get into time machines and try to do the one thing they should never do: change the past.\"Charles is at some point given the very book we are reading by his future self, whom he shoots, thus becoming stuck in a time loop. Before collapsing, his future self tells him that the key is in the book. Charles then runs away in his time machine and slowly realizes that he has to write the book to be able to give it to his past self when he comes out of his time machine and be shot so as not to create a time paradox. Thanks to voice recording systems and various other hi tech gadgets in the time machine, a copy of the book is actually being written as Charles is reading it. So that means that the very book we're reading has no real origin, it's a copy of a copy of a copy of a copy, etc... as there's no way of knowing how long Charles has actually been in this time loop, or going to be.This leads to some interesting questionings:\"I am typing what appears to be somewhat digressive and extemporaneous rambling, all of which is starting to make me have serious doubts in terms of the whole free will versus determinism situation\" The book is packed with this . I love it.It's genius- like reading an Douglas Adams update.Charles Yu's time traveling is an idea, a concept that serves the narration more than actual HG Wells time traveling. It's hilarious , the ideas are great( Yu ties laser beams, quantum physics and Han Solo into philosophical discussions of what it means to be human.) and the father/son story is very moving. This is definitely a Marmite book, you will either love it or hate it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}