{
    "remaining_requests": 1584,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Contact-Carl-Sagan-audiobook/dp/B007NVE0KA",
    "body": {
        "name": "Contact",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Contact-Carl-Sagan-audiobook/dp/B007NVE0KA",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ZJMpOIUTL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Carl Sagan",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Carl+Sagan"
        },
        "brand": "Carl Sagan",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5690,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The future is here...in an adventure of cosmic dimension. In December, 1999, a multinational team journeys out to the stars, to the most awesome encounter in human history. Who - or what - is out there? In Cosmos, Carl Sagan explained the universe. In Contact, he predicts its future - and our own. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Alien Invasion",
                "link": "https://www.amazon.com/Alien-Invasion-Science-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=9059886011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 45 minutes"
            },
            {
                "name": "Author",
                "value": "Carl Sagan"
            },
            {
                "name": "Narrator",
                "value": "Laurel Lefkow"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 23, 2012"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B007NVE0KA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,629 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #38 in First Contact Science Fiction (Audible Books & Originals) #65 in Alien Invasion Science Fiction #124 in First Contact Science Fiction (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Philly215",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK54RIUEWL53EEAUT4QNSRHGFNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYP74BHM80FDN?ASIN=B007NVE0KA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars great book",
                "reviewText": "Great book for book club, also nice that you can watch the movie afterwards",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Very Nice it’s can hold on to my hair perfectly I love it",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKAWJCASGDWDINARPRIOTTJLFCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37KMLTYW2UO6O?ASIN=B007NVE0KA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Educative",
                "reviewText": "I was longing to read this book because I have watched the move so I am so excited to read the Book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "One Guy's Opinion",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2O3CKV4I4PI3AVDKRF3NO77WXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CS8MKND3OH42?ASIN=B007NVE0KA",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2013",
                "reviewTitle": "4.0 out of 5 stars Plot - 5, Characters - 4, Theme - 5, Voice - 4, Setting - 4, Overall - 4",
                "reviewText": "1) Plot (5 stars) - After spending a lifetime listening to the stars, one astronomer finally hears a message to build a machine. But should humanity build it? What will the machine do? Will it be friendly or hostile? The decision pulls all facets of our modern society to the table for a heated debate and the tension of their interplay and the final result was fascinating. Sometimes, however, I felt the pace was a bit slow.2) Characters (4 stars) - Ellie is the brilliant scientist charging forward for the cause of the rational, while sometimes missing the subtleties of interpersonal relations or emotions. She's a romantic which puts her at odds with her fellow scientists, but also deeply analytical which puts her at odds with much of humanity. On top of it, she's a female in a male dominated profession which allows for sexual and gender conflict as well. I enjoyed riding along with her on this journey.3) Theme (5 stars) - Are we alone in the universe? It's so immense that it seems almost mathematically impossible for us to be the only \"intelligent\" life form. But if so, why haven't we made contact? Is it a lack of technology on our side or theirs? A lack of interest? A time or space distance too large to hurdle? Or are we just too different to understand each other? This was the surface question of the book, but underlying it was the theme of faith vs. empirical rationality, and how we need both to dream and advance. A message which was summed up beautifully in the book's conclusion.4) Voice (4 stars) - Sagan became famous for translating esoteric scientific principles into simple and engaging parlance for non-scientists, and this ability shines through in his prose. Through Sagan's eyes all the prosaic backdrop we take for granted--ants, stars, mathematic concepts--come alive with his curiosity and the teeming science behind them.5) Setting (4 stars) - The book takes place in a variety of science facilities on Earth, and a bit in outer space. All were described well and I felt transported there.6) Overall (4 stars) - An excellent story on the role of science in our present and future, made accessible through a strong lead, interesting plot, and a kindly professorial voice. Smart and fun. I'd recommend it.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas Erickson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQUMRE7ILPPWCTNA7GPWBYBEU2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TG9Z9L284913?ASIN=B007NVE0KA",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2010",
                "reviewTitle": "5.0 out of 5 stars Carl Sagan great fiction .Be careful you might learn a tidbit of radio astronomy too.",
                "reviewText": "Another great book by Carl Sagan. I expected a great book by the Pulitzer Prize winner author of Cosmos... Carl Sagan ( see my review 5 stars) and I was not disappointed.As an amateur astronomer of 40 years I knew of the famous distinguished astronomer Carl Sagan. All of the basic astronomy used in this great Sci Fi I knew about but I know very little of Radio Astronomy. By reading this book I learned a few tidbits about Radio Astronomy. To me this book was fascinating.We see the central character Ellie Arroway growing up and eventually getting a PHD and becoming a world class astronomer in charge of a huge radio telescope... project Argus. Dr. Arroway leads a team and finds an ET signal originating from near the star Vega beaming to Earth. Project Argus receives a signal of prime numbers and then the The ETs beam back a radio signal received from us of Hitler and the Olympic games in the late 30s. Embedded in the signal is a message of instructions for us to build a 2 trillion dollar machine but there is problems getting the \"primer\" message to understand it. Eventually we get the \"primer\" and build the machine in the US, Russia and Japan. 5 people are selected to go into the machine ( Dr. Arroway is one of them) and using wormhole technology on double black holes are.....that's enough I wont ruin the book for you. Just to say the famous 5 are threatened to not say what they discovered and let the world think the machine did not work. But it did....! At the end of the book we learn the final message.Carl Sagan was a world class astronomer and scientist that also worked as part of the Viking Mars spacecraft team. One of the things I liked about Carl was his seemingly effortless way of making complex problems in astronomy and science understandable to the general public. That is a rare gift. Many times brilliant men/women can not write to the average laymen complex thoughts in a way for the less educated to understand. Carl was a master at this.This is excellent Sci Fi. Also some real Astronomy and some Radio Astronomy is used. The book reads very well. A fast read. The characters are well established and there is good interaction. As a novice to Radio Astronomy it was great learning a few very, very basic tidbits of Radio Astronomy.Also Contact was a major motion picture from Warner Brothers. I remember seeing the movie and liked it too. The book was just as good.5 stars for a very enjoyable book.Sadly Carl Sagan passed away in 1996. The world misses a great astronomer, scientist and a great man. Even though he never knew of me I considered Carl Sagan a friend who I respected very much.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan Carlos Martin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 26, 2022",
                "reviewTitle": "Excelente novela de ciencia ficcion de uno de los mejore divulgadores de los ultimos tiempos",
                "reviewText": "Con todo el sustento tecnico y cientifico que el que alguien como Sagan le aporta a una novela de esta naturaleza las cuestiones que plantea al termino de la novela siguen y seguiran siendo muy validas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "suzanne ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 18, 2023",
                "reviewTitle": "Book",
                "reviewText": "It was a gift for my daughter, she is a fan of Carl Sagan",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "arc_lite",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 17, 2023",
                "reviewTitle": "Sehr gut",
                "reviewText": "Buch in einen sehr guten Zustand, schneller Versand, vielen Dank.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AQL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 20, 2021",
                "reviewTitle": "One of my favorite books",
                "reviewText": "The subject is fascinating. I particularly love the questions that are conjectured by the author should we be contacted. And I love the answers even more. Much more thorough than the movie starring Jody Foster (another favorite). Maybe the book deserves a mini series like some of today’s shows. A 2 hour movie could not do this justice, the movie Contact is just an appetizer. Well written. Quite an expansive vocabulary. I was happy to read it on my iPad w/ Kindle App so I could highlight a word I didn’t know and get the meaning right away.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NineDem",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 26, 2023",
                "reviewTitle": "Très bien",
                "reviewText": "Merci beaucoup",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}