{
    "remaining_requests": 1495,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/How-Write-Science-Fiction-Fantasy/dp/158297103X",
    "body": {
        "name": "How to Write Science Fiction & Fantasy",
        "price": "$15.19$15.19$9.97$9.97",
        "originalPrice": "$18.99",
        "rawPrice": 15.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/How-Write-Science-Fiction-Fantasy/dp/158297103X",
        "soldBy": {
            "sellerID": "A2DY5OD03N3Y2Y",
            "name": "CT Distributions LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2DY5OD03N3Y2Y&asin=158297103X&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61FylU5MytL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Orson Scott Card",
            "link": "https://www.amazon.com/Orson-Scott-Card/e/B000AQ3SS0/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Rye Berry Books and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 375,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Orson Scott Card is one of the biggest names in science fiction and fantasy. He won both the Hugo and Nebula science fiction awards for best novel for two consecutive years--something no other writer has ever done. In addition, he was the first writer to ever win a Nebula and a Hugo for both a book and its sequel, Ender's Game and Speaker for the Dead. His current best-seller is Shadow of Hegemon. He lives in North Carolina."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28",
            "FREE delivery March 3 - 14 on orders shipped by Amazon over $35",
            "Or fastest delivery March 2 - 11"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Learn to write science fiction and fantasy from a masterYou've always dreamed of writing science fiction and fantasy tales that pull readers into extraordinary new worlds and fantastic conflicts. Best-selling author Orson Scott Card shows you how it's done, distilling years of writing experience and publishing success into concise, no-nonsense advice. You'll learn how to: • utilize story elements that define the science fiction and fantasy genres • build, populate, and dramatize a credible, inviting world your readers will want to explore • develop the \"rules\" of time, space and magic that affect your world and its inhabitants • construct a compelling story by developing ideas, characters, and events that keep readers turning pages • find the markets for speculative fiction, reach them, and get published • submit queries, write cover letters, find an agent, and live the life of a writerThe boundaries of your imagination are infinite. Explore them with Orson Scott Card and create fiction that casts a spell over agents, publishers, and readers from every world. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Publishing Group; First Paperback Edition (September 15, 2001)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 144 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 158297103X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1582971032"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.36 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#167,028 in Books (See Top 100 in Books) #25 in Science Fiction & Fantasy Writing #88 in Research Reference Books #374 in Writing Skill Reference (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 375 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tom L. Waters",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTQVTPBTPAIXPZAQ6GBK3MNEEDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PA141I0VS1Q8?ASIN=158297103X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2008",
                "reviewTitle": "5.0 out of 5 stars top resource for writing speculative fiction, particularly sf",
                "reviewText": "Orson Scott Card (well known to sf circles as the author of Ender's Game) presents his advice on writing science fiction and fantasy. The book has a specific and limited scope: rather than trying to teach everything one needs to know to write fiction, Card addresses only those areas where speculative fiction differs from other types. Consequently, this is not a stand-alone writing book. If you are unacquainted with the craft of plotting, character development, dialog, etc., you will need to fill those gaps in some other way.Within the scope the book sets for itself, however, it is top notch. Card really knows his stuff, and has a knack for articulating what he knows in a helpful and memorable way. Particularly valuable is the section on exposition. While most books on fiction writing preach minimizing exposition, Card understands that speculative fiction requires it. The imaginative worlds of speculative fiction are not familiar to readers; they need explaining, and readers expect satisfying explanations. Card explains the conventions of the genre that are used to present exposition without stalling the story. He uses Wild Seed by Octavia Butler to illustrate the ideas, so the reader can see tangible examples of the principles he describes.I also enjoyed his breakdown of stories into four categories (MICE, for milieu, idea, character, and event). He deftly summarizes how each type of story needs to work, and the problems that can result if you don't know what type of story you are writing. This was illuminating and refreshing, since most books on writing do not even acknowledge that fiction can be driven by anything other than character development. In speculative fiction, however, milieu and idea driven stories are part of the landscape, and the aspiring writer needs to understand how they work.Card also offers excellent advice about the business of writing, covering subjects beyond manuscript preparation and agents, such as writer's workshops and classes, sf conventions, and so on. Once again, his familiarity with the world of sf writing comes through strong and clear; he's not merely repeating standard bits of advice, but is writing from experience.A few words of caution: The book was published in 1990, and so is a bit dated in places (there is a bigger market for fantasy short stories than when Card was writing, for example), and the book emphasizes sf more than fantasy. (One notable disappointment in this regard: In one section, there is a discussion of the mechanics of interstellar travel, time travel, and magic. The first two topics receive well-thought-out lists of the different approaches used in sf, and their story implications. Magic, instead of receiving a similar treatment, gets a digression riffing off the idea that magicians sacrifice body parts to cast spells. It's an interesting train of thought, but something less narrow and idiosyncratic would have been appreciated.)On balance, this is the very best book I have found on the special issues that arise when writing science fiction and fantasy. Paired with something like The Complete Handbook of Novel Writing, it will answer most questions an aspiring writer in these genres is likely to face.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Bayne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAXBSYLNM3W43FPYPA4PSVV47XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15H4W21SO22KJ?ASIN=158297103X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2007",
                "reviewTitle": "5.0 out of 5 stars Short, sweet, to the point",
                "reviewText": "This is an awesome little book that delves into the basics of writing speculative fiction from world building to publishing to dealing with family members who don't understand your need to write. I read one Amazon reviewer who didn't care for this book because everything in it is intuitive. Yes, most of what's in here makes perfect sense in a \"Well, duh!\" kind of way, but sometimes intuitive things need to be spelled out clearly. You may kind of know something at the back of your brain, but unless you can bring it to the front of your mind, it's not going to work for you. This book brings these things to the front of your mind, simply, clearly, and effectively.For example, Mr. Card writes that you should know why things are the way they are in your world. (Well duh, right?) Of course you should know why things work the way they do in your world, whether it's how spaceships manage to travel faster than light, or what the price of magic is. But the important thing is to know how all this stuff works before you really start, as opposed to making it up as you go. If you know what the rules are, then you can make your world believable. (Also, you don't have to keep going back and forth trying to find what you wrote before so that you don't contradict yourself.) What your characters do within those rules can happen spur of the moment, but the world they live in must be pretty well defined in your own mind before they start living there.The last section (The Life and Business of Writing) was the least intuitive of all, but so necessary. Getting published doens't mean quitting your day job (OK, that part was intuitive). Some of what he says is almost disheartening, but my feeling is, being prepared is better than being surprised. Knowing about the pitfalls can help you avoid them.I could go on and on about how helpful this book is, but I have a future bestseller calling to me, demanding that I plug a few holes and flesh out some of those pesky middle parts. So get this book if you like to write sci-fi or fantasy and your intuition is being a bit non-specific. It's good, plain and simple.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick Temple",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUM7PRK7W6OMXKJR4I7GGYUTXRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNHVOPGU4JKL7?ASIN=158297103X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2008",
                "reviewTitle": "4.0 out of 5 stars Extremely Good",
                "reviewText": "Well written, with lots of great insights and real confidence builder. Card also give a lot of resources for further study. At one point (from memory) he says that you must simultaneously believe that the story you are working on today is the greatest story ever written ... so that you have the confidence to move forward. And that the current story you are working on is drivel (my word), so you can take the criticisms and rejection and move on.The advice he gives on how to query magazines and publishers is worth it's weight in gold, and the section on being careful not to get \"pegged\" in a specific genre is pretty good too.The only reason this book doesn't currently rate 5 stars is because some of the information is outdated. I simply have to wonder if, other than certain magazines being out of print, if anything else in the Sci Fi & Fantasy realms have changed since the book was written?Maybe it's time to spend a day or two updating the content, and releasing a new edition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "we're all brothers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 15, 2021",
                "reviewTitle": "muy útil y sensato",
                "reviewText": "bien planteado y sencillo de seguir. algunos comentarios realmente muy útiles. gracias",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francesco Vitellini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 6, 2020",
                "reviewTitle": "Good starting point.",
                "reviewText": "This book is a good starting point for writers who are looking for some basic detail about wordbuilding.Of course, everyone has a different talent for writing, so there will be one different world for each writer.But the suggestions provided in this book are useful and interesting for everyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 5, 2018",
                "reviewTitle": "Gives insights to the world of writing genre in America",
                "reviewText": "How publishing of Science Fiction and Fantasy developed is very interesting to read. Besides it tells how to write in these genres and how to decide what type of story you wrote.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Jane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 24, 2014",
                "reviewTitle": "Fun book",
                "reviewText": "Well, I don't have much to write, I'm not actually writing Sci Fi at the moment, I'm kinda stuck writing a review that requires me to write more words than I actually have to say so I'm kinda rambling, sorry about the run on sentence, you are all champs for reading all this and I salute you! Ok I think that's enough, I'll click Submit now. Bye bye for now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mario Lodos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 13, 2014",
                "reviewTitle": "Actually, value for money in a very crowded topic...",
                "reviewText": "At last I found something useful in this 'helping yourself to write' category, after several ununseful books that promise one thing and deliver 'copy & paste' wikipedia material. Anyway, Orson Scott Card is quite an opinionated guy, and therefore you will find some useful things here, different from other 'how-to' books.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$16.70",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            },
            {
                "price": "$18.99",
                "sellerName": "BookExcellence",
                "sellerRating": "4.5"
            }
        ]
    }
}