{
    "remaining_requests": 1417,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Red-Rising-Book-ebook/dp/B00CVS2J80",
    "body": {
        "name": "Red Rising (Red Rising Series Book 1)",
        "price": "$5.99",
        "originalPrice": "",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Red-Rising-Book-ebook/dp/B00CVS2J80",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51D77-p9JJL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/51KMu9JceSL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Pierce Brown",
            "link": "https://www.amazon.com/Pierce-Brown/e/B00EDBZVNI/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 55138,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NEW YORK TIMES BESTSELLER • Pierce Brown’s relentlessly entertaining debut channels the excitement of The Hunger Games by Suzanne Collins and Ender’s Game by Orson Scott Card. “Red Rising ascends above a crowded dys­topian field.”—USA TodayONE OF THE BEST BOOKS OF THE YEAR—Entertainment Weekly, BuzzFeed, Shelf Awareness“I live for the dream that my children will be born free,” she says. “That they will be what they like. That they will own the land their father gave them.” “I live for you,” I say sadly. Eo kisses my cheek. “Then you must live for more.”Darrow is a Red, a member of the lowest caste in the color-coded society of the future. Like his fellow Reds, he works all day, believing that he and his people are making the surface of Mars livable for future generations. Yet he toils willingly, trusting that his blood and sweat will one day result in a better world for his children. But Darrow and his kind have been betrayed. Soon he discovers that humanity reached the surface generations ago. Vast cities and lush wilds spread across the planet. Darrow—and Reds like him—are nothing more than slaves to a decadent ruling class. Inspired by a longing for justice, and driven by the memory of lost love, Darrow sacrifices everything to infiltrate the legendary Institute, a proving ground for the dominant Gold caste, where the next generation of humanity’s overlords struggle for power. He will be forced to compete for his life and the very future of civilization against the best and most brutal of Society’s ruling class. There, he will stop at nothing to bring down his enemies . . . even if it means he has to become one of them to do so.Praise for Red Rising“[A] spectacular adventure . . . one heart-pounding ride . . . Pierce Brown’s dizzyingly good debut novel evokes The Hunger Games, Lord of the Flies, and Ender’s Game. . . . [Red Rising] has everything it needs to become meteoric.”—Entertainment Weekly“Ender, Katniss, and now Darrow.”—Scott Sigler “Red Rising is a sophisticated vision. . . . Brown will find a devoted audience.”—Richmond Times-DispatchDon’t miss any of Pierce Brown’s Red Rising Saga:RED RISING • GOLDEN SON • MORNING STAR • IRON GOLD • DARK AGE • LIGHT BRINGER",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00CVS2J80"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Del Rey (January 28, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 28, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4046 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 401 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#919 in Kindle Store (See Top 100 in Kindle Store) #2 in Fantasy Adventure Fiction #3 in War & Military Action Fiction (Books) #4 in Dystopian Science Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 55,138 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b5a90ae-5330-42dd-9b8e-d0004e08a1ae.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3efdd306-326d-40b5-91f3-0337e18d43ec.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50b36379-849e-4c80-aece-6de4aba1716c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2033e0a9-4ca6-4bfd-ad2d-8a0d8a0c9443.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "bookworm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKAM4ZACYZGOMBQL4NDW6LWUGTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IGY6EGX9WNDU?ASIN=B00CVS2J80",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Boodydamn amazing!",
                "reviewText": "Holy Helldivers, that was a bloodydamn wild ride, and I can't wait for the rest of it.I've heard a lot of comparisons for this book, including the Hunger Games and the Six Million Dollar Man. But I'll let you be the judge of what's what in that regard.Let's talk synopsis first ... (minor spoilers included - I'm really trying hard to not ruin any of the big stuff.)Red Rising is written from the 1st person account of Darrow, who is a \"Red\" - the lowest caste which is responsible for mining Helium-3 on Mars and (they believe) laying the foundations to make Mars habitable for \"softer Colors\". Through a tragic series of events, he comes to realize that his life and place in society is a lie that serves to prop up the other colors in an elaborate caste system, which essentially enslaves his caste. A resistance network seeks to topple this heirarchy by making Darrow into that which has subjugated them, a Gold ... but not just ANY Gold. In order to make changes to this system of slavery, he will need to be the best of the best so that he can rise within the cutthroat caste of Golds. After a painful biological transition, Darrow tests into a school in which the leaders of the Golds are forged and taught painful lessons in the ideology of \"might makes right\". The question is will Darrow become the monster that he seeks to vanquish?WHAT I LOVED:Darrow is a relatable character from the beginning. He's a 16 year old kid with all the arrogance and impulsiveness you'd expect from a teenager who has been the best within his community. And though you experience the brashness and cynicism, you also see tenderness, wonder, and vulnerability. His evolution as a character is believable. Because he's not fighting for his *own* dream, it is understandable when he temporarily gets sidetracked from the bigger picture due to his rage against such an unfair system that has unfeelingly and unknowingly stolen everything from him. He has much to learn if he is going to overcome ... \"I learn more when I make mistakes, so long as they don't kill me.\"The Supporting Characters. They're on point, y'all. The writing makes it clear that some of the worst of the characters have depth to them, whether it was in hinting at the reasons they did the terrible things they did or in showing that there was a possibility of redemption. And the journey of how Darrow acquires his allies is truly where you see his growth as a character.Honestly y'all, there's just so much that I could rave about ... but I'm an impatient sort and if you've stuck with me this far, you've probably already made up your mind about whether you want to read this. (and you really should read this.)OTHER THOUGHTS:There is a lot of worldbuilding going on here, especially in the beginning and the slang/terms used reflect that. Some readers seem to have been turned off by that, but I didn't feel it was excessive or overly cumbersome.I've seen several people question whether this should be categorized as a YA book. The themes (politics, hierarchical systems, racism, power dynamics, etc.) involved are weighty. There are allusions to rape and cannibalism, and the story is rife with violence and brutality. While the ages of the characters in this book are largely in their teens, but most teenagers in our world aren't confronted with these topics so blatantly in their day to day life. YET ... isn't the job of books and the characters in them to make us think critically about the world around us? To help us form our views about what is right and wrong, what is noble and what is dishonorable? To make us think about what we would do in their shoes? And, hopefully, to help us see the kind of people we want to be and encourage us in that that direction? While I don't think I would want my 14 year old read this unsupervised, I think stories like this one can powerfully shape the minds of young people and adults alike when we reflect on the lessons it contains, rather than just consuming it purely for our own entertainment.How many of us seriously consider where we might fall in such a hierarchy? Do we truly look for the ways that our comfort might blind us to the suffering of others that might serve to prop up that comfort? Do we care to do so? Do we see the hypocrisy in ourselves that we see rife in some of the characters of this book? And if we feel that twinge of discomfort, do you press into that to see why or do we move on, happy to be entertained by a story?\"The measure of a man is what he does when he has power.\" -Plato ... a common theme in this book, but I might go a step further and say that the measure of a man is what he does with the power he has. We ALL have a measure of power. How are we using that power to elicit change in ourselves and in the world around us?",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fallon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOI34LMUFUKDQZUJPDVWZQDXYHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BE62J1SYXAG6?ASIN=B00CVS2J80",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Red Rising",
                "reviewText": "In 2018, I purchased a book for $1.99. However, when I attempted to read it, I couldn’t get into it. I realized that the reason was because it reminded me of Lord of the Flies, which I absolutely hated. As a result, I didn’t finish the story at that time. Fast forward to 5 years later, and the author has published book six of the series. The series is now all over my BookTok feed, so I decided to give the book another chance. I’m happy to say that I’m glad I did.This book is advertised as a young adult novel, but it appeals to both young adults and adults alike. The protagonist, Darrow, is introduced at the age of 16 and the story ends when he believes he is 18. He is married to Eo, a dreamer. Darrow is a hell diver, a member of a mining team, and he dives into the depths of the mines to extract precious resources while facing dangerous creatures such as pit vipers. The Reds were brought to Mars to terraform the planet so that it could support life, but they never got to see the surface of the planet. After the loss of his wife, Darrow is recruited to become a Gold, which is the elite of all the bloodlines. He undergoes a painful transformation to change his appearance and then infiltrates a Gold Academy to liberate the Reds from slavery. This is the basic premise of the book, but it is way more complex than what was just described.This book is so wonderfully brutal and epic. These kids are put into this forest to survive and learn about themselves and how their baser instincts can win out. They have to either adapt or burn out. Darrow is a very flawed character who starts only wanting to seek justice for his wife. He learns a lot about the power dynamics of his world, the slavery that he was unaware of and that not all Golds are bad, and most may not even know what is truly going on in their political system.I have seen this compared to books like The Hunger Games. Although there is a competition where many people die, this world has a much larger and more fleshed-out setting than The Hunger Games. I really enjoyed The Hunger Games series, but to compare it to this would be like comparing a toy car to a real one. I cannot describe how incredible this story is without revealing important plot points. All I can say is that I can hardly wait to explore the rest of the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DaleDale",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "The book is amazing, but the quality of the copy I received is atrocious",
                "reviewText": "I bought a new hardcover copy off here, and was sent a book in absolutely horrible condition. I fully recommend buying this book, but I fully recommend avoiding Amazon as the place you purchase it. I was actually shocked they sent me this garbage. Who the hell puts that in a box thinking it's okay to sell? I'm giving it 5 stars because I don't want to harm the actual novel's rating, but I feel obligated to warn people away from using Amazon to buy it. They refunded me my money, but it's still agitating that it happened at all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bqdCRm--L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mTyp+4lcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61TX4RA+zWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 27, 2022",
                "reviewTitle": "Um dos melhores livros de ficção científica que já li na vida",
                "reviewText": "Excelente! Personagens bem escritos, com arcos de desenvolvimento interessantes e uma trama cujo avanço não é óbvio! Excelente criação de mundo. A história tem um ritmo acelerado e cheio de ação. Pra se apaixonar mesmo! E fica ainda melhor nos próximos livros da série.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vaida",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 16, 2024",
                "reviewTitle": "Good book",
                "reviewText": "Son loves this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 9, 2024",
                "reviewTitle": "Couldn’t put it down",
                "reviewText": "This book took me by surprise. I just wanted some random stuff to read as I sat down and waited for the doctor.🤯 I read this book nonstop from cover to cover in 36 hours and bought the entire saga after reading it last page.If you loved The hunger games, this is your next victim!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Majin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 31, 2024",
                "reviewTitle": "Sehr unterhaltsam",
                "reviewText": "Die Zeit ist beim Lesen nur so verflogen. Das Erzähltempo ist recht flott ohne dass es sich anfühlt als würden wichtige Informationen dabei verloren gehen. Einzig der Einstieg ist ein wenig langatmig, aber das ist vermutlich auch so beabsichtigt, da es einen starken Kontrast zur 'anderen Welt' mit dem Überlebenskampf bildet. Die Charaktere fand ich allesamt interessant, das passiert mir nicht oft. Ich freue mich schon, den zweiten Teil der Reihe zu lesen.Achja, das Buch ist teilweise sehr rustikal/blutig (Verstümmelungen, Vergewaltigungen, etc.), d. h. es ist für zartbesaitete Menschen eventuell nicht so gut geeignet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}