{
    "remaining_requests": 1656,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Martian/dp/B082BHWQCJ",
    "body": {
        "name": "The Martian",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Martian/dp/B082BHWQCJ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/414J3xG 7 L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Andy Weir",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Andy+Weir&search-alias=audible"
        },
        "brand": "Andy Weir&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 172469,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A brand-new production of Andy Weir’s modern sci-fi classic, narrated by the incomparable Wil Wheaton, and featuring bonus content from the writings of Mark Watney.Six days ago, astronaut Mark Watney became one of the first people to walk on Mars.Now, he's sure he'll be the first person to die there.After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he’s alive - and even if he could get word out, his supplies would be gone long before a rescue could arrive.Chances are, though, he won't have time to starve to death. The damaged machinery, unforgiving environment, or plain old \"human error\" are much more likely to kill him first.But Mark isn't ready to give up yet. Drawing on his ingenuity, his engineering skills - and a relentless, dogged refusal to quit - he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him?Wil Wheaton, who has lent his voice to sci-fi blockbusters like Ready Player One and Redshirts, breathes new life (and plenty of sarcasm) into the iconic character of Mark Watney, making this edition a must-listen for both longtime fans of The Martian and new listeners alike.BONUS MATERIAL: This edition includes the following extras:“Diary of an AssCan” - Mark Watney, new astronaut“I Made It!” - A happy letter to Mom“Car Trouble” - A somewhat sad letter to Mom“The Earthling” - A postscript. *Available for the first time in this recording Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16272"
            },
            {
                "name": "Adventure",
                "link": "https://www.amazon.com/Adventure-Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16273"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 59 minutes"
            },
            {
                "name": "Author",
                "value": "Andy Weir"
            },
            {
                "name": "Narrator",
                "value": "Wil Wheaton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 01, 2020"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B082BHWQCJ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#321 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #6 in Hard Science Fiction (Audible Books & Originals) #7 in Hard Science Fiction (Books) #9 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFWSYG6LMVUYRYQRXH6TU5I7LXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HA1EOCI5LQ2S?ASIN=B082BHWQCJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2014",
                "reviewTitle": "5.0 out of 5 stars You Had Me At, \"I'm pretty much ****ed.\"",
                "reviewText": "Log Entry: _The Martian_ Day 1I've never been much of a novel reader; I've always been the \"Why read the book when you can watch the movie\" type. I totally understand and acknowledge that it's a smart-ass attitude, and also recognize that it reflects a certain amount laziness and ignorance. Nevertheless, I'd say before I opened an account on Audible.com it had been at least 5 years since I last read a novel. I opened the account just over 3 months ago as a trial, because I spend 30-45 minutes each way driving to work, and frankly I had grown weary of all the NFL draft discussion, speculation, and subsequent analysis on sports-talk radio here in Jacksonville. Don't get me wrong. I think Blake Bortles is awesome and I can't wait to see him play for the Jags, but there are only so many ways you can analyze his throwing motion and potential before he ever plays an NFL game. Since I opened the account I've read [listened to] 4 books: one sci-fi thriller, one self-help, one classic and one educational. I really enjoyed the sci-fi so I checked the recommendations based on that book and found _The Martian_ by Andy Weir. I read some reviews, then read the first couple pages with the Amazon \"Look Inside\" feature, and I was immediately hooked. I also found that it was substantially less expensive to purchase the Kindle version first on Amazon, then purchase the Audible version in order to enable a feature called Whispersync. So I made the purchases and added _The Martian_ to both the Kindle and Audible libraries. I have no intentions of actually physically reading the book, but hey, money is money.I wanted to jump into the book immediately, but there was one obstacle. There is a podcast I listen to called \"This Week in Photo.\" I moonlight as a photographer and I love the show. It drops every Friday afternoon-ish and, based on the last handful of episodes, averages roughly 75 minutes, so I normally try to listen to it on the ride home from work on Friday and finish it on my Monday drive to and from work. Since I've been listening to books, I've completely ignored TWiP, so now I have a 12 episode backlog. That's roughly 900 minutes, or 15 hours of TWiP. I haven't missed an episode in at least 5 years, and I have no intentions of missing any of these. Frederick Van Johnson is the host of TWiP, and ironically it was his sponsor pieces for Audible that encouraged and convinced me to open the account. So Frederick, THANK you for helping me to discover Audible! And **** you for causing this massive backlog. :)I'm making myself a rule that I cannot listen to any more books until I get caught up on TWiP. If I estimate that each leg of my drive to work is 37 minutes, it would take roughly 24.3 legs to work through the backlog of TWiPs. I'll factor in an estimate of 5 legs of silence (call me crazy, but occasionally I enjoy driving to work in silence), 8 legs to get my sports-talk radio fix, and I'll generously add 8 \"random\" legs for phone calls, music etc, and I'm at just over 45 legs. Considering that that's 4.5 work weeks I'll need to allot time for 5 more TWiPs which will be an additional 10.1 legs. So all total I should be caught up in roughly 56 legs, or 28 workdays, or 5.6 weeks. It's a long time, but when I'm driving to and from work, time is something I have plenty of. Time to get busy listening to TWiP.Log Entry: _The Martian_ Day 33I finished all the TWiPs and I'm glad I did it. A few days ahead of schedule too. It helped that I had a few evening and weekend photography gigs that were a relatively long distance from my house, so I had plenty of extra time to listen. From now on Friday and Monday are designated TWiP days. Today I began _The Martian_. 10 hours and 53 minutes. I used the Audible app to download it to my iPhone and listened to it the entire way to and from work. 9 hours, 36 minutes remaining.Log Entry: _The Martian_ Day 34One quick note. You may notice that my name is Jennifer, but that is incorrect. I opened our Audible account under my wife's Amazon account, which she had before we were married. You aren't truly committed to your spouse until you share an Amazon account. My wife is not nearly the geek I am, so I wanted to clear up any confusion before I went further. My name is James. Nice to meet you.I came up with a solid plan today. I *really* enjoyed listening to _The Martian_ yesterday and I have no reason to believe I'm not going to absolutely love the rest of the book. On September 19 I'm leaving for Tuscaloosa to photograph the Florida/Alabama game. It's an 8 hour drive each way and I'll be driving alone. This book would be perfect to pass the time. After some serious consideration, I've decided I'm going to suspend all listening of _The Martian_ until Sept. 19. I listened to sports-talk radio today while I devised a plan for my next listen.Log entry: _The Martian_ Day 35I was real gung ho yesterday about The Tuscaloosa Plan. It's a stupid idea, and I'm not doing it. I listened to the book for the entire drive to and from work, then sat in the driveway for an additional 4 minutes waiting for a good stopping point. I'm finding myself looking forward to getting back into the truck to listen to the book. This is a really good read [listen]. If you have any recommendations for the Tuscaloosa trip, I'm all ears. 8 hours, 17 minutes remaining.Log entry: _The Martian_ Day 36I listened to sports-talk radio in the morning today, and _The Martian_ on the drive home. During the drive home I had to endure one of the mini-monsoon wind storms that have become a way of life on summer afternoons here in Florida. I drove past 3 crashes on I-95 and traffic was pretty slow. It took me 1 hour and 13 minutes to get home. Didn't even notice. Then I sat in the driveway for a few minutes to get to a stopping point. 7 hours, 1 minute remaining.Log Entry: _The Martian_ Day 37When I first opened our Audible account, I made a personal rule that I could only listen to books when I'm in the car or when I'm exercising. Even with the childish attitude toward books that I explained above, I still cannot bring myself to actually *LAY AROUND THE HOUSE* while somebody else reads me a book. Granted, I've done exactly zero exercise so far, but hey this is a book review, not a confessional of my exercise habits. This rule, combined with the lack of exercise, does however severely limit the amount of book consumption I do on the weekends. Today is Friday. I listened to _The Martian_ in the morning, and TWiP on the ride home. 6 hours, 25 minutes remaining.Log Entry: _The Martian_ Day 37 (2)Friday nights aren't what they used to be. Back in my younger days before marriage and kids, I would spend the evening at some loud disco tech, probably have way too much fun, and wake up Saturday morning feeling like I was hit by a Martian rover. These days we put the kids to bed by 8ish and I'm in bed by 11 or 12 and ready for an early Saturday morning. After the kids were tucked in I came back downstairs, clicked on the TV and plopped down onto my couch for some good old deceleration time.It's amazing how you can have over 200 channels and still not find a single thing to watch. Three's Company? Nope. Cubs game? Nope. Agatha Christie mystery? Nope. VH1 Behind The Music: Elton John? Maybe... Then I remembered, \"Wait a second! Didn't I buy the Kindle version of _The Martian_ too??\" My rule has always been that I can't listen to any books when I'm sitting around the house, but I never placed any restrictions on actually reading the books! If I'm willing to actually read a book, then that's a good thing, right?? When I first purchased the book, I never had any intention of physically reading it, but desperate times call for desperate measures. I went and found my wife's iPad (the kids' Kindles were on lockdown, and I don't know the password), opened the Kindle app, downloaded the book which was already sitting in the library, and what do you know? It placed me exactly where I finished listening to the book this afternoon. Isn't technology amazing??Log entry: _The Martian_ Day 40It was a super busy weekend and I didn't have much spare time, but whenever I did have a few spare moments, I tried to read a chapter or so. Jenn asked me twice this weekend if she should take my temperature. I declined both times. In total, I made it from page 152 to page 330 (out of 369). Today is Monday so it was a TWiP day. There's no reason I shouldn't be able to finish _The Martian_ tomorrow. Looking forward to it. 39 pages remaining.Log entry: _The Martian_ Day 41I woke up and went to work early this morning, just so I could get a jump on the book. I opened up the Audible app and started listening immediately. I remembered reading the words that I was listening to, and immediately realized I was out of sync. It seemed close enough though, so I decided it would be a good thing to just re-listen to some of the material as a refresher. Plus I was driving and didn't want to fumble with the phone. As it turns out, I listened to a total of 21 minutes before I got to any new material, and finished the morning drive with 56 minutes remaining. I'm sure the sync issue was something I did in my haste to start listening, but the fact remains; unless I have major traffic on the way home, it looks like I'll be altering my plans and finishing this book tomorrow on the way to work.Log entry: _The Martian_ Day 41 (2)I was left behind by my normal lunch group at work today. It wasn't their fault. I had implied that I was in for lunch but also said I needed to resolve a pressing issue and that it might take some extra time. They misunderstood and went on without me. Just to be clear, it was NOT their fault I was left behind. After a few minutes of scrambling around for another group, I finally came to the realization that I would be dining alone. Then I remembered the book. I had 56 minutes left in the book, and with a projected 37 minute drive home that evening, I would be left with 19 minutes of content, in what could potentially be the most exciting part of the book. So I decided to skip the cafeteria and go solo out to lunch, in order to close that gap and ensure that I will finish the book on the ride home. I chose an Applebee's that Google maps told me was a 9 minute drive from the office, plus I estimated 2 minutes each for exit and reentry into the parking garage. If I listened to the book from the office to Applebee's and back, I projected that I would have 34 minutes remaining in the book, a perfect amount to finish on the ride home. All went as planned and when I returned to the office I had 33 minutes remaining in the book. I finished out my work day, got back in the truck and immediately settled in for the finale of _The Martian_. There was some traffic but not much, and I completed the book with 7 minutes remaining on my drive home; just enough time to decompress and wrap my head around the whole of what I had just read and listened to._The Martian_ was without a doubt the most satisfying book I've ever read. I looked forward to every opportunity I had to listen to or read the book, and there wasn't a single point that I felt I had to trudge through or glaze over. I laughed and I cried.I hear a movie will be coming out in late 2015, starring Matt Damon and Directed by Ridley Scott. I can't wait see it, so I can be the guy that proudly boasts about how much better the book is.Highly Recommended, and not just for geeks like me.",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "/recon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIB3YNSOPWV4QDKTAC53K4UTZFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N2FCGBEWNZ9J?ASIN=B082BHWQCJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A Journey of Resilience and Wit",
                "reviewText": "\"The Martian\" by Andy Weir is an enthralling masterpiece that seamlessly blends science, humor, and human resilience into an unforgettable narrative. Set against the barren backdrop of Mars, this novel takes readers on a gripping journey of survival, ingenuity, and the unbreakable spirit of the human mind.From the very first page, Weir captivates readers with his meticulous attention to detail and scientific accuracy. Through the protagonist, Mark Watney, a botanist and mechanical engineer, Weir explores the challenges and complexities of surviving alone on the harsh terrain of Mars after being left behind by his crewmates. Watney's resourcefulness and problem-solving skills are on full display as he navigates through one obstacle after another, using his scientific knowledge and sheer determination to overcome each hurdle.What sets \"The Martian\" apart is its ability to balance scientific explanations with witty humor. Weir effortlessly infuses the narrative with Watney's sharp wit and sarcasm, turning potentially bleak situations into moments of laughter and levity. This unique blend of science and humor keeps readers engaged and invested in Watney's plight, rooting for him every step of the way.Furthermore, Weir's portrayal of teamwork and collaboration is both heartwarming and inspiring. While Watney may be stranded alone on Mars, he is far from forgotten. Back on Earth, a team of brilliant scientists and engineers works tirelessly to devise a plan to rescue him. The camaraderie and solidarity displayed by these characters serve as a testament to the power of human connection and the importance of working together in the face of adversity.Beyond its thrilling plot and engaging characters, \"The Martian\" also prompts readers to reflect on deeper themes such as perseverance, resilience, and the indomitable human spirit. Watney's unwavering determination to survive against all odds serves as a powerful reminder of the strength that lies within each of us, even in the most challenging circumstances.Weir's writing is crisp, compelling, and effortlessly draws readers into the world of \"The Martian.\" His ability to convey complex scientific concepts in an accessible manner is commendable, making the story both educational and entertaining. Whether you're a science enthusiast or simply a lover of great storytelling, \"The Martian\" has something to offer everyone.In conclusion, \"The Martian\" is a true masterpiece that deserves every bit of its acclaim. With its gripping plot, memorable characters, and thought-provoking themes, this novel is a must-read for anyone seeking an unforgettable literary experience. Andy Weir's skillful blend of science, humor, and humanity makes \"The Martian\" a timeless classic that will continue to captivate readers for generations to come. Five stars hardly do justice to this extraordinary book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cscottrun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2DYJ3NPC4KY2ZFLDBIWNG2T33Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RELURTBCJXY5V?ASIN=B082BHWQCJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars It was hard to give it 4 stars",
                "reviewText": "I'll admit it: I only read the book because of the movie, and at least one star is there because the book inspired the movie. The reality of The Martian, the book, is, the first person dialogue didn't feel real. It felt scripted. Then, suddenly, the novel slips into 3rd person to describe the accident on \"the ramp\" and I had no idea what was going on. Frankly, Weir's writing in 3rd person was far better than 1st person. Authors make choices and we never know why, good or bad, because art is a mystery. I just wish this book were a better mystery. I love the movie.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGML3PFTUW2AW5JB7VISAZJLJRHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN0EE44VIGX7X?ASIN=B082BHWQCJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Unique and immersive",
                "reviewText": "Weir knows how to craft an engaging and compelling narrative while being relatively simplistic with the way in which he writes. I appreciate his avoidance of overly descriptive details and just opting for what best gets the point across without having to detail every slight expression that a character makes or describe every bit of the environment. The narrative does well in balancing seriousness with lighthearted humor. It will have you go from cracking up to wincing at the misfortunes that plague Watney. As someone who doesn’t understand all the overly technical science terms, I was still able to enjoy what was being said. I really liked how Weir used Watney’s witty personality as a way to break the fourth wall and directly explain in laymen’s terms what is happening whenever the story delved deep into those scientific details.Overall, “The Martian” is a fantastic and enthralling read if you love Science Fiction. I’ll definitely be checking out his other works after this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lara Beadell",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 15, 2024",
                "reviewTitle": "Amazing amazing book",
                "reviewText": "Andy Weir is by far my favorite author. My favorite and first book I read from him was project Hail Mary, Artemis is great as well! This one was amazing of course. Anything from him is a great read, recomendable to anyone who remotely is interested in science-y stuff",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 28, 2024",
                "reviewTitle": "Resillience at its best",
                "reviewText": "A lone astronaut trapped on Mars with just a packet of seed potatoes to keep him fed. And he faces dust storms, oxygen explosions, failing equipment plus a huge journey across hostile terrain to stand any chance of being rescued. But he never gives up and despite hope fading fast he keeps generating imaginative solutions to seemingly intractable challenges. Great story, great film - inspiring.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 18, 2024",
                "reviewTitle": "GENIAL",
                "reviewText": "Interesante, emocionante y de fino humor e ironía",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on May 21, 2023",
                "reviewTitle": "Better than the movie",
                "reviewText": "Better than the movie for sure, and the movie is damm good . Full of science facts on an ultimate, epic science fiction drama",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GustavGustav",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on March 18, 2022",
                "reviewTitle": "Best book I have ever read in my life, hands down. PLEASAE BUY, Feel free to ask questions!",
                "reviewText": "FEEL FREE TO ASK ME QUESTIONS ABOUT THE BOOK!I would like to start this review with a note that is both a positive and a negative. I do not read any book, this is because I am never captivated and cant really empathize with the character and I never feel like I am there. But on to the review.\"About this version of the product*The book came to me in pristine condition it was truly breath-taking how beautiful the cover is. The book is well sized and honestly this is one of if not the most beautiful and durable books I've bought. There is also a map in the beginning which is awesome since I was cross referencing it so much which made me feel very immersed.*About the book SPOILER FREE PART*The Martian is the most well written, funny, serious, and emotional book I have ever read. This is in part because of the amazing writing. Mark Watney is a charismatic, smart, and resourceful man. In the face of adversity he always manages to crack a witty joke that always made me chuckle or just burst out laughing (No im not psychotic, i don't think). The writing makes you really feel like you know mark which is one reason why you empathize and really feel for him.The Atmosphere is great really selling the barren expanse and devastating loneliness of the Martian lands.*Note: I found that using some noise cancelling headphones and playing some white noise, like the wind, really helped to sell the effect of being on mars*. After only a few pages I had a very clear picture of how it looked at the HAB and I only wish I could take a picture of my thoughts.The story jumps between the perspectives of Mark Watney on mars, Nasa and JPL on earth, and the crew on Hermes the space station the went to and from mars on.*General Consensus*I should have added some photos, including my favourite quotes.This is the best book I've read. I'm so sad its over yet so happy I've experienced it. Andy Weir is my new favourite author and i will be purchasing more of his novels no doubt. Please do yourself a favour and read this book. I cannot recommend it enough. 1000000 / 10*LIGHT SPOILERS, what happens at the beginning*The book is about the main character Mark Watney's journey surviving mars after being abandoned there by his crew. What happened Watney and his crew consisting of, Lewis the commander, Vogel, Beck, Martinez, and Johanssen were six days into a 52 day mission on mars where they would gather science and conduct experiments when suddenly a large storm hit. The storm was so bad they had to evacuate but on their way to the MAV (Mars Ascent Vehicle) mark is struck by debris and is lost. The crew cannot find him and assuming he is dead abort without him. Mark wakes up and makes it back to the HAB, where he will live for the next (wont spoil how long) number of sols. He has a lot of problems along the way but manages to fix them in amazingly creative ways, I mean I cannot stress enough how glued my eyes were to the pages intrigued and worried about what would happen next.I wont spoil any more of the end because it would ruin how heart-breaking and heart-making (if that's a saying) a lot of the moments were.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RyKqrMmhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61vy1T2bOkL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}