{
    "remaining_requests": 1502,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Before-Coffee-Gets-Cold-Novel/dp/1335430997",
    "body": {
        "name": "Before the Coffee Gets Cold: A Novel (Before the Coffee Gets Cold Series, 1)",
        "price": "$11.15$11.15",
        "originalPrice": "",
        "rawPrice": 11.15,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Before-Coffee-Gets-Cold-Novel/dp/1335430997",
        "soldBy": {
            "sellerID": "AHDNQZ94ZBKE4",
            "name": "Goodwill Industries of Central Texas",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AHDNQZ94ZBKE4"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/414QKdkKn3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31ulZYVxWmL.jpg",
            "https://m.media-amazon.com/images/I/51qLioAyc6L._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Toshikazu Kawaguchi",
            "link": "https://www.amazon.com/Toshikazu-Kawaguchi/e/B07YB6PKSH/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill Industries of Central Texas",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 19313,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Before the Coffee Gets Cold... may explore similar ground to its predecessors in the genre, but it inventively limits the mechanics of its time travel to the confines of a small cafe, and is all the more resonant for it... the narrative is deeply moving.\" -Chicago Review of Books\"Heartwarming, quirky, and wistful.\" -Huffpost\"A charming novel about a mysterious Japanese coffee shop in which customers who sit in a certain chair can go back in time - but just while their coffee is cooling.\" -Star Tribune\"Kawaguchi... has a surprising, unerring ability to find lasting emotional resonance. Interwoven into what initially feels like a whimsical escape are existential conundrums of love and loss, family and freedom, life and death.\" -The Christian Science Monitor\"By cleverly weaving fantastic strands into what turns out to be an entertaining tale... Kawaguchi builds suspense from scene to scene, carefully selecting his narrative clues.\" -The Arts Fuse\"The story is gold. Before the Coffee Gets Cold is perfect for anyone who wants to feel connected right now.\" -BookReporter\"Before the Coffee Gets Cold is able to create pathos for the characters who yearn in earnest to change the past... Check out Kawaguchi’s work if you fancy a break from the inescapable reality of the pandemic.\" -The Mancunion\"Toshikazu lays out a system of time travel that is unconvoluted and beautifully simple... This charmingly magical novel is about discovering happiness despite the pasts that we desperately want to revisit.\" -The Harvard Crimson\"An affecting, deeply immersive journey into the desire to hold onto the past. This wondrous tale will move readers.\"—Publishers Weekly \"This is a sweet, fable-like tale about a magical seat in a cafe where you can, if you wish, go back in time… An odd read, but also a charming one.\"—The Sydney Morning Herald “A story about human relationships, missed opportunities and the enduring power of love.”—The Gryphon \"A thought-provoking and at times tear-jerking realization about what we would say if we could go back in time.”—Palatinate “It is full of soul, presented through clever world building and unfolding of its characters and relationships.”—Books and Bao \"A complete page-turner from the start to the end.”—Buzzfeed"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 15 hrs 1 min",
            "$3.99 delivery February 26 - March 1.",
            "Or fastest delivery February 22 - 26.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 9 hrs 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "*NOW AN LA TIMES BESTSELLER**OVER ONE MILLION COPIES SOLD**AN INTERNATIONAL BESTSELLER*If you could go back in time, who would you want to meet?In a small back alley of Tokyo, there is a café that has been serving carefully brewed coffee for more than one hundred years. Local legend says that this shop offers something else besides coffee—the chance to travel back in time.Over the course of one summer, four customers visit the café in the hopes of making that journey. But time travel isn’t so simple, and there are rules that must be followed. Most important, the trip can last only as long as it takes for the coffee to get cold.Heartwarming, wistful, mysterious and delightfully quirky, Toshikazu Kawaguchi’s internationally bestselling novel explores the age-old question: What would you change if you could travel back in time?Meet more wonderful characters in the next captivating novel in the Before the Coffee Gets Cold series, Before We Say Goodbye!Read the rest of the Before the Coffee Gets Cold series: Tales from the CafeBefore Your Memory Fades Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=25"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Science-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=16190"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Hanover Square Press; Original edition (November 17, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1335430997"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1335430991"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.56 x 0.91 x 7.35 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,359 in Books (See Top 100 in Books) #16 in Magical Realism #156 in Paranormal & Urban Fantasy (Books) #214 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 19,313 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Before the Coffee Gets Cold Tales from the Cafe Before Your Memory Fades Before We Say Goodbye Before the Coffee Gets Cold Series Book 1 Book 2 Book 3 Book 4",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/081d06e6-2bdf-4df8-a651-1b98eaa63cf5.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29e49d5f-9437-429a-9355-a6bb816ec5e7.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/780995c5-4a0a-42f4-af9f-db64ad4652ef.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ae02b57f-7832-4d91-bbd7-514a024cfb5f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1327ff1b-06ed-4416-8a46-c786d5803d10.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/75ee2c78-3d86-4c70-8e4e-9d170b0f5355.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f601dd9-4d6f-4e16-ac9d-80d8c3fa49db.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "maegan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVOMKN322HNVJZM5K563H3QZZIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZSOIS2OSJYQV?ASIN=1335430997",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Highly recommend",
                "reviewText": "My coffee got cold because I could not put this down. From the first page I was captivated. The stories flow seamlessly and keeps you interested until the very last page. I can't wait to read the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "stephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEO7XRFAFVZLNMYJRVKD5TEIFKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21V9I0LS136DC?ASIN=1335430997",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Before the coffee gets cold.",
                "reviewText": "Great story, characters well developed. The plots were interesting and I think more intertwined than on first read. The lesson of the novel was neatly wrapped up in the end and the story wasn’t dragged out like most books today. Would recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margaret Beauvois",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLFVIQVGPGRQYYYO7BIGRU44XPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KI20PV5IB6WB?ASIN=1335430997",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 11, 2023",
                "reviewTitle": "3.0 out of 5 stars Narrative needd revising",
                "reviewText": "This book of fantasy reads like the first draft of a one long, loosely connected short story to this reader. I felt the writer was improving her story telling with each chapter. The narrative in the first two stories sets the scene for the time travel but they pale in comparison with the third part of the book and its compelling emotional tale. I. Would suggest that one of the 3 stories, preferably the last one be the content of the whole book with more complete character development and more story instead of three rather incomplete and underdeveloped stories that are not very engaging.By keeping the best story, in my view, the last, the author wastes the time and interest of the reader with such a lot of focus on insignificant characters, such as the ghost woman occupying the chair and the lengthy description of the rules of the experience.and less touching story lines, resulting in the reader not really made to care or be empathetic to the characters. The early mentioned parts of the narrative do not figure importantly in the eventual telling of the most important tale of. A cafe with a magical chair.Perhaps. Something is lost in translation. But I would like the author to take the last story snd write a real fantasy about Kei basing her book solely around that very touching story.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPQ355EO6HSMGYQJEPHUJJYPXVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KZECR86O0E2M?ASIN=1335430997",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved it",
                "reviewText": "I haven't read a translated Japanese literary work in a long time and thought I'd pick this up because of all of Booktok/IG recommendations. The storyline of this book is brilliant -- and it stirred up some emotions. I read this book with J-drama-like imagery (something along the lines of Midnight Diner) -- it would be interesting to see this novel series be turned into a TV series or movie in the future. I will definitely pick up the other books in this series.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leida Holguin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2DBPVOMFQIR4CUO6QYTPOYATNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CXFYQE9NLE8B?ASIN=1335430997",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Loved it!",
                "reviewText": "This is a heartwarming, poignant, and somewhat mystical exploration of human relationships, regrets, love, and the concept of time. It is a reminder of both the constraints and the possibilities of time, presented through an unassuming yet magical setting - a small, traditional Japanese café.The story takes place in a Tokyo coffee shop, where patrons are given a unique opportunity: to travel in time. However, this is not your typical time-travel story. The rules are strict and somewhat peculiar: you must sit in one specific seat, you can't change the present, and you must return before the coffee gets cold. These rules add a distinctive charm to the story and provide a unique perspective on the concept of time travel.Kawaguchi writes four interconnected stories, each focusing on a different character who seeks to visit a moment in their past/future. The desires of these characters to rectify a regret, to reconnect, to communicate, are moving and relatable. Their narratives are carefully woven together, creating a tapestry that speaks to the interconnectedness of human lives.The writing style is simple, clear, and direct, allowing the emotions of the characters and the moral implications of their journeys to shine through. Some might find this style a bit too plain, and at times, it might seem that the narrative lacks the depth or complexity that could have made the characters more fully realized. However, it can also be argued that the simplicity of the prose mirrors the mundane yet magical setting of the café and the straightforward yet profound dilemmas the characters face.One aspect where the book could have been better is in its pacing. At times, the story tends to slow down, which might test the patience of some readers. Furthermore, while the book's concept is intriguing, the strict rules of time travel somewhat limit the exploration of its potential. However, it's clear that the author's intention was not to write a sci-fi story about time travel but rather to use it as a device to explore themes of regret, acceptance, and the value of the present.Overall, thought-provoking, touching, and unique read. It explores the human condition through a unique lens, offering readers a chance to reflect on their own lives and the choices they've made. Despite minor flaws, the book's emotional resonance, intriguing premise, and memorable characters make it a worthwhile read. This is a book for anyone who enjoys introspective storytelling, as well as those who appreciate a fresh take on well-worn themes.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJMSFBEB3PZWG5FWDVXEIJFH4RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JXUINWD8UER3?ASIN=1335430997",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Heart warming and emotional vignettes",
                "reviewText": "The story of the time travel inn is unique - the characters, both recurring and seemingly one-time visitors, quickly become people you care about. Those wishing to travel all seem to be seeking one last chance to see someone, and perhaps seeking a type of closure. What they receive from their journeys provides them with much more.This book evokes a very similar feel as the Netflix series \"Midnight Diner\".",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alycia pullen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE26PLDHFPPB3HL27OWVXYPIOSFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RIGR1MFLBVJJ?ASIN=1335430997",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 26, 2023",
                "reviewTitle": "3.0 out of 5 stars cute little read",
                "reviewText": "I heard a lot of mixed reviews for this book and it caught my attention immediately. I thought this was going to be a sad read for me since others said they cried their eyes out reading it. For me, I didn’t really get into it until about sixty percent through.I found it hard to know who was saying what at times. I feel like the characters were all thrown at me at once and it was hard to keep track of who was who until I got toward the end. The husband and wife part was sad but it didn’t make me cry.I would say this is still an emotional read and I think the message behind it is good. I would still recommend this read even though I gave it three stars!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V Garza",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOKT24MEVULIPGGJW5CPVGNIMUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQOS5VT5ULE7M?ASIN=1335430997",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Very Surprised",
                "reviewText": "I did not expect to get what I got from this book. Loved that it explored different relationships. I cried each chapter, some more than others.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 11, 2023",
                "reviewTitle": "OMG",
                "reviewText": "This book was brilliant! it had fantastic storylines and brought all the fellas that went with them.I would recommend this book to anyone who loves reading. I will pick up the sequel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hedy S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 1, 2022",
                "reviewTitle": "Una historia diferente",
                "reviewText": "No sabía de qué se iba a tratar este libro y entre más leía yo, más me gustó la manera en que está escrito. Yo quisiera poder regresar al pasado algunas veces a terminar algo que dejé inconcluso.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jordyn B WJordyn B W",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 16, 2024",
                "reviewTitle": "Beautiful",
                "reviewText": "Read book 4 first as I didn’t realise it was a series and was just looking for something new to read. Was brought to tears throughout. And the same can be said for this book, especially the last two stories 💔Will be buying and reading books 2 and 3 to read and thoroughly looking forward to them! 😁",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7168o1veD6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on February 13, 2024",
                "reviewTitle": "Great book",
                "reviewText": "super nice book to just get lost in the story, the links between people and the details of the environment.a bit sad, but happy sad :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "postman.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 11, 2024",
                "reviewTitle": "Ein sperriges Märchen",
                "reviewText": "Die Geschichte ist wie eine Sushimahlzeit. Sehr schweres Zeug aber leicht zu verdauen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.60",
                "sellerName": "LOBook",
                "sellerRating": "5"
            }
        ]
    }
}