{
    "remaining_requests": 1382,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Scythe-Neal-Shusterman-audiobook/dp/B06XH98TTZ",
    "body": {
        "name": "Scythe",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Scythe-Neal-Shusterman-audiobook/dp/B06XH98TTZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51sTGoEfd L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Neal Shusterman",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Neal+Shusterman"
        },
        "brand": "Neal Shusterman",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 16188,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Two teens must learn the \"art of killing\" in this Printz Honor-winning book, the first in a chilling new series from Neal Shusterman, author of the New York Times best-selling Unwind Dystology series. A world with no hunger, no disease, no war, no misery: Humanity has conquered all those things and has even conquered death. Now Scythes are the only ones who can end life - and they are commanded to do so in order to keep the size of the population under control. Citra and Rowan are chosen to apprentice to a scythe - a role that neither wants. These teens must master the \"art\" of taking life, knowing that the consequence of failure could mean losing their own. Scythe is the first novel of a thrilling new series by National Book Award-winning author Neal Shusterman in which Citra and Rowan learn that a perfect world comes only with a heavy price. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17466"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Science-Fiction-Teens-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17468"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 32 minutes"
            },
            {
                "name": "Author",
                "value": "Neal Shusterman"
            },
            {
                "name": "Narrator",
                "value": "Greg Tremblay"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 14, 2017"
            },
            {
                "name": "Publisher",
                "value": "Audible Studios"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B06XH98TTZ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,127 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #27 in Fantasy for Teens #89 in Teen & Young Adult Fantasy"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robin SnyderRobin Snyder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLX434YT5VYRRJZIONOCQN2BJHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JM8L31HE5QXX?ASIN=B06XH98TTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2016",
                "reviewTitle": "5.0 out of 5 stars What If....You Could be Death",
                "reviewText": "What if you could kill people and be Death himself.What if cancer and all the worlds diseases were healed and our understanding of how to heal everybody was so great that you could pretty much save anyone from practically anything that would have killed them.What if you could totally turn back the clock so that even though you are fifty-two or seventy-five you could look like you were in your twenties.What if there was nothing like war, poverty or hunger because artificial intelligence wasn’t a bad thing and it was better at running the world than the politicians and warmongers.**** The greatest achievement of the human race was not conquering death. It was ending government. Back in the days when the world’s digital network was called “the cloud,” people thought giving too much power to an artificial intelligence would be a very bad idea. Cautionary tales abounded in every form of media. The machines were always the enemy. But then the cloud evolved into the Thunderhead, sparking with consciousness, or at least a remarkable facsimile. In stark contrast to people’s fears, the Thunderhead did not seize power. Instead, it was people who came to realize that it was far better suited to run things than politicians. ****What if selected humans were now charged with culling the population and causing the deaths of those chosen. That they themselves had to choose who to kill and perform the execution becoming walking death.What if you were chosen to be apprenticed to one of these people and learn how to kill.What if…… well you get the gist.I used to read a lot of YA but after a while so much of it seemed the same. After the fifteenth time in the book someone released a breath they didn’t know they were holding or dollface’s eyes became darker (cuz that is what happens when you lust after someone) and she threw away everything special about herself for Jerkwad A I was over it. But then I found Neal Shusterman (NS). I think that NS is the king of what if…. He takes something from our society today and tweaks it extremely to the best/worst case scenario and TaH-DaH magic.Neal Shusterman has been on my autobuy list since I read his Unwind series which is my favorite completely YA and Dystopian series to date. While this is completely different in the world and the characters one thing remains the same. This book is for people who like to ponder the “what ifs” of the world and society. Like….*** To date, the oldest living human being is somewhere around three hundred, but only because we are still so close to the Age of Mortality. I wonder what life will be like a millennium from now, when the average age will be nearer to one thousand. Will we all be renaissance children, skilled at every art and science, because we’ve had the time to master them? Or will boredom and slavish routine plague us even more than it does today, giving us less of a reason to live limitless lives? I dream of the former, but suspect the latter. ****This story follows Rowan and Cirta as they start their internship of a year with Sythe Faraday learning everything there is to know about what it takes to be a killer of men. Which is less about learning how to kill, although there is some of that, and more about finding a path they can live with. Watching people die isn’t as easy as one would think. There are moral quandaries and it seems that not all the Scythes believe in the same things. Could it be in this society where a fraction of the people die compared to the Age of Mortality that there are things going on in the politics of death that might lead to disaster???As the story delves into the deeper politics of death and how the world might be changing I liked seeing how a few of the different Scythes treated the responsibility of killing and how each seemed to have a different process and a different way to deal with families and after affects. People are people and it seems that if you give some of them enough power corruption is bound to bleed through.There is a very small aspect of romance between a few characters but nothing overdone and it is definitely not the focal point of the story. The focal point is the society and how Citra and Rowan are trying to find a way to change it in their own way or else one might have to kill the other at the end of the apprenticeship.There is a little bit of time needed for the set up to the story but there was also enough going on that I never lost interest. I became emotionally connected to Rowan and Citra in their very different struggles and I really enjoyed all the world details that made be question if you could live forever would you really want to?This will be a duology or I prefer the term duet and I was extremely shocked but some of the happenings going into the final quarter of the book. But I adore where the book let off for the next installment and I am really excited to see what Shusterman has planned since there seemed to be some beginnings to a few things and with NS anything can happen and you will probably find your jaw on the floor when it does.***Rating Explainantion:*** This is probably closer to a 4.25 read but I kept thinking about it days later because I love the What If of the story and I know what NS is capable of so it is a 5 star read for me.",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/318FSjuqRYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/31UsFobuDIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41ms7qPHtUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51lvODngzIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason S Hornbaker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQPMD7CDDAFZLFVJH4OFHNXDLEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRZIYHZSW1M7P?ASIN=B06XH98TTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars A world of art in reading.",
                "reviewText": "Very engaging. To know that what if the world was this way. It leaves you wanting to continue the series...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mlefour",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2YJWB7UWU66PAA2T2AY2JCQRHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW5K47ECM4DTK?ASIN=B06XH98TTZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Mixed feelings",
                "reviewText": "An avid (female) reader, I was hesitant to buy a book written by a male. The world & concept is fantastic, I love the style of writing, and had many plot twists that kept me reading. However, if you’re looking for well built romance/love - you won’t find it here. You can tell it was not written by a female. Any romantic interaction/thought was an average of 2 sentences long, almost seemed like an after thought, and seemed rushed / straight to the point. “I want to kiss her. She lurched forward and kissed me.” (A basic example of what happens and how it’s described). While I enjoyed this book for its concept, the “romance” within it is barely romance & can be frustrating. It’s a great read once you block the “relationship” out!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Series Recaps and Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO26EOSKLP4EDXWXWCDVGJFIZ5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK4WZ4PLB4WVH?ASIN=B06XH98TTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2018",
                "reviewTitle": "5.0 out of 5 stars The perfect balance between entertaining me and making me think",
                "reviewText": "No spoilers in this rapid review of Scythe. I loved it and give it 4.5 stars. I read so much fantasy that any book set in modern times feels like a breath of fresh air, and Scythe is no exception. It blends genres, but I’d say the predominant one is dystopian. The premise is unique, timely, and thought-provoking.Scythe is set in a world where humanity has conquered every threat. All knowledge has been collected and stored in a database called the cloud (sound familiar?). 😉 The cloud—aka the Thunderhead—has used this cumulative knowledge to conquer all disease and prevent all accidents before they happen. Nanites in each person’s bloodstream control human emotions and can be triggered on a moment’s notice to curb spikes in anger.Since crimes of passion, disease, and accidents are absent and since aging can be reversed as often as a person likes, the world population burgeons in a very short time. Something must be done to curb this growth, and scythes are the eventual answer. Scythes are the only people not monitored by the Thunderhead and can thus glean excessive humans as they see fit (as long as they stay within their quotas, of course). Most scythes abhor the task and do it with a great weight on their shoulders and with great sympathy for the families left behind. But there are rogue scythes who enjoy what they do and try to make their gleanings as glamorous as possible.As the population continues to grow, more scythes are necessary. We meet our main characters when the honorable Scythe Faraday (who reminded me a bit of Dumbledore at times) takes on two new apprentices, Citra and Rowan. We see why Faraday’s drawn to them and then are immersed in the secret training and society of the scythes. Each chapter is prefaced with a journal entry penned by a scythe, so we get to be in the heads of a variety of characters in addition to our two mains.Shusterman struck the perfect balance between keeping me entertained and making me think, which is the formula for great dystopian, right? And what a journey he took me on with this tale! He presented quite a moral dilemma: How does a person maintain a sense of right and wrong when he or she truly lives above the law? And how do the scythes handle what they’re called to do each day without breaking?I enjoyed seeing both the inner turmoil and the rapid growth in Citra and Rowan as they go through their training. Their personalities are different, and they often respond differently to the same situation. Yet a bond slowly forms between the two of them. This bond is tested as they continue on the perilous journey to become a scythe. And all the while, they both question if this is something they even wanted in the first place.This story resonated with me for a number of reasons. As technology progresses by leaps and bounds every year and mankind attempts to conquer disease, hunger, and the other problems of the world, I found it fairly easy to envision a society like Citra and Rowan’s. It was interesting to see that even if crime appears to be conquered, Shusterman believes there will always be those who bend or break the law. He displays how human nature ultimately shines through. And I couldn’t help thinking of Christian ideals as I read. Can humans ever truly conquer evil? Or disease? And as soon as one problem is seemingly conquered, won’t others creep up? Shusterman suggests this is the case, and I tend to agree with him on this point. It seems perfection isn’t within human grasp without help from a higher power.Scythe was full of characters who are glaringly real. I loved Citra and Rowan equally. I enjoyed seeing the same new concepts through both of their eyes. And I liked their banter. So far my review has focused on the heaviness of the book, but there’s humor, too, and it often appeared in conversations between these two. Shusterman also presented some sardonic commentary on current American society and its frivolity (which made me alternately smile and cringe) as he built his dystopian take on the nation of MidMerica.What else can I say? I loved Scythe and definitely recommend it. It’s an exciting ride from beginning to end, with plenty of twists and turns along the way. I was truly surprised multiple times, and I loved every minute of it. The climax was exciting, providing the drama and answers I craved plus setting up Thunderhead, which is sure to be a great sequel.Search for 'Book Series Recaps' to read all of our reviews as well as our full book recaps!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Todd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMCVA3SZ2IMRJTTJDXICAYHQLKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B23U6BAWWS2F?ASIN=B06XH98TTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars excellent",
                "reviewText": "I didn’t know what to expect when I starting reading Scythe, but it far exceeded my expectations. I highly recommend this book to anyone who likes science fiction.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6LSVNGUFIQ5KFWYIXPRTWATSOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BBUQUYYRBZYM?ASIN=B06XH98TTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Dark but such a great read",
                "reviewText": "A dystopian future like no other I’ve read before! Such a great book and interesting world the author built. I also loved that a lot of plot lines didn’t drag on forever like some books. Can’t wait to read the next books in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GlowWorm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYGSMI2STS3EGTYYWYIB5REL3XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36VAO15IQ5QTC?ASIN=B06XH98TTZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars compelling read",
                "reviewText": "Thought provoking and surprising.I definitely want to read the sequel. I like that though there was corruption in the Scythedom, not all the Scythes were corrupt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Medley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMBON5SYFLNPBUBDGFRXCC2Y6DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PHSZHOGBI67E?ASIN=B06XH98TTZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Harbingers of death",
                "reviewText": "Decent young adult book that has a very interesting plot and world. Don't expect complex characters but read this if you enjoy reapers. Ill be finishing the series as its kept me entertained so far.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joan Nord",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 25, 2022",
                "reviewTitle": "If Salvador Dali had written novels, they’d be like this",
                "reviewText": "The book draws you in immediately when a scythe, whose job it is to glean-aka cull- humans, shows up at teenage protagonist Citra’s door for dinner. The twist comes further into the story than usual, and puts dual protagonists Citra and Rowen in a direction neither were expecting. There’s lots of set up, but the worldbuilding makes it interesting. Great plot. Even genre bending. Pretty much unputdownable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 18, 2022",
                "reviewTitle": "¡Realmente no puedes dejar de leerlo!",
                "reviewText": "Desde que leí la reseña supe que tenía que leer este libro. Ahora que lo he empezado me he dado cuenta que fue una excelente elección, la historia te atrapa, y te deja reflexionando.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cyclingman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 19, 2023",
                "reviewTitle": "Very good book",
                "reviewText": "It is rare that a book hast a gripping story and is so well written! Gives one a lot of to think about life and death!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bhawana Bisen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 12, 2022",
                "reviewTitle": "It's a good introduction to the trilogy.",
                "reviewText": "The book makes a good start with a detailed introduction to the supposed \"utopia\" it is meant to portray. I found the portion of the book a little boring where one is reading through the development of the characters in the story; although it's not very uncommon as one tends to tilt towards the \"big picture\" elements in a dystopian fiction. The book picks up well as soon as it familiarizes the reader with the nature of its characters, and taking them through some jaw-dropping plot twists, the book finishes itself quite well. It doesn't compel one to pick up part 2 right away, but it surely does make one inquisitive enough to do that someday.P.S.: I did pick up Thunderhead the very next day I finshed reading The Scythe, and I must say, it's such a high jump from The Scythe! Truely amazing!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 24, 2022",
                "reviewTitle": "Super saga",
                "reviewText": "Livraison rapide et conforme. Premier livre d'une saga qui ravit notamment les adolescents...et les plus grands.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}