{
    "remaining_requests": 1496,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dune-Frank-Herbert-audiobook/dp/B000R34YKC",
    "body": {
        "name": "Dune",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dune-Frank-Herbert-audiobook/dp/B000R34YKC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/517 uE Ek2L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Frank Herbert",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Frank+Herbert&search-alias=audible"
        },
        "brand": "Frank Herbert&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 91529,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Soon to be a major motion picture directed by Denis Villeneuve, starring Timothée Chalamet, Josh Brolin, Jason Momoa, Zendaya, Rebecca Ferguson, Oscar Isaac, Javier Bardem, Dave Bautista, Stellan Skarsgård, and Charlotte Rampling. Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, who would become the mysterious man known as Maud'dib. He would avenge the traitorous plot against his noble family - and would bring to fruition humankind's most ancient and unattainable dream. A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction. Frank Herbert's death in 1986 was a tragic loss, yet the astounding legacy of his visionary fiction will live forever. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=16272"
            },
            {
                "name": "Space Opera",
                "link": "https://www.amazon.com/Space-Operas/b?ie=UTF8&node=271585011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "21 hours and 2 minutes"
            },
            {
                "name": "Author",
                "value": "Frank Herbert"
            },
            {
                "name": "Narrator",
                "value": "Scott Brick, Orlagh Cassidy, Euan Morton, Simon Vance, Ilyana Kadushin, Byron Jennings, David R. Gordon, Jason Culp, Kent Broadhurst, Oliver Wyman, Patricia Kilgarriff, Scott Sowers"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "December 31, 2006"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B000R34YKC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Space Operas #1 in Space Opera Science Fiction (Audible Books & Originals) #9 in Fantasy (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9F91NG5C47UV?ASIN=B000R34YKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2019",
                "reviewTitle": "5.0 out of 5 stars Zealous mother & enterprising son go camping. He should earn a Boy Scout merit badge in survival.",
                "reviewText": "The science-fiction novel, Dune, written by Frank Herbert and published in 1965 might just as easily have provided the precursor literary materials for a \"Hallmark Home for the Holidays\" screen-play as it would have for any of several \"Star Wars\" episodes. It is a meaningful, versatile, very adaptable novel. The book is good and offers deeply religious connotations. It provides historical significance, dating back from ancient times, and suggests serious implications for the future, involving social and political stability. Ostensibly, the story follows a doting, overly-protective, single mother who wants only what is best for her son. She takes him on a camping trip, in order for him to win the equivalent of a \"Boy Scout\" merit badge in survival skills. Basically, his task is to provide food for the family in the wilderness. If he can find the right bait and put it on a hook to catch a fish for dinner, he all but assures himself of attaining the merit badge he seeks. The problem is, they soon discover that the lake has all but dried-up. The waters have receded, or they have been diverted, somehow. Hence, he has to hunt for alternative sources of food. Simple enough, you think. Except, you remember that the novel is pure science-fiction. Things get hairy in a hurry and out of hand very rapidly, and the various outcome scenarios become numerous and unpredictable. The story-line becomes even more interesting later on, when the son decides to attend his first rodeo. Perhaps, the single mother has mistakenly slipped a bottle of \"Mescal\" Mexican tequila into her back-pack, instead of the \"cooking Sherry,\" which she had intended to bring along on the trip \"for medicinal purposes.\" While cooking over the proverbial open campfire, she must have been sipping some form of potent alcoholic beverage, causing her to dream, and possibly, hallucinate. The manufacturers even put a little grub-worm into the bottles of this particular tequila, out of an abundance of caution as a warning; or for aesthetic reasons, I imagine. Not too unlike, the \"green dragon\" or the \"genie in the bottle,\" appearing on the label of a libation otherwise known as absinthe. In her dreams, or perhaps because of her vivid imagination, then, the harmless, one-inch, standard-size grub-worm is transformed, becomes magnified, or otherwise enlarged by the mysterious processes of her mind, into a gargantuan monster 5,000 times its normal, original size. This is where the science-fiction part enters the story. Thus, a potential whirl-wind romance is transmogrified into something completely out of this world. It evolves into a tantalizingly amazing and profoundly appealing tale of adventure. Again, I'm reminded of the classic \"Star Wars\" saga, which first appeared in movie theaters twelve years after the novel, Dune, was first published. In the course of natural events, the mother of the impressionable, young lad fondly reminisces about living in their former home far, far away by incredibly great distances of measurement, somewhere over the curved spectrum of colorfully diffracted light-beams known as a rainbow, beyond eons and eons of cosmic clouds in the time-space continuum, having a normal climate, an abundance of rainfall, mild weather, with clear lakes and cool-running streams, something quite radically different from the dire circumstances in which they presently find themselves. She smiles graciously and is pleasantly reminded of swimming in the ocean like an Olympic athlete; the outdoor public showers on the beach; washing the salty water out of her tousled and tangled hair, rinsing her skin clean and vibrant again; noticing sand in her bikini panties. But now, however it came to pass, she is much more immediately concerned about gang violence and her youth blasted into oblivion by laser-light guns. Even worse, their exposure to harmfully volatile cartridges of electronic cigarettes; risking addiction; and, ultimately, being \"vaporized\" by an atomizer. Vanishing into thin air. R. Royce rests on a long, weathered wooden pier, the wharf overlooking the inter-coastal water-way from a hidden cove. Here, he goes by the nick-name, \"Johnny Questar.\" He's looking into the deep, clear, greenish-tinted water for a big spear-fish. He recollects parts of a song from way back when, with lyrics that go vaguely something like this: \"In the year 2525, if mankind is still alive.... there will be no husbands, you'll have no wife...\" \"In the year 3535, the Propaganda Prince rules the people for thousands of years.... his ego is huge, and there's nothing too terrible that he fears...\" \"In the year 4545, robots and androids are running wild.... they can achieve anything, except bear a child...\" \"By the year 7510, God should make an appearance by then, and have something important to say... for it's a time of evolution and Judgement Day....\" \"By the year 9595, if mankind is still alive.... there will be no more wars, you'll experience no strife...\" \"After 10,000 years have come and gone, if mankind is still alive, we have won....we'll be comfortably re-planeted.... you'll mostly feel euphoric and contented...\" Thus, he sang the words he remembered and made up the rest as he went along. He could have easily researched the internet for the song , written by Rick Evans in 1964 that became a number one hit by the duo \"Zager and Evans\" in the summer of 1969 and topped the music charts in both the U.S. and the U.K. He should get it on CD. \"We'll move to another galaxy and start all over again, my friend...in this promising age of enlightenment,\" sang Cornelius Korn, chiming right in. People in the area know him by the popular name, \"George Jetsam.\" \"How is it, that people like us always wind up going to strangely exotic destinations such as the Florida East Coast and on remote desert islands?\" asked Alexis Sue Shell, now answering to the name \"Wilma Flint.\" \"Probably because we've adapted so well to hot air, palm trees, sandy and salty water. The natives are friendly and they generally mind their own business. We love the care-free life-style here. Plus, whenever we're ready, we can sail away.\" said Raquel Remington, presently known as \"Betty Revelle.\" \"Anything on the agenda for today?\" asked Royce, suddenly business-like, ever the practical one, and exuding confidence. \"I've located the two grandsons from New Jersey,\" said Korn. \"We're meeting them in a nice, quiet setting on the beach this very afternoon, at \"Hooligans.\" \"I have good news and bad news for you,\" confided Royce, later, at the restaurant. \"The good news is you are no longer obligated to pay Mugsy Malone what you owe him, since he's met with an unexpected and untimely demise. You probably read about it in the newspapers.\" \"Oh, how did that happen?\" asked Kashmir, one of the wise guys he'd met in New Jersey at Mugsy Malone's Atlantic City hotel months ago, feigning innocence. \"What's the bad news?' \"Some weeks before his sudden departure, Mr. Malone authorized my security firm to make good on the debts his more prolific business associates owe him. In other words, we're here to collect on what you and your cousin, Nehru, haven't yet paid him. With expenses and interest, the amount due today comes to half a million. Can you cover it with cash, certified cashier's check, or a bank-to-bank transfer? \" \"We're on vacation in South Florida,\" said Nehru. \"We don't normally carry that kind of cash around with us.\" \"Your grandfather was very cooperative. He advised us that you're doing quite a lucrative business in the vicinity. He said that you're involved in the tourism and travel industry. You've been making money hand over fist here,\" said Royce. He'd certainly done his homework on the pair's financial dealings. \"All we have available at the moment are 100 Super Bowl tickets, 100 reservations to Disney World, 100 tickets to Universal Studios, and four re-possessed luxury tour buses, formerly owned by country and western musicians,\" said Kashmir. He obviously wanted to settle their differences amicably and put an end to the matter at once. Smart. He actually wanted to avoid risky, protracted conflicts with formidable adversaries. \"That should cover your overdue account debt. We humbly accept your generous offer,\" said Royce, indicating Kashmir's metallic briefcase containing legal documentation, tickets, and bus keys. \"Thanks for putting us in the tourist business. Trusted associates from the firm will contact you shortly to iron out any details and finalize the transaction.\" He calmly strolled away, taking the briefcase with him. Kashmir and Nehru felt a sense of relief that there were no complications to derail their plans. \"Chump change,\" George Jetsam said later that evening, as they all began to relax and unwind in their hotel suite. \"But it pays the bills and keeps peace in the family.\" \"I think you handled the situation admirably, Royce--I mean, Johnny,\" said Betty Revelle. \"Looks like we're back in business again,\" said Wilma Flint. \"Yes, indeed! Travel agencies to contact, tickets to sell, and busses to lease,\" said Johnny Questar.",
                "reviewVotes": "49 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "161803398",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVR7XX7565DRUFEU25GNBHD6SVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS44N61G23TCV?ASIN=B000R34YKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Be gone Neil Gaiman!",
                "reviewText": "I bought both the paperback and hardcover editions in 2024. The paperback is a huge disappointment, a very bad printing and you should avoid it. The hardcover is pretty good, but why is Neil Gaiman's name front and center on the cover? What the heck Neil, go write your own books, stop sticking your name on other people's. The story of course is the wonderful messiah fantasy for grandiose self-obsessed teenagers that we all love so much. I think the books in the series after the first one are actually much more interesting to the adult reader, so if you've only read the first do yourself a favor and get the rest of the series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jsarino",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQ3ETZD4JJM2HCSAWBWCNWXUSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YYWN61Z6FS52?ASIN=B000R34YKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A classic in every sense of the word",
                "reviewText": "If there's a must-read in science fiction (perhaps more science fantasy in the genre), I would recommend Frank Herbert's Dune. Well ahead of its time when it was released, I feel it's one of those books that's so rich in mythology and themes that it may require a second read to take everything in. It's also a bit of a slow burn, so if you like that literary style, this book is for you. I would also encourage you to read Dune Messiah and Children of Dune as it expands on the world-building from the first book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF3VLFBXFVR2G6U6RHQPW4HLAHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XLCEJWLVQZI9?ASIN=B000R34YKC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2020",
                "reviewTitle": "4.0 out of 5 stars ‘Dune’ Paved the Way for Surfer Proverbs and ‘Star Wars’ Alike",
                "reviewText": "A Bene Gesserit proverb: “When religion and politics travel in the same cart, the riders believe nothing can stand in their way.”I have to be honest, as a contemporary consumer of sci-fi film, small screen works and books, Frank Herbert’s 1965 Dune starts out slow. To be clear, I’m talking about the first half of some 800 pages. The reason why I stuck it out, though, is because I know the saga gets better as it continues (with Children of Dune being arguably the favorite). Known as one of the original sci-fi novels, I approached it like I would any classic piece of literature. And you know what? I’d put Dune in my personal cannon of classic lit because of it’s heavy influence on sci-fi … everything. That’s right, not even Star Wars would exist without Dune.Herbert, a (sometimes struggling) freelance writer with a passion for ecology and a streak of utopian futurism, wrote Dune when he was almost 40 years old. At the time, sci-fi readers generally liked their stories short but this paperback was almost 900 pages. Not surprising, Dune wasn’t an overnight success but it’s popularity grew in the 1970s and 1980s.Dune is set in a dry, distant future, where warring noble houses are kept in line by an interstellar empire. The noble duke Leto (heir apparent Paul Atreides’ father), head of the House Atreides, is forced to move his household from their perfectly good home planet to the desert planet of Arrakis (also known as Dune). The climate on Dune is practically inhabitable to the layman. Water is so scarce that whenever its inhabitants go outside, they must wear stillsuits, which capture body moisture and recycle it for drinking (it’s beyond nasty).In a nutshell, the whole thing is a classic you killed my father and I’m going to get revenge coming of age story. Everything else revolves around the hot commodity on Arrakis, which is basically a very powerful and desired drug: Spice (melange). This cinnamon-scented substance is made from excretions of killer 1,000-foot sand worms (yes, I had a lot of Tremors flashbacks reading this book), gas, then exposure to the sun — but to mine it is very dangerous because said worms don’t like noise. At all.The drug is crazy addictive but it’s also everywhere in small doses, so everyone that lives on or visits the planet has to stay, or else suffer fatal dopesickness. For empathic people, it helps explore the limits of personal identity and the mind’s relationship to the body. Daily use extends the lifespan by hundreds of years. Paul’s intellectual state (already Jedi-like due to his Bene Gesserit training) is heightened by the spice, causing some pretty spot-on nuggets of wisdom. Fear is a mind-killer.“Fear is the little death that brings total obliteration. I will face my fear I will permit it to pass over me and through me. And when it has gone past me I will turn to see fear’s path. Where the fear has gone there will be nothing. Only I will remain,” Paul reminds his mother at one point. While commentary on fear is serious and quite important to ponder, I’m reminded of the advice from the late Patrick Swayze’s character in Point Break: “Fear causes hesitation. And hesitation causes your greatest fear to come true.”By 1984 we had our very own Dune movie, directed by David Lynch (I’ve yet to see it but to be fair Lynch didn’t even like the cut that was released). Critics say an even better Dune movie came out later: Star Wars. Desert planets, evil emperors, a boy with a destiny, warring noble houses and a princess guarding spice — all things borrowed from Dune. There are mental Jedi powers like the Bene Gesserit, and even moisture farming like the Freman. Academics have written entire doctoral thesis on the topic.What’s next? Well, I’m waiting for the new Dune feature film to come out (prob not until late 2020), directed by Dennis Villeneuve. A feat that’s proven difficult today due to the original book’s heavy influence on so many well-established sci-fi classics like Star Wars. Consequently, it’s been rumored difficult to get the screenplay right. But in July 2019, Herbert’s son Brian (who co-wrote prequels to the Dune saga after his father’s death) said he’s seen and is pleased with draft four of the screenplay … in the meantime, I’m reading Dune Messiah.And drinking a tall glass of ice water.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CraigB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4TTZFQX2LE2LLECFOOLDY543UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WLOILY51HRW6?ASIN=B000R34YKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars One of my favorite books of all time",
                "reviewText": "I first read Dune back in the mid 1970s when I was in either 6th or 7th grade. I do know it was before I started high school. I was immediately drawn into the world Frank Herbert created. It was an annual read for me for a long time. I started this re-read when the 1st of the new movies was getting ready for release. I only read up until the movie ended. I started the 2nd half a few weeks ago in preparation for the 2nd movie.I still love this book, and the rest of Frank's series. Ghe stuff his son continues, not so much.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JZB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 5, 2024",
                "reviewTitle": "Same cover as paperback",
                "reviewText": "Decided to get the Hardcover because it was the same price as the paperback and felt like a no brainer - was hoping based on the sample preview it was the 1999 \"Science Fiction's Supreme Masterpiece\" cover, but it's the same design as the paperback in a hardcover format (which I was happy about given some of the other possibilities)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabriel Barrientos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 10, 2022",
                "reviewTitle": "La entrega pudo ser mejor, pero el libro es excelente.",
                "reviewText": "El libro es de buena calidad, puede que la pasta sea algo delgada pero yo no la calificaría de deficiente. Sin embargo , la entrega lo ha maltratado un poco, tenía unos dobleces relativamente ligeros en la parte superior de la portada, y yo soy muy meticuloso en cuanto al estado de mis libros, así que ese aspecto no me agradó. En cuanto al libro, no hace falta decir que es un clásico, y el hecho de que sea toda la saga editada tan bien, le da mucho valor en mi opinión. El libro también tiene un poco de material extra, aparte de la novela en sí. Tales como un mapa, terminología, notas cartográficas, y notas sobre la ecología y religión en Dune. Ese aspecto me ha encantado, es algo que no esperaba ver y sinceramente me agradó mucho. Recomiendo el producto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Belinda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on February 11, 2024",
                "reviewTitle": "Interessant boek",
                "reviewText": "Geweldig boek",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 10, 2024",
                "reviewTitle": "One of the best sci-fi books that I've read",
                "reviewText": "Frank Herbert has a great writing style that keeps you engaged while also explaining the complicated concepts of world building. A must read for any sci-fi lover.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michihustler ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 28, 2023",
                "reviewTitle": "Great book",
                "reviewText": "Perfect for collection",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}