{
    "remaining_requests": 28297,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cleaning-Microfiber-Hardwood-Washable-Refillable-Bottle/dp/B0C64RQPCN",
    "body": {
        "name": "Spray Mops for Floor Cleaning Microfiber Floor Mop for Hardwood Floors Wet Dust Mop Flat Mop Floor Cleaner Mop with 4 Washable Pads 440 Ml Refillable Bottle for Wood Floor Tile Laminate Vinyl Kitchen",
        "price": "$19.99",
        "originalPrice": "$22.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cleaning-Microfiber-Hardwood-Washable-Refillable-Bottle/dp/B0C64RQPCN",
        "soldBy": {
            "sellerID": "AKQSOPTJ3A90Q",
            "name": "SUNLIKE",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AKQSOPTJ3A90Q&asin=B0C64RQPCN&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CH4HWK1P"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C64RQPCN",
                "variationName": "Size",
                "variationValue": "Gray Mop with 2 Blue Pads+2 Gray Pads",
                "price": "$19.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C6SR4RX1",
                "variationName": "Size",
                "variationValue": "Purple Mop with 4 Grey Pads",
                "price": "$17.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51vaQ-v6KKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51xE814jniL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5181sZXhGvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515byGpyqlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LRByBBm1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B1RC47QIblL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the PAPCLEAN Store",
            "link": "https://www.amazon.com/stores/Papclean/page/DA4C48E9-C528-4DC3-8B7D-789873B3FB68?ref_=ast_bln"
        },
        "brand": "Papclean",
        "merchantInfo": "SUNLIKE",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 462,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 8 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "No Need for Bulky Buckets - Papclean 2nd Generation spray mop combines quality craftsmanship with comfortable design to make cleaning a breeze. No need to dip the mop head in the bucket or wring it out, the floor mop features a large 440ml water tank, simplifying the mopping process, saving time and energy. Use less water and detergent and take up less space.",
            "Lightweight & Reliable Mop - No cords or batteries required, this hardwood floor mop is a must-have for anyone looking for a more efficient and comfortable way to clean floors. Highly durable aluminum pole and impact-resistant plastic mop head provide strong support. Ergonomic grip and flexible 360-degree swivel mop head glide and get into nooks and crannies. Compact design makes the wood floor mop usable on any hard surface such as laminate, tile, wood, ceramic, vinyl floors, windows, ceilings.",
            "4 Reusable Mop Pads - Papclean wet mop chooses more economical and earth-friendly microfiber pads for better cleaning results. They're soft on hardwood floors, yet powerful and absorbent to remove sticky spills and dirt, grime, dust. They won't leave scratches or damage, puddles or puddles on your floors. 4 washable pads (2 blue and 2 gray) allow you to switch between dry and wet mopping so you always have a clean mopping pad on hand. Besides, these pads are suitable for Swiffer PowerMop.",
            "Quick Assembly - Instead of traditional elastic bands or flaps, microfiber mop pad attaches easily to the mop head with velcro for a snug fit. Just snap the parts into place and follow the steps to attach the mop head and mop body together. Fill the bottle, pull the trigger to release the spray mist, and start mopping effortlessly. Upgraded sprayer ensures long-term use. Perfect for any occasions, kitchen, bathroom, etc.",
            "Practical Scraper - Considering the cleaning of pads, we have equipped this spray mop with a multi-functional scraper, which can be used in different cleaning occasions, so that you can remove stubborn stains and tangled hair from the mop pad before throwing them away into the washing machine. Portable design and hanging hole reduces storage space and meets travel needs.",
            "Free Choice of Cleaner - You may be tired of using commercial cleaning solutions, or you may be feeling dizzy of choosing a cleaner. Now you can add your self made cleaners that are pet and child safe to our floor cleaner mops. More choices for you: vinegar, essential oil, DIY as you like.",
            "Buy with confidence - 12-month worry-free warranty and technical support. If you have any questions about our flat mop, our professional technical team is willing to help you. Warm Tips: Do not add boiling water or strong acidic floor cleaners to the spray mop's water tank. Clean the floor cleaning mop's bottle after use. Please keep the silicone plugs on the bottle cap."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Industrial & Scientific",
                "link": "https://www.amazon.com/industrial-scientific-supplies/b?ie=UTF8&node=16310091"
            },
            {
                "name": "Janitorial & Sanitation Supplies",
                "link": "https://www.amazon.com/Janitorial-Sanitation-Supplies/b?ie=UTF8&node=317971011"
            },
            {
                "name": "Mopping Supplies",
                "link": "https://www.amazon.com/Commercial-Mopping-Supplies/b?ie=UTF8&node=3278156011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/Commercial-Mop-Accessories/b?ie=UTF8&node=3278157011"
            },
            {
                "name": "Mop Handles",
                "link": "https://www.amazon.com/Commercial-Mop-Handles/b?ie=UTF8&node=3278158011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "16.89 x 4.69 x 4.57 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.76 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "PAPCLEAN"
            },
            {
                "name": "ASIN",
                "value": "B0C64RQPCN"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "440HUI2HUI2SLPB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 462 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,947 in Industrial & Scientific (See Top 100 in Industrial & Scientific) #10 in Commercial Mop Handles"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "PAPCLEAN"
            },
            {
                "name": "Color",
                "value": "Gray"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor, Ceramic, Tile, Plastic"
            },
            {
                "name": "Handle Material",
                "value": "Aluminum"
            },
            {
                "name": "Head Material",
                "value": "Microfiber"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Papclean Spray Mops for Household Cleaning Are you stuck in the old days of heavy mop buckets and multiple water changes every time you mop? Welcome to the era of the convenience mop. The Papclean 2nd generation spray mop is easy to use, no wire or batteries required. Just fill the bottle, pull the trigger to spray water mist, and then mop the floor, freeing your hands. It's so easy that a child can do it.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c826899-d828-4c98-9fc7-3eab57828088.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Practical Scraper Cleaning pads at a breeze We've taken your concerns about throwing dirty mop pads straight into the washing machine into consideration, so we've included a multi-purpose scraper to deal with the dust mop pads. The different edges of the brush can be used to scrape excess moisture, hair and dirt off the cleaning pad. In addition, the spade head is perfect for removing stubborn dirt on the ground. Give full play to your imagination and use it according to your needs. 440 ML Refillable Spray Mop Bottle One water injection for whole house cleaning No need to dip the wet mop head in the bucket or wring it out. Add two teaspoons of cleaning solution to the 440 ml spray bottle to bring your floors to life. You can make your own cleaning solutions, add pet- and child-safe cleaners, and are no longer tied to fix solutions. Save time and energy with this 440 ml spray bottle. Premium Microfiber Mop Pads Mopping is so easy Papclean's floor mop pads are made of dense microfiber. They are reusable and machine washable over 100 times. Wider pads reduce floor cleaning's time and mop faster, combining superior cleaning power with long-term cost savings. Equipped with 4 pieces of pads for easy replacement and different areas' cleaning.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca5aff1c-018c-496f-a9e4-932a9d652975.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca886d44-4de6-4d9c-aa32-1c40c665608b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bbb4654e-87ec-4280-bce4-df4ed7ec9e26.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "360° Rotating Mop & Easy to Assemble Installation Step- 1. Insert the pole until the button pops up. 2. Connect mop body to mop. 3. Insert the bottle with strength. 4. Stick the pad on mop head.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1efa30d4-90e6-4a83-9ac4-d6a573fe892b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Papclean Dust Mops for Hardwood Floors Upgraded wood floor mop that can be well operated with one hand- The joint of the spray mop adopts a special anti-leakage process, which improves the problem of water leakage compared with other microfiber mops. The ergonomic handle is comfortable to hold, and the modified liquid release mechanism makes floor cleaning easier and simpler. Lightweight kitchen mop/trapeadores para limpiar piso that glides easily over tile- Are you struggling to lift furniture to mop? Our dust mop reaches all the tightest spaces without lifting furniture. How does it do it? Thanks to the 360° swivel mop head design, there are no more dead spots for cleaning. Use this hardwood floor mop to easily clean dust from sofas, tables, under beds or in corners. No more sore muscles or back strains from stretching or twisting your body to reach difficult areas. A strong and durable bathroom mop as a frequently used daily necessities- Papclean strictly controls the quality in all parts. The floor mop pole is durable aluminum alloy, while flat mop head is made of impact-resistant ABS plastic. Features high-quality design and construction so this hardwood floor cleaner mop can last for a long time. A dust mop for hardwood floors that won't leave watermarks after mopping- The heavy duty mop is equipped with an ultra-fine sprayer that strictly controls the water output. Just lightly press the floor cleaning mop trigger to produce a fine fan-shaped mist. Laminate floor mop cleaning pads are made of microfiber fabric, which have excellent water absorption capacity and will not leave streaks or puddles after use. More convenient spray mop for floor cleaning- Selected dust mop pads are machine washable and reusable, plus the velcro design makes it easy to install or remove. The strong adhesive force makes the water spray mop pad firmly fixed even if it encounters stubborn dirt and requires strong scrubbing, so you don't have to worry about falling off during use. After mopping the floor, you only need to tear off the wet mop pad and put it in the washing machine to get a clean pad, reducing the trouble of hand washing.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fba279f0-1edb-4248-8ae4-e9d0e1050a44.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Papclean Wet Mops for All Floor Type Cleaning Whether you use it wet or dry, the Papclean cleaning mop is a good choice. It is suitable for hardwood, laminate, tile, ceramic floor, home, office, almost all cleaning situations, saving time and effort. When used dry, the microfiber mop pad can remove dust, hair, and fine particles on the floor, while when used wet, it can easily remove residual stains and liquids. 4 microfiber cleaning pads are soft and gentle, you don't have to worry about any scratches or damage to the floor.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c10bfdcb-4398-46dc-9fc4-3ef853e1d985.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Papclean Micorfiber Cleaning Pads for Better Mopping Package includes： 1 x spray mop 1 x 440 ml refillable bottle (14.87 oz) 1 x multifunctional scraper 4 x microfiber pads（2 blue + 2 grey) Warm tips: Do not add hot water or strong acid floor cleaners to the water tank. Each spray mop will be checked the spray function before shipment. If you find some water drops in the water tank, please notice that it's normal. All THE ITEM YOU RECEIVE IS NEW. Clean the mop bottle after use if adding cleaner. Please keep the silicone plugs on the bottle cap. If there is any problem, we are here to help you.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07122f75-ad08-4a9c-a57f-a9debf39832c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c826899-d828-4c98-9fc7-3eab57828088.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca5aff1c-018c-496f-a9e4-932a9d652975.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca886d44-4de6-4d9c-aa32-1c40c665608b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bbb4654e-87ec-4280-bce4-df4ed7ec9e26.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1efa30d4-90e6-4a83-9ac4-d6a573fe892b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fba279f0-1edb-4248-8ae4-e9d0e1050a44.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c10bfdcb-4398-46dc-9fc4-3ef853e1d985.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07122f75-ad08-4a9c-a57f-a9debf39832c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWC3JLQ42GZIFQPZPOFTZSQVKHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TE5J57VWA6WH?ASIN=B0C64RQPCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars a replacement for my shark works just fine",
                "reviewText": "kind of missed the battery operated trigger due to arthritis but it works just fine and dandy and you can put whatever solvent you want in it. you don't have to buy the pre-made bottles",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFLBUPHMNH6PUPDGBBGJDJZI33Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPXHKVTEAZZCN?ASIN=B0C64RQPCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Value",
                "reviewText": "Love it. Excellent price. Easy to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andres & Hannah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYUK7YVC335STL6P5GAWF7BEMFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34U8WOU9OUKYP?ASIN=B0C64RQPCN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars It works!",
                "reviewText": "Honestly, very cheaply made product. BUT, it does the job, it was cheap, good for the environment that you can reuse the pads. You can take it apart to put away into a smaller space. You can change the cleaner solution depending on what you’re cleaning. Easy to put together. I say it’s worth it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Me Me",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQRAZJIDZ65MDHYOX3OKQB6U75Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WVRSTBS2Z9H4?ASIN=B0C64RQPCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars You got to get 1",
                "reviewText": "What I like about it is how light it is and how much cleaning solution it holds. I love it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "beverlywilliams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6YFHT6ST6WIHDITBTNIODZUEDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QRN3DX8PENLS?ASIN=B0C64RQPCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Love it",
                "reviewText": "👍🏾",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raider of the Oak Groves",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIVBIDBMQPZXME7GJJ5CFBJNUCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VLH8EJI63J0X?ASIN=B0C64RQPCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "Works great and at a great price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Web Geek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW5KFASV7PSVOLABGIQZS4UVGTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCILEX6CZJWM8?ASIN=B0C64RQPCN",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 3, 2023",
                "reviewTitle": "1.0 out of 5 stars Doesn’t spray at all",
                "reviewText": "I bought this because of the good reviews. This thing hardly sprays at all, and when it does, it’s about 5 minutes between a good spray. I’m having to carry around a spray bottle of water and vinegar to spray the floor and then use the mop. Would not buy again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Captamazing",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE46DCCFWWZJJB2ZGY3T3IKNGRBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KV3FBDSCMKDR?ASIN=B0C64RQPCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Works as advertised!",
                "reviewText": "This mop works nicely! The microfiber pads clean up well, too. No issues!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Naor.Cra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 26, 2024",
                "reviewTitle": "Such a game a changer!",
                "reviewText": "It might be a bit \"sad\" that I am at an age where I find something like a mop exciting, but this is the case with this one!I don't usually like mopping, mainly because it gets messy due to the filthy water involved in the process. However, with this mop, you just \"top up\" the floor with your favorite liquid cleaning product, and off you go.In fact, this mop is so easy and fun to use that I am randomly using it to clean the tiles throughout the day, since there is something satisfying about using it.Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gautier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 25, 2023",
                "reviewTitle": "amazon est très rapide dans l'envoi des colis",
                "reviewText": "balai très pratique pour les personnes qui ont mal au dos",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sophie Kingsley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 12, 2024",
                "reviewTitle": "Perfect",
                "reviewText": "For the price you can’t complain! Easy to set up and does what it says!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Crafter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Ease of use",
                "reviewText": "The water bottle is a bit difficult to fix on at first but loosens quite quickly as advised not to leave it on.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 5, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "So easy to use it, the velcro feature couldn’t be better! Really good value",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}