{
    "remaining_requests": 28344,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Spray-Mops-Microfiber-Floor-Cleaning/dp/B0BFVKVY1B",
    "body": {
        "name": "Wet Mops with 5X Washable Pads Spray Mops for Hardwood Floor Cleaning- MEXERRIS Wood Floor Mops Dust Mops with 2X Bottles Commercial Home Use for Hardwood Laminate Vinyl Tiles Wood Floor Cleaning",
        "price": "$28.99",
        "originalPrice": "",
        "rawPrice": 28.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Spray-Mops-Microfiber-Floor-Cleaning/dp/B0BFVKVY1B",
        "soldBy": {
            "sellerID": "A1NSW0S6HDMWY4",
            "name": "USTHAIRSON",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1NSW0S6HDMWY4&asin=B0BFVKVY1B&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C3GJ2TP2"
        ],
        "asinVariationValues": [
            {
                "asin": "B07V5TNCKH",
                "variationName": "Color",
                "variationValue": "Cyanine",
                "price": "$20.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41nlNu5I64L._SS36_.jpg"
            },
            {
                "asin": "B0BFVKVY1B",
                "variationName": "Color",
                "variationValue": "Green",
                "price": "$28.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41uE4kEjHJL._SS36_.jpg"
            },
            {
                "asin": "B09D7NR6VC",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$24.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41mYfo5LnDL._SS36_.jpg"
            },
            {
                "asin": "B0BFWCN5MH",
                "variationName": "Color",
                "variationValue": "Purple",
                "price": "$30.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41QKQzDRuRL._SS36_.jpg"
            },
            {
                "asin": "B08GR52X1P",
                "variationName": "Color",
                "variationValue": "Red",
                "price": "$22.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WQ6-o8CBL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "6",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 20% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41uE4kEjHJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51ThjZRypPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sOky Ao0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51k3MoXELnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BTGq4rUpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71Uv7Y-pc L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the MEXERRIS Store",
            "link": "https://www.amazon.com/stores/MEXERRIS/page/E2DDC7FF-8AA3-4760-B7B4-F57D96A138D3?ref_=ast_bln"
        },
        "brand": "MEXERRIS",
        "merchantInfo": "USTHAIRSON",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 30010,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "2 Pack 410ML Refillable Bottles - Mexerris spray mop comes with 2 pcs anti-leakage refillable water bottles, does not have the problem of leakage after using. because you can get 2 replacement water tanks, you can add your different functional cleaner or water into bottle for all floor types in your bathroom, living room, kitchen, like Hardwood, Laminate Wood, Ceramic Tiles, Vinyl. And don't have to worry about wasting any of the solution. DO NOT add strong acid and boiling water into bottle.",
            "Five Replacement Mop Pads -microfiber pads pick up everything off the floor (grab dirt, dust, pet hair, crumbs and moisture) and leave things looking very nice. So very easy to use good mop to have. spray mop can quick spills on the floor or anywhere in your home that you may need it.5 pcs mop pads are machine washable, when you are done cleaning work, you don't have to throw them away. you can throw them in the wash and then you have another one ready for next time.",
            "Additional Scraper with Comb & Hanging Up Design- The microfiber spray flat mop coming with the multi-function scraper, you can press water onto the spray mop pads, remove dirt and stains on the floor / tiles. The scrubber got 4 different sides to it, a rubber portion in middle, a flat portion and little teeth on the side for different cleaning task. Floor mop has a cushion handle so you can just put it up on your wall. It doesn't take up any space.",
            "360° Swivel Mop Head & Upgrade Velcro Design- The wet mop head does move all the way around so you can move it and adjust it as you need to, and you can get into all those little grooves, easily get around bulky, heavy furniture and cleaning the floor under furniture or corners. The mop head is velcro design, just stick the mop pads to mop base, go ahead to mopping.",
            "Don't Soaking Floors- the mop is very easy to assemble and it just snaps the handle one by one. Put some water or cleaner in the bottle, and you have a little trigger on the handle, adjust squeeze the trigger and it sprays out and it doesn't leave bunch of streaks in your floors. Harmless to floor, reusable microfiber pads go for all floor types. So, you don't really need to use a whole lot of cleaner or water.",
            "Buy with Confidence: We’d love hear from you about our product, Regardless of positive side or negative side, we are working on doing it better! If you are not fully satisfied. Please don’t hesitate to contact us if you need help.[Small Tip: ①Each spray mop has be spray function tested before sent,a small amount of water may remain in bottle is normal phenomenon.②Please clean the water tank and spray nozzle of the floor mop after use to keep it clean and protected.",
            "MEXERRIS Tips:③Please don't fill boiling or impurity water, strong acid,alkali detergent into the bottle of the wet mop.④Please fully dilute solutions with plain water,because concentrated solutions may corrode mop internal parts or some floor types. ⑤ There are two small silicone plugs on the bottle cap of our spray mop. Please be careful not to lose them when cleaning the bottle to prevent the bottle from leaking."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Industrial & Scientific",
                "link": "https://www.amazon.com/industrial-scientific-supplies/b/ref=dp_bc_aui_C_1?ie=UTF8&node=16310091"
            },
            {
                "name": "Janitorial & Sanitation Supplies",
                "link": "https://www.amazon.com/Janitorial-Sanitation-Supplies/b/ref=dp_bc_aui_C_2?ie=UTF8&node=317971011"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/Commercial-Cleaning-Tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3310260011"
            },
            {
                "name": "Dusting Tools",
                "link": "https://www.amazon.com/Commercial-Dusting-Supplies/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3310262011"
            },
            {
                "name": "Dust Mops",
                "link": "https://www.amazon.com/Commercial-Dust-Mops/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3310265011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6\"L x 6\"W x 7\"H"
            },
            {
                "name": "Item Weight",
                "value": "1.98 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "MEXERRIS"
            },
            {
                "name": "ASIN",
                "value": "B0BFVKVY1B"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "410ML-FLOOR-MOP"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 30,010 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#338 in Industrial & Scientific (See Top 100 in Industrial & Scientific) #1 in Commercial Dust Mops"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "MEXERRIS"
            },
            {
                "name": "Color",
                "value": "Green"
            },
            {
                "name": "Surface Recommendation",
                "value": "Wood,Hardwood , Marble,Tile,Laminate, Ceramic，Floors, Wall, Ceramic, Tile,Windows"
            },
            {
                "name": "Handle Material",
                "value": "Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Spray Mops for Floor Cleaning with 2 Refillable Bottles & 5x Microfibre Mop Pads Check Out MEXERRIS Wet Mops Store and Find the Best Spray Mop for You. Whether you need a deep clean of your floor or a quick dusting, Our mops for hardwood floor cleaning are the perfect cleaning equipment for the job. Spray mops for floor cleaning uses soft microfiber pads to dust or wipe the floor clean.MEXERRIS spray mop with washable pads have machine-washable microfiber pads, and these mops for floor cleaning have inbuilt tanks where you can store water or cleaning solutions for use. If you are looking for the best wet mops for floor cleaning for your home, you have come to the right place.We have upgraded the best spray mops hardwood floor mop available for purchase. MEXERRIS Floor mops based on quality, durability, and ease of use.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed6168fe-d805-4b47-8ef0-3d8f8d5faba7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Microfiber Hardwood Floor Mops for Floor Cleaning- More Time To Enjoy Your Life Why you Choose MEXERRIS Spray Mop for Floor Cleaning? Floor compatibility: floor compatibility should be confirmed before buying a wet mops for floor cleaning. MEXERRIS microfiber spray floor mops are compatible with all floors, so even if you change your floor type in the future, you don’t need to change your microfiber wood floor mops/dust mop/ spray mop.Durability: In addition, how long your spray wet mops will last (that is, their durability) is an essential factor to consider. An average Mexerris spray mop has a lifespan of 2 to 3 years or more if used properly and well maintained. For a long-lasting floor mops for cleaning, a good option would be a microfiber cloth.Extra features: Microfiber hardwood floor mop with machine washable pads, as it will provide you with easy maintenance.Our microfiber mops for hardwood floors are reusable and come with wood floor mop pads replacement and 2 refillable water tank that make easy for you to clean your pads and keep mopping your floor.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55e5b22d-437f-4e2f-8a40-e609f98163d0.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "MEXERRIS Mop for Hardwood Floor Cleaning-Excellent Microfiber Mop",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/94fb51ff-67ba-4737-a0e3-79a868a7e2fc.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "How to Install Mops for Floor Cleaning",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d7c4024-b9a2-45ef-87c2-79cb996e6afd.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Floor Mops for Floor Cleaning- Show You Something Different What Cleaning Solution Do You Put in a Spray mop? Many people prefer to go DIY on cleaning solutions. However, the best cleaning solutions for your spray mop are natural disinfectants that give excellent results without leaving stains or residues behind. The most common cleaning solutions include white vinegar and essential oils mixed with warm water. Other frequently used ones are alcohol, baking soda, and sometimes liquid dishwashing soap. Lightweight Wet Mops for Floor Cleaning The first thing on your mop list is how lightweight mop is. microfiber dust mops need to be moved around. Hence, their ease of movement must be highly considered. Therefore, a lightweight microfiber spray mop is ideal. That way, injury possibilities are reduced and even a pregnant woman or a kid will have no stress using it. MEXERRIS lightweight spray mop will be easier to maneuver and store, providing you a hassle-free cleaning time. How Do You Use a Spray Floor Mop? There are tricks to using spray mops that make you look like a mop master. To begin with, ensure the floor is dust-free to avoid pushing residues around the house. Next, lightly wet the microfiber pad and wring it out in the sink before attaching the head of the mop over it. Spray a section of the floor with a cleaning solution using a spray bottle and start mopping back and forth. When you begin to notice left-behind residues, it’s time to rinse the pad in the sink. Repeat the process until the floor is super clean. It’s as simple as that!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/106ddaae-9877-414b-a420-45e8f577fe07.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74f782e1-cddc-45be-9eae-97ae2f93ded5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b28780a-356f-4efb-9f32-b085a631acd5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "MEXERRIS Microfiber Spray Mop for Floor Cleaning YOU DESIRED IT MEXERRIS Mops for floor cleaning wet spray mop FAQ Q.Can you store the cleaner in the tank when not in use?A. Please clean the water bottle and spray nozzle of the spray mop for cleaner after use.Q. Can I make my own cleaning solution for my spray mop?A. Yes, and many people do. In fact, it’s recommended that you create a dilute solution with plenty of water. Harsher solutions could damage internal parts of the mop and very strong concentrations can be too abrasive for some floors.Q. There is a small amount of water in the floor mop with spray, does it used?A. If there is a small amount of water in the spray mop bottle of the wet mop when you got it, please do not worry, that's because every spray mop set will be tested by manufacture before sent to you.Q. Can more microfiber pads be purchased for MEXERRIS microfiber spray mop for floors?A. You can search the keywords\"MEXERRIS Microfiber Spray Mop Pads Replacement\" on amazon.Q. Can more Spray floor mop bottle be purchased for this floor mop with spray for cleaning ?A. yes, you can do an Amazon search (search keywords\" MEXERRIS 410ML Replacement Bottle for Spray Mop\")for the mop.Q. Does the sprayer allow for several sprays in a row?A.It’s a pull trigger system like a spray bottle. You can pull And spray as much and you’d like.Q. How do you fill the bottle with cleaning solution?A.You can just pull the solution container out and it pops out. It is held in place by a rubber O ring. Then you can unscrew the top of the bottle cap and fill it than push/pop it back in.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1b8013a-b381-4b38-ac29-afd87b7564b8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Spray mop with 2 bottle 4 pads Microfiber Mop with 4 Pads Floor Mop with 4 Pads 2 Bottle Hardwood Mop with 3 Pads Mop with 3 Pads 2 Bottle Wood floor mop with 4 washable pads Recommendation New Arrives Mop Hot Sale Hardwood Floor Mop New Arrives Wet Mop Popular Spray Mop Popular microfiber mop New Arrives Floor Mop Mopping occasion House cleaning House cleaning House cleaning House cleaning House cleaning house/commercial cleaning For Wet and Dry Use Both work Both work Both work Both work Both work dust mop/ dry mop Washable and Reusable YES YES YES YES YES YES Bottle capacity 410ML+410ML 410ML+410ML 410ML 410ML+410ML Surface Recommendation SAFE ON ALL FINISHED FLOOR SAFE ON ALL FINISHED FLOOR SAFE ON ALL FINISHED FLOOR SAFE ON ALL FINISHED FLOOR SAFE ON ALL FINISHED FLOOR SAFE ON ALL FINISHED FLOOR",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed6168fe-d805-4b47-8ef0-3d8f8d5faba7.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55e5b22d-437f-4e2f-8a40-e609f98163d0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/94fb51ff-67ba-4737-a0e3-79a868a7e2fc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d7c4024-b9a2-45ef-87c2-79cb996e6afd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/106ddaae-9877-414b-a420-45e8f577fe07.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74f782e1-cddc-45be-9eae-97ae2f93ded5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b28780a-356f-4efb-9f32-b085a631acd5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1b8013a-b381-4b38-ac29-afd87b7564b8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c4b269e-e645-46f1-8ce3-0716f439e088.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4977d27-63f5-4d9f-9ba9-998ec0a4a567.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5f21d8d5-10b7-4930-afd2-e3b6e70376c4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9515e77f-07af-4682-ab9c-62143595aacd.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7633ca0-de53-4e14-83e2-4b5ae6885295.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f2bb1d26-0bff-4480-90a0-e32e23d7c13f.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Countrycrafter123",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXZBFWLAHUSBEBV4G2V6A5MMBWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TMTMQTYWET6L?ASIN=B0BFVKVY1B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great value",
                "reviewText": "Was skeptical to but something for the price, but I am very pleased. Super easy assembly, works well. No batteries required. Cleaning pads are very absorbent and easy to toss in the washing machine. The handheld scrubber worked great as well. Super convenient for pet accidents and other cleanups without the cost of one time use similar cleaners like swiffer.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3KHUUE7KHUD4I3HYJW2SMTFPEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R469TO4UQDWM4?ASIN=B0BFVKVY1B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this mop",
                "reviewText": "I switched from a Libman mop to this one because Walmart messed up and didn’t give me the cleaning bottle that went with it plus the mop ended up not working. Instead of waiting on Walmart to fix their mistake I ordered this mop And I’m so glad I did! I love everything about it, the weight, the spray the pads. It’s just the best, I’m constantly cleaning my floors so this is such an easy convenient mop for me.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catherine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGALKTRKJL5PGV5BML632O3777EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF9B3JW5H0J13?ASIN=B0BFVKVY1B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Lightweight and easy to use!",
                "reviewText": "We live full-time in our 35 ft motorhome and have two cats so we use this as dust mop & a wet mop. It works well and I like that I can make my own mopping solution. The bottle is a little thin so I'm hoping it will still last a long time. Doesn't take up a lot of space when not in use.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "srajo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGVH4IFAQWZCU72IYNM3YNU3G5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T2EPJRASF06V?ASIN=B0BFVKVY1B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "I really love this mop! It's easy to assemble and use. The pads just go right in the washer when I'm done. My husband likes the little Scrubber tool for hard to get off spots too. I would definitely recommend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teresa P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESLVHQWE3MSJ56ICFXTATJWFLUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4EWE869SJ6W0?ASIN=B0BFVKVY1B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars lightweight",
                "reviewText": "Didn't want to pay the extra over time for the consumables on a Swiffer WetJet and this was just as nice. It's nice to be able to use my own spray formula or water as I choose. Though the first one of mine was missing a pad and I had to get a replacement. Works well on picking up liquid spills but if it's a puddle, you're better off using a towel first. And if you need some hard scrubbing, do that first and use this to clean up the aftermath. It does feel a little \"breakable\" but I'm not one to try to break thin pipes so it'll last me just fine.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bad battery",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQNKMAMGT3NX75CWHOE4QFFHLTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J5OJFOLG27I9?ASIN=B0BFVKVY1B",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "3.0 out of 5 stars Not what i hopef for.",
                "reviewText": "Lets start with the cleaning pads. There too Denice to clean the floor well. They mostly push dirt around. Then the bottles they give you are too small and when they get close to empty the sprayer wont work. The handle snaps snd pops the entire time your using the mop. I would not buy it again thats for sure.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2I77NHQUOJDWBTWFCLWQNJVUZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S2FX8YJGMA1I?ASIN=B0BFVKVY1B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this mop!",
                "reviewText": "I love this mop for several reasons. I am able to use it with my own cleaner, which is a cost savings and allows me to use it on multiple floors using different cleaners. It also came with two extra mop pads, and a small plastic scrubby tool that is attached to the pole, which is quite handy and convenient to use. This is a great mop for quick cleanups. I would not probably use this for a deep cleaning, however, it is great for every day quick cleanups.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIH7ZTZHGOT7WMA4W5A6PTFYZCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HQRZABMW21J0?ASIN=B0BFVKVY1B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "4.0 out of 5 stars It works, but it is not meant for the long run",
                "reviewText": "The hunt for an easy way of mopping my apartment led me to this compact mop. Although it does what I wanted it to do, I'm only giving it four stars as I do not believe the quality is all that great.Overall Performance (4/5): This mop is practical and does its job nicely. It's been a useful tool for cleaning my small apartment. Its narrow shape and the fact that it does not need a bucket, make it easy to use in small spaces.Build Quality (3/5): Yes, it works, it will do its job, but I do not think that it will last long due to its quality. The individual parts appear to be very cheap, and I have some reservations about how this mop will continue to hold up over time. When I was putting it together, I kept feeling like I was going to snap it. It is not very sturdy. However, This is not a deal-breaker for me since I'm moving soon and won't be keeping it for long.Longevity Thoughts (3/5): If you're looking for a cleaning solution that's going to last, I don't think this is it. I am moving soon, and it is cheaper than Swift and other brands, so I really did not need something to last, but if you do, I would probably steer away.In conclusion, this lightweight mop effectively cleans up spills, dust, messes, and what have you, and it should be fine for temporary use. However, if you're looking for something that will last longer and be more reliable, you may want to consider spending a little more money.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2024",
                "reviewTitle": "Impressed",
                "reviewText": "I previously used a Vileda spray mop, but decided to try this one as it was a bit cheaper. I have been thoroughly impressed as it feels sturdy. It’s actually more compact which I find easier to store. It came with plenty of extra parts like extra fluid reservoir and extra pads so that I have one while I’m washing the others. I would definitely recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2024",
                "reviewTitle": "Good mop",
                "reviewText": "Easy to put together. Great for wiping up after the dogs paws when it gets mucky outside! Easy enough for anyone in the family to use. I love how it came with multiple cloths and they're easy to change out.Good for the kids as there's no big bucket of water to make a mess with.Downside is, if tipped over the cleaning solution may leak out a little bit.Overall happy we bought this. We use it daily.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Magda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 7, 2023",
                "reviewTitle": "Escoba",
                "reviewText": "Me gusto, funciona muy bien, es práctica, liviana y buen tamaño.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Quetzalli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 31, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Es muy práctico, fácil de usar y las mopas se lavan fácilmente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DebbieDebbie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "Mop",
                "reviewText": "I love this mop it comes with three pads that are washable . It can be refilled with what ever solution u would like to use. It is well built and convenient way cheaper than a swifter mop that can't be refilled.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Biat+phwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71DEvr3SUAL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}