{
    "remaining_requests": 28367,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bona-WM710013432-Microfiber-Floor-Mop/dp/B00DVHIF06",
    "body": {
        "name": "Bona Premium Microfiber Floor Mop for Dry and Wet Floor Cleaning - Includes Microfiber Cleaning Pad and Microfiber Dusting Pad - Dual Zone Cleaning Design for Faster Cleanup",
        "price": "$19.97",
        "originalPrice": "$21.97",
        "rawPrice": 19.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bona-WM710013432-Microfiber-Floor-Mop/dp/B00DVHIF06",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C4PKRY8V"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C2QKC5YJ",
                "variationName": "Style",
                "variationValue": "Pet",
                "price": "$21.97",
                "variationImageURL": ""
            },
            {
                "asin": "B00DVHIF06",
                "variationName": "Style",
                "variationValue": "Standard",
                "price": "$19.97",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-OdIOX5HL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41hS3dCJXNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PggGvMozL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51T69BmjI2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41h4XbUFoLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QK 6GFj6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/614lIE8aqcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bona Store",
            "link": "https://www.amazon.com/stores/Bona/page/12CDE1A8-A858-46CE-A823-8DB44D32DED3?ref_=ast_bln"
        },
        "brand": "Bona",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 10441,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 14 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MICROFIBER MOP FOR FLOOR CLEANING: Durable microfiber floor mop with telescoping handle and extra-large head with a dual zone microfiber cleaning pad and dusting pad with electrostatic design; Safe for all hardwood and hard-surface floors",
            "EXTRA-LARGE FOR FASTER CLEANUP: Extra-large mop head cleans 40% faster than the leading competitor",
            "REUSABLE HOUSEHOLD ESSENTIAL: Durable, lightweight design with an easy locking strip to quickly attach the machine washable microfiber cleaning pad and dust mop pad to reuse over and over; Rubberized corners to reduce damaging baseboards and furniture",
            "SUPERIOR DUSTER: Bona Microfiber Dusting Pad with electrostatic design traps dust, dirt, and pet hair, wherever it settles",
            "INCLUDES: One Premium Microfiber Floor Bona Mop with extra-large mop head, one Bona Microfiber Cleaning Pad, and one Bona Microfiber Dusting Pad"
        ],
        "description": "The Bona Premium Microfiber Floor Mop, with a durable telescoping mop handle and extra-large mop head, is an all-in-one mopping solution to clean and reveal the natural shine of your floors. With the included machine-washable Bona Microfiber Mop Pad and Bona Microfiber Dusting Pad, the Bona Premium Floor Mop cleans hard floors effectively by removing dust, dirt, and pet hair, revealing beautiful floors. The extra-large mop head delivers quick and effective mopping or dusting and the flexible rubber corners protect baseboards and furniture from dings and scratches. Designed to attract unwanted dust, hair, and particles from your floors' surface, the Bona Microfiber Dusting Pad reaches wherever dust settles. The Bona Microfiber Cleaning Pad and the Bona Dust Pad are made of soft microfiber fabric that won't scratch or damage your floors and are reusable and machine-washable, making the Bona Mop a sustainable addition to your home's cleaning supplies. Trade out your traditional spin mop and bucket for this all-in-one convenient floor mop for shinier floors. First sweep with the Bona Microfiber Dusting Pad to attract and lock away dust, pet hair, micro-particles, and common household allergens from your floors' surface. Next Spray your floor with your desired Bona Cleaner (Hardwood, Hard surface, or Power Plus) and mop with a microfiber pad to clean and reveal the natural shine.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245503011"
            },
            {
                "name": "Wet & Dry Mops",
                "link": "https://www.amazon.com/wet-mops/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2245507011"
            },
            {
                "name": "Dust Mops",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=23537023011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "29.25\"L x 5.63\"W x 2\"H"
            },
            {
                "name": "Item Weight",
                "value": "1.4 Pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Bona"
            },
            {
                "name": "ASIN",
                "value": "B00DVHIF06"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "WM710013573"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 10,441 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,579 in Health & Household (See Top 100 in Health & Household) #8 in Household Dust Mops"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "Warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Bona Premium Microfiber Floor Mop - Includes Microfiber Cleaning Pad and Microfiber Dusting Pad - Dual Zone Cleaning Design for Faster Cleanup"
            },
            {
                "name": "Brand",
                "value": "Bona"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor"
            },
            {
                "name": "Head Material",
                "value": "Microfiber"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11c8b7fc-50c9-471f-9252-94746c347753.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f12453c7-c614-4489-93fd-6b5fee49a5cd.__CR0,0,971,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eeaf04e8-d134-4ee2-b432-31a3d9c2f419.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9001303a-0ca9-4bb4-86a0-794a7e89942d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/359a1e73-ea1b-46e8-853c-27633872e7b1.__CR0,0,971,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Chad Walsh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5IAUMCNVRN4W4C23CCXONYF42A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HPHIOL0HDJOR?ASIN=B00DVHIF06",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Bona has truly raised the bar!",
                "reviewText": "I recently purchased the Bona Floor Mop, and it has exceeded all my expectations! As someone who is meticulous about maintaining a clean home, I have tried numerous mops over the years, but the Bona mop stands out as a true game-changer.First and foremost, the build quality is exceptional. The sturdy construction ensures durability, and the ergonomic design makes it easy to maneuver around furniture and tight corners. I appreciate the thoughtfulness that went into the design, as it has truly simplified my floor-cleaning routine.One of the standout features is the microfiber cleaning pad. It effortlessly captures dirt and grime, leaving my floors sparkling clean with minimal effort. The pad is also machine washable, adding to the product's overall convenience and eco-friendliness.The Bona cleaning solution is another highlight. It effectively tackles stubborn stains and leaves a pleasant, subtle fragrance behind. I appreciate that it's safe for use on a variety of floor types, including hardwood and laminate, giving me peace of mind that my floors are not only clean but also well-maintained.The mop's swivel head makes it a breeze to reach under furniture and navigate around obstacles, providing a thorough clean every time.In summary, the Bona Floor Mop has simplified and elevated my floor-cleaning routine. It's a high-quality product that delivers outstanding results, and I wholeheartedly recommend it to anyone in search of a reliable and efficient floor-cleaning solution. Say goodbye to the hassle of traditional mops – Bona has truly raised the bar!",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eline REDIER",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFRNCJBNR5V6AY5WA7FDV5Z7MGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12H2GEVE0VNDH?ASIN=B00DVHIF06",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2020",
                "reviewTitle": "5.0 out of 5 stars Affordable and Gets the Job Done (Easy Upgrade to Make it Great)",
                "reviewText": "I’ve always used microfiber mops, I find that they work best for the types of floor that I have (hardwood and tile). They don’t last that long though which is why I’ve gone through several over the past few years. In fact, the handle on my last one just snapped, that’s why I’m here.The reason why I got it is simple- it was cheap. I got it while it was on sale for a price that I just couldn’t refuse. It came with all the stuff that I like too like reusable pads, a swivel head, and a telescoping handle. I’ll admit the qualitys not the best but then again most mops are like these nowadays. You just gotta replace them once they break. Thats probably why they’re affordalbe in the first place. What I did notice was the pads was kind of floppy on the ends. Compared the other ones Ive used the material is also thinner. What I’m planning to do is replace them with microfiber pads from turbo mops - they’re the ones that I used before. I looked at the measurements and it looks like the corners will stick out a bit but i’m okay with that as long as it allows me to mop more efficiently.Anyways, the day after I got it I gave it a try. Assembling the thing was easy, you just put the parts together. Once I got that done I decided to use it to clean the kitchen. Its been over a week since my last mop broke so a bunch of stuff has accumulated on the tile floors since. As always I began by wetting the microfiber pad. You cant get rid of anything with a dry cloth after all! Afterwards I got out my spray bottle and used it to mist the floor (Its a DIY solution that I made from vinegar and water). Then I went over it with the microfiber pad. It got dirty quickly, I had to switch the pad once in the middle. *I know Bona sells their own line of cleaners but I would much rather just use stuff that I already have at home. Maybe someday I’ll try their stuff but not anytime soon.*Pros:- Lightweight and easy to push around- Uses microfiber pads instead of disposable ones- Swivel head swings 360 degrees which makes it easier to mop- Great for reaching under furniture and objects- You can use any cleaner you want with itOverall I’m happy with how the mop worked. Its comparable to the ones I used in the past- the swivel head lets me get into those nooks and crannies and the extendable handle means that I can reach way farther than I can normally.Its likely that I won’t buy this product again but thats not because I don’t like it at all, its because I have a habit of trying different mops once the one I’m using breaks. For what it is, I would say that this mop is worth the money. Its cheap and it gets the job done for your hardfloors!",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E Reeder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHORQEJ74LU6Y5T6TKNMSARQ2NVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FQLGOI3I2OXQ?ASIN=B00DVHIF06",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars No surprises",
                "reviewText": "Exactly what I was expecting. I have vinyl plank flooring, works well, good sized footprint...easy to use for quick cleaning. I use Zepp concentrate low ph in a squirt bottle when I want a little deeper clean but I use this system without it for casual daily cleaning by itself most of the time.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marybeth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVXTWYLXCE4XXU5GJTLXP6XGDHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DUBHTGA5VFO6?ASIN=B00DVHIF06",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2016",
                "reviewTitle": "4.0 out of 5 stars Quick and easy to use, does its job well",
                "reviewText": "I am rating this Bona Microfiber mop a 4/5 based on Amazon’s scale of a 4 being “I like it!”. The mop is a nice size and does exactly what it’s meant to do, but I feel like the mop handle itself could be a little bit more sturdy. I have only just received the mop, and only used it a few times so far, but I do think a stronger mop handle would be better in the long run, especially if you will be using this frequently. I have wood flooring in my kitchen and dining room, and therefore, tend to use the mop 1-2 times daily, depending on meals and messes, etc.The mop is fairly easy to maneuver and is pretty lightweight. It doesn’t take up too much room when storing it either. I am able to discretely place mine on the far side of my refrigerator and have quick access to it when I need to use it. The mop comes with a microfiber mop pad as well as a dusting pad. The microfiber pad attaches easily and effortlessly. I have already washed mine two times and it has not changed the way the pad fits back onto the mop. I did not dry it though, as I wasn’t sure if it would shrink, and it really wasn’t worth the risk. Not to mention, microfiber dries almost instantly, so within an hour or so it was dry again anyway.I would recommend this mop to anyone who has wood floors in their home. I feel it is a good value for what you get. It is very simple and easy to use. If you have any questions, feel free to ask. I will be happy to answer any that I am able to answer. Enjoy. :)",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 17, 2023",
                "reviewTitle": "Eco-friendly alternative",
                "reviewText": "The dry mop works well to gather dog hair, and the wet mop head works well with water (or water and vinegar) for an eco-friendly mop of my vinyl flooring.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lizeth ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 27, 2021",
                "reviewTitle": "Muy bueno fácil de utilizar me gustó",
                "reviewText": "Para lavar ventanas, pisos etc",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chimeracat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 7, 2023",
                "reviewTitle": "great cleaning system",
                "reviewText": "And the Bona(s) (pun intended) is - it has a slightly longer handle compared to some other brands - so it is great for my 6’3” husband to use. and THAT has to be a good reason to buy it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D'Arcy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on January 23, 2020",
                "reviewTitle": "Arrived safe and in good time. Good ergonomics.",
                "reviewText": "First impressions, great mop. Feels ergonomically designed. Comes with the dusting attachment so you don’t have to buy a separate one. Light and easy to use. I like that the top part of the handle is rubber/silicone so it doesn’t scratch when you’re resting it against surfaces.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G Nesbit",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 17, 2023",
                "reviewTitle": "Great Mop",
                "reviewText": "The mop lives up to my expectations. It is easy to use, wet or dry. The telescoping handle makes storage easy and the wide surface covers areas quickly.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}