{
    "remaining_requests": 28407,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cedar-EasyWring-Microfiber-Bucket-Cleaning/dp/B00WSWGVZQ",
    "body": {
        "name": "O-Cedar EasyWring Microfiber Spin Mop, Bucket Floor Cleaning System, Red, Gray",
        "price": "$34.97",
        "originalPrice": "$39.99",
        "rawPrice": 34.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cedar-EasyWring-Microfiber-Bucket-Cleaning/dp/B00WSWGVZQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B081BM9R2T"
        ],
        "asinVariationValues": [
            {
                "asin": "B00WSWGVZQ",
                "variationName": "Style",
                "variationValue": "EasyWring",
                "price": "$34.97",
                "variationImageURL": ""
            },
            {
                "asin": "B071G1J8TZ",
                "variationName": "Style",
                "variationValue": "Spin Mop Bucket with 1 Extra Refill",
                "price": "$60.74",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51AEPeADZ0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41w7fj8DfRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tFoAosD7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TIoLnNX S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41z26GF94WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HBXayF2XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61m3OOjq1qL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the O-Cedar Store",
            "link": "https://www.amazon.com/stores/O-Cedar/page/C6E1D10A-404B-46B7-85F0-DFA5FB10273C?ref_=ast_bln"
        },
        "brand": "O-Cedar",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 174586,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 1 hr 47 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 2 hrs 2 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HANDS-FREE WRINGING: Our exclusive mop bucket design features a built-in wringer that allows for hands-free wringing while Splash Guard keeps water splash and spray inside the bucket when wringing or when transporting the bucket from room to room",
            "MACHINE WASHABLE: The EasyWring Microfiber Mop Head is machine-washable and reusable! We recommend replacing the mop head refill every 3 months for optimal floor cleaning results",
            "DEEP CLEANING MICROFIBER: O-Cedar's EasyWring Microfiber Spin Mop & Bucket Floor Cleaning System uses millions of strands of advanced microfiber to effectively capture dirt and grime with just plain water, eliminating the need for harsh chemicals. Safe for all hard flooring, including finished hardwood, wood, laminate, tile, vinyl and more.",
            "REACHES IN CORNERS: Due to the patented triangle mop-head and ability to rotate 360 degrees, the EasyWring Mop can reach and clean deep into corners, under furniture, alongside baseboards, and between tile.",
            "1 REFILL = 3 MONTHS OF CLEANING: This offer includes 1 EasyWring Refill, and each EasyWring Microfiber Refill lasts up to 3 months! Save time and money with longer-lasting mop head replacements",
            "HANDLE EXTENDS FULLY TO 48 INCHES: With a telescopic handle that extends up to 48 inches, anyone can mop comfortably without bending over",
            "CLEAN BETTER WITH A MICROFIBER MOP: Our streak-free microfiber mops easily attracts and locks in dirt, dust, pet hair, grime, dried-on or sticky messes better than a traditional cotton wet mop. It can be used wet or dry for mopping or dusting. Do not wash with fabric softeners or bleach. Multi-purpose microfiber mop removes over 99% of bacteria with water.",
            "System includes EasyWring bucket, telescopic handle that adjusts to 4.25 ft (51 inches) and microfiber mop head"
        ],
        "description": "Enjoy a fast and fun floor cleaning experience! The O-Cedar EasyWring Spin Mop System features hands-free wringing thanks to our unique foot pedal spin mop design, so you have less mess when mopping. Control the amount of water and moisture applied to floors making for easier wringing and quicker-drying floors. O-Cedar's EasyWring Spin Mop delivers a better clean using microfiber by effectively removing dirt and grime with just water. The EasyWring Spin Mop is a better way to truly clean your floors! Anyone can use this mop, as the telescopic handle adjusts up to 51\" in length with the mop head attached. This mop is safe and effective for all hard floor surfaces, such as hardwood, tile, vinyl, and more! The microfiber mop head refill is reusable and machine-washable. *Removes, does not kill, over 99% of E. coli and Staph. aureus from pre-finished hardwood flooring and ceramic tiling using tap water, as tested at an independent accredited lab.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245503011"
            },
            {
                "name": "Mops & Bucket Sets",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=23537016011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "19.5 x 11.7 x 11.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "0.16 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Freudenberg Household Products"
            },
            {
                "name": "ASIN",
                "value": "B00WSWGVZQ"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "153185"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 174,586 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#238 in Health & Household (See Top 100 in Health & Household) #1 in Household Mops & Bucket Sets"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Mop Head"
            },
            {
                "name": "Import",
                "value": "Made in USA"
            },
            {
                "name": "Color",
                "value": "Red, Gray"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Handle Material",
                "value": "Wood"
            },
            {
                "name": "Handle Type",
                "value": "Telescopic"
            },
            {
                "name": "Head Material",
                "value": "Microfiber"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/882d44b8-ab8e-48b3-a6a1-0fcd3dd62994.__CR0,0,4043,2501_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c9fd6d6-bed8-4c45-9ecb-7b8f17576c7f.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51a8a0e9-56bc-4985-b7b7-8b34ead0202d.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c17b3d6-437b-4e00-a955-13cb224e4e71.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5df0cab6-4a36-491b-9a08-e7e174b7ada5.__CR0,0,4043,1250_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dale Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZHTTY73TKP4YJIWV2Q5BTRN4EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZAK5F87UIJXB?ASIN=B00WSWGVZQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars O-Cedar EasyWring Microfiber Spin Mop",
                "reviewText": "The O-Cedar EasyWring Microfiber Spin Mop has transformed my floor cleaning routine, making the process efficient and hassle-free. Here's my take on this cleaning system:The microfiber mop has been a game-changer in terms of cleaning effectiveness. It effortlessly captures dirt, grime, and spills, leaving my floors sparkling clean. The absorbent nature of the microfiber ensures thorough cleaning with each swipe.The EasyWring system is a genius addition. Being able to control the moisture level of the mop with a simple foot pedal ensures that I can adapt to different floor types and avoid over-wetting. It's a time-saver and prevents excess water from damaging my floors.The spin feature is both satisfying and practical. It allows me to wring out the mop without getting my hands dirty or wet. The spinning mechanism is smooth and efficient, making the entire cleaning process much more enjoyable.The bucket design is ergonomic and user-friendly. Its compact size makes storage a breeze, and the splash guard keeps water where it belongs – in the bucket, not on my floor. The red and gray color scheme adds a touch of style to my cleaning arsenal.In conclusion, the O-Cedar EasyWring Microfiber Spin Mop has simplified and improved my floor cleaning routine. Its effective microfiber mop, adjustable moisture levels, and user-friendly design make it a standout choice for maintaining clean and shiny floors.",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nyfranco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3RBPZ6XHKFZVNFZTGGMTIVZHXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30RPMD9EVXCPN?ASIN=B00WSWGVZQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Efficient Cleaning with Minimal Effort - Highly recommend",
                "reviewText": "The O-Cedar EasyWring Microfiber Spin Mop and Bucket system has been a great addition to my cleaning routine. The microfiber mop head is highly effective at picking up dirt and grime, even on textured floors. Its ability to spin out excess water in the bucket is a game-changer, allowing me to control the mop's wetness easily, which is especially useful on different types of flooring.The wringing mechanism in the bucket is efficient and easy to use, eliminating the need for bending or manual wringing. This feature is a boon for anyone with back issues or who finds traditional mopping physically taxing.The mop's handle is adjustable, making it comfortable for different users, and the mop head itself is machine washable, ensuring long-term cleanliness and sustainability. The compact design of the bucket makes it easy to store, which is an added advantage.Overall, the O-Cedar EasyWring Microfiber Spin Mop and Bucket system has made my cleaning process much more effortless and effective. I highly recommend it for its convenience, efficiency, and excellent cleaning ability.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "graphique",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5VCAFKETQOWZEPVNMDV7ZIWYNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXEIMVUIQRHRE?ASIN=B00WSWGVZQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Great mop!",
                "reviewText": "The O-Cedar EasyWring Microfiber Mop has quickly become an essential cleaning tool in my household. With its user-friendly design and efficient performance, it has made mopping a breeze.One of the standout features of this mop is its ease of use. The built-in wringer mechanism allows for effortless wringing of the mop head, saving time and effort. Simply place the mop head into the wringer, step on the pedal, and watch as excess water is efficiently removed. This innovative system ensures that the mop head is never too wet or too dry, providing optimal cleaning results on various types of floors.The microfiber mop head is another impressive aspect of this product. It effectively captures dirt, dust, and grime, leaving my floors spotless and shiny. The microfiber material is gentle yet durable, ensuring long-lasting performance and preventing scratches on delicate surfaces. Additionally, the mop head is machine washable, making it easy to keep clean and maintain its effectiveness over time.I appreciate the adjustable handle length of the EasyWring Microfiber Mop. It can be extended or shortened to suit my preferred height, offering ergonomic comfort during cleaning sessions. The handle also has a comfortable grip, providing excellent control and reducing hand fatigue.Furthermore, this mop is highly versatile. It works well on various floor types, including hardwood, tile, laminate, and vinyl. Whether I'm tackling spills in the kitchen or mopping large areas, the O-Cedar EasyWring Microfiber Mop delivers consistent and impressive results.In conclusion, the O-Cedar EasyWring Microfiber Mop is a fantastic cleaning tool that lives up to its promises. Its user-friendly design, efficient wringing mechanism, and high-quality microfiber mop head make it a standout choice for anyone seeking a reliable and effective mop. I highly recommend it for its exceptional performance and ease of use.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Red Bank Ed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERGYBRZZCZM5FZLHTGC4LOPL4MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIXRG8RLG09CU?ASIN=B00WSWGVZQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "As a career Sailor, I know a thing or two about swabbing decks (Mopping floors for you landlubbers!). I have real hardwood floors throughout my house. They have much of their beautiful grain and are not sanded flat. I'm getting on into my geezer years, so I wanted to avoid resorting to the trusty cotton mop, and heavy, yellow mop bucket. I tried the sponge mop, the mop with the cloth strips, and the various Swiffers. None of them did a great job, especially under furniture and in tight spots. The Swiffer Wet Jet left a film on the wood. I decided to try this before I went back to Ol' Yeller. The O Cedar is easy to handle and very maneuverable. It gets into tight spaces like corners, under furniture, and along the baseboards. Best of all, it cleans the low spots on my hardwood floors. The spin wringer is super simple to use and removes just enough water so it doesn't leave puddles on the floor. The bucket doesn't have wheels, but it's light enough to move fairly easily. Since the mop doesn't drip, I can leave the bucket in the living room and just carry the mop down the long hallway. No mess! After mopping, I rinse the bucket and the mop twice with clear water. I let the mop dry on my truck's tailgate in the sun. It never stinks. This is a great way to clean your floors. I wish I would have gotten this in the first place.P.S. I never thought I'd be writing a review on a mop. This thing is just that good!",
                "reviewVotes": "111 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carole Hudson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 13, 2024",
                "reviewTitle": "Good product",
                "reviewText": "I love the spin to squeeze out extra water.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rigoberto Roldán Páez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 15, 2023",
                "reviewTitle": "Sirve muy bien para el aseo en las esquinas.",
                "reviewText": "Excelente me encantó.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adriana.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 31, 2022",
                "reviewTitle": "Bueno y funcional",
                "reviewText": "Es súper fácil de usar, de buen material y calidad; no seca muy bien pero es cómodo no tener que exprimirlo a mano y limpia cada rincón",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tracy lyn bootle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2022",
                "reviewTitle": "Best mop ever",
                "reviewText": "I cleaned all my walls and baseboards with this quite effortlessly really. I did add a bit of cleaning solution to the water but the mop head is perfectly shaped and the bucket spinner works easily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ali",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 26, 2024",
                "reviewTitle": "Best version of this mop",
                "reviewText": "I much prefer this version of this mop compared to the uk version. I would recommend this mop over any other spin mop.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}