{
    "remaining_requests": 28219,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Baseboard-Rotating-Cleaning-Replacement-Microfiber/dp/B0CMCGMC6H",
    "body": {
        "name": "Wall & Baseboard Cleaner Mop Tool with 82'' Long Handle, 360 Degree Rotating 3-in-1 Ceiling Cleaning Tool Duster for Cleaning Painted Walls, Window, Floor, 6 Replacement Microfiber Chenille Pads",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Baseboard-Rotating-Cleaning-Replacement-Microfiber/dp/B0CMCGMC6H",
        "soldBy": {
            "sellerID": "A3QNN6CKLQM142",
            "name": "Bokton-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3QNN6CKLQM142&asin=B0CMCGMC6H&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTX7LXXD"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "5",
        "stockDetail": "",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41YCUzyatVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410JoiCGBNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YjTWoM4 L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZoTjkAxzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PI4eOFTTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZwwR4yKpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/917T2OJcnkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Bokton",
            "link": "https://www.amazon.com/Bokton/b/ref=bl_dp_s_web_120403921011?ie=UTF8&node=120403921011&field-lbr_brands_browse-bin=Bokton"
        },
        "brand": "Bokton",
        "merchantInfo": "Bokton-US",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 73,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[Perfect design] Triangle design, you can go deep into the corners to easily clean the dirt in the crevices of the corners, 90 ° flip mop panel design, more effective adsorption of dust, pet hair and small debris on the floor, and at the same time, clean the skirting on the dust",
            "[82\" Adjustable Handle] This wall and baseboard cleaning mop is very sturdy and lightweight, comes with 5 extension poles that extend from 37 inches to 82 inches, is adjustable in length as needed, is easy to install and remove, and lets you clean both high and low areas without a ladder or bending over",
            "[WET & DRY MOPS] Our wall cleaner comes with three microfiber cleaning pads and three chenille cleaning pads, Chenille pads can be dry-used for dusting walls, ceilings and removing spider webs. The microfiber pads can be wet-used for mopping, window cleaning. Cleaning pads are adhesive designed for quick and easy replacement, washable and reusable to help you save money and reduce waste!",
            "[360°adjustable swivel mop head design] Thanks to the 360° adjustable swivel mop head design, you can easily reach and clean dead spots such as the bottom of your sofa, the bottom of your bed, the corners of your walls and the corners of your ceiling. In addition, it can be used anywhere you can imagine, such as windows, floors, cars and walls. There is no doubt that this wall mop will be a great helper for your cleaning work!",
            "[Multi-Purpose Cleaning Tool] The swivel mop head also comes with a silicone wiper strip to scrape away dirt, dust, small debris and dirty water from shower doors, windows, floors and glass while cleaning. Plus it doesn't take up much space and can be hung anywhere when not in use"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=15342831"
            },
            {
                "name": "Dusting",
                "link": "https://www.amazon.com/Dusting-Tools/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=15356181"
            },
            {
                "name": "Feather Dusters",
                "link": "https://www.amazon.com/feather-dusters/b/ref=dp_bc_aui_C_5/000-0000000-8675309?ie=UTF8&node=2245498011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "17.48 x 9.61 x 3.31 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.33 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Bokton"
            },
            {
                "name": "ASIN",
                "value": "B0CMCGMC6H"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "101"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 73 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#59,704 in Health & Household (See Top 100 in Health & Household) #199 in Feather Dusters"
            },
            {
                "name": "Batteries required",
                "value": "No"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c49030c8-910c-4eb1-95d3-dae208c02f57.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0df249f6-bb29-4f60-a217-cfcbea9c49d3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96b53844-d657-424a-b624-36ee3de8e46f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95f9bad9-d992-475e-9e27-95323afe1397.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9f398e2f-f351-4a25-a4fc-e6015b30c29a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79747e09-d8b2-4340-8007-70682b7555a6.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Margo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4N7F4HF6BH6WNNQQP4OHEXWOQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R370RHMDZZBTBF?ASIN=B0CMCGMC6H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Cost effective with many uses for cleaning effectively",
                "reviewText": "The media could not be loaded. This is a wonderful little cleaner and can effectively clean dirt, dust and even some deeper cleaning. What is wonderful about this kit is the fact that you can effectively clean at different angles with the pads. You can easily remove dust and dirt from the corners of your windows and effectively clean the inside frame of the window with this unit with its 360-degree rotating design of the head. You can effectively clean under those kitchen cabinets and above them with this unit. This is why this unit can give a deeper cleaning for your home. It can effectively clean all the dirt and dust around the door frames and can remove all the dirt from the corners of the walls and corners of the floors with its 90 percent panel folding of the head. Effectively clean the walls and with its adjustable poles that can be adjusted at several lengths it makes it easy to remove dirt and dust from tables, chairs, and other furniture. The unit has a secure strong fit to the head that screws in, so you do not have to worry about it falling off while dusting like other units I’ve delt with. Also, the pads have a strong secure hold to the head of the unit. The poles are strong and connect to each other with a strong secure hold. With this unit you can effectively clean under the beds, under tables and sofas. Its triangular design makes it easier for cleaning all corners effectively. The head also comes with a squeegee on the head of the unit to remove water from shower doors and walls. You get three microfiber superior pads which are durable these do not need to be replaced often as regular pads and they can effectively get rid of bacteria three times as much as regular pads. These pads can be used over and over because they are plush and durable, and they will not scratch or scuff any furniture because of their incredible softness. You get three Chenille pads that are soft and luxurious feel and will maintain its quality for a long time These are great for pets' hair, dirt, dust and other small and large particles and effectively clean floors, walls, ceilings, windows and baseboards and other surfaces with little effort with a significant impact. They can effectively allow you to reach tight spaces and corners with ease. Microfiber pads can withstand a lot of washing in the wash machine, but it is not recommended to wash with other fabrics as this could damage the fibers and leave lint on them. but for Chenille pads I would recommend hand washing them. The fiber might be destroyed in washing machines.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0c7538b7-e332-4b6a-a944-ad4c8330f1b6/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Just Me",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGD4AQEFUL72XBUHYBUOIR4DSF7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MXJSWIM21C0X?ASIN=B0CMCGMC6H",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars My Mom would have loved this",
                "reviewText": "I had recently been looking at my walls and ceilings. I was horrified. I have an African Grey parrot and he produces a lot of feather dust. White feather dust that floats through the air and covers everything. I was remembering how my Mom would frequently clean the walls and ceilings. It was depressing to look at my walls and ceilings. It wasn't only the feather dust., it was also the dust everyone has to deal with. I knew I had to do something and even considered hiring someone to do it for me. Then I saw this.Oh how much I love this! I have serious back and shoulder issues so I can't do everything I need or want to do anymore. This is like a godsend. I just recently received this so I haven't been able to do but a few rooms but I've done enough to show me how valuable this tool is and what a difference it is going to make for me. With the permanent back and shoulder injuries I sustained I can't reach high up but for a short time. Some days not at all. With this wonder tool I can reach areas that I could never have reached before. The pole extends up to 82\" and is lightweight even for me.I remember when I use to bend over or get on my hands and knees and wipe down the baseboards. I can no longer do that. Now I can finally clean these areas. I can get behind pieces of furniture that I couldn't before. I had actually recently checked into getting a maid service. Got prices and everything. No way could I afford that on Social Security.This is going to be one of my favorite cleaning tools that I own, that I have ever owned. I've only used the chenille pads so far. I love that I can wash them. The microfiber pads as well as the length of the pole will be so useful cleaning the tiled floor under his cage. Wish when I bought the cage 20 years ago I thought to get one with wheels. This is like it was designed with people like me in mind, old (68) and physically disabled. It's offered at an amazing low price. You will not regret ordering one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GrizzlyC137 ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG67OBLTIMCLNCXF5FFIE2TBWOUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT7C26832MITE?ASIN=B0CMCGMC6H",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Very long, cleaning head is kinda stiff",
                "reviewText": "I have 12' ceilings here and found it to be to long with all of the handle assembled so if you have tall ceilings this could definitely help.Sofar I've mostly used it with only 1-2 handle sections while cleaning walls.The section that folds to clean baseboards etc is very stiff and didn't want to bend bent in or out of place, it can it just fights you.The segments of the handle are strong and stable, im not so sure the plastic threads holding them together will last long term tho.The cloth pads hold themselves on securely.I've mainly use this Sofar on walls with a cleaning mixture and bucket/ uv flashlight to show where any stains are,. The combination worked wonders, and the mop type thing was very affective at cleaning any spots the uv light showed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}