{
    "remaining_requests": 28372,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Microfiber-Cleaning-Reusable-Washable-Refillable/dp/B0C65Q4QWJ",
    "body": {
        "name": "Spray Mops Microfiber Floor Mops for Cleaning, Wet Dry Mop Floor Cleaning Mops with 4 Reusable Washable Mop Pads, Wet Spray Mop Dust Mop Refillable Flat Floor Mop for Hardwood Laminate Tile Floors",
        "price": "$22.99",
        "originalPrice": "",
        "rawPrice": 22.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Microfiber-Cleaning-Reusable-Washable-Refillable/dp/B0C65Q4QWJ",
        "soldBy": {
            "sellerID": "A3495I7P5YJC8R",
            "name": "US-TINA&TONY",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3495I7P5YJC8R&asin=B0C65Q4QWJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CHYL88V2"
        ],
        "asinVariationValues": [
            {
                "asin": "B08XW2NTCT",
                "variationName": "Size",
                "variationValue": "5 Piece Set",
                "price": "$24.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C65Q4QWJ",
                "variationName": "Size",
                "variationValue": "435ml Blue Mop",
                "price": "$22.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CKSXS8FQ",
                "variationName": "Size",
                "variationValue": "435ml Purple Mop",
                "price": "$22.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/4186UYLOHuL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/517ZlxpRN7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513IhsQbeUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61IdKTA4yfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Cy9JlO8lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/810x0h Dx0L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: TINA&TONY",
            "link": "https://www.amazon.com/TINA-TONY/b/ref=bl_dp_s_web_37129085011?ie=UTF8&node=37129085011&field-lbr_brands_browse-bin=TINA%26TONY"
        },
        "brand": "TINA&TONY",
        "merchantInfo": "US-TINA&TONY",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4003,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ergonomic Spray Mops for Floor Cleaning - The ergonomic mop handle of floor mops provides you comfortable handgrip. Just simply squeeze the trigger with one hand, and you can clean the wooden floor without bending your waist. Moreover, this floor mop with sprayer doesn't need batteries or charging cable; even children can easily operate this kitchen wet mop. Moreover, the aluminum alloy pole of this hardwood floor mop is durable, flexible and lightweight, helps to save effort in the cleaning job",
            "360 Rotatable Adjustable Cleaning Mop - The professional 360°rotating mop head, designed to reach out every corner of your house. When you cleaning your room, our microfiber mop can easily go around furniture legs and get into narrow place. No need to move bulky furniture. Our wet mop is ideal for eliminating the stubborn dirt on your floor, windows, ceiling, under furniture and small corners. The 360 degree cleaning mop head of the floor spray mop won't let go any dust, and bring a tidy place",
            "Wet Jet with Refillable 435ML Bottle - Our floor cleaning mop comes with 435ml water tank, just slightly press the trigger on the handle to get a wide-angle spray water mist that wet enough to clean up spots and spills, but not so much that leaves puddles on the floor. The 435ml tank of dry wet mops for floor cleaning can be fill up with either water or other neutral cleaning solutions you want. Just fill the bottle one time, refillable spray mops allow you clean over 100 square meters area",
            "Flat Mop with 4 Microfiber Mop Pads - Our mops for floor cleaning includes three replacement mop pads which made of dense microfiber that absorb and lock in dirt, dust, hair, animal fur and moisture while gently protecting your floors and furniture. These reusable mop pads of laminate floor mop are soft, water-absorbing, durable and more economical than disposable cleaning pads. When refillable spray mop pads get dirty, you could wash them by machine or hand, and they can be wash over 100 times",
            "Dry Mop & Wet Mop - The spray mop for hardwood floors can be used as dry mop as well as wet mop. The mop with sprayer for floor cleaning is designed with a superfine mist sprayer that can strictly control the water output. We offer 4 wood floor mop pads for your convenience. Our spray mop with washable pads are perfect for many floors like laminate, marble, hardwood,tile, vinyl,stone and concrete. Our floor mops with sprayer feature eco-friendly, powerful decontamination, highly adsorption force",
            "Tips About Microfiber Mops for Floor Cleaning - Since each hardwood floor mop will undergo a nozzle test before delivery, if you find that there is water left in the bottle after receiving the wet dry mop, this is a normal phenomenon, please rest assured to use the refillable mop. Plus, we don't recommend placing a strong acid liquid in the bottle, after use, please clean the spray mop bottle to avoid clogging the spray port and affect the use"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245503011"
            },
            {
                "name": "Wet & Dry Mops",
                "link": "https://www.amazon.com/wet-mops/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2245507011"
            },
            {
                "name": "Sponge Mops",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=23537024011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "16.97 x 4.49 x 4.02 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.7 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "US-TINA&TONY"
            },
            {
                "name": "ASIN",
                "value": "B0C65Q4QWJ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "435SLHUI2HUI2SLPB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,003 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,284 in Health & Household (See Top 100 in Health & Household) #2 in Household Sponge Mops"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "TINA&TONY"
            },
            {
                "name": "Color",
                "value": "435ml Blue Mop"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor, Plastic, Concrete, Stone"
            },
            {
                "name": "Handle Material",
                "value": "Aluminum"
            },
            {
                "name": "Head Material",
                "value": "Microfiber"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "TINA&TONY Microfiber Spray Floor Mops with Four Reusable Mop Pads - Your reliable cleaning assistant ! Quick cleaning, slow pace of life - one bottle of water, one hand, one song, life should be so comfortable. Our brand's mission is to use high-quality materials and focus on product details, with the ultimate goal of creating a unique and comfortable cleaning experience, making household chores a breeze The slim mop pole has simple and fashionable design, while allowing you to mop the floor without bending over. The spray mop for floor cleaning can be operated with one hand, saving time and effort. The lightweight floor mop with sprayer weighs only 0.8kg, making it easy for you to lift and clean various parts of the house, such as tile walls, windows, ceilings, bathroom glass, etc",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f913e27-f839-4340-aa2c-a5140aac674b.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Details of Spray Mops for Floors 435ml portable water tank of wet mops, alllowing you clean over 100 square meters of floor with just one addition of water, while mopping and spraying, without adding water multiple times, saving you time and making cleaning more relaxed and enjoyableOur microfiber mop pad will not cause more problem beacuse of shed hair. Moreover, the inside thickened sponge enables strong water absorption, which can easily achieve the task of mopping and drying, makes your floor shiny A multifunctional scraper can scrape out excess water and pet hair from the mop pads. In addition, its small brush can also clean the sink and bathtub glaze",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d24fd52-2a12-4f6b-974c-850d725827f3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Details of Spray Mops for Floor Cleaning The upgraded flat mop nozzle realizes fan-shaped spray and long-distance spray. The water mist covers a large area, reducing the times of pressing the handle, saving your strength. The water mist is fine and even, protecting your floor from moisture and mildewThe fine mist nozzle achieves micro wet cleaning, strictly controls the water output, which the floor can be dry immediately without leaving any water stains and saves water. The wet mop is equipped with a built-in transmission link device, which allows floor cleaning mop spray even water mist with just a slight press of the handle.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fe034174-f414-4b9f-8f33-9f82b4e5b9eb.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Reusable Washable Mop Pads These washable mop refills are strong and durable, which can easily remove stubborn stains. The end of the mop pad fiber is in a hook shape, which can effectively gather dust, dander and hair. These floor mop pads can be wash over 100 times, so compared to expensive disposable mop pads, these reusable mop refills are clearly your better choice! 360 Degree Rotation Mop Head The flexible 360 degree rotation mop head eliminates the need to move furniture, making it easy to cope with various furniture obstacles. The thin mop bottom board can perfectly clean the gaps, sofa bottom, bed bottom, table bottom, and other small spaces, ensuring that there are no dead corners during cleaning and making you feel more at ease 435ML Refillable Water Tank Multifunctional water bottle, which brings you a different cleaning experience. It can be added with water, detergent, disinfectant, essential oil, perfume according to your needs. Please note that after each use, please add 1/5 of clear water to the bottle and spray it. The purpose is to clean the nozzle to prevent blocking and corrosion of the built-in transmission device",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/75562a20-0002-45a6-bc4d-85a0249743b3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dbc983e3-e607-40a7-aa20-8904f053f343.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9989ff1a-cc16-4427-a22e-09f4f466c02e.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "[Attention Tips] Because each spray mops for floor cleaning will undergo a nozzle test before delivery, a small amount of water may remain in bottle and tube is normal phenomenon.Please clean the water tank and spray nozzle of the floor mop after use to keep it clean.Please don't fill with boiling water, strong acid, alkali detergent into the wet jet mop bottle.Please fully dilute solutions with plain water,because overly concentrated solutions may corrode mop internal parts or floor. There are two small silicone plugs on the bottle cap of our spray mop. Please be careful not to lose them when cleaning the bottle",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02b0000f-c207-48bf-9a8a-90896766adb7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f913e27-f839-4340-aa2c-a5140aac674b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/80310c85-a89a-4c58-a22a-416461a8cf8a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d24fd52-2a12-4f6b-974c-850d725827f3.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fe034174-f414-4b9f-8f33-9f82b4e5b9eb.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/75562a20-0002-45a6-bc4d-85a0249743b3.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dbc983e3-e607-40a7-aa20-8904f053f343.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9989ff1a-cc16-4427-a22e-09f4f466c02e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02b0000f-c207-48bf-9a8a-90896766adb7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lynne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERNO7VXVGXJB7ILVAJPBXDMJ42Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FHZOG3NO62O1?ASIN=B0C65Q4QWJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars So convenient",
                "reviewText": "I like having four mop heads, its ease in cleaning, lightweight, so handy, and works great. What more could I ask for?!?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "megan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA72TWJJ32GDIK7PUONX4PRRCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1V746BMFOPGER?ASIN=B0C65Q4QWJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Recommended to me by a professional",
                "reviewText": "I just got hardwood floors and asked Jacob (a professional cleaner) for advice on what to use for maintaining and cleaning. Of all the choices, this is the one he recommended, and I absolutely love it. The pads are easily applied by sewn on velcro strips; they’re very thick and sturdy, easy to remove, and wash well. The handle has a trigger that releases a fine mist, covering about 15 inches wide and 12 inch deep onto the floor. On Jacob’s recommendation I use water with maybe 1/4 cup of Meyers Clean Day added to fill the vessel; it lasts a long time and doesn’t put more fluid than necessary to clean the floor. The mist is so fine that it doesn’t need drying after cleaning.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ice Water",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7R5IPN4UBRGPZGR5R4RI5L3EEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R231P6HZNUVTRS?ASIN=B0C65Q4QWJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Great mop, sturdy, wish it was longer for a taller, 6ft person to use and not stoop",
                "reviewText": "I think it works really well. I am a taller person 6'0'' and I think it isn't long enough for me to use though. I have to bend my back/stoop a bit when using it. It might be best suited to someone 5'8\" or shorter. To me it doesn't look like it extends beyond its capacity. Should make an extendable version for taller users.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marilouise",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMVA3G6IVSQS5WMRJVHQ5GCP2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30EVGIRLX3ZIR?ASIN=B0C65Q4QWJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Lightweight and easy to use",
                "reviewText": "This mop is lightweight and that's great for a senior to use and operate. It has four interchangeable pads so you may use in different areas of your home without using the same one everywhere. It cleans well and you may use your cleaning solution of choice. I had no problem putting it together and it did a very nice job, especially behind the toilet, hard to clean if mop is too large. I'm glad I purchased this mop.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miranda ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTXXA63N5AS3PYSF3DTD7AADGEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVOTHNF8KBLML?ASIN=B0C65Q4QWJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Works well",
                "reviewText": "I like that it came with 4 microfiber pads. It’s lightweight which is nice but when I’m using it to scrub i feel like i might break it but overall i like it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Willis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGITCKEBFH3HM6H7CFSXLYPGBRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WZACOVKUKRHW?ASIN=B0C65Q4QWJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Good product",
                "reviewText": "I love the fact that the pads are reusable after washing them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYX2JCD6QENJMPAB4NY6XHGHIUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39UV9K3RLYUZS?ASIN=B0C65Q4QWJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Exactly as described",
                "reviewText": "this product is very efficient and so easy to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randyfyah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI7QW7JOHYIV7SJHI6MRHLDEGBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL14Z1VU9XDOQ?ASIN=B0C65Q4QWJ",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "1.0 out of 5 stars Save your money",
                "reviewText": "This is ass definitely not worth the money. I got TWO mops in ONE SINGLE session of cleaning. Now when I went to use it again the spray bottle isn’t sitting right in the holder and doesn’t spray but it’s sure leaks out the back where there is no spray nozzle. Wish I could get my money back to be completely honest with you. I would even pay to return this product. It’s ass",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 2, 2023",
                "reviewTitle": "Works well for hardwood floors",
                "reviewText": "The handle seems a little on the flimsy side, I guess I will have to be gentle on it so it will last a few years, was not too pricey. For now works well is easy to use, love how the pads just rip off when time to wash. The pads are nice and thick and picks up lots of dust and hair. Came clean in the wash first time around. Sprayer works well.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Neil henry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 7, 2024",
                "reviewTitle": "Spray mop",
                "reviewText": "Easy to assembled, easy to use great value leaves my floors smelling fresh and spotlessly clean",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine-cau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 15, 2024",
                "reviewTitle": "Très bien",
                "reviewText": "J' apprécie la longueur et largeur de la vadrouille, ainsi que le spray qui permet un vrai nettoyageJe recommande ce balai",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wolf",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 2, 2024",
                "reviewTitle": "Mit Reiniger gleichzeitig den Wischprozess durchführen",
                "reviewText": "Ein ideales Gerät. Leicht und sehr gute Handhabung. Wischbezug sehr schnell wechselbar. Für viele Reinigungsbereiche einsetzbar.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Imelda Mulligan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 25, 2023",
                "reviewTitle": "Great Product",
                "reviewText": "Dose the job perfect. Would recommend anyone to buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}