{
    "remaining_requests": 28091,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Triangle-Dust-Mop-Kit-Industrial/dp/B06XNKMFV3",
    "body": {
        "name": "Triangle Dust Mop Kit: 4 Piece Industrial Dust Mop Kit",
        "price": "$37.49",
        "originalPrice": "",
        "rawPrice": 37.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Triangle-Dust-Mop-Kit-Industrial/dp/B06XNKMFV3",
        "soldBy": {
            "sellerID": "AISRZV9B6HAVZ",
            "name": "Direct Mop Sales, Inc.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AISRZV9B6HAVZ&asin=B06XNKMFV3&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51s6kz6rsLS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21AUouLlIAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21rnKeDlriL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51CCN7Los7S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410CHgS6buS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OKqsn9gQS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21AoF0olgrS.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Direct Mop Sales, Inc. Store",
            "link": "https://www.amazon.com/stores/Direct+Mop+Sales/page/512D8E52-DC4F-4ACE-98CA-F6A6DF8D1277?ref_=ast_bln"
        },
        "brand": "Direct Mop Sales",
        "merchantInfo": "Direct Mop Sales, Inc.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1480,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Triangle wedge mops are great dusting tools because the heads are designed to swivel forwards or backwards 180 degrees allowing them to lay flat on floors, walls and ceilings in the dusting process. The triangle design was specifically designed to allow yarn ends to reach into tight corners to pick up and remove soil.",
            "This kit includes 2 color coded dusting heads to allow users to separate use areas when desired. The heavy wire frame that holds the triangle wedge mop and the aluminum extension handle are produced from industrial quality materials to ensure a long use life.",
            "These triangle dust mops are produced with a professional grade blended yarn for maximum pick-up of dirt, dust and debris. This yarn design is a single ply over twisted yarn with a small loop at the end that reduces fiber loss in use and in the laundry process. These Closed Loops eliminate snagging on objects like you find with standard looped-end yarns, making it ideal for residential cleaning, commercial cleaning, and post construction clean up.",
            "The Closed Loop Yarn Design contained in these Triangle wedge mop heads reduces linting and fire hazards associated with laundering cut end style cotton dust mops. These Heavy Industrial Grade Dust Mops and can be laundered close to 70 times, depending on use conditions, and require less than ½ of the energy to wash and dry the dust mop as compared to cut-end cotton mop yarns. No treatment is necessary with the use of this dust mop.",
            "Kit Includes: (1 each) Blue Industrial Triangle Dust Mop Head, (1 each) White Industrial Triangle Dust Mop Head (1 each) Heavy Wire Triangle Mop Frame and (1 each) 70” Aluminum Extension Handle with threaded end."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b?ie=UTF8&node=2245503011"
            },
            {
                "name": "Wet & Dry Mops",
                "link": "https://www.amazon.com/wet-mops/b?ie=UTF8&node=2245507011"
            },
            {
                "name": "Dust Mops",
                "link": "https://www.amazon.com/b?ie=UTF8&node=23537023011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ March 23, 2017"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B06XNKMFV3"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#74,635 in Health & Household (See Top 100 in Health & Household) #110 in Household Dust Mops"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,480 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Machine Washable and Durable: Our Triangle Dust Mop Kit is designed for long-lasting performance. The mop heads and frames are constructed from high-quality materials that ensure durability and withstand rigorous use.You can confidently machine wash the mop heads for hundreds of launderings without compromising their effectiveness or integrity.The durable construction and longevity of these wedge mops ensure a cost-effective cleaning solution that will serve you well over the long term.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7bb3e74-4296-4eeb-a1e5-bdb6bdf38b8e.__CR1000,0,4000,4000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Triangle Dust Mop Kit: Complete Cleaning Solution Introducing our Triangle Dust Mop Kit, the ultimate cleaning companion for tackling dust, dirt, and debris on various surfaces with ease. This comprehensive kit includes everything you need to achieve pristine cleanliness in your home, office, or commercial space. Efficient and Versatile Triangle Design: At the heart of this kit lies the innovative triangle wedge mop. Its unique design allows the mop head to swivel a full 180 degrees, enabling it to effortlessly lay flat on floors, walls, and even ceilings. The triangular shape is purposefully engineered to reach deep into tight corners, effectively capturing and removing soil from every nook and cranny. Superior Construction for Lasting Performance: We understand the importance of durability in cleaning tools, which is why our Triangle Dust Mop Kit is built to withstand the test of time. The heavy wire frame that holds the triangle wedge mop and the industrial-quality aluminum extension handle are crafted from robust materials, ensuring reliable performance even in demanding cleaning tasks. Maximum Pickup with Professional-Grade Yarn: Equipped with a professional-grade blended yarn, these triangle dust mops deliver exceptional cleaning power. The yarn design features a single ply over twisted construction with closed loop ends, minimizing fiber loss during use and laundering. Our closed loop design eliminates snagging on objects, making it ideal for various cleaning applications. Unparalleled Washability and Longevity: Maintaining cleanliness and hygiene is a breeze with our machine-washable triangle mop heads. Simply toss them into your washing machine after use for a thorough cleaning. With each mop head capable of enduring close to 70 wash cycles, depending on usage conditions, you can rely on these durable mop heads for long-lasting performance. Plus, they require less than half the energy to wash and dry. A Complete Kit for Your Cleaning Needs: Our Triangle Dust Mop Kit includes all the essential components to streamline your cleaning routine. It features a Blue Industrial Triangle Dust Mop Head, a White Industrial Triangle Dust Mop Head, a Heavy Wire Triangle Mop Frame, and a 70\" Aluminum Extension Handle with a threaded end. The extendable handle provides flexibility, allowing you to reach high or low areas effortlessly. With our Triangle Dust Mop Kit, you can achieve exceptional cleanliness and maintain a spotless environment efficiently and effectively.",
                "media_link": []
            },
            {
                "media_text": "Advanced Dust Mop Heads for Superior Cleaning Performance Dual Dust Mop Heads: Kit includes one White and one Blue Industrial Triangle Dust Mop Head for versatile cleaning options.High-Performance Material: Crafted from a professional-grade blended yarn, these dust mop heads offer exceptional dirt, dust, and debris pickup, ensuring a thorough clean every time.Enhanced Cleaning Efficiency: The unique single ply over twisted yarn design with closed loop ends maximizes cleaning efficiency by minimizing fiber loss and increasing contact with surfaces.Triangular Shape for Precise Cleaning: The 5 ½\" wide x 10\" long fabric portion of the wedge mop reaches into tight corners, allowing you to effectively clean hard-to-reach areas and eliminate hidden dirt.Ideal for Residential and Commercial Use: These heavy-duty industrial-grade dust mop heads are suitable for various cleaning applications, including residential cleaning, commercial cleaning, and post-construction clean-up.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a11eaa0-f0f2-4eee-ae2c-12babb3f8545.__CR0,12,1477,1477_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7bb3e74-4296-4eeb-a1e5-bdb6bdf38b8e.__CR1000,0,4000,4000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5a317293-b805-45ab-81d0-b7b31a08e2f6.__CR0,111,3528,1058_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a11eaa0-f0f2-4eee-ae2c-12babb3f8545.__CR0,12,1477,1477_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tonydee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEWIBKPQ2L32TLWR36PWXOG56QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R269UIHAI5DBK5?ASIN=B06XNKMFV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Very nice dust mop.",
                "reviewText": "I like the extended handle I'm 6 ft 3 adds a nice touch. Also comes with 2 mop heads. Picks up all the dust on all my floors with no problem. Go outside to shake it out. Works better than those swifter mops and is cheaper you can wash the mop heads when needed. A good buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPXGCWJNN3DAXFEIQ3PWBUZBASQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFBNTWBQLZPT4?ASIN=B06XNKMFV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Dust magnet and very sturdy!!!",
                "reviewText": "The cotton mop picks up every spec of dust and the handle is very sturdy! I also love that 2 mop heads are included!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Russell A. Starner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCKL7LTUGNLDJH4DK7FEHFAXOEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TNJX8FKSO4IK?ASIN=B06XNKMFV3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "4.0 out of 5 stars A must for your home for when getting under furniture and more.",
                "reviewText": "This item is easy to use and assemble out of the box. I used it for the first time today and I love it. Now getting under the furniture and beds is easy with this mop. The handle is long and heavy duty to last for many years of continued use. Ideal for hardwood floors. The only question I have is how to clean the mop heads. No instructions in detail are given on Amazon's website or on the seller's webpage.I do plan to get more mop heads. You will want to buy the extra mop heads.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dyna Dubose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDUGRHKS7NXSD7VKEO5K5UPWVAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M8G0EU6RBLD?ASIN=B06XNKMFV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "5.0 out of 5 stars The mop heads pick up dirt better than polyester",
                "reviewText": "The mop is very easy to use but the handle is a little large for hands. But I would buy it again .",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLWZMWKJ3TTTMVWT7MJDL52LF6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28ZN47ETXJZKT?ASIN=B06XNKMFV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "These mop heads work well and are durable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paula LM.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCCOEIIZYIKBDAIKECAEYVSJOQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I8E49FIWM7J7?ASIN=B06XNKMFV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Hard to find",
                "reviewText": "It's almost impossible to find an old fashioned dust mop these days. This one comes with two washable heads so it's worth the money. I've got three dogs and a cat. It's so easy to use.....less than five minutes and the floors look so much better.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lcr7329",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBA3BPHN2VICYNXVTVT46HUVDXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MBATWFHIKBWJ?ASIN=B06XNKMFV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Such a great find!",
                "reviewText": "Mom and Granny used dust mops just like this for decades on our hardwood and vinyl floors. Nothing ever beat them. Microfiber and disposable dust pads work fine on hair and simple dust, but not on actual dirt, crumbs, etc. Found these on Amazon and have used them every day since. They pick up pretty much everything on the floors and baseboards, and I just shake out the dirt until I need to wash them. The handle is both lightweight and adjustable, a real plus.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2O2PED4Y2ZPP2USY2J4W2TPK4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R338370KVAO0RB?ASIN=B06XNKMFV3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "3.0 out of 5 stars Telescopic pole for mop handle",
                "reviewText": "The telescopic pole was not what i was expecting for a mop handle.For me it was hard to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}