{
    "remaining_requests": 28406,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cedar-Bucket-Microfiber-Cleaning-Refills/dp/B01MCVXNSG",
    "body": {
        "name": "O-Cedar Easywring Microfiber Spin Mop & Bucket Floor Cleaning System with 3 Extra Refills",
        "price": "$41.98$36.26",
        "originalPrice": "$69.96",
        "rawPrice": 41.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cedar-Bucket-Microfiber-Cleaning-Refills/dp/B01MCVXNSG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSFLS2JF"
        ],
        "asinVariationValues": [
            {
                "asin": "B01MCVXNSG",
                "variationName": "Color",
                "variationValue": "Easywring + 3 Extra Refills",
                "price": "$41.98",
                "variationImageURL": "https://m.media-amazon.com/images/I/51vzZh3I9XL._SS36_.jpg"
            },
            {
                "asin": "B07NDHY41N",
                "variationName": "Color",
                "variationValue": "Easywring Spin Mop and Bucket + 4 Extra Refills",
                "price": "$60.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/51bokkSdgyL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51vzZh3I9XL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51eSTIFyluL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UL8vsqDNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oRZImvS0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xywsWyDZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ibdA2kM3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71RE vkn1wL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the O-Cedar Store",
            "link": "https://www.amazon.com/stores/O-Cedar/page/C6E1D10A-404B-46B7-85F0-DFA5FB10273C?ref_=ast_bln"
        },
        "brand": "O-Cedar",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 48847,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 17 mins",
            "FREE delivery Monday, February 19. Order within 15 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "REMOVES OVER 99% OF BACTERIA W/ JUST WATER: O-Cedar's EasyWring Microfiber Spin Mop & Bucket Floor Cleaning System provides a deep-cleaning solution for all your at home needs by effectively removing dirt, grime and over 99% of bacteria with just water! It is safe on all hard floor surfaces, including finished hardwood, wood, laminate, tile, vinyl, and more.",
            "HANDS-FREE WRINGING: Our exclusive mop bucket design features a built-in wringer that allows for hands-free wringing while Splash Guard keeps water splash and spray inside the bucket when wringing or when transporting the bucket from room to room.",
            "WASHABLE & REUSABLE MOP REFILLS: The EasyWring Microfiber Mop Head can be machine washed and reused! Keep an extra refill handy for the next mess.",
            "DEEP CLEANING MICROFIBER: O-Cedar's EasyWring Microfiber Spin Mop & Bucket Floor Cleaning System uses millions of strands of advanced microfiber to effectively capture dirt and grime with just plain water, eliminating the need for harsh chemicals. Safe for all hard flooring, including finished hardwood, wood, laminate, tile, vinyl and more.",
            "REACHES IN CORNERS: Due to the patented triangle mop-head and ability to rotate 360 degrees, the EasyWring Mop can reach and clean deep into corners, under furniture, alongside baseboards, and between tile.",
            "NEW REFILL, CLEAN START: Be prepared for daily messes with extra mop refills. Assign each room in your home its own refill and avoid spreading dirt from one area to another. Stock up ahead of time so you’re always ready for the next mess.",
            "CLEAN BETTER WITH A MICROFIBER MOP: Deep-cleaning, streak-free microfiber mops easily attracts and locks in dirt, dust, pet hair, grime, dried-on or sticky messes better than a traditional cotton wet mop. Our microfiber mop is a versatile cleaning product, as it can be used wet or dry for mopping or dusting.",
            "Triangle shaped mop head for easy maneuverability and corner cleaning"
        ],
        "description": "Enjoy a fast and fun floor cleaning experience The EasyWring Spin Mop, which features hands -free wringing thanks to our foot pedal spin mop design. The foot pedal on the bucket allows for hands-free wringing, so you have less mess when mopping. Control the level of moisture of your mop with the built-in high-quality foot pedal designed to activate spin wringing. This SpinMop & Bucket gives you the ability to control the amount of water and moisture applied to floors making for easier wringing and quicker-drying floors. O-Cedar's EasyWring microfiber mop delivers a better clean by effectively removing dirt, grime and over 99% of bacteria with just water. The EasyWring is a better way to truly clean your floors! Removes over 99% of E. coli and Staph. aureus from pre-finished hardwood flooring and ceramic tile using tap water, as tested at a 3rd party lab.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245503011"
            },
            {
                "name": "Mops & Bucket Sets",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=23537016011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "19.5 x 12 x 12 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.54 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Freudenberg Household Products"
            },
            {
                "name": "ASIN",
                "value": "B01MCVXNSG"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "160120"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 48,847 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#398 in Health & Household (See Top 100 in Health & Household) #2 in Household Mops & Bucket Sets"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Machine wash"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Mop Head"
            },
            {
                "name": "Color",
                "value": "Easywring + 3 Extra Refills"
            },
            {
                "name": "Material",
                "value": "Cedar"
            },
            {
                "name": "Handle Material",
                "value": "Wood"
            },
            {
                "name": "Handle Type",
                "value": "Telescopic"
            },
            {
                "name": "Head Material",
                "value": "Microfiber"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/882d44b8-ab8e-48b3-a6a1-0fcd3dd62994.__CR0,0,4043,2501_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c9fd6d6-bed8-4c45-9ecb-7b8f17576c7f.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51a8a0e9-56bc-4985-b7b7-8b34ead0202d.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c17b3d6-437b-4e00-a955-13cb224e4e71.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5df0cab6-4a36-491b-9a08-e7e174b7ada5.__CR0,0,4043,1250_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "k",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF2F2TOUS26NFFZX5WESP3AEX4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4JFVCIQW6UHJ?ASIN=B01MCVXNSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "5.0 out of 5 stars No bending over to wring the mop!!!",
                "reviewText": "Main Points: Expensive as mops go & does a decent job, but well worth the extra money as it saves all that mop hand-wringing.Purpose: Replace traditional cut-end mops with an easier to wring mop without spending a lot on replacement mop head supplies. Using to mop tile floors in two 5000sqft buildings.Pros:1. Very easy to wring (foot activated). I am recovering from a hand injury which prevents me from wringing a mop without pain. So this is great!2. Can control how wet the mop is simply by controlling how fast & how many times spin the mop head.3. Does a good job of cleaning, evening sticky stains. Never have to worry about \"refolding\" like with cut-end mops.4. Mop bucket comes with this system. In the past, I spent this much just for a heavy-duty hand-wringing rolling mop bucket for our traditional mops.5. Spin-mop heads really last. I've used heavily for 2 months (originally a really dirty/gunky floor) & haven't had to replace the mop head yet.Cons:1. Spin-mop head is relatively small. You will end up doing more back-n-forth. For our two 5000sqft buildings, it adds up. But not having the hand-wring the mops, and the ease of use, is worth it.2. No wheels on the bucket, you have to carry it around.Neutral:1. The spinning gears are plastic, which makes me wonder how long this will really last.2. The mop handle seemed awfully flimsy upon first adjusting/tightening, & I've read complaints about them not working properly. But my handle has stayed stiff & in place so far.3. I don't plan on washing the spin-mop heads in my clothes washer. Third party spin-mop heads are so cheap now, I've bought those to simply replace when the time comes. I was expecting to replace them every 2 months, but the original mop-head has continue to hold up well.4. No rotating grip on the mop handle. So when the mop is spinning to wring, you have to gentle \"hold\" the handle so it spins freely. If you have sensitive hands, this is not for you -- but then again, if you have sensitive hands you probably shouldn't be mopping.This was a good purchase. I bought a second one for myself to use at home.",
                "reviewVotes": "76 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen L. Hope",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPTTQ46XH6YZVHHR7GMZMRJTSSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R304IR61OPCWSY?ASIN=B01MCVXNSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars This thing is amazing!",
                "reviewText": "I don’t write many reviews, but this is the easiest, most cost-efficient, and effective system ever! Vacuum the floor first, fill to the line marked inside the bucket, snap the microfiber mop head in (SO soft!!), screw the handle together, and have at it! The wringer part of the bucket is fantastic. No chemical cleaner either. I purchased the cleaning pods you can put in the bucket as well. Buy this — you won’t regret it.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3ZQA744B2ABNUXGJDSIZLJ6LGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDBH8SQAR4AL3?ASIN=B01MCVXNSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Mopping made quick and easy",
                "reviewText": "I used this mop for the first time today and it is an OUTSTANDING product. I don't have a lot of bare floor to mop but with the rain, snow, salt and mud being tracked into the house the floors were hard to keep clean. I used Swiffer wet cloths but the shape of the mop does not allow much flexibility into corners and tighter spaces. And the cloths were getting extremely expensive, crazy expensive. I could not be happier with this product, it does an excellent job cleaning and I don't have to touch dirty pads or wring a dirty mop. It is easy to set up, use and put away. I would highly recommend this mop to anyone.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JD-NYC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENLZRA2FUR4GCENYT576RVKGUVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HQ1NQOMJVAGO?ASIN=B01MCVXNSG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Great Mop; Good Bucket!",
                "reviewText": "I had used this mop at work, and so I bought one for home. It really does an excellent job cleaning floors, and because you spin a lot of the water out of the mop, the floors dry quickly. The mop assembled very easily and it seems to be strong, but it does have limitations.There are really only two issues I found with this mop and neither is major. First the long handle “feels” a little weak so you have to be careful not to put a lot of weight into your scrubbing. That is why I only gave it a 4 star review for deep cleaning. The upside is you could replace the handle with a wooden painter’s handle, if it ever broke. The handle’s end is threaded so you can get any threaded handle as a replacement; I’m just recommending (if needed) a 4 foot wooden painter’s handle because they are very strong.The other issue is the bucket, and I never noticed this at work. The way the bucket is designed, when you lift it up, it tilts forward. The handle is in the center of the bucket, BUT because of the mop’s spinning mechanism the bucket doesn’t fill evenly. Water is only in the front 2/3’s of the bucket, so when you lift it, it tilts forward. Just be aware of this so you don’t over fill the bucket, or you’ll have water on the floor every time you lift it. I never noticed this at work, because I don’t move the bucket; it sits on the floor next to a floor sink ad I work it right from there.With these two negatives being mentioned i still recommend this mop and bucket system! It does a great job of cleaning and it is way superior to a sponge mop. It leaves no water lines or drops on the floor and it does a quality job of picking up any spills. The mop head seems to hold in the dirt until you put it back in the water and wring it out. Like I previously said, the floors dry very quickly when you are done, so you don’t have to stay out of those rooms for 30-45 minutes waiting. If it weren’t for the bucket issue of being unbalanced, I would give this mop a 5 star review!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Effie KV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWB7AW62TOVST6NCGNW6RNRAZMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E43Z7VCA39QI?ASIN=B01MCVXNSG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy to use",
                "reviewText": "Love this mop, it's easy to use. Loved the fact it came with extra mop heads, especially since after using one on the floor for so long there is no way to get it clean \"like new\" ever again. They keep their shape, they don't shed, they clean nicely. I have vinyl laminate floors that look like \"fake\" wood and this mop works perfectly on them. It spins out the water just like it's supposed to. After wringing out the water, the mop head dries rather quickly. I'd buy this again for sure.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pippi Longstocking",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2023",
                "reviewTitle": "My floors have never been so clean",
                "reviewText": "I bought the O-mop after reading review in the NYT, and boy am I happy I did. My floors have never been cleaner - because I’m motivated to clean them! This mop is so easy to use and keep clean. The centrifugal feature works fantastically and I love that you can get so much water out of the mop this way. Once you’re finished mopping, just throw the (detachable) mop head into the washing machine, and… voila! I wish I’d bought one of these years ago.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MERCEDES JB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 26, 2023",
                "reviewTitle": "Es pequeño y más o menos límpia",
                "reviewText": "Es pequeño",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sandra trampenau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 5, 2023",
                "reviewTitle": "Best mop on the market",
                "reviewText": "The best mop I have ever used.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RONALD LIM HKRONALD LIM HK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on November 29, 2021",
                "reviewTitle": "Spin Mop Set",
                "reviewText": "Second purchase. Good product. Will certainly buy again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/215UltI-LnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 1, 2023",
                "reviewTitle": "Muy bueno",
                "reviewText": "La calidad de las mopas muy buena",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}