{
    "remaining_requests": 28234,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Eyliden-Cleaning-Anti-Shedding-Disposable-Cleanerm/dp/B0CD7H2RPW",
    "body": {
        "name": "Eyliden Mops for Floor Cleaning, Anti-Shedding Sweeper Mop with 12 Refills, Wet Pads Disposable for Multi Surface Floor Cleanerm, Sweepers Wet Starter Kit for Hardwood Laminate Tile, 13 Piece Set",
        "price": "$18.99$18.99 $17.99$17.99",
        "originalPrice": "$24.99",
        "rawPrice": 18.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Eyliden-Cleaning-Anti-Shedding-Disposable-Cleanerm/dp/B0CD7H2RPW",
        "soldBy": {
            "sellerID": "A1O9ZVT18CDQAF",
            "name": "Eyliden US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1O9ZVT18CDQAF&asin=B0CD7H2RPW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CD7DZKW8"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 25% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bPg9 XQ4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Hzckxt1eL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511WyLV1B4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Vx4qGCPQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411zylrR2HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iphFduKkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411i5ePZovL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Eyliden Store",
            "link": "https://www.amazon.com/stores/Eyliden/page/8554D7B9-613E-4209-9DAE-AF1BB03D3C8B?ref_=ast_bln"
        },
        "brand": "Eyliden",
        "merchantInfo": "Eyliden US",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 24,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 8 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Sweeper Mop Package Content】Eyliden Small Mops for Floor Cleaing Kit includes: 1 patents mop, 12 wet mopping cloths. Just remove the dirty cloth and toss it after cleaning. The long handle prevents your body from bending. 360 degree swivel head, you can mop around the stairs, furniture and table legs flexibly.",
            "【Patented Design Mop】Compared to other disposable mop drivers, Eyliden engineers have designed a unique buckle cover that keeps both dry disposable floor cleaning pads and wet cleaning cloths securely fastened to the mop cleaning driver, so you'll never have to worry about the pads falling off during use.",
            "【Fits Most Replacement Pads】Right Size to Use: the sweepers mop measure about 10 x 4.3 inches, suitable for most wet and dry replacement pads (Compatible with Swiffer Sweeper Dry & Wet Mop Refills), nicely improving cleaning efficiency and bringing a lot of convenience.",
            "【Wet Mop Refills】Wet mopping cloths measure about 9.8 x 8.7 inches, suitable for most sweepers mop. Re-Openable package design, effectively preventing moisture from evaporating. Include 12pcs wet mop refills pads. The disposable design is convenient for you to throw them out after use, making housework easier.",
            "【High Quality, Widely Applicable】Sturdy pole with high quality material for long-term use. the wet mop cloths refills are made of quality non woven cloths, soft to use for floors, not easy to tear or break. And floor wet cleaning pads are widely applicable for hardwood, ceramic tile, vinyl floor and furniture surface."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245503011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/accessories/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2245508011"
            },
            {
                "name": "Replacement Mop Pads",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=23537025011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "10\"L x 4.3\"W x 47.4\"H"
            },
            {
                "name": "Item Weight",
                "value": "3.05 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Jiaxing Jackson Travel Products Co.,Ltd"
            },
            {
                "name": "ASIN",
                "value": "B0CD7H2RPW"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "FWS-16"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 24 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#91,605 in Health & Household (See Top 100 in Health & Household) #264 in Household Replacement Mop Pads"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "Eyliden"
            },
            {
                "name": "Color",
                "value": "Green"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor, Tile"
            },
            {
                "name": "Handle Material",
                "value": "Iron"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4ba25812-5cd2-456e-bf09-da0ed4455eb7.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8a0638e-25ba-430f-ae99-e2dea9f0d187.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9635c81b-7f9f-482a-9827-eb0ca87b224b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36e276d9-a6bd-4c50-b8c4-376a1d6c05c4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7804b76f-1d2a-45d0-87c9-5ecddafe2518.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "charles regan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYCRFESAUCQKLV6HRHM3DFILQGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NRGHU53MY52F?ASIN=B0CD7H2RPW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars LIFE CHANGING DISPOSABLE MOP!",
                "reviewText": "THIS MOP IS VERY VERY STURDY UNLIKE THE CHEAP PUT TOGETHER MOPS A WAL MART AND ONLINE WITH THE 'BRAND NAME' COMPETITION! THE BEST PART IS THE WAY IT HOLDS THE CLEANING PADS ON THE MOP HEAD....NEVER SEEN ANOTHER LIKE IT! BY FAR BETTER 'MOUSETRAP' LOL SERIOUSLY, THE PADS ARE CLIPPED INTO PLACE INSTEAD OF SHOVED INTO THOSE CRAPPY HOLES THAT ARE SUPPOSED TO HOLD IT BUT NEVER DOES. THE MOPPING HANDLE IS STURDY AND DOES NOT BEND LIKE THE CHEAP CLICK TOGETHER MOPS THAT ARE THE NORM.ALL IN ALL BEST DISPOSABLE MOP THAT SHOULD LAST A LONG TIME GIVING GREAT RESULTS!! WORTH EVERY PENNY AND I WILL BUY AGAIN WHEN IT FINALLY GIVES UP THE GHOST! LOL :) BUY IT YOU WON'T BE SORRY!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "secretsoftheuniverse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJCJAOBWJIUU3NP4EB3V7NZJWRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M0LGOOHHR0P6?ASIN=B0CD7H2RPW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars Can be disassembled for storage in a small space.",
                "reviewText": "This multi-surface wet mop can be disassembled into six pieces. Each of the six pieces measures 12 inches long or less. That fact that this sweeper can be compacted and then stored in a very small space makes it a good option if a portable mop is needed. For the very same reason this sweeper mop is a good option for use in a smaller apartment or a smaller home.Because they are wet the 12 antibacterial floor wipes that are included with this sweeper feel a bit heavy. The wipes are likely to drip when they are being installed onto the mop so hold the mop over the floor you are about to mop when loading them.I used one antibacterial floor wipe on this sweeper to mop two different rooms. The rooms have two different types of vinyl flooring. I was surprised that this mop found hair and dust that I could not see.While the antibacterial floor wipe picked up the dust and some heavier items like a lemon seed, hair tended to be pushed into a dark-looking lines on the floor. I had to pick those lines of hair up by hand. The first room that I mopped looked nice and shiny once I had removed those dark lines of hair.The second room also looked nice and shiny but the mop did leave a couple of smears on that floor. I am not sure why the mop left smears on that floor and not the first vinyl floor, but the smeared areas in the second room were near pet food bowls.The two rooms that I had already mopped were fairly small. I wondered if the wet floor wipe could handle mopping another room. The floor wipe had picked up a fair amount of dirt from the first two rooms so I tried flipping the wipe over and using the clean side. The wipe was no longer wet enough to do a good job on the floor in the third room.I like that this multi-surface wet mop sweeper can be disassembled and stored in a small space. For cleaning purposes I would call it light duty. I could not smell any strong scent of lemon from the antibacterial floor wipes, but, I lost my sense of smell a few weeks back and I am not sure it's back to normal yet.I rate this wet mop sweeper kit with 12 antibacterial floor wipes four stars.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Poppitz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTDW62EYYO6CGYSPXZALP2IRZTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WVD81D4XZLI9?ASIN=B0CD7H2RPW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Quite sturdy.",
                "reviewText": "I was surprised to see this all fit in a small box, and when I noticed the 4 sections of handle I was skeptical. I thought it would be wobbly. That is not the case. Each section has on overlap of one inside the other of over and inch, and when screwed together they are very secure. I'm a big guy and I put a substantial amount of pressure on this and it held straight during use. After I was done with the floor, the handle was still tight and strong.The wet pads are quite wet, in fact it left a lot of standing liquid for the first 8 ft of use. I mopped my kitchen and utility room with one pad. When I got around my kitchen to where I first started, I went over the first part again to pull up the standing liquid to re-wet the pad. This worked well to keep going and let the first part dry faster. My kitchen tile is white, after going back over the first part with a used pad, it left no signs of dirty water streaks, so it holds on to the dirt well.The pads were able to loosen and pick up stuck on debris from the tile and vinal flooring, but they left any large items. I did not vacuum before hand because I wanted to see if the pads would pick up loose things like tiny rocks, grass, paper bits. I live in the country and on a gravel road/driveway, so more dirt than usual gets tracked in. One thing some people do, myself included, is use a wash cloth with these mops, you can still use one with this head. Doing so picked up all the loose debris left behind from the pad. Of course vacuuming first would have picked them up.We have a floor mate which does a great job, but leaves about 2 inches around the edges that it doesn't clean. It's quite a job using this and it's loud.This Eyliden mop will be a great in between cleaner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPVHIMWEO55JUEKSXGHYWWOGA3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36U3V8CK03OWE?ASIN=B0CD7H2RPW",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "3.0 out of 5 stars Works great for short people doing small jobs",
                "reviewText": "I got this to replace a traditional mop because the mop head seems like it would be full of germs and I can't remove it to wash it in a washing machine. This mop uses refills, so the cleaning surface would stay pretty fresh. On the other hand, I dislike having something that I throw away after using it once. I figured when this runs out of refills (comes with 12), I can use rags with cleaning solution on them and throw the rags in the washing machine.My living room, kitchen, bathroom, and office all have tile floor and probably aren't more than 900 square feet. I used four refills and because they ran out of moisture fairly often, I supplemented it with Windex. If I were going to use rags on the mop, this wouldn't really be concern. What is a concern is that I am only 5' 7\" tall and this mop is so short I can't hold it at enough of an angle to get some leverage on it. It's also pretty narrow. It felt like a whole lot of work to cover 900 square feet.But its smaller size makes it perfect for smaller jobs that I would do every day, like just cleaning up in the kitchen in my work triangle area right after meal prep. It's also great for getting into the little corners under the cabinets that the mop misses. So I'll continue to use the unwieldy mop for larger jobs, and the smaller one where getting out the mop is too big of a hassle.With those caveats in mind, I do recommend this product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}