{
    "remaining_requests": 28375,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SEVENMAX-Cleaning-Refillable-Washable-Hardwood/dp/B07F2GMDS9",
    "body": {
        "name": "Spray Mop for Floor Cleaning, HOMTOYOU Floor Mop with a Refillable Bottle and 3 Washable Microfiber Pads, Dry Wet Spray Mop for Home Kitchen Hardwood Laminate Wood Vinyl Ceramic Tiles Floor Cleaning",
        "price": "$19.99",
        "originalPrice": "$28.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SEVENMAX-Cleaning-Refillable-Washable-Hardwood/dp/B07F2GMDS9",
        "soldBy": {
            "sellerID": "A3FVCSVPOJ74LV",
            "name": "Carsoner",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3FVCSVPOJ74LV&asin=B07F2GMDS9&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQXFKX4M"
        ],
        "asinVariationValues": [
            {
                "asin": "B07F2GMDS9",
                "variationName": "Size",
                "variationValue": "4 piece set",
                "price": "$19.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BFGVJGHY",
                "variationName": "Size",
                "variationValue": "Spray Mop with 4 Mop Pads",
                "price": "$26.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413hZnEwbLL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/419tBu9A DL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412WpZvU5yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51I9Tm8gzRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41UyEeCJWfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B14xB7HGCjL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the HOMTOYOU Store",
            "link": "https://www.amazon.com/stores/HOMTOYOU/page/9A1E8B49-D47F-4B34-A8C8-AA286A3BBD6D?ref_=ast_bln"
        },
        "brand": "HOMTOYOU",
        "merchantInfo": "Carsoner",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 7102,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 14 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Ergonomic Design】The responsive spray head allows you to spray the right amount of cleaning solutions as you desire, avoid waste and soaking your delicate wood floor. It also can swivel 360°, easily get around bulky, heavy furniture and cleaning the floor under furnitures or corners. Harmless to floor, reusable microfiber pads go for all floor types, such as Hardwood, Laminate Wood, Ceramic Tiles, Vinyl and etc.",
            "【Save Your Precious Time】Are you tired with tedious housework?Are you tired with the heavy bucket or dripping traditional mop? Our spray mop will be a nice helper for you, making the floor cleaning a breeze. This HOMTOYOU wet spray mop comes with a water tank, just slightly press the handy trigger on the handle to get a wide, consistent spray of water mist. With our spray mops for floor cleaning, no need to drag the bucket around, no need to worry soaking your wood floor anymore.",
            "【3 Free Replacement Pads】Considering that you do not want to wash the mop pads while mopping the floor, our spray mop set comes with 3 thoughtful microfiber mop pads. These mop pads have millions of microscopic fibers, which are super absorbent and can effectively grab dirt, dust, and hair. And both machine wash and hand wash are available, no need to constantly buy the disposable cleaning pads anymore, our economical reusable spray mop for hardwood floors is a wonderful choice for you.",
            "【Cleaning Solution Options】The refillable bottle allows you to choose the best cleaning solution for your needs, like: water, a diluted cleaning solution, or a major brand floor cleaner. Most cleaning solutions are available to be added in the water bottle, except strong acid and boiling water. By the way, please cleaning the water bottle everytime after finished the mopping as it is helpful to prolong the lifetime of your spray floor mop.",
            "【Purchase with Confidence】Every purchase comes with 12 month worry-free warranty and free lifetime technical support. If you have any problems with our spray mop, please feel free to contact with us, our professional technical team is always ready for you. Please note: All of our spray mops will be added water to test whether the spray function is OK, so it is normal that there might are some water in the bottle when you receive the mop. We promise that all the mops you received are brand-new."
        ],
        "description": "Are you fed up with traditional mops? Are you tired of hauling around a heavy bucket and mop to clean your floors? Do you want to get rid of bulky bucket? Please don’t worry, our wet spray mop can help to get your home sparkling without striking a blowing! We've combined a mop and cleaning solution into one efficient tool, which will help you reduce the possibility for back-aches. There are some reasons why you need a HOMTOYOYU spray mops: ❀Easy Operation: No need to carry a bucket; it will greatly relieve you from pain in arms.❀Multifunctional Mop: Suitable for flat floors, glasses & windows: Imagine having one tool that does all of floor mopping, window cleaning & glass wiping!❀Comfortable Handle Grip: The ergonomically designed handle gives you a comfortable grip to easily reach the trigger. So you can squeeze the trigger effectively to spray only the required amount of liquid. Thus you can clean any type of floors without damaging the wooden floors.❀360 Degree Swing: The mop head can swing 180 degrees. It turns and twists to provide twice the coverage, which is easy to reach every corner of your room with ease, even the narrow spaces between furniture.❀Spray mist, not water! Our wet mops for floor cleaning finely sprays sufficient amount of mist which supplies enough moisture to clean your floors / windows.❤How to install the spray mop: ✔Please press the white button to connect all the three stick handles together; ✔Please insert the bottle with strength; ✔Attach the Lower Handle the Mop Base with strength; ✔Place the Microfiber Cleaning Pad onto the Mop Base.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245503011"
            },
            {
                "name": "Wet & Dry Mops",
                "link": "https://www.amazon.com/wet-mops/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2245507011"
            },
            {
                "name": "Dust Mops",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=23537023011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "12.8\"L x 4.72\"W x 47.54\"H"
            },
            {
                "name": "Item Weight",
                "value": "0.71 Kilograms"
            },
            {
                "name": "Manufacturer",
                "value": "HOMTOYOU"
            },
            {
                "name": "ASIN",
                "value": "B07F2GMDS9"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "US-CAR-300TB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 7,102 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,491 in Industrial & Scientific (See Top 100 in Industrial & Scientific) #7 in Commercial Dust Mops #26 in Household Dust Mops"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "HOMTOYOU"
            },
            {
                "name": "Color",
                "value": "Spray Mop With 3 Mop Pads"
            },
            {
                "name": "Surface Recommendation",
                "value": "Window, Floor, Tile"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Durable Sprayer System Features meticulous nozzle, spraying water evenly, save water and your efforts Microfiber mop Pad -Core of the mop The Selected mop pad braided with microfiber fibre and carbon fibre , the end of the hook-shaped fiber can catch minimal dust and debris, so it can deep cleaning your whole house. With its' excellent gripping ability, since we test for many times, there is no pushing dirt and dust around, it collected every little dust in your house, cleaning at ease It suit for all floor types, such as Hardwood, Laminate Wood, Ceramic Tiles, wooden floor, vinyl, linoleum, cement, tile, laminate, stone and concrete floors or more",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b8877258-eea0-4ecc-8c67-642fb5c28f9b.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8ae07955-40a2-4321-9d66-de43377c65c4.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            },
            {
                "media_text": "360 Rotatated Mop Head Leave no dead ends in your house with this 360 degree roatable mop Easily manueuvre around hard-to-reach spaces, edges and corners, clean thoroughly all types of narrow spaces Practical Scraper Come with a bonus scraper, can be used to scrape hair and dirt off from microfibre cloth, what's more? The flat edge can also scrapes excess water built up on cloth after mopping and tough dirt on floor Slim Design For Narrow Place Being bother by cleaning under the couch or cabinet? Our spray mop designed with slim size to reach out every narrow corner in your pleace compare to other mop",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/61764fae-4f13-43d4-818e-feb75ba6cd18.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1c543a46-d72d-41fa-8755-7ee6b33ed51c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/acf94749-3f03-49a9-8fd5-5bdaf5701e42.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d1034676-ce8a-4034-94c8-4a8c7d7de95f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9dded393-02f1-46d5-8103-39eb8dda3568.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b8877258-eea0-4ecc-8c67-642fb5c28f9b.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8ae07955-40a2-4321-9d66-de43377c65c4.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/61764fae-4f13-43d4-818e-feb75ba6cd18.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1c543a46-d72d-41fa-8755-7ee6b33ed51c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/acf94749-3f03-49a9-8fd5-5bdaf5701e42.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d62747ef-fda7-424f-9d2e-fcad78176d77.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "PRINA MARTINE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7PEVG534VHM5H7AVWLBGIUNQZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UMIQNK96MT9O?ASIN=B07F2GMDS9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 22, 2020",
                "reviewTitle": "5.0 out of 5 stars Exactly the kind of mop I was looking for - just needs one upgrade",
                "reviewText": "We have linoleum and tiles in the house that get dirty quickly. Aside from our cats, there are also the occasional spills and whatnot that we have to clean up. I’ve tried several different mops but this is my first time using one with a spray. I wasn’t sure if it was what I needed but now that I have it, mopping has become a lot easier! It really speeds everything up.I followed the instructions and assembled it in a few minutes. Just a lot of snapping things together. Obviously the next thing I did was put it to the test. I poured a water and vinegar mix into the bottle it came with and used it to clean our laminate floors. The spray trigger at the top of the unit was easy to use and dispensed just the right amount of liquid. I like how it doesn’t require any batteries…no extra costs!Pros:This mop is a lot lighter than the mop I was using before- this makes it very easy to maneuver around the house. The mop head also moves in multiple directions, which is great for when I’m trying to get underneath beds and other furniture.The container is also a great size. The mouth is nice and wide which makes refilling easy. The fact that you can use whatever cleaner you want is great too- I hate being tied down to a certain product. I might add a few drops of essential oil next time, just to give it more of a fragrance.Cons:The pads wore out quicker than I thought. Two months in, I found myself having to buy refills because they no longer absorbed water that well. Instead of getting the ones that came with it however, I got the mop pads from turbo mops. They’re a little longer than the original ones but they work a lot better, in my opinion at least.",
                "reviewVotes": "156 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVHJTXSW3BNHRJ2A6JSBHM46MIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TN3SROWV6FIB?ASIN=B07F2GMDS9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Love this!",
                "reviewText": "This mop is awesome! You can actually wash the cleaning pads in the washer, and you can add your own cleaning solution to the bottle that will spray onto the floor. Better than a swiffer wet jet in my opinion!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCFZD4I25UKPSLVLAAXV23XQSMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA5EM40F9ECIK?ASIN=B07F2GMDS9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2022",
                "reviewTitle": "4.0 out of 5 stars Pay for what you get, but it's decent and serves it's purpose.",
                "reviewText": "In short - you get what you pay for. It gets the job done and it will absolutely serve it's purpose of saving money on spray products and pads. The wide head is nice but to say it saves time cleaning is a stretch. Lightweight but not sturdy, I feel like I will break this faster than I did my old Swiffer. I'm 5'6 and feel like I'm bent halfway over to mop. Feels shorter than a Swiffer.Cons: it's cheaply made, not sturdy at all in comparison to Swiffer (which isn't very sturdy itself), leaks through sprayer hole as I mop which sucks, have to go back over areas to get up drips. It's shorter than I expected so I'm bent over.Pros: it's very lightweight. The spray is a very fine mist and has great coverage. Pads are machine washable and have held up in the wash really well so far. Solution container is small but it really goes a long way because the most is so fine. Also fits under things easier because of it's size.It's really mediocre but for the price compared to similar, bigger brands, it's a good spray mop. I'm happy with it but I don't know how long it will last. I break Swiffers like it's my job so I have a feeling this one will be in the trash soon, and I'll spend the money on a better known brand - but if this thing lasts longer than my Swiffers I'll probably buy another one! Time will tell",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stanimira Castro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAKMFZVF273FQHADUOOCF62BMCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O8ANBNTACB25?ASIN=B07F2GMDS9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Flimsy but I love it",
                "reviewText": "It’s flimsy for sure and I wonder when it’ll just break while I’m cleaning, but I still love it. It’s so easy to use and I mop my flowers everyday now. This sounds like a generic ad I know, but really…mopping is the worst and this little thing makes it so much easier.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Neil Amundson ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIVGPPYAM6I52DWAYITYYNQSW3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15ETTOWMNWJD2?ASIN=B07F2GMDS9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "3.0 out of 5 stars Nice mop but could be more robust.",
                "reviewText": "Great mop, does the job but defiantly not for deep cleaning or scrubbing as the handle and construction are too weak.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQOFT6IZQ42N7B5OGPC5PMMSSMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW28QN8D4KDCI?ASIN=B07F2GMDS9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Mop for a Small Space",
                "reviewText": "This mop is easy to put together and very slim. I will eventually try to hang it, but for now, it can be stood up and leaned against a wall without the wet pad touching if I've just used it. I love that it comes with reusable pads that you can wash and that you're able to add your own cleaning product instead of relying on having to purchase a specific brand or fell wasteful if you don't utilize a provided product.It's easy to add more liquid in the vessel and is lightweight. You can kind of control the amount of liquid that comes out when you squeeze the sprayer. You can't make it more powerful than it already is, but you can squeeze lighter and less liquid will come out as well as not travel as far.I have two cats and moving into a small space has been made more enjoyable with this mop because I can clean up spills and accidents easy without pulling out a whole song and dance. I will say that if something has been sitting on the floor and dried, you have to let the water sit for a bit, not the best for super deep cleaning, but I wouldn't expect a product like this to work like that.I highly recommend this product and feel you will be pleasantly surprised by it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Romine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4GJML2OOKYYJOWXU2DC2NRHV5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E0783W14GRUT?ASIN=B07F2GMDS9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect Item",
                "reviewText": "This spray mop is easy to use and does a very good job.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "30-Something Male30-Something Male",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKIW6N4DD2WQIXON6FAACS3XRWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21K0QKQ4NX37R?ASIN=B07F2GMDS9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Perfect for a tiny apartment!",
                "reviewText": "Perfect for a tiny apartment with small floor space. It's compact and easy to set up and put together.The bottle is small and only hold about your standard water bottle in the amount of fluid but that is easy to work with in a space that requires only a little attention. It came with a little detailing tool that can be used to clean the pads of hair before washing and I imagine the blades and hooked edge can also be used as scrapers for edging the floor, with the silicone portion also kind of used as a scrubber.The thing is pretty handy and fits perfectly in storage in a small space because it itself is tiny.I'm a big guy, so the thing is kinda tiny by comparison, so my only criticism to it would be that it may be easy to manhandled into a broken state if your not careful.Pictures show man hand holding the pump handle and the detailer. Be careful using the detailer to lift off the hairs or you might pull a seam on the pad; thankfully you get three! Also, remember that any left over solution in the bottle should be either dumped or the bottle should be removed and turned upside to avoid having any solution eat away at the rubber seal.I gave it four out of five solely because of it's possible flimsy nature but that may not be honest in the future if it holds up to use. Definitely convenient and worth the money spent",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/615E7t+b1cL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61IeMj1avaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61mqr462RuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61yCvNbGevL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 10, 2023",
                "reviewTitle": "No me gusto",
                "reviewText": "Soy ama de casa, mi casa es grande y siempre estoy buscando productos que me faciliten la vida. Las copas para mi son lo más, me encantan. Esta que además tiene la posibilidad del agua me parecía buena opción pero debes tener en cuenta varias cosas; si tú suelo es de madera o tipo madera queda muy mal el acabado, a manchas. Si es de porcelanato no creo tampoco creo q quedé bien. A mí me sirve en suelo de loseta dura nada más. Y otra cosa ,para que de verdad quedé bien el piso tendrías q estar cambiando la sopa cada vez que cambies de cuarto, por lo que a mí no me compensa porque estás limpiando con lago sucio ..Y dicho esto no la recomiendo, en cambio si te recomiendo lass mopas grandes, pero sin mojar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 15, 2022",
                "reviewTitle": "Very happy with our purchase",
                "reviewText": "Got recommended this mop and are very pleased with our purchase, highly recommend to anyone!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kiran Divakar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 20, 2024",
                "reviewTitle": "Average product",
                "reviewText": "The spray bottle started leaking within 10 days of use. And the Velcro tape on the mop started peeling off. Not good quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 22, 2023",
                "reviewTitle": "Very light and extremely useable",
                "reviewText": "Very happy",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kartini Sameejan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on February 19, 2022",
                "reviewTitle": "Floor cleaning gadget",
                "reviewText": "Love it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}