{
    "remaining_requests": 28356,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cedar-Easywring-Microfiber-Cleaning-Refills/dp/B07VWL357N",
    "body": {
        "name": "O-Cedar EasyWring Microfiber Spin Mop & Bucket Floor Cleaning System + 2 Extra Refills, Red/Gray",
        "price": "$52.04",
        "originalPrice": "$59.97",
        "rawPrice": 52.04,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cedar-Easywring-Microfiber-Cleaning-Refills/dp/B07VWL357N",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CS1VG5Z6"
        ],
        "asinVariationValues": [
            {
                "asin": "B07VWL357N",
                "variationName": "Size",
                "variationValue": "Cleaning System + 2 Extra Refills",
                "price": "$52.04",
                "variationImageURL": ""
            },
            {
                "asin": "B0CK8JZ1MT",
                "variationName": "Size",
                "variationValue": "EW + 2 Power Refills",
                "price": "$44.89",
                "variationImageURL": ""
            },
            {
                "asin": "B0C2QQRHGJ",
                "variationName": "Size",
                "variationValue": "EW + 2 Refills W/Citrus & Lavender PACS",
                "price": "$77.07",
                "variationImageURL": ""
            },
            {
                "asin": "B0C2QPR8M9",
                "variationName": "Size",
                "variationValue": "EW + 2 Refills W/Citrus PACS",
                "price": "$65.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0C2QQJZ6T",
                "variationName": "Size",
                "variationValue": "EW + 2 Refills W/Lavender PACS",
                "price": "$68.05",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/410rF8XUdQL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51R111eL 5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51urHmfkLeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oRZImvS0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41xywsWyDZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ibdA2kM3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61m3OOjq1qL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the O-Cedar Store",
            "link": "https://www.amazon.com/stores/O-Cedar/page/C6E1D10A-404B-46B7-85F0-DFA5FB10273C?ref_=ast_bln"
        },
        "brand": "O-Cedar",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 77372,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 15 hrs 13 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 15 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "REMOVES OVER 99% OF BACTERIA W/ JUST WATER: O-Cedar's EasyWring Microfiber Spin Mop & Bucket Floor Cleaning System provides a deep-cleaning solution for all your at home needs by effectively removing dirt, grime and over 99% of bacteria with just water! It is safe on all hard floor surfaces, including finished hardwood, wood, laminate, tile, vinyl, and more.",
            "HANDS-FREE WRINGING: Our exclusive mop bucket design features a built-in wringer that allows for hands-free wringing while Splash Guard keeps water splash and spray inside the bucket when wringing or when transporting the bucket from room to room.",
            "WASHABLE & REUSABLE MOP REFILLS: The EasyWring Microfiber Mop Head can be machine washed and reused! Keep an extra refill handy for the next mess. Compatible with the Easy Wring Mop Refill",
            "DEEP CLEANING MICROFIBER: O-Cedar's EasyWring Microfiber Spin Mop & Bucket Floor Cleaning System uses millions of strands of advanced microfiber to effectively capture dirt and grime with just plain water, eliminating the need for harsh chemicals. Safe for all hard flooring, including finished hardwood, wood, laminate, tile, vinyl and more.",
            "REACHES IN CORNERS: Due to the patented triangle mop-head and ability to rotate 360 degrees, the EasyWring Mop can reach and clean deep into corners, under furniture, alongside baseboards, and between tile.",
            "NEW REFILL, CLEAN START: Be prepared for daily messes with extra mop refills. Assign each room in your home its own refill and avoid spreading dirt from one area to another. Stock up ahead of time so you’re always ready for the next mess.",
            "CLEAN BETTER WITH A MICROFIBER MOP: Our streak-free microfiber mops easily attracts and locks in dirt, dust, pet hair, grime, dried-on or sticky messes better than a traditional cotton wet mop. It can be used wet or dry for mopping or dusting"
        ],
        "description": "Enjoy a fast and fun floor cleaning experience! The O-Cedar EasyWring Spin Mop and Bucket Cleaning System features hands-free wringing thanks to our unique foot pedal spin mop design, so you have less mess when mopping. Control the amount of water and moisture applied to floors making for easier wringing and quicker-drying floors. O-Cedar's EasyWring microfiber mop delivers a better clean by effectively removing dirt and grime with just water. The EasyWring is a better way to truly clean your floors! Anyone can use this mop, as the telescopic handle adjusts up to 51\" in length with the mop head attached. This mop is safe and effective for all hard floor surfaces, such as hardwood, tile, vinyl, and more! The microfiber mop head refill is reusable and machine-washable! Replace the mop refill pad every 3 months for optimal results.Features: Hanging Loop/Hole,Reusable,Washable",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b?ie=UTF8&node=2245503011"
            },
            {
                "name": "Mops & Bucket Sets",
                "link": "https://www.amazon.com/b?ie=UTF8&node=23537016011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "19.63 x 11.75 x 11.5 inches"
            },
            {
                "name": "Item Weight",
                "value": "5.3 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "AmazonUs/FRVKE"
            },
            {
                "name": "ASIN",
                "value": "B07VWL357N"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "041785998809"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 77,372 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,545 in Health & Household (See Top 100 in Health & Household) #7 in Household Mops & Bucket Sets"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Care instructions",
                "value": "Machine or hand wash. Do not wash with fabric softeners or bleach. Lay flat to dry. Rinse bucket with water and allow to dry before storing. Store bucket in dry conditions. Do not expose to excessive sunlight."
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Easy Wring Microfiber Spin Mop with attached Mop Head x Easy Wring Bucket x Easy Wring Refill x Easy Wring Refill"
            },
            {
                "name": "Color",
                "value": "Refills"
            },
            {
                "name": "Material",
                "value": "Cedar"
            },
            {
                "name": "Handle Material",
                "value": "Wood"
            },
            {
                "name": "Handle Type",
                "value": "Telescopic"
            },
            {
                "name": "Head Material",
                "value": "Microfiber"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/882d44b8-ab8e-48b3-a6a1-0fcd3dd62994.__CR0,0,4043,2501_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c9fd6d6-bed8-4c45-9ecb-7b8f17576c7f.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51a8a0e9-56bc-4985-b7b7-8b34ead0202d.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c17b3d6-437b-4e00-a955-13cb224e4e71.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5df0cab6-4a36-491b-9a08-e7e174b7ada5.__CR0,0,4043,1250_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "andrew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWXUWP3YERSK7AWYWCKXK7H5SWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26UZTD6WU3DI?ASIN=B07VWL357N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Good mop for the price.",
                "reviewText": "I’ve had my eye on this mop for a while now and was so excited when my husband surprised me with it!The concept behind the mop is great. It was simple and easy to use. I was able to mop my living, dining, and kitchen areas (roughly 700 sqft) in about 15 minutes. Which is a huge plus!The spinner is genius! I have hardwood floors and the spinner removed just enough water to protect my floors while still getting a good clean. It made mopping kinda fun, and the bucket was easy to rinse out.It’s lightweight which is great. However, I feel that because it’s so lightweight, some of the structural integrity is gone. For instance, the mop head would detach from the handle periodically from the weight of the head once wet because the handle couldn’t screw in tight enough without stripping the plastic. Not a major issue if you don’t mind tightening it every once in a while.I also love that the mop “refills” are machine washable! Giving you a clean start every time.Overall, the mop is fantastic for the price and I would recommend it to anyone!",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2525E6QMDMVO5VSJSGETZGVLGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MIA2ZB84DF43?ASIN=B07VWL357N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2022",
                "reviewTitle": "5.0 out of 5 stars I HATE mopping - not anymore! This is amazing!!",
                "reviewText": "I have hard wood floors and tile floors to mop. 2 Kids that spill everything. I mop once a week with the regular 12 inch sponge mop type (the kind you pull the lever to drain the water). It works okay, but usually just pushed the stuff around, so you really needed to do a good vacuum and sweep job first. Wanted to try the O-Ceder and finally ordered. Used it for the first time yesterday and was skeptical of the whole spin thing... It worked amazing! Here are some of the PROs that I was really impressed with:- Sturdy design, easy to move the bucket around, has a handle and spout for easy carry and drain- Mop handle is sturdy as well, easy to telescope and retract - takes up minimal space, and attaches very easy to the microfiber mop head- Using the mop itself was actually a thrilling event - it navigates around the corners and tight spots very well. Picks up everything. Just soak in the bucket, then drop it in the spinner and BAM, you're ready to go again!- Mop head is shaped in a triangle so the tip is great for the corners spots, and then flip it around and you have a wider range of mop for more open space mopping. Its really maneuverable. In addition, its not too big that you cant get into smaller areas. My office has lots of tight angles so this was perfect!! (my old mop was too wide, so I had to previously do it by hand).- Its a pretty basic design, so I can see this thing lasting for quite a while. Again, the whole design is pretty sturdy and durable.- Came with 3 microfiber mop heads, which I think should last me a while. I will certainly order more of the mop heads when needed.If you are on the fence, I was too. But I can say without hesitation, this is a great mop and design, and at a great price. I'm not always that impressed, but this had me smiling.",
                "reviewVotes": "109 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine GresserChristine Gresser",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6MIIIPYYJHW7KZ7SFUBPYUFK5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PS7KH0LM5PJ2?ASIN=B07VWL357N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2021",
                "reviewTitle": "5.0 out of 5 stars Great mop: Easy to use & effective",
                "reviewText": "This mop is easy to use. First, you have to make sure to fully extend the entire mop handle. Some reviewers said that this mop handle is extremely short. It’s not. It’s about 48-50 inches long (aka 124-125 centimeters). Other users must have only extended one of the handle extension joints. In the photo I posted, you can see that it’s almost as long as my swiffer mop pole.It can be difficult to see the Max Fill line at first. It’s a few inches below the ridge. See photo. The fill line is molded into the bucket itself, in most cases yours will not have a sticker nor white letters pointing out where the fill line is. You have to look for it under the light before you fill the bucket.This O’Cedar mop got my floors WAY cleaner than a spray mop or a swipe mop (I.e. Bona microfiber detachable mop pad system or Swiffer, etc.).Once I figured out where the Max Fill Line was (lol) it t was easy to wring the mop dry, because the “salad spinner”-esque wring bucket hovers ABOVE the water line in the bucket, so, the more times you press the foot pedal to spin-wring the mop head dry in between or after uses, the dryer it gets.The size of the mop had is perfect: it’s smaller than some, which is great for getting around a kitchen or bathroom with crevices, corners, and nooks.The mop head comes off and goes in the wash. Voila! Good as new.I recommend this mop with no hesitations. I used simply water in mind and I am just loving walking barefoot in my house now because my floors are so squeaky clean. :))",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71-VAM-LbxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B11f9UYqGUS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda W. Sanford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFLVKRUUA3KB6SUZR5QHTXEL6PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21361HG951RBG?ASIN=B07VWL357N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Very easy to use",
                "reviewText": "I don’t mop very often, but when I do, this works very well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPMET2V47YDMEEHM7TNKDIZKG2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ95BSDRIVLN7?ASIN=B07VWL357N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "4.0 out of 5 stars handy item",
                "reviewText": "I do really like this however, I would like it to have some sort of area to put my mop back into clean water. It does a great job on spinning the water out. It is very handy to have and it makes mopping easy. It is a good size and can be easily stored. The mop head replacements are washable, which I love. I would buy this again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Yancey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRIGYNNOR77DJWULJLHJN6QT66Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JCT9DA9HMYK0?ASIN=B07VWL357N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Wonderful system",
                "reviewText": "This is a really well thought-out system. The spin is perfect- no flying water, no spraying out all over the room. The mop heads wash well, and the bucket is easy to rinse out. Very cool.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Review Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHT2YCV5CCHXZE5KFDIFWZTKS3MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VXLZ1OMR1IBH?ASIN=B07VWL357N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Makes cleaning fun",
                "reviewText": "At my big age, even I have fun mopping with this bucket. Long gone are the days of dreading chores with huge industrial sized mops, wringing out a few of those huge thick and heavy yarn laces at a time and STILL over soaking the floor. With this there isn’t even a need to bend. It’s also very lightweight making it excellent for older people. When you’re finished, throw that bad boy in the washer! It’s PERFECT!If there was a con, I would say that the stick isn’t as sturdy as a I wished it would be. Then again, my group might just be super strong from the huge mops I grew up with.Regardless of what you’re used to, I have no doubt you’ll love this product!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DinahT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRTZFLM7HCTVOV5JLXZORBNYLYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R355TCBSC9WAEX?ASIN=B07VWL357N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Greatest inside the Home Mop",
                "reviewText": "Easy, simple elegant solution.Mop with plain water and let the microfiber do the work!I put the dirty mophead in a mesh laundry bag and wash in cool water laundry!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Decent t shirt but the text was so small i was expecting bigger text",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 5, 2024",
                "reviewTitle": "Love it",
                "reviewText": "Easy to use ! Had to change first one as was issue with the mop handle but got it easily replaced.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 29, 2021",
                "reviewTitle": "Mapear es más rápido y fácil, sin tanto mojadero 👍",
                "reviewText": "Ahora sí con gusto mapeo la casa. Excelente producto 👌Y ojalá hubiera tenido esto desde hace años, me facilita mucho limpiar hasta las paredes jajaMe encantóEditado (Actualización): Desde el día 20 de julio, la palanca de pie dejó de funcionar como normalmente lo hace (Se queda pegado y no vuelve a subir). Es una lástima que haya pasado eso, y no sé con quién comunicarme para solucionarlo, realmente me gustaba mucho el producto :'c",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zazaelcholo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 9, 2022",
                "reviewTitle": "Meilleure serpillière",
                "reviewText": "Tellement pratique et efficace",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on November 12, 2021",
                "reviewTitle": "Great product",
                "reviewText": "I like how it easy it is to wring the mop. The bucket, mop shaft and head seem pretty durable. The only drawback is the cleaning of the mop head, takes some effort but only because I hand wash it. Overall great product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "OK",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 6, 2023",
                "reviewTitle": "Too wet and takes 6 times longer to get only half of the water from the mop head",
                "reviewText": "Useless. Instead of having to wring only once you need to press the foot pedal 5 or 6 times and yet the mop head is full of water. Very disappointing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$52.04",
                "sellerName": "FJI INC",
                "sellerRating": "4"
            }
        ]
    }
}