{
    "remaining_requests": 28383,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cedar-ProMist-MAX-Spray-Mop/dp/B01MYNBGQJ",
    "body": {
        "name": "O-Cedar ProMist MAX Microfiber Spray Mop, Red",
        "price": "$25.97",
        "originalPrice": "$27.99",
        "rawPrice": 25.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cedar-ProMist-MAX-Spray-Mop/dp/B01MYNBGQJ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B084JC4K5G"
        ],
        "asinVariationValues": [
            {
                "asin": "B01MYNBGQJ",
                "variationName": "Style",
                "variationValue": "Spray Mop",
                "price": "$25.97",
                "variationImageURL": ""
            },
            {
                "asin": "B077MMJ39Y",
                "variationName": "Style",
                "variationValue": "Spray Mop With 1 Extra Refill",
                "price": "$30.20",
                "variationImageURL": ""
            },
            {
                "asin": "B07FMPT1LG",
                "variationName": "Style",
                "variationValue": "Spray Mop With 2 Extra Refills",
                "price": "$31.42",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51z450egytL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41gb7A8nMyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DVOTTCrRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4161VE9F56L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413CCjMevjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HT3-vaiFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515Jt Ycl3L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81Eeip5hfDL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81Eeip5hfDL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the O-Cedar Store",
            "link": "https://www.amazon.com/stores/O-Cedar/page/C6E1D10A-404B-46B7-85F0-DFA5FB10273C?ref_=ast_bln"
        },
        "brand": "O-Cedar",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 43363,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 14 hrs 15 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 2 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Super-absorbent microfiber effectively cleans with just water",
            "DUAL-SIDED MOP HEAD - The large, dual-sided microfiber mop head flips allowing you to clean floors fast without having to change the mop pad.",
            "REFILLABLE BOTTLE - Just fill bottle with water and add 2 small teaspoons of your favorite cleaning solution and you are ready to shine your floors.",
            "POWER OF MICROFIBER - The ProMist MAX Spray Mop uses the magic of thousands of microfibers to absorb the smallest dirt and dust particles. When switching between cleaners or preparing for storage, fill bottle with water and spray 5 times, discard remaining water",
            "USE WET OR DRY - Versatile microfiber pad allows you to use wet for a deeper clean to shine your floors or use dry for dusting your floors.",
            "ONE-TOUCH BOTTLE RELEASE - The innovative one-touch release allows you to remove the spray bottle quickly and easily. For best results, change refill every 3-6 months",
            "REUSABLE MOP PAD - Save money by washing your microfiber pad for repeat use. Pad is machine washable up to 100 times.",
            "NO BATTERIES - ProMist MAX allows you to easily control the amount of spray with our comfort grip handle and trigger without the need for costly batteries."
        ],
        "description": "Make cleaning easier! O-Cedar's double-sided microfiber spray mop delivers a better clean—not only because it saves cleaning time when compared to the leading spray mop but it removes over 99% of bacteria* with just water. The ProMist MAX is a better and faster way to truly clean your floors! *Removes over 99% of E. coli and Staph. aureus from pre-finished hardwood flooring and ceramic tile using tap water, as tested at a 3rd party lab. When switching between cleaners or preparing for storage, fill bottle with water and spray 5 times, discard remaining water. Fill bottle as usual with new solution or store empty between 50° F – 100° F",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Mopping",
                "link": "https://www.amazon.com/Household-Mops-Buckets-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245503011"
            },
            {
                "name": "Wet & Dry Mops",
                "link": "https://www.amazon.com/wet-mops/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2245507011"
            },
            {
                "name": "Dust Mops",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=23537023011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6.61\"L x 5.51\"W x 23.62\"H"
            },
            {
                "name": "Item Weight",
                "value": "2.01 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Freudenberg Household Products"
            },
            {
                "name": "ASIN",
                "value": "B01MYNBGQJ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "ProMist MAX Spray Mop"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 43,363 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,720 in Health & Household (See Top 100 in Health & Household) #5 in Household Dust Mops"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Specific instructions for use",
                "value": "Floor, Tile"
            },
            {
                "name": "Care instructions",
                "value": "Machine or hand wash mop head. Do not use fabric softeners or bleach. Lay flat to dry. When switching cleaners or preparing for storage, fill bottle with water and spray 5 times. Discard remaining water. Fill bottle as usual with new solution or store empty between 50 - 100 ° Fahrenheit."
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Brand",
                "value": "O-Cedar"
            },
            {
                "name": "Color",
                "value": "Spray Mop"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/06588e6e-83ab-4f8b-801f-a76fb4dd5cc0.__CR0,0,4043,2501_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/faab85c3-6286-47dc-a31d-6f7cdfeee752.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a19d5a10-80ab-40aa-89fe-8a115ae25771.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/41cfe671-0b55-4201-a1a6-68434725812b.__CR0,0,4043,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b0a179ec-faa0-41a9-83cd-1665fcfcdd46.__CR0,0,4043,1250_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "PhotoGraphicsPhotoGraphics",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQ7TVKKSLR6C5MSZDWAYMR2OPCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKE6EC9CQ4858?ASIN=B01MYNBGQJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 9, 2017",
                "reviewTitle": "5.0 out of 5 stars Is this the best choice out there?",
                "reviewText": "It's a fact that most cleaning products are made of cheap lightweight plastic these days, just the opposite of the idea that they should be tough and durable for such a challenging job. I usually try to buy commercial-grade mops, brooms and other cleaning supplies but there seems to be a definite lack of this specific type of damp mop being made for the janitorial industry. And typically commercial maintenance mops are too soaking wet for moisture-sensitive residential-grade wood laminate flooring.I had the popular mop with the disposable pre-moistened pads and while it may be okay for a quick mop-up of a spill in the kitchen it is totally unsuited to damp mop an entire floor plan constructed with laminate. The moisture built into the pad doesn't spread evenly or go where I want it to and there's not enough of it to do even one room before drying out and getting too dirty to be effective.I almost bought the Bona equivalent because I like that the liquid is user refillable but no matter where I looked people who owned them said they were flimsy and broke easily. It was hard to find anything positive, in fact.Then I happened to see this at a store and was impressed that by comparison. It just seemed better made. I like that the mop head is much larger than most and that it can be flipped so I can damp mop my entire downstairs without changing or cleaning the pad. The reservoir is easy to remove and fill and the nozzle is more than just a hole, it sprays a fine mist over a larger area. I like little things too, like the shape of the handle lets me change hand positions if I get tired and the trigger is easy to reach and pump.The wrap-around microfiber pad is superior at scrubbing out little problem spots and the way it attaches is a better design than the stick-on hook and loop pads other brands use. Because it wraps around there are no sharp edges to scratch and dent furniture and baseboards.HINT: there is a push button to release the reservoir for refilling. Because there is a built-in “O” ring to prevent leakage it isn’t as easy to push it back in place as you might expect. It’s a lot easier if you hold the release button in while you press firmly down on the reservoir until it clicks into place. I’m glad that they’ve designed it with such a tight fit … no worries about leakage.Is it commercial grade and will it last forever? No and I doubt it ... it's what you get for the price these days. But all things considered, after seeing all of the choices available, I think it is the best choice out there.",
                "reviewVotes": "1,213 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61U7+wx-veL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61X7kcJSH6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61XmXVwsx9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61Y8gZOUhFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61cwZNXn5hL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valentina Robayo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3SN2ASZUX2B7H3MFQKI6PPBVIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAZZLSGL0DAT0?ASIN=B01MYNBGQJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars So easy I just love it",
                "reviewText": "From the bulding and the use, everything it’s really easy to use. I love that the mop it’s very easy to wash and makes the job insanely good and faster. The water that comes out from the tool it’s very thin but a good amount of water.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEPQ25PJGQ7ZDECJNT65PWOPQGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIQ8DNSMBL9C7?ASIN=B01MYNBGQJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Good for the price",
                "reviewText": "This is my second time buying this mop, my first one finally broke (multiple parts) after about 6 years. This is good for tile, wood, and linoleum floors. You absolutely want to vacuum first before mopping. The sprayer works well unless it clogs (mine eventually did). The handle spray controller is nice and allows for mopping to be done pretty quickly. The plastic solution container can be finicky, I had to buy a replacement for my last mop since the top started leaking and the little rubber control valve thing that attaches inside the top of the lid just falls off all the time, making the water kind of gush out. I wish that part of this product was most stable. The best part of this is the actual mop head. Not only is the base on a swivel so you can use both sides of the cloth pad, but you can take it off and wash it very easily! The Velcro holds the pad in place really well, and it's super easy to take off and put on. Much more effective and eco-friendly, all around, than a swiffer or their equivalent.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kristin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5HNX5HIVHJH734GBQBRKUMGYTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DN3IH78SJMKZ?ASIN=B01MYNBGQJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2022",
                "reviewTitle": "5.0 out of 5 stars Excellent for light cleaning, spot cleaning or small spaces",
                "reviewText": "This mop is perfect for what I bought it for: basic maintenance cleaning in our 2000 sq ft home.The main living areas are wood laminate, the kitchen, bathrooms and mudroom are vinyl flooring. Bedrooms are carpeted (until we rip it out) so obvs not mopping there.We're on a farm and are a large blended family with 2 dogs and 7 people. Our house gets a ton of foot traffic. We mostly take shoes off, but occasionally people run through with them on. The mudroom helps contain a lot of dust, mud, wet dirt and farm boots and such to keep the rest of the house clean.We have a cleaner come every 2 weeks, and I needed something that was simple and fast to keep the house maintained in between her cleanings.This mop does that. I can grab it, swipe it over the floors quickly and it lifts the simple surface dirt. It's easy to use, the sprayer is fantastic and you can angle how you're holding it to adjust where the spray hits the floor. I like that it's refillable with my cleaning solution (I use biokleen bacout cleaners usually), and I toss the pad into the towel hamper when I'm done.Do not expect this mop to clean actual heavy dirt, it can't. I would not use this on my mudroom floors where we get heavy dirt from boots and mucky wet dog paws. It wouldn't touch it as that's a job for an actual bucket and mop and water. However, for a quick mop on floors that just have surface dirt on them this is perfect.Assembly was very easy as well. Definitely make sure you push the bottom pole in all the way or the sprayer won't work (I had to push it in harder then I'd expected).I bought this because I wanted a swiffer style mop without wanting to create constant waste (and continually have to re-buy products). I also didn't want anything with batteries I had to replace either.This does the same job and is much more sustainable. With light mopping a few times a week I feel like the quality is good enough it should last a few years. I'll update if it doesn't. But overall this was a fantastic purchase.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFJQH3ZO457ORJSIAR2EWOXJRZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NC83HEABI9V?ASIN=B01MYNBGQJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great design",
                "reviewText": "I like the pants that come with it. They’re easy to put on. I love the fact that you can fill it with whatever cleaner that you want. One of the features I like best is that the pad can be used on both sides before you have to change it out. It is so easy to use. I love it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Ann Brown",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2024",
                "reviewTitle": "O-Cedar Mop is fantastic!",
                "reviewText": "This mop is awesome! I like that the canister that comes with it is refillable with the cleaning product of your choice! Whether it is Mr. Clean or plain vinegar/water, the mop does a wonderful job. You can move the mop head all around to get under things or go around curves or into corners!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Harün",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 17, 2023",
                "reviewTitle": "A Must-Have Cleaning Companion!",
                "reviewText": "The microfiber pad effectively captures dirt and grime, leaving my floors sparkling clean without streaks. The built-in spray mechanism is convenient and efficient, allowing me to control the amount of cleaning solution dispensed. Assembling the mop was quick and straightforward, and the durable construction assures me of its longevity.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karol Mildred ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 15, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Fácil de usar, casi no requiere agua y no esta pesado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mario",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 10, 2022",
                "reviewTitle": "Es muy práctico",
                "reviewText": "Es un producto fácil de usar, muy práctico para una limpieza rápida.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 1, 2021",
                "reviewTitle": "Amazing",
                "reviewText": "Great product!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}