{
    "remaining_requests": 20779,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fashion-Cute-Heart-Face-Protection/dp/B085BM92CD",
    "body": {
        "name": "Fashion Cute Heart Face Mask - Unisex Organic Cotton Dustproof Mouth Protection - Reusable Warm Windproof for Outdoor Activities",
        "price": "$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fashion-Cute-Heart-Face-Protection/dp/B085BM92CD",
        "soldBy": {
            "sellerID": "A110ZB4OGIK921",
            "name": "Yiiza Directly",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A110ZB4OGIK921&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41EHfihzcZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41ILW7CovvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jQDDGI-sL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514FAuZAmwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51q2DkoP9nL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zh1yqlIIL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Yiiza",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Yiiza"
        },
        "brand": "Yiiza",
        "merchantInfo": "Yiiza Directly",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 28658,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 3 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Yiiza's face mask are made of high-quality cotton, which makes your face soft and comfortable.",
            "It is very easy to breathe after wearing without causing discomfort and skin-friendly",
            "Face mask with heart pattern are so cute and popular makes you eye-catching.",
            "After a complicated treatment, the face cover is soft and thick, and will not let dust, smoke and pollen enter your nose and mouth.",
            "You can also send it as a gift to girlfriend, wife, colleague, boyfriend, friend, baby boomers dad, lover, etc. It is a good product worth sharing with everyone!"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 7.83 x 6.06 x 0.55 inches; 1.45 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ Black heart cloth Mask"
            },
            {
                "name": "Department ‏",
                "value": "‎ womens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ March 11, 2020"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Yiiza"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B085BM92CD"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 28,658 ratings"
            },
            {
                "name": "Brand",
                "value": "Yiiza"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Material",
                "value": "Cotton"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Item Package Quantity",
                "value": "1"
            },
            {
                "name": "Special Feature",
                "value": "Portable"
            },
            {
                "name": "Pattern",
                "value": "Heart"
            },
            {
                "name": "Theme",
                "value": "Love"
            },
            {
                "name": "Size",
                "value": "Medium (Pack of 1)"
            },
            {
                "name": "Style",
                "value": "Fashion"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Fashion Cute Heart Face Cover- Unisex Cotton Dustproof Mouth Cover- Reusable Warm Windproof Coverfor Outdoor Activities - About Size: 140 x 200 mm / 5.11 x 7.87 inches - Material: cotton - Design: Cute Heart Pattern Design - Product Included: 2 pack face cover Thank you for your purchase and wish you a happy shopping.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/1bca3b4a-e417-4950-be26-2f623f0986c4.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/dc459178-709d-462c-83fd-313ef87c9c2b.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/1bca3b4a-e417-4950-be26-2f623f0986c4.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linda Lincoln",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYNO5BE6LV5UCKBWFZ4ZA24OHXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMYVD7KVSVOBW?ASIN=B085BM92CD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2023",
                "reviewTitle": "5.0 out of 5 stars I have purchased this item multiple times. Love it !!",
                "reviewText": "The Yiiza Fashion Cute Heart Face Mask is a stylish and functional accessory that provides protection and peace of mind during outdoor activities. With its cute heart design, organic cotton material, and reusable construction, this face mask offers both fashion and functionality in one package.One of the standout features of this face mask is its adorable heart design. The cute heart pattern adds a touch of style and personality to your outdoor attire, allowing you to express your fashion sense while staying protected. The eye-catching design is suitable for both men and women, making it a versatile option for individuals of all ages.The face mask is made from organic cotton material, which offers softness and comfort against the skin. The breathable fabric ensures that you can wear the mask for extended periods without feeling suffocated or uncomfortable. The cotton material also makes it suitable for individuals with sensitive skin, minimizing the risk of irritation. The adjustable ear loops and nose clip ensure a secure and customizable fit. The ear loops can be adjusted to fit different face sizes, ensuring comfort and preventing slippage. The nose clip allows for a snug fit around the nose, minimizing gaps and enhancing the mask's overall effectiveness.While this face mask offers many positives, it's important to note that the heart design may fade or wear off over time, especially after repeated washing. Additionally, the mask may not provide the same level of filtration as medical-grade masks, so it's essential to follow recommended safety guidelines and use additional protective measures if required.In conclusion, the Yiiza Fashion Cute Heart Face Mask is a stylish and functional accessory for outdoor activities. With its cute heart design, organic cotton material, and reusable construction, it offers both fashion and protection. The comfortable fit, adjustable features, and effective dustproof capabilities make it a practical choice for individuals seeking a stylish and reliable face mask. Stay fashionable while keeping yourself and others protected with this cute heart face mask.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7WCPG723B35ZNPV4ZFHEEYDHCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGGXDW9TINIUH?ASIN=B085BM92CD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2021",
                "reviewTitle": "5.0 out of 5 stars Best Masks EVER!! (Machine washable, soft, great nose piece, prevents fogging, no sore ears!)",
                "reviewText": "These masks are WONDERFUL, definitely my favorite! As a college student I have to wear a mask for hours, talk, and sit through lectures. These are the best I’ve found and I have tried A TON to find ones that check off all of the boxes of comfort.Pros:•Great fit overall, can wear for hours at a time and rarely have to adjust!!•Comfortable ear straps!!! No sore ears here!! This is a must, especially when you have to wear a mask for long periods. These straps are made of the same black fabric on the rest of the mask, they’re not elastic. They are not overly thick or thin and do not pull my ears at all! These are the ONLY ones I have found where the straps are not too loose or too tight (a bit loose before wash/drying, but don’t fall off)•Super soft! These would probably be a great choice with those who have sensory issues! I have allodynia (a type of nerve pain, so I’m sensitive to textures) I’ve had a ton on masks that are rougher fabrics and they tend to bother me. With these I usually forget I’m wearing them.•Glasses friendly! Adjustable nose piece is flat metal strip (rather than those crappy bread tie type ones) and I’ve been washing/wearing these for months and the metal hasn’t broken! Helps keep my glasses from fogging and keeps the mask over my nose. (Pro tip, try washing your lenses gently with Dawn dish soap or shaving cream, it can help with fogging too!)• Machine Washable! I have a smaller face (which makes finding masks annoying, some kids sizes are too small and adult sizes are huge) and after a couple washes (I just throw them in the washer then dryer in a wash bag to protect them) they fit perfectly!! If you don’t have a small face I would recommend air drying them.• The heart is similar to vinyl, so it’s not red fabric or sewn on, but I have had ZERO issues with it peeling off even after multiple washes!!•Simple, but cute! Can be worn at any occasion!•I’m not overly picky about breathability, but I’d say these are the perfect “not too thick, not too thin” masks. They don’t suction to your face when you inhale and exhaling doesn’t feel like your trying to breathe through a pillow.Cons:•These may be too snug for some adults, I’d measure a mask that fits you if that’s a concern.•The ear straps aren’t adjustable, but with the nose piece and fit I haven’t had an issue with that, especially after washing/drying.•Not sure if this would be a con for anyone, the inside of the mask is white, but it is sewn where the black fabric folds to the inside a bit so it is not visible at all when wearing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sohui",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGITKD5UJJDZEMSNTDZJHK6HYE6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UZH8HODN84NX?ASIN=B085BM92CD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Super great and has a bendable nose clasp",
                "reviewText": "I was looking for a mask that would fit my face okay without being bulky underneath since I am pretty small and normal face masks are pretty huge on me. I was able to find this product and because of the nose clasp on the top, it worked really well for me! And they are super cute and comfy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colleen Hall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4O7YKRWA6ZBPKTJY4ROWMHUWUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PXK1KHUD3YQ4?ASIN=B085BM92CD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2021",
                "reviewTitle": "4.0 out of 5 stars Not too shabby, could be more breathable",
                "reviewText": "Bought only to wear on job, I usually don't wear one with the exception of a Drs. Office or a place with super strict policy. I usually wear disposable ones but bought these since I knew I'd need it often. Other reviews complained about getting ones that didn't have the nose bridge type but I got the ones advertised.It's comfortable as far as being over the ears and wide enough to cover whole face. My personal complaint is it's such thick material that it causes me to sweat into the mask and my nose run. If I had to compare it to something I'd say it's like breathing under covers. I found it hard to breath at times while running around working and had to walk off so I could pull it down to breath.Based off quality and purpose of say it's a decent buy. For those accustomed to wearing mask, my issues may not be your issue. I still plan to wear it in the hopes it will improve with use and I don't regret buying. They are really cute, would be cuter if it was a tiny owl in the corner but I also enjoy the simple hearts. Decent buy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Guzman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 18, 2021",
                "reviewTitle": "Very disappointed",
                "reviewText": "I thought these face masks looked cute online but when I received them they were plain black (no red heart) and I found they didn’t fit me well. They are not adjustable around the ear and they were too loose for me. I returned them.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}