{
    "remaining_requests": 20675,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Majestic-Pure-Dead-Mask-Face/dp/B00UREAGU8",
    "body": {
        "name": "MAJESTIC PURE Dead Sea Mud Mask for Face and Body - Natural Skin Care for Women and Men - Best Facial Cleansing Clay for Blackhead, Whitehead, Acne and Pores - 8.8 fl. Oz",
        "price": "$11.39$11.39 ($1.29$1.29 / Fl Oz) $10.79$10.79 ($1.23$1.23 / Fl Oz)",
        "originalPrice": "$16.95",
        "rawPrice": 11.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Majestic-Pure-Dead-Mask-Face/dp/B00UREAGU8",
        "soldBy": {
            "sellerID": "AEWXAV3T5UC41",
            "name": "Majestic Pure",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AEWXAV3T5UC41&asin=B00UREAGU8&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLZ6JMKN"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51C5rWrtmhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51VZFXkwqpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-PGz8UeLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61aHcZGj3-L.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/071623d8-5f35-4f7c-9414-b131255bb860/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fd1605d7-380a-410a-8c81-9c0c3394e022/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/553205f2-c96b-45f5-a37d-53d5a84f06f9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/654322b2-ba16-4023-bf4a-8c18ea3f72e0/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the MAJESTIC PURE Store",
            "link": "https://www.amazon.com/stores/BeautyandPersonalCare/page/7120DBCF-9157-44AD-93C0-13BC1E44AD39?ref_=ast_bln"
        },
        "brand": "BeautyandPersonalCare",
        "merchantInfo": "Majestic Pure",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 10162,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 4 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Pure and Natural: Majestic Pure products are 100% pure and natural. This means they are free from toxins, additives, or any nasty chemicals. Completely unfiltered and undiluted for the best result",
            "Renewed Skin Glow: An advanced restorative formula, Majestic Pure Dead Sea Mud Mask is infused with Aloe Vera and Jojoba Oil that will help with thorough and deep cleansing of your face and body while helping improve glow and overall smoothness",
            "Fights Skin Woes: Hide every annoying blemish, acne, whiteheads, blackheads, etc with the help of this mask and help your natural beauty shine indoors and outdoors",
            "Suited For Every Skin: Whether you have oil, dry or extra sensitive skin, this Dead Sea Mud Mask works its magic no matter the skin",
            "Easy to Scoop for Desired Amount: This mask comes inside a big tub from which you can easily scoop out the amount you require and use it whenever you need"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Treatments & Masks",
                "link": "https://www.amazon.com/Facial-Treatments-Masks/b?ie=UTF8&node=11062031"
            },
            {
                "name": "Masks",
                "link": "https://www.amazon.com/Facial-Masks/b?ie=UTF8&node=11061121"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.18 x 2.36 x 3.54 inches; 8.78 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 9D-BZC2-93AO"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 684758988874"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Majestic Pure"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00UREAGU8"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,320 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #159 in Facial Masks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 10,162 ratings"
            },
            {
                "name": "Brand",
                "value": "MAJESTIC PURE"
            },
            {
                "name": "Item Form",
                "value": "Clay"
            },
            {
                "name": "Product Benefits",
                "value": "Cleansing, Black Head Removal, Anti Acne, Pore Treatment, Radiant Skin, Toning, Detoxifying"
            },
            {
                "name": "Scent",
                "value": "Dead Sea Mud"
            },
            {
                "name": "Material Type Free",
                "value": "Toxins Free, Chemical Free, Additives Free"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Majestic Pure’s Dead Sea Mud Mask is a unique formula made with authentic Dead Sea Mud, universally known for its high quality salts and minerals that contribute to radiant, healthy looking skin. Excellent for facial skin care support, deep pore cleansing and for a revitalizing look. Works well on oily and sensitive skin. Makes a fabulous facial mask for reducing the appearances of pores, toning skin and removing impurities.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/AEWXAV3T5UC41/5e14fdc8-46a4-4117-9c5c-9afe59578688._CR0,5,970,291_PT0_SX600__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/8ff21a6c-72d4-485f-bf46-48b5137eecac.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/50ec643e-ac0c-4173-8e2c-cb815f00678c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/8c9ef9c4-ae55-43b8-b63a-eed61e7f6e9e.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/306b8817-d6fe-4992-90e7-11638145ca82.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alfred",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRNAAKKTTCEBZELL3R5RIBY3OGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQFL6ZVD26TV5?ASIN=B00UREAGU8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Its great! (39yo male)",
                "reviewText": "I have recently gotten into skincare because I am getting older and I tried this out last night. The results are fantastic! So much so that I messaged my friends to tell them about how great it is.I am at a disadvantage being a guy who doesn't know anything about skincare, but I can tell you that after I washed it off, my skin looked lighter and more even. It's fantastic!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spencer Walker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAVRWVUNQHT3DQ24I7VV775YLBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MEJQHCJE1PBD?ASIN=B00UREAGU8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2015",
                "reviewTitle": "5.0 out of 5 stars Soothing, helped my facial emergency.",
                "reviewText": "I have very sensitive skin that can become overly dry from too much over scrubber or harsh products. If I have a break out which I sadly have been having really bad cystic like zits pop up due hormone changes from medication and tons and tons of stress. I'm not used to the cystic acne and it hurts so very bad. I also did have some blackheads on a few parts of my face that kept reappearing no matter what I did. With other masks I had used, they never seemed to get the blackheads. I did some research on dead sea mud. Honestly, the cystic zits hurt so bad, we're so hideous, I had never had such bad breakouts in years. It's always when a medication changes something hormonal. It's awful. I ordered this product, based on the photos other people had sent in. I feel along with the descriptions of the actual products ingredients, the aloe scent, it's functions, the good reviews, the pictures were a nice visual aid from satisfied customers.Not only was I suffering in pain with these cystic zits, but I was horribly embarrassed. Nothing seemed to minimize their size. Halloween. My favorite of holidays was coming up. Just to minimize these would be a blessing. To soothe would ease my suffering. I figured I couldn't expect more. Zits like that are not cured fast. They are deep, big and take time to heal...So, here's the thing, I apply the mask, it felt amazing. My whole face, even non-affected areas felt soothed and refreshed. I really love the way it feels going on. The gentle rub off. To my surprise, those stubborn black heads that no mask had gotten before we finally gone. Well that was sure a awesome bonus! All my pores not that I have big pores naturally but we all can look uneven when we have been fighting a battle on our face. My pores felt clean, soothed, smooth skin, refined. The cystic zits, was the most shocking. In one application they had indeed gone down in size dramatically. They finally started to hurt less. With every hot and cold compress prior. Nothing soothed or reduced the size as long as this mask. HONEST. As someone who wears makeup, and is very self concise about having a zit you can't hide. Or a very painful stubborn kind. I would and HAVE recommended this to friends. I see a friend this week who has a teen sister with skin problems and you bet I am sharing not just any \"dead sea mud mask\" but this brand specifically.I truly am impressed with the results.I have had professional facials and this does feel as soothing, refreshing and has astounding results.In the past other masks I have tried never felt as much as a at home luxury as this one does.Plus the benefits are numerous. It does not dry our your skin. I felt nicely moisturized, in the most natural way. I did not feel any artificial residue or anything like that.I don't know what, more I can say. I hope my long review was helpful. I wanted to add as much as possible so it covered it all.How fast acting it was. It's soothing effects. Natural moisture. Swelling reduction. The cystic acne cleared up considerably faster. Black heads gone completely unlike other masks. Lovely smell. No drying. No negative reactions on my sensative skin. Smooth skin. Pore refinement.*I Hope to add photos in the future*",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bonquisha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJKBIIU3HIKDBHN23HD5VPQ7OWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TAR737S9N9Q8?ASIN=B00UREAGU8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Easy to apply",
                "reviewText": "Cleared up my white and blackheads really well, left my skin soft and moisturized",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJWZOVPLX6SNWFTVRKN3ZKHA55Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R255IYTUYF4HRJ?ASIN=B00UREAGU8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars I use it every now again",
                "reviewText": "I use it every now again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Snowkitten",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFURCELCOWAUKCDDXF2I3PEFBF7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F2B3DKKGR3R1?ASIN=B00UREAGU8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2017",
                "reviewTitle": "5.0 out of 5 stars Amazing Mud Mask!",
                "reviewText": "Dead Sea Mud Mask; Pores, Blackheads, Whiteheads, Acne and Breakouts; 100% natural formula to ensure the highest-quality product. Simply unique due to its high concentrations of salts and minerals effective in restoring a healthy rosy glow to the skin; Can be used as Blackhead Remover Mask as well as Acne MaskExcellent for face skin care, deep pore cleansing, detoxifying and revitalization. Works on Oily and sensitive skin as well. Similar to Bentonite Clay, it makes a fabulous facial mask, for shrinking pores, tightening and toning skin, removing impurities, and just making your skin look and feel great.PREMIUM QUALITY THERAPEUTIC GRADE: Dead Sea mud is known to be effective for skin conditions, such as psoriasis and dermatitis, especially when used in conjunction with adjunct therapies, such as Dead Sea bathing, moisturizing creams, and increased sun exposure. It's also useful for relaxing sore muscles. SOOTHING SKIN: Naturally softens and moisturizes, so it dramatically improves the appearance and health of your skin leaving it more tone, even in texture, and clearer.IndicationsDead Sea Mud Mask is commonly used for detoxification, as a facial mask, to improve skin conditions and to help reduce aches and pains. it can also be used for various skin condition such as blackheads or pimples as well as a full body mask. [Important FDA Statement]: These Statements have not been evaluated by the food and drug administration. This product is not intended to diagnose, mitigate, treat, cure or prevent any disease.IngredientsDeionized water, Pure Dead Sea Mud, Kaolin, Shea Butter, Sunflower Oil, Aloe Vera Juice, Vegetable Glycerin, Jojoba Oil, Hickory Bark Extract, Calendula Oil, Xanthan GumDirectionsApply a thick layer on the face and upper part of the neck, avoiding the eye area. Leave on to dry for 5 minutes. Remove the mask first by gently rubbing in circular motions for an overall exfoliation. Wash any excess with lukewarm water and gently pat dry. Recommended to use twice a week and to follow with your favorite moisturizer.I absolutely love this company and how they have a holistic approach to beauty products. I bought this product to help reduce acne, blackheads, and to refine/brighten my skin. It feels cool and refreshing upon application. I let it completely dry for about 20-30 min and wash off with warm water. I try to use it two to three times a week and feel it works very well! I feel and look refreshed! My skin has significantly improved and my pores are gradually getting smaller and are less noticeable. I will be purchasing more in the future and absolutely love it!",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Awesome and good quality",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU5KMMZWITIYBLI2PZCGB4CXH3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C6GHV0F2TWAM?ASIN=B00UREAGU8",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "3.0 out of 5 stars Consistency and grammar",
                "reviewText": "I was contemplating not using this because on the container they spelled the word “with” wrong which is a reg flag for me. The consistency is more of a gel like substance that you have to rub between your hands to create that mud like substance. Really interesting. I’m not sure if I will return it yet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mel BMel B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPUZFWKAAVNYPWIZHI7ILQBNKKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RC00UOXY9UMBU?ASIN=B00UREAGU8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Quality, Salt Burns Cuts...Duh?",
                "reviewText": "Great product. Feels great on my super sensitive skin. It left my skin smooth and refreshed after washing off. For all the people saying this product burns it is because 1 of 3 things is causing it: open cut on your face, itritated acne, you shave or waxed your face. The product has salt in it. Salt burns irritated areas on your face (feels like going into ocean after shaving your legs). For all the people saying they got acne from this product, its because: you didn't wash the product off completely with warm water OR this product opens up your pores very well and causes debris to come into the pores easier. Wash your face with water and moisturize with a light weight oil free moisturizer.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+TsJVxM+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71TIM0U6M0L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "How to Apply",
                "reviewText": "This is unlike a clay mask which I can brush on. This product is like jello. So instead of using a brush or fingers to pat on treat this like a bar of soap. Add a dollop in the palm of your hands, rub together to warm it up and thin it down. Massage all over your face.After a few minutes you will begin to feel a slight warm sensation. Wash off with a very damp facecloth. ( and use a crappy cloth). Your skin will look amazing after it is all washed off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 23, 2017",
                "reviewTitle": "Adela",
                "reviewText": "No puedo calificar el producto puesto que me fue robado del lugar de entrega.Estoy segura que por la descripción del producto en el momento de la compra debería haber tenido una buena puntuación. Un saludo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sullivan Yorick N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 25, 2017",
                "reviewTitle": "Excellent",
                "reviewText": "je vous le recommande moi qui après des années avais la peau grasseDès le premier masque on ressent la différence, le visage brille moins....Je le recommande",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 2, 2016",
                "reviewTitle": "Soft, bright and cleansing! Would recommend!",
                "reviewText": "Bought this product due to great reviews. Just used it for the first time and my face feels so soft. The product goes on so nicely and feels silky to the touch. It doesn't dry and tighten your face like many mud face packs you can get in chemists. I left the face mask on for 10-15 mins and washed off with warm water. My face now feels as soft as a baby's bum and looks clean and bright. I noticed some light reflecting particles that had been left on my skin, which I wasn't expecting, which adds extra glow! Very nice product, look forward to continued use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ang.Ang.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 22, 2023",
                "reviewTitle": "Rancid & Jell-o",
                "reviewText": "My wife's review: this is my second bottle of this. First one was excellent, last a long time, worked wonders, but this second one I opened it and it's rank, feels like jell-o, irritated my skin (felt like burning), and stained my face cloth.Ang.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81pLGmOOdYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71bNtt1aCmL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$20.90",
                "sellerName": "JSA Express LLC",
                "sellerRating": "3"
            }
        ]
    }
}