{
    "remaining_requests": 20679,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Outdoor-Research-Essential-Face-Mask/dp/B08BGBWV5V",
    "body": {
        "name": "Outdoor Research Essential Face Mask Kit",
        "price": "$7.00",
        "originalPrice": "",
        "rawPrice": 7.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Outdoor-Research-Essential-Face-Mask/dp/B08BGBWV5V",
        "soldBy": {
            "sellerID": "A2BMBHD2OU3XDU",
            "name": "6pm",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2BMBHD2OU3XDU&asin=B08BGBWV5V&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 0NYKSVIL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41EzyfgQR1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-gFVN3rFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YNupx5RvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Iv0heUMlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41u2PMpkoRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EwJBZJrIL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Outdoor Research Store",
            "link": "https://www.amazon.com/stores/OutdoorResearch/page/3EF7EFEC-151D-4507-BFBD-D20C097C3B6F?ref_=ast_bln"
        },
        "brand": "OutdoorResearch",
        "merchantInfo": "6pm",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1431,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 21 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type 100% Polyester",
            "Care instructions Machine Wash",
            "Origin Imported",
            "Outdoor Research Essential Face Mask Kit"
        ],
        "description": "Protect yourself and others The next time you leave home with the essential mask Filter. Sold in a 3-pack, The essential mask Filter is designed to be worn with the essential face mask for high filtration efficiency to reduce contamination When in crowded areas. At Outdoor Research, we think that life gets better the minute we step out the door on a new adventure, no matter how big or small. We learn about ourselves, each other, and the environment every time we Get out. We come home a little wiser and stronger. We see the world more clearly, and that compels us to treat it better. More than anything, we're convinced that if we inspire more people to get outside, the world will be a better place. In 1981, a brilliant scientist and adventurer named Ron Gregg watched his frostbitten partner get airlifted off a Glacier on Denali. He'd spent months planning a new route in the purest style, skiing 100 miles from the road to the base of the climb. Barely halfway to the summit, their trip ended with the failure of a simple pair of gaiters. Stubborn to the end, Ron refused a seat on the helicopter and descended alone for two weeks, pondering what had happened. Somewhere along the way, he realized he could both Fix the gear problem and devote his life to pursuing his passion for adventure. By the end, he knew one thing for sure: he wasn't going back to his old job.",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Men",
                "link": "https://www.amazon.com/Mens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147441011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/Mens-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2474937011"
            },
            {
                "name": "Sport Headbands",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23466428011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8 x 8 x 1 inches; 1.6 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 2832980900"
            },
            {
                "name": "Department ‏",
                "value": "‎ unisex-adult"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ June 18, 2020"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Outdoor Research"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B08BGBWV5V"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#348,173 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #133 in Men's Sport Headbands"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,431 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lomatium",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZOTN4OTQSKNULIC5IJCVWYV7WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21CV7ZQ0F8XVH?ASIN=B08BGBWV5V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Best mask I own",
                "reviewText": "I hate that masks are such a necessity these days, but the OR mask is the best that I've ran across. I wear glasses so its tough to get ones that won't fog up my glasses, and the nose wire on these helps a lot. Its also very comfortable with adjustable ear loops, and I took one to Mexico and wore it everyday on planes and buses for four months; even though I had brought other masks they were much more uncomfortable, especially after a while on longer rides unlike the OR mask which was more tolerable. I washed the same mask every night- and by morning it was always dry even with high humidity in the rooms I stayed in- and it held up great despite also being repeatedly crushed in my pocket. Though I like this mask has the additional pocket for filters, I just don't use them (even though maybe I should)- however I've yet to get sick irregardless even after being squeezed into a Mexico City subway car like a sardine, flying on an airplane for eight hours and riding on a very full Amtrak train with this mask on. I'm not saying you should trust your life to these masks so you can travel around the world in the middle of a pandemic that is continuing to get worse, but if I had only one mask I took with me and wore everyday- this would be it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBXJGTULYCNPGNMV5M7XS7TWH7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9U28YALZS80Y?ASIN=B08BGBWV5V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2020",
                "reviewTitle": "5.0 out of 5 stars Best I've tried, works with glasses and large noses",
                "reviewText": "I've bought a half-dozen face masks since the pandemic started, but none fits nearly as well as this one. The issue as I see it is that there's a lot of variation in human faces, and manufacturers for now can only provide a handful of sizes and designs. Luckily for me, this model fits my massive nose and I can use it with glasses without the usual extreme fogging. It all comes down to the design of the upper edge of the mask: it follows the contour of my face very well, it's pulled tight by the earloops (which have neat beads to resize them), sits neither too low nor too high, and has a metal nosepiece of generous length, that reaches far enough to keep the mask pressed against the skin even under the eyes. Neither Atoms, nor Tom Binh, nor several cheaper models can do any of that for me, although they could work for you if your nose is not quite as colossal.Keep in mind that there will still be a little fogging, presumably getting worse as the weather gets colder. Fogging aside, it's reasonably comfortable for a tight-fitting face mask, and with filters included it's good value for money when compared to other brand-name offerings. Even with the filter on ease of breathing is reasonable, roughly on par with a disposable N95 mask (and with the added advantage of much better fit). The only issue I've found is that inserting filters is rather finicky, but I'll happily deal with that considering how good the mask is otherwise.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bryan White",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFERVLDL32U2N2UOEKKIB76WG5XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S9Y8HBMUEMV8?ASIN=B08BGBWV5V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2021",
                "reviewTitle": "5.0 out of 5 stars Great choice for running!",
                "reviewText": "Throughout the pandemic, I've struggled to find a mask that worked well for running. Most regular fabric masks are too flexible and cling to your mouth/face far too easily during heavy breathing, especially once saturated. I looked at the Under Armor mask, but it's quite pricey and always out of stock. I've used other Outdoor Research products before, and this looked like a great alternative. I was pleasantly surprised. It's a solid, sturdy fabric that breathes well and maintains its shape/form very well, even during heavy exertion. The nose wire and entire top section stays firmly molded to your face and doesn't move. It also comes with three custom-cut filter inserts for double-layering. Here are my only criticisms: The filters are a bit too restrictive to use while running. If you're going to wear this mask for casual outings, then by all means use the double filter. Next, for COLD WEATHER running (30 degrees or colder), this mask clogs up very quickly with condensation, mucus, etc. and it gets hard to breathe. It works best in warmer weather (50+ degrees) where you're not putting out as much condensation or other fluids with each breath. Pretty much any mask is going to struggle in super cold conditions, so I don't judge it harshly in that regard. Overall, this is the best mask I've found so far for running. Grab it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Evan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AES6OX34MTRVIYX4KQN5Q2APUDAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RG3YDZLJJMQM6?ASIN=B08BGBWV5V",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2022",
                "reviewTitle": "4.0 out of 5 stars Good quality washable mask",
                "reviewText": "We have several of these masks and prefer them over other types we've tried. We've machine washed and replaced the filters a few times and they held up well. They can be adjusted for comfort and have a nose bridge wire to help reduce glasses fogging.The filter inserts can move or slip when taking on and off, so that is the only real detractor. It is necessary to place filters correctly but the mask would be improved if the filter was better secured in position.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robb S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELCJZIONKIMATIN3KOFPKWMCADQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SXX0MHMTWK4W?ASIN=B08BGBWV5V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2020",
                "reviewTitle": "5.0 out of 5 stars Most Comfort/Best Fit",
                "reviewText": "I went on a buying spree after the pandemic started. This mask has always been on the list of \"we'll see\" when it comes to what people are actually saying about it. I got the Adidas, UA, handmade, VistaPrint, Love Your Melon, all kinds of different masks. None of them properly fit my face. None of them were soft or comfortable. All of them had something about them that made it not the best mask for me.Outdoor Research nailed the comfort, look, and protection that I needed. The height and width of the mask actually covers what I needed, it's soft against my face so there's no friction causing breakouts, the additional filter feature is a nice addition, and the adjustable ear straps make it just right so it's not pulling the ears but it's tight enough to not move around. I hope they release more colors/designs and I would get a couple variations of this mask.Bridge to center of ear: 7\"+",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "人柱",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on July 4, 2021",
                "reviewTitle": "デカイ",
                "reviewText": "期待していた通りのデカサです。顔面が大きい人にはお勧めですし、話してもズレてきませんのでハナマスクになりません。大きさのイメージは一般に出回っている不織布の大人用大で話すと突っ張ったりズレてしまう人にはピッタリだと思います。",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.95",
                "sellerName": "Gatekeepers",
                "sellerRating": "5"
            }
        ]
    }
}