{
    "remaining_requests": 3230,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Flexible-Section-Temperatures-Brightness-Protection/dp/B0CDPLYPXB",
    "body": {
        "name": "LED Desk Lamp with Clip,Flexible 4 Section 3 Light Source Office Desk Lamp,4 Color Temperatures and 5 Brightness Level Desk Light,Night Eye Protection Task Table Lamp for Home Office Studio Study Nail",
        "price": "$49.98",
        "originalPrice": "",
        "rawPrice": 49.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Flexible-Section-Temperatures-Brightness-Protection/dp/B0CDPLYPXB",
        "soldBy": {
            "sellerID": "A1G28J0JHIB79U",
            "name": "AILBTON",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1G28J0JHIB79U&asin=B0CDPLYPXB&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CM5Z759K"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 50% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41nQ92JEgdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51mt6OusPGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410ea9rWJiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VkmI8xf8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oqEoIJdkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4143CoyqONL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Ee6Bu8sqL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the AILBTON Store",
            "link": "https://www.amazon.com/stores/AILBTON/page/4DEF9385-2014-42AC-A867-C6CF45CF535B?ref_=ast_bln"
        },
        "brand": "AILBTON",
        "merchantInfo": "AILBTON",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 275,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Wednesday, February 21. Order within 19 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[Stylish and efficient workspace]:The AILBTON Foldable LED Desk Lamp is the perfect addition to your office or home workspace. With its sleek and modern design, this desk lamp not only provides ample lighting but also adds a touch of elegance to your desk. The adjustable arm and head allow you to position the light exactly where you need it, ensuring optimal visibility and reducing eye strain, the Foldable LED Desk Lamp is here to enhance your productivity and inspire your work.",
            "[Multi-function lighting]:Equipped with energy-efficient LED technology, the AILBTON Foldable LED Desk Lamp offers a wide range of lighting options to suit your preferences. From a soft warm glow for a cozy ambiance to a bright cool light for focused tasks, this desk lamp has it all. The 4-level dimmer allows you to adjust the brightness according to your needs, while the color temperature control lets you create the perfect lighting atmosphere for any occasion.",
            "[Space-saving and flexible]:The AILBTON Foldable LED Desk Lamp is designed with convenience in mind. Its foldable and compact design allows for easy storage and portability, making it perfect for those with limited desk space or on-the-go lifestyles. The lamp also features a sturdy clamp that securely attaches to any desk, shelf, or table, providing you with a stable lighting solution that frees up valuable space.",
            "[Energy efficient lighting]:Say goodbye to traditional desk lamps that waste energy and strain your eyes. The AILBTON Foldable LED Desk Lamp utilizes advanced LED technology, providing you with long-lasting and energy-efficient lighting. The natural and flicker-free lighting reduces eye fatigue and discomfort, allowing you to work or study for extended periods without any strain. Say hello to eye-friendly lighting that saves energy and money, while also keeping your eyes healthy and protected.",
            "[Quality Craftsmanship and Durability]:AILBTON takes pride in delivering high-quality products, and the Foldable LED Desk Lamp is no exception. Its modern and sleek aesthetic combined with its durable construction ensures that it not only enhances your workspace but also stands the test of time. Invest in the AILBTON Foldable LED Desk Lamp and experience the perfect blend of style and functionality."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b?ie=UTF8&node=228013"
            },
            {
                "name": "Lighting & Ceiling Fans",
                "link": "https://www.amazon.com/Lighting-and-Ceiling-Fans/b?ie=UTF8&node=495224"
            },
            {
                "name": "Lamps & Shades",
                "link": "https://www.amazon.com/Lamps-Bases-Shades-Lighting/b?ie=UTF8&node=3736561"
            },
            {
                "name": "Desk Lamps",
                "link": "https://www.amazon.com/desk-lamps/b?ie=UTF8&node=1063292"
            }
        ],
        "productInformation": [
            {
                "name": "Style",
                "value": "Four-section"
            },
            {
                "name": "Brand",
                "value": "AILBTON"
            },
            {
                "name": "Color",
                "value": "Incandescent light/Natural light"
            },
            {
                "name": "Product Dimensions",
                "value": "46\"D x 2\"W x 2.7\"H"
            },
            {
                "name": "Special Feature",
                "value": "illumination"
            },
            {
                "name": "Shade Color",
                "value": "‎black"
            },
            {
                "name": "Power Source",
                "value": "‎Corded Electric"
            },
            {
                "name": "Controller Type",
                "value": "‎Touch Control"
            },
            {
                "name": "Number of Light Sources",
                "value": "‎3"
            },
            {
                "name": "Connectivity Technology",
                "value": "‎USB"
            },
            {
                "name": "Included Components",
                "value": "‎LED light bulb"
            },
            {
                "name": "Is Waterproof",
                "value": "‎False"
            },
            {
                "name": "Mounting Type",
                "value": "‎Tabletop"
            },
            {
                "name": "Wattage",
                "value": "‎12 Watt-hours"
            },
            {
                "name": "Number of Items",
                "value": "‎1"
            },
            {
                "name": "Lighting Method",
                "value": "‎Adjustable"
            },
            {
                "name": "Control Method",
                "value": "‎Touch"
            },
            {
                "name": "Item Weight",
                "value": "‎2.07 pounds"
            },
            {
                "name": "Water Resistance Level",
                "value": "‎Not Water Resistant"
            },
            {
                "name": "Connectivity Protocol",
                "value": "‎HomePlug"
            },
            {
                "name": "Voltage",
                "value": "‎24 Volts (AC)"
            },
            {
                "name": "Manufacturer",
                "value": "‎AILBTON"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎4Jie-TaiDeng A"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Special Features",
                "value": "‎illumination"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0CDPLYPXB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 275 ratings"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,926 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #34 in Desk Lamps"
            },
            {
                "name": "Date First Available",
                "value": "October 6, 2023"
            },
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 46 x 2 x 2.7 inches; 2.07 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 4Jie-TaiDeng A"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 6, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ AILBTON"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CDPLYPXB"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Ailbton LED Desk Lamp - your energy-saving, eye-friendly, space-saving, flexible, and memory lamp all-in-one! ✓ Energy Efficient: Our LED desk lamp utilizes advanced energy-saving technology, reducing energy consumption and saving you money on your electricity bill. ✓ Eye-friendly Design: Say goodbye to eye strain and fatigue! The Ailbton LED Desk Lamp emits a soft, flicker-free light that replicates natural daylight, protecting your eyes and providing a comfortable reading or working environment. ✓ Space-saving Solution: With its sleek and slender design, our desk lamp takes up minimal space on your desk, allowing you to maximize workspace and keep everything organized. ✓ Flexibility at Its Best: The Ailbton LED Desk Lamp features a fully adjustable design. You can easily adjust the lamp's height, angle, and brightness to meet your specific lighting needs, providing you with ultimate flexibility and customization. ✓ Memory Function: Don't waste time adjusting the lamp every time you turn it on! Our desk lamp comes with a convenient memory function that remembers your preferred settings. Simply turn it on, and it will automatically adjust to your desired brightness and color temperature. Upgrade your lighting experience with the Ailbton LED Desk Lamp today! Enjoy its energy efficiency, eye-friendly design, space-saving capabilities, flexibility, and convenient memory function. Illuminate your workspace effortlessly and enhance your productivity.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aab0d311-c327-4d9c-8f6e-ea45300f5f37.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Versatile Lighting for Every Scene - Experience the Ailbton LED Desk Lamp! ✓ Perfect for Tailoring: Whether you're a professional tailor or an enthusiastic DIYer, our LED desk lamp provides you with the ideal lighting for all your cutting and sewing needs. The adjustable brightness and color temperature ensure optimal visibility, allowing you to work with precision and ease. ✓ Ideal for Workspaces: Boost your productivity with the Ailbton LED Desk Lamp! With its flicker-free light and adjustable design, this lamp creates a productive environment to help you stay focused and accomplish tasks efficiently. Say goodbye to eye strain and hello to improved performance! ✓ Enjoyable Reading Experience: Curl up with a good book and bask in the gentle glow of the Ailbton LED Desk Lamp. The eye-friendly light it emits reduces eye fatigue, making reading for extended periods a breeze. Indulge in your favorite novels without worrying about discomfort or strain. ✓ Universal Eye Protection: Our desk lamp is designed to cater to the needs of a wide range of users. Whether you are a student, professional, or simply looking for a reliable lamp, the Ailbton LED Desk Lamp is suitable for everyone. Its innovative lighting technology ensures an optimal and comfortable lighting experience for all. Upgrade your lighting experience with the Ailbton LED Desk Lamp - the perfect companion for tailoring, work, and reading. Experience the versatility, eye care feature, and universal appeal of our lamp.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ef55d2c7-6a69-491b-8f5a-6c142fa7795f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Our innovative lamp is designed to enhance your space and illuminate it with unparalleled clarity and color accuracy！ High CRI Value: With a high Color Rendering Index (CRI) value, our LED desk lamp ensures that colors appear vivid and true to life. Say goodbye to dull and washed-out lighting! Immerse yourself in a world of vibrant colors and see every detail with remarkable precision. Natural Light Simulation: Step into the realm of natural light with the Ailbton LED Desk Lamp. Our advanced technology closely replicates the purity and clarity of natural sunlight, offering you an unparalleled lighting experience. Whether you're working, reading, or simply relaxing, the lamp's output mimics daylight to perfection.Showcasing Ailbton Brand: Trust in the quality and reliability of the Ailbton brand. Our LED desk lamp is a testament to our commitment to excellence. Designed with precision, it combines sleek aesthetics with cutting-edge functionality, making it the perfect addition to any modern living or workspace.Illuminate with Confidence: Whether you're an artist, designer, or simply looking to enhance your surroundings, the Ailbton LED Desk Lamp is your ultimate lighting companion. Rediscover the true colors of your world and revel in the beauty of well-lit spaces.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/193818e3-8b48-4282-a5b3-f4d857e958f1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Ailbton LED Desk Lamp, the epitome of flexibility and functionality! With its sleek and modern design, this long and LED lamp boasts four adjustable sections, offering you the ultimate flexibility in directing light precisely where you need it most. Whether you're engrossed in a riveting novel, knitting your latest creation, or simply unwinding after a long day, this lamp ensures a well-lit environment for every activity.Thanks to its multi-joint design, you can effortlessly adjust the angle and height of each section, allowing for simultaneous lighting in multiple directions. No more settling for one fixed position; this lamp adapts to your ever-changing needs, guaranteeing a personalized lighting experience like no other.Illuminate your workspace, highlight your favorite artwork, or create an inviting ambiance in any room, all with just one lamp. The ailbton LED Desk Lamp is a true game-changer.Featuring energy-efficient LED bulbs, this lamp not only brightens up your space but also cuts down on your electricity bills. With long-lasting illumination and an impressive lifespan, it's a wise investment for both your pocket and the environment.In addition to its remarkable flexibility, this LED desk lamp exudes elegance and sophistication. Its minimalistic design seamlessly blends into any décor, adding a touch of modernity to your space.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37092ebe-f9ef-412d-a456-9c0644d5ed59.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Illuminate your workspace with our sleek and stylish desk lamp! With four color temperature options, ranging from warm yellow to bright white, and five adjustable brightness levels for each temperature, our desk lamp allows you to customize your lighting experience to suit any task or mood. Whether you need a cozy ambiance for reading or a bright, focused light for working, our lamp has got you covered.Experience the warmth of the yellow light, perfect for creating a relaxing atmosphere after a long day. Need to concentrate? Switch to the cool white light for clear, vibrant illumination that enhances your productivity. With everything in between, you'll find the perfect light for every occasion.Not only does our desk lamp offer exceptional functionality, but it also adds a touch of elegance to any space. With its sleek and modern design, it effortlessly complements any decor, making it the perfect addition to your office, bedroom, or living room.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/af5a2d70-d04b-4c96-8060-0f16ee2d1a8f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Color temperature suitable for various environments！ Experience the difference in lighting with our lamp's various color temperatures. From warm to cool, you can easily switch between different settings to create the perfect ambiance for reading, studying, or relaxing.Illuminate your workspace with the warm, cozy glow of a 3500K color temperature for a calming effect. Need to focus? Opt for the crisp, white light of a 4500K color temperature to enhance concentration and productivity. For tasks that require precision, such as detailed work or crafting, our lamp's cool, bright 6000K color temperature is the ideal choice.With ailbton LED Desk Lamp, you can effortlessly adjust the lighting to cater to your specific needs. Enjoy the versatility, efficiency, and style this lamp brings to your space. Elevate your lighting experience and enhance your productivity with ailbton - because your convenience always comes first.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65b6b5ab-81bd-4f38-951f-cdf5932d5ee9.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Your Eye-Friendly Lighting Solution Illuminate your workspace with our sleek and innovative Ailbton LED Desk Lamp. Immerse yourself in a glare-free and flicker-free lighting experience that is gentle on your eyes, allowing for prolonged use without any discomfort.Our advanced LED technology ensures optimal eye protection, providing a soft and soothing illumination that reduces eye strain and fatigue. Say goodbye to squinting and hello to clear, crisp lighting that enhances your focus and productivity.Experience the difference of our flicker-free design. Unlike traditional lamps, our Ailbton LED Desk Lamp eliminates the annoying flickering effect, creating a stable and consistent light source. Enjoy a seamless lighting experience that is ideal for reading, studying, working, or simply relaxing.With its adjustable design, our LED Desk Lamp offers flexibility to cater to your individual needs. Easily adjust the angle and height to achieve the perfect lighting position for any task. Whether you require focused lighting for detailed work or a wider coverage for ambient lighting, our lamp has got you covered.Sleek and modern, the Ailbton LED Desk Lamp seamlessly complements any workspace or home office decor. Its compact and space-saving design ensures it will fit effortlessly on any desk or table, making it the perfect addition to your workspace.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/517ff8d8-4eb8-42a7-ba99-0068a0aafab8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aab0d311-c327-4d9c-8f6e-ea45300f5f37.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ef55d2c7-6a69-491b-8f5a-6c142fa7795f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/193818e3-8b48-4282-a5b3-f4d857e958f1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37092ebe-f9ef-412d-a456-9c0644d5ed59.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/af5a2d70-d04b-4c96-8060-0f16ee2d1a8f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65b6b5ab-81bd-4f38-951f-cdf5932d5ee9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/517ff8d8-4eb8-42a7-ba99-0068a0aafab8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AnonimousAnonimous",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYC5BVCJVWKHGO5X4RB2W5DK2LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RANEA8ZAELVK?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Stylish and Functional LED Desk Lamp - A Must-Have!",
                "reviewText": "This LED desk lamp with clip is a game-changer! Its four-section flexible design allows for easy adjustment, ensuring optimal lighting for any task. With three lights, four color temperatures, and five brightness levels, it offers unparalleled customization to suit your needs.The “night eye” feature is a standout, providing gentle illumination that won’t strain your eyes during late-night work sessions. This thoughtful addition prioritizes your eye health, making it a must-have for anyone who spends long hours at their desk.What sets this lamp apart is its multifunctionality. Not only does it provide excellent lighting, but it also saves space with its clip-on design. Whether you’re studying, working, or reading, this lamp has got you covered.Moreover, its sleek and stylish design adds a touch of elegance to any workspace. It seamlessly blends in while still standing out as a quality item.In conclusion, this LED desk lamp ticks all the boxes: stylish, multifunctional, space-saving, energy-efficient, and above all, it prioritizes your eye health. If you’re in the market for a top-notch desk lamp, look no further!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VwTsQ68AL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71hDzdlhkML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brett Wilson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBMTOBPDMGKOQIKB342R7WPB6CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LKGHABQ508CG?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great value",
                "reviewText": "Impressed with this for the cost. It’s large, it’s bright, and the controls are easy to use. I like that the unit can be folded up out of the way if needed, and it has a lot of adjustability. One thing I don’t see mentioned, or shown in the images, is that the lights can rotate at the joints. It does require some force to rotate and fold the light, but you’d want this otherwise it wouldn’t stay in place — though it’s something to keep in mind.I’d recommend this for low profile workbench lighting like in my use case.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JWJW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6QWK7HYOQS3LPOWMQZ7FYN5B2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PH74DPI4TSKM?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Light & Saves Space!",
                "reviewText": "I was skeptical of this light, but after unboxing, it was SUPER easy to assemble and attach to the desk. It works as advertised and isn perfect for my desk setup. Great overall addition to a workspace that needs light!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71dKDK4qs-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGABMEFRMUB3PTXVCR3OOCK4NJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZXEQS2L3BZ4F?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Works amazingly",
                "reviewText": "Purchased this as a gift for my husband’s new art desk, light is bright, able to be cool or warm tone and covers the whole desk surface and folds up when done. Stays in position when extended. Again, it’s amazing!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. White",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAK22PR4BZA545GDMHWFVGSXJNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1497C6OGR4P32?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great versatile light, perfect for my workbench",
                "reviewText": "I’m using this flexible LED lamp on my mobile workbench in the garage and it clamps perfectly on any side of my table. The flexible hinges are sturdy and easy to move out of the way when not needed. I can also pivot the light arms close to my work area to light my woodworking projects and electronics repairs. It’s slim enough to be unobtrusive while in use. I thought the individual lights rotated on each pivoting arm, but they do not, so if you need that additional functionality I would look at other types of these desk lamps. The controls are simple on the base stalk of the lamp, so you can quickly switch the color temperature and brightness. The light is plenty bright for my uses.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKRLXSFWKDPQEUPDOJOBGIKTEDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35V1JTO5WHKKQ?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Flexible desk lamp",
                "reviewText": "I found a light that was flexible and non-glare to review artwork with. This light covers a larger area than others I have tried. Easily adjustable and does not take up any desk space. Quality workmanship shows when adjusting the angle. Smooth and stays in position. Easily adjustable. All pros no cons.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sophie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCL6QUIZUCSRSKSYNVVDP3LGZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SXCAEYXI3LF0?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to install and convenient to light up a work desk.",
                "reviewText": "This is a very good work desk lamp, with various luminosity levels. Easy to put the table, flexible and versatile. I love it !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcos Barragan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJDGNFLPKM26EQL3US54XNAYBXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT4MXBEUQVQDH?ASIN=B0CDPLYPXB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent lamp!",
                "reviewText": "This lamp is great. It packs up very nicely and when folded up it takes very little space. when it’s expanded it lights up a large area, and it can be reconfigured to mount anywhere and light any position and in any direction since it swivels at the joints. The different light settings for different activities from a calming warm light for reading to hobby work (I paint) with the day light.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}