{
    "remaining_requests": 46314,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Canon-Wireless-Inkjet-Printer-2321C002/dp/B078X1BD8C",
    "body": {
        "name": "Canon TS302 Wireless, Single Function Inkjet Printer, Black, Works with Alexa",
        "price": "$54.00",
        "originalPrice": "$69.99",
        "rawPrice": 54.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Canon-Wireless-Inkjet-Printer-2321C002/dp/B078X1BD8C",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31MMjAvJoJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31ltNAc0cNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kS2J2uzoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41u2zrwTQeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412bmpWu0JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31AuP7xLLQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/319R9MYzE6L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1DjWQuyj0S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61j1W4zc-HL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Canon Store",
            "link": "https://www.amazon.com/stores/Canon/page/5FDDA83E-27A1-472F-8444-4828B50C4243?ref_=ast_bln"
        },
        "brand": "Canon",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 4830,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Thursday, February 15. Order within 23 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "With AIRPRINT , its easy to print right from your iPhone, iPad and Mac",
            "With AUTO POWER ON/OFF your printer will turn on when you need it and off when you don't!",
            "FINE HYBRID INK SYSTEM for detailed documents and photos",
            "Quickly refill paper with the dedicated REAR PAPER TRAY"
        ],
        "description": "The PIXMA TS302 Wireless Inkjet Printer is made for easy document printing. Print on the go with your compatible mobile device. The PIXMA TS302 is also compatible with XL ink cartridges, which help save money, print more when you need to, and limit ink cartridge replacements.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b?ie=UTF8&node=172635"
            },
            {
                "name": "Inkjet Printers",
                "link": "https://www.amazon.com/Inkjet-Printers-Office-Electronics/b?ie=UTF8&node=172646"
            },
            {
                "name": "Ink Tank Printers",
                "link": "https://www.amazon.com/b?ie=UTF8&node=51651872011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "11.1 x 17 x 5.7 inches"
            },
            {
                "name": "Item Weight",
                "value": "6.5 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Canon USA Inc."
            },
            {
                "name": "ASIN",
                "value": "B078X1BD8C"
            },
            {
                "name": "Country of Origin",
                "value": "Vietnam"
            },
            {
                "name": "Item model number",
                "value": "2321C002"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 4,830 ratings"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,287 in Office Products (See Top 100 in Office Products) #44 in Ink Tank Printers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "December 22, 2017"
            },
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 11.1 x 17 x 5.7 inches; 6.5 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 2321C002"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 22, 2017"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Canon USA Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B078X1BD8C"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Vietnam"
            },
            {
                "name": "Brand",
                "value": "Canon"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Printing Technology",
                "value": "Inkjet"
            },
            {
                "name": "Special Feature",
                "value": "wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Model Name",
                "value": "CNTS302K"
            },
            {
                "name": "Printer Output",
                "value": "Color"
            },
            {
                "name": "Maximum Print Speed (Color)",
                "value": "4"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "7.7"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/672f40e4-8295-4f8c-a6e3-bd3475337583.__CR96,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stephen L. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZR3QWXRVIQG4PO3N4KOMCE7ISQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14CLYH7AOVCEB?ASIN=B078X1BD8C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Great printer especially for the price!",
                "reviewText": "So I had to order a printer in a pinch because my old printer died and I had just purchased ink for my old printer so I wanted to get a printer that accepted the old ink so I could use my brand new ink that I purchased a week earlier. I thought $60 was a great price for a throwaway printer. I end up buying $50 printers every 5 years or so and just toss out the old one when it starts screwing up and that's what happened here. Installing it was SUPER EASY. No wires, nothing! You only need to attach the power cable and everything else happens wirelessly. QUICK INSTALLATION TIP! Don't use the CD that comes with it. There is a website on the installation instructions. Go to that website, download the software for the TS302 printer (this printer), and just follow the instructions! It takes about 10 minutes to do the install and align the printer heads and you're all set. I didn't have to fuss with my settings on the actual printer itself. I didn't have to adjust any wireless settings, it did all of that automatically. After that you're all set! Any other computer in the house attaches easily just buy going to printer settings in windows and clicking add printer. It should find it on the network and you just add it. I also tested my iPhone 15 Pro and same thing. I brought up a return label and the iPhone found the printer automatically and printed no issues. Prints fast, looks good, works flawlessly. The ink is also pretty cheap! You can buy a set of black and color ink for $30 for the XL cartridges. It also includes some starter inks but they most likely won't last long so you should buy some ink rather quickly. Anyway, that's it! Highly recommended.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jswiney9",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIWHGS2YGHU6VL4QSYHKKAZOQSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YMW5VTQABXSW?ASIN=B078X1BD8C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Good. Cheap. Fast. Simple",
                "reviewText": "Set up took less than 3 minutes. Printer is very simple for those who just need a document printer and it prints very very well and quickly. I replaced a 10 year old 300 dollar 3 in 1 and I’m not a bit disappointed. I have the canon app and print off my phone. Connected to wifi immediately and off I went. Can’t get any more simple.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "InnocentBystander",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXP2IBYPZQKMOVKNYX53XVBX5BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDOAPRQXIDLQH?ASIN=B078X1BD8C",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2019",
                "reviewTitle": "4.0 out of 5 stars Surprisingly satisfactory considering other reviews",
                "reviewText": "There are some very mixed reviews here but thankfully I will be providing a positive one. I did not encounter nearly any of the problems others did, namely those with installation and connection.It came in a straight up Canon box, not an Amazon box which surprised me a little. So used to seeing that Amazon smirk on the side of a box but nope this was jsut a Canon printer box as if I’d gotten it from Best Buy or something.It was lightweight and the printer is lightweight.. super lightweight to me anyway. It had a bunch of little orange tape tabs to remove and whatnot.Installation: It comes w cd rom installation disk that I did not use as I have a MacBook Air and can’t use cds. I followed all the instructions for not using the cd. They give you a website to go to in order to connect computer to printer. No one else mentioned this but the website I went to was entirely in Japanese. Luckily the icons are generally universal and I was able to navigate the options regardless, but jsut in case it happens to you, don’t panic, it’s totally still doable. I followed each page of directions and went through the various setup screens with general ease. I put a WiFi password in wrong at one point but that was the only hiccup. It’s not the fastest setup on earth and things take time to load or search or connect but it was overall fairly uneventful and straightforward. After computer was connected, I did my phone and installed the canon selphy app. Also easy to do. I did test prints and everything worked.Printer comes with some low yield cartridges which is really nice. It also comes w some photo paper which is also nice but I’d have much rathered some printer paper instead, even if just 10 sheets.I am not in love w the top loader feature I prefer a bottom loader but beggars can’t be choosers and I was on a serious budget so a beggar I was. I’ll manage. The flat top portion is where you place a document you want to “scan”, although I would not call it scan. It is more like a copy feature. Clearly you can’t copy on this printer so if you’ve acquired a worksheet or something that you want to make several copies of, the “scan” feature using your phone will come in handy. I already use JotNot Pro app on my phone to scan docs and print them or email them to myself so this printer feature isn’t exactly novel to me, but I could see myself using it for one document that I want more copies of.I have included many pictures of setup, screenshots, etc; as well as a video of a good portion of the setup. I’d had more from the beginning but I got a telemarketing phone call from “Sri Lanka” in the middle of recording and it stopped my video. But the video I did get should be helpful.I am generally happy w the printer. I do prefer a white printer and very much wish this came in white. Cheap printers have horrible reviews so it was impossible finding one that people didn’t have a problem with. You have to weigh pros and cons and take the chance. This one had better reviews than other Pixmas. I had previously thought I didn’t need a desk area but realized I do and have since had fun creating a little office space for myself. It’s all still a work in progress. Update: The videos are not processing bc of their size and I can’t upload more than one.The desk in the pics is from Amazon, but is a Walmart product from Mainstays and was only $55, for those interested. I reviewed that product as well and I am right now the only review for it if you’re considering a cheap desk. Gold wire desktop document holders are from Walmart store.Hope this review was helpful, and that you too are someone who does not encounter any problems :)",
                "reviewVotes": "104 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kira",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLL6GGYIFMJUCSQWZ6RGULMSF2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YYAD7J0NQFS5?ASIN=B078X1BD8C",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 20, 2023",
                "reviewTitle": "1.0 out of 5 stars Wireless Connection is a Glitchy Nightmare",
                "reviewText": "I bought this because I wanted a nice portable printer to go with my laptop. Wow, huge mistake! It requires the printer to sync to the ROUTER, and NOT the laptop. Supposedly has Bluetooth, it doesn't work! At first, I connected it at home, it was OK... but as soon as I tried using it with a new router while traveling, it brought me close to tears trying to troubleshoot.The instructions given in the manual 100% do not work or do anything. The app doesn't work. Bluetooth connectivity is broken. Connecting it to your router is impossible when you follow manufacturer's instructions. You have to use jury-rigged workarounds to get this to print, so good luck with that.ALSO THIS DOES NOT SCAN OR PHOTOCOPY. The description is misleading. The 'scanning' actually means you are supposed to download the app to your phone, take a photo of the thing you want to scan, and then the printer will print using the phone app. That is not scanning, seriously, Canon?! Great if you enjoy having photocopies that look like they sat in garbage.No, I would not recommend to a friend!When it ACTUALLY connects, it's a good, standard-quality printer. Ink guzzler if you have a lot to print on a weekly basis, by the way. But, the main problem is getting it to connect to your PC...Some people have reported success by simply connecting with a printer USB, but this DID NOT work for me, so buyer beware.Avoid this unless you are OK with spending 50 hours troubleshooting a second-rate product.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Houdek",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXX7QS5EOFIY6EIESNR7KIMHZAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I6WNZKFXCOH9?ASIN=B078X1BD8C",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Boycott HP printers",
                "reviewText": "When I purchases an Hp printer I had to join their \"ink subscription.\" Little did I know, unless I purchased ink , Hp remotely locked my printer until I purchased their ink. Besides, Hp printers are not user friendly especially using wifi. This Canon printer is super easy to set up. Very nice printer for the price. Rearly do I review product. This one deserves a review. Great printer in comparison to others ie; Hp.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}