{
    "remaining_requests": 46313,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Brother-MFC-L2717DW-Monochrome-Compact-Printer/dp/B09XQM9PB3",
    "body": {
        "name": "Brother Monochrome Laser All-in-One MFCL2710DW Value Version (MFCL2717DW) adds 2-Year Warranty",
        "price": "$214.95",
        "originalPrice": "$249.88",
        "rawPrice": 214.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Brother-MFC-L2717DW-Monochrome-Compact-Printer/dp/B09XQM9PB3",
        "soldBy": {
            "sellerID": "A34XSYLZECTRUU",
            "name": "Deals4Less (SN Recorded)",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A34XSYLZECTRUU&asin=B09XQM9PB3&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CKZFC1HD"
        ],
        "asinVariationValues": [
            {
                "asin": "B0763ZCH7K",
                "variationName": "Modelname",
                "variationValue": "New MFCL2710DW",
                "price": "$249.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09XQM9PB3",
                "variationName": "Modelname",
                "variationValue": "New MFCL2710DW Value Bundle (MFCL2717DW)",
                "price": "$214.95",
                "variationImageURL": ""
            },
            {
                "asin": "B09YT4TD87",
                "variationName": "Modelname",
                "variationValue": "Renewed MFCL2710DW Value Bundle (MFCL2717DW)",
                "price": "$199.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "9",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ecX0Yn16L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51dBcKtQO9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51R2HhDbagL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Qu6pXDPsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41yEbOB1RRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-sk6OWVWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Yks11GMvL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Brother Store",
            "link": "https://www.amazon.com/stores/Brother/page/A79BEE12-B7FD-455B-A657-DBE58AF83B36?ref_=ast_bln"
        },
        "brand": "Brother",
        "merchantInfo": "Ships from and sold by Deal Express (SN Recorded).",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 8776,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$29.99 delivery February 14 - 15. Order within 5 hrs 46 mins.",
            "FREE delivery February 14 - 16.",
            "Or fastest delivery Tuesday, February 13. Order within 11 hrs 46 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Print more, wait less. Engineered for increased efficiency with class leading print speeds of up to 32 pages per minute",
            "Dynamic features meet your evolving needs. The 250-sheet paper capacity helps improve efficiency with less refills and handles letter and legal sized paper",
            "Flexible printing. The manual feed slot offers flexible paper handling for a variety of papers and sizes, such as card stock, envelopes, etc. To help you create Professional looking documents",
            "Engineered to deliver productivity. Up to 50-sheet automatic document feeder helps save time with multi-page copy, scan & fax",
            "Printing as mobile as you are. Print wireless from your desktop, laptop, smartphone and tablet"
        ],
        "description": "The Brother MFC-L2717DW All-in-One is a great choice for home or small offices that need full functionality in a compact footprint. The up to 50-sheet automatic document feeder enables multi-page copying and scanning while its class-leading print speeds of up to 34 pages per minute¹ provide increased efficiency. Enables wireless printing from mobile devices.2 Automatic duplex (2-sided) printing helps save paper. The 250-sheet capacity adjustable paper tray handles letter and legal sized paper while reducing the need for refills. Choose built-in wireless and Ethernet network interfaces for sharing with multiple users on your network or connect locally to a single computer via USB interface. Comes with a 2-year limited warranty (1 year Limited warranty plus 1 year bonus value) and free online, call or live chat support for the life of your product. This item also includes up to 500 pages(4) of additional bonus value.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b?ie=UTF8&node=172635"
            },
            {
                "name": "Laser Printers",
                "link": "https://www.amazon.com/Laser-Printers-Office-Electronics/b?ie=UTF8&node=172648"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "15.7\"D x 16.1\"W x 12.5\"H"
            },
            {
                "name": "Item Weight",
                "value": "26 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B09XQM9PB3"
            },
            {
                "name": "Item model number",
                "value": "MFCL2717DW"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 8,776 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,707 in Office Products (See Top 100 in Office Products) #5 in Laser Computer Printers"
            },
            {
                "name": "Date First Available",
                "value": "May 17, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "Brother"
            },
            {
                "name": "Max Input Sheet Capacity",
                "value": "250"
            },
            {
                "name": "Sheet Size",
                "value": "Paper Tray: Up to 8.5\" x 14\" (legal) Manual Feed Slot: 3\" to 8.5\" (W), 5\" to 14\" (L)"
            },
            {
                "name": "Brand",
                "value": "Brother"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Printing Technology",
                "value": "Laser"
            },
            {
                "name": "Special Feature",
                "value": "Auto-Duplex, Scan To E-Mail, Network-Ready, Energy Star, Auto Document Feeder"
            },
            {
                "name": "Color",
                "value": "Black/Grey"
            },
            {
                "name": "Model Name",
                "value": "New MFCL2710DW Value Bundle (MFCL2717DW)"
            },
            {
                "name": "Printer Output",
                "value": "Monochrome"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "34 ppm"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "MFC-L2750DW Compact Black and White Laser All-in-One Printer Perfect for small or home offices, the Brother MFC-L2750DW monochrome laser all-in-one delivers class-leading print speeds up to 36ppm (1) along with wireless networking and single-pass duplex copying and scanning. Flexible paper handling choices include an up to 250-sheet capacity paper tray and 50-sheet automatic document feeder. Offers WiFi printing from compatible mobile devices (2) and NFC 'touch to connect' printing and scanning (3) for added convenience. Why Buy? Class-leading print speeds (1) for increased efficiency Single pass, two-sided copying and scanning helps save time Connect to the cloud directly from the printer (4) Wireless printing from mobile devices (2)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/11b08f15-38e8-4cd4-b2a5-b47910e465c2._SL300__.jpg"
                ]
            },
            {
                "media_text": "Features: Be Productive - Fastest in class print speeds up to 36ppm (1). - Single-pass 2-sided copying and scanning. - Up to 50-sheet automatic document feeder. Stay Connected - Wireless printing from your smartphone, tablet, laptop and desktop (2). - NFC Technology allows you to print and scan without connecting to a network (3). - The 2.7” color Touchscreen provides direct access to cloud services (4). Help Save Money - Automatic 2-sided printing helps save paper. - Toner Save Mode helps save on toner costs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/81ddee98-7374-4f6e-8396-19c1441258f8._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/08943611-9f69-4931-a196-71ce7ff110f2._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/dc727e1a-9950-4bf5-a2f5-49c663bdabde._SL300__.jpg"
                ]
            },
            {
                "media_text": "Not All Toner is Created Equal - Brother Genuine TN770 super high-yield replacement toner delivers up to three times more prints (5) with professional laser print quality you can consistently rely on for 4,500 pages (6). - Additional replacement toner options available for this model: TN760 high yield (3,000 pages) (6), TN730 standard yield (1,200 pages) (6). Proven Brother Reliability - At Your Side with Support for the life of your product. - Brother Printers and All-in-Ones deliver performance you can count on. Never Run Out of Ink or Toner Again Connect your printer to Alexa and receive notifications when you're running low on ink or tonerOr opt-in to Smart Reorders with Alexa to automatically replenish Brother Genuine Ink or Toner before you run outEnjoy Brother Genuine Ink or Toner delivered right to your door",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/450233e6-a94b-4fd0-9403-23b22c7e04b8._SL300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/01b075c3-1a30-4575-95b4-8d5a94cf9769.__CR0,0,633,633_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ee063d2-59a0-4019-b5c5-9277cfe9937e.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Brother DCP-L2550DW Brother MFC-L2710DW Brother MFC-L2750DW Brother MFC-L2750DWXL Brother DCP-L5500DN Brother MFC-L5700DW Functions Print / Copy / Scan Print / Copy / Scan / Fax Print / Copy / Scan / Fax Print / Copy / Scan / Fax Print / Copy / Scan Print / Copy / Scan / Fax Up to 2 years of toner in-box (7) N/A N/A N/A Yes N/A N/A Max. Print Speed 36 ppm 32 ppm 36 ppm 36 ppm 42 ppm 42 ppm Input Paper Capacity (Standard / Maximum)(8) 250 sheets / 250 sheets 250 sheets / 250 sheets 250 sheets / 250 sheets 250 sheets / 250 sheets 300 sheets / 1,340 sheets 300 sheets / 1,340 sheets Auto Document Feeder Capacity 50 sheets 50 sheets 50 sheets 50 sheets 40 sheets 50 sheets Duplex Capabilities Print Print Print / Copy / Scan / Fax Print / Copy / Scan / Fax Print Print LCD Display 2-line LCD 2-line LCD 2.7”Color Touchscreen 2.7”Color Touchscreen 3.7” Color Touchscreen 3.7” Color Touchscreen Near Field Communication (NFC)(3) No No Yes Yes No No Standard Interfaces WiFi, Ethernet, Hi-speed USB 2.0 WiFi, Ethernet, Hi-speed USB 2.0 WiFi, Ethernet, Hi-speed USB 2.0 WiFi, Ethernet, Hi-speed USB 2.0 Ethernet, Hi-speed USB 2.0 Wi-Fi, Ethernet, Hi-speed USB 2.0 Replacement Toner Yields (6) TN730: Standard yield cartridge (1,200 pgs.), TN760: High-yield cartridge (3,000 pgs.) TN730: Standard yield cartridge (1,200 pgs.), TN760: High-yield cartridge (3,000 pgs.) TN730: Standard yield cartridge (1,200 pgs.), TN760: High-yield cartridge (3,000 pgs.), TN770: Super High-yield cartridge (4,500 pgs.) TN730: Standard yield cartridge (1,200 pgs.), TN760: High-yield cartridge (3,000 pgs.), TN770: Super High-yield cartridge (4,500 pgs.) TN820: Standard Yield cartridge (3,000 pgs.), TN-850: High-yield cartridge (8,000 pgs.) TN820: Standard Yield cartridge (3,000 pgs.), TN-850: High-yield cartridge (8,000 pgs.)",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9f0343bb-4c69-4c42-9224-599db72f929f._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/11b08f15-38e8-4cd4-b2a5-b47910e465c2._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/81ddee98-7374-4f6e-8396-19c1441258f8._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/08943611-9f69-4931-a196-71ce7ff110f2._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dc727e1a-9950-4bf5-a2f5-49c663bdabde._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/450233e6-a94b-4fd0-9403-23b22c7e04b8._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/01b075c3-1a30-4575-95b4-8d5a94cf9769.__CR0,0,633,633_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ee063d2-59a0-4019-b5c5-9277cfe9937e.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/937e2aac-0f93-4983-9f92-dfeba560fa65._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a977ce6b-1570-40da-89ae-6927ae911ac6._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a0beb949-a83a-4cff-ac21-b3adfc5b3c17._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f8938253-7dc5-4860-b633-06d4ce535338._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f5085813-58ff-43aa-8f4b-5c27a3f69044._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6c5a3948-d548-4234-aaee-bb1dd579f2f9._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "mathgeek669mathgeek669",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX6A6UARQNJ5YF56Z73CLPDGKNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQOC32RKPB0AD?ASIN=B09XQM9PB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2020",
                "reviewTitle": "5.0 out of 5 stars It Works Pretty Darn Good so Far",
                "reviewText": "I haven't had this printer for too long, but so far, it works pretty good. I have suffered at the hands of cheap inkjet printers from HP for years and was sick and tired of paying ridiculous prices for the stupid tiny ink cartridges that were prone to dry out and quit working if you didn't use them for months. This is my first laser printer, and I am pretty happy with it. I see a lot of people complain about toner issues and connectivity problems with these printers, and after my experience with this one, I can see how a lot of people might have a problem setting this up if they are not very tech savvy. Luckily, I am a computer wiz, so I was able to overcome most of the technical roadblocks in a timely manner. Below is quick run-down for some of the issues people might have with this type of printer and how to overcome them.The first issue someone might have right off the bat is getting it to connect to their network. The DHCP needs to be enabled and have enough addresses available to accommodate another device. Most are set up this way, but not all routers people have for their home networks are created equal, and some come set up from the factory with settings that may limit the ability for peripherals, like printers, to connect to them properly. This is especially true with equipment that is purchased used. Some people, like me :), have their router locked down so tight, that nothing can connect to it unless they want it to.There is a setting in most routers with regard to either \"Set AP Isolated\" or \"WLAN Partition\" or some other jargon, but they all serve the same purpose. That is to disable network equipment connected to the router from being able to talk to each other. This is great if you want added security on your network, but If these settings are enabled on your router, then you will never be able to print to this printer from any device connected to your network unless you are connected directly by a cable from the computer to the printer. It's a give and a take. You give up added security, but hey, at least now your can print, right?The next mistake most people are going to make it to try to install the printer directly from Windows from the \"Printers & Scanners\" or from the device manager. Windows has default drivers that work with the printer and will find and install it, but you are shooting yourself in the foot right from the get-go when you do this. The reason being is that you will never be able to get to the settings and preferences that fully manage this printer, and you will not be able to find the setting that allows you to bypass the setting that makes the printer stop printing when the toner gets low. Many reviews on here complain about the toner-stop-printing issue, so this is how you fix it....Go to the Brother website and download the latest drivers for your printer and install all of the software on your computer. DO NOT use the CD that comes with the printer. It could have been sitting in a warehouse for 6 months or a year for all you know, and the drivers are probably not up to snuff. When the software installation reaches the point where you have to opportunity to update all of the software and firmware from the printer, do it. Do not skip that portion of the installation process. There is a sticker on the back of your printer with the \"password\" that it will ask for when you choose to remotely configure it, and within those settings, you have the wonderful option of setting the \"Toner-Low\" setting to \"Continue\" instead of \"Stop\". That way, you will never have to use those tricks or sequences to bypass when the printer stops printing when you still have oodles of toner left in the cartridge. Another issue that this solves is the fact that, without the software installed, you would never be able to scan documents from the scanner portion of your all-in-one printer and send them to your computer. You would be stuck with only basic print capability.I highly recommended that people also go through their settings for the printer directly at the printer itself and disable the \"Auto Power Off\" function altogether on the printer. It does not gobble up a million volts of electricity all the time when it's not being used. The reason I suggest this is because it will disconnect from the network and become \"unavailable\" for printing until you drag you carcass over to the printer and turn it back on. With the function disabled, it is always connected to your network 24-7 and will wake itself up from \"sleep' and start printing a lot faster then if you had to go and turn it on every time when you haven't used it in awhile. I will update this review after a few months or add more info if I find any issues that I had to overcome.All-in-all, this is a nice little device that can print, fax, scan and copy for a pretty good price. So far, I am really enjoying the benefits of a laser printer over the junky inkjets that I have been using for so long. If you are like me and only print some stuff every now and then and are fed up with clunky inkjets, then you can't go wrong with a laser printer like this one.",
                "reviewVotes": "305 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/41WuPVZpS5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grapplerone",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWAO5EUPODU4QT6OAUAHLWY7YWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CMDA2MXY9XHJ?ASIN=B09XQM9PB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Works like a charm! This beats ANY ink printer.",
                "reviewText": "Reasonably priced B/W Laser printer. After YEARS of owning color ink jet printers I realized that 1) I never had a need for color. 2) Ink cartridges end up costing more than the printer and run out frequently 3) If you don’t use your ink jet very much the ink dries up and clogs the machine. That’s a mess to fix. This solved my problems. Great looking print, copies, & faxes. It prints fast too. If you want a printer that does one job well and don’t need color this is it and you won’t be throwing money away on tons of ink cartridges. These toner cartridges LAST!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nathan C. Harrison",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIDGFXCI67Z4BLCMVVZOZ5FJHRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UK494PWJ49PB?ASIN=B09XQM9PB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Printer is great. Set up of wifi problematic",
                "reviewText": "The printer works perfectly. no complaints. However, following the direction on the wifi setup using the \"setup sheet\" was less than helpful. Had to go to Brother website and find the actual user manual to figure it out. The direction in the user manual were correct and easy to follow. Just an extra step that could be avoided if the install sheet provided better info. Plugging it in to cat 5 or usb, install is super easy and straight forward. no issues. Apple Airprint does work after wifi is enabled.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KenL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYAX2NRG5VYQYQZJ4AZTNESZVPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31K1U28QE6YHL?ASIN=B09XQM9PB3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2021",
                "reviewTitle": "4.0 out of 5 stars Great value laser printer but networking could be better",
                "reviewText": "IMO, this is about the best value for a monochrome laser MFC on the market right now and I'm happy with my purchase decision. I've had Brother printers before and, as expected, print quality of this one is excellent. Toner is reasonably priced - especially compared to ink-jet, which is why I'm relegating my old ink-jet MFC to printing only when I need color. $70 every 4 or 5 months make a $199 laser MFC an economic no-brainer. Footprint of this Brother is not small, but not that much bigger than the Epson ink-jet MFC it is replacing. Paper tray holds 250 sheets, which is a plus. The iPrint&Scan utility software is MUCH easier to use than others - especially what came with my Epson MFC.Network setup is my only complaint. Wireless is limited to 2.4 GHz and I never quite got it to where I could print consistently from my laptop even though I have both 2.4 and 5 networks configured on my router. I'm not a network engineer, but am not a complete network ignoramus. If I couldn't figure out how to access the Internet connected to a 5 GHz network and print via a 2.4 GHz network, imagine what that would be like for someone with even less networking knowledge. I finally gave up and switched to wired Ethernet, but had problems getting that to work since I had chosen wireless when doing the initial install. Hint: not only do you have to navigate several menus deep on the device to enable wired access, you also have to disable wireless access. It will not function with both enabled and enabling wired did not automatically disable wireless. That bit of knowledge is buried rather deep into the troubleshooting process on their support site. In any case, I really like this printer overall, but have decided not to give 5 stars to ANY device that claims to be wireless but doesn't support 5 GHz.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sally  ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN6XNYCLJNMRBBNYARYIFOZSULA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22B9LA4CVHELU?ASIN=B09XQM9PB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Great printer!",
                "reviewText": "Nice printer for the price. I've only had it a month but it works great. It will scan it will copy and it holds a lot of paper. It's just like an office printer that I can use at home.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBBQEJYK2YKAG237Y4R2Q4AJBGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TB1D5D4OEH2D?ASIN=B09XQM9PB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars New features unexpected.",
                "reviewText": "Love paper saving prints two sides. Scans faxes and copies. A little different to configure but instructions were suffucient. I'm very pleased.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUFNIL6ZRSULH5SSDEPICMLHAJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HH1EE2HHXSUR?ASIN=B09XQM9PB3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect Home Office Lazer Printer",
                "reviewText": "My first Brother lazer printer dies after 6 years of heavy use. I upgraded but kept to this Brother printer. WiFi printing and low cost Brother lazer cartridges are best, fast and reliable. Forget the other brands!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Idiot Savant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 9, 2024",
                "reviewTitle": "This is a workhorse!",
                "reviewText": "Love it. Works well. I've printed close to 30,000 sheets so far. I did have to clean the fuser roller once after many of my pages started coming out creased. But there are some helpful videos online that can guide you through that process easily and effortlessly should you ever come to that point. I did make the mistake early on of using cheaper ink and drum kits. That was a huge mistake and was the cause of the dirty fuser. Yes, it's a little more expensive to use genuine inks and drum kits, but worth it in the long run. Fax works well, as does the scanner. Nice little machine for a great price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 10, 2022",
                "reviewTitle": "stampante non funzionante",
                "reviewText": "La Stampante è arrivata non funzionante",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Netster",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 12, 2021",
                "reviewTitle": "Great printer",
                "reviewText": "Love this Brother printer. Moved to this from HP as they wouldn't allow me to use generic toners and will definitely buy a Brother again. No issues at all setting up - read many reviews of people having issues - I had none at all and I'm not tech savvy - just watched the video and done. haven't worked out how to scan yet but that's next.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TomOfMilton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Yes it's monochrome...but man is it good",
                "reviewText": "Fast setup. So much a relief from those never to be sufficiently cursed inkjets. Print is fast and always quality. Only gets a little disappointing when my brain expects \"colour\"...but hey...it's doing everything else so much better.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gary Hampson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 11, 2021",
                "reviewTitle": "Plugged it in, typed in the wifi password and printed!",
                "reviewText": "Such a pleasure to have hassle-free start-up. Plugged it in, typed in the wifi password and printed straight away from my ubuntu machine. Such a nice change after my previous printer (Canot mention the name ;-) ). Fantastic print quality. Thank you Brother - the good reviews were spot on.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$249.00",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}