{
    "remaining_requests": 46305,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Brother-HL-L2405W-Monochrome-Subscription-Replenishment/dp/B0CPL7HRQN",
    "body": {
        "name": "Brother HL-L2405W Wireless Compact Monochrome Laser Printer with Mobile Printing, Black & White Output | Includes Refresh Subscription Trial(1), Amazon Dash Replenishment Ready",
        "price": [
            "4 options from $156.50"
        ],
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Brother-HL-L2405W-Monochrome-Subscription-Replenishment/dp/B0CPL7HRQN",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CST79ZBJ"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CPL7HRQN",
                "variationName": "Style",
                "variationValue": "New: HLL2405W (Wireless)",
                "price": "$119.99",
                "variationImageURL": ""
            },
            {
                "asin": "B092YHRHWX",
                "variationName": "Style",
                "variationValue": "Old: HLL2305W (Wireless)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BMXZNBQW",
                "variationName": "Style",
                "variationValue": "Renewed: HLL2305W (Wireless)",
                "price": "$94.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31n0Y8gzpfL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41zVhJkHeCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51L-RL5 shL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yPZFy8VDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hUMYCSdTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41sXQYH QRL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Brother Store",
            "link": "https://www.amazon.com/stores/Brother/page/A79BEE12-B7FD-455B-A657-DBE58AF83B36?ref_=ast_bln"
        },
        "brand": "Brother",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1174,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tuesday, February 13. Order within 10 hrs 59 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "BEST FOR HOMES & HOME OFFICES – Engineered for consistent, premium print quality, the Brother HL-L2405W Monochrome (Black & White) Laser Printer delivers sharp, crisp prints at an affordable price. Prints one-sided documents at speeds up to 30ppm(2)",
            "COMPACT, CONNECTED PRINTER – Flexible connection options make this an ideal printer for home use and at-home offices. Securely connect to multiple devices with built-in dual-band wireless (2.4GHz/5GHz) or locally to a single computer via USB interface",
            "BROTHER MOBILE CONNECT APP – Manage your printer remotely and print from your mobile device anytime, from almost anywhere. Order Brother Genuine Supplies, track toner usage, and complete more work on-the-go(3)",
            "VERSATILE PAPER HANDLING – Enjoy seamless, reliable everyday printing with the 250-sheet paper tray(4) and a manual feed slot that enables printing on envelopes and specialty pape",
            "BROTHER IS AT YOUR SIDE – Backed by Brother with a 1-year limited warranty and free online, call, or live chat support for the life of your printer",
            "CHOOSE BROTHER GENUINE TONER – When it’s time to replace your toner, be sure to choose Brother Genuine TN830 or TN830XL replacement toner. And with Refresh EZ Print Subscription Service, you’ll never worry about running out of toner again and you’ll enjoy savings of up to 50%(5) on Brother Genuine Toner. Get started with Refresh today with a Free Trial(1)"
        ],
        "description": "The Brother HL-L2405W Wireless Compact Monochrome (Black & White) Laser Printer is the simple, affordable choice for connected printing. Designed for reliability, this quick, efficient printer consistently produces crisp, easy-to-read black & white prints at speeds up to 30 pages per minute(2) (ppm). The 250-sheet paper tray(4) saves you even more time in the workday by reducing the frequency of paper refills. The compact footprint of this dependable, small printer means you can place it almost anywhere on your desktop. Built-in dual-band wireless functionality allows you to connect this b/w laser printer to multiple devices, or connect it locally to a single device with the USB 2.0 interface. Advanced security features help safeguard your information and maintain secure connections while printing. This reliable, cost-effective wireless printer is an efficient and time-saving addition to any home workspace. Use with Brother Genuine Supplies, expertly engineered by Brother to produce reliably sharp and smudge-free black & white prints in your Brother laser printer: Replacement Toner TN830 (Standard), TN830XL (High Yield), and TN830XL 2PK (Twin-Pack), and Replacement Drum Unit DR830. Requires enrollment in a monthly billed Brother Refresh EZ Print Subscription service plan based on monthly printed page allotments. Unused pages roll over, limitations apply. Additional page set charges and taxes apply during trial. Plan, options offer, and pricing subject to change. Open to new subscribers located in the contiguous United States only. After the free trial period your credit card will be charged on a monthly basis for the Plan Fee, Overages, and Taxes in accordance with the Terms of Service. Overage fees will apply during free trial. Your service will continue on a month-to-month basis until you cancel it. May be canceled at any time. Upon cancellation, cartridge will be deactivated and must be replaced at users’ expense in order to continue printing. 2. Based on one-sided printing. 3. Free app download and wireless connection required. Compatibility may vary by device and operating system. 4. Maximum capacity based on using 20-lb. paper. 5. Based on monthly subscription cost in U.S. for Mono Laser Power Plan vs. average cost per page of eligible like standard capacity cartridges. Savings will vary based on Refresh EZ Print Subscription plan selected. Images are for illustrative purposes only. Specifications subject to change.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=172635"
            },
            {
                "name": "Laser Printers",
                "link": "https://www.amazon.com/Laser-Printers-Office-Electronics/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172648"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "14.2\"D x 14\"W x 7.2\"H"
            },
            {
                "name": "Item Weight",
                "value": "15.1 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CPL7HRQN"
            },
            {
                "name": "Item model number",
                "value": "HLL2405W"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,174 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,519 in Office Products (See Top 100 in Office Products) #3 in Laser Computer Printers"
            },
            {
                "name": "Date First Available",
                "value": "January 11, 2024"
            },
            {
                "name": "Manufacturer",
                "value": "Brother"
            },
            {
                "name": "Country of Origin",
                "value": "Vietnam"
            },
            {
                "name": "Max Input Sheet Capacity",
                "value": "250"
            },
            {
                "name": "Sheet Size",
                "value": "Up to 8.5 x 14 Inches"
            },
            {
                "name": "Brand",
                "value": "Brother"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi, USB"
            },
            {
                "name": "Printing Technology",
                "value": "Laser"
            },
            {
                "name": "Special Feature",
                "value": "Auto-Duplex, Network-Ready, Energy Star, Epeat Qualified"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Model Name",
                "value": "HLL2405W"
            },
            {
                "name": "Printer Output",
                "value": "Monochrome"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "30 ppm"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Crisp Black & White Output is Just the Beginning Reliable printing, wireless connectivity, innovative apps – everything you’d expect from Brother. Connect & Print Quickly Connect your computer or mobile devices to your printer via wireless (Wi-Fi) or USB connection. Innovative Apps Make Printing Simple Customizable apps work your way. Manage printing from desktop or Brother Mobile Connect app(1). Trust the Brother Printing Experts Peace of mind with the confidence of Brother At Your Side support for the life of your printer. Next page 1 Wireless Laser Printing 2 Easy Flexible Connections 3 Confidence & Control 4 Reliable Every Time",
                "media_link": []
            },
            {
                "media_text": "Brother Genuine – the Trusted Choice for Reliable Printing Engineered by the printing experts at Brother for consistency, precision, and a reassuring fit, Brother Genuine toner is the trusted choice for professional-quality prints. Available in higher yield options, plus a twin-pack that can save you up to 10% compared to individual cartridges.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b70e8f0a-ef52-429c-9b85-2632262aacb2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Brother Mobile Connect App – a Flexible Printing Tool Simplify printer, supply, and device management from the palm of your hand with the Brother Mobile Connect app, a powerful and easy-to-use app that enables remote printing from almost anywhere.(1)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fbcf9f6f-6ab4-4d9f-8614-7f36ac7a5e88.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "For Best Results Choose Brother Genuine Toner Refresh Subscription TN830 TN830XL TN830XL 2PK Description Flexible Monthly Print Plans Standard Yield High Yield High Yield Twin Pack Approximate Page Yield Plans from 25-1500 pages/month 1,200 pages 3,000 pages 3,000 pages per cartridge Cartridge Color Black Black Black Black What's In the Box More Toner, Before You Need It 1 Black Toner Cartridge 1 Black Toner Cartridge 2 Black Toner Cartridges Brother Genuine Reliability ✔ ✔ ✔ ✔",
                "media_link": []
            },
            {
                "media_text": "Find the Black & White Printer That Works for You HL-L2405W Add to Cart HL-L2400D See Details HL-L2460DW Add to Cart HL-L2480DW See Details DCP-L2640DW Add to Cart MFC-L2820DW Add to Cart Customer Reviews 4.1 out of 5 stars 1,174 3.9 out of 5 stars 23 4.3 out of 5 stars 12,780 4.5 out of 5 stars 5,639 4.5 out of 5 stars 8,228 4.4 out of 5 stars 321 Price $119.99$119.99 — $159.99$159.99 — $199.99$199.99 $249.99$249.99 Functions Print Print Print Print, Copy, Scan Print, Copy, Scan Print, Copy, Scan, Fax Max Print Speed 30 ppm 32 ppm 36 ppm 36 ppm 36 ppm 34 ppm Standard Tray Capacity 250 sheets 250 sheets 250 sheets 250 sheets 250 sheets 250 sheets Duplex Capabilities — Print Print Print Print Print LCD Display 1-line mono LED 1-line mono 2.7” Color touchscreen 2-line mono (backlit) 2.7” Color touchscreen Flatbed Scan Glass — — — ✓ ✓ ✓ Auto Document Feeder Capacity — — — — ✓ ✓ Standard Interfaces Wi-Fi, USB USB Wi-Fi, Ethernet, USB Wi-Fi, Ethernet, USB Wi-Fi, Ethernet, USB Wi-Fi, Ethernet, USB Mobile Device Printing ✓ — ✓ ✓ ✓ ✓ In-Box Toner Yield 700 pages 700 pages 700 pages 700 pages 700 pages 700 pages Replacement Toner TN830, TN830XL TN830, TN830XL TN830, TN830XL TN830, TN830XL TN830, TN830XL TN830, TN830XL Refresh Subscription Eligible ✓ — ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d00bfbc0-3b79-4962-8c69-8ebf0024e016.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/05cd99c2-3f5c-40e6-99a3-99d4059e7806.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24c7ad8f-0083-4177-be38-d77a535cc128.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efb04ad0-8e1f-4e49-88c2-3f0dbc97de4f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c042172-1395-479c-a4e4-abdc81b8270c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b70e8f0a-ef52-429c-9b85-2632262aacb2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fbcf9f6f-6ab4-4d9f-8614-7f36ac7a5e88.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a8e92e0f-6b32-4eb2-b45f-194035ef7083.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7482f1c8-6830-46dd-a61b-77c22d465657.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70dc2030-df80-489c-b07e-13624588ed8b.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f50e555-b0fd-4329-a23c-19031de5aa8a.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/79446f12-518e-45af-b742-51f3ca86f63b.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a4d02ed-74bb-42d6-b055-c22f028afa43.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3951abee-283f-4960-bb67-ac5bd8a5123d.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3737cd51-4dcf-4792-91f0-a33570a32d12.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4ff43d32-b0fa-451b-93e3-07dcb13bc837.__CR0,0,400,450_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e49e4661-462d-4757-a62e-2e753978b872.__CR0,0,400,450_PT0_SX200_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lotus54",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYKFTNNEBG6POISSRXFP6OFWP3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R234B163YJ7URK?ASIN=B0CPL7HRQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2023",
                "reviewTitle": "5.0 out of 5 stars I Only Wish I Got This Sooner!",
                "reviewText": "I made the leap from inkjet to laser with this purchase. This is my first laser printer and I can't for the life of me figure out why I didn't switch sooner. I asked my friends on social media what a good inexpensive printer would be for someone like me who doesn't print much. That's when a friend said if I don't print much I should get a laser printer instead because it's powder instead of liquid ink. I somehow made it halfway through life without ever knowing that! Then I read about how much longer the ink lasts vs inkjet cartridges AND how much more environmentally friendly they are, and I was sold.I was happy to find this Brother for a very reasonable price. My last two printers were Brother and I was always very happy with them, so I was partial to this brand already. I decided to save some much-needed cash and get this monochrome model because I realized that 98% of what I print is black & white text documents anyway. And it's that much less to buy for refills.It's actually a pretty small size for a laser printer compared to some models. The footprint is actually slightly smaller than my inkjet printer and only slightly taller. I like the clean, square shape. The unboxing and physical setup went very smoothly, just pop in the included starter ink and it's ready to go. BUT, I did run into trouble with the wifi setup: It wouldn't detect/connect to my wifi no matter what I tried. I tried several things and was just getting frustrated when I remembered seeing that someone posted their own instructions in a review that I read. So I went back and found the review and Voila! It was connected and ready in 5 minutes. So I STRONGLY recommend ignoring the installation instructions and ignoring the CD and look for a review here by \"Jennifer\" who posted a photo of typed step-by-step instructions that pull up the menu and let you prompt the unit to scan for your wifi router, then enter your password and boom: done. I did see one reviewer complain that they had to enter their password the old-school way by cycling through the letters of the alphabet. That is true, but who cares? Not me! Not for this price. Sure, you can get a better menu with more buttons if you spend more, but I am more than happy with this simple model.The print quality is excellent! SO much better than inkjet, I had no idea what I was missing. It just zips out a printout in like one second, it's amazing. No loud racket of it printing, it's nice and quiet, the thing is a dream by my standards at least. I will say it's a little slower to RECEIVE the printing command (from my PC to the point to when it lights up to print) but to be honest, I think that's my wifi and the position of the printer. My old printer was connected to my PC by a cable, and this new one is wireless and I also have it in a different room from the wifi router unlike the old printer, so I don't even think it's an issue with this model, just the result of it being wireless and in a different room from the router.I'm so happy with this printer, especially at this price point. I don't miss color at all. It's so quiet and prints such nice fine lines. I wish I realized the difference between inkjet and laser sooner because I should have done this long ago.",
                "reviewVotes": "188 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCDRFTHF55KXDG2J4WRUVQOSAKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1R6ZJG3MZHAC8?ASIN=B0CPL7HRQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Works Good",
                "reviewText": "The printer works good and fast. It is kind of difficult to connect the printer to your laptop. I tried to connect through our local network, but I ended up using the included install CD. My work laptop doesn’t have a CD option, so I haven’t been able to print my work documents yet, but I haven’t reached out to technical support yet either.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hans Joyce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRL7IX6G2IEV5ZGPQEHQ6Y3NVTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RKYFUURZMSLP?ASIN=B0CPL7HRQN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Promising Printer With Serious Flaw",
                "reviewText": "We bought the printer to replace an inkjet because the Brother printer is such an inexpensive alternative for black and white printing. Almost all our printing is b&w. We just bought the 2305. Early impressions are all positive. Various fonts in various sizes are perfectly sharp even with the resolution lowered from 600 dpi to 300. The first page takes a little time but subsequent pages come fast. Being able to load a full ream of paper is convenient and toner cartridges do thousands of pages. Duplex printing is not available but turning the page over and printing the second side is simple when duplex for one page is needed. As reported by others, setup can be a Sunday afternoon activity. I bought a printer cable as a reviewer suggested – a good idea. Set up is harder because the few control buttons on the printer have meaningless labels. The tiny LCD screen shows only a word or two. I confess two obvious errors that may save others time. Once the drivers are installed from the CD, disconnect the USB cable before any other steps. If your computer has previously been directly connected to a printer, check Settings to be sure WiFi is on. I subtracted a star because adequate instructions would make setup simple matter.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JOHN BENEDICTJOHN BENEDICT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUDR7OSINBGCCXHDJJ3MGCCLRBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XMZ1QCEBTPOJ?ASIN=B0CPL7HRQN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic wireless monochrome laser printer",
                "reviewText": "I recently purchased the Brother HLL2305W monochrome laser printer and am pleased with its performance and overall value.The printing speed is adequate, at 24 pages per minute, and delivers sharp and clear prints.The wireless connectivity feature connects easily to my Wi-Fi network, allowing me to print seamlessly from my laptop, smartphone, or tablet. It's incredibly convenient and adds flexibility to my workflow.The HLL2305W is compact and lightweight and doesn't take up much space, making it a perfect fit for my home office setup, but it's a touch on the loud side when printing. Despite its small size, it has a more-than-adequate 250-sheet capacity, so I don't have to refill the paper tray constantly.Setting up the printer was straightforward, but I had to go to Brother's website to download print drivers, which seems like such an outdated thing to do today. Fortunately, even with minimal technical expertise, I could get the HLL2305W up and running without hassle.In summary, the Brother HLL2305W is a fantastic monochrome laser printer that offers outstanding performance, convenience, and value for money. I highly recommend it to anyone needing a reliable and efficient home or small office-use printer.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714ptkEofcL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elena Alfaro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG536KH7RLX5RZT6NAFSXEFB72RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA48RERDZMD19?ASIN=B0CPL7HRQN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "3.0 out of 5 stars Worked good for one day and 2 prints",
                "reviewText": "Think we got a bad one. First, it's a hassle to get it connected to the WiFI partly due to a little tiny dark window on the printer to navigate the process. Once I got it connected it seemed to work alright and even did a print test from the cell phone OK. Next day, nothing worked and when attempting to get it connected via WiFi it would connect then lose it and the process started all over. It wouldn't stay connected. So, I'm returning it but thinking of getting the same again cause otherwise I liked it. Print quality seemed very good with the little I saw, and the footprint is, relatively speaking, small with the output on top and not sticking out. Defective? Think so.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniela V.Daniela V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 15, 2023",
                "reviewTitle": "FUNCIONAL",
                "reviewText": "La impresora llego en buen estado y bien empaqueta, fue facil instalar con cable (no lo inlcluye) e imprimi rapidisimo al colocar el tonerPero la impresora me saca las hojas onduladas, pensé que era por imprimir en una hoja más gruesa pero intente con hojas normales y salen onduladas, y da efecto de haberse mojado. Como que la calienta demasiado y causa que salgan asíNo se si a alguien más le ha sucedido",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+NT3MYSeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 13, 2023",
                "reviewTitle": "Excelente impresora precio/calidad",
                "reviewText": "Es rápida, \"silenciosa\", es un poco grande porque las hojas no van por fuera, sino que tiene una caja en la base, que es para meter las hojas tamaño carta (si pones hojas oficio, la bandeja quedará ligeramente salida); lo único complicado es la conexión a Internet, que debería ser muy intuitiva pero pues no tanto, busquen videos en YouTube para conectarla a Internet y está sencillo; para su pc/laptop necesitarán descargar el controlador de la página de Brother EUA (que está la opción de idioma en español) y fácil (viene un CD junto con la impresora pero si usas laptop, no podrás usarlo, por eso tienes que descargar el controlador de Internet). Una vez conectándola a Internet, en el celular bajan la app de brother y luego buscan la impresora (la app sí está muy intuitiva) y listo, podrán imprimir desde su celular, súper fácil y rápido.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gerardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 24, 2023",
                "reviewTitle": "Imprime bien",
                "reviewText": "Viene sin los cables necesarios para su funcionamiento.No renococe la red.Solo imprime con wifi direct o cable",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LUIS MECOR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 30, 2023",
                "reviewTitle": "ESPERE CON EXPECTATIVA PERO QUEDE DECEPCIONADO",
                "reviewText": "Su apariencia agradable pero le dedique todo un día para configurar. no detepta el cable USB en el software de instalación, lo logre por wifi y logre imprimir una paginas, luego se desconfiguro y no más pude configurar, despues de cambiar cables y computadora y nada.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Naysp",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 1, 2023",
                "reviewTitle": "Bueno",
                "reviewText": "Excelente producto práctico y funcional",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$119.99",
                "sellerName": "Office Depot LLC",
                "sellerRating": "4.5"
            },
            {
                "price": "$135.41",
                "sellerName": "SpaceBound",
                "sellerRating": "4"
            }
        ]
    }
}