{
    "remaining_requests": 46191,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Microsoft-Surface-Windows-Professional-Renewed/dp/B00VU1XDDO",
    "body": {
        "name": "Microsoft Surface Pro 3 (256 GB, Intel Core i5)(Windows 10 Professional 64 bit) (Renewed)",
        "price": "$281.58 - $189.00 - $174.00",
        "originalPrice": "$254.80",
        "rawPrice": 281.58,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Microsoft-Surface-Windows-Professional-Renewed/dp/B00VU1XDDO",
        "soldBy": {
            "sellerID": "AYJOM7YEP3BDJ",
            "name": "Avenue Computers",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AYJOM7YEP3BDJ&asin=B00VU1XDDO&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B06XTT46WQ"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "ProcessorDescription",
                "variationValue": "Intel core i3",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00VU1XDDO",
                "variationName": "ProcessorDescription",
                "variationValue": "Intel core i5",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00VVIDD4A",
                "variationName": "ProcessorDescription",
                "variationValue": "Intel core i7",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "HardDiskSize",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51cd7sb2l9L._SS36_.jpg"
            },
            {
                "asin": "B00TUJ7WQW",
                "variationName": "HardDiskSize",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41+OHeDzKeL._SS36_.jpg"
            },
            {
                "asin": "B00VU1XDDO",
                "variationName": "HardDiskSize",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51ftVLGVD-L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": false,
        "maximumQuantity": "6",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41WGGjV6m2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21K9w3g0JzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21w NbVznyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/11Vx9EzCWVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21nXyVxRTVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Y2-c5-a L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31U7kYTdluL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon Renewed",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Living Green Tech",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 931,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 26 - March 6",
            "Or fastest delivery February 25 - March 3",
            "FREE delivery Wednesday, February 14.",
            "FREE delivery February 22 - 24",
            "Or fastest delivery February 19 - 21"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "This Certified Refurbished product is tested and certified to look and work like new. The refurbishing process includes functionality testing, basic cleaning, inspection, and repackaging. The product ships with all relevant accessories excluding Pen, a minimum 90-day warranty, and may arrive in a generic box. Only select sellers who maintain a high performance bar may offer Certified Refurbished products on Amazon.com",
            "4th generation Intel Core i5-4300U 1.90 GHz (with Turbo Boost Technology up to 2.9GHz) with Intel HD Graphics 4400",
            "5MP and 1080p HD front- and rear-facing cameras - Built-in front- and rear-facing microphones - Stereo speakers with Dolby Audio-enhanced sound",
            "256GB solid state drive (SSD)"
        ],
        "description": "Everyday computing just got easier with the Microsoft Surface 3 Laptop. Fully loaded with an Intel Core i5 1.20 GHz Processor; the Microsoft Surface 3 makes for a speedy and efficient Laptop. The 256 GB SSD provides ample space to store all crucial data safely.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computers & Tablets",
                "link": "https://www.amazon.com/Computers-Tablets/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13896617011"
            },
            {
                "name": "Tablets",
                "link": "https://www.amazon.com/Tablets/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1232597011"
            }
        ],
        "productInformation": [
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 931 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,027 in Amazon Renewed (See Top 100 in Amazon Renewed) #226 in Renewed Tablets #797 in Renewed Laptops #1,424 in Computer Tablets"
            },
            {
                "name": "Brand",
                "value": "Microsoft"
            },
            {
                "name": "Series",
                "value": "Surface Pro"
            },
            {
                "name": "Model Number",
                "value": "PS2-00001"
            },
            {
                "name": "Manufacturer",
                "value": "Microsoft"
            },
            {
                "name": "Color",
                "value": "Silver"
            },
            {
                "name": "Operating System",
                "value": "Windows 10 Pro"
            },
            {
                "name": "Item Weight",
                "value": "1.8 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "11.5\"L x 0.36\"W x 7.93\"Th"
            },
            {
                "name": "Ram Memory Installed Size",
                "value": "8 GB"
            },
            {
                "name": "RAM Memory Technology",
                "value": "DDR4"
            },
            {
                "name": "Memory Slots Available",
                "value": "1"
            },
            {
                "name": "Battery Cell Composition",
                "value": "Lithium Ion"
            },
            {
                "name": "Voltage",
                "value": "240 Volts"
            },
            {
                "name": "Hard Disk Size",
                "value": "256 GB"
            },
            {
                "name": "Graphics Ram Size",
                "value": "8 GB"
            },
            {
                "name": "Warranty Type",
                "value": "Limited"
            },
            {
                "name": "Has webcam capability?",
                "value": "Yes"
            },
            {
                "name": "Software Included",
                "value": "Windows 10"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Number of Ports",
                "value": "2"
            },
            {
                "name": "Lithium Battery Energy Content",
                "value": "8 Watt Hours"
            },
            {
                "name": "Screen Size",
                "value": "12 Inches"
            },
            {
                "name": "Resolution",
                "value": "1080p"
            },
            {
                "name": "Display Resolution Maximum",
                "value": "1920 x 1080"
            },
            {
                "name": "Screen Resolution",
                "value": "2160 x 1440 pixels"
            },
            {
                "name": "Card Description",
                "value": "Integrated"
            },
            {
                "name": "Graphics Coprocessor",
                "value": "Intel HD Graphics 4400"
            },
            {
                "name": "Chipset Brand",
                "value": "Intel"
            },
            {
                "name": "Other camera features",
                "value": "Rear"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Total USB Ports",
                "value": "1"
            },
            {
                "name": "Number of Processors",
                "value": "2"
            },
            {
                "name": "Human Interface Input",
                "value": "Microphone"
            },
            {
                "name": "Wireless Communication Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Hardware Interface",
                "value": "Mini-DisplayPort, USB 3.0"
            },
            {
                "name": "Audio Output Type",
                "value": "Speakers"
            },
            {
                "name": "CPU Model",
                "value": "Core i5"
            },
            {
                "name": "CPU Speed",
                "value": "1.9 GHz"
            },
            {
                "name": "CPU Manufacturer",
                "value": "Intel"
            },
            {
                "name": "CPU Model Number",
                "value": "Core i5"
            },
            {
                "name": "Model Name",
                "value": "Surface Pro"
            },
            {
                "name": "Graphics Card Description",
                "value": "Integrated"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Justin Messmer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZXLVHVLKSGWMN2C7SCIFK7M3TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N2IIBB3WJHG6?ASIN=B00VU1XDDO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2017",
                "reviewTitle": "5.0 out of 5 stars I was looking to replace my Nexus 9 and this hit pretty much every tick box I had and finding this ...",
                "reviewText": "I want to preface with I wanted this device as a large premium tablet and not fully as a laptop replacement or productivity on the go device, though I have considered that an extra. I was looking to replace my Nexus 9 and this hit pretty much every tick box I had and finding this refurbished model meant the price was right as well. My other main consideration for a large media consumption tablet was the Samsung Tab S 10.5 because it's larger 10.5\" screen at 16:9 that wouldn't be black boxes when I watch Twitch or Youtube in landscape, the screen is gorgeous, and the specs would be good enough to play Hearthstone, and that's all I care for in a tablet. The Surface Pro 3 manages to do all I need without any issues, save for the issues of having to deal with a full operating system on a mobile device. The screen is a massive 12.3\" which is hard to find on a tablet below $600, and it's gorgeous to boot. It gets nice and bright, though I wouldn't mind a little brighter, and is much more responsive to touch then I thought it would be. It's been a pleasure to use without the keyboard and pen. Doing general tasks is a little harder because we're dealing with a full operating system and that's my biggest gripe with this as a tablet. If you just want to sit down and use it to surf the web you have to deal with system updates, you have to take a little bit longer to generally do anything. There's no Twitch or Youtube app so you have to create an internet shortcut on the desktop, you can't pin those as tiles for whatever reason (tablet mode in general just seems like an unrealized waste) so you need to see your desktop still to use them, if you're like me you're going to need to download .ico images to associate with those links so they don't have a generic symbol. Just to set custom Win10 personalization colors I had to edit registry keys. Simple things like that make this device less suited for leisure activities, but it's capabilities make up for it as a work product. The i3 and 64 Gb SSD are snappy for watching videos and playing Hearthstone, the device does start to run a little hot, but not even close to a snapdragon 820. I haven't noticed any slowdown but I haven't used this for prolonged gaming sessions either, that's not really what a tablet is for.As far as this refurb I haven't had any issues, the device looks brand new, very clean, even inside the ports and all of the heat vents around the top. I have connected a pen or keyboard as I don't have either, and I've seen some reviews saying that's been their issue, but from the general condition of my device I would expect those are rare one-off issues. Either way Amazon is great about returns so I didn't feel like I was taking much of a risk. Overall I'm extremely happy and impressed with the device and I'll probably get the keyboard and pen and use this as a laptop at a later date, because it's been a pleasure to use.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGDAQUJYMSUSMP4ELCVEKTDEWGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K3L9D06SIAZX?ASIN=B00VU1XDDO",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2017",
                "reviewTitle": "1.0 out of 5 stars Update: \"AMAZON REFURBISHED\" is a misrepresentation, really it's just a used device.",
                "reviewText": "Update: My 5Ghz band died on the wireless adapter for my Surface. Spoke with Amazon support, their standards for refurbishing are vague at best. See my chat log:Monique: Yes, I have seen that this is a common issue. Have you tried to contact the manufacturer to see if they have the resolution for this common problem?Me : The device is not under manufacture warranty, the support I have avalaible is via TechNet, it's common network troubleshooting, does not resolve issue.Me : also changed my WAP's channels across the entire 5gthz band still no resolution, other devices on my network function fine at 5ghzMe : When the 5Ghz band doesn't show eSSIDs, The entire device needs to be shut off, then powered on, at that point it will populate the SSIDSMe : Sometimes, will connect.Me : After troubleshooting, it's a hardware issue.Monique: I definitely do agree. Since this item was sold from a third party seller on our website, we do not have access to their inventory to send a replacement. We can refund you for the device and you may feel free to re-purchase from another seller on our website.Me : Ok. Also, from my review and others, I'm concerned about what QA standards go into refurbing these machines.Me : My device was extremely dirty out of the box, and others had issues with damage on their devices. How would I know if I will receive a device that's actually been tested?Monique: All the devices that are certified refurbished by Amazon are tested.Me : What about battery capacity and use, is there a certain number of cycles limited or design capacity percentage to meet the standards?Monique: Yes, but I am not sure what the seller bases them off of.Me : what standard does Amazon have?Me : Batteries only last a certain number of cycles, years, when will it approved as \"refurbished\" 95% capacity? 80%, 70%? This tablet had 150 cycles on the battery, its capacity is still good, but what's the standard since Amazon is not clear. Apple refurbished is really like new, the Macbook I've bought years ago had 2 cycles on the batteryMonique: Products sold under the Certified Refurbished on Amazon label have been tested and certified to look and work like new by a qualified manufacturer or a specialized third-party refurbisher who is either the seller of record, when that is not Amazon.com; or the vendor, when Amazon sells products that it sources from vendors.Me : \"Work like new\" should have a standard in place for battery capacity required. Otherwise, to put bluntly, these devices are just used, not refurbished.Me : Essentially that's misrepresentation of the product stating it's \"like new\" with a battery that has over 150 cyclesMe : I think Amazon needs to clarify what tests and standards go in the refurb process. I would like an exchange only if I feel confident in the device I will receive. Otherwise, This one still functions for the time beingMonique: The refurbishment process includes a full diagnostics test, replacement of any defective parts, a thorough cleaning and inspection process, and repackaging by the seller or vendor.Me : I understand diagnostics, but what % of a battery is deemed to be bad?Monique: It varies upon usage and we do not have access to the diagnostic specifications of the refurbish process.PROS: 256GB 8GB Ram Surface Pro 3 for $430! Perfect function, perfect screen/glass, works with Pro 4 case Keyboard, All day battery life, includes a new/like new AC adapter.CONS: Used item, not refurbished. Very dirty and gross, 93%-98% battery capacity w/ 150+ cycles, minor physical wear scratches, nothing major, Outdated Win10 image installed. Questionable \"refurbishment process\"I'm disappointed by the \"refurbished- like new\" quality of the description listed for this device. From my experiences with \"refurbished\" items from Apple, Dell, and directly from other manufactures, they literally replace and refurb any wear part on the item making it function and look like new. Batteries are replaced, chassis are cleaned and if damaged, replaced with new parts. In the past, the three generations of Macbook laptops I've bought brand new had hardware issues; versus the discounted factory-refurb 2011 one that's still kicking with absolutely no issues for years on end.That said, this Surface is not \"refurbished\", it's used. The amount of work put into refurbishing it is minimal. The screen was cleaned and the OS was reset so you can complete the reinstall of Windows 10 Pro. Note, the Anniversary update was not applied, after reinstall so an older image was used. As for the back, I can tell you the prior owner was pretty gross. The silver magnesium finish was covered with yellow smudges from the smoker's hands, and on the kick-stand between back of the device along the machined crease was a nasty yellow piece of what looked like ear wax! Gross!At that point I was debating on just shipping it back to Amazon for another replacement or just a return. Since it was already on my desk, and I had latex gloves, isopropyl alcohol and a beer nearby, I've mustered up the willpower to clean this mess. Fortunately, the paper towels used removed nearly all of the nasty mess, with q-tips I was able to remove the rest of the gnarly biological mater from the kickstand. To finish off, I went ahead and used a blower to attempt to blow out any dust accumulated from the heatsink area of the device.All said and done, the device actually looks pretty good. Even though my device's original owner was a nasty slob, at least he didn't drop it or scratched it up too badly. There's a few minor wear marks on the back, but nothing too concerning.I've proceeded to use my most current Windows 10 USB boot disk to perform a clean factory format and reinstall. Everything is good. Updated the firmware, drivers, and checked the battery.You can check the battery by going to command prompt in windows, type: \"powercfg /batteryreport\"Overall, the battery usage shows 150 charge/discharge cycles, between 93-98% design capacity after the week of use. I'm not sure if I want to keep this device or just reformat it and send it back.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel Schardt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEERWIIJHF2ZKC3ZRTJ5XA5JNJDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6BXTX85N9CP4?ASIN=B00VU1XDDO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "Got this a present for hubby. His only complaint if you can call it that is having to get use to playing his games on this. It came super fast and easy to set up and connect to the internet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mohammadreza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 6, 2017",
                "reviewTitle": "At this price I did not expect such a high quality device.",
                "reviewText": "Overall:Works perfectly and looks very good. mine has a small scratch at the back which is not visible thanks to the magnesium build.I wish it came with a pen just like the original surface pro 3, but that is not a big issue for me. If you want the pen consider the pen price before you make a decision.Performance:The tablet works fine for note taking and office documents. Anything heavier (web development or video editing) will speed up the fans and warm up the device and drain the battery really fast.Screen:No dead pixels so far and the touch is responsive and well calibrated.Battery:The battery seems to be working properly. After five full charge cycles, the full charge capacity of the battery is 40516 mWH which is 4% lower than the designed capacity of 42157 mWH, which is not a deal breaker for me.Conclusions:If it was a new device or it had a higher price tag I would have rated it 4 stars. For a refurbished device at this price, it deserves five stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 19, 2017",
                "reviewTitle": "Flawless.",
                "reviewText": "Oh. My. Goodness. The Surface Pro 3 is amazing.First, let's get the negative out of the way. It did not come with a pen.Now the positive. Flawless product, no visible use, wear or scratches. About 6 hours battery life. Came pre-loaded with Windows 10. Simple upgrade to current version. Runs exceptionally quick, and I have yet to hear the fan turn on, so it keeps quite cool.All said and done. I am exceptionally happy and would highly recommend a Surface Pro 3 and the seller DealFisher.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Magdy Durocher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 18, 2017",
                "reviewTitle": "Good even in 2017",
                "reviewText": "Awesome laptop tablet. Very good even in 2017. I'm using it to do some gaming and video editing. The device because warmer but nothing alarming. Perfect size for traveling.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 9, 2017",
                "reviewTitle": "I have to say that I really love my Microsoft Surface Pro 3",
                "reviewText": "I never thought I would be a PC person ever again, I have to say that I really love my Microsoft Surface Pro 3!I'm a bit disappointed it didn't come with the Surface Pen, but that's okay.I had no visible physical problems with my Surface Pro 3, it was almost like it was completely brand new. I just wish the battery life was a little better (only good for 5 hours instead of up to 9 hours), another than that. No real complaints about the quality of the refurbish!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}