{
    "remaining_requests": 46032,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Canon-MG3520-Wireless-Printer-Scanner/dp/B00E1XI8YC",
    "body": {
        "name": "Canon PIXMA MG3520 Wireless Color Printer with Scanner and Copier",
        "price": "$134.99",
        "originalPrice": "",
        "rawPrice": 134.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Canon-MG3520-Wireless-Printer-Scanner/dp/B00E1XI8YC",
        "soldBy": {
            "sellerID": "A1YEWGAH97HOTB",
            "name": "Express Office Supply (Serial Number Recorded)",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1YEWGAH97HOTB&asin=B00E1XI8YC&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31F fLgl3dL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31zFU4TOrCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VcFNX8LdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31mKmk82GvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413QaDiDv-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 582vv0LL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Canon Store",
            "link": "https://www.amazon.com/stores/Canon/page/5FDDA83E-27A1-472F-8444-4828B50C4243?ref_=ast_bln"
        },
        "brand": "Canon",
        "merchantInfo": "Express Office Supply (Serial Number Recorded)",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 533,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 15 - 21."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PIXMA Printing Solutions (PPS) lets you print and scan photos or documents from your mobile device and even directly change printer settings and view status information.",
            "Built-in automatic 2-sided printing helps the environment and can cut your paper usage by up to 50%.",
            "Hybrid Ink System utilizes pigment black ink for crisp text, and color dye ink for beautiful photos.",
            "Air Print Enabled! Print wirelessly from your iPhone, iPad or iPod touch directly to your MG3XXX, no drivers needed.",
            "WORKS WITH ALEXA: Ask Alexa to print your shopping list, to-do list, crosswords, coloring pages, and more. To set up, say “Alexa, discover my printer.” Alexa can also detect when ink or toner is running low and orders more when you need it. Save 10% on all ink or toner smart reorders. Restrictions may apply."
        ],
        "description": "Compact All-In-One with multiple wireless printing options, borderless photo, and built-in two sided document printing.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=172635"
            },
            {
                "name": "Inkjet Printers",
                "link": "https://www.amazon.com/Inkjet-Printers-Office-Electronics/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172646"
            },
            {
                "name": "Ink Tank Printers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=51651872011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "12 x 17.7 x 6 inches"
            },
            {
                "name": "Item Weight",
                "value": "11.7 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B00E1XI8YC"
            },
            {
                "name": "Item model number",
                "value": "MG3520 BK"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 533 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#111,081 in Office Products (See Top 100 in Office Products) #106 in Ink Tank Printers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 21, 2013"
            },
            {
                "name": "Manufacturer",
                "value": "Canon USA Inc."
            },
            {
                "name": "Sheet Size",
                "value": "8.5 inch x 11.7 Inches"
            },
            {
                "name": "Brand",
                "value": "Canon"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Printing Technology",
                "value": "Inkjet"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Model Name",
                "value": "MG3520"
            },
            {
                "name": "Printer Output",
                "value": "Color"
            },
            {
                "name": "Maximum Print Speed (Color)",
                "value": "5.7 ppm"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "9.9 ppm"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Samuel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3WVMK26TYLXI7KWMH57O4MD3RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMEODY0SX184G?ASIN=B00E1XI8YC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2013",
                "reviewTitle": "5.0 out of 5 stars An awesome machine at a no-profit price--flawless wireless and duplex performance for almost 3 years.",
                "reviewText": "FINALLY: RELIABLE NON-OEM CARTRIDGES HAVE BECOME AVAILABLE AT A 25% DISCOUNT. CIAJIE cartridges are made with exceptional care, almost equalling Canon originals. YOYO cartridges (which I've just ordered) are slightly higher in price, but if purchased on a subscription basis, can be obtained for an additional 15% discount.I was ready to give up on this, my 3rd MG3520 (the first two were black and red, respectively). But suddenly decent \"clone\" cartridges are available through Amazon Prime. I installed a pair made by CIAJIE and instantly my machine recognized them and sprang back to its old reliable self. For around $50 its mind-boggling trying to come to an understanding of Canon's profit margin after the manufacture of a machine as complex as this. Well, of course, now we know. Without a steady stream of dependable profits from ink sales, Canon--which has had to forfeit much of its camera business to Smart Phones--would not be able to stay in business. (If you appreciate old-fashioned devices like Canon's line of high def cameras, just check out the close-out prices on the Canon site as well as some great used deals on Amazon. The only item I could not be persuaded to buy \"used\" is a printer. Admittedly, they're delicate yet comparatively durable if the user treats them well. Bad ink rarely brings them harm, but if the ink comes in non-Canon cartridges, the slightest misalignment could put your machine out of commission for good. (Which is no tragedy with the MG3520, thanks to prices that barely equal cost of manufacture.)6/15 I've been through at least 8 printers in the last 15 years. It's rare to get 2 years worth of service out of most \"home office\" printers (making me suspect I've gone through a dozen). At under $50 this printer is a no-brainer purchase, a gift from Amazon (look at the higher prices of the other merchants for the same machine--or even the higher prices for the same machine in a different color, esp. red). Above all, look at the price of cartridges -- a single pair will cost you the price of a machine. Few of those other low-priced, lightweight non-Canon machines offer extras like wireless and duplex printing. Moreover, the 3520 has executed both wireless and duplex without a hitch. My previous machines promised wireless, but I soon gave up on them and settled on a 20-foot cable awkwardly strung behind my desk. To my surprise, Canon appears to have gotten it right with the MG3520. Except for the scarcity of cheap \"cloned\" cartridges, the machine has risen to the top of the printers I've used since getting my first some 25 years ago. It's the most durable machine, performing flawlessly while delivering on the extras (duplex printing, wireless printing). I can print from my bedroom from across the house and even from my phone while outside in the front yard. My only complaints have been due to erratic performance (not being able to read remaining ink supply, etc.) as a result of using some of the non-Canon \"cloned\" cartridges.I went to Canon printers after problems, first, with Epson and, 2nd, HP. Still, compared to the sporadic wireless performance of my previous Canons (including an MX Office Model), this is the first Canon that has given me no cause to go to a cable. By ignoring the Blue Tooth feature and using Apple Airplay and Airprint, I'm finally able to depend on flawless wireless connectivity from an iMac or from a Mac Air notebook from the other end of the house. But the primary reason I stay with Canon is the Duplex Printing feature (notice how few new devices include hard-copy instruction manuals. Who wants to print out a 180-page manual when, with this printer, it can be printed out as a 90-page manual?)How is Canon/Amazon able to sell the printer at a price so low that disposal and replacement would be cheaper than repair of the machine?The answer, I'm convinced, is the ink. At $50 for the box of 2 OEM cartridges, it's almost as feasible to order a new machine (which comes with 2 cartridges) than to order the cartridges. Since ordering the machine in Sept. '13 I've had no problems (or \"challenges\") other than feeding it sufficient ink for continuous, day-to-day performance. Canon 2-cartridge system is definitely less economical than its former 4-5 cartridge system (still available on some machines). And if you plan to save money by purchasing clone cartridges, don't get your hopes up. They appear to be manufactured by Canon (or under the company's close surveillance). Moreover, the clones don't have accurate read-outs of remaining ink supply and can \"fool\" the machine into quitting even though ample ink remains. (Google the solution on the internet. Basically, it's a matter of disconnecting the machine from AC for several seconds, than restarting, then pressing down hard on Black or Color or both for 30 seconds. Then enjoying the remaining ink supply without depending upon an accurate reading of remaining ink supply.)It's also probably a good idea to take note of the two different kinds of \"black\" that Canon uses--one is specially made for printing text; the other is a dye that's made for printing photos. When the black ink for text runs out, the machine can be switched over to color, providing text that is faded or slightly reddish, but it's strictly an emergency work-around--not the text quality you'd want on a resume.The machine is also a handy \"copy machine,\" which I use frequently for music. And I honestly don't miss the monitoring, or viewing, screens that were on my pricier Canons.. I guess if you plan to edit photos with your printer, the screens could be useful. Since the only editing I do is in iPhoto, the lack of a screen on the MG3520 is a non-issue. Also, I can't comment on Canon's software for scanning editable text into a computer--something I've yet to try. (I'd be both surprised and disappointed if it wasn't better than the scanner-translators I tried using 10 years ago.)",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Professional Consumer #1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRTITNCHRIDYTEAVVRWDNL354TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PWQO88SNE2G7?ASIN=B00E1XI8YC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2014",
                "reviewTitle": "4.0 out of 5 stars Good printer, but really loud",
                "reviewText": "I purchased this to replace my old HP printer at work and it works great except it is obnoxiously loud. The paper handling noise is annoying, and can be heard several cubicles away. Print quality is good, scans good, easy set up, and price is great. But they really cut corners on the mechanical mechanisms, and it concerns me about how long it will actually last the way it clunks and groans. But, it was cheap, so I can't complain too much. Just don't use it in a library or in any avalanche-prone areas! :-)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jackie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAY26HOFQIEHCP7PIA6EZU7JVLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I2MZF45P4VXD?ASIN=B00E1XI8YC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2014",
                "reviewTitle": "5.0 out of 5 stars Excellent Printer - Perfect for home use - Impeccable color and contrast - Love it.",
                "reviewText": "This printer is an excellent quality printer. It exceeded my expectations, by far. I have gone through a lot of printers in the past year, including hp photosmart, hp this, hp that, lexmark this brother that, etc. My fiance is in the printing business, and I design a lot of his orders and my own invitations, print my own pictures, labels, stamps, and have even printed on magnet paper, and Avery t-shirt transfer paper with this printer. I have not had any problems what-so-ever with the printer, or quality. Canon is definitely a brand I will stay with. The scanner works perfectly and gives you a lot of options when you are scanning - as far as what kind of document you want to save and how you will get to it when you need it. The only reason I didn't give the printer 5 stars, is that it does go through ink pretty quickly. However, I print a lot, and a lot of photos. The first cartridges were the smallest. They lasted about three weeks maybe, but then I got the XL's and they are worth the money and last a lot longer. Another thing that - I was not disappointed about, but a better word would be 'annoyed' I suppose - Is the software. The image garden. I have every photoshop/illustrator/elements/indesign/lightroom etc. so I did not need the image garden. However, I installed it, thinking it would make printing quick and easy. It did not. it just seemed to slow my computer, and I have too many pictures for it to load everytime it starts, so it shuts down almost always. Again, I have thousands of pictures in every format you can think of, so I am not printing your normal account statements or a picture or card here and there. I print in every way shape or form and am constantly adding and editing photos and artwork - designing, and need to be organized. The image garden was more of a headache for me. However, for others, it may be an asset. Either way, I am definitely sticking with Canon for good - I have never had a printer of such great quality at the price it was - (under $50!) and it is simple, lightweight, and versatile. Rarely do I get errors, paper jams, or maintainence issue messages. However, I do get those low ink warnings...Yes, canon, I know the ink is low. It never stays full for long. Time for some XXL'S?",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mariestreet",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 3, 2015",
                "reviewTitle": "Re. Pixma Canon MG3520 Wireless Printer",
                "reviewText": "There is a tray for stacking the papers.Respond to the question asked by Abella \"Jucy\" Arthur email dated July 2, 2015:\"Do I have to feed the paper for printing, or is there a tray to store paper in it?\"_____________My answer:You don't need to feed the paper for there is a tray to store. You will need to adjust the guide to fit the paper size (4 x 6” or 8.5 x 11” and legal size too). lastly you need to pull the output tray extension to support the papers to prevent falling on the ground. It is important to set the computer on a flat surface to avoid any troubleshooting.i don’t use it frequently but find that it is a very compact printer and would recommend it for college students. It is all in one and priced reasonably. You can copy, scan, auto duplex print, wifi print, which are some of the highlights. One point to be mentioned is that you can print the black and white if the color ink is out, but you need to leave the empty cartridge in the printer. Otherwise it won’t print. The USB cable is not included, you need to buy separately. I print from a MacBook Air. It will print in PC computers too. Please verify.Mariestreet.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fern S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2018",
                "reviewTitle": "Five Stars",
                "reviewText": "ok",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 31, 2015",
                "reviewTitle": "Four Stars",
                "reviewText": "nice printer worth for money",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 11, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "great printer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sueferguson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 24, 2015",
                "reviewTitle": "Five Stars",
                "reviewText": "Great little copier/printer/scanner and easy to set up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}