{
    "remaining_requests": 46282,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/HP-DeskJet-Wireless-Printer-7FS74A/dp/B08KSM8JVG",
    "body": {
        "name": "HP DeskJet Plus 4152 All-in-One Color Inkjet Printer, Mobile Print, Scanner & Copy, Instant Ink Ready, Wireless Printers for Home and Office, Built-in USB Port and WiFi, 7FS74A (Renewed)",
        "price": "$72.99",
        "originalPrice": "",
        "rawPrice": 72.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/HP-DeskJet-Wireless-Printer-7FS74A/dp/B08KSM8JVG",
        "soldBy": {
            "sellerID": "A25IO9GPLKBBTZ",
            "name": "Image Warehouse",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A25IO9GPLKBBTZ&asin=B08KSM8JVG&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31i7gA4tTdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41dp1cwmoJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vXbnH6bhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LoNnI3UhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Jb9MF8U1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XnLQc2aJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NfUFBK4bL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Image Warehouse",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1976,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 15. Order within 12 hrs 41 mins."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "Modern multi-tasking – Multi-tasking features for the home office include print, scan, and copy, a hands-free 35-page automatic document feeder, and the ability to send a secure fax from your smartphone, tablet, or PC from anywhere for 12 months with the HP smart app, with this printer made from up to 20% recycled plastic.",
            "Simple setup with HP Smart app – Get started fast with easy setup that guides you, step by step; simply download the HP Smart app, connect to Wi-Fi, and share your printer across all your devices.",
            "Worry-free wireless – Dual-band Wi-Fi with self-reset enables you to get better range and faster, more reliable connections; plus, USB connectivity delivers a hassle-free experience so you can start printing quickly.",
            "Quality you can count on – Original HP ink cartridges deliver sharp text and vibrant graphics for all your everyday documents and photos. Choose high-yield cartridges to get a better value for frequent printing."
        ],
        "description": "Reliability meets modern multitasking for your home office needs with the HP DeskJet Plus 4152 All-in-One Printer. Built to save time, you'll get a hassle-free experience printing, scanning, and copying everyday documents with a 35-page automatic document feeder. Get better range and more reliable connections using dual-band Wi-Fi with self-reset, and the high-speed, built-in USB port. Use your smartphone to set up your printer in a few easy steps, then connect and print from any device using the HP Smart app. With the HP Smart app, you can also get high-quality mobile scanning, copying, and sharing to Dropbox, Google Drive, email, or the cloud, and save time by faxing on-the-go, right from your smartphone, tablet, or PC. This printer can even order ink for you and automatically deliver it to your door when you're running low with the HP Instant Ink delivery service, so you can continue to have excellent print quality, time after time (subscription required).",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13.07\"D x 16.85\"W x 7.87\"H"
            },
            {
                "name": "Item Weight",
                "value": "11.8 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B08KSM8JVG"
            },
            {
                "name": "Item model number",
                "value": "7FS74A"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,976 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,748 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #2,723 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Date First Available",
                "value": "October 6, 2020"
            },
            {
                "name": "Manufacturer",
                "value": "HP"
            },
            {
                "name": "Max Input Sheet Capacity",
                "value": "60"
            },
            {
                "name": "Brand",
                "value": "HP"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            },
            {
                "name": "Printing Technology",
                "value": "Inkjet"
            },
            {
                "name": "Special Feature",
                "value": "Scan To E-Mail, Email Print, Auto Document Feeder"
            },
            {
                "name": "Model Name",
                "value": "7FS74A"
            },
            {
                "name": "Printer Output",
                "value": "Color"
            },
            {
                "name": "Controller Type",
                "value": "Android"
            },
            {
                "name": "Print media",
                "value": "Glossy photo paper"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jason G Teitelbaum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEXY4HUGJDKKVU6GFKEKEWOX46Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO4P9GIPSE8SV?ASIN=B08KSM8JVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Works like a charm",
                "reviewText": "Exactly what was needed for a little house printer, tickets, documents, DND character sheets, business cards basic stuff. The blue tooth connection was easier than expected. Nothing fancy but gets the job done and you can't beat the price. Oh and the ink is real easy to swap out",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ihorkwit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSM6GA7TUC2NTI5MUHJMZLEV6RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYIIBQ91PV2O9?ASIN=B08KSM8JVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars well made",
                "reviewText": "in the past i learned about refurbished items from sears(tools) and k mart (electronics),probably 40 years ago.I always look for refurbished first.these items always served me well at a very big savings",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Cohn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWL64Z6WKDC3AFOK5PDOLT46BAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31HBRDEE928XP?ASIN=B08KSM8JVG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2022",
                "reviewTitle": "4.0 out of 5 stars Great value and lots of functions",
                "reviewText": "I’ve been pleasantly surprised with this printer so far. After my old reliable multifunction printer stopped working, I needed a new one and this seemed like an inexpensive option, even though it’s a factory-renewed unit.I was worried after reading some of the reviews on Amazon, but the setup wasn’t terribly difficult. The only problem I had there was with some of the questions that asked me to share more information than I was expecting with HP and deciding whether it made sense to sign up for their ink replenishment service (so far, I haven’t run out of ink). The print quality seems pretty decent, considering the price. The scanner and copier functions also seem to work well enough with a Windows laptop, though I was disappointed that the software didn’t seem to work with my Chromebook. It seems you need a Windows computer (or maybe a Mac). But the HP Smart app seems to work well on my Windows computers as well as an iPhone and an Android phone.It’s nice to have the wireless functionality, which my old printer didn’t have. The one difficulty I had during use was when my computer switched over to a different Wi-Fi network and couldn’t connect to the printer. But I figured out eventually what the problem was. It would be nice if the printer had Bluetooth connections available. There is a USB port that can be used with a USB cable and that may address some of the Wi-Fi issues some reviewers have commented on.All in all, it’s got plenty of features. I haven’t signed up for the mobile fax service since I have nowhere to send a fax, but it’s nice to know that’s available for 2 years.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JACK EARL IIIJACK EARL III",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUVUKRLGF5WA7ZQABAZXEMX2DIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25F7Y9D5LC2W3?ASIN=B08KSM8JVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars REFURBISHED PRINTER WORKS PERFECTLY! SAVED$80- WARRANTY PROTECTED",
                "reviewText": "I GUESS 2ND TIME'S THE CHARM! IT HAD YELLOW INK ALL OVER IT FROM THE LAST JACKASS - BUT APPARENTLY, FOLLOWING INSTRUCTIONS IS AN ART 😱I AM EXTREMELY HAPPY WITH THIS PURCHASE.EVERYTHING WORKS PERFECTLY!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61a0cm1JnqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Krystin McCulley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4NFPKO2QJIAOBRGR3RPIJ43WKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJMP6SBMGGOAM?ASIN=B08KSM8JVG",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2021",
                "reviewTitle": "1.0 out of 5 stars Connectivity errors via iPhone and HP Chromebook.",
                "reviewText": "I connected using my iPhone 11 Pro Max. When I leave the house the printer obviously disconnects from my phone. But when I return I have to switch to the HP Printer through my WiFi settings. Kinda lame to have to manually switch any time I need to use the printer. Not a problem except nowhere on HP’s website is that factoid made accessible to the user...so had to find help in user subs. I tried to print some coloring pages for my child today. I used the browser files and downloaded to my photo library. Tried printing and failed. Downloaded to my docs/files instead. Then tried printing from that destination, unfortunately it failed. Tried using the coloring pages that are available through the HP Smart App…still failed. It presumed the size I wanted printed for the document to be 4x6 in size, but refused to print on 8.5 x 11 paper. The printer would not print unless I had the correct size of paper. I tried to find the setting options within the app and on the printer itself so I could change the printer paper size that it would be printing on. I unfortunately could not find that anywhere. I searched forums and HP Help and Support, but nothing. I guess I am too old school because I remember printers not giving a damn and just printing on paper that was in the printer. But unfortunately this printer is particular and temperamental. Your loss HP. I read the reviews and though the connection issues were fluke occurrences. But this particular printer does not like Apple products or Chrome books.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Geo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJFJMHZOE5FFNM5HJJB6X6YCDHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1E8OHHBC26HBV?ASIN=B08KSM8JVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Printer",
                "reviewText": "Printer worked as it should",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew B. Daugherty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAPJSIJNWUCVMR5GQEN7HOQ4WNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WBDUIFB06DU4?ASIN=B08KSM8JVG",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "3.0 out of 5 stars Disappointed",
                "reviewText": "I got this for my wife who is a teacher, here she is to tell you how she feels about this product: This printer is infuriating! I work hard and have only the evenings and early mornings to get papers ready for classes. I spend weekends fighting with this printer trying to print out copy sheets to then take to school to copy on their large printer. I will print out about 20-50 sheets of items that will need to be made into multiple copies for my classes. With no planning period, I have no time to waste. With this printer I have been wasting hours….not minutes, HOURS! I do not have time for a printer that will not wake up from its coma to print a single sheet of paper at 5:30 in the morning! Take this sucker back! I hate it. When it DOES print (few and far between moments) it is wonderful! But it will take us 1o-2 hours to get it to wake back up and work with our iPads! Maybe it is a PC only or Cell phone only printer. If so I missed that! I do not like buying electronics from the internet and this just helps to prove me right. 3 stars because when it does print, it does it well. I do not recommend to anyone who needs something done now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG4T2RSI7MEKBAVVXNGVQBLLGXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2357SUCS1XINL?ASIN=B08KSM8JVG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome printer",
                "reviewText": "I was a pain to setup, but it works great it's quite and prints jobs come out looking great.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 4, 2023",
                "reviewTitle": "No sirvio",
                "reviewText": "No sirvio me indica en pantalla que no detecta los cartuchos de tintas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}