{
    "remaining_requests": 46335,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/HP-OfficeJet-Wireless-Printing-403X0A/dp/B0CFM82NS2",
    "body": {
        "name": "HP OfficeJet Pro 9125e Wireless All-in-One Color Inkjet Printer, Print, scan, Copy, fax, ADF, Duplex Printing Best for Office, 3 Months of Ink Included (403X0A)",
        "price": "$199.89",
        "originalPrice": "$289.99",
        "rawPrice": 199.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/HP-OfficeJet-Wireless-Printing-403X0A/dp/B0CFM82NS2",
        "soldBy": {
            "sellerID": "A11Y84PQ1H4PTX",
            "name": "Best Priced Printers",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A11Y84PQ1H4PTX&asin=B0CFM82NS2&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CRTDLPX2"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CFM82NS2",
                "variationName": "Modelname",
                "variationValue": "New Version",
                "price": "$199.89",
                "variationImageURL": ""
            },
            {
                "asin": "B08QR6P8KV",
                "variationName": "Modelname",
                "variationValue": "Old Version",
                "price": "$229.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31zkJHoqs0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41T-NwfNmNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41up sVePUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iCjie1DdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31RRnRSGUoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RtfR13xGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vdU5Qm4SL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0965856c-4bdf-4f92-89c8-50c429dc3f38/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3b10ed74-3f71-4365-bf0d-5b96d4cff244/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/deea8c4a-dea0-42c8-a669-8404c239fae7/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 3,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1OMJHtdwJL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1OMJHtdwJL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the HP Store",
            "link": "https://www.amazon.com/stores/HP/page/5BA42671-3E42-4AEB-B9E4-272F10DD0121?ref_=ast_bln"
        },
        "brand": "HP",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 6028,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 14 - 15. Order within 12 hrs 49 mins.",
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "FROM AMERICA'S MOST TRUSTED PRINTER BRAND – The OfficeJet Pro 9125e is perfect for offices printing professional-quality color documents like presentations, brochures and flyers. Print speeds up to 18 ppm color, 22 ppm black.",
            "UPGRADED FEATURES – Fast color printing, copy, fax, auto 2-sided printing and scanning, auto document feeder, and a 250-sheet input tray",
            "WIRELESS PRINTING – Stay connected with our most reliable dual-band Wi-Fi, which automatically detects and resolves connection issues",
            "HP APP – Print, scan, copy, or fax right from your smartphone with the easiest-to-use print app",
            "3 MONTHS OF PRINTING INCLUDED – Subscribe to Instant Ink delivery service to get ink delivered directly to your door before you run out. After 3 months, monthly fee applies unless cancelled, and you save up to 50%.",
            "PROTECTS YOUR DATA – Built-in HP Wolf Pro Security uses a powerful suite of customizable tools that boosts security and helps keep networks protected against cyber threats and malware",
            "2.7-INCH TOUCHSCREEN – Quickly navigate your printer with a large color touchscreen and a phone-like user interface",
            "SUSTAINABLE DESIGN – Made with more than 40% recycled plastic",
            "This printer is intended to work only with cartridges with original HP chips or circuitry and will block cartridges using non-HP chips or circuitry. Periodic firmware updates will maintain the effectiveness of these measures."
        ],
        "description": "The HP OfficeJet Pro 9125e delivers fast color printing, 250-sheet paper capacity, and duplex scanning and copying. It includes wireless and printer security capabilities to keep your multifunction printer up to date and secure.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b?ie=UTF8&node=172635"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13.48 x 17.3 x 10.94 inches"
            },
            {
                "name": "Item Weight",
                "value": "20.48 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CFM82NS2"
            },
            {
                "name": "Item model number",
                "value": "403X0A#B1H"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 6,028 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#357 in Office Products (See Top 100 in Office Products) #6 in Computer Printers"
            },
            {
                "name": "Date First Available",
                "value": "January 12, 2024"
            },
            {
                "name": "Manufacturer",
                "value": "HP"
            },
            {
                "name": "Max Input Sheet Capacity",
                "value": "250"
            },
            {
                "name": "Sheet Size",
                "value": "8.5 x 11;8.27 x 11.7;8.5 x 14;7.16 x 10.12;"
            },
            {
                "name": "Wattage",
                "value": "100 watts"
            },
            {
                "name": "Brand",
                "value": "HP"
            },
            {
                "name": "Connectivity Technology",
                "value": "802.11a/b/g/n/ac 1x1 (2.4/5GHz) with BLE"
            },
            {
                "name": "Printing Technology",
                "value": "HP Thermal Inkjet"
            },
            {
                "name": "Special Feature",
                "value": "Forest First product with HP+; Recyclable through HP Planet Partners, HP+; HP Instant Ink eligible; Print from phone or tablet; Touchscreen; Smart Advance Scan; Instant Paper; Front USB flash drive port; Two-sided printing; Two-sided scanning; Automatic document feeder; Fax See more"
            },
            {
                "name": "Color",
                "value": "Cement"
            },
            {
                "name": "Model Name",
                "value": "New Version"
            },
            {
                "name": "Printer Output",
                "value": "Color"
            },
            {
                "name": "Maximum Print Speed (Color)",
                "value": "18 ppm"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "22 ppm"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 Instant Ink 2 Security 3 HP app 4 Sustainability",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f5b239d-2a03-4888-8384-30c35e818331.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bf0f3e23-a8ec-4ee7-b275-7b28233ba3e5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2798e7c3-2dd1-4c2f-b9fc-8dc8e9fb15fa.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb17d173-edf3-4225-a149-a2905e8d10e8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4016336-ca0c-45ee-b563-38843c585030.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70ab68d0-7065-489f-9745-7adc65ec716c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad66a8f7-385e-4144-9efd-8ccdd0019d1e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e5fef98a-b6d3-41c3-8805-aecafed126ae.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer Gravenstine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSNON5RXXACF5SH7CWLGM6NHDPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RPPD8V3HV1O?ASIN=B0CFM82NS2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Great features for a good price",
                "reviewText": "My previous HP all-in-one (8600) suddenly crapped out on me - worked in the afternoon and wouldn't work in the evening. I ordered this one that night and received it the next day. I paid a little more to get this model because it has the duplex scanning/copying. My previous printers could only scan one sided or print double sided from a single sided original. This one can replicate a double sided original!It has a little smaller footprint than my old one and that's nicen for the most part. I think that also means the glass is a little smaller which means I can't scan/copy and reduce some of my oversized things without cutting off some bits of it. Not a feature I use frequently but is quite useful for me when it is needed. I'm a musician and sometimes need to scan or copy sheet music and orchestra parts to make better page turns or so I can use my ipad - music is often oversized on purpose to make it harder to copy so a bigger glass would useful but I understand why they have gotten smaller over the years.I love that this model has the duplex (double sided) scanning and printing. It's a massive time saver for me to be able to drop whole volumes into the feeder and it will scan both sides of the pages in order so I don't have to repurchase digital versions of stuff I already own.This is my first foray into Instant Ink. I don't actually print a whole lot of stuff anymore so I don't know if it will be a good value but we'll see how it goes. It came with 6 months free and I think I'm already past that time and I'm still using the cartridges that came with the printer (though I am starting to get the low ink warnings and I have my first set of Instant Ink cartridges ready and waiting).I have found HP printers to be quite reliable and reasonably priced. I've had several over the years and they seem to have held up, outlasted, and had better features than the other brands I've owned.Printers are relatively inexpensive these days, it's the ink that will cost you! Hopefully this model is ink-efficient (it has individual color tanks which is ideal) and the Instant Ink subscription will save me money.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pete",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7DIMVZYWBMFCTHHNP4U7BM2C3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18R437MPIS1Z7?ASIN=B0CFM82NS2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Printer",
                "reviewText": "This is an excellent home/work printer it worked exactly how I wanted it to work performs all function that I needed like fax, scan, copy, print and 2-sided printing. Eventhough, I am old fashion and prefer stuff with pushbuttons in my personal opinion for navigating the screen and dialing the number for faxing it was still easy to use. Printing away from home using your smartphone is a plus in my opinion and made my work life easier when it comes to trying to remember what I had to print when I got home, when I could just print write then and there and have it already printed when I get home. The scanning side of the printer worked great and functioned the way you want when needing to make copies of bigger paper items and it comes out perfectly. It looks fragile with all the plastic frame and its design when operating it and it may be a little to noisy and may sound like its self destructing but, for the price and all the quallity it has its sturdy tough and performs all your printing needs. The color white isn't my favorite color I'd prefered the printer in black, but its still does what I need it to do. Thank you company who designed this printer. I love it, please don't discontinue this product.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Buyer (SlM)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSNWUVGCAW7CQUPXS2ZBPRWGVIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P2UKK83OLKGG?ASIN=B0CFM82NS2",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2021",
                "reviewTitle": "1.0 out of 5 stars HP Quality Has Decreased: HP 9015e Does Not Compare to HP 8610, HP 8630, or HP 8740",
                "reviewText": "I am a long-time HP customer, and all my printers have been HPs. My first printer, a black-and-white HP laser printer, lasted for many years. It was followed by an HP DeskJet 940c color printer; this printer still works, but it is now difficult to find its cartridges (I only purchase HP cartridges, and the printer rejects out-of-date cartridges) and its function is limited to printing only. My printers since then have been HP OfficeJet Pro All-in-One Printer/Scanner/Fax — HP 8610, HP 8630, and HP 8740 — each of which has unique problems. The HP 8610 will scan to USB, but ruins the USB drive to which files and images are scanned. The HP 8630 fails to recognize or acknowledge the presence of a USB drive but it will scan to PC’s using its wireless capabilities and it can print using both of its paper trays. The HP 8740, the worst until now, fails to recognize or acknowledge the presence of USB drives, it will not scan to PCs unless the PC initiates the connection, it has frequent paper jams, and the second paper tray is useless as the unit will not acknowledge its presence. As you might imagine, it is disappointing to spend money — at the time $399, $299, and $349 (after coupon and price-match), respectively — on these all-in-one printer/scanner/fax units and not be able to use all their stated features.That said, the HP OfficeJet Pro 9015e is no different — it has problems too. The first problem I noticed while removing it from the box is the lower quality of the build of the device. The quality of my HP 8610, HP 8630, and HP 8740 is far greater than that of the HP 9015e; it feels cheap in comparison to the HP 8610, HP 8630, and HP 8740. The HP 9015e does not even have a real paper tray — the back of its “paper tray” is open: there are two long plastic hooks and no distinct location for the back placement of the paper. Real paper trays have a clear front and back location for the paper within the tray. The front door of the HP 9015e, via which one accesses the cartridges, does not have the high quality feel of the front doors of the HP 8610, HP 8630, and HP 8740, and this door does not close as soundly (and is not flush against the body of the unit!) as that of the other three units. The HP 9015e does not even have a power button with a solid feel as the HP 8610, HP 8630, and HP 8740. The sounds of the working HP 9015e are not satisfying as those for the HP 8610, HP 8630, and HP 8740: the HP 9015e sounds rickety and as if it is falling apart. Every time I print something, I wonder if this will be the last page I can print — I have owned this printer for less than one month at the writing of this review and there was a two-week delay before I could set up the printer at my office: I should not feel this way about a brand new printer. The output “tray” for the HP 9015e is a disappointment and it does not hold printed pages well; it certainly does not hold printed pages as securely as the HP 8610, HP 8630, or HP 8740. So far, I have been able to print several pages as well as scan to PC, initiated via the PC, but I have not been able to test the unit to its full extent.Installation using the HP Smart App was TERRIBLE! The connection options for the HP 9015e are wireless, ethernet, and USB: all three should work, yet the HP Smart App refused to install the printer via USB connection. After trying to connect the HP 9015e to my Windows 10 PC multiple times — too many times — using the HP Smart App, I downloaded the only other available software option to provide printer/scanner funtionality. This software was also problematic as it directed me to wireless or ethernet connection, rather than USB connect to PC. However, after multiple attempts, the USB connection between the HP 9015e and my PC was established — and accepted by the software; one should not have to endure inquires from software regarding one’s choice of connection type — the owner of the device chooses the connection type, not HP via its software/app.Since I need a printer/scanner/fax at my office, I decided to keep the HP 9015e, rather than to return it. However, I do have concerns about how long it will function and I am still in the process of determining which of its stated functions operate properly. I do not appreciate HP trying to dictate how I connect and use the printer for which I paid: I chose the USB connection and I chose to disable wireless printing since the printer is for my use (I paid for the printer and I pay for the cartridges), not for the use of others (who may wish to try to establish a wireless connection) at my place of work. It is worth mentioning that the HP+ option did not appear when I installed the HP 9015e using the software rather than the HP Smart App; this is not good business, HP, as everyone purchasing this unit should be offered the same “bonus” options.Based on my experience with a firmware update for my HP 8630, I would recommend that you disable HP updates. After the last firmware update, my HP 8630 would not recognize the perfectly functional printhead installed in the printer; I had used my printer without issues prior to this firmware update. After that update the HP 8630 displayed a message that the printhead was now missing or damaged! To make a long story short, I was forced to purchase a new printhead for $179 in order to continue to use this printer! I view this as unacceptable and bad business on the part of HP. I have no intention of going through that for the HP 9015e; I plan to turn off HP updates so that they cannot be installed via my PC.Due to the various problems that I have had with the HP 8610, HP 8630, and HP 8740 (especially its paper jams and the non-functional second paper tray), the HP 9015e may be my last HP printer because its build-quality does not compare favorably to any of the three. What happened to the quality of my original HP laserjet and my HP 940c???? I have to wonder about the quality of future HP printers or HP all-in-one units based on the cheap feel of the HP 9015e. I am disappointed, and I would not recommend purchasing the HP 9015e.",
                "reviewVotes": "276 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debbie Hellmer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2024",
                "reviewTitle": "Fast and Easy Setup",
                "reviewText": "This is a great printer! I was planning on spending the day setting it up and had it done in an hour and that included unpacking it. Prints nicely and quickly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "Amazing Fast Printer From Hewlett Packard",
                "reviewText": "I am Very Happy with My New Printer. This is the Third Time I Buy from HP. I am a Loyal Customer.I had a HP Photosmart Printer for many years until the paper would'nt load anymore for some reason.So I decided to buy a Brand New and Modern Printer on Amazon. I believe I paid about $260 with Tax.For some reason I had a difficult time entering my Wi-fi Password on the Printer and then I clicked on the WSP button on the back of my Router and it Automatically set the password and The printer works like a Charm....very Fast Printing....I Am Very Happy and I definately recommend HP printers...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 5, 2022",
                "reviewTitle": "disgusting piece of junk with horrible cutomer support.",
                "reviewText": "I bought this POS because my previous HP printer was fantastic. This one is a piece of junk, noisy cheaply made of flimsy plastic and only sometimes operational. How hard is to get a printer to print? I mean really this is ancient technology.In summary:1) Took 3 hours to get it set up, finally after hours for bizarre instructions, for no reason at all it started to work.2) after three months it decided that it could no longer access the PC via Wi-Fi, though it was only 6 inches from the Wi-Fi router and had accessed the PC for three months, another 3 hours and I got it to work via cable no more wireless.3) three months later it again refused to work, this time my son-in-law the I.T. guy managed to get it working in only half a hour after I had worked on it for a couple of hours.4) A month later it again died, this time I finally got through to a real live tech support lady and after only an hour she got it to work. She tells me it didn’t work because the driver was not installed, interestingly ran for 10 months with no driver installed, methinks that is a bit dubious but anyway it was working again.5) Run out of ink, install new HP cartridges and again no love, first get illegal cartridge error, then get empty cartridge error, like I mean this is HP instant ink program ink. First lady had me go through all of the stuff I already had done on the online help section then gave up and offered to send me a new Cyan cartridge. Second dude, told me remove cartridges and wipe the cartridge contacts, which is IMPOSSIBLE since that style does not have exposed contacts, they are sockets-DUH, then he wanted me to wipe the interior contacts which are clusters of three pins for the aforementioned sockets, the best you could ever do is touch the tips with a cloth since they are enclosed in guidance shrouds, so clearly this guy has never seen the printer or the cartridges and is just mindlessly reading the wrong script. All techs were nice but need to speak more than a facsimile of English and need at least a rudimentary knowledge of the product they are providing support for.So now I wait a week for a Cyan cartridge and a sure as God made little green apples I will need the other three as well. It seems the whole point of HP customer service is to avoid actually doing anything that would be useful and to waste as much of their customers time as possible.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TorontoGuy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2023",
                "reviewTitle": "Prints Really Well",
                "reviewText": "The OfficeJet Pro 9015e is an excellent printer. But like all printers, they are all priced a little high everywhere. That’s value is only 4 Stars. Easy setup, print quality is excellent. The ink you buy for this printer also has better page output than the 8000 series printers. Yes I would definitely recommend this printer and pay the extra to get this over the 8000 series models.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve D.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2023",
                "reviewTitle": "Easy painless setup!",
                "reviewText": "I bought this printer to replace a decade old Epson inkjet printer. I use this in my home office & while it doesn't see loads of heavy use, it has performed flawlessly on the few hundred prints I've processed. Wireless set up was a breeze! I've subscribed to the HP instant Ink program, so not having to ever worry about running out of ink is a huge plus!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$199.99",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}