{
    "remaining_requests": 46295,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Canon-Wireless-Supertank-Megatank-Printing/dp/B081TZ38X2",
    "body": {
        "name": "Canon G7020 All-in-One Printer Home Office | Wireless Supertank (Megatank) Printer | Copier | Scan, | Fax and ADF with Mobile Printing, Black, Works with Alexa",
        "price": "$239.00",
        "originalPrice": "$379.99",
        "rawPrice": 239.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Canon-Wireless-Supertank-Megatank-Printing/dp/B081TZ38X2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418ioX9gflL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41fF 9 qglL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iwAnZ8m0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41UAcliLubL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vEKk2XF-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VOee2WH L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61C-MqlpKvL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/63a3c98d-bf6e-49ea-ad45-09c8d98dca07/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1e4b62e6-3aa4-4a12-8e53-7e45e03b0bab/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/212f7588-fb36-48a8-9ec7-1feb187df93c/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1967e93f-aa44-4e03-85f7-1f0f45de264e/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9cb45ab4-32c5-4677-abd8-8ce96ef0b3d3/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eb0958d1-3aa4-4a2d-a49e-3b613ecd3ab7/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1pBbpZnPTS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71OiTaNkaUL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Canon Store",
            "link": "https://www.amazon.com/stores/Canon/page/5FDDA83E-27A1-472F-8444-4828B50C4243?ref_=ast_bln"
        },
        "brand": "Canon",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 2925,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Friday, February 16. Order within 23 hrs 43 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "EPEAT products are assessed against criteria including energy use and have a reduced sustainability impact across their lifecycle. SILVER"
        },
        "features": [
            "Never run out of ink. Connect your printer to Alexa and receive notifications when you’re running low. Alexa can even place a smart reorder from Amazon on your behalf, if you enroll in smart reorders",
            "Enrolling in Smart Reorders with Alexa ensures that you never have too much or too little ink supplies. No subscription needed.",
            "Wireless 4-in-1 (Print | Copy | Scan | Fax)",
            "Integrated Ink Tanks - Up to 6,000 pages BW / 7,700 pages Color",
            "2 Bonus Black ink included!",
            "13 / 6.8 ipm",
            "Auto 2-Sided Printing",
            "5,000 Page Duty Cycle",
            "ENERGY STAR, EPEAT Silver,1 Year Warranty",
            "Print with your voice. Just say “Alexa, discover my printer\"."
        ],
        "description": "Meet the PIXMA GRNUM Wireless MegaTank all-in-one printer - designed for serious print productivity with a high page yield of up to 6 000 pages of Black text or up to 7 700 vivid color pages per full ink bottle set from the reliable refillable ink system. The PIXMA GRNUM MegaTank printer delivers outstanding high yields resulting in a low cost per page and also features superior versatility thanks to an ADF for scanning copying and faxing. The GRNUM allows you to keep working - even on large print jobs - with auto 2-sided document printing borderless2 photo printing and a 350 sheet plain paper capacity connectivity is paramount with the GRNUM featuring Wi-Fi 3 and Ethernet connection when printing from computers and also for mobile printing with airprint 4 Mopria Print Service5 and the Canon Print app6 for even more printer information and control.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=172635"
            },
            {
                "name": "Inkjet Printers",
                "link": "https://www.amazon.com/Inkjet-Printers-Office-Electronics/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172646"
            },
            {
                "name": "Ink Tank Printers",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=51651872011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Canon"
            },
            {
                "name": "Series",
                "value": "‎Canon PIXMA G7020 Wireless All-In-One Supertank Printer, Copier, Scan and F"
            },
            {
                "name": "Item model number",
                "value": "‎3114C002"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 8.1, OS X 10.11 El Capitan, macOS 10.12 Sierra, macOS 10.14 Mojave, OS X 10.10 Yosemite, Windows 7, macOS 10.13 High Sierra, Windows 10"
            },
            {
                "name": "Item Weight",
                "value": "17.8 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎8 x 11 x 5 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎8 x 11 x 5 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Power Source",
                "value": "‎AC Supply"
            },
            {
                "name": "Manufacturer",
                "value": "‎Canon USA"
            },
            {
                "name": "ASIN",
                "value": "‎B081TZ38X2"
            },
            {
                "name": "Country of Origin",
                "value": "‎Vietnam"
            },
            {
                "name": "Date First Available",
                "value": "‎December 3, 2019"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 2,925 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,862 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #22 in Ink Tank Printers #223 in Climate Pledge Friendly: Computers"
            },
            {
                "name": "Connectivity Technology",
                "value": "wired, wireless"
            },
            {
                "name": "Printing Technology",
                "value": "Inkjet"
            },
            {
                "name": "Special Feature",
                "value": "refill ink,wireless"
            },
            {
                "name": "Model Name",
                "value": "Canon PIXMA G7020 Wireless All-In-One Supertank Printer, Copier, Scan and F"
            },
            {
                "name": "Printer Output",
                "value": "Color"
            },
            {
                "name": "Maximum Print Speed (Color)",
                "value": "15.5 ppm"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "24 ppm"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/a9c47c80-0d7c-4dca-9693-5f0ca552de63.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Win2000",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAS4FCUNJ5SFFVYFR3J2E3ILRNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSHCL0T7OV1SG?ASIN=B081TZ38X2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 22, 2020",
                "reviewTitle": "5.0 out of 5 stars Great Printer-Never Going Back to Cartridges Again-Fast, Super Cheap w/ Ink (refills too)- Love It",
                "reviewText": "So after having Canon printers from way back in 2003 for a few years and getting excellent results and pictures (using the Canon high gloss photo paper back then) i switched to Epson when it died a few years ago. The Epson WF 4730 and most recently when that died the WF4740 (which also just died) I decided to go back to Canon again. I REALLY like the Megatank system. This printer has a pretty small footprint too as far as it's size compared to the Epson we just replaced. It seems like it will be a lot more efficient on ink and the replacement bottles are really reasonable (on Amazon colors are only $11/each and slightly more for the black ink which is a larger bottle). The text prints fast and the colors are spot on. Haven't tried pictures yet but will update my review when I do try printing them. The only gripe I have with this printer are a couple of things. First, the LCD screen is small and doesn't light up making it basically useless. But, I have learned after having a few printers over the years I never use the bloatware by the printer company anymore. I use the print application on my Imac or Windows computer. Much faster to access and works better with less headaches. And, second, the operating panel which folds out HAS to be open when printing. This is good and bad at the same time. Annoying if you are in another room and want to print and forget to fold out the panel first (panel can be left forward position to print always or just pop it out when you want to print something. The good thing about the panel having to be open is if I leave the printer cover on the printer and someone wants to print from another room (and they haven't opened the control panel first) the printer won't print and jam up papers because the printer cover is on. Scanning so far works great on this All In One. Haven't tried faxing yet and basically....who needs to fax anymore anyway. I scan and email any document. I can tell you even though Epson has their own tank version of printers (Ecotank) I am done with Epson for awhile. Best thing about Epson was the speed of print....that was it as far as superiority. The Canon so far has been a great machine. By the way, using the computer to print rather than the bloatware supplied by either Canon or Epson is not only fast to use but a lot easier when setting the printer up. So, after only owning this printer for less than 2 weeks (but we have used it quite a bit as my wife and I are both working at home during the Coronavirus quarantine) I can say that I would highly recommend this AIO to anyone looking for a great, fast and do all printer that is efficient on ink as well. I used to HATE running out and having to run to Office Depot or ordering online for ink only to have to spend about $38 for a small color ink cartridge for the Epson. The whole kit of 3 colors with black was about $125...crazy expensive. This computer comes with 3 colored ink bottles (enough to fill each of the 3 colors once) and 3 slightly larger black bottles (one fills it up and 2 extra bottles are included). I read all the reviews on Consumer Reports online as I subscribe and a lot of them pointed to the lower priced models by Brother or HP. The problem with the Brother printer they recommend (while easy on using the ink) was that the reviews stated that color printed papers came out very dull and light on color. Thus the \"efficiency\" of using ink on a Brother. Not like that with this Canon at all. Colors are superb on regular bright white paper. You definitely get what you pay for here. A top of the line refillable tank AIO printer that does everything very well....including saving money on ink (and the convenience of storing extra bottles to refill when needed). Spend a little more now on a great Canon G7020 but save in the long run. Hope this helps anyone who is on the fence about which printer to buy. I know even with having the Consumer Reports information online to view I spent a few hours doing research on the all around best printer. Oh, and also the print heads (2...one for colors and one for B&W) pop in easy when setting up and that means replacing if ever needed should be easy. Hopefully I won't have to for a very long time though. Just buy this printer.....I can't imagine you'll regret it. I also purchased a NON Canon product that I would recommend as well. The semi-clear printer cover by Comp Bind is great. Made for this printer it keeps dust and anything else out of the printer when not in use. I truly believe using a cover extends the life of your printer too.",
                "reviewVotes": "346 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josiah McGuckin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYZBQJNVJSS3XJZTMVTPULPFA2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ILVDUR06WDRY?ASIN=B081TZ38X2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars A very efficient printer for large workloads",
                "reviewText": "My wife and I recently began homeschooling our kids. We've been leaning on our local library's low-fee printing service for any of our printing needs, but with a majority of our kids' curriculum being based on printable materials, we quickly realized that we were going to need to invest in our own printer. I've had inkjet printers from other brands over the years, but they all seemed to dry up prematurely and not print well if I went the route of refilling the cartridges if I went the drill-and-fill route. I've had very good experience with Canon's other equipment for well over ten years, so I decided to give the G7020 a shot.Right out of the box, I was impressed with the overall build quality for a $200-250 printer. No, it's not a Corporate-grade built-like-a-tank machine like you're going to find in a lot of offices, but those printers cost orders of magnitude more, so I wasn't expecting this thing to feel like it was built out of metal. The ink tanks are huge, and I have no doubts we're going to get a lot of mileage out of them before having to refill, but it's super helpful that Canon included three total bottles of black ink, since a majority of what we'll be printing will involve black text. It remains to be seen whether the color will also last a while, but based on initial experience, I think this printer will go the distance. Setup was a bit tedious, but as long as you follow the instructions, you won't have any trouble. This is a wireless printer, not a wired one, so setting it up pretty much by default takes a little more time than just plugging a cable in and letting the computer detect the printer. Thankfully, once we got the printer online, we were easily able to get our other devices (two phones and a laptop) quickly connected, and all printed documents with no issues. Print quality is \"very good\" at the default settings, if maybe a little less vivid when compared to what we printed from our library's laser printer - but that's likely down to the difference in how a laser printer lays toner down on top of the paper instead of having ink absorbed into the paper with an inkjet, and the print quality can be adjusted to a higher quality from the default settings, so it's a non-issue. Literally the only \"con\" is that I did not realize there was a version of this printer available that omits the fax connection, since there is little to no chance we'll ever use the fax functionality and could have saved $20-25 by buying the G6020. All good. My in-laws went for that printer after we bought ours and have had no trouble with theirs (including being in their 60s and still being able to set up the printer themselves - which says a lot about these devices' ease of use).That said, we're only a few weeks in with this printer, but so far impressions are very good. I'll update this review if we end up having less than a five-star experience down the road, but at the moment, I'm very glad that this is the printer we picked. If you're in the market for an inkjet printer with refillable tanks and are willing to spend a little more on it vs. a chintzy $50-100 that's going to give you what you pay for it, you owe it to yourself to check out this printer (or the G6020 if you don't need fax functionality).",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}