{
    "remaining_requests": 46359,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/HP-OfficeJet-Printer-Thermal-Inkjet/dp/B08XW7LT9P",
    "body": {
        "name": "HP OfficeJet 8015e Wireless Color All-in-One Printer with 6 Months Free Ink with HP+(228F5A), White",
        "price": "$159.99",
        "originalPrice": "",
        "rawPrice": 159.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/HP-OfficeJet-Printer-Thermal-Inkjet/dp/B08XW7LT9P",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CB81F67S"
        ],
        "asinVariationValues": [
            {
                "asin": "B08XW7LT9P",
                "variationName": "Modelname",
                "variationValue": "New",
                "price": "$159.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BPWN33RF",
                "variationName": "Modelname",
                "variationValue": "Renewed Premium",
                "price": "$79.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Z2pdd9 IL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51cdRTP13NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51v64tH40iL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51obXo-vGfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412m7-mxoiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41a qn8dsYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OL-d85 uL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c6a88f1d-a6e4-498d-9e54-e7ca9f4a0917/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/deca4bf7-6e5f-490c-8a7a-b994f320fdf9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/758d8544-ecf8-45af-80c2-f2474b955147/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/97ac6086-d69a-457f-9cbf-66a2c78a6790/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0429337-840c-4a40-887b-81fce7493cfa/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/52bd57c4-4bed-4a5d-aae8-e2d262be6926/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the HP Store",
            "link": "https://www.amazon.com/stores/HP/page/5BA42671-3E42-4AEB-B9E4-272F10DD0121?ref_=ast_bln"
        },
        "brand": "HP",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 4454,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tuesday, February 13. Order within 12 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "6 MONTHS FREE INK when you activate HP plus – Includes 6 months free subscription for Instant Ink delivery service with HP plus activation. Ink ships automatically so you never run out. After 6 months, monthly fee applies unless cancelled, and you save up to 50%",
            "INCLUDES FREE HP plus SMART FEATURES – Activate HP plus free to get advanced features for mobile printing, security, automatic updates and more. HP plus only works with an HP account, internet connection and Original HP Ink for the life of the printer",
            "BEST FOR SMALL BUSINESSES AND HOME OFFICES – Print professional-quality color documents like forms, reports, brochures and presentations",
            "KEY FEATURES – Fast color print, copy, scan and fax, plus 2-sided printing, mobile and wireless printing, and an auto document feeder",
            "FAST PRINT SPEEDS – Print up to 18 pages per minute in black and 10 pages per minute in color",
            "DUAL BAND WI-FI – Self-healing Wi-FiTM automatically detects and resolves connection issues",
            "SECURITY ESSENTIALS – Protect sensitive data with basic encryption, password protection, Wi-Fi security and document protection. Get enhanced cloud-based security features with HP plus",
            "Dynamic security enabled printer"
        ],
        "description": "From America’s most trusted printer brand, the HP OfficeJet 8015e delivers increased productivity with fast speeds and custom mobile shortcuts. It includes the optional HP+ Smart Printing System that keeps itself up to date, secure, and ready to print from virtually anywhere at any time—at no additional cost.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=172635"
            },
            {
                "name": "Inkjet Printers",
                "link": "https://www.amazon.com/Inkjet-Printers-Office-Electronics/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172646"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13.29 x 18.11 x 9.17 inches"
            },
            {
                "name": "Item Weight",
                "value": "18.04 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B08XW7LT9P"
            },
            {
                "name": "Item model number",
                "value": "8015e"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 4,454 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#184 in Office Products (See Top 100 in Office Products) #3 in Inkjet Computer Printers"
            },
            {
                "name": "Date First Available",
                "value": "November 8, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "HP"
            },
            {
                "name": "Country of Origin",
                "value": "Thailand"
            },
            {
                "name": "Max Input Sheet Capacity",
                "value": "225"
            },
            {
                "name": "Sheet Size",
                "value": "3 x 5, 8.5 x 14"
            },
            {
                "name": "Wattage",
                "value": "21 watts"
            },
            {
                "name": "Brand",
                "value": "HP"
            },
            {
                "name": "Connectivity Technology",
                "value": "wireless"
            },
            {
                "name": "Printing Technology",
                "value": "Inkjet"
            },
            {
                "name": "Special Feature",
                "value": "Network-Ready, Energy Star"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Model Name",
                "value": "New"
            },
            {
                "name": "Printer Output",
                "value": "Color"
            },
            {
                "name": "Maximum Print Speed (Color)",
                "value": "10 ppm"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "18 ppm"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Compare HP OfficeJet Pro All-in-One Printers Currently viewing See Details Learn more Add to Cart Learn more Add to Cart Learn more See Details Customer Reviews — 4.2 out of 5 stars 11,012 4.1 out of 5 stars 6,028 4.1 out of 5 stars 1,437 Price — $169.99$169.99 $229.99$229.99 — Functions Print, scan, copy Print, scan, copy, fax Print, scan, copy, fax Print, scan, copy, fax Auto 2-sided scan & copy N/A N/A Yes Yes Print speed (up to) 18 ppm black, 10 ppm color 20 ppm black, 10 ppm color 22 ppm black, 18 ppm color 24 ppm black, 20 ppm color Connectivity Self-healing Wi-Fi Ethernet, Self-healing Wi-Fi Ethernet, Self-healing Wi-Fi Ethernet, Self-healing Wi-Fi Input/output capacity 225 sheets/60 sheets 225 sheets/60 sheets 250 sheets/60 sheets 500 sheets/100 sheets HP+ eligible Yes, activate at printer setup Yes, activate at printer setup Yes, activate at printer setup Yes, activate at printer setup Instant Ink included 6 months with HP+ 6 months with HP+ 6 months with HP+ 6 months with HP+ HP coverage 2 years with HP+ 2 years with HP+ 2 years with HP+ 2 years with HP+ HP Smart app Premium features with HP+ Premium features with HP+ Premium features with HP+ Premium features with HP+",
                "media_link": []
            },
            {
                "media_text": "What are the benefits of HP+? HP+ is a smart printing system that gives you premium cloud-connected solutions, an extra year of HP coverage, exclusive HP Smart app features, and 6 months optional subscription to the Instant Ink replenishment service. What are the requirements of this HP+ printer? The optional cloud-connected HP+ printing system requires an HP account, ongoing internet connection, and use of Original HP Ink Cartridges for the life of the printer. Does an HP+ printer require a subscription to the Instant Ink service or other ongoing costs? No, there are no additional costs associated with HP+. You can choose to enroll in an optional subscription for Instant Ink and receive 6 months subscription, but it is not required. What is the HP Smart app and why should I use it? HP Smart app is a top-rated app that enables you to set up your printer, print/scan from virtually any device anywhere, and access exclusive HP+ features. The Smart app is required to set up your HP+ printer from a mobile device or your computer. How does HP protect my privacy with a connected, account-based device? Privacy and data protection are extremely important to HP. HP collects certain printer and usage data to improve the printing experience. HP does not access content from any files shared through the cloud or printed on our printers.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c2c15cb-05a9-45f5-bd8e-54993d65eca0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df939805-a333-4f1a-b9bb-3cb4d97a784b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d94fd06-dd12-418b-9976-70736433dc07.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8b8f858-cc2f-4ebc-b1b3-ac2fe4805841.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/81f3ecac-6298-4740-b2cb-5cab2870dd4f.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d052a15-e9c7-43b7-8289-e808e432b845.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4abd3e8-bd89-4dd1-b048-8c15ef8b1ac4.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/519035a7-3f8b-442a-ad32-bba2076cfbd7.__CR0,0,200,225_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "20eagle16",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3JGHRDQSSM4OHXHWO74Q6PLJLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R190XR7SIX2Z4Y?ASIN=B08XW7LT9P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Wiggley Odd Printing When Printing Envelopes",
                "reviewText": "Overall, I would say this printer is a solid one for its price.The paper tray takes some getting used to. (Push the buttons on both sides of the top of the computer's paper tray, and pull that off first. Then pull the paper tray out. Install the paper. Push the paper tray back in. To put the top of the tray back on, push the buttons, and slide it back on.)HP's instructions on how to install ink is missing one piece of the puzzle: there is a \"button\" on the left-hand side of the lid that needs to be pushed to open the cover to get to the ink cartridges area. (DO NOT FORCE OPEN THE LID, OR YOU WILL BREAK IT.) I would suggest using the eraser end of a pencil or a pen that has not been pushed open for writing (hope that make sense) to push down on the button. Push down and open the lid. Otherwise, you are going to have to push really hard with your finger.But, the one thing that was very frustrating for me was printing envelopes within Word. For example, I use #10 envelopes (generally referred to as business envelopes). I have used the mailing/envelopes feature within Word for many many years, and so I know what I am doing. Nevertheless, the print on the envelopes kept coming out with hashy-wiggley odd printing. A postal carrier could never read it.After getting nowhere with HP Support, I decided to launch the HP Smart application that comes with the printer and resides on the computer. I did so and just had a look around. I noticed that the automatic hardware updates was not turned on. I turned it on, and began to test again.Long story short, the printing of envelopes from Word was successful. If you have a similar problem, you might want to try this. However, after you have turned on the automatic hardware updates, wait for a few minutes (let's say five minutes). Next, turn your printer off and then turn your computer off. Wait for 30 seconds. Turn your PRINTER on, then, after waiting a minute for the printer to be fully up and running, turn on your computer.This process helped me. If you experience the above, I hope this helps you as well.Again, I find the printer to be overall fine in printing letters, scanning documents, and printing photos. People have mentioned something about it making clicking noises when not in use. I have no idea what they are talking about. My HP OfficeJet 8015e printer is very quiet. And, though it does not have the paper capacity of my much older and much bigger printer, I find that the amount of paper that I can put into the printer at a time is sufficient...and, most important, as I have grown older, the printer is not heavy.I hope this review helps you.",
                "reviewVotes": "154 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCRHBZCYBSVJK7BAZYTULOILAQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18V7SNORNCBKY?ASIN=B08XW7LT9P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars So far so good, much better than others I tried",
                "reviewText": "I'm a regular household user (ok, also a teacher, but not the kind who prints All The Things) but had an old Officejet because of a crazy black Friday deal back when black Friday deals were crazy. It died of old age and I thought I'd downgrade because budget. But I just couldn't go back to regular printers. I returned two out of frustration before deciding to just pay a little more and go back to Officejet, it's only been a couple of weeks but so far I don't think I'll have any regrets.Pros:+ Seems to be on sale often so it's not terribly more expensive than lower end printers.+ The print quality is very good. I'm getting a drop of those light horizontal lines, but just a bit, and I bet they could be ironed out if I had time to sit around with settings or something. But overall I'm much happier than I was with the other printers I tried, text is sharper and colors are more true.+ Paper tray is closed. I hate that all the new expensive printers these days have the paper sticking up from the back open to the elements. I can only assume their paper feeders get gummed up with dust pretty fast, and the papers themselves can't be too happy. The paper tray on this printer is great.+ It's not noisy, relative to others.+ HP Smart app is great, easy to use, has a nice set of functions.+ Had no issues with setup.+ So far seems to be picking up jobs just fine from my phone and laptop.Cons:- I really don't like the boxy design. I'm putting function over form but I really don't like it. And the front panel seems a bit flimsy, it's not the most important piece but my old Officejet didn't have a front panel that opened and I don't really see the point of this one as you need to lift the top to get inside anyway.- would love to have a paper bypass tray. Like if you want to print one envelope, it would be great to have a place to just feed that in rather than remove your whole paper stack, change the size in the tray, print your envelope, and then put all the paper back.- like I said before, I'm getting a drop of banding (is that what it's called? Tiny horizontal gaps?) When printing chunks of color. I'm not sure if this is fixable and the print quality is still the best I've seen in this price range, but it's a flaw.- the touch screen could be a little more responsive- That's... Really it so far. I had a lot more complaints with every other printer I tried.Neutral:~ Let's talk about instant ink. Many reviews had issues with this. They seem to not understand how the program works. It's not that complicated. No, you don't get six months worth of ink in the box with the printer. They will send the ink to your home as needed over six months if you sign up and give them your address. I haven't gotten to the end of the trial yet so I don't know if they actually brick your printer if you try to use generic ink, but they were very explicit about you agreeing not to do that when signing up. I have no issue with this because I did some math and I believe the instant ink actually is a better deal than even generic ink is. My old printer accepted generics (after an initial period of reluctance) and it wasn't all that exciting. And with subscription ink I won't need to worry about waste when the printer decides to clean the printheads (my old one did that a lot)I do think it feels scammy for them to make you commit at the outset to never use other ink for the life of the printer (what?!) But at the same time I'm comfortable with what they're offering. I'll be annoyed if they raise the prices though, and I think if they're making you commit upon purchase then they in turn should commit to grandfathering you into the ink prices as of the time of the commitment.~ Several times I've sent a print job from my phone, got an error message on my phone, while the job printed just fine. So it's good that the job printed fine, but it's weird and annoying that my phone thinks it didn't, and now I have an error notification sitting there, and if I'm not near the printer I don't know whether or not it actually printed or if I need to retry. I'll have to figure out how to make that stop. Maybe I'll need to uninstall and reinstall the phone app or something. Overall a very minor hiccup compared to the issues I had with other printers.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2J2DXNH4TOS3B2O5MQW3OXQIAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R281YUT0K0TFQX?ASIN=B08XW7LT9P",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars Good variety for price",
                "reviewText": "This all in one printer is compact and easy to use. The only thing I don't like about it is that printing takes a while. It makes several clicking sounds like the ink cartridges are moving back and forth trying to decide to print or not. Otherwise it is simple to set up and use the features. I have not had to use the tech support so 4 stars given",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JanisJanis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNAFLL4RHWEIV6YVPAEJPGBP5DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LJWTVIM7QCYY?ASIN=B08XW7LT9P",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect Printer for High-Quality, Affordability, and Function!",
                "reviewText": "My husband and I work from home and needed an inexpensive printer that had multiple functions and printed high quality. We chose the HP Office Jet 8015e Wireless, Color, All in One Printer with 6 months free ink with HP+(228F5A), White, white and gray. extra ink arrived in days of our purchase.This all-in-one printer will print, copy, and scan, and will do 2-sided printing. You can use your phone to run all its functions. It has built-in security to enhance protection from viruses and malware. It also detects and resolves connectivity problems, which is a must for me. This printer keeps itself up to date and fixes any issues automatically.We needed it to fit in a small space and it fit perfectly on a small table.The set up was very easy, and we were able to get everything connected to the app. From the box to operational was a matter of 10/15 minutes. We are very happy with this printer and the value was very good.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71FoZ1uZxaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "KellyKelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 19, 2023",
                "reviewTitle": "Another solid HP printer!",
                "reviewText": "Here's my long story as short as possible. I had a 4200-ish series HP Envy. Printed faithfully for 10 years, moderate use, mostly b&w documents. When I decided to replace my Envy, I wanted something that would print sharp, colorful images on heavier paper & card stock (I now do a lot of art, collage, scrapbooking & paper craft). I'm very happy with the quality of the images printed, the color is accurate, copies are produced quickly- printed from Google Drive & Drop Box on my iPhone, iPad, Chromebook- super sharp & bright! Just loooove it!! Set up was a breeze, less than 5 mins flat, didn't have any of the issues other reviewers complained of. I can Air Print, directly from Drop Box, Google Drive, Google Photos, iPhoto etc or I use the HP Plus app which is really handy. It allows you to search files & images, alter the image size, freestyle crop, add 20+ filters & generally make changes similar to most photography apps. You can keep track of the # of pages printed, check ink levels, order ink (but Instant Ink basically does that for you), track ink deliveries, use the remote printing option, the quiet print setting & various shortcuts. I've been an Instant Ink member for 10 years. For me, it's always been a super convenient service that is well priced. I was never harassed or bugged or pressured into signing up or upgrading to more expensive options as other reviewers have stated. I haven't had a single memorable issue in TEN years. That says alot right? When I set up the new printer, HP instantly applied the 6 free months of ink & extra 700 monthly pages. I'll be honest, I thought there would be small print somewhere saying 'you have to be a new customer' to receive this promotion but they were generous, so I further respect HP.I pay 5$ a month & get 200 pages plus rollovers and all the ink I can use. The only downside is that when the ink levels are low & the printer orders me new ink cartridges, they are shipped from Arizona. I'm in Alberta Canada. HP said shipping takes approx 15-20 business days. So you could potentially be without ink for a period of time. I casually called HP to bring this up, just to see what they said. They agreed with my point of view, immediately sent out a second set of cartridges so that I'll have a carry over set of ink between the next refill. Just in case :)I feel good about the quality for the price, good customer service, the HP OfficeJet printer itself is fantastic.. I probably looked at every HP printer listed & found this to be the best rated, best priced, best promotion/ free product offer, best extended warranty and has the best partner app. I was really hesitant to initially purchase due to the multitude of poor reviews. But the list of issues others mentioned? I didn't experience any of them. None. As I said, I can't think of any negative occurrence in 10 yrs. I waited until Prime Day 2023 to purchase & got a FANTASTIC deal. It's been an issue free purchase. 10/10!(All photos are of clip art I printed on this printer, on various weights of paper & cardstock. Zero issues :)",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81z5Ogvm3gL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WnnD77gfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71d9L74ot9L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81J5Yse9dqL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Sw+WDv9XL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710lgDEI9sL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Kgx08TGXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712tTdGmxTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711Z3v6n27L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UxbrNkV1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shirley Dudeck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 20, 2024",
                "reviewTitle": "It's a Keeper!",
                "reviewText": "It is easy to use and prints quickly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Corinne McGee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 15, 2023",
                "reviewTitle": "Good quality",
                "reviewText": "The sprinter was good quality colour nice I find they were a misleading on the free colour that came with it. There was a catch, so read the fine details. The ink is not really free. They asked for a credit card.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.E.T.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 18, 2024",
                "reviewTitle": "Fairly east to set-up and start printing",
                "reviewText": "I have always been a HP printer person, we have tried them all and HP has always been a step or two above the rest. Our last HP was over 12 years old before it decided to call it quits. We found this replacement to be very reasonably priced, and the starter inks have held their fair share so far. We have printed well over 50 pages, about 75% in black and white and the rest in colour and we do not need to replace any starter ink cartridge yet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 7, 2024",
                "reviewTitle": "Scan disconnects repeatedly",
                "reviewText": "I installed as per instructions. The printer is connected. I can print from it. Periodically it then tells me the SCAN is not working nor connected. So I reconnected it 3x now since I bought it. Today while scanning it told me there was an issue where it could not complete the scan - the lights flashed incessantly and could not be cancelled. Had to unplug. AGAIN the scan now tells me it is not set up. How can that be when a) it worked and b) the printer works. HP scan now tells me my internet is not connected to my computer (while talking to me on my computer) and it won't set up the scanner. 123.HP didn't work, HP Scan doctor is now hung. Beware.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}