{
    "remaining_requests": 46308,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Canon-Products-MB2120-Wireless-Printer/dp/B01IIOMNIG",
    "body": {
        "name": "Canon Office Products MAXIFY MB2120 Wireless Color Photo Printer with Scanner, Copier and Fax",
        "price": "$159.00",
        "originalPrice": "$179.99",
        "rawPrice": 159.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Canon-Products-MB2120-Wireless-Printer/dp/B01IIOMNIG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0777CVQ6S"
        ],
        "asinVariationValues": [
            {
                "asin": "B0776HD37R",
                "variationName": "Style",
                "variationValue": "Printer + Ink Bundle",
                "price": "$240.00",
                "variationImageURL": ""
            },
            {
                "asin": "B01IIOMNIG",
                "variationName": "Style",
                "variationValue": "Printer Only",
                "price": "$159.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/4122LeV0 LL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41oLWYgjURL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/311SqmflN8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31K7-4rGepL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31S3VlU5g8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31ZtWflupLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-67BqjxdL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91AbM3uamAL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1HWZmT-gYL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Canon Store",
            "link": "https://www.amazon.com/stores/Canon/page/5FDDA83E-27A1-472F-8444-4828B50C4243?ref_=ast_bln"
        },
        "brand": "Canon",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 871,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tuesday, February 13. Order within 1 hr 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Print and scan wirelessly from any Wi-Fi enabled computer, or mobile device from around the house.",
            "Print laser-sharp text that is highlighter and smudge resistant with the Dual Resistant High Density (DRHD) Inks",
            "The Canon PRINT app has great features so you can scan, copy and print right from your favorite mobile devices",
            "With a 20, 000 page Duty Cycle, the MAXIFY MB2120 is built to last for all your home business needs.",
            "All MAXIFY printers feature 100% US-based Service & Support",
            "Refer to the PDF attached below in Technical Specification for Specification Sheet and User Guide"
        ],
        "description": "No matter what type of business you have, success is ultimately defined by the work that is done behind the scenes. You can work fast and smart with the Canon MAXIFY MB2120 Wireless Home Office All-in-One Printer, helping you to get through your workload. Specifically designed to help meet the needs of home-based businesses of 1-4 users, it delivers crisp, colorful prints of your business documents quickly, cost-effectively, and reliably. The MAXIFY MB2120 printer boasts a quick first printout time of 6 seconds with print speeds up to 19. 0 ipm (B&W)/13. 0 ipm (Color). Built for big jobs, it has a large 250 sheet paper cassette and 20, 000 page duty cycle. The efficient MAXIFY ink tanks deliver a high page yield from one set of ink and the Dual Resistant High Density (DRHD) ink system produces laser sharp text that is smudge and highlighter resistant. The entire MAXIFY lineup features built-in Wi-Fi and is fully compatible with the Canon PRINT app. This makes it easy to share and print information directly from your tablet and smartphone via select popular Cloud services. You can also easily scan directly to your mobile device. Best of all, the MB2120 printer is backed by 100% U. S. -based customer service and support.",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Electronics",
                "link": "https://www.amazon.com/Office-Electronics/b/ref=dp_bc_aui_C_2?ie=UTF8&node=172574"
            },
            {
                "name": "Printers & Accessories",
                "link": "https://www.amazon.com/Printers-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9424016011"
            },
            {
                "name": "Printers",
                "link": "https://www.amazon.com/Printers-Office-Electronics/b/ref=dp_bc_aui_C_4?ie=UTF8&node=172635"
            },
            {
                "name": "Laser Printers",
                "link": "https://www.amazon.com/Laser-Printers-Office-Electronics/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172648"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "18.1 x 18.3 x 10.3 inches"
            },
            {
                "name": "Item Weight",
                "value": "23.2 Pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Canon USA Inc."
            },
            {
                "name": "ASIN",
                "value": "B01IIOMNIG"
            },
            {
                "name": "Country of Origin",
                "value": "Thailand"
            },
            {
                "name": "Item model number",
                "value": "MB2120"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 871 ratings"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40,991 in Office Products (See Top 100 in Office Products) #68 in Laser Computer Printers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 20, 2016"
            },
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 18.1 x 18.3 x 10.3 inches; 23.2 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ MB2120"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ July 20, 2016"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Canon USA Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B01IIOMNIG"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Thailand"
            },
            {
                "name": "Brand",
                "value": "Canon"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Printing Technology",
                "value": "Inkjet"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Model Name",
                "value": "MAXIFY"
            },
            {
                "name": "Printer Output",
                "value": "Color"
            },
            {
                "name": "Maximum Print Speed (Color)",
                "value": "1 ppm"
            },
            {
                "name": "Max Printspeed Monochrome",
                "value": "1 ppm"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Providing the Reliability Your Business Deserves No matter what type of business you have, success is ultimately defined by the work that is done behind the scenes. With the new Canon MAXIFY MB2120 you can work faster and smarter. All MAXIFY printers feature a streamlined setup and installation process, allowing you to get right to work. Connected is an understatement for the MB2120 – with built in Wi-Fi, you can print, copy and scan from all your favorite devices; whether that be a smartphone, tablet or even the cloud. Built with home business needs in mind the MB2120 can handle 1 to 4 users and print laser-sharp text that is highlighter and smudge resistant with the Dual-Resistant High Density (DRHD) Ink System. Best of all, to help serve your business better, all MAXIFY printers feature 100% US-based Service and Support, with a dedicated MAXIFY phone number, email and extended service hours.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/8123fb90-56cb-4a98-b42c-6e2a917ef26a._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Core Features Every Small Business is Unique Duty Cycle(2): With a 20,000 page peak Monthly Duty Cycle, MAXIFY Home Business are ready to handle any workload. DRHD Ink System: Dual-Resistant High Density (DRHD) Ink produces laser sharp text and professional colors that are highlighter and smudge resistant. Setting Restrictions: Safeguard your printer with Setting Restrictions that allows you set a password on your network and device settings. Records of Use: Keep track of what is printed to help reduce waste and keep costs down. U.S. Service and Support: To help serve your business better, all MAXIFY printers feature 100% US-based Service and Support, with a dedicated MAXIFY phone number, email and extended service hours. Great Looking Work Speaks Volumes Auto Duplex Printing: Allow your business to stay cost-efficient with Auto Duplex Printing. Auto Power On: The Auto Power On feature conveniently powers on when any print job is detected. Power Schedule: With the Power Schedule feature, MAXIFY printers will automatically switch on and off at pre-set times, conserving energy and saving money. Energy Star: All Canon MAXIFY printers are Energy Star Certified. The Freedom to Work Multiple Devices is a Game Changer Wireless(7): Connect to all your favorite devices with built in Wi-Fi. AirPrint(4): With AirPrint, simply print right from your iPhone, iPad and Mac. Google Cloud Print(5): Print from your favorite devices to your MAXIFY printer with Google Cloud Print. Canon Print App(3): The Canon Print app has great features so you can scan, copy and print right from your favorite mobile devices. Communication Makes Things Easier MIB: Efficiently manage all your MAXIFY printers with built in standard Management Information Base (MIB) support, also easily monitor ink and paper levels and printer notifications remotely. Hi-Speed USB: Easily Print from and Scan to USB flash drives, with the convenient front USB port. Access Point Mode: You can wirelessly connect and print directly to your MAXIFY printer, even without a wireless router. Send to Folder: When keeping a paper copy is not necessary, you can choose to scan your digital files to network folders.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/b1d85564-8f05-4d73-804d-884724295ed9._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/5d7ad759-c658-43e8-8d81-7925f76177b5._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/b97adb85-15c5-49c1-b21c-efd101a48d14._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/2c3528f3-9c4e-4ee9-a9a6-3eadc6bedee3._SL220__.jpg"
                ]
            },
            {
                "media_text": "Additional Features Quick First Print(1): Monitor your printers information with Quick Toolbox, easily view networked printers, destination folder settings and more. Low Cost Per Print: Designed for efficiency, MAXIFY printers offer a Low Cost per Print and a High Page Yield when using XL ink tanks. Fast Print Times: With a Canon MAXIFY printer, you can be ready in seconds thanks to fast first printout times and rapid multipage copying. Sheet Capacity: Reload paper less often with a paper cassette that holds 250 sheets of plain paper. Business Card Printing: All MAXIFY Printers support multiple paper types including Business Card paper, Label paper and even ID Cards. Cloud with Concur(9): Easily scan receipts to your Concur Account. Touch Screen: This MAXIFY features a full dot matrix LCD display. Custom Profiles: Quickly register your favorite copy, scan, or fax settings so it is easier to get the job done. Job Reservation: Make a Job Reservation and put a second task in queue even when a job is actively printing. Sent to Folder: When keeping a paper copy is not necessary, you can choose to scan your digital files to network folders. Quick Tool Box: Monitor your printers information with Quick Toolbox, easily view networked printers, destination folder settings and more! Poster Artist Lite(23): PosterArtist Lite software is poster creation made simple. It includes royalty free templates, backgrounds and images that are easy to customize and print.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/8fde5023-81ab-4a80-8c00-cc0b2ffbb575._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/b5ad6dac-2338-476f-9360-9dde465c8f9a._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/79923f4b-390c-4be6-9c9d-85325eda28ee._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/59cafaae-fcf4-41b7-9fa6-003aa5c09201._SL220__.jpg"
                ]
            },
            {
                "media_text": "MB5420 MB5120 MB2720 MB2120 iB4120 Print Speed 24.0 ipm Black/15.5 ipm Color 24.0 ipm Black/15.5 ipm Color 24.0 ipm Black/15.5 ipm Color 19.0 ipm Black/13.0 ipm Color 24.0 ipm Black/15.5 ipm Color Single Pass Duplex Scanning ✓ ✓ Quick First Print 6 Seconds 6 Seconds 6 Seconds 6 Seconds 6 Seconds Duty Cycle 30,000 30,000 20,000 20,000 30,000 Sheet Capacity 500 250 500 250 500 Auto Duplex Printing ✓ ✓ ✓ ✓ ✓ LCD Screen 3.5\" Touch LCD 3.5\" Touch LCD 3.0\" Touch LCD 2.5” LCD Wifi/AirPrint ✓ ✓ ✓ ✓ ✓ Mobile Device Printing ✓ ✓ ✓ ✓ ✓ Ethernet Connectivity ✓ ✓ ✓ ✓",
                "media_link": []
            },
            {
                "media_text": "Disclaimers 1. Document print speeds are the averages of ESAT in Office Category Test for the default simplex mode, ISO/IEC 24734. Document print speeds are the averages of FPOT in Office Category Test for the default simplex mode, ISO/IEC17629:2014. Print speed may vary. During successive printing, the printer may slow down the operation to prevent the internal temperature from rising. depending on system configuration, interface, software, document complexity, print mode, page coverage, type of paper used etc. Copy speeds are the average of sFCOT and sESAT, ISO/IEC 29183. Copy speed may vary depending on document complexity, copy mode, page coverage, type of paper used etc. and does not take into account warming up time. When scanning or copying a certain volume of documents (approx. 150 sheets in default settings) continuously from the ADF,the printer may switch to 'waiting mode' in which paper feeding stops for several tens of seconds after each scan to prohibit overheating the ADF. See the websitefor additional details. 2. Duty Cycle is defined as the maximum number of printed pages for a single peak month. 3. Requires an Internet connection and the Canon PRINT Inkjet/SELPHY app, available for free on the App Store and at Google Play. Compatible with iPad, iPhone 3GS or later, and iPod touch 3rd generation or later devices running iOS 7.0 or later, and Android mobile devices running Android 2.3.3 or later. Your device must be connected to the same working network with wireless 802.11 b/g/n capability as your printer. For users of compatible Apple mobile devices, document printing requires Apple AirPrint, which requires an AirPrint-enabled printer connected to the same network as your iOS device. A printer connected to the USB port of your Mac, PC, AirPort Base station, or Time Capsule is not supported. 4. AirPrint functionality requires an iPad, iPhone 3GS or later, or iPod touch 3rd generation or later device running iOS 4.2 or later, and an AirPrint-enabled printer connected to the same network as your iOS device. A printer connected to the USB port of your Mac, PC, AirPort Base station, or Time Capsule is not supported. 5. Requires an Internet connection and Google account. Subject to Google Terms of Service. Certain exceptions may apply. 6. Requires Android mobile device with Android 4.4 operating system or later with the Mopria Print Service pre-loaded with that device and the compatible PIXMA/MAXIFY printer on the same wireless network. The Mopria experience is also available on Android 4.4 mobile devices with a download of the Mopria Print Service from Google Play. 7. Wireless printing requires a working network with wireless 802.11b/g or n capability. Wireless performance may vary based on terrain and distance between the printer and wireless network clients. 8. Resolution may vary based on printer driver setting. Color ink droplets can be placed with a horizontal pitch of 1/600 inch at minimum. 9. Scan to Concur requires a valid Concur account. Scanned files have a 10MB volume limit, with a 100 page maximum. Multiscan not available, receipts uploaded to Concur Cloud. 10. Optical resolution is a measure of maximum hardware sampling resolution, based on ISO 14473 standard. 11. The Public Switched Telephone Network currently supports fax modem speeds of 28.8 Kbps or lower, depending on telephone line conditions. Sending and receiving fax machines need to conform to ITU-T v.34 guidelines. 12. Black and white document fax transmission speed is based on default setting using ITU-T No.1 chart. Color document fax transmission speed is based on default setting using Canon Color Fax Test Sheet. Actual transmission speed varies depending on document complexity, fax setting at receiving end, and line conditions etc. 13. Page count is based on ITU-T No.1 chart or Canon FAX Standard Chart No.1. The number of pages able to be kept in memory will vary based on remaining memory capacity and document complexity. 14. High Page Yield calculated when using Canon Genuine XL Ink Tanks. 15. Requires an Internet connection. 16. Acoustic Noise is measured based on ISO7779 standard. 17. Operation can only be guaranteed on a PC with factory-installed Windows 10, Windows 8.1, Windows 8, Windows 7, Windows Vista or XP. 18. Available from printer driver and fax driver only. XPS drive is not supported for Windows Server 2003 and 2003 R2. 19. Internet Connection required during software installation. 20. Some functions may not be available with these Operating Systems. Please refer to the manual or our website for full details. 21. Requires a Windows RT compatible device with Windows 10, Windows 8.1 or Windows 8 and the Canon Easy-PhotoPrint app for Windows RT available for free in the Windows Store. 22. PosterArtist Lite software v2.60.00 is compatible with 64/32 bit versions of Microsoft Windows 10, Windows 8.1, Windows 8, Windows 7 and Windows Vista, and only compatible with Canon PIXMA (released after July 2015), MAXIFY, imagePROGRAF and Océ printers. Minimum computer system requirements: Pentium4 2.4Ghz CPU or higher with 1GB RAM, 1024x768 pixel display and 5GB of system hard drive space. 23. Warranty programs are subject to certain conditions and restrictions. See the website for details. 24. Dimensions with letter (A4) paper installed.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/8123fb90-56cb-4a98-b42c-6e2a917ef26a._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/b1d85564-8f05-4d73-804d-884724295ed9._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/5d7ad759-c658-43e8-8d81-7925f76177b5._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b97adb85-15c5-49c1-b21c-efd101a48d14._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/2c3528f3-9c4e-4ee9-a9a6-3eadc6bedee3._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/8fde5023-81ab-4a80-8c00-cc0b2ffbb575._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/b5ad6dac-2338-476f-9360-9dde465c8f9a._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/79923f4b-390c-4be6-9c9d-85325eda28ee._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/59cafaae-fcf4-41b7-9fa6-003aa5c09201._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/86f98f00-b1f9-4a76-8b17-15af27e8557b._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/00b50fd4-c43d-4040-88c6-6df71a095c22._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/0dacc88f-9e75-4d6f-8dde-a35a0d366489._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/51b2ae88-a80c-4cc9-9bc9-e1035f9a3f56._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/2d6df82c-494c-45f9-9863-9f071b929bb6._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOVHYXX7MBW6HPFY5POXUL3W6AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TGRQ4VLNRRKC?ASIN=B01IIOMNIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 1, 2022",
                "reviewTitle": "5.0 out of 5 stars This printer seems to be working just fine",
                "reviewText": "My last printer had a \"I just died\" message come up and I had to scramble to get a new printer for my business. Local stores only had expensive printers with even more expensive inks and had a complete shortage on cheaper printers. I managed to get this one from Amazon in a day or two and it has fax, scan features along with a document hamper to do large copy jobs easily. It works fine in the last month or so, seems to get decent ink mileage so I am a happy camper. The big bonus is that it can use generic inks...which cost a fraction of the name brand inks. Such a racket on ink prices...generic ink works just fine and I can actually afford to use the printer.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JimBob443",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7A64N5K6Y3ED5A57COCTQ265UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBW6FCYSHWCG4?ASIN=B01IIOMNIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2021",
                "reviewTitle": "5.0 out of 5 stars Printer works great after dodgy set up",
                "reviewText": "Printer works great after set up, but part of that set up was really dodgy. Contacted Canon online for some help getting my Mac to talk to the printer. Got connected during that online chat to a third-party consultant, who asked permission and then took control of my computer for less than a minute in an apoarent attempt to solve the connection/driver problem, 3rd Party failed to solve the problem and handed the mess back to me. Read Canon docs again, trusted my Mac and, after a bit,completed the setup. Still nervous about that 3rd party from Canada having had control of my machine - my bad for giving that permission - but so far no repercussions. That’s my sad story with happy, I think, ending.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gary Berg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXRREJJEJQCSB6SPBCKHYGAUORQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VQMNOYUO9ST5?ASIN=B01IIOMNIG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "4.0 out of 5 stars A good printer",
                "reviewText": "Well it did take a little while and several tries to set the printer up, I am very satisfied with the end result. I've used the scan function several times and have printed about 20 pages already. Overall i'm very happy with the printer",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "REE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDVVR4D6P3MR3BQFX4GPHRMNWRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NRR790GRRYAC?ASIN=B01IIOMNIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Good printer",
                "reviewText": "Everything went smooth during setup ... was printing within 30 mins of delivery. Very pleased.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shawn baily",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU2M3E63RN7NGRAVOWZQGAPORLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22WD5GWN0PGCC?ASIN=B01IIOMNIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2022",
                "reviewTitle": "5.0 out of 5 stars 2nd unit works as described",
                "reviewText": "1st unit defective. Replaced by Canon under warranty. 2nd unit works well.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dean Toner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWZBI3EP5M6QIHG6WMXVZ6SMFBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R495MF0RJIVAY?ASIN=B01IIOMNIG",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "1.0 out of 5 stars Absolutely the worst printer I've ever owned!!",
                "reviewText": "Way to go canon, you just lost a customer! I've been in IT for 20+ years and I get a lot of fun with playing with hardware. But with this one there's a lot to complain about so I'll just stick to the facts. It's rather large size compared to the market. It has a lot of difficulty picking paper out of the tray. Printer constantly shows as being offline. I have to play with the print queue in windows to get it to pick up the print job. When it does get the print job it'll sit there and make machine noises for 5 minutes before it even starts to print. I've gone through two full sets of ink cartridges in a year yet I've only printed maybe 20 pages total. Oh and the print quality just SUCKS!!! Purchasing the printer was a BIG mistake.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mitch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEB7H4SN5Z2OLC6HC7MSIEWZJM6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROCNJLX8KQ895?ASIN=B01IIOMNIG",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "3.0 out of 5 stars Like driving a 1995 Honda Accord",
                "reviewText": "I would buy this printer again but mostly out of a strong dislike for most other printers now requiring you have an ink subscription. This thing works ok but only buy if you are a patient person. I recently tried to print one page from a PowerPoint and this thing had to process and think about it for about 2 minutes before it actually printed. Imagine if you wanted to buy a car and a 1995 Honda Accord was an option. She's cheap and she'll still get you from A to B reliably but not with style and on cold stays she might run a little rough.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kuadillia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4THJZD2GMA7RMPVU2SEQJNVJZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU9CYDJ5KC9JG?ASIN=B01IIOMNIG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2021",
                "reviewTitle": "5.0 out of 5 stars can't beat this price!!!",
                "reviewText": "I love this machine. great printer, easy to set up to WIFI, and prints very well, had a problem with the first one, it threw a code, and needed a tech to come and check it out, I contacted Amazon, they sent ups with a label to pick it up and return it to Amazon the very next day, and a new one was delivered the day after ups picked it up. I loved the printer, it printed well until it threw this code, and wouldn't print. thanks, amazon, for standing behind your products and your seller's merchandise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Irue",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 11, 2024",
                "reviewTitle": "Muy buen producto",
                "reviewText": "Cumple expectativas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Glenn T Quiban",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 29, 2022",
                "reviewTitle": "Currently not working defective",
                "reviewText": "Did not work anymore unable to use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$158.66",
                "sellerName": "Shoplet",
                "sellerRating": "4"
            },
            {
                "price": "$159.00",
                "sellerName": "Focus Camera LLC",
                "sellerRating": "4.5"
            }
        ]
    }
}