{
    "remaining_requests": 24419,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dr-Collins-Perio-Toothbrush-Value/dp/B015R55H00",
    "body": {
        "name": "Dr. Collins Perio Toothbrush Value Pack, 2 Count",
        "price": "$5.22$5.22 ($2.61$2.61 / Count) $4.67$4.67 ($2.34$2.34 / Count)",
        "originalPrice": "$6.29",
        "rawPrice": 5.22,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dr-Collins-Perio-Toothbrush-Value/dp/B015R55H00",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09KC5ZK74"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Assorted",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51wadJLgYuL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51BN6mFR4kL._SS36_.jpg"
            },
            {
                "asin": "B015R55H00",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41soU0PPQ2L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Save 15%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41soU0PPQ2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51WUdTaCPuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EaPpUrNCL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Dr. Collins Store",
            "link": "https://www.amazon.com/stores/Dr.+Collins/page/C734EB38-E888-4A0F-B09C-570582CFE7AB?ref_=ast_bln"
        },
        "brand": "Dr. Collins",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 4953,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 6 hrs 46 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 6 hrs 46 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Ultra-soft and super slim tapered polyester toothbrush bristles save tooth enamel from abrasion",
            "Polyester bristles are less porous than nylon minimizing bacterial growth",
            "Unique tapered filaments penetrate deep between the teeth and around the gums",
            "Gently massages gums without pain or bleeding",
            "Great for those with sensitive teeth, gum recession, braces and after gum therapy"
        ],
        "description": "The Dr. Collins Perio Toothbrush is unlike any other toothbrush on the market. With its innovative, patented tapering technique, the Perio Toothbrush features super slim polyester bristles that penetrate further between the teeth to remove plaque and debris. The Perio Toothbrush bristles are also ultra soft, reducing the likelihood of abrasion and recession while simultaneously allowing gentle gum stimulation. The polyester bristles of the Perio Toothbrush are less porous, creating a more hygienic brushing experience. The bristle also lasts approximately 50% longer than a standard nylon toothbrush. The Perio Toothbrush is great for all ages, including those undergoing orthodontic treatment, suffering from sensitivity or gum recession.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10079992011"
            },
            {
                "name": "Toothbrushes & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18065341011"
            },
            {
                "name": "Manual Toothbrushes",
                "link": "https://www.amazon.com/Manual-Toothbrushes/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3778211"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 9.25 x 2.24 x 0.91 inches; 1.45 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 1"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 896660002801"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Dr.Collins, Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B015R55H00"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Korea, Republic of"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,029 in Health & Household (See Top 100 in Health & Household) #45 in Manual Toothbrushes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 4,953 ratings"
            },
            {
                "name": "Brand",
                "value": "Dr. Collins"
            },
            {
                "name": "Age Range (Description)",
                "value": "All ages"
            },
            {
                "name": "Power Source",
                "value": "Manual Toothbrush"
            },
            {
                "name": "Item Firmness Description",
                "value": "Ultra Soft"
            },
            {
                "name": "Color",
                "value": "White"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linelle g.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7UD44QEP4GLFRIBYVQGSPCAO5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FQVWPP9AM2DK?ASIN=B015R55H00",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Great brush",
                "reviewText": "I just started using this toothbrush for the first time and I am amazed at how different my teeth and gums feel. They feel truly clean. I like how soft the bristles are and how well they work. I will probably never go back to my old brand.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Twain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRBXML5CSAQZSC76EJRUTQS5BFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYZ5TYA5O3XY?ASIN=B015R55H00",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2019",
                "reviewTitle": "5.0 out of 5 stars Stands up to its claims and surpasses expectations",
                "reviewText": "I was skeptical. I didn't see how this thing could really be as different or better than other, more complicated brushes with fancy multicolor bristles of all shapes and sizes. Surely those fancy ones were designed in some kind of supercomputer with wind-tunnel, high-altitude, flame-retardant testing to be the pinnacle of teeth brushing technology.So I was skeptical.The first thing I did was rub the bristles on the back of my hand. They were indeed very soft, as advertised. The bristles bent apart without much effort. I took my laser-guided toothbrush, and rubbed that on the back of my hand. There was really no comparison to be made. The ultra-modern bits of the superbrush just aren't meant to give at most any pressure. It behaved like a dense block of bristles rather than a brush; something that I hadn't really ever paid attention to before. It was also not at all soft.I examined the new brush up close. The bristles are straight, white, and arranged in a plain, ordinary pattern. No sign of any technology designed on the space station here. The tips of the bristles were very thin and pointy. From the side, the surface has a kind of blurry appearance from the tiny bristle tips.The head was a decent length, but a tiny bit more narrow than I was used to.The handle is slightly banana shaped, with a good textured bit for the thumb. Maybe more of a gentle curve, like a banana that had been straightened a little.The bristles took the toothpaste well. It kinda sank into the bristles a bit, impaled on their spearlike tips. I wet the head a little, took one last look at the device, shrugged, and brought the brush up to my mouth.I rubbed it against my front teeth first, lightly, as to mitigate injury if things got out of control. It was an odd sensation. There wasn't a centralized point of pressure. It felt more like I was rubbing my teeth with my finger rather than a brush. Intrigued, I began to apply a more regular pressure and speed as I started to follow my usual brushing path around my mouth. Still, there was not a feeling of direct pressure. The bristles were yielding to the tooth surface to a very large extent, preventing them from poking my gums when I got close to the tooth edge.This was all a pleasant surprise; I hadn't realized how irritating my regular brushes had been until the source of irritation was gone. Have my multicolored brushes designed by NASA truly failed me?The main reason I went looking for a new brushing lifestyle was due to a bit of dental surgery I'm going through at the moment. I'm having a broken tooth replaced, and for the moment, there is an empty space between two teeth that is fairly sensitive. Despite the promises of brushing as if in paradise, my fancy brushes were never able to brush in that area without causing a degree of pain. This was the real test. It all came down to this. Could I actually brush this area and remain pain-free in the process?The answer was a 95% yes. There were a couple times when the bristles rubbed the gums the wrong way, and it made me wince a little. But I was able to brush that section more effectively than ever before.As I rinsed the brush, I examined it once again. Still no sign of racing stripes or supercharged turbo anything. Not even a battery compartment or USB port.I had to admit, while thoughtfully looking at my FancyBrush, that \"simple\" had beaten out the complexities of colorful bristles pointing every which way, made of eight different alien polimers.So for now, this brush is my daily driver, but the old brush still hangs inside the uv-brush holder. Will I ever use it again? I don't think so, but I have a real problem letting go of the future.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "camanogram",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAUWY2H47RWNHJTVBMTOGHXTCQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16RDXDAWIJ22J?ASIN=B015R55H00",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars BEST toothbrush ever!",
                "reviewText": "The head is large enough to brush more than one tooth at a time. The bristles are sturdy, but soft so you can comfortably brush with a little pressure. Teeth feel very clean when finished. This will be my toothbrush forever.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHV3UDP7TXIE4WWSLD7ZY22QKIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1443FO6KQXS2U?ASIN=B015R55H00",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Toothbrush For Sensitive Gums",
                "reviewText": "This is an excellent toothbrush for sensitive gums. The bristles are soft but still do a good job getting all around your teeth. I like the way the handle feels in my hand. Overall, this is my favorite toothbrush. I brush my teeth 2 or 3 times a day and change my toothbrush once a month. The toothbrush would last longer but I choose to switch out that often.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOMJKGG2P4ZQOMQXAWY7YBESBPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XQQZT8U675HR?ASIN=B015R55H00",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2018",
                "reviewTitle": "4.0 out of 5 stars Prevent Gum Recession: Very Soft and Great Clean",
                "reviewText": "The only reason this is not a 5 star review because it is not \"Ultra\" Soft. Read the full review and do not write off this brush without trying it.This is softer than most any brush you will find in the pharmacy or grocer however; I have used a softer toothbrush before.I give it an 8.5 out of 10 for softness. I would like a softer toothbrush but that would (and does) detract from the ability for the brush to pick up plaque and actually clean.This brush cleans better than any other manual brush I have used by far. The angle and taper of the bristle is perfect for hard to brush spots and in between teeth and crevasses.The bristle are also very fine and thin yet supportive enough to actually clean and not just polish like some actual \"ultra\" soft brushes. They are just supportive and firm enough to stand up to long term use.My gums are not irritated at all and I can brush the all important space where the gum and enamel from the tooth meet. I can also lightly brush my gums and mouth without irritation or soreness.My gums do not bleed nor do they become inflamed.Again this is not an \"ultra\" soft brush it is \"very\" soft but this does not at all detract from its comfort and ability to successfully and completely clean my mouth and teeth.Highly recommended.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R Mac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO4KNSUZWIMSJVQRBAYFM735FWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DBQCH1W2QHR4?ASIN=B015R55H00",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2023",
                "reviewTitle": "5.0 out of 5 stars EXTRA SOFT, and long lasting",
                "reviewText": "EXTRA SOFT, and long lasting. I've been using these for probably 20 years or so now. They're perfect. I can;t imagine why anyone would use anything except an EXTRA SOFT toothbrush. I buy the 3-pack on autoship, and I change to a new one about every 6-to-8 weeks when I feel the bristles starting to stiffen up a little. Dr. Collins EXTRA SOFT toothbrushes are the best.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BuckBran",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5OTLWS3UQQWKVM2EOQYQPXGA2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CZ868O6FY9O0?ASIN=B015R55H00",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Best toothbrush",
                "reviewText": "I never realized that changing a toothbrush could make such a big difference. I knew that the cheap toothbrushes that you get free places were junk, but I've always gotten what I thought were \"quality\" toothbrushes... and maybe they were but these with were amazing. The size of the area that holds the bristles is perfect and the angle on the toothbrush is perfect, the bristles softness and such is perfect. I had to use a different toothbrush when went somewhere without mine and even though it was a \"quality\" toothbrush it felt terrible compared to this one. I also used my last one and was extremely busy so I just got a random toothbrush and didn't want to waste it so I kept using it, but then I got these again and the first time using them couldn't believe how much better this feels than the others I've used.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M/M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDM5VEITYBYTU3I7DX2GBBP2KYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17EUYV7TZFYSS?ASIN=B015R55H00",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars A definite bargain!",
                "reviewText": "I really like these toothbrushes a lot. They're extra soft and a very good value. We used to use extra soft toothbrushes that were made in Taiwan that over time have gotten very expensive. These are a very good replacement for those. These are a bargain at half the price!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "karla sanchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 10, 2023",
                "reviewTitle": "limpia excelente",
                "reviewText": "es un cepillo que no es duro pero tiene muchas cerdas y eso lo hace super efectivo para limpiar los dientes, dice que es para niño pero lo encargue para mi y me funciona",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alain C.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2022",
                "reviewTitle": "La meilleure brosse à dent.",
                "reviewText": "Je suis canadien et j'ai appris à connaitre les brosses à dent du Dr Collins (Perio) en allant aux États-Unis. Elles sont vraiment efficaces comparé à des dizaines d'autres que j'ai essayées dans ma vie. Depuis, je les importe via Amazon. Merci.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gudrun G. Fritz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 27, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Very good product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olga",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 6, 2023",
                "reviewTitle": "Superb tooth brush",
                "reviewText": "Superb tooth brush, advanced design, feels nice, I cannot use other brands",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vanessa ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 26, 2020",
                "reviewTitle": "Me gustaron mucho",
                "reviewText": "Muchas cepillos de cerdas finas son muy fragiles y las cerdas se terminan doblando. A pesar que este cepillo tiene las cerdas muy delgadas se siente bastante solido al lavar tus dientes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}