{
    "remaining_requests": 24457,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AquaSonic-Black-Ultra-Whitening-Toothbrush/dp/B072YVWBXH",
    "body": {
        "name": "Aquasonic Black Series Ultra Whitening Toothbrush – ADA Accepted Power Toothbrush - 8 Brush Heads & Travel Case – 40,000 VPM Electric Motor & Wireless Charging - 4 Modes w Smart Timer",
        "price": "$39.95",
        "originalPrice": "$59.95",
        "rawPrice": 39.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AquaSonic-Black-Ultra-Whitening-Toothbrush/dp/B072YVWBXH",
        "soldBy": {
            "sellerID": "AJDT2HML7HWGL",
            "name": "Pure Daily Care",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AJDT2HML7HWGL&asin=B072YVWBXH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Y7 Yp0zLL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Ob7Pku LL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DCuaaRuxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41au78zog0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41zw0jSPj L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51h9UnBc-JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511MrtQDGhL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5de347eb-861e-469f-9fa1-6cf4f658c248/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f151f419-9282-4a26-ad8a-90534aef6142/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1d56b44d-7254-4545-b490-b229edf23cce/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/14aee1a6-5312-4532-bd8d-301c67a7a22a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6195eeac-3625-476c-bfc8-01dac9c3bca9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e936c08-daf8-42dc-ac6a-054235aa948d/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Aquasonic Store",
            "link": "https://www.amazon.com/stores/AquaSonic/page/EB84A7C7-B275-452E-8DD3-67ACF746C8AD?ref_=ast_bln"
        },
        "brand": "AquaSonic",
        "merchantInfo": "Pure Daily Care",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 105576,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20. Order within 4 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "40,000 VPM Smart Toothbrush – Beauty, brains and power. The Black Series is a world class modern electric toothbrush packed with the most up to date technology. It features an ultra-powerful and industry leading motor producing 40,000 vibrations per minute, a lithium-ion battery, ultra-fast wireless charging, 4 mode operation, smart vibration timers, 8 DuPont engineered brush heads, and a custom travel case; all with a sleek ultra-slim, lightweight and IPX7 rated waterproof design.",
            "Accepted by the American Dental Association (ADA) Council on Scientific Affairs – We put our money where your mouth is. Investing in premium oral care technologies has earned the Black Series the prestigious ADA seal of approval. It has shown efficacy in removing plaque and helping to prevent and reduce gingivitis. Black Series goes beyond just cleaning teeth – it provides complete oral care with unique modes that include one for whitening and polishing teeth, and one for improving gum health.",
            "Modern Tech for a Healthy Smile - Black Series brings toothbrushes into modern times with its built-in enhanced features. A lithium-ion battery, ultra-fast wireless charging (forget outdated USB charging), 4 distinct brushing modes and a smart vibrating notification timer are some of the enhanced features built into the sleek and ergonomic waterproof black satin handle.",
            "8 DuPont Brush Heads & Travel Case Included – Included are 8 brush heads engineered by world famous DuPont; a world leader in quality & materials science. Each brush head lasts 3-4 months so 8 will last for about 2.5 years. Also included is a convenient custom hard shell travel case made of BPA-free plastic with space for two brush heads. Black Series can last 4 full weeks (2 min/2x a day) on a full charge so it's perfect for on the go travel with the included travel case.",
            "What's in the Box - 1 AquaSonic Black Series Smart Toothbrush, 1 wireless charging base, 8 DuPont brush heads, 1 travel case, warranty card, and user manual."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b?ie=UTF8&node=10079992011"
            },
            {
                "name": "Toothbrushes & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065341011"
            },
            {
                "name": "Powered Toothbrushes & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065346011"
            },
            {
                "name": "Powered Toothbrushes",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065347011"
            },
            {
                "name": "Ultrasonic",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065351011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8.5 x 3.27 x 2.83 inches; 10.55 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SCTB"
            },
            {
                "name": "Batteries ‏",
                "value": "‎ 1 C batteries required. (included)"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 709311881482"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Aquasonic"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B072YVWBXH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#521 in Health & Household (See Top 100 in Health & Household) #1 in Ultrasonic Toothbrushes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 105,576 ratings"
            },
            {
                "name": "Brand",
                "value": "Aquasonic"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof, Ergonomic, Lightweight, Travel Size, Brushing Timer"
            },
            {
                "name": "Power Source",
                "value": "Battery Powered"
            },
            {
                "name": "Item Firmness Description",
                "value": "Soft"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Comparison Chart BLACK SERIES Add to Cart VIBE SERIES Add to Cart BLACK SERIES PRO Add to Cart HDC PRO Add to Cart Customer Reviews 4.6 out of 5 stars 105,576 4.6 out of 5 stars 26,843 4.6 out of 5 stars 2,637 4.2 out of 5 stars 2,472 Price $39.95$39.95 $39.95$39.95 $69.95$69.95 $67.96$67.96 Color Options: 1 6 1 3 Included Brush Heads: 8 Standard 8 Standard 6 ProFlex 6 ProFlex UV Sanitation No No Yes No Water Flosser No No No Yes # of Modes 4 4 5 5",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3619729-abd6-4340-9c5c-8606ce19a3cc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77786b5d-e450-4783-b6a1-81ba6726de90.__CR0,600,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34f5945a-af6a-4771-b8fe-4b659b422927.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2c76596-2e59-4f60-9378-0dbdcaf5c16d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1199ae3-7520-477b-8250-fd08a58526e8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/670fa205-9ada-4ea7-a5e1-066997bc409b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d375ae37-4cb4-4a82-bcde-a01b12be37d3.__CR167,0,2667,3000_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9d3a020e-72e3-4bc6-bf41-e9d510a870ca.__CR167,0,2667,3000_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d168736a-32c4-47e5-8ae2-c3254b1881db.__CR167,0,2667,3000_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/af21df8a-13d9-49a8-901b-55831d04748e.__CR167,0,2667,3000_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2BQFZNQEY4VB4UZAKMIIKTGMVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K0N1QPESIL5A?ASIN=B072YVWBXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2022",
                "reviewTitle": "5.0 out of 5 stars 5 month update",
                "reviewText": "update june 13 2023 - 1 year laterstill worksuse on Gentke nidewhen i used by itself for two months, worked well enough for dentist to admire my teethi use baking soda (& have for over 10 years) for toothpastefloss & try to do 3x or more , use toothpick which i file down to fit between teeth - much cheaper and more effective than the exensive stimudent brand which were always too big and only sold as flavoredend result after two months of daily usage (combined w 1 month of usage along w/ oral b 1x or so a day)was dentist was impressedi also rinse w baking soda/water after each brushing usuallyanyways, the toothbrush by aqusonic still worksstill hodls chargeon gentle mode i can get about one to two months of usage on ONE chargenow i tend to charge after one month but the light i still the full color when i chargeit does take a full 24 hours to chargebattery is still far superior in quality than oral b which cannot last one week of 2x day usage! pathetic battery life by oral bnot sure if amazon sells aquasonic tooth brush heads but i still have about 1 year left of heads i thinkstill reccomend 1 year laterand the matte finish has not yet worn off/gotten all sticky which my oral b has started doingall matte /nonslip finishses wear off /become nasty sticky over time which is why i wish no one would use them and only use basic plasticbought june 2022 mow early decusage is about 1 to 2x a day as i have oral b 1000 costco itembattery at gentle speeds with 1 to 3 full 2 minute sessions at a time each day will last TWO (2) months!!!!!!take that you over priced oral b! which barely lastrs 7 days with 2x sessions each at 2 min.the aquasonic will clean wellstill find oral b simpler as i dont have to actually \"brush\" with OB as it does all the work for mebut AqS works at what i does and does better with rear molars esp the space between back two molars on each end of mouth (as in the lat two moalrs on each side of jaws)downside? again wish it had slipperly reg plastic body w/o the soft touch coating. those eventually over time will degrade n become nasty sticky icky mess but...maybe thiers will notdos. if it does then ill just use adhesive removerthe oral b had 50 percent faiure rate as i bought 2pack from costco after 1 year, one failed to chargeso time will tell if AaS is more durable and long lasting. i really hope so as it is is cuh a g8 value8 brush heads from ob? 60usd.from AqS? incld wih $40 toothbrush! that is 2 years of brush heads included!oh i guess this is a downside but also could be how this thing lasts so long on a charge - you n need to charge 24 hours to get full 100% chargebut at same weight and zie as ob, not sure what kinda battery it uses but clearly far far far far superior to oral bthanks AqS!Sorry for my typos! lolbottom line: buy this toothbrushAUg 31 2022 updateapprox usage 1-3 full cycles (2 min each cycle) dailystill havent had to charege the battery!!!!on weekends, sometimes i have used it 3x a day with 1 - 2 ful lcyclesmy oral b battery? horrible. lasts barealy a week without charging using 2x a day 1 cycle per usage. i keep it on charger most dayscomparison:AS:softer bristleslittle harder to get fully clean teet IMO as still havent gotten used to how to use it properlyamazing battery life - the review that said husband/wife use just one AS while switching brush tips, and it lasting for months, is not a lie. it is true i tell. true lol. i know cuz mine i have only done ONE 1x full 24 hour (which manual directs you to do - 24 hour for full charge). ive done that 1x back when i bought it.no weakening of power and its now aug 31th!same size as Oral B housing yet AqZSn battery is clearly much bigger and of much higher quality than Oral BPrice for Aq includes 8 brush heads!i dont know if Azmn sells AqSn brush heads but i wont have to do so for a long time. 8 w each lasting 3 months would be 2 years worth of brush heads! and the price included the toothbrush!so while i do prefer easier brushing with OB, the AS is clearly a far better value and far better battery qualityas one reviewer mentioned the AqSn brucsh head breaking, i am ultra gentle with my brushing to prevent that from occuring (i hope). tehoretically, same issue could occur with any of these electric toothbrushesCons:no power level indicator like OB has 3 leds for pwr. i wish AqS had this but as i said, im still on original charge 2 moths of usage !!! so the con is nitpicking lolstill havent really firgured out if i am brushing properly but i have same issue with a manual toothbrush lolbottom line:the AS is superior to a reg toothbrush (by how much i dont know). i use level 2 power (not the max) and it seems to work well even with my feather light brushing of teethwaterproof esseentially - iave rinsed entire housing repeatedly just like with my Oral B, neither has had issuesthe one future con i foresee:the brush head has a matte finish and all matte finshess become disgusting stickiy over time. i basiclaly will need to remove the matte finish at some point using heavy duty adhesive remover but that is oky.the oral b does not have a matte finish which is batter.Oral Bpoor battery lifeEXPENSIVE brush heads 55 for 9!expensive to replace when battery eventually dies at 50 usdfloss action - these are the specific heads i use and they work great cuz they cover whole tootheasier to use than AquaS. as i simply hold over each tooth and let OB do the workSTIFF bristiles thoughoverall OB cleans better IMOJune 26 2022only used 1x just initial impressions will update laterive used oralb 3d series from costco for 2 years using their floss action headpros of OB is effortless - all ii have to do is hold the brush feather lightly agasinst teeth vertically - not movement needed like standard toothbrushAquasonic Sonic Toothbrush has an accurate title which means it is a toothbrush with a sonic function.i have no idea if this sonic function 40k bpm actually does anything....i was hoping for a $30 oral-b replacement but instead it is a standard toothbrush with a sonic funciton meaning i stilll have to brush my teeth like a normal toothbrush.whine whine whin i konw ha ha habut i have i bone spurs in shoulders blades where upper movent causes pain hence my preference for oral b no effort tootbrushing over aquasonic.i will stil keep and use aquasonic as as a backup to my oral bwill update later once ive used long termbut again, best value for money for a toothbrush with sonic function...but again...does it actually remove plque better than standard ultra soft tootbrush???? i konw ora-b floss action head does work better but does aquasonic????time will tel.... will update later and sorry for typos",
                "reviewVotes": "350 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy Badillo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3B5PXRIGWOWRGPB7XIKWNEJNYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RBKD6LJ3EDRD?ASIN=B072YVWBXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars The best toothbrush ever!",
                "reviewText": "The Aquasonic Black Series Ultra Whitening Toothbrush has truly elevated my oral care routine. This ADA Accepted Power Toothbrush not only boasts a sleek design but also packs a powerful punch with its 40,000 VPM electric motor. The inclusion of 8 brush heads and a travel case ensures long-term usability and convenience on the go. The wireless charging feature is a game-changer, providing hassle-free charging without the need for cords. With 4 modes and a smart timer, this toothbrush caters to individual preferences and ensures thorough cleaning. The ultra-whitening capability adds an extra layer of confidence to my smile. Overall, the Aquasonic Black Series is a comprehensive dental care solution that combines advanced technology, versatility, and style.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Uncle CoCoUncle CoCo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR7TEE2MMQSZR6ROLZ6LCYCHJIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FHWG9IF26GNT?ASIN=B072YVWBXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Price. Comfort. Style. AMAZING!",
                "reviewText": "Look at those pearly whites!!! After using a Sonicare for many years the battery finally died and I was so reluctant to pay the price of the new ones. After hours of reviews and research I decided to take a chance on Aquasonic.Plain and simple, it works just as good as my Sonicare, it has all the same features, includes a compact sleek travel case and even extra brush heads!!! Price!!! You cannot beat the price!I’m so glad I decided to try this toothbrush out and I have already got so many others to try it too who love it.Thank you Aquasonic!",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61AyrNFyNFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBO7PGM45N4JESLEFW26U53UHPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2214M004L9V3T?ASIN=B072YVWBXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars My favorite electric toothbrush",
                "reviewText": "I love this toothbrush. I now have three different kinds; this one, a Phillips Sonicare, and a Braun with rotating head/s (depending on attachment). I like them all, but this toothbrush has become my go-to. It cleans really well, the different settings are a bonus feature (although I rarely use the whitening function as I like a more gentle brushing), and it doesn't have the tendency to \"bounce\" off your teeth when you switch positions nearly as much as others. Plus, it looks great, and the included replacement brush heads are a nice bonus.Great toothbrush at a good price.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily Richardson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDOFB6GBRVJXQXKK6BRRLNGPFGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFT563XGFEW84?ASIN=B072YVWBXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Easy to use",
                "reviewText": "This toothbrush is amazing! My mouth feels unbelievably clean and I'm pretty sure it is truly whitening my teeth. Great product. Love the timer on it especially and 4 different modes.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tunes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVKZXM27Z5JQ22NJSS4ALY6ALRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M1X54E4SAOUN?ASIN=B072YVWBXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Value!",
                "reviewText": "Great price for a great product. Works as expected, good travel case and plenty of replacement brushes. Love the 4 different brushing speeds/intensities",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antony",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVMFPWLGSQCAUUX7ZFJULATB7BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BI6MSPA5WT67?ASIN=B072YVWBXH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Squeaky clean 🪥",
                "reviewText": "This toothbrush works well. I find I'm taking less time to cover each quadrant of my teeth. It brushes well between teeth and along the gum line. This is the 4th brand of electric toothbrush I have used. This one is so far the best. I still have yet to try an Oral B.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Poppy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 26, 2023",
                "reviewTitle": "Great product and even better customer service!",
                "reviewText": "I got my fancy new toothbrush after owning a Philips sonic for many years. I had gone to a manual brush but started to notice some buildup and things weren't looking as good as they could. I came across this on Amazon.. the price was right, the reviews were good and it looked pretty cool. So I gave it a shot. I was not disappointed! (At this point anyway)Almost right away, I noticed that it was doing a much better job of cleaning than my manual brush. It was a little unsettling at first because as the brush vibrates, it can be a little unsettling at first and feel very strange. You do get used to this!Sadly, almost 1 month later the motor started to die on me. It should be noted that my teeth have changed several shades of white during that month. I contacted customer support on December 23rd 2023 with the expectation I wouldn't hear from them until at least boxing day or farther off. Within a couple of hours I got a response asking for details and invoice information. I was pleasantly surprised! I was shocked that Christmas Eve they contacted me again to verify some details. Everything was quick and smooth and not intrusive at all. I was even more surprised they contacted me on Christmas day to let me know that a refund had been issued and that I should purchase a new one and dispose of this one with the faulty motor. I felt so bad I actually apologize to the customer service rep for having to answer and field my issue on Christmas Day. LolIt should be noted that sometimes these motors and batteries.. you just get a lemon. As long as the company is willing to stand behind their product, I would not hesitate to order another one from these guys. Does the toothbrush work as good as my Philips which cost hundreds of dollars more? Absolutely! My teeth haven't looked this good in years. It is also kind of ironic that the main issue I had with my Philips is the motor finally died in it the same way.If you're one of those people that sees this toothbrush with no moving parts and thinks it's not as effective, Google how Sonic toothbrushes work.So in summary.. the product came quickly, packaging was excellent, presentation and quality seem to be right up there even despite the faulty motor. Customer service is outstanding. Despite my Philips brush being much more expensive, they worked equally as well. I may actually like this one better.Just a tip for first time users.. do not press hard. You don't need to. You want the tips of the bristles to basically dance on the surface of your teeth. If you press, the bristles will bend and not effectively clean. It's actually the tips of the bristles bouncing off your teeth that remove the plaque and do the cleaning. Move the brush very slowly and let the bristles do all the work for you. You should be able to go from one side to the other and back within the 30 seconds before it tells you to move on to the next part of your teeth. The brush should be slightly pointed down (or up) towards your gums. This is so the tips of the bristles get underneath your gum line and poke some of that junk out of there. However, changing the angle on a regular basis also helps hit spots that you might miss on a normal pass. After doing a normal (where the brush is completely horizontal) pass on my teeth, I will sometimes turn my toothbrush totally vertical so that the brush bristles hit my teeth a different way. It does make a difference.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 13, 2024",
                "reviewTitle": "Buena calidad",
                "reviewText": "Excelente aparato, deja nuestros dientes muy limpios.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 20, 2024",
                "reviewTitle": "Super Preis-Leistung, klare Empfehlung",
                "reviewText": "Eine tolle Zahnbürste und Alternative zu anderen, wesentlich teurerern Markenherstellern. Sie entfernt Beläge gründlich und die Ersatz Bürstenköpfe sind auch erschwinglich. Das Reiseetui ist stabil und zweckmäßig.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "macdoj",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 28, 2023",
                "reviewTitle": "Very effective toothbrush",
                "reviewText": "Unlike previous electric toothbrushes I've used from other famous makes, this brush vibrates at high frequency rather like the tools the dentists often use! Quiet in operation and gentle on the gums, I have found this device to be just what I was looking for! Battery life is excellent, only needing a recharge every few weeks. It doesn't have a warning light for 'over pressure' but the tone of the motor changes if it is put under undue pressure and that serves the same opurpose as a warning light!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ガレリオ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on April 1, 2023",
                "reviewTitle": "お得",
                "reviewText": "この値段でこの本数の変えブラシがだと、少々壊れても許せるかと思ってました。が、壊れることもなく使いやすいです。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}