{
    "remaining_requests": 24379,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bristles-Toothbrush-Biodegradable-natural-Eco-Friendly/dp/B083TZR58L",
    "body": {
        "name": "10 Pcs Soft Bristles Bamboo Toothbrush, Biodegradable Natural Bamboo Charcoal Toothbrushes, Eco Friendly Color Bristle Wood Tooth Brushes",
        "price": "$8.09$8.09 ($0.81$0.81 / Count) $7.64$7.64 ($0.76$0.76 / Count)",
        "originalPrice": "$12.99",
        "rawPrice": 8.09,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bristles-Toothbrush-Biodegradable-natural-Eco-Friendly/dp/B083TZR58L",
        "soldBy": {
            "sellerID": "A2IGH5DJGG0NF4",
            "name": "Virgin Forest",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2IGH5DJGG0NF4&asin=B083TZR58L&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BJ2BNHYN"
        ],
        "asinVariationValues": [
            {
                "asin": "B083TZR58L",
                "variationName": "Color",
                "variationValue": "10 Colors of Bristles",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51vHa729a+L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51d7v2p4Q7L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black & White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51LdInhVbDL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Multi-color",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41KEslBndzL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Two Colors of Bristles",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41V7qWbqbHL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "50",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51vHa729a L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41YLUqsvNoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cQt8UKsWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rBLBq3cwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zj06l3TKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RTJlsJJgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418O92fUaDL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Virgin Forest Store",
            "link": "https://www.amazon.com/stores/Bamboo+Toothbrushes/page/DB255DCA-89AF-4059-83E1-3D627E7C1664?ref_=ast_bln"
        },
        "brand": "Bamboo Toothbrushes",
        "merchantInfo": "Virgin Forest",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 15532,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 4 hrs 35 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 4 hrs 35 mins",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Compact by Design (Certified by Amazon) products remove excess air and water, which reduces the carbon footprint of shipping and packaging."
        },
        "features": [
            "♻ECO-Friendly If you are concerned about the environment and want to contribute more,then this bamboo toothbrush is just what you need.It is made with 100% recyclable natural material to keep your mouth fresh while reducing the negative impact on the environment.",
            "♻SOFT BRISTLES- Color bamboo toothbrush charcoal soft bristles without bisphenol A which make sure not to damage your teeth’s enamel and delicate gums,These biodegradable bamboo toothbrushes fighting microbes while perfectly cleansing your teeth.",
            "♻EXQUISITE PACKAGING Pack of 10 bamboo toothbrushes,two different colors of bamboo toothbrushes in a pack of cartons,and marked A-B,enable easily tell every toothbrush apart,very suitable for family members.ECO friendly and renewable kraft paper is used for packing box.",
            "♻BIODEGRADABLE HANDLE-This bamboo toothbrush handle is made of pure natural degradable moso bamboo, with ergonomic design and feels great. It is stronger, harder than wood, more durable and healthier than any plastic.",
            "♻SATISFIED SERVICE-100% Satisfaction guaranteed we guarantee you 100% satisfaction as you purchase this product.If for any reason you are not satisfied,you can return this product within 90 days of purchase as expect a 100% refund."
        ],
        "description": "Extra soft toothbrush adult from virgin forest When you open the package and smell the smell of bamboo, it is like walking into the world of bamboo, being in nature, and feeling the faint moso bamboo fragrance. It's a perfect super soft toothbrushes for adults Don't be worry if you received bamboo toothbrush with creased bristles. All you need to make them straight is just to put toothbrush`s head in warm water for a few seconds. Bamboo toothbrush set With our bulk toothbrushes you don`t need to waste your time to choose separate teeth brush for every member of your family. Our bamboo tooth brush kit has great variety of colors which won`t let you to mixed up your brushes. It's the best-selling toothbrush Fresh & Polished Premium Bamboo Eco-friendly, light-weight with a perfect-grip slim ergonomic design, the bamboo handle is very smooth and has no splinters. Our bamboo toothbrushes and travel cases are made out of beautifully crafted, to create the finest sustainable choice. Soft bristles help clean your teeth For that dentist clean sensation soft on the gums and firm on the teeth, our amazing strong bristles reach even the smallest crevices, leaving your mouth and teeth impeccable and fresh! New technology of bristle fixation In the production of virgin forest bamboo toothbrush, we use a new bristle fixing technology without any glue. Please use it with confidence. By ordering our toothbrushes you take care not only about your oral cavity but also about health of our planet. We recommend storing toothbrushes in a dry place. So, click “ADD TO CART” now before the stock runs out! Specifications Handle Length: 7.5 Inch Brush head length: 1.1 Inch Bristles length: 0.47 Inch",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=10079992011"
            },
            {
                "name": "Toothbrushes & Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=18065341011"
            },
            {
                "name": "Manual Toothbrushes",
                "link": "https://www.amazon.com/Manual-Toothbrushes/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3778211"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 7.5 x 0.39 x 0.67 inches; 0.32 Ounces"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ January 14, 2020"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ USQZF"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B083TZR58L"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,643 in Health & Household (See Top 100 in Health & Household) #42 in Manual Toothbrushes #372 in Climate Pledge Friendly: Beauty"
            },
            {
                "name": "#372 in Climate Pledge Friendly",
                "value": "Beauty"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 15,532 ratings"
            },
            {
                "name": "Brand",
                "value": "Virgin Forest"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic, Charcoal Infused Bristle, Compact, Travel Case"
            },
            {
                "name": "Power Source",
                "value": "Manual"
            },
            {
                "name": "Item Firmness Description",
                "value": "Soft"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bulletshot1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM4BJF64C4IVRFZJUKJ3LMTKY7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V2E4EQUOZUEI?ASIN=B083TZR58L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Product Great Price",
                "reviewText": "Was skeptical about the product but am totally satisfied and will buy them again. They are recyclable, good quality and soft brush. They feel different at first because they are light weight compared to a plastic tooth brush. They also fit in with my farmhouse decor. #100% happy with purchase",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sabrina Van Kirk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH2BUTC7WYBMAOLRK4Q5XKPQAOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26GQUSVXBUKM0?ASIN=B083TZR58L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome kids toothbrushes!",
                "reviewText": "These toothbrushes are great! Good quality, and my kids love the different colored bristles! Also love how soft ,but throughly cleansing these brushes are! I’d highly recommend for the family who want to go with a less plastic lifestyle, these work well, and are a much healthier alternative to plastic toothbrushes!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StinkerBell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ6LTTJVMIS57E6GNMAAIEKA6XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWVOHQ846J7EG?ASIN=B083TZR58L",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Adjustment period needed",
                "reviewText": "I usually just buy a multi package of toothbrushes that are on sale, cheapest, whatever. I like soft bristles-dentist recommended to me long ago, and well, overall they're really the same as far as I'm concerned. So these were on sale when I bought them, I think around 7.99. So price-wise they were right around what I'd normally pay for toothbrushes, just a tad higher.The bristles are soft. The downside for me, the strip of bristles is narrower in the width than a regular toothbrush. It's like they're missing a row or two of bristles on the sides. On the one hand, this makes it easier to brush on an angle along my gum line. But more difficult when cleaning my gums and tongue.The wooden handle is also a different feel if you're used to the plastic ones. Just ever slightly heavier, I don't know how to explain it, but it's a different feel. Not bad, just different. Initially I did kind of jab my teeth with the top wooden part, I think that was more related to the narrower bristles.Overall I'd put these around a 3 1/2-4 stars, with the lower stars simply for the narrow strip of bristles. They do work, and are ok. They're just different than what I'm used to and I can adapt to them. I'll continue to use them.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jk-nycjk-nyc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNZ5H2Z74VXXAH6KU4VEFBLFS7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH2FLNO2GF73R?ASIN=B083TZR58L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Good Brush, and Better for the Environment",
                "reviewText": "These bamboo brushes are pretty similar to the similar plastic-handled toothbrushes I have been using. (Two different brands in photo) And at about $1 a piece they cost 5 times less than the plastic ones.The bristles seem just as soft, the heads have almost as many clusters of bristles as the plastic ones, but there may be fewer bristles per cluster, so it's not as robust a brushing feeling. The bristles are not as close to the edge as one of the brands (which I prefer), and the bamboo ones lack the bristle cluster at the tip of the brush, so like another reviewer, the tip of the handle above the bristles tends to poke my gum or cheek. The bamboo handle is flat, not like the thicker and contoured plastic handles, so that may take a bit to get used to.However, the fact that I will not add any more \"forever\" plastic handles to the earth far outweighs these minor differences.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61AncHlyR1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Inky DoodlerInky Doodler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVF5NOUH3KW2Y5RBVLWZA4YOIAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27CWVNN410MS6?ASIN=B083TZR58L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2021",
                "reviewTitle": "5.0 out of 5 stars Best tooth brush I've ever used!",
                "reviewText": "Some people review certain things right away, this time I waited a while to give it a good chance. These arrived April 23rd 2021 and I used the purple one straight away every day until August 26th 2021. The blue one is brand new and shall be my next victim, just to show the comparison of being used vs new. Every use left my teeth feeling super clean even the last one and I use a good natural tooth powder. Anyway for those who say the bristles are too soft, I don't want to know what you use (a wire brush?). The bristles on these are perfectly soft, yet they have a durability that I have never found in any other toothbrush. (Not for those people who smash and brush so hard the tooth brush looks like it got ran over or chewed on by a rabid raccoon) If you like your gums to bleed then this probably isn't what you want. They are like a mattress that gives perfectly yet is firm underneath to endure use and yet be very comfortable. This toothbrush never turned black as you can see. I turned it bristles down across a cup to dry every time like you're supposed to with bamboo brushes. The edges are smooth so no splinters. The price for ten brushes makes me feel very happy too as I will not have to buy brushes again for a long time. Yes I do know you're supposed to change your brushes every three months or sooner (who doesn't?). Also did you know bamboo doesn't have the same issues with bacteria as it's plastic counter parts? Anyway I chose to use it for that long just to see if it would hold up that long and it did for a month longer than a plastic one. I was changing my plastic ones every two months, and that haunted me because of what it does to the environment. I have no use of the A and B stamped on them as I am the only one in my bathroom and wouldn't get it confused, but that is a nice feature for multiple brush households. I highly recommend these tooth brushes!! Great price, great bristle softness, so many colors!! And best of all you're not choking the land fills and oceans with plastic brushes.",
                "reviewVotes": "98 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81RmD4oHzcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81iGv-3T03L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81iYTT7-08L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "steph monk-george",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMXWXKRGSVI2R2IZ4D5UPYE7AUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QJ7RX3O19H26?ASIN=B083TZR58L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Cuter than regular toothbrushes and better for the environment!",
                "reviewText": "These were quite the value and my teen girls had fun looking into the individual cardboard boxes and picking their color. These toothbrushes hold up indefinitely and when I throw them out to get a new one, I feel a little bad because there’s nothing wrong with the original one. Let’s ditch the plastic, people- give these a try!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJTEITTOYL7IE35RCPSR3XDUGNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BIE9DL52TV2R?ASIN=B083TZR58L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars I like these toothbrushes",
                "reviewText": "Nice size and firmness as well. I’m pretty impressed with them. And best of all… they are vegan made",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4S3V5ANGFX6XYISSZFD5T6I6OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJI1DCPXP6CAG?ASIN=B083TZR58L",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2023",
                "reviewTitle": "3.0 out of 5 stars Earth friendly product?",
                "reviewText": "I bought this product bc it was advertised as being 100% biodegradable with soft \"BPA free bamboo charcoal bristles\". The actual packaging though clearly states that the bristles are nylon. So, which is it? Outside bristles are light tan in color. Inside bristles are charcoal color. Taken directly out of the box and used, I found the bristles to be more medium firm. After soaking the toothbrush in water for a minute or 2 the bristles seemed to soften somewhat. It's a nice toothbrush and the packaging is top rate but either Amazon's product discription or the package discription is inaccurate. If I knew this product was 100% biodegradable I'd have given it a 4 rating.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jhen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2024",
                "reviewTitle": "Great Product",
                "reviewText": "This toothbrush is great - really soft bristle and could really get in between your teeth - leaves your mouth feeling really fresh and clean 😄",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melanie ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "So far so good",
                "reviewText": "I like that the packaging is recycled. These toothbrushes make it easy to see whos is whos lolBristles are great, the handle has a nice feel in my hand. I will be buying again. Even tho they are rated med-hard, they feel more like a med-soft",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert W.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 17, 2023",
                "reviewTitle": "Great product",
                "reviewText": "Definitely worth the value and I will definitely be buying again they are the perfect firmness of bristle and are way better than using plastic",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SandroLeite",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 20, 2022",
                "reviewTitle": "Muito bom",
                "reviewText": "Ecológicamente correto. Ótimo produto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elaine davies",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 18, 2024",
                "reviewTitle": "Does what it says",
                "reviewText": "Nice to use and eco friendly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}