{
    "remaining_requests": 24159,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Philips-Sonicare-ProtectiveClean-Rechargeable-HX6810/dp/B078GVMVRH",
    "body": {
        "name": "Philips Sonicare ProtectiveClean 4100 Rechargeable Electric Power Toothbrush, Black, HX6810/50",
        "price": "$46.34",
        "originalPrice": "$69.99",
        "rawPrice": 46.34,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Philips-Sonicare-ProtectiveClean-Rechargeable-HX6810/dp/B078GVMVRH",
        "soldBy": {
            "sellerID": "A1M2AR6046TFJG",
            "name": "Amazing Dealzzz",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1M2AR6046TFJG&asin=B078GVMVRH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BZM5H383"
        ],
        "asinVariationValues": [
            {
                "asin": "B078GVMVRH",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$46.34",
                "variationImageURL": "https://m.media-amazon.com/images/I/41tfWh6EBnL._SS36_.jpg"
            },
            {
                "asin": "B078D75HMM",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$47.93",
                "variationImageURL": "https://m.media-amazon.com/images/I/41fR6xkwtnL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "20",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41tfWh6EBnL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41FYsDzO5NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41id7IDJr6L.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1WAHnvQOeS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91JgiVjgOwL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the PHILIPS Store",
            "link": "https://www.amazon.com/stores/Philips/page/2CC50240-3735-4291-842F-2E61630248F2?ref_=ast_bln"
        },
        "brand": "Philips",
        "merchantInfo": "Amazing Dealzzz",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 54934,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Removes up to 7x more plaque vs. a manual toothbrush",
            "Pressure sensor protects teeth and gums from excess brushing pressure",
            "Always know when to replace your brush head for an effective clean with BrushSync replacement reminder",
            "Quadpacer and Smart timer helps ensure dental professional recommended 2 minute brushing time and encourages brushing in each quadrant of the mouth",
            "Batter charge indicator light let's you know when to recharge; 2 week battery life (After first use, charge for at least 24hours.)"
        ],
        "description": "Feel the difference of a gentle clean with our pressure sensor while removing up to 7x more plaque than a manual toothbrush. Densely-packed, high-quality bristles remove up to 7x more plaque than a manual toothbrush. And the specially curved power Tip makes reaching the teeth at the back of your mouth a breeze. You can be sure of a safe brushing experience: Our sonic technology is suitable for use with braces, fillings, crowns, and veneers, and helps prevent cavities and improve Gum health. Our Quadpacer lets you know when you've spent just the right amount of time Cleaning Each part of your mouth, while our smarter tells you when you've brushed for the recommended two minutes.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b?ie=UTF8&node=3760901"
            },
            {
                "name": "Oral Care",
                "link": "https://www.amazon.com/Oral-Care-Products/b?ie=UTF8&node=10079992011"
            },
            {
                "name": "Toothbrushes & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065341011"
            },
            {
                "name": "Powered Toothbrushes & Accessories",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065346011"
            },
            {
                "name": "Powered Toothbrushes",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065347011"
            },
            {
                "name": "Sonic",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18065350011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.56 x 6.81 x 9.33 inches; 9.6 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ HX6810/50"
            },
            {
                "name": "Batteries ‏",
                "value": "‎ 1 AA batteries required. (included)"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 075020072283"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Philips Oral Healthcare"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B078GVMVRH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,467 in Health & Household (See Top 100 in Health & Household) #34 in Sonic Toothbrushes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 54,934 ratings"
            },
            {
                "name": "Brand",
                "value": "PHILIPS"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Special Feature",
                "value": "Brushing Timer, Pressure Sensor, Rechargeable"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Item Firmness Description",
                "value": "Hard"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Providential",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHQILYLFLHZ2OONHOQCIHHYL2QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A5BQ69MV73CZ?ASIN=B078GVMVRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2020",
                "reviewTitle": "5.0 out of 5 stars So far so good",
                "reviewText": "Just got this today and electric toothbrushes have really come a long way. This review will be mostly for people who are new to electric toothbrushes or looking to upgrade an old one. This review is for the 4100 series.Comparison:I moved from a manual, to a Quip electric. The quip doesn't actually vibrate hard enough to affect cleaning, but it does have a 2-minute timer and a really good quadrant minder which tells you when to switch to the next part of your mouth. Quip is kind of neat for encouraging you to brush more, but the quadrant minder is the only real plus.Pros:Deep cleaning. You actually need to read the instructions and change how you brush with an electric. The brush itself is making thousands of strokes per second, so your old scrubbing motion actually hurts the effect of this brush. In short: Use light pressure to make sure the brush deforms a little and pushes against your gum, and sweep back and forth more slowly to let the brush work. When you're done, you'll feel dentist-clean.Bust budget option. The 4100 is the first toothbrush in the Philips line that has all the \"regular\" body with all the important cleaning features (clip-on heads, quadrant minder, replacement reminder). This means it's the best bang for your buck. The next model up only includes a travel case and 3 different brush modes, which you don't really need. The one mode on this brush is the only one you need, and when you travel the brush head actually comes with a travel cap - take off the brush head, cap it, and put both safely in your bag. Done.Charge base. The new bases are omnidirectional and magnetic. It doesn't matter how you put the brush down, it charges correctly and stays put. It even buzzes and lights up to confirm a charge. Great.Gentle introductory mode. The manual says your first 14 brushings will be on a gentle mode to ease you into using the brush. This is great. Even on intro mode, the brush already outperforms any manual. It'll be great to finally ramp it up.All the features. If you press too hard on your teeth, it stop the brush from making all its pulses. The handle will vibrate differently to tell you to fix your pressure. There is a replacement light which both verifies your tip is on, and reminds you when it needs changing. There are also some options available via certain button presses, which you can read about in the manual. Overall this has all the features I'd want in an electric. I'm not even concerned with the higher-end models for my needs.Cons:Weak quadrant minder. It's really hard to tell when the quadrant minder hits because it's literally about one tenth of a second of a different vibration. This is a little too fast to interpret, as the brush also has a momentary buzz if you apply too much pressure. Which is which? The Quip actually does a stop-start cycle a few times more akin to your cell phone, which is way easier to recognize. Philips could improve this a lot, but at least it works.Overall:If you can afford a better brush, the 4100 is the best bang-for-buck in the Philips line. It's basically the exact same body as the most expensive in the line. All you sacrifice is that you only get one cleaning mode (you only need one), you don't get a travel case, and Philips makes a different head for this brush than it does for other models. Otherwise it's a perfect, dentist-recommended clean. I love it.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jacob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEAMYZ42YSV5Z6JJ5RLAMDAEZ2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FY6P5PZEG80Q?ASIN=B078GVMVRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars makes you feel very clean",
                "reviewText": "love this and my dentist does too! he can tell ive been using this toothbrush ! It does a great job",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hikingfoole_85",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMMEI6MZMF3GXQ54ERZQ6XSMMJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z4XW3DFEA1KD?ASIN=B078GVMVRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars 5 Years",
                "reviewText": "I purchased this in 2019, it just gave up the ghost. I had no problems with it til yesterday. The innerds seem to have come apart. I wi be buying a new one.FYI: I used both Phillips & Generic brush replacements with no problems.Good brush I recommend for $30-40 and five years, not bad.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edward Sandoval",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGJ4M7ADP6EWSYJS7AQWBD2TAFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OEBU3Z7K28NC?ASIN=B078GVMVRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Great toothbrush!",
                "reviewText": "Love this toothbrush! easy to use and love how much of a deep clean it does for me especially having braces. battery life is awesome only have to recharge it once a week or so. highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anastasia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD5RMVTQNQUUJ7IRZ5Q4AI3XHWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKA1X2RYSX7EF?ASIN=B078GVMVRH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Effective, affordable, and ergonomic!",
                "reviewText": "This toothbrush is effective, affordable, and ergonomic! I brush my teeth thoroughly with ease using this device.Necessary accessories are included, such as a charger and brush head. The toothbrush is intuitive to use, featuring only 1 button for on/off. This button can be easily found by touch because it is indented from the rest of the brush body. Minimal movement by the hand is required to achieve a great cleaning, because the vibrations of the brush effectively remove residue and build-up from the teeth and gums.The handle is large and fits well into the hand, especially compared to manual toothbrushes. Due to the style and function of this toothbrush, it is much easier for people with arthritis to use, because the hand does not need to grip the brush tightly. This toothbrush also includes several special features. When the button is pressed on, a timer will start for 2 minutes, encouraging the user to brush their teeth for the optimal amount of time, as recommended by dentists. After two minutes, the toothbrush will turn off. Additionally, during a brushing session, a temporary change in vibration occurs every 30 seconds, which helps the user to brush the four sections of their mouth for an equal amount of time. This toothbrush also has a sensor which signals through vibration when the user is pressing the brush too hard on their teeth. The brush heads are replaceable and are removed by gently pulling them off the brush base. A battery indicator light flashes when the toothbrush needs to be recharged.There are some drawbacks to this product. First, the name brand replacement brush heads are quite expensive, running for about $10 a piece. However, generic versions are available for purchase for about $1.50 per brush head, and they work just as effectively. Additionally, because the brush heads are removable, there is a small gap between the brush head and brush base. This gap tends to collect residue and probably harbors bacteria. This area of the brush must be regularly cleaned and may not be suitable for someone who is very susceptible to infection. Furthermore, the toothbrush charger must be plugged into an outlet, which some individuals may not have safe access to due to their outlets being near the floor.Some improvements that could be made to the product are that Philips could charge a more reasonable price for the replacement brush heads, and brush heads could be designed that do not leave a gap between the brush head and base. Finally, the toothbrush could indicate that it needs recharging from a sound and the indicator light flashing, so that individuals with impaired vision or with impaired hearing could both have fair warning when their toothbrush needs recharging.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brittney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNEHM6A7B7ZVD7HEYIRMSLSGVHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4RCBSXDXLA5W?ASIN=B078GVMVRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Great toothbrush for the price!!!",
                "reviewText": "This toothbrush is less expensive than many of the electric toothbrushes I've seen and it does a great job! Very long battery life and love the 2 minute timer!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Avina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUPHX7N57KF5V4KDOS4C7RJLYEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R2DQ99JMY1RE?ASIN=B078GVMVRH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great, but then it just stopped charging.",
                "reviewText": "Love it, but it just suddenly stopped working and charging.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marcia rosana da costa aguiar gomes conceição",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 15, 2022",
                "reviewTitle": "Estou muito satisfeita com esta escova.",
                "reviewText": "A escova é excelente. Você carrega a bateria e é duradoura. Muito fácil e simples de usar. Estou muito satisfeita com esta escova.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mamamouse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 30, 2021",
                "reviewTitle": "Great toothbrush!",
                "reviewText": "I bought these for my family on my dentist's recommendation. It took a bit of research to understand why there were all the different models-- there are so many different ones to choose from. Long story short, look carefully at the toothbrush handle when you are choosing. If you want just a turn on/turn off toothbrush that does everything you need, then the handle should have just one on/off switch, and it will be much more affordable, such as this model. This will time you for your 2 minute brushing and buzz every 30 seconds to let you know to switch to a different area, as all of the other Sonicare brushes do. This model is a simple, affordable brush that does the same cleaning job that more expensive Sonicares do.When you see more switches labelled \"clean and white\" or \"sensitive\", it just means that they do different things, and that is what you pay more for. \"Clean and white\" will just go for an extra 30 seconds, in which time you are supposed to go over your teeth a bit extra for whitening and stain removal. With a regular single-switch toothbrush, you can just turn it on again and go as long as you want, as well, and do the same thing. The \"sensitive\" setting will just give you a bit less power if you have sensitivity. None of us have ever found this necessary. At first, the sensation of the toothbrush in your mouth is a bit surprising, but you get used to it quickly, and it feels wonderful! It is really true that you get that \"fresh-from-the-dentist\" clean feeling!! It really is quite shocking how clean your teeth feel! We were good brushers with a regular brush, but the difference was still very noticeable.The toothbrushes come with an Easy Start setting on them which means that they start out a bit lower-powered for the first 14 uses, and then they run at normal speed-- this setting can be turned off. You just need to read the manual to learn how to do this. There are also fancier, more expensive models that will connect to your phone and such, but the basic models brush just the same. One thing I learned to watch for is to read the description carefully, and see what the power of each model is. You can look them up on the Philips site. Some have 31,000 brush strokes per minute, and some have 62,000, for instance. We got the 62,000, and they are great!One thing that we found was that no one told us that a whole family can share one handle. It seems a no-brainer, but I hadn't thought of it! One of the reasons that I didn't buy them years ago was that they were too expensive to buy one for each member of the family, but if I'd known that I could just buy one handle and each person their own toothbrush head, I could have managed that, even with a herd of small children. Nonetheless, we have them, now, though the children are a bit older. I guess they don't want people to only buy one, so they don't advertise this, but it would really be in their best interests to do so, as well as it being in the best interests of the users, as the users' teeth would benefit! I know that our family would've had them years ago if only I had known this. The Philips company would benefit because they would then have little Sonicare users who would grow up to be dedicated adult Sonicare users, and would then pass this on! I know that my children will continue, now, after we've started using them. I do also think that it could definitely help small children have their teeth brushed more effectively, as brushing would be fun, and there is so little skill needed.Another thing to know is that there are many different heads. There are many different basic brush heads which work great, and there is the Diamond Clean, which has tighter-packed bristles to work on staining better. Even the basic brush heads are fantastic, and all fit on any brush handle, so you don't have to keep buying only the same type of head that came with the original package. Watch for sales and they are not nearly so expensive. I recommend using Sonicare brand heads, though. My children and I use the C2 brush head, and my husband uses the Diamond Clean brush head for more stain prevention. Usually, he has staining starting to show soon after a cleaning at the dentist's, but his teeth are still white now, and it's been a few months. What a difference! We would never go back to regular brushes! We love our Sonicare toothbrushes, and these ProtectiveClean 4100 models were just perfect for us-- simple, affordable, and they had nice colours available. We have pink for the ladies and black for the men in our family, but I see that there are other colours. Enjoy your Sonicare toothbrushes-- you'll never go back!! :)",
                "reviewVotes": "281 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Santosh R Nandan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 20, 2019",
                "reviewTitle": "Thumbs up",
                "reviewText": "As advertised",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 26, 2022",
                "reviewTitle": "The brush head becamse wobbly in under 4 months",
                "reviewText": "I am very disappointed with this brush, I brought it end of July and within 4 months, the brush head became wobbly. It is really bad for such an expensive tooth brush.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 15, 2019",
                "reviewTitle": "Excelente calidad para el precio",
                "reviewText": "Funciona muy muy bien. Me quita el tarro mucho mejor que una manual, como prometido.La batería dura mucho, el programa de 4 veces 30 segundos es perfecto para mí. Muy sencilla de uso, robusta, se limpia fácilmente y limpia muy bien.Había investigado y es recomendada por dentistas, y para la gama de philips, está muy bien de precio para la calidad.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$44.75",
                "sellerName": "Smooth Value",
                "sellerRating": "5"
            },
            {
                "price": "$44.95",
                "sellerName": "Pro-Distributing",
                "sellerRating": "4.5"
            },
            {
                "price": "$46.34",
                "sellerName": "Loyal Firm",
                "sellerRating": "5"
            }
        ]
    }
}