{
    "remaining_requests": 21893,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shea-Moisture-African-Black-Butter/dp/B005C2N8IC",
    "body": {
        "name": "SheaMoisture Bar Soap African Black Soap for Troubled Skin Cleanser with Shea Butter 8 oz",
        "price": "$4.85$4.85 ($0.61$0.61 / Ounce) $4.34$4.34 ($0.54$0.54 / Ounce)",
        "originalPrice": "$7.99",
        "rawPrice": 4.85,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shea-Moisture-African-Black-Butter/dp/B005C2N8IC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 20% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41kUw eSxXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41wjAYr3nFL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DcJWUvrVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51baZzh0tAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41w7SfSlezL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51j77ZHeIZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Mp29fFl9L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0ab67a0-a879-4ff7-acaa-2de5f0f8cd42/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SheaMoisture Store",
            "link": "https://www.amazon.com/stores/SheaMoisture/page/036A487E-7D7C-4DA2-BA08-052332E19E74?ref_=ast_bln"
        },
        "brand": "SheaMoisture",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 9883,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 21 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SheaMoisture African Black Soap With Shea Butter is a bar soap skin care cleanser specially formulated to cleanse, moisturize, and soothe dry skin",
            "African Black body soap and cleanser for dry skin is made from palm and plantain peel ash and contains a combination of various oils that have been used in Africa for centuries to balance oily skin",
            "SheaMoisture blends Fair Trade Shea Butter, and other naturally derived ingredients that may vary in color and consistency, so each body bar soap and moisturizing bar soap is unique",
            "Perfect for troubled skin, this sensitive skin bar soap, gentle skin cleanser and soap for sensitive skin helps soothe your dry skin",
            "All SheaMoisture bath products and bath and body skin care products, including this beauty bar soap, are sustainably produced and cruelty-free skin care",
            "SheaMoisture men's bar soap and body soap for women is carefully formulated with no parabens, no phthalates, no mineral oil and no sulfates"
        ],
        "description": "SheaMoisture African Black Soap With Shea Butter is a bar soap skin care cleanser specially formulated to cleanse, moisturize, and soothe dry skin. African Black body soap and cleanser for dry skin is made from palm and plantain peel ash and contains a combination of various oils that have been used in Africa for centuries to balance oily skin. SheaMoisture blends Fair Trade Shea Butter, and other naturally derived ingredients that may vary in color and consistency, so each body bar soap and moisturizing bar soap is unique. Perfect for troubled skin, this sensitive skin bar soap, gentle skin cleanser and soap for sensitive skin helps soothe your dry skin. All SheaMoisture bath products and bath and body skin care products, including this beauty bar soap, are sustainably produced and cruelty-free skin care. SheaMoisture men's bar soap and body soap for women is carefully formulated with no parabens, no phthalates, no mineral oil and no sulfates. SheaMoisture Story: SheaMoisture is the legacy of Sofi Tucker, a pioneering mother of four and entrepreneur, who sold Shea Butter, African Black Soap and homemade beauty preparations in Sierra Leone in 1912. We honor her vision by continuing to formulate with Raw Shea Butter handcrafted by women in Africa. With every purchase you show support of our mission to reinvest back in our communities.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b?ie=UTF8&node=11060521"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Body-Cleansers/b?ie=UTF8&node=11056281"
            },
            {
                "name": "Soaps",
                "link": "https://www.amazon.com/Bath-Soaps/b?ie=UTF8&node=11056341"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.5 x 1 x 4 inches; 8.11 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ U-BB-2692"
            },
            {
                "name": "Batteries ‏",
                "value": "‎ 1 A batteries required."
            },
            {
                "name": "UPC ‏",
                "value": "‎ 701443529140 764302233039 785923408712 698797069760 701108609224 734872344756 077344421976 784179120249 885197311470 784179345826 885199772354 885190534678 885497649402 885804092631 785217539887 890790464539 885976701959 885142728926 620200045221 647409260699 046655544476 782854049496"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Unilever"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B005C2N8IC"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,624 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #63 in Bath Soaps"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 9,883 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "SheaMoisture African Black Soap With Shea Butter is a bar soap skin care cleanser specially formulated to cleanse, moisturize, and balance oily skin.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15b6327c-e9b9-4559-9a0e-4dc9576d0a46.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Unique & Soothing Soap Bar This lightweight moisturizing bath & body bar keeps skin hydrated while balancing oily to combination skin. Together, We Give Back With every purchase, you support our mission to reinvest back in our communities. Tried, True & Cruelty-Free Tested on friends & family for generations—never on animals. Because of Her We honor the vision of this pioneering mother and entrepreneur by continuing to formulate with Raw Shea Butter handcrafted by women in Africa.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f5a55e7-e986-4b03-ba34-7480c9360575.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ce36829-f698-4572-8fbe-a00b6acce518.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65bc2833-8734-4363-8069-2c96a0cc1f77.__CR0,0,220,220_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a017ad96-edeb-45d3-b3db-8a9aa1c71ed0.__CR0,0,220,220_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "AFRICAN BLACK SOAP CLARIFYING FACIAL WIPES SheaMoisture 100% Pure Essential Oil SkinCare AFRICAN BLACK SOAP FACIAL WASH Naturally infused towelettes that remove makeup, dirt, and impurities without rinsing or drying out skin. TO USE: Do not ingest or put directly on your skin. This essential oil is one of SheaMoisture's best oils for skin when used with a moisturizing lotion or carrier oil. A Facial cleanser, face scrub and exfoliator to help blemish-prone skin transform into glowing skin.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ff95c6f-0138-4a9c-a445-11388479fa2c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15b6327c-e9b9-4559-9a0e-4dc9576d0a46.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f5a55e7-e986-4b03-ba34-7480c9360575.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ce36829-f698-4572-8fbe-a00b6acce518.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/65bc2833-8734-4363-8069-2c96a0cc1f77.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a017ad96-edeb-45d3-b3db-8a9aa1c71ed0.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa59b31d-c07a-45f7-8725-861394e48097.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72161f13-d33a-407b-b224-7ff01b9d818b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b818f3a2-da3e-4e68-896f-96a77a4d21d7.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6baddbdc-785c-4370-b8f6-c236ba44aec4.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "brena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVJWOS2PMXRZOR3XQFODJOSF3MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WTYMGLI2DOB9?ASIN=B005C2N8IC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2015",
                "reviewTitle": "5.0 out of 5 stars So far, so good",
                "reviewText": "Just ordered and waiting to see if it works wonders for my skin. I have had problems with back acne for years and I started having issues with acne in my 20's on my face. So far i haven't been experiencing any skin problems since using this product. Lately it doesn't matter what soap product I use, it has been causing my skin to get irritated to the point some people have been asking if I have eczema. I don't know what happened but I never had that experience before until recently. But so far since using this product my skin feels exfoliated and soft. It smells realllyyyyyyyyy good and I haven't had any issues with my skin experiencing break outs or irritations . ***after full use update. after a week or so of using this people noticed a difference in my skin tone which seemed more even and it was clearing up my acne. After I received the compliments..i started looking at my skin more in detail and noticed a major difference. If you are having acne problems then this products will be good to purchase and if you need help with evening your skin tone. You want to make sure you put it in a plastic bag so that they black suds don't get every where while its drying or if you can find a bigger soap holder then that will work too because this is bigger than normal sized soap and worth the price. Just bought some more from Walmart but for some reason the product I purchased from there seems of so I will be buying more from this vendor just to compare and see if there is a difference or if just she moisture changed the product all together. Went back to regular products for a little bit and my skin went back to breaking out so I'm def sticking with this black soap because it did wonders for my skin.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fatedt0pretend",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFW4C5Y35ECPKDU524C6O6BD42IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VI1SHHS7E70D?ASIN=B005C2N8IC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2019",
                "reviewTitle": "5.0 out of 5 stars A Miracle in a Bar!",
                "reviewText": "If you’re acne-prone, have dry, and/or sensitive skin, this is the soap for you! I always keep a bar of African black soap in my shower ever since I first tried it and was wowed by its benefits three years ago. Compared to other brands of African black soap, this Shea Moisture brand is my favorite by far; I love this soap! I was suffering from mild-moderate acne on my back, as well as severe cystic acne on my face and this cleared it all right up within a few weeks of use. This soap is also incredibly moisturizing, so just because it gets rid of facial and body acne doesn’t mean it’s going to dry out your skin. This is a perfect choice of soap to use in the winter time especially when skin is typically dryer due to the dry air. Obviously this soap maybe isn’t a miracle, it does take some time to see results acne-wise, but you’ll notice the moisturizing effects right away—so much so you won’t even feel the need to put lotion on after your shower! This soap lasts quite a long time as well; it’s an 8oz bar, which is the same size as regular bar soap, so you don’t have to worry just because it’s “special soap” it’s going to be smaller than normal. Additionally, the price point for being “special soap” is very reasonable at just over $3 per bar. I do still break out sometimes, but it’s just hormonal, rather than every single day like it was before. Additionally, when I do breakout, it’s not anywhere near as bad as before, and that’s because this soap prevents inflammation, which stops breakouts from becoming as big, but also soothes existing breakouts, and also any zits that are in the healing stage. If you’re getting desperate looking for something that finally gives your skin the results you’re looking for, try Shea Moisture’s African black soap. This stuff is so amazing, I promise you won’t regret buying it! I can’t recommend this soap enough!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV6JWQQDRLMRGALQ6DELOSQVGDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCBRDTXK29PTE?ASIN=B005C2N8IC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2018",
                "reviewTitle": "5.0 out of 5 stars And it seemed to have been making my acne worse! On a whim",
                "reviewText": "Word of warning, this is not real African black soap. So if you're looking for the real deal, move on elsewhere.I've gone to the dermatologist regularly for \"typical\" acne that was always kept under control by prescription products. In my early 20s, I developed cystic acne around my jawline due to my hormones going out of whack. I was prescribed some pills and sulfuric-based facial wash. That face wash made me gag and tear up, literally, every time I used it. And it seemed to have been making my acne worse!On a whim, I bought this product. I've seen people rave about it online so I decided to try it. The first time I used it, my face felt very soft and clean. I used it twice a day, along with witch hazel, and I would say that within 4-5 months, the cystic acne went away. I still get the occasional pimple and I wouldn't say that my skin is now super clear. But I don't get any big pimples anymore, just a small one here and there. I can't say that this soap helps much with dark spots though, unfortunately. But aside from that, I think this soap is wonderful! Based on other reviews, it's clear that it's not for everyone though. So use at your own risk.I do have a couple of tips.Sometimes when I wear heavy makeup, I feel like this soap doesn't do as good of a job of cleaning my face if I use solely my hands to clean. That's when a facial cleansing brush comes into play.I use a big knife to cut the soap up into 6 pieces. I find the small pieces easier to use and more hygienic. I wrap up the pieces I'm not using yet with parchment or wax paper and place it inside a Ziploc bag.I place the soap on top of a soap saver to keep it dry and not slimy-feeling. It can leave a black residue but just wipe it away with water and it goes away.Overall, I am a fan of this product. After about 1.5 years of use of simple soap and witch hazel, my skin is looking really pretty darn good! So great job, Shea Moisture!I am still a big proponent of going to a dermatologist and letting them handle whatever skin issues ails you though... Haha.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daisy Swanson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 10, 2023",
                "reviewTitle": "Very good for hormonal acne",
                "reviewText": "I struggled with hormonal acne about a year ago. This bar was my last resort since every cleanser I tried didn’t work for me at all. But within a few weeks of using this bar consistently every day, I noticed my acne cleared up ALOT. Now it’s been a year of using it and my face has cleared up 100%. Every night I use it and pair it up with a CeraVe moisturizer before going to bed.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FERNANDO ALONSO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 23, 2024",
                "reviewTitle": "Perfecto para exfoliarte",
                "reviewText": "Se ve en la primera aplicación el resultado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frances",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 24, 2023",
                "reviewTitle": "savon grass",
                "reviewText": "nettoyant savon tres bon pour seches",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AntonellaAntonella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 31, 2021",
                "reviewTitle": "purrfect",
                "reviewText": "😭",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1c-slyCl1S.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sofia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 20, 2021",
                "reviewTitle": "Tolle Seife von meiner Lieblingsmarke",
                "reviewText": "Die Seife riecht sooo schön und ist sehr ergiebig.Habe viele Unreinheiten und nach dem Gesicht waschen fühlt sich meine Haut gereinigt an. Habe das Seifenstück nun fast leer. Ich muss sagen es hat meine Haut auf keinen Fall verschlechtert aber auch nicht wirklich verbessert. Würde sie dennoch nochmals kaufen weil ich den Reinigungseffekt sehr mag und sich meine Haut weich und sauber danach anfühlt.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.98",
                "sellerName": "Apperose",
                "sellerRating": "4.5"
            }
        ]
    }
}