{
    "remaining_requests": 22084,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Remedy-Natural-Tree-Soap-Women/dp/B07NQKRPZH",
    "body": {
        "name": "Truremedy Naturals Remedy Natural Tea Tree Soap Bar for Men/Women, 5pk - With Peppermint & Eucalyptus - Tea Tree Body Wash - Face & Body Soap for Body Odor, for All Skin Types",
        "price": "$37.99$37.99 ($1.90$1.90 / Ounce) $35.99$35.99 ($1.80$1.80 / Ounce)",
        "originalPrice": "$49.99",
        "rawPrice": 37.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Remedy-Natural-Tree-Soap-Women/dp/B07NQKRPZH",
        "soldBy": {
            "sellerID": "AF7B6JQEO3PJ0",
            "name": "Cariti Brands",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AF7B6JQEO3PJ0&asin=B07NQKRPZH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C8VJCXGH"
        ],
        "asinVariationValues": [
            {
                "asin": "B07NQLC9KN",
                "variationName": "Size",
                "variationValue": "4 Ounce (Pack of 2)",
                "price": "$19.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07NQKRPZH",
                "variationName": "Size",
                "variationValue": "4 Ounce (Pack of 5)",
                "price": "$39.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41oo2LoSNdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Io7fQsFIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417hdQ VorL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 PFoQicgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BAw69k55L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Cr2LbGb2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51P9 DAQpTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Truremedy Naturals Store",
            "link": "https://www.amazon.com/stores/TruremedyNaturals/page/B8D5D6BF-97C8-4CA0-AD42-C3D92072F1B9?ref_=ast_bln"
        },
        "brand": "TruremedyNaturals",
        "merchantInfo": "Cariti Brands",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4125,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Friday, February 16. Order within 10 hrs 52 mins",
            "FREE delivery Tuesday, February 20",
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Friday, February 16. Order within 10 hrs 52 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "NATURAL INGREDIENTS - Our Remedy natural tea tree oil soap bar for men/women formula has NO preservatives, petroleum, silicone, sulfates, synthetic fragrance, or dyes commonly found in other gels, lotions, creams, and ointments.",
            "DEODORIZES & REFRESHES - Our tea tree body wash soap provides a defense against skin irritations by washing away sweat, dirt, and impurities. It is a powerful face and body soap and a foot and body odor eliminator. It is strong enough for the gym and gentle enough to use every day!",
            "SOOTHES SKIN - Our premium Remedy soap bar soothes dry, itchy, cracked, and irritated skin. It contains skin-enriching omega 3,6,7, & 9, vitamins E & C, aloe vera, and mint essential oil that helps with foot and body skin irritations and soothes the face, hands, heels, toenails, elbow, back, chest, and butt.",
            "GREAT FOR ACTIVE PEOPLE - This Remedy tea tree soap for men and women is great for athletes or jocks who are active in soccer, basketball, CrossFit, martial arts, barefoot running, yoga, pilates, MMA (mixed martial arts self-defense), football, or have the itch to workout regularly at the gym.",
            "TRUREMEDY NATURALS GUARANTEE - All our products - remedy soap bars, remedy soap tea tree oil body wash for men/women, remedy hemorrhoid balm, remedy balm, activated charcoal soap bar, remedy bruise cream, natural mint foot and shoe deodorizer, and tea tree oil foot soak with Epsom salt - are made of broad spectrum essential oils and plant extracts including tea tree and eucalyptus oils that help soothes skin discomfort."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Body-Cleansers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11056281"
            },
            {
                "name": "Soaps",
                "link": "https://www.amazon.com/Bath-Soaps/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11056341"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 7.52 x 5.71 x 2.4 inches; 1.5 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ NB-PABE-QYQS"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Truremedy Naturals"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07NQKRPZH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#17,721 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #253 in Bath Soaps"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,125 ratings"
            },
            {
                "name": "Item Form",
                "value": "Bar"
            },
            {
                "name": "Skin Type",
                "value": "Acne Prone,All Skin Types"
            },
            {
                "name": "Brand",
                "value": "Truremedy Naturals"
            },
            {
                "name": "Scent",
                "value": "Regular"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Tea Tree Oil Foot Soak with Epsom Salt & Mint Remedy Moisturizing Bruise Formula Cream Remedy Natural Tea Tree Oil Soap Bar Remedy Tea Tree Oil Balm Remedy Hemorrhoid Balm Uses & Benefits Helps stubborn foot odor, calluses & Soothes Sore Tired Feet It repair Stretch Marks and Scars Soothes Dry, itchy skins Deodorizes and Refreshes Cream for Nail Issues, Rash, Skin Irritation specifically for Psoriasis, Eczema. Fast Relief and Soothing of Hemorrhoid for Burning, Itching, Pain & Swelling",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/9b3a478f-61a2-45da-9913-8451ab0fdd90.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/89e99175-fbe6-4fe5-8418-cdf4205c014f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fffccfa3-9c5c-4444-b3d4-9c0a6115cd58.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/791712bd-afe1-4700-ac66-6626a09cbba7.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6d97223a-2ec2-4360-b87d-7e7bbbd36ddc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f973ca01-fcc4-4e4a-9c2f-d7a47baa5cd9.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Allen Braunbeck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELFP55WFZYK4NX7FGFSHGLOSGPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11Y7K7W699DO0?ASIN=B07NQKRPZH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars great soap for athletes",
                "reviewText": "The freshness of the scent and feeling on my skin is great. I sought after a soap that can help keep my skin healthy and clean. I participate in jiujitsu, lift weights and on the go with my dog. I use this soap two to three times a day and it doesn’t dry my skin out like other athletic or sport specific soaps. The quality is great, the texture is smooth and silky once wet, it lathers up good and has lasted longer than expected, the price point is comparable to other soaps marketed to athletes, and in all fairness I have used several of the competitions products with less than satisfactory results.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tamara Linda Carson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAEHNIMUKY2TSSBULIGKAF4AWVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TP1ZD6HXARNV?ASIN=B07NQKRPZH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent for ranch life",
                "reviewText": "I love this soap, my skin is so sensitive and I cannot use perfumed soaps but this has a fresh scent that is natural.I deal with alot of stray cats, chickens, donkeys dogs and all the lovely stuff that comes with them… this soap is ideal for anyone who is dealing with animals everyday.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JLakis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEVSL2T75HBGG73STT76XJ4YXPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R189BHPSDC0DNE?ASIN=B07NQKRPZH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Smells great. Tingly clean skin. Fights odor, pimples, skin problems, fungus",
                "reviewText": "I do love this soap. I started by trying out their bottled body wash, which is great to take with to the gym or even to add to a bath. Then I decided to try the bar soap for home. It's just as good, if not better because you won't accidentally use too much product. I am an outdoorsy type and practice yoga, and I've found that no matter whether I've been in water shoes, wet clothes, gotten into some poison, bug bites, etc this soap takes care of all of that. I'm particularly sensitive to poison ivy, oak, and sumac, and while this doesn't cure it immediately, a recent rash barely itched after one use. You can use it between your toes to prevent or help heal athlete's foot, which is great if you shower at the gym, or or your feet get wet or sweaty a lot. This is also perfect for odor! It really does help if you're active or have issues with that. I use it on my face as well, and, aside from not sticking it in your eye, it keeps my complexion clear. I am susceptible to hyperpigmentation, and this stuff clears it right up, and is great if you're prone to breakouts. It's also just refreshing feeling and smelling, and even leaves your skin a bit tingly. I've seen some reviews state that it may dry skin, but I have oily skin and have had no problems that way. The only reason I took off one star is the price in relation to how long the bar lasts. You need to keep the soap dry and drained, and even then it gets a little melty. That said, while other soaps may last a little longer for less cost, this is the best tea tree oil soap I've found. Just all around good for your skin, smells greats, rinses easily, and helps you feel fresh and clean.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEC3CT5PKRVCV6EKAQAHOADH5YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AEKCIU9TOGE7?ASIN=B07NQKRPZH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2019",
                "reviewTitle": "5.0 out of 5 stars fast shipping and so far works great!",
                "reviewText": "I have only been using this soap now for about 4 days, so far it works great, I am a \"fluffy\" woman and live in scorching, surface of the sun Texas. Now mind you usually you have to use natural for a while to get its full affect, so this is my experience so far. I was worried it would be really strong with the tea tree and the peppermint mix, but it is a VERY mild smell. I am sensitive to a lot of smells so my sister gets all my over fragrant items, so she was sad that she wont be getting this. I used the soap first day and it don't lather like most soaps, but leaves you feeling great. It leaves you with the soap du-du-du squeak. I thought ugh this is going to leave me too dry. (I have light psoriasis too) So I have to be careful with soaps, they cant be too moisturizing or too drying or I will hate the skin i'm in! After showering the first thing I noticed was how super soft my skin is. Smooth and soft. So I went out in the scorching sun, mowed the lawn, and did some shopping. usually I would need a quickey shower to get rid of Texas smell but I was fresh as can be. I would also like to point out that the under belly is responding to this soap very well, those that have one know what I am talking about. So far the few days in I am VERY satisfied with this soap, hopefully it will keep working great, Oh and btw, my skin WAS very dry due to the previous soap I was using and so far my skin is getting better and better with every use, and my psoriasis is very happy and not itchy or breaking out also I think it will be long lasting because it don't even look like I have used it, a lot of soaps break down fast, so far not this one! Hopefully I have found a soap for life!",
                "reviewVotes": "138 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEY4MT5V7GOLLJCQ5RIYD7GZBTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FNURIVLY3BV7?ASIN=B07NQKRPZH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2021",
                "reviewTitle": "5.0 out of 5 stars Tinea versicolor",
                "reviewText": "I am so, so happy to have found this product. I've had tinea versicolor for quite a few years now and the doctor always recommends selsum blue to keep it away. I hate how it smells and stains everything blue and my husband buys off brand a lot and those don't work for me and I've been trying to get rid of this flare up for over a year now with no luck. The doctor gave me super expensive scripts this last time and told me selsum again and my husband, now refusing to buy on brand and my skin becoming very uncomfortable and blotchy at this point, I had enough and wanted something to just soothe it so I felt more comfortable when I found this product. This morning I couldn't believe that not only has my skin felt better, the red marks that usually take months to be gone have disappeared! I wish I took pictures before. I had to jump on here and check when I received this, 16 days ago! I'm so happy I'm in tears, thank you for a wonderful, healing product!Not tinea related, the scent is light and doesn't stay with you and it rinses clean without drying my skin or leaving a residue feeling behind. The bar has lasted 16 days and there's plenty left, so I'm not left wondering why so much is disappearing. Looks like this 2 pack will last me almost 2 months, making this a great value for me.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE32F2RP3GU42RNBBXFUD6BP2REA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YTZY667Y4TOE?ASIN=B07NQKRPZH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2023",
                "reviewTitle": "3.0 out of 5 stars Mixed thoughts.",
                "reviewText": "It has a great smell and I like the way it makes my skin feel. But I’m not sure it was helpful to me for any skin conditions. Didn’t really have any to work on, thought it would be nice to try something that didn’t leave my skin so dry.I’ve used it daily for 13 days now, showering once a day and using a wash cloth. The bar is down to a sliver of soap left. So I can’t say it lasts long at all. Maybe it would last longer if you just rubbed the bar on your body vs a wash cloth first?? Who knows. But I’m not impressed with the length of time it lasted.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jacque",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDHH2TS5F4DG2MVT62X4IG7PPOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10U08HJX5392Y?ASIN=B07NQKRPZH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars True to description",
                "reviewText": "Exactly what I thought it was.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kelly hobbs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3XZ2DP3MX4VL3QJV6DFDZXLV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G512GKFUJIVW?ASIN=B07NQKRPZH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars N/A",
                "reviewText": "N/A",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frances",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 30, 2022",
                "reviewTitle": "This is amazing!",
                "reviewText": "I bought this for my son who has eczema. He is constantly red and itchy with almost constant sore and broken skin. He has been using this for nearly 4 months. Since using this he has only had broken skin through his own fault. He is not as red. Still itchy but not as bad as normal. I hoped for a good response but didn't expect much as nothing ever helps him much. This has made a big difference to him. He has found the bars of soap to be quite long lasting. I am so glad a friend recommended it. It is expensive soap but given the positive effect it has for my son, I think it was a bargain.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}