{
    "remaining_requests": 21879,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dr-Squatch-Mens-Soap-Sampler/dp/B01N25TGP2",
    "body": {
        "name": "Dr. Squatch All Natural Bar Soap for Men, 3 Bar Variety Pack, Pine Tar, Cedar Citrus and Gold Moss",
        "price": "$25.70$25.70 ($1.71$1.71 / Ounce) $24.27$24.27 ($1.62$1.62 / Ounce)",
        "originalPrice": "$30.00",
        "rawPrice": 25.7,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dr-Squatch-Mens-Soap-Sampler/dp/B01N25TGP2",
        "soldBy": {
            "sellerID": "A2R651JBHM4ZCY",
            "name": "Dr. Squatch",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2R651JBHM4ZCY&asin=B01N25TGP2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51jrQ8 68rL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51DKzr60JRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Wi0d7QdfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413uRkjlogL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SseprSjqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515mewtVQpL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/742c6c95-c5d1-4336-b095-eabab5528fd2/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/097dcbbb-536c-4e1e-954d-6c7deb001f68/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/879f91e7-8c26-4f73-b250-9394c94d20a0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ee5e35b5-8fda-4abb-b29c-8c9c1536407c/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Dr. Squatch Store",
            "link": "https://www.amazon.com/stores/DrSquatch/page/06543539-37D8-4A25-986B-5A60BA6C9815?ref_=ast_bln"
        },
        "brand": "DrSquatch",
        "merchantInfo": "Dr. Squatch",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 19912,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 20 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "RAISE THE BAR on your shower with our sudstastic 3-pack of cold process natural soap featuring a selection of manly scents including: Pine Tar, Cedar Citrus, and Gold Moss.",
            "NATURAL COLD PROCESS SOAP - Made in the USA using a traditional cold process and with nourishing natural ingredients like Coconut Oil, Shea Butter, and Kaolin Clay.",
            "NO HARMFUL INGREDIENTS - Our products are 98-100% natural in origin and we never use harsh chemicals or synthetics like parabens, sulfates, phthalates, or silicones.",
            "DOC’S NOTES - We develop our high-performance natural products specifically for the needs of men so lather up and scrub to smell fresh and feel clean day in and day out.",
            "MAKES A GREAT GIFT - Give the gift of a routine upgrade so everyone can smell like a champion!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Body-Cleansers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11056281"
            },
            {
                "name": "Soaps",
                "link": "https://www.amazon.com/Bath-Soaps/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11056341"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3 x 3 x 3 inches; 1 Pounds"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 810095590962 851817007047"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Dr. Squatch"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B01N25TGP2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,827 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #24 in Bath Soaps"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 19,912 ratings"
            },
            {
                "name": "Item Form",
                "value": "Bar"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            },
            {
                "name": "Brand",
                "value": "Dr. Squatch"
            },
            {
                "name": "Scent",
                "value": "Pine Tar/Cedar Citrus/Gold Moss"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dfd40fad-81ea-4c38-a73f-334452f7760f.__CR0,10,1200,360_PT0_SX600_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/178c223d-c2ff-4bfb-8634-1a53cd38b2fd.__CR0,0,1940,1200_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0436ec1a-8158-489f-ada4-de96c42c01e3.__CR0,0,1940,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f9db566f-a742-4678-abe4-87b702f60055.__CR0,0,1940,1200_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19f73cb0-ac23-481e-8955-55e567722bbc.__CR0,0,1940,1200_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5c89490-7373-4bc2-b9b7-828b82563e00.__CR0,0,1940,1200_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. Lafreniere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHNTMU5HAXJMZ6OWWJU75ROAHUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L6TSXOT6T1IJ?ASIN=B01N25TGP2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2020",
                "reviewTitle": "5.0 out of 5 stars Good men’s soap but a little expensive",
                "reviewText": "Got the assorted three pack and had a chance to try all three different soaps...They lather up great but beware that these soaps soften up when they get wet and will wear down fast from normal usages...From what I am smelling there is very little difference in the after smell on my skin and all three seem to have a similar clean fresh decent scent but nothing like normal bar soap I also use...Also not advisable to leave any of these soaps in the shower because they will stay soft and drip leaving soap lines all over the shower...I actually found that after using either of the three I had to remove the bar and let it air dry on top of the prepackaged box it came in overnight before I could put it back into the box or use it again...Best way to use this sparingly is to wet your body then turn off the water and lather up then after your done doing this just turn the water back on and rinse off...The cons to using this soap is it’s expensive at nearly $10. Per bar and it’s small and will drip down into the sink or shower if it’s not completely removed from the humid shower Enviorment after you use it...Pros are it smells good, like a man’s smell but nothing like a cologne and afterward it leaves my skin like I used a lotion...Not advisable for using on your face!If this were half the price I’d buy more but the cost is just not worth buying...",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP7NCMBR6FUSMNT2NOPV6PIEWTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNTUX7YNFCJPP?ASIN=B01N25TGP2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Great manly scent",
                "reviewText": "smells great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Cohen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3YXQSKVK5P3M4BCOIU6DA2CRMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNR719Z5YF74T?ASIN=B01N25TGP2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2019",
                "reviewTitle": "4.0 out of 5 stars Mixed bag, but makes a great gift.",
                "reviewText": "I like the size of the bars, nice big flattened square slabs. I like the earthy production value of the materials they use individually to encase the soaps for presentation. I purchased the Gold Moss, Pine tar, and Citrus something. From the scent alone, I went straight for the Pine Tar Bar, but in hindsight which is 20/20, I would have liked to have tested the pine tar last of the three.The Pine Tar: Higher than an A+The Pine Tar soap was a six-star product (out of 5 stars nonetheless). It left my skin sultry and with an uplifting pine scent. At different times and locations, I got winks from various cute girls after using it, so it appears to have spanishfly properties. After I used it for a number of days, each time, I felt zesty clean and refreshed, which put some pep into my step and gave my glide a little stride. My pores felt properly cleansed. I was very sad when the bar of soap ran out and vanished into a semi-translucent nub. This is one of the best soaps I have ever used in my entire life. The little bits of natural exfoliating materials (perhaps oatmeal?) within was a nice touch and thoroughly enjoyed the soft scratching quality of it. This is a soap that I don't mind paying the expensive price for, it lives up to the expensive price and flies far past the finish line, arms behind, for the golden victory. I can honestly say I have never seen another soap measure up to the pine tar bar, and I've tried dozens of different brands of soap from the mainstream kind to the home-made cottage industry versions. Not all soaps are created equally.Gold Moss Soap Grade: D+ / C- but has the potential for an A grade, under special circumstances, like dry skin or rash, or varients of the like.Gold Moss - is one of the most inert soaps I have ever used, which could have its benefits under certain circumstances. I would say this one might be a good soap for someone who doesn't want a post-shower powerful aroma or a soap that causes any sort of itchiness from residue, per se. This struck me as a curious soap that would not stimulate inflammation, for instance. But Alas, I did not feel clean after using the Gold Moss, but I think it might have value for people with supersensitive skin. I give this one between 2 or 3.5 stars out of five stars, If I had skin inflammation issues I would probably give this soap 4 or 5 stars. I just did not connect with this soap at this time. It was like bathing with a bar of nothing.Citrus maybe a B- grade.Citrus -- between 3 and 4 out of 5 stars, nice faint citrusy perfume,, but not overpowering, this soap is nothing to write home about, but I felt clean from it. I like this soap more than the gold moss.Recommendations for Dr. Squatch:Please make a coal tar soap and shampoo for people with eczema or psoriasis and other derma related medical conditions, I think legally you can go loosely up to 3% to 5% without a prescription. Please investigate. Because I believe it's a great soap to have in the winter season, when peoples' skin is more likely to be dry, and scalp a touch flakey. Some other completely different versions, or other styles that might be a hit, please also consider a unique purple lavender variation and a lime-mint.Final conclusion: Thank you for not being overly perfumy. The Pine tar soap has magical-like properties to it and is a luxurious epicurean experience in the rainhead shower. It gets my highest marks. The Citrus soap is descent, I might consider purchasing more of these in the future but in lower volume than the pinetar. The Gold Moss, I won't be purchasing again-however, I would recommend it to people with hypersensitive skin to see what they think, I would like to read their opinions on it.I'm excited and look forward to trying your other soaps and products. So far I give the Dr. Squatch brand a thumbs up. I got a real giggle from your product commercials too, nice touch.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason C Thomas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELY6E7YGXLBDN4R2LWYGIQOG3OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNVIVF6J3N2VJ?ASIN=B01N25TGP2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2023",
                "reviewTitle": "5.0 out of 5 stars great smelling soap, moisturizes well",
                "reviewText": "overall ive been very pleased with the quality of dr squatch soaps. each bar lasts a decent amount of time and the scents available are a nice variety. ive noticed a difference in my skin since i started using these soaps and have reordered a few times since i started using them. havent used any body washes since. i tend to stay away from ordering the pine tar variety though as it can leave a dark residue on the surface of the shower which can be a pain to clean.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jcn2342",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6V3NRX4MUYZBOYPZDRCC5F4LOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33ZHQFYAMTGUH?ASIN=B01N25TGP2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Great soap",
                "reviewText": "Like the smell of the soap and how long it lasts",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIRIBBC2K2PFDRC6RUQCRAE3PSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY5H88C6OMSB2?ASIN=B01N25TGP2",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2020",
                "reviewTitle": "3.0 out of 5 stars Your paying for all the awesome commercials. READ ME FIRST",
                "reviewText": "For nearly $10 a bar, your paying for mostly the awesome commercials. See below1: stright out of box Scent is NOTHING like any other major store bought, truly awesome. I order 3 samplers and I enjoy the gold moss and soothing aloe the best. (There is no aloe in the aloe go figure only fragrance.2: all the ingredients are truly readable and nothing fishy, they must be \"better\" for you.THE BAD, or not so good1: like many other non paid legitimate consumers, I feel super \"grippy\" after I rinse off throughly. If you used normal cheap bar soap in the past, be prepared for that sticky grippy feeling again. It does go away a bit after toweling off but not what I was expecting.2: after about 2 showers, the bar looses 80% of its scent, to the point where in about 30 minutes after shower, I don't smell anything on my skin. To make yours last longer (and not get germs and bacteria) work a lather in your HANDS, AND THEN use that lather all over. Repeat. This bar will NOT LAST long with direct pressure on body. It does Sud up really good though which is a good thing.3: See picture 2:super aggressive and uncomfortable to \"exfoliate\" with. I personally don't rub it on my own body as your soap gets germs all over it. But idk how anyone could use this. Way too aggressive to rub bar on skin4: price.... I could justify $5 max for a bar of soap like this. He's going to be yours But this is truly all hype. I do admit my skin is a \"wee\" bit less dry but nothing to write home about.5: THE MESS! Be prepared to have black looking goop that is harsh to rub off. I don't mind it but most people have white tubs. Yikes if you care about your tub looking white. Even though my soap is not getting hit by water, it melts and bonds to my soap shelf leaving a layer of black goop. I don't have this issue with other bar soap. See my pictures.Worth a try, but wouldn't buy again.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81OPh96xKgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81ZEaeM3M0L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jack Frasier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZYJL7YJSFG4FCUSGDEX5KFRJZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R121Q8QNXYOCZ?ASIN=B01N25TGP2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Great soap, just a little pricier than most others.",
                "reviewText": "It looks great and feels great because it exfoliates as well! Just be prepared to pay a little bit more than regular brands.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 16, 2022",
                "reviewTitle": "Lovely",
                "reviewText": "My husband wanted to try these and he says they are ok strong scented but cleans well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 26, 2023",
                "reviewTitle": "Profumate",
                "reviewText": "Profumo discreto e delicato, non certo intenso ne troppo persistente, ma discreto.Non troppo diverse da saponi di qualità, ma di tipo più comune se non per gli ingredienti e le fragranze",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca Clancy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 30, 2022",
                "reviewTitle": "Perfect!!!",
                "reviewText": "The product is great. It smells amazing and it was packaged so well to avoid any damage in transit. Thank you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 11, 2023",
                "reviewTitle": "Best bar soap ever",
                "reviewText": "Loved this stuff. Just uses up fast!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terry Christie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2023",
                "reviewTitle": "Best soap on the market",
                "reviewText": "This has too be the best soap I've ever used. Nice fragrance across the line, natural ingredients, don't think I'll ever use gels again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}