{
    "remaining_requests": 21951,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/TROPICAL-NATURAL-Black-Basic-31-74/dp/B00FYZS526",
    "body": {
        "name": "TROPICAL NATURAL Dudu Osun Black Soap, Basic, 31.74 Ounce",
        "price": "$14.48$14.48",
        "originalPrice": "",
        "rawPrice": 14.48,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/TROPICAL-NATURAL-Black-Basic-31-74/dp/B00FYZS526",
        "soldBy": {
            "sellerID": "A7Z5RFKJC34VX",
            "name": "Bell'Angelo",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A7Z5RFKJC34VX&asin=B00FYZS526&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09Z7B2QRV"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "13",
        "stockDetail": "Only 13 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51zYb2lX gL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41QGJwCIFdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/419IIOEICIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aqpZwjhKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uLk1yuBCL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LUBEX Store",
            "link": "https://www.amazon.com/stores/LUBEX/page/32837BBF-D9A1-4355-8C76-557881161218?ref_=ast_bln"
        },
        "brand": "LUBEX",
        "merchantInfo": "Bell'Angelo",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5262,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 8 hrs 49 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 16. Order within 20 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Country Of Origin: United States",
            "Model Number: count",
            "Item Package Dimension: 7.199999992656\" L x 4.1299999957874\" W x 3.5799999963484\" H",
            "Item Package Weight: 2.08998224376 lb"
        ],
        "description": "KED43708",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Body-Cleansers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11056281"
            },
            {
                "name": "Soaps",
                "link": "https://www.amazon.com/Bath-Soaps/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11056341"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 7.7 x 5.1 x 3.9 inches; 2.2 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ count"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 891787057277 880983245182 890563863477"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ TROPICAL NATURAL"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00FYZS526"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#41,054 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #593 in Bath Soaps"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 5,262 ratings"
            },
            {
                "name": "Item Form",
                "value": "Bar"
            },
            {
                "name": "Skin Type",
                "value": "Dry"
            },
            {
                "name": "Brand",
                "value": "LUBEX"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Blue Jay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3M2JR5USDC6V7OKCXLND4ZKKDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B7SWP7WK8WVJ?ASIN=B00FYZS526",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 5, 2018",
                "reviewTitle": "5.0 out of 5 stars The best natural soap EVER!!!",
                "reviewText": "This is my 2nd time trying this soap and this time around I am blown away. I actually got results on my 1st use. A quick history...I have had to deal with pimples through my childhood and off and on into my adult life. As a result I still find myself chasing a flawless complexion. However, after this last stress-induced breakout I decided to go back to primarily natural products starting with my cleanser. So as I stated earlier I had immediate results. I had had a huge pimple that was on the verge of erupting (I aplogize for the visual) and literally after washing with this soap it dried up a lot. Went from ready to erupt to no activity within the area. I followed with my SeaBreeze toner (it's old school but I love it), Aztec Indian Healing Clay mixed with Braggs apple cider vinegar, TruSkin Retinol moisturizer mixed with RoseHip seed oil by Kate Blanc cosmetics and dabbed premium tea tree 100% pure best therapeutic grade specifically on the spot and by the next morning, the pimple had flattened out. I also want to add that with the exception of the toner, I got everything from Amazon.Anyway back to this amazing soap. I love the smell. No issues what so ever with mushing p or pieces coming off. I do use a soap saver and have that resting on a wooden soap dish also procured on Amazon. Additionally in terms of value this cannot be beat. This is basically $2 per bar that will definitely last a long time. So worth the money.Oh and how could I forget. My skin is oily but has gotten a bit sensitive over the years as well. However I have no issues with this soap in that department either. Also, I love how clean this soap gets my skin. Plus, how can you not love and appreciate the great ingredients. Natural and all around great for you. Don't know why I ever stopped using Dudu Osun. Truly the best!!!One more thing. My order came very quickly and packed very carefully. The soaps were packed with bubble wrap to prevent any kind of damage and when I opened the box I was blown away by the wonderful smell. Wonderful experience all around. Highly highly recommend!!!!2nd time buyer but here on lifetime customer. Thank you!!!!! ♥♥♥",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "skeeter`57",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBWC5QTP6VXGOMJCECJ2IKFDS5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MFOFZJO5TEKX?ASIN=B00FYZS526",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2018",
                "reviewTitle": "5.0 out of 5 stars I usually buy the liquid black soap with shea butter and I love that. The bar soap seems more drying and ...",
                "reviewText": "This is my first purchase of this black soap. I usually buy the liquid black soap with shea butter and I love that. The bar soap seems more drying and makes kind of a mess in the shower. The lather is dark, just like the bar, and you need to rinse the tub/shower when you're done and clean up any drips. I don't think it stains the tub, but looks dirty if you don't wipe it up. I think I'll stick to the liquid when I run out of the bars. It does create a wonderful lather, though, and rinses clean, which is why I like black soap.UPDATE: 7/27/18My husband really likes this soap so I have decided to continue buying it. This time I am going to order the 24-pack! We both have oily skin on our faces and this soap seems to balance our skin out and remove the oiliness without stripping it. The \"dryness\" I thought I was experiencing on the rest of my body was just the squeaky clean feel, as my skin (other than my face) is usually dry but this seemed to make it less dry! Amazing how it balances out to just what your skin needs. I will continue to use the liquid black soap in our hand dispensers and as our nightly face soap, but this will be our shower soap from now on! I should add that neither of us have acne problems, but I have melasma and dark spots on my face and this is helping to lighten those dark spots that I thought I'd never get rid of! Very happy about that!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma Skye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNJ2SQJ7VQQUGGEV6ZFKD2N27HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22P22FS0RY257?ASIN=B00FYZS526",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2019",
                "reviewTitle": "5.0 out of 5 stars AMAZING",
                "reviewText": "While it is drying, it's the best soap that I've ever found for acne. Growing up, I really didn't have a lot of breakouts but with wearing makeup and not taking good care of my skin resulted in annoying breakouts and little dots that weren't exactly acne but definitely noticeable. I use this soap plus Just Nutritive Acne and Body acne was, and my skin is clear as can be. I ordered this last year on December 1st 2018, and I just now today have had to grab a 3rd bar. So they last a long time.I'm gonna list my skincare routine, maybe it'll help someone else out there. :)-I start with washing my face with both the Dudu Osun and the Just Nutritive Wash-Then with 2 cotton balls, I rub first ACV that's been diluted with water all over my face and then I follow with Simple's Micellar Water-I then take the Mario Badescu Spritz and Glow set of 3, sometimes I use all 3 sprays or I just use 1 spray-Then I moisturize. I use 2 lotions. I found a hemp moisturizing lotion at Walmart for 20 bucks. It's called Hempvana, and if you want to find it, depending on where you're from, it might be located right next to the registers where the \"As Seen On TV\" items are, or it might be on the lotion aisle. The stuff is amazing and it doesn't clog your pores. And then I use the Simple Rich Moisturizer. I even use both of the lotions on my eyelids and on my under eyes.While this may not work for everyone, it definitely works for me. But still, the Dudu Osun is the start of my skincare everyday and I'm always going to be buying it.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandria Mc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLKDBDQXI2ZL4HMHPIIF6VNXYKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R313A74SN9I8ZI?ASIN=B00FYZS526",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2019",
                "reviewTitle": "5.0 out of 5 stars Highly recommend!",
                "reviewText": "Great value for the price! It has solved all my acne problems, solved my boyfriends lingering stinky underarms problem, and makes us both feel cleaner than ever! The smell is kinda icky to me but not in a way that I can’t ignore, and for all the good things that it’s done for me I don’t care that I don’t love the smell! And plus after I rinse and dry off I smell pretty neutral/clean and not much like the soap smell. It is a tad drying to me in areas of my body that get super dry anyway like my hands or inner thighs, but it’s helped balance out the other parts of my body that were oily like my chest and face. I usually just follow up after my shower with a tiny bit of moisturizer on my dry spots and I’m perfectly clean feeling! I really do recommend this soap for everyone!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ash",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPPWU2VLJCGG3E42GUGC3F3F36Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MS88JBWNMFH2?ASIN=B00FYZS526",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Kinda dried my skin",
                "reviewText": "I bought this for my face. While I do feel like it helped with my hyperpigmentation a bit, it left my face a bit dry. I couldn’t use it everyday. Definitely way better to use on your body.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.50",
                "sellerName": "SimplyBeautiful",
                "sellerRating": "5"
            }
        ]
    }
}