{
    "remaining_requests": 22138,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Camay-Classic-Essence-Moisturize-Scented/dp/B08TNTD2ZL",
    "body": {
        "name": "Camay Classic Bar Soap, with Rose Essence, 4.98 Ounce (Pack of 6)",
        "price": "$5.30$5.30 ($0.01$0.01 / Ounce) $5.04$5.04 ($0.01$0.01 / Ounce)",
        "originalPrice": "",
        "rawPrice": 5.3,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Camay-Classic-Essence-Moisturize-Scented/dp/B08TNTD2ZL",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41F5Ox7wNKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41kFMx6 pZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31MOm5jhFIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HPUt3BGvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41o0-O51tQL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Camay",
            "link": "https://www.amazon.com/Camay/b/ref=bl_dp_s_web_3020126011?ie=UTF8&node=3020126011&field-lbr_brands_browse-bin=Camay"
        },
        "brand": "Camay",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2649,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 8 hrs 43 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Sunday, February 18. Order within 21 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Camay Classic will clean your skin without removing its essential moisture; it eliminates toxins present due to pollution or the daily hustle!",
            "It provides a pleasant sensation to your skin wonderfully scented. Our Classic Bar Soap Fragrance combines Romantic Rose Essence with a touch of sophistication, leaving your skin subtly scented.",
            "Camay is known for being gentle, leaving your skin clean, fresh and smooth; while Camay cleanses your skin, it infuses its signature scent on your body!",
            "Our moisturizing bar soap lasts longer and produces a beautiful, creamy lather. The distinctive scent in our soap complements your daily beauty routine!",
            "Camay Classic Bar Soap helps you feel your skin feeling soft, clean, refresh, and revitalized; our formula is suitable for all skin types!"
        ],
        "description": "We are in constant renewal, and why not think about the way our day begins or ends. Let pamper our body and our senses. Let us start our beauty routine with Camay soaps. The Camay Bath Soap Bar cleanses while softening your skin. It has a unique combination of ingredients effective in cleansing while leaving your skin feeling and smelling amazingly good. The Camay bar of soap can also help your skin look better. Why wait? Start today and make Camay your favorite product for your hygiene and daily beauty routine! Fall in love with the enchanting scent of Classic Camay, specially made with Hydra floral Oils and Rose Essence, for irresistibly soft and fragrant skin. Our soap has been distinguished from other soaps in its distinctive pink appearance and light floral scent. The Camay soap formula is based on natural moisturizers to prevent skin from drying out after washing. Camay Soap is a romantic floral bar soap with natural moisturizer for soft feeling, scented skin; it promotes healthy skin at all ages, contributing to a superior complexion.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Body",
                "link": "https://www.amazon.com/Body-Skin-Care-Products-Beauty/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060521"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Body-Cleansers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11056281"
            },
            {
                "name": "Soaps",
                "link": "https://www.amazon.com/Bath-Soaps/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11056341"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8.4 x 4.1 x 2.5 inches; 1 Pounds"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 850005911135"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Unilever International, Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B08TNTD2ZL"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,137 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #68 in Bath Soaps"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,649 ratings"
            },
            {
                "name": "Item Form",
                "value": "Bar Soap,Creamy"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Brand",
                "value": "Camay"
            },
            {
                "name": "Scent",
                "value": "Rose"
            },
            {
                "name": "Material Feature",
                "value": "Moisturizing"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ruth K. Mattox",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDVPPUV6S3XL3X5I65GFADZNKRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T7AXQK9XJ4L4?ASIN=B08TNTD2ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Light, refreshing scent",
                "reviewText": "I've used this first bar every day in the shower. It has a nice, soft scent, lathers well and makes me feel clean. Lasts for about 3-1/2 weeks even being used daily. Really a nice soap. haven't seen it in stores in years and will certainly be ordering it again when my supply runs low. A great product at a great price!!!!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam V.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ252ZUVAP74KMBTPZTXDNZO3JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O75RLUNVZ144?ASIN=B08TNTD2ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Camay Rose-scented Bath Soap",
                "reviewText": "This is a very nice bath soap. I read through many of these reviews before buying. Most of the reviews are positive, and I agree with most of them. Some of the negative reviews puzzle me. And it's not my intention to be derogatory toward anyone who wrote a negative review on this product. But this soap simply does NOT smell like Play-Doh, or a cheap gas station soap, in my opinion. Now, maybe this soap smells like that to those reviewers, but I have a pretty good sniffer, and it definitely has a floral scent. It smells like flowers, and the scent is reasonably strong, but not overpowering. If you check the ingredients, it claims to contain rose essence, along with essential oils from other flower species. So, it may not smell exactly like a real rose, but the scent is definitely floral and certainly not like Play-Doh. It is very pleasant. I also like the size of these bars: just shy of 5 ounces. Frankly, I'm tired of the little 3 to 4 ounces bars they have these days, and they call them \"bath bars\"! Growing up, we used to get these nice, large \"family-sized\" bars of Dial soap that were probably 6 or 7 ounces. Bath bars have clearly shrunk and the prices have inflated! Anyway, this soap comes in a good-sized bar that doesn't disolve in two showers, and it produces a nice amount of lather. Keep in mind, too, that how much lather ANY soap produces is affected by the hardness (i.e mineral content) of your water. My tap water has a medium hardness and most soap lathers well, but if your water has a higher mineral content (from a well, for example), then it's going to be harder and more difficult to get soap to lather. Finally, (I know. Sorry to make this review so long!), I'm not crazy that SO many products we buy in the U.S. these days comes from China. But at $5 or $6 for 6 bars, the price is hard to beat for a decent, pleasant-smelling bath soap! If for some reason I can't get good quality soap at a reasonable price that's made here in my country, then China it's got to be.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kitty Kat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3FY4KUXYG7O334USJGAO4DSXKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G8IWXUI5F820?ASIN=B08TNTD2ZL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Probably not the best for hard water",
                "reviewText": "Positives- has a classic, soft floral smell and the bar held up well in showerNegative- left a film in my hard water that gave me dry, itchy skin",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENPV6V726TYWFSLZWGQGVZXGZQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UFZZ6U4DIURP?ASIN=B08TNTD2ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Like old school soap",
                "reviewText": "I remember my Grandmother using Camay when I was little. I never thought I would use it as well as I’m a man. I’ve been really upset at bar soap manufacturers for their shrinking bar soaps from 5 oz down to 3.5 oz and charging much more for their product. When I saw this soap I had to at least try it just because of the price. It’s the largest bar soap at 5 oz for the cheapest price and you get 6 bars for under 6 bucks. That’s not great prices but it’s 100 percent better than what these soap manufacturers are charging for their products. These bars don’t smell like roses but have a pleasant floral scent and they lather nicely and rinse off without leaving any residue. I didn’t notice any dry skin as I get it pretty bad in the winter months. I would prefer either a deodorant or mens bar soap but at this price point it’s a no brainer. A bar soap kept at 5 oz at a decent price.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pueo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3OOYNRWWBHY3BOWJAJ6WMNLASA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R5Z3DMZLNXYC?ASIN=B08TNTD2ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2023",
                "reviewTitle": "5.0 out of 5 stars A Nostalgic Classic \"Soap of Beautiful Women\"",
                "reviewText": "I'm in my mid 70's and Camay soap has been around as long as I can remember. I recall my late mother used it in the '50s as it was aimed for women. Well I'm a guy and I love this soap. It has a light floral scent that I don't at all find feminine...and dissipates quickly. It's a larger 5 ounce bar that lathers well and is harder than most, so it stands up well to shower spray. I especially like that it rinses off clean without drying my skin...hate soaps and shower gels that leave a slippery film no matter how long I rinse.Not everything can endure the test of time, but generations for almost a century have used Camay. I remember the old wrapper with an ivory cameo (inspiration for \"Camay\"?) of a woman in profile. If they brought this wrapper back, it would complete the nostalgia perfectly.This is a great soap at a very great price...$5.30 for 6 large bars...less than 90 cents a bar! This will be my go-to shower bar from now.EDIT 1/2/24: After using this soap for over 3 months, I found it to be the longest lasting bar soap I've ever used. It's the slowest to wear (wash?) down...it just lasts and lasts. Combined with the fact that they are larger than most bath bars and still priced less than 90 cents, it's likely the best bar soap value on Amazon.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nail Nut",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ2635B6555SY7FSECKAMFSGMYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20Q95MKML2J7D?ASIN=B08TNTD2ZL",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2022",
                "reviewTitle": "3.0 out of 5 stars Not impressed",
                "reviewText": "Bought this because I love the smell of roses. This smells nothing like roses so don’t let the title and color pink fool you. I also think it is drying my skin out. On the third day of use my bar got a big crack down through the middle of the soap. Will not be buying this again. Do not recommend.Update: I threw all my other 5 bars in the trash after my son told me it smelled like old lady soap. That’s not the only reason though. Besides drying my skin I felt like it left a film on my body that would rinse off. Also the fact that my soap cracked in half. Went back to body wash. Dove body wash has a rose scent that smells pretty good. Tabu has a wonderful rose perfume. It smells so good and it’s not terribly expensive.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY5CX7BM5E2PNP27DOYKRJ7MTCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZP5HEP4F015K?ASIN=B08TNTD2ZL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Good soap",
                "reviewText": "I am using this soap for many years. It cleans good and not makes my skin dry at winter time. I recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMRTMZFTGVATNUJ4UTSDJJ7RXCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31M9NH35IDLIJ?ASIN=B08TNTD2ZL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Love it but smells awful",
                "reviewText": "Bought this expecting it to smell like roses. It does not smell anything like roses. More like a gas station bathroom soap. It’s really unpleasant. BUT it cleans well removing any body odor and makes my skin feel like no other soap ever has. i don’t understand how this soap makes my skin feel soo soft and moisturized when it’s not even touted as a moisturizer soap! Love the soap but please please please give it a new fragrance. Vanilla or coconut would be nice. Thankfully the smell leaves your body soon. Unfortunately your bathroom Will smell like it after you shower. The scent is fairly strong. I’m on the fence about buying again, only because it smells soooo bad.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}