{
    "remaining_requests": 45908,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Center-Cam-Middle-Screen-Connection-Conferencing/dp/B0B4TZWMML",
    "body": {
        "name": "Center Cam Middle-Screen Webcam - 1080p Plug & Play USB Webcam, Adjustable Webcam for Laptop and Desktop for Home Video Conferences",
        "price": "$119.97$107.61$119.97",
        "originalPrice": "$119.97",
        "rawPrice": 119.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Center-Cam-Middle-Screen-Connection-Conferencing/dp/B0B4TZWMML",
        "soldBy": {
            "sellerID": "AB6A4ZC8WZAR7",
            "name": "Center Cam",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AB6A4ZC8WZAR7&asin=B0B4TZWMML&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31SHAv8X31L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/510lnYPgxLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512-xQ0RRjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41w f5lZ2gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 riP50ZsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TXMK-4f-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Lc5vADKZL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9f297629-0e10-4111-b252-852bbcca91cf/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d1e53836-8991-4413-afe8-b36f0aeb3f21/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d37d826d-c757-48b0-8778-7eb7ead106db/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a9e0fee0-c5d0-4b91-b0b2-387b6addc6b4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0f40979-f06c-4708-9d75-98a569d44cdb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/283b7be5-fa1a-431b-b33f-4430e102fdbf/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/eccf79b4-9132-4262-9746-5b3b59f752d4/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91BS6aJM2XL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71hIrri8mQL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the CC CENTER CAM Store",
            "link": "https://www.amazon.com/stores/CenterCam/page/59F6EACE-40A5-4D6F-B6BE-746CECBC554A?ref_=ast_bln"
        },
        "brand": "CenterCam",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 135,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Tomorrow, February 13. Order within 14 hrs 4 mins",
            "FREE delivery Saturday, February 17. Order within 17 hrs 19 mins",
            "FREE pickup Saturday, February 17",
            "Or fastest Same-Day pickup Today 2 PM - 6 PM. Order within 2 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1080p Resolution and f2.1 Lens provide clear, crisp visuals - Works well in both low-light and normal lighting situations.",
            "30fps Provides Industry Standard Frame Rate - The Center Cam will hold up in a head-to-head with most any built-in webcam, as well as most major webcams on the market in terms of frame rate and visual quality.",
            "65HFOV Degree Aspect Ratio Puts the Focus On You - This provides a slightly narrower view than a typical webcam, placing you at a focal center.",
            "Mac, Windows, Android, and Linux OS Compatible - Integrates seamlessly with most any operating system you may use; just plug in and select the camera from the dropdown menu in your system or app settings!",
            "Eye-to-Eye Flextube - Highly Adjustable and Versatile - Gives you the opportunity to place the camera on the screen exactly where you want it, guaranteeing that your experience using Center Cam will be seamless and highly adjustable.",
            "USB 2.0/USB-C Compatibility Provides a Wide Variety of Compatibility - No matter what connector ports your computer has, we've got you covered!",
            "Adjustable Clip Mount Opens to 2\" - Fits most all laptop screens, and the vast majority of monitors. For screens thicker than 2\", purchase of a big clip is available at our website."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Audio & Video Accessories",
                "link": "https://www.amazon.com/Computer-Audio-Video-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548951011"
            },
            {
                "name": "Webcams & VoIP Equipment",
                "link": "https://www.amazon.com/Webcams-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172511"
            },
            {
                "name": "Webcams",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=23883894011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎CC CENTER CAM"
            },
            {
                "name": "Item Weight",
                "value": "‎11.3 ounces"
            },
            {
                "name": "Package Dimensions",
                "value": "‎9.33 x 8.27 x 2.13 inches"
            },
            {
                "name": "Color Name",
                "value": "‎Black"
            },
            {
                "name": "Special Features",
                "value": "‎Center Cam, Middle Screen Webcam"
            },
            {
                "name": "ASIN",
                "value": "B0B4TZWMML"
            },
            {
                "name": "Customer Reviews",
                "value": "3.6 3.6 out of 5 stars 135 ratings 3.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,083 in Unique Finds (See Top 100 in Unique Finds) #60 in Unique Electronics #69 in Webcams"
            },
            {
                "name": "Date First Available",
                "value": "June 22, 2022"
            },
            {
                "name": "Brand",
                "value": "CC CENTER CAM"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Flash Memory Type",
                "value": "SD"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Special Feature",
                "value": "Center Cam, Middle Screen Webcam"
            },
            {
                "name": "Screen Size",
                "value": "2 Inches"
            },
            {
                "name": "Camcorder type",
                "value": "Webcam"
            },
            {
                "name": "Included Components",
                "value": "Center Cam Assembly, Adjustable Clip Mount, and Lens Privacy Cover."
            },
            {
                "name": "Video Capture Resolution",
                "value": "1080p"
            },
            {
                "name": "Lens Type",
                "value": "Zoom"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Center Cam Story Center Cam began because of a problem. Inventor, Ian Foster was finishing his Master's internship as a social work counselor in March 2020. He and his fellow interns transitioned to remote-counseling using video-conferencing technology, but the young men they were working with were distracted by the tech. No one knew where to look. The rapport they had built fizzled out in spectacular fashion. Ian knew there had to be a better way. He realized that screen-edge webcams create a focal dilemma, where in order to create eye-contact, you had to ironically look away from the person you wanted to talk to. A search showed there wasn't a webcam on the market that was small enough to go in the middle of the screen, even if he could position it to create on screen eye-contact. Throughout 2020 he began developing prototypes and when he was satisfied with the quality of the camera, he launched Center Cam. The impetus for Center Cam has always been connections, and we're happy to share this new possibility with you!",
                "media_link": []
            },
            {
                "media_text": "Center Cam has 3 main components: - The Center Cam Assembly (Including Privacy Lens Cover) - The Adjustable Clip Mount - The USB-to-USB-C Adapter Center Cam is a 1080p, 30 fps camera with an f2.1 65HFOV degree aspect ratio lens, compatible with Mac, Windows, Android, and Linux OS softwares, connecting through either USB or USB-C. The Adjustable Clip Mount opens up to 2\", accommodating nearly any laptop & the majority of monitors. Rubber pads and a balanced clip pressure prevents the possibility of screen damage and scratching. This USB to USB-C adapter is is optimized for use with the Center Cam, and will fulfill all of your Center Cam-related USB-C adapting needs.",
                "media_link": []
            },
            {
                "media_text": "The picture/video quality looks oversaturated and washed out. We recommend non-directional, natural lighting for video calls. This reduces shadows and gives a look that represents colors well. As with other webcams, the video quality can be improved with additional lighting like Center Cam’s LED Ring Light. The video image is too dark, and the lighting looks too dim. We recommend non-directional, natural lighting for video calls. This reduces shadows and gives a look that represents colors well. As with other webcams, the video quality can be improved with additional lighting like Center Cam’s LED Ring Light. My camera isn’t working. Quick troubleshooting tips: Is the lens cap removed? Is your computer OS updated? Try restarting your computer. Check the Center Cam USB connection (try another USB port). Still not working? Please contact TechSupport_at_TheCenterCam_dot_com. My camera’s microphone isn’t working, or people can’t hear me or can’t hear me well. Center Cam comes with a built-in microphone, but it might not be best for the distance between you and where the camera is located. In that case, we recommend using a separate microphone positioned closer to your mouth to reduce background noise.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/boost/EMC/launchpad-logo._.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fafe9930-16b3-48d3-a32f-759b25e1301e.__CR222,0,3396,1392_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3bb20adf-e7f1-483e-8813-506d1a701957.__CR0,722,5625,2305_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/10ce62a3-a7f8-4513-a5e7-d4dd0461369c.__CR0,263,2048,839_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c71b8368-b899-4d4d-9894-ab7707d91de1.__CR0,263,2048,839_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "bE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGME5USANM3RJPDN7OCFXZWOF4XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R209TL3187AZ6X?ASIN=B0B4TZWMML",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent addition to video calls",
                "reviewText": "I really appreciate having this center cam to create a better user experience to the customer I speak with daily. My camera had excellent quality picture and placement. My only drawback is the flexible cable that requires odd manipulation to straighten the camera to your room. Even with that, I'm still very impressed with the quality this gave me.I personally have to sit further back from my screen to allow it to capture me in frame well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. SinjinV. Sinjin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHRH7FD5URR2SE77TMYJSJSHHGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZWZ2X095YU93?ASIN=B0B4TZWMML",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "1.0 out of 5 stars Whole lotta money for a whole lotta nothing.",
                "reviewText": "This camera is a great idea and it may work for many folks (I certainly hope so), however, for me it is a bust.The camera quality (materials and components) seem to be pretty sound. The flex arm that supports the camera has great adjustability and moves easily. I am able to set the camera at eye-level in the center of my 49\" curved monitor and the cable still reaches to my laptop that is setup on the side.Installation was easy; thread the cable through the clamp, set it where you want it, and plug it in.The quality of the picture is pretty bad. Not only ever so slightly fuzzy, but the brightness seems to be set on ultra-max or something. I can't install teh camera software on my work computer, which is the only place I need a web cam, so I cannot make adjustments there. Also, being bald doesn't really help me.I was able to get the brightness tolerable by setting my wallpaper to a black image (so it doesn't case much light), minimizing all windows (except for the Zoom window), closing the curtains in my office, shutting off the overhead light, and increasing soft light around my desk. This makes my work environment gloomy and unpleasant (for me) and I really don't want to go through these steps every time I need the camera. The attached image is after taking all f those steps. With my normal working environment I look like an over lit lightbulb.Yeah, definitely sending this one back.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31Duc1kqtiL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "PatInAZPatInAZ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKHBTPXPI7GCMQ6JBKEINXI3I3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17FP1BEP1EC5X?ASIN=B0B4TZWMML",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Camera is very small and still provides clear video!",
                "reviewText": "Background: I manage a team of 14 technical resources and I often facilitate internal courses that have up to 40 students. My main monitor is a 55\" 4K curved display. When I am conducting 1x1s with my team members or facilitating a class, it is important for me to be able to look directly at the camera. With my large main screen, a camera below the screen tends to look up my nose and a camera above my screen focuses on my nearly bald head. Neither of these is acceptable. I have tried a couple of standard webcams on narrow stands, but both the stand and the cameras blocked significant sections of my screen.Positives: The camera, itself, is very small. It is very close to the size of a US dime (and smaller than a US penny). The camera is not visually obtrusive. Even with my big monitor, I am able to position it near the middle of my screen. The video quality is very good. It works well in moderately low light and works exceptionally well with ample light. I do not use the built in camera mic, so I cannot speak to how that performs, but the camera, itself, has exceeded my expectations. Other small cameras that I have tried were larger than this one and tended to provide a \"fisheye\" distorted image. I use this camera dropped from the top of my monitor. The provided clip feels like it is secure (no tendency to unclip or move) and still does not hold so tightly that it impacts the screen.Constructive: The stiff cable sleeve that goes from the clamp to the camera is about a third the width of the camera, itself. This is actually more visually impactful than the camera, itself. A narrower sleeve would improve this. The camera comes with a 62 degree lens. This was a bit too narrow for my purposes. The 80 degree lens is an option that I wish that I could have chosen when ordering the camera (instead of getting the 62 degree default lens). Better still, it would be great to have the option of having both lenses included.Bottom line: If you are using a large screen and need to be able to both use that screen and look directly into a camera that is level with your face, this is absolutely the best solution out there. I highly recommend it.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61NX3qseOnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "SomeGUY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYN6F3IH5KMCN3SCNFANF6HSOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WJ7U76R9XFLE?ASIN=B0B4TZWMML",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Mostly good.",
                "reviewText": "Easy to use, installation is straightforward as well. Quality is mostly good, but I have had two issues crop up where the camera displayed some funky colors and behavior.Overall, happy with the purchase.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley L ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHW522ALDKEN4CL753QMYJPRJLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31PCA72G3FECR?ASIN=B0B4TZWMML",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Aiming for Eye Contact but Missing on Quality",
                "reviewText": "As someone who's on calls and conferences pretty often, I thought this little gadget might help me up my virtual communication game. The promise of eye contact in a virtual setting? Sign me up!I was really hoping this would be a game-changer. In theory, a middle-screen webcam sounds like an excellent solution to the whole \"looking off to the side\" problem we've all faced in virtual meetings. But unfortunately, my experience didn't quite live up to my expectations.The main issue I ran into was the video quality. It was... well, not great. The images it produced were grainy and the overall quality was low, which made my calls less than professional. It was like going back to the early 2000s when webcams were just starting to become a thing.Don't get me wrong, I love the concept - it's innovative and aims to tackle a genuine problem in our now virtual-centric world. But when it comes to execution, there's a lot left to be desired. It's a shame really because I was really rooting for it.So, in the end, while I loved the idea of seeming like I'm making real eye contact during my meetings, the quality issues of the Center Cam Webcam were a significant downside. I was looking for a balance of connection and quality, but it seems like this one leans heavily into connection at the cost of visual quality. It's a great concept, just not quite there yet in practice. Maybe with a few tweaks and improvements, it could be a real winner. Until then, the search continues!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 1, 2023",
                "reviewTitle": "Very disappointed",
                "reviewText": "It does what it says....it sits in the middle of the screen so you are looking directly at the camera. The camera quality I'd horrendous, I've reverted back to my old camera . If I hadn't have thrown the packaging away I would have sent it straight back. I will never use it. Complete waste of my money and very disappointed 😞",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Al",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 30, 2023",
                "reviewTitle": "Camera focus is not very good",
                "reviewText": "Carma focus is not very good. It's very blurry.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}