{
    "remaining_requests": 45702,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-Widescreen-Calling-Recording-Desktop/dp/B006JH8T3S",
    "body": {
        "name": "Logitech C920 - Discontinued by Manufacturer",
        "price": "$59.99",
        "originalPrice": "$99.99",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-Widescreen-Calling-Recording-Desktop/dp/B006JH8T3S",
        "soldBy": {
            "sellerID": "A1RPQ7V42WAEJD",
            "name": "MaxProductSales (SN Recorded)",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1RPQ7V42WAEJD&asin=B006JH8T3S&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "12",
        "stockDetail": "Only 12 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41A963lIowL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41exs27YR2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nNff9wNqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41geZbxRiHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xpc0Ez1EL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88bd02c2-6eb6-413d-9d22-985a36990dfe/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ec82b7d4-cc53-4d18-b5f3-600f1486e37b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/77bebab2-e0ae-421a-95e8-7df1f7305db7/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/030c66c5-f9bd-4c76-a1a6-53b225e48d10/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/13d1a34f-0548-4791-911b-1e6125303521/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7a0a478f-6b4a-4522-8910-03bf9becacd6/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61l-4Jxf+9L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1jvEpcroKS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "Sold by Saleprice and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 32149,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 20 - 27.",
            "Or fastest delivery February 14 - 20.",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "Full HD 1080p video calling (upto 1920 x 1080 pixels) with the latest version of Skype for Windows; Webcam with 5 foot cable",
            "720p HD video calling (upto 1280 x 720 pixels) with supported clients; Full HD video recording (upto 1920 x 1080 pixels). Max Resolution: 1080p/30fps 720p/30fps",
            "Video compression, Built in dual stereo mics with automatic noise reduction; Automatic low light correction, Tripod ready universal clip fits laptops, LCD or monitors",
            "Compatible with: Windows 7, Windows 8, Windows 10 or later; Works in USB Video Device Class (UVC) mode: Mac OS 10.10 or later (HD 720p on FaceTime for Mac or other supported video calling clients; Full HD 1080p video recording with QuickTime Player) Chrome OS,Android v 5.0 or above (with supported video calling clients),USB port,Internet connection"
        ],
        "description": "HD Pro Webcam C920 With the Logitech HD Pro Webcam C920, you’ll be seen in more clarity and detail than ever before with Full HD 1080p video calling—the highest quality available. Enjoy vibrant, true to life video clips that capture the smallest details. No time to talk? Send the people you care about a Full HD video clip. Advanced Compression Technology Faster, smoother, and compatible with more computers, H.264 encoding takes the pressure of compressing off your computer so you can enjoy quick uploads. Logitech Quality The C920 goes above and beyond the typical webcam, offering amazing clarity and detail thanks to the five element, Full HD glass lens and precisely tuned autofocus. Dual mics capture natural stereo sound for superior audio. Connect Like a Pro Whatever your network, connect with everyone you care about through Full HD 1080p on Skype, and fluid HD 720p on FaceTime for Mac. You can also make high quality video calls with Google Hangouts and nearly all other video calling clients. Two mics with automatic noise reduction allow friends, family, and clients to hear the real you. Compatibility & System Requirements Mac OS 10.10 or later (HD 720p on FaceTime for Mac or other supported video calling clients; Full HD 1080p video recording with QuickTime Player) Windows 7, Windows 8, Windows 10 or later Android v 5.0 or above Chrome OS Available USB port Internet connection Technical Specifications Full HD 1080p video calling (up to 1920 x 1080 pixels) with the latest version of Skype for Windows 720p HD video calling (up to 1280 x 720 pixels) with supported clients Full HD video recording (up to 1920 x 1080 pixels) H.264 video compression Full HD glass lens with precise autofocus Built in dual mics with automatic noise reduction Automatic low light correction Tripod ready universal clip fits laptops and LCD monitors Package Contents Webcam & 6 foot cable User documentation 2 year limited warranty",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Audio & Video Accessories",
                "link": "https://www.amazon.com/Computer-Audio-Video-Accessories/b?ie=UTF8&node=11548951011"
            },
            {
                "name": "Webcams & VoIP Equipment",
                "link": "https://www.amazon.com/Webcams-Computer-Add-Ons-Computers/b?ie=UTF8&node=172511"
            },
            {
                "name": "Webcams",
                "link": "https://www.amazon.com/b?ie=UTF8&node=23883894011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎3 Inches"
            },
            {
                "name": "Max Screen Resolution",
                "value": "‎FHD"
            },
            {
                "name": "Wireless Type",
                "value": "‎802.11a"
            },
            {
                "name": "National Stock Number",
                "value": "‎7050-01-615-7793"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Series",
                "value": "‎Logitech HD Pro Webcam C920 Video Calling and Recording 1080p Camera"
            },
            {
                "name": "Item model number",
                "value": "‎960-000764"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC, laptop"
            },
            {
                "name": "Item Weight",
                "value": "‎3.99 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎3.7 x 1.7 x 2.8 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎3.7 x 1.7 x 2.8 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Batteries",
                "value": "‎1 Lithium Polymer batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎Logitech"
            },
            {
                "name": "ASIN",
                "value": "‎B006JH8T3S"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎January 5, 2012"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 32,149 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,499 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #59 in Webcams #430 in Climate Pledge Friendly: Computers"
            },
            {
                "name": "Flash Memory Type",
                "value": "Micro SD"
            },
            {
                "name": "Screen Size",
                "value": "3 Inches"
            },
            {
                "name": "Photo Sensor Technology",
                "value": "BSI CMOS"
            },
            {
                "name": "Camcorder type",
                "value": "Webcam"
            },
            {
                "name": "Model Name",
                "value": "Logitech HD Pro Webcam C920 Video Calling and Recording 1080p Camera"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1080p"
            },
            {
                "name": "Effective Still Resolution",
                "value": "15 MP"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "D Wells-Kent",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBBPHLMAULC6N3NMH5GPY5ZA3YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R206WKAON57QE?ASIN=B006JH8T3S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2018",
                "reviewTitle": "5.0 out of 5 stars Going strong, two years later",
                "reviewText": "I'm puzzled when I read the negative reviews, about this camera not working with [x]; this is my 3rd Logitech camera, and I've never had a problem getting them to work when I've reviewed the system requirements and made sure I was on a compatible machine running appropriate software. I've split use of this camera between my Mac Mini and my Macbook Air, and had no problem getting it to work on either machine, nor have I had any issue switching back and forth between them. Picture and sound quality are excellent, and there's a free Logitech app in the App Store that lets me adjust the zoom, lighting etc that's also effective and simple to use.What's really blown me away is that it's also just as impressive now as it was almost two years ago, when I first started using it. I bought it in October 2016, to replace another Logitech camera; the cord connected to the back of the camera had frayed over time as a natural consequence of adjusting the angle over and over, making the older camera only work sporadically, and I fully expected something of that nature to happen to any camera I purchased. Not so with this one. The cord has held up, and not because I've babied it; it's just a sturdier design and tougher than the model it replaced. And while we now have Ultra HD/4K cameras and better, this 1080p is still respectable quality; it's not like the old \"high def\" TV a friend of mine has that's 12 years old but whose picture now looks grainy and not at all impressive compared to other newer TVs. I've used a projector as a monitor for my Mac Mini and broadcast the video from this camera onto a relatively big screen (bigger than any TV I've seen) and the picture quality is still impressive. (I hope I don't jinx myself!)I'm not accustomed to peripherals like this maintaining their function over time. Either the gadget breaks or it becomes obsolete because newer versions of it do the job so much better that it becomes a relic. Not so with this camera. I spent more than the current price (not quite double what it's going for now) and still really feel like I got my money's worth. If I needed another camera I would consider buying another one, it's that good. It's nice to not have One More Thing that needs to be replaced, that just keeps working.So yeah, take the time to look at the system requirements, and make sure you're using a Mac running the stated minimum version of MacOS (or better), or a PC running the stated minimum version of Windows (or better), and your processor is fast enough and you've got enough room on your hard drive and all that, before you buy it. If you're planning to use it for a specific app, perhaps you should check with that app's developers to be sure that it's compatible with it, but I can vouch for Mac versions of Skype, Zoom, ezTalks, and of course FaceTime and Photo Booth, as well as browser plugins for Firefox, Safari, Vivaldi and Opera: it works with all of them.I can't say enough good things about this camera. Unless you just absolutely have to have 4K/Ultra HD quality video, it's well worth the price it's currently going for, and I am happy to recommend it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2RIPEKEI6BHBNYKAJNGNX2SWHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDW6M1K6ED1P7?ASIN=B006JH8T3S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "5.0 out of 5 stars The Camera of Covid",
                "reviewText": "These things were hard to come by when the world was shut inside so I had to wait longer than I wanted to get one myself, but after owning it I understand why they were hard to come by. This webcam (for its extremely reasonable price) looks great, performs well, and is amazingly simple to set up. No frills or gimmicks, just a really good webcam.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO7EGY7ZVTYQFXEA5PVDIDSLYVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTDIF42EAPP0X?ASIN=B006JH8T3S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2016",
                "reviewTitle": "5.0 out of 5 stars Great webcam for the price!",
                "reviewText": "Purchased this webcam to use for video conferencing. I am using it with a Dell Precision M4800 Mobile Workstation laptop which did not come equipped with a webcam. The webcam is being used to record a class in a forty-seat classroom. I purchased it because I wanted the highest resolution available, and I am pleased to report this webcam does record video in full 1080p HD quality using the provided Logitech software.The webcam has a very nice weight to it, with no external controls, since the camera has a well-designed autofocusing system. No focus dial to fiddle with here! The base for the webcam is heavy enough that it can be placed on a flat surface such as a table or a desk without fear of it tipping over. Additionally, there is a rubber non-skid base on the bottom of the webcam that prevents it from sliding. The base folds open to provide a clamp so that the camera could be mounted on top of a monitor. There is adhesive backing inside the clamp to ensure the camera is securely mounted. I was pleasantly surprised to see a standard tripod mounting screw on the bottom of the camera. This could be very helpful if you would like to mount the camera somewhere where there is not a convenient mounting location. Since this feature is rarely seen on webcams, it was a very welcome addition. The permanently attached USB cable is about seven feet long, which should be plenty long enough to use in a desktop or mobile environment. I might add that this 7 foot length is much longer than the Microsoft webcam that I own for personal use.Setup took less than 5 minutes overall. Obviously, you have to have an available USB 2.0/3.0 port to plug the webcam into. It only required a few moments to install the driver from Logitech's website, and I was up and running. Though the webcam does come with a CD-ROM, I chose to download the latest version of the drivers to ensure I had the newest software. I always recommend you do this for any product, as the CD-ROM does not always include the latest software. The software for the webcam includes a surprisingly good software suite that runs smoothly, requires very little memory to run, and provides basic, easy-to-use image and video recording functionality.With the webcam up and running, I did a few test calls with Skype, and recorded a couple videos. The caller on the other end said the microphone sounded great, and the video quality was excellent, with only a little graininess visible. A few photos and recorded video from the webcam showed excellent detail, and surprisingly accurate colors, though perhaps a bit muted, as is normal for a webcam. Even with me standing at the back of the classroom approximately 25 feet away, the person on the other end said they could see my facial features and other details well. They could also still easily hear what I was saying.In regards to the videoconferencing abilities of this camera: the viewing angle on this camera could be wider, but it works very well in its intended use as a personal webcam. If using this for video conferencing in a conference room with many participants, a wider viewing angle may be desired, but there are very few webcams in this price range that will provide a wider viewing angle.Overall, I believe you would be hard-pressed to find a better webcam than the Logitech c920, at any price. It's full 1080p resolution capabilities, excellent photo and video quality, and surprisingly decent included software bundle make this a first-rate camera for videoconferencing, Skype video calls, or other uses. The tripod mount was a nice unexpected addition as well, allowing a lot of flexible mounting options.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abdull",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYBJG3DGHCDCOEYW2R7MSI3HV5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N1KLCV9TYV65?ASIN=B006JH8T3S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Great quality, easy setup",
                "reviewText": "The Logitech HD Pro Webcam C920 delivers crystal-clear visuals in high definition, making it perfect for video conferencing, live streaming, and content creation. The built-in autofocus and automatic light correction ensure a professional look in any lighting condition. Easy mounting and excellent audio quality make it a top-notch choice for all video-related tasks. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LTLee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 30, 2023",
                "reviewTitle": "Easy install and operation",
                "reviewText": "Installed and worked without much effort. Easily recognized by system and apps and worked together. Image quality very good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Henrique Rios",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 21, 2023",
                "reviewTitle": "Excelente custo benefício",
                "reviewText": "Gravação Full HD e produto de qualidade.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martha Ramos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 19, 2023",
                "reviewTitle": "Bueno, bonito y barato",
                "reviewText": "Me encantó la definición de la cámara, es muy útil y práctica. Excelente para videoconferencias y clases virtuales.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann Brady",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 31, 2023",
                "reviewTitle": "Great Camera",
                "reviewText": "As I podcast and Zoom link a lot I wanted a camera like this for my extended large screen. It took me a short while to understand the settings and learn how to mirror my image but it isn't that hard to work out once you get the hang of it. Slots and rests on top of the big HP screen in my small office and it gives me a lot better screen view and recording sound. I have also liked Logitech products and they have not failed again in this item.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sanjeev velappanSanjeev velappan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 30, 2023",
                "reviewTitle": "Good product",
                "reviewText": "It meet my expectations very good product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61zyfmnzieL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$69.95",
                "sellerName": "Signature Distributors",
                "sellerRating": "5"
            },
            {
                "price": "$69.99",
                "sellerName": "What a deal!",
                "sellerRating": "5"
            }
        ]
    }
}