{
    "remaining_requests": 45709,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Microsoft-cancelling-Microphone-Auto-Focus-Connectivity/dp/B0096KSBB0",
    "body": {
        "name": "Microsoft Q2F-00013 LifeCam Studio with built-in noise cancelling Microphone, Auto-Focus, Light Correction, USB Connectivity, for Microsoft Teams/Zoom, compatible with Windows 8/10/11/Mac",
        "price": "$59.39",
        "originalPrice": "$59.39",
        "rawPrice": 59.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Microsoft-cancelling-Microphone-Auto-Focus-Connectivity/dp/B0096KSBB0",
        "soldBy": {
            "sellerID": "A15YBCJT4UFKRS",
            "name": "Good Luck Bargains",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A15YBCJT4UFKRS&asin=B0096KSBB0&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "19",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415SLIbfUNL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A15eD84+t8S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1cuz5vJ6mS.pdf"
        },
        "byLineInfo": {
            "name": "Brand: Microsoft",
            "link": "https://www.amazon.com/Microsoft/b/ref=bl_dp_s_web_19823613011?ie=UTF8&node=19823613011&field-lbr_brands_browse-bin=Microsoft"
        },
        "brand": "Microsoft",
        "merchantInfo": "Ships from and sold by ÀLACART.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1423,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Wednesday, February 14. Order within 20 hrs 6 mins",
            "FREE delivery February 23 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1080p HD video recording",
            "720p HD video chat",
            "High precision glass element lens for sharp image quality",
            "TrueColor Technology with face tracking for bright and colorful video",
            "360° rotation"
        ],
        "description": "Product Description The closest to being there. Experience the amazing clarity and detail of HD video. With brilliant color and crystal-clear audio, this webcam with a 1080p HD widescreen sensor and high-precision optics brings your far-away friends and family closer than ever before. From the Manufacturer Do more things together when you're apart with Skype video calling The closest to being there. Experience the amazing clarity and detail of HD video. With brilliant color and crystal-clear audio, this webcam with a 1080p HD widescreen sensor and high-precision optics brings your far-away friends and family closer than ever before.Product Features:720p HD Widescreen Video720p sensor captures true HD quality video at up to 30 frames per second.Advanced High-Precision OpticsWith Auto Focus and high-precision glass element lens.Clear, High-quality VideoTrueColor Technology automatically delivers bright and colorful video, in virtually all lighting conditions. ClearFrame Technology provides smooth, detailed video.Smooth VideoClearFrame is an innovative technology that provides smooth, detailed video at any resolution- even in low-light conditions. ClearFrame improves video quality in two ways: ClearFrame features an image processing technology that helps to efficiently send the information from the webcam to your computer, reducing the \"ghosting\" effect.Video noise reduction software reduces image graininess-especially in low light-to keep your video sharp and clear. Find a Webcam That's Right for You: Webcam LifeCam HD-3000 LifeCam HD-5000 LifeCam HD-6000 for Notebooks LifeCam Cinema LifeCam Studio Product HD Video Good HD Video Mobile HD Video Better HD Video Best HD Video Video Resolution 720p (1280 x 720) 720p (1280 x 720) 720p (1280 x 720) 720p (1280 x 720) 1080p (1920 x 1080) Lens Plastic Element Lens Plastic Element Lens Plastic Element Lens Glass Element Lens Premium Glass Lens Microphone Digital Microphone Noise Reduction Microphone Noise Reduction Microphone Noise Reduction Microphone High-Fidelity Microphone TrueColor Technology Auto Focus 360° View Range ClearFrame Technology Aluminum Body Carrying Case Lens Cap System RequirementsWindows 7/Windows Vista/Windows XP with Service Pack 2 (SP2) or higher, excluding Windows XP Pro 64-bit;VGA video calling: Intel Dual-Core 1.6 GHz or higher, 1 GB of RAM; 720p HD recording: Intel Dual-Core 3.0 GHz or higher, 2GB of RAM1.5 GB free spaceUSB 2.0 Windows-compatible speakers or headphonesYou must accept License Terms for software download.Internet functions and Software Installation also require: Internet Explorer 7/8/9; 25 MB hard-drive space typically required. Internet access may be required for certain features. Local and/or long-distance telephone toll charges may apply.Software download required for full functionality of all features.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Audio & Video Accessories",
                "link": "https://www.amazon.com/Computer-Audio-Video-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548951011"
            },
            {
                "name": "Webcams & VoIP Equipment",
                "link": "https://www.amazon.com/Webcams-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=172511"
            },
            {
                "name": "Webcams",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_6?ie=UTF8&node=23883894011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎4 Inches"
            },
            {
                "name": "RAM",
                "value": "‎1"
            },
            {
                "name": "Brand",
                "value": "Microsoft"
            },
            {
                "name": "Series",
                "value": "‎MICROSOFT CORP/LICENSING"
            },
            {
                "name": "Item model number",
                "value": "‎MAIN-31891"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Item Weight",
                "value": "‎4.5 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎4.48 x 2.36 x 1.77 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎4.48 x 2.36 x 1.77 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Rear Webcam Resolution",
                "value": "‎1 MP"
            },
            {
                "name": "Manufacturer",
                "value": "‎Microsoft Input"
            },
            {
                "name": "ASIN",
                "value": "‎B0096KSBB0"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎September 6, 2012"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,423 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#216 in Webcams"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Flash Memory Type",
                "value": "SD"
            },
            {
                "name": "Special Feature",
                "value": "Low Light"
            },
            {
                "name": "Screen Size",
                "value": "4 Inches"
            },
            {
                "name": "Photo Sensor Technology",
                "value": "CCD"
            },
            {
                "name": "Camcorder type",
                "value": "Video Camera"
            },
            {
                "name": "Model Name",
                "value": "MICROSOFT CORP/LICENSING"
            },
            {
                "name": "Video Capture Resolution",
                "value": "1080p"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dncne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJGZYTZWMGIK4E4KOHSPUEAUIHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28AQCK729I3YY?ASIN=B0096KSBB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Solid!",
                "reviewText": "This camera has worked well on my personal computer, as well as my work computer. Skype, Zoom, and Teams tested. Picture is clear and focused. No one has ever asked me to repeat what I said, or asked me to speak up. Though this camera is not the most streamline of devices, I like that it has a cap to cover the camera when you don’t want to be onscreen, and that you can easily just turn the camera to point it wherever you want. Have considered buying a second one of these just to leave on my workstation at the office.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Lizarraga",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOCQGN7FV6TRRAP3Y457CSFTK2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD0QU2UEESM7E?ASIN=B0096KSBB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Crisp, Clear, Dependable",
                "reviewText": "This is my second camera in this style. My first camera worked for over 10 years. Easy to use, highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellis D. Rodriguez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGDOLTCCVSTIDTXDSSSOFXI5YNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8RBIX7Z9SXLD?ASIN=B0096KSBB0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2013",
                "reviewTitle": "5.0 out of 5 stars great little webcam",
                "reviewText": "Received the camera today. Nice looking and seems to be well built. Installed Microsoft webcam software on my Windows 8 PC.. Wouldn't even show on my desk top. When I plugged in the camera into the USB port, it would flash twice and the driver would load properly. but no picture. uninstalled the microsoft software and installed about three other webcam software. NADA. Still no picture and the camera would not turn on. I was believing I had a DOA on my hand. Then I remember someone mentioned ArcSoft Webcam Companion 4. Downloaded it and installed it. Webcam came on and the picture came out in High Definition. It also can be shown in 3d. I used one of those RED/GREEN 3d glasses made of card board and the video was actually in three dimensional. I went and purchased ArcSoft because it was the only software that would work on my Windows 8 x64 bit computer. I can see every pore on my face with this camera. I went from 640 x 480 to 1920 x 1080 and the difference was instantly noticeable. This camera does work in HD mode. The sound is very good. Gave it four stars because of the incompatibility of the software. Good thing the other software showed me it was a software problem and not hardware problem. I do recommend this webcam. I will update later if I encounter any problems with the webcam.Update: July 2017 - This computer camera from Microsoft has been working great with great sound from the Microphone. Since Updating to Windows 10 Pro, Every camera software including the Windows camera apps that came with Windows 10 Pro works great. In fact, Now Arcsoft Webcam 4 doesn't work in Windows 10 Pro and I needed to uninstall it. But as mentioned earlier, I don't need it anymore to run my webcam. Plenty of webcam software all work with this camera. Changed it to five stars.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erik Gordon Bainbridge",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGBGZWCPL4ECEAJAS2HNKBKOD7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EPUFUWSQHT1O?ASIN=B0096KSBB0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2013",
                "reviewTitle": "4.0 out of 5 stars Good image quality but doesn't record 1080p and needs a fast CPU",
                "reviewText": "This is a rewrite of a review I previously wrote about both the Logitech C920 and Microsoft Lifecam Studio 1080p HD. I've raised my rating from three to four stars for both webcams. They are both very good units, but both have significant flaws that make it impossible to give either of them five stars.I bought these webcams for a video project, so all of my testing has been for video capture and editing. I haven't tested still images or Skype.At the end of the review, I also will give some information about four software packages that are available - one of them free - for recording video with these webcams: Active Webcam, Arcsoft's Webcam Companion, CyberLink's Youcam, and Virtual Dub.I'm rewritten this review after using the Logitech for a month and the Microsoft for three weeks. I ordered the Logitech first. I've been buying Logitech products since the 1990s and until now was never disappointed. This time I was so dissatisfied with it that I ordered the Microsoft, only to be even more disappointed.It's not that they are terrible. They are both excellent in many ways. However I expect more from a 1080p unit than from an ordinary webcam, especially considering the glowing reviews they receive.One thing I love about both webcams is the tripod mount. For my video project, I needed to mount the webcam on a tripod, so this was a requirement. It will also be useful in future shooting. Both webcams will work with any standard tripod. I used a Sony VCT-R100 tripod for my project.Microsoft's most obvious flaw is advertising this as a 1080p webcam without mentioning that it only does 1080p still images, not recorded video. If you use some non-Microsoft software (Virtual Dub and Cyberlink's You Cam), it will record at 1080p, but the quality is poor if there's any movement in the scene.On the other hand, the Logitech doesn't come off well either. Its most obvious flaw is in its video compression, which results in major video artifacts under certain conditions. If you don't know what a video artifact is, it basically makes the scene look like something out of science fiction. The strange thing is that the recorded video plays with no problem in a video player, such as Windows Media Player, but when I try to edit it, the artifacts appear. I've read reports by other owners who say it also happens with Skype. I haven't tried these webcams with Skype, so I have no experience with this.I did find a way around the problem with Premiere Pro, but the easiest way to avoid the problem in recorded video is simply to use non-Logitech software for recording video. I tried Virtual Dub, Arcsoft's Web Companion, and Cyberlink's You Cam. All of them recorded video from the Logitech with no artifacts.One other recording issue is video format. If you are buying the webcam for recorded video on a Mac or Linux, or if you want to edit the video, you may find the Logitech the better choice. The .wmv format is a Windows format, so anyone on a different system will probably have to convert it to a different format to use it, and even on Windows, editing it can be a problem, but the Microsoft records only in .wmv. The Logitech records 1080p and 720p as .mp4 and 480p and 360p video as .wmvThe Logitech's other problem is color balance, which is disappointing. The Microsoft's color balance is generally much better. I gave up completely on using the Logitech's automatic color and set it manually every time.The Microsoft is much more demanding of your CPU. Unless you have a fast computer, you probably won't get z good HD recording with it. I have a quad core 3.0GHZ i7 with 24GB of RAM, but the Microsoft could record only 13.1fps at 720p and 6.4fps at 1080p, using Virtual Dub. The Logitech did much better, averaging exactly 30.0fps at both 720p and 1080p. Using the Windows 7 Performance Monitor, I found that the CPU usage while recording ranged from about 40% to 60% for the Microsoft but only about 15% to 35% for the Logitech.I also tried it on my 1.6GHz Samsung netbook. The Logitech recorded better than I expected, though it you wouldn't want to use it on any scene with movement in it. The Microsoft's greater demands on the CPU made it completely unacceptable for recording 720p video on the netbook.To my eyes the Microsoft delivers a much sharper image (a purely subjective measurement) than the Logitech.If you transport your webcam a lot, then the recessed lens on the Microsoft offers much more protection than the Logitech lens, which has no protection at all. The Microsoft comes with a rubber lens cap, but it's so loose that it's completely useless. The recessed lens is an excellent design feature, however. The Microsoft is also much smaller, which could be useful if you move it around a lot.The Microsoft software won't let you change the microphone on the Microsoft, but the Logitech software does allow it. The Microsoft microphone is located on the top rear of the webcam, which I expected would be a terrible location, but in practice it's better than I expected. The Logitech microphone is in front, where it should be, and does produce better audio (I was sitting about two feet from the webcams for the tests). The Logitech is stereo and the Microsoft is mono. If you use other software for recording, such as Virtual Dub, Arcsoft's Web Companion, and Cyberlink's You Cam, you can specify different audio inputs.The autofocus isn't great on either unit, but Logitech's is better than Microsoft's.Logitech's software allows you to specify a folder for storing videos and photos, but Microsoft's does not. On Windows 7, it stores everything in My Pictures. Microsoft creates .wmv video files and Logitech creates .mp4 files. Logitech offers three levels of video and three levels of audio quality. Microsoft doesn't give a choice. Logitech allows recording at four video resolutions: 360p, 480p, 720p, and 1080p. Microsoft allows recording at seven video resolutions (eight for photographs): 160x120, 320x240, 424x240, 640x360, 800x448, 960x544, and 1280x720.Zoom controls on both tend to be erratic in how they operate and often don't work at all.Microsoft tilts and pans, rotating a full 360 degrees. The Logitech can only tilt up and down. If you want to pan, you need a tripod.The sad thing is that I actually prefer both the color balance and the zoom & pan controls on my old Kodak S101 640x480 webcam, though the Microsoft and Logitech both are superior in image quality, even at low resolutions equivalent to the Kodak's.The Microsoft developed some intermittent problems towards the end. The previously excellent automatic exposure sometimes didn't work properly, and my computer occasionally gave me a warning that it didn't recognize it as a USB device.My bottom line:==============I only needed one webcam for my project. I originally disliked the Logitech so much that I ordered the Microsoft and intended returning the Logitech, only to be even more disappointed by the Microsoft. I ended up using the Logitech for my project and I am returning the Microsoft. It was frustrating, because in many ways I prefer the Microsoft, but recording only 720p video and having higher CPU requirements made it less useful for me. I returned it because of the intermittent problems I experienced, but would have returned it anyway because of the other issues.Now for the software. If you buy the Logitech and you plan to do 720p or 1080p video recording, then you'll definitely want to look into alternative software because the Logitech's produces video with unacceptable artifacts that you don't see while watching them, but become very apparent if you edit the video, at least with Adobe Premiere Pro.Virtual Dub (free)=================At first this one turned me off, but after I played with it for a few weeks and watched a YouTube video on configuring it, I fell in love with it. If you are serious about video, this is the one to get. It's loaded with options, but it's not the most user-friendly software available. However after you get used to it, the others are frustratingly limited in comparison. However it's definitely not for casual users.Cyberlink You Cam ($35)======================If you're going to edit your video or if you're on a Mac or Linux machine, this is the one you want to get because records .avi files. It's a great choice for nontechnical people who don't want to deal with Virtual Dub's nonintuitive user interfaceArcsoft Webcam Companion 4 ($35)==============================This is a nice package with just one problem: it only records .wmv files. This is a Windows format, so you'll need to convert it to use on a Mac or Linux machine, and you may have problems editing it.Active WebCam ($29)=================Initially this is the one I thought I'd like, but I was never actually able to test it because it was constantly freezing up. If you are using multiple webcams for surveillance, you should look into it. It does get good reviews. However the user interface leaves a lot to be desired, but because of the freezing up I never had the opportunity to give it a real test.",
                "reviewVotes": "180 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Flora",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 27, 2023",
                "reviewTitle": "Boa qualidade",
                "reviewText": "Excelente qualidade",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 22, 2023",
                "reviewTitle": "Se ve excelente.",
                "reviewText": "Me gusto que se ve realmente genial, solo el detalle que no me agrado es que se desenfoca a cada rato.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bruno Longpré",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 27, 2020",
                "reviewTitle": "WOW on all counts.",
                "reviewText": "WOW on all counts. even the design is awesome.WORKS RIGHT OUT OF THE BOX, with Windows 10 (1909) and (2004). Works with all other versions down to windows vista.Image quality and sound quality very good. Autofocus maybe slow some times.It is now sold at a \"COVID-Price\" witch is twice the usual pre-COVID price.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Thiruppathi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 25, 2020",
                "reviewTitle": "Clarity on Zooming",
                "reviewText": "It was offered to an Institute for online training/meeting and they appreciated a lot about the Camera performance.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Malcolm Bush",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 29, 2018",
                "reviewTitle": "Seems a very good camera.",
                "reviewText": "I have had my old webcam camera for a long time; the old one was much cheaper, but there was less stuff on offer then. The old one itself replaced a really old one. Necnology has move on again and this is much better. I am old now and will not need to update my webcam again; I've made three goodbye videos which can be played after I have past away, if anyone wants to look at them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$59.99",
                "sellerName": "Blizzdeal",
                "sellerRating": "5"
            },
            {
                "price": "$64.99",
                "sellerName": "6ave",
                "sellerRating": "5"
            },
            {
                "price": "$69.99",
                "sellerName": "MaxProductSales (SN Recorded)",
                "sellerRating": "4.5"
            }
        ]
    }
}