{
    "remaining_requests": 36440,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/yoyomax-Ergonomic-Office-Chair-ComputerChair/dp/B0CRTL3L4Q",
    "body": {
        "name": "yoyomax Ergonomic Office Chair, High Back GamingChair for Big and Tall People, Adjustable Headrest/Armrests Reclining Comfy Home OfficeChair Lumbar Support Breathable Mesh ComputerChair, Black",
        "price": "$112.91",
        "originalPrice": "",
        "rawPrice": 112.91,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/yoyomax-Ergonomic-Office-Chair-ComputerChair/dp/B0CRTL3L4Q",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41zDpVAIVHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41909L41DiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KXsRCzxRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512JnR-c tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418vpKCHPwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511zOUce1ML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xfaO1S53L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the yoyomax Store",
            "link": "https://www.amazon.com/stores/yoyomax/page/D74DDCF7-127E-4777-A9A5-6E29CCCC5101?ref_=ast_bln"
        },
        "brand": "yoyomax",
        "merchantInfo": "",
        "customerReview": "5.0 out of 5 stars",
        "customerReviewCount": 4,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 10 hrs 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🌟【SPINE-SUPPORTING】 Experience optimal support for your lower back, shoulders, and neck with the adjustable backrest of our ergonomic office chair. The S-shape design ensures your spine stays properly aligned, while the adjustable headrest prevents forward tipping, reducing pain. Invest in your health, comfort, and productivity with the YOYOMAX home office chair.",
            "🌟【PERSONALIZED】Adjust the seat height of our ergonomic chair from 44.5'' to 48.4'' to cater to various body sizes. During breaks, switch to the rest rocking mode by adjusting the back lean. Our clear pictures and videos guide you on adjusting the height and backrest, ensuring a personalized experience.",
            "🌟【STURDY SUPPORT】Designed with a big Y-shaped frame and 5MM iron components, our desk chair supports up to 330lbs. BIFMA and SGS certified, it ensures safety. The 5-star base, gas lift, and silent smooth rolling wheels enhance stability and extend the life of this big and tall office chair.",
            "🌟【VERSATILE WORKSPACE】Create the most comfortable office, study, or meeting space with the YOYOMAX ergonomic desk chair. Say goodbye to office chairs that cause back pain. Choose our lumbar support office chair for a workspace that prioritizes your well-being.",
            "🌟【EASY INSTALLATION】Setting up your chair is a breeze with all the hardware and tools provided. Follow the manual for a 15 minute assembly or watch our installation video on the product page for a quick and hassle-free setup. Your comfort is just moments away."
        ],
        "description": "Elevate your workspace with the YOYOMAX Ergonomic Office Chair. Its adjustable back ensures optimal spine support, while customizable features cater to your comfort. Built with a robust structure supporting up to 330lbs, this chair guarantees stability. Create a versatile and comfortable workspace with ease of installation. Invest in your well-being and productivity with this lumbar support office chair.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Chairs",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18682064011"
            },
            {
                "name": "Home Office Desk Chairs",
                "link": "https://www.amazon.com/Home-Office-Desk-Chairs-Furniture/b?ie=UTF8&node=3733721"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "yoyomax"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "26\"D x 48.4\"W x 26\"H"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic"
            },
            {
                "name": "Unit Count",
                "value": "‎1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "‎Office, Drafting, Reading, Relaxing"
            },
            {
                "name": "Pattern",
                "value": "‎Solid"
            },
            {
                "name": "Included Components",
                "value": "‎Arm Pad, Cushion, Caster"
            },
            {
                "name": "Shape",
                "value": "‎S-Shape"
            },
            {
                "name": "Model Name",
                "value": "‎Ergonomic Office Chair, High Back GamingChair for Big and Tall People, Adjustable Headrest/Armrests Reclining Comfy Home OfficeChair Lumbar Support"
            },
            {
                "name": "Arm Style",
                "value": "‎With arms"
            },
            {
                "name": "Surface Recommendation",
                "value": "‎Hard Floor"
            },
            {
                "name": "Form Factor",
                "value": "‎Recliner"
            },
            {
                "name": "Item Weight",
                "value": "‎26.7 pounds"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎Ergonomic Office Chair"
            },
            {
                "name": "ASIN",
                "value": "B0CRTL3L4Q"
            },
            {
                "name": "Customer Reviews",
                "value": "5.0 5.0 out of 5 stars 4 ratings 5.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#415,533 in Home & Kitchen (See Top 100 in Home & Kitchen) #878 in Home Office Desk Chairs"
            },
            {
                "name": "Date First Available",
                "value": "January 9, 2024"
            },
            {
                "name": "Material Polypropylene",
                "value": "Frame Material Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Vince LeeVince Lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW5UWCHNQ4YXHOVZE35VDSH6FPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PEOBYVDBIXV6?ASIN=B0CRTL3L4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfortable chair and afforable",
                "reviewText": "As a tall and hard-working student, convenience and pleasant utilities are what I need the most. My old chair was short, small, and hard to get around with. To ensure that I could work for long periods with efficiency, I needed something that would comfort my body to rest. This chair is the perfect implement for me to get things done. It was fast and easy to build and gave instant satisfaction. It has a well-rounded build with smooth fabric that is wrapped to keep the chair durable. I recommend this chair for the taller ones working diligently and needing the most restful chair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61KuuDWI-kL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wzWayb0pL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose BJose B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUFOUJFTIAZRS3BDO7735N5RLPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTL9WBLTIXSQM?ASIN=B0CRTL3L4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars A Perfect Blend of Comfort and Convenience",
                "reviewText": "The media could not be loaded. I am absolutely thrilled with my purchase of this ergonomic office Chair. From the moment I opened the box, I knew I was in for a treat.Let's start with comfort – this chair is an absolute game-changer. The mesh headrest provides unparalleled support for my neck and shoulders, while the mesh backrest keeps me cool and comfortable even during the longest work sessions. And let's not forget about the cushioned seating – it's like sitting on a cloud! I can honestly say that this chair has transformed my workday into a much more pleasant and comfortable experience.Assembly was a breeze, which was a pleasant surprise. The instructions were clear and easy to follow, and I had the chair put together in no time. It's refreshing to encounter a product that doesn't require hours of frustration and confusion to assemble.Now, let's talk about gliding smoothly on carpet – this chair delivers on its promise. Whether I'm rolling from my desk to the printer or just adjusting my position, the wheels move effortlessly across the carpet without any resistance or jolting movements. It's a small detail, but it makes a world of difference in my day-to-day workflow.One of the most impressive aspects of this purchase was that the chair arrived without any issues and without any damage. Everything was carefully packaged and arrived in perfect condition, which is a testament to the quality and care that went into the manufacturing and shipping process.In conclusion, I couldn't be happier with this office chair. It's incredibly comfortable, a breeze to assemble, glides smoothly on the carpet, and arrived without any issues. If you're in the market for a new office chair, look no further – this one is a winner in every respect!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717hRREcrCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71A0ll+tFVL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71covoLHCfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71s++dGbpyL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/98f76024-fbb3-4954-84db-1bb527a9c7f4/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "MGMG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH63TPAIRJOLWZSZKGSCJXFU5YTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33EZSIW7FRE5N?ASIN=B0CRTL3L4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Ergonomic Chair!",
                "reviewText": "The media could not be loaded. The ergonomic black office chair stands as a testament to both style and functionality in the realm of office furniture. Crafted with meticulous attention to detail, its sleek black design exudes a sense of professionalism while seamlessly blending into any modern workspace aesthetic. However, its true allure lies in its ergonomic features, meticulously engineered to prioritize the comfort and well-being of its user.Constructed with a focus on ergonomics, this chair offers customizable lumbar support, ensuring optimal spinal alignment and alleviating strain on the lower back during extended periods of sitting. The cushioned seat provides ample padding, promoting comfort without sacrificing support. Moreover, its adjustable armrests cater to individual preferences, allowing users to find their ideal arm positioning for enhanced comfort and productivity.The chair's swivel and tilt mechanisms offer fluid movement, enabling users to effortlessly pivot and recline as needed, facilitating seamless transitions between tasks while maintaining proper posture. Whether engaging in focused work or collaborative meetings, this chair adapts to the user's needs, fostering a conducive environment for productivity.Constructed from high-quality materials, including durable upholstery and a robust frame, this chair is built to withstand the rigors of daily use, ensuring longevity and reliability. Its sturdy construction instills confidence, providing users with a dependable seating solution for years to come.In conclusion, the ergonomic black office chair transcends mere functionality, embodying a harmonious blend of comfort, style, and durability. With its thoughtful design and ergonomic features, it offers a superior seating experience, making it an indispensable asset for any modern workspace striving to prioritize the well-being and productivity of its occupants.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81N38MumPkL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81W7GTjS9FL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81bvcmEO9UL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a48f236-e9ea-4f2e-a2de-32cbc33bbc46/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Justin Y.Justin Y.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAMCK62XHD4PRV5X3ROZWCTG3ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GU33KBRV1O8B?ASIN=B0CRTL3L4Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfortable",
                "reviewText": "The media could not be loaded. I was looking for a new desk chair for work since my old one broke after years of use. I was specifically looking for one with head support, back support, arm rests and this one fit the bill. I like that you can adjust the head rest up and down and also tilt it to match whatever posture you like. I also like the adjustable arm rests, you can fold them away if you choose. The wheels roll very smoothly and the seat is comfortable. I feel that my posture has improved since using this chair for only a few days. The backing is firm and stiff and helps my lower back during long periods of work on the computer.Overall, I recommend this chair for an affordable home office set up. The chair was easy to put together and the instructions were clear. Total set up time was maybe around 30 minutes. The front part of the chair is labeled clearly which really helped since I put together another chair recently and was halfway done before I realized I installed the seat incorrectly. The screws came nicely sorted and it was easy to tell which ones we were supposed to use for each step of the instructions. No screwdriver was required as they include the L shaped screw tool. There were also some extra screws in case one was defective or you needed an extra for some reason. I put this chair together by myself so it should be fairly simple to build.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/610-5c2OUvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71D45bgdx3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mIK2ou+3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vWRroOPOL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/760d78a2-1e52-40b5-b980-96973ede4278/default.vertical.jobtemplate.mp4.480.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}