{
    "remaining_requests": 36584,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Office-Chair-Ergonomic-Executive-Adjustable/dp/B0C13W5LKH",
    "body": {
        "name": "JHK Leather Office Chair with Flip Up Arms, Executive High Back Big and Tall Desk Chairs with Ergonomic Lumbar Support, Adjustable Height,Wheels, Soft Padded, Cream",
        "price": "$112.99",
        "originalPrice": "$119.99",
        "rawPrice": 112.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Office-Chair-Ergonomic-Executive-Adjustable/dp/B0C13W5LKH",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CVHH26KY"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C13W4YY5",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41j35CQ-P1L._SS36_.jpg"
            },
            {
                "asin": "B0C13Z1FZH",
                "variationName": "Color",
                "variationValue": "Brown",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ia+cmpMaL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Classic Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/412ggmvIBVL._SS36_.jpg"
            },
            {
                "asin": "B0C13W5LKH",
                "variationName": "Color",
                "variationValue": "Cream",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41U6LQMmZ1L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41U6LQMmZ1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51WNjootEwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41s4p nbgGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jjIlj 2yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rFaVB9HlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pjPYE3nZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fUP8uUhRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: JHK",
            "link": "https://www.amazon.com/JHK/b/ref=bl_dp_s_web_121156309011?ie=UTF8&node=121156309011&field-lbr_brands_browse-bin=JHK"
        },
        "brand": "JHK",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 749,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23. Order within 19 hrs 39 mins",
            "FREE delivery Tuesday, February 20. Order within 19 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The executive desk chair is upholstered in carefully selected waterproof and stain-resistant PU material, making it easy to wipe clean. The high density sponge padding gives it a natural leather look for a sophisticated appearance.",
            "Functional Design: This adjustable high-back computer chair is perfect for both home and office workspaces. With segmented padding on the seat and back, it provides optimal comfort. The lumbar zone expands and contracts as you lean forward and back, while the flip-up armrests offer flexibility and a greater range of motion.",
            "Ergonomic Support: The chair's armrests can be flipped to adjust your relaxed posture, with a length of 15\" and a seat-to-armrest height of 9.4\". Its thickly contoured upholstered design provides excellent support for the waist, ensuring continuous comfort during long hours of gaming or work.",
            "High-Quality Build: Equipped with 360-degree rotatable wheels, this chair glides smoothly on any surface. It is exceptionally sturdy and stable, capable of supporting up to 300 pounds of weight, making it a durable and long-lasting office accessory.",
            "Easy Installation: The office chair comes with all the necessary hardware and tools for quick and convenient installation. Simply follow the provided instructions to complete the setup within 20 minutes."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Chairs",
                "link": "https://www.amazon.com/b?ie=UTF8&node=18682064011"
            },
            {
                "name": "Home Office Desk Chairs",
                "link": "https://www.amazon.com/Home-Office-Desk-Chairs-Furniture/b?ie=UTF8&node=3733721"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "JHK"
            },
            {
                "name": "Color",
                "value": "Cream"
            },
            {
                "name": "Product Dimensions",
                "value": "28.54\"D x 28.94\"W x 43.31\"H"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "Upholstered Leather, Adjustable Height, Arm Rest, Ergonomic, Foldable"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe Clean"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "275 Pounds"
            },
            {
                "name": "Style",
                "value": "Flip-up Armrest"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Finish Type",
                "value": "Brushed"
            },
            {
                "name": "Room Type",
                "value": "Office"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Included Components",
                "value": "Armrest, Seat Cushion, Installation tool, Instruction, Caster"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Model Name",
                "value": "Ergonomic Adjustable Computer Desk Chairs"
            },
            {
                "name": "Arm Style",
                "value": "With arms"
            },
            {
                "name": "Surface Recommendation",
                "value": "Hard Floor"
            },
            {
                "name": "Seat Back Interior Height",
                "value": "22.63 Inches"
            },
            {
                "name": "Form Factor",
                "value": "Metal"
            },
            {
                "name": "Furniture Finish",
                "value": "Leather"
            },
            {
                "name": "Seat Height",
                "value": "21.85 Inches"
            },
            {
                "name": "Seat Depth",
                "value": "19.29 inches"
            },
            {
                "name": "Fill Material",
                "value": "Sponge"
            },
            {
                "name": "Arm Height",
                "value": "31 Inches"
            },
            {
                "name": "Item Weight",
                "value": "25.8 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "JHK"
            },
            {
                "name": "ASIN",
                "value": "B0C13W5LKH"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "BXC657"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 749 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21,399 in Home & Kitchen (See Top 100 in Home & Kitchen) #59 in Home Office Desk Chairs"
            },
            {
                "name": "Date First Available",
                "value": "March 31, 2023"
            },
            {
                "name": "Material Leather",
                "value": "Item Weight 25.8 Pounds"
            },
            {
                "name": "Frame Material Metal",
                "value": "Seat Material Type Faux Leather"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "What is the height from the floor to the top of the seat cushion? The lowest height from the floor to the top of the seat cushion is 17.32 inches and the highest is 21.85 inches. What is the weight capacity? 275lbs What's the return policy? The return policy is same as all amazon items. It can be returned within 30 days of receipt. Does this include instructions? Yes. It comes with an instruction. Alternatively, you can view the electronic version of the manual on our details page.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e960db3-e942-4aa0-a5f0-1a7c567607e4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29ea063f-4a3c-4265-a2d9-6016c2ff20ce.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fc9a1d59-4346-4cd9-8823-a1b38bd0d8af.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/93a2b38e-ca8d-4341-a3a0-43e9de972f91.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74349030-be60-4af7-b2c4-e54bf1643943.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2e19b5ff-2a45-4c08-9da3-8fbfda45157d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Julie R",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNML2QECTKVUBMZ32XSA4GNYHKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FK6N2V6U57R?ASIN=B0C13W5LKH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazingly comfortable, sturdy, great chair!",
                "reviewText": "This chair looks great and feels even better.Pros: Looks like a high quality executive chair. Very sturdy, feels like it will hold up well for a plus-size user (I've used it daily for a week now with no concerns). Wide seat with plenty of room, even room to spare! Arms flip up with little resistance (but enough that they will stay in place). This is usually a requirement for me because my hips often require a little more room to spread - not a problem with this chair. In fact, the seat is too wide to fit in the small space of the sewing desk I am currently using, regardless of arm rests. Next stop is a new desk that actually has some leg room. At that point, I may be grateful for arm rests that flip up. Also, I will use this chair in my sewing room, and there I know that I will need the ability to lift the arm rests (they can really get in the way with some projects). Hydraulic lift lowers and raises seat easily and locks in place. Wheels roll well on hard surface (didn't try on carpet yet, but no chair rolls well on carpet). Back is high and comfortable, but I tend to lean upright to a little more forward, especially when reading and taking notes. Leather surface is soft and supple, should be easy to clean. I loved how the parts were VERY CLEARLY labeled. Each piece was wrapped and the label was on the wrapping, so you could clearly identify which piece was which, grab what you need, remove the protective wrapping and no worries about an unsightly label stuck on the chair itself. Even the seat was labeled \"front\" to make sure you know exactly which way to attach things. My favorite part, though, was that all the screws and such were sorted and labeled - no more guessing which to use. To be honest, the whole process of putting the chair together took less time than it took me to find the screw that I accidentally dropped.Cons: Nit-picky here - it was mostly pretty easy to put together, but I had a devil of a time getting the hydraulic lift and seat to securely attach. I think the problem was the lock on the lift; pretty sure I had to \"unlock\" it to get the two to finally connect. There was no satisfying click or other indication that they had permanently attached. I had to use all my weight to push down on the seat, then lift up to see if they were attached. Probably took 5 or more times before I was finally able to lift the seat and the base came with it. Only other issue is the fact that my cats seem to love this new chair, but their sharp little claws are not good on the leather. But that is not a flaw with the chair, just something to keep in mind for anyone else who has a fur-baby that likes to be \"right there\" when it's human is working. At least she now sits on the back of the chair and watches over my head instead of sitting right in the middle of the book I am reading.I have recently started grad level online courses, which requires hours of reading, computer time, taking notes, writing, etc., which means that my (very large) butt is parked in an office chair for several hours every night and most of the weekend. I could barely squeeze into my previous chair, and after an hour or so, my legs would start to ache, and by the end of the night I was in pain. So off to Amazon I went to find a chair. True confession: I am currently at 330 lbs., 5'7\" tall, mostly hourglass shape (overfull, to be sure). That means that I have a sizable rump and hips, so I needed a wider seat. Searched Amazon for ages before I finally found this chair - never showed up on any of my searches, no matter what key words or parameters I used. I actually found it as a secondary option for a different chair. Every other chair I looked at for heavy-duty rated for larger persons was $$$$, at least double the price I paid for this one. The back is a little higher than I need, but for the occasional \"lean back and stretch\", it feels amazing. I sat in this chair for full 10-hour stretch last weekend writing my research paper, and not one complaint about comfort. With the wider seat, I am no longer pinched and aching, but I even have enough room to wiggle and adjust a bit. All in all, this is now the most comfortable chair in the house, and it looks nice enough that I don't feel the need to hide it whenever we have visitors. Great value, great chair!",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LabLover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH6ZCZ3WVGQWECA4DMIPJNO6H2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EWZNBYUHXSLF?ASIN=B0C13W5LKH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Worth the Cost",
                "reviewText": "Chair arrived a week ahead of stated arrival date, which was a positive. Carton showed no signs of damage, and components inside were in excellent shape. Hardware was blister-packed, and the supplied Allen wrench was a bonus in assembly. Metal components are in gauges that will stand the test of time, and assembly was straight-forward, with clear and easy to follow instructions. Everything aligned, and though the claim is that the chair can be assembled in 20 minutes, plan on the better part of an hour. This isn't a negative, just a reality. Each fastener has a lock-tite type material applied, and seating the fasteners by hand will take a bit of time. All parts aligned, and assembly was straight-forward. We found that on attaching the back, loosely starting the top fasteners, and then swinging the back pad rearward made locating the second attachement holes much easier than the books recommendation of doing the lower fittings, first. The chair is attractive in color and design, wide in the seat, supportive on the back, and the padded armrests help when typing. We are book authors, so 'fit' and comfort are very important for long stretches of writing. To loosen the tilt on the back, have someone seated in the chair, and a second person to reach under and rotate the tension assembly. The tension knob is very tight, and a firm grip is needed to turn it, however, it works wonderfully. Now, we'll see how the fabric holds up. PU leather is not, of course, the same as 'hide' leather, but a manufactured leather product. Overall, we are pleased with this chair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NeidyibarraNeidyibarra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHS4TTQN2IE6G7YBY4EAON7ZEPJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AJ7Y71EV9VXR?ASIN=B0C13W5LKH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Good quality",
                "reviewText": "Comfortable, size is good easy to assemble nothing was damage when received, only thing I didn't like is that the chair doest’t recline.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Qe5LjiMFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71P-Hns-b8L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71fHVho5WnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "hollie white",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDGZQHSLEZPZQNOVGV5QLWETBEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MXA8NM3BPP3G?ASIN=B0C13W5LKH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Good looking well padded chair with easy assembly",
                "reviewText": "I've always had one of those gaming chairs for my desk chair - they don't last, so this time I wanted to try something different. Found this chair for 99.00 and it's a really good deal. The back isn't as high as I'm used to, but if I scooch down about a half inch - it's comfortable to lay my head back on (I'm 5'3).It's really well padded and very comfortable from the start. It's a good width that I can sit crossed-leg comfortable and wide enough for me to flip up one arm and play whatever guitar I want.This is a pretty chair - not a bright white, more of a soft cream or beige. The stitching looks to be even and strong. This is definitely a buy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany LTiffany L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAE4KTVZET4DR6KZHUGQR7M7GMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IWO6H77PXV5P?ASIN=B0C13W5LKH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars love it",
                "reviewText": "I needed a new office chair after my old one (16+ yrs old) died/stopped raising up. For home office use. Just showed up today; I assembled on my own (gasp, hubby is shocked-I usually make him assemble everything). Took 45 minutes with 2 cats helping me...they like the box it came in. Unlike an IKEA manual, this instruction manual came with words, numbers, clear diagrams, and super easy steps to follow. Non-crappy-Allen wrench included (can you tell I dislike IKEA? lol-shh, don't tell hubby, he's Swedish). The chair is exactly as I had hoped. Comfortable and looks nice in my little office nook. Nice cushioning. Arm rests pull up, not sure if I'll need that but whatever. Hope it lasts. I was worried it wouldn't roll easily on my carpet, was contemplating getting a plastic floor thingy--but it rolls easily. Fair price, I don't care if it was cheaper at one point. Worth it IMO.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71DPy9TpQrL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "DJC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGR5FSMZGK6OC2NBAUEZLPRTNQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T3LPEHOD5NH7?ASIN=B0C13W5LKH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Good Value",
                "reviewText": "A very sturdy and comfortable chair. Very pleased at how fast it arrived. Several days ahead of the stated eta. Very good value for the money. I liked how well the chair was packed. I liked that the assembly instructions were clear and and easy to understand pictures included. Parts were well protected for shipping. Fairly easy to assemble by myself, approximately 45 minutes from start to finish. Have been using it for 3 days now. Much superior to the chair it replaced. Would definitely consider this company again. Thank you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$112.99",
                "sellerName": "PPT Furniture",
                "sellerRating": "4.5"
            },
            {
                "price": "$119.99",
                "sellerName": "Aosai",
                "sellerRating": "4.5"
            }
        ]
    }
}