{
    "remaining_requests": 36353,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Support-Breathable-Orthopedic-Backrest-Ergonomic/dp/B0839BG29X",
    "body": {
        "name": "Lumbar Support Pillow for Office Chair Car, Gaming Chair Lower Back Pain Relief Memory Foam Cushion with 3D Mesh Cover Ergonomic Orthopedic Back Rest（16.31\"x17.94\" x4.69“）",
        "price": "$22.99",
        "originalPrice": "$38.99",
        "rawPrice": 22.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Support-Breathable-Orthopedic-Backrest-Ergonomic/dp/B0839BG29X",
        "soldBy": {
            "sellerID": "A1E2UJY5DVYFIQ",
            "name": "Niceeday US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1E2UJY5DVYFIQ&asin=B0839BG29X&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B083BSCLP5"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51wqxz9WohL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51APxHUL1BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F8Ln4eTlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519D6G5eOgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51P6Q8JeX2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZtWSzpyRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zbeJBsr6L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Niceeday Store",
            "link": "https://www.amazon.com/stores/Niceeday/page/936E6D4B-851C-4239-9388-DD1CF08A850B?ref_=ast_bln"
        },
        "brand": "Niceeday",
        "merchantInfo": "Niceeday US",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 16049,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 10 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "OEKO-TEX STANDARD 100 requires textiles-based products to be tested against a list of 1,000+ chemicals, to limit those which may be harmful to human health. Certification focus: #ProductSafety and #ChemicalsUsed."
        },
        "features": [
            "100% Preimum Memory Foam",
            "【UNIQUE UPDATED JOINT BREATHABLE & HYPOALLERGENIC 3D MESH COVER & PREMIUM SUEDE】 - With removable and machine washable mesh cover, this support pillow can keep air circulation well and always keep you back cool and comfortable, dry for the best experience, so sweat and moisture doesn’t fill it up, suitable for all seasons. The back suede material enables the back cushion suitable for all year round.",
            "【Perfect Lumbar support pillow for office chair / car】 If you spend a lot of time sitting on office chair and driving in car, this back cushion will perfectly help you. It is designed ergonomically to relieve upper, mid and lower back pain and back tightness, support you to achieve a healthy posture and helps maintain the natural curve of the spine.",
            "【Memory foam Support for Back and Lumbar & Suitable for All People】Memory Foam with Bamboo Charcoal Fiber Back Cushion can keep its shape and be used repeatedly. Comes the best elasticity, which makes our product support your back in a proper posture. Unlike other lumbar support pillow, our product with designed curve and waist embracing design, hold your back all the time. Perfect size for office workers, pregnant, drivers and students to improve their posture and keep healthy.",
            "【NON-SLIP & NEVER FLAT】Orthopedic Backrest with adjustable elastic straps design ensuring back cushions stays on the seat without any slipping or sliding. Whether you are driving a car, lying on the couch, watching TV, playing video games, or studying and even working, Villsure Lumbar Support Pillow is the perfect one specially designed for you. Its thoughtful care, smooth curve, elegant appearance, let you linger.",
            "【Best Gift for Friends and Families】This premium quality ergonomic lumbar support cushion is a perfect gift for parents,office staff,teachers,drivers,students who sit for a long time.All our products provide 60-DAY NO HASSLE RETURNS Try it now with no worries",
            "【Adjustable straps】The straps are adjustable from shortest length 19 inches to longest length 50 inches, which can fit most of office chair and car seats. But please note that some big sofa or chairs may not suitable. Please kindly check whether the strap size fits your chairs.",
            "【Q&A】Memory foam lumbar support pillow will perfit fit your back after 7 days. Please don't worry if you feel little not comfortable, or little firm or soft, little thick or thin when you receive it. Because the temperature during transportation affects the hardness of memory foam. And they will back to original softness base on your temperature after you use it for few times.",
            "【Product Size】16.31\"*17.94\"*4.69. Please kindly check the product size before purchase."
        ],
        "description": "WHY CHOOSE NICEEDAY LUMBAR SUPPORT PILLOW? Effective back pain reliefs With taller &thicker design, NICEED Lumbar support pillow for office chair alleviates pain from a greater surface area, including stiffness and tension in the mid- and lower-back region. We are focus on your back aches from sitting, muscle aches from lifting and exercise, arthritis, herniated disks and general soreness. The contoured shape supports your back's natural curve for proper spinal alignment and to promote healthy posture. 100% memory foam cushion lumbar support for car has 3D mesh breathable design that offers support and comfort for perfect ergogenic positioning,naturally regulate temperature, wick moisture and reduce odor. A fabrication known for cushion and bounce, memory foam holds your lower back in proper posture. 3D ergonomic design One main lower breathable mesh part. Extra thick and wide. our ergonomic pillow is made to fit the spine’s natural curve and the body’s natural form. Two higher parts on two sides gently hold front your waist. The impression-making effect of memory foam will also take pressure off your spine, gently guiding your body into a healthy position that circulates blood and relieves tension. Application Fields This seat pillow is suitable for office chair, car seat, wheelchair,recliner, gaming chair, any home chair or seat on a bus, airplane or train. And backrest pads is suitable for drivers, teachers, students, people need wheelchair, pregnant women, office workers etc. Reliable and friendly customer serviceTips: Since it's temperature sense memory foam cushion, it's normal that cushions become harder in low temperature, cushion's softness will be adjusted by user or environment temperature",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Bedding",
                "link": "https://www.amazon.com/bedding/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063252"
            },
            {
                "name": "Bed Pillows & Positioners",
                "link": "https://www.amazon.com/bed-pillows-positioners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1199122"
            },
            {
                "name": "Lumbar Pillows",
                "link": "https://www.amazon.com/lumbar-pillows/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732051"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Niceeday"
            },
            {
                "name": "Special Feature",
                "value": "Back Support Helps Maintain A Gentle Curve Spine, Lumbar Pillows Supports You In Achieving Right Posture, 3D Removable Cover, Adjustable Durability Straps See more"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Size",
                "value": "UPDATED 3D"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Shape",
                "value": "Wedge"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Sitting, Resting, Studying, Back Support"
            },
            {
                "name": "Use for",
                "value": "Back"
            },
            {
                "name": "Material",
                "value": "Memory Foam"
            },
            {
                "name": "Item Firmness Description",
                "value": "Medium"
            },
            {
                "name": "Product Dimensions",
                "value": "18.9\"L x 15.4\"W"
            },
            {
                "name": "Product Care Instructions",
                "value": "Never Tumble Dry, Notice! Memory Foam is NOT Washable, Only Cover Can Machine Wash, Away From Direct Sunlight"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Item Weight",
                "value": "1.6 pounds"
            },
            {
                "name": "Material Feature",
                "value": "Breathable"
            },
            {
                "name": "Fabric Type",
                "value": "100% Preimum Memory Foam, 3d Breathable Cover (Machine Washable; Easy Care)"
            },
            {
                "name": "Model Name",
                "value": "JXKB"
            },
            {
                "name": "Specific Uses For Product",
                "value": "upper back support, lower back support, lower back pain relief, reduce pressure, correct posture, couch, sofa, desk chair, computer chair, dining room, office chair back support, back support pillow, back support office chair, back seat cushion, back chair support, lumbar support pillow, back support chair,office chair back support lumbar cushion, chair back support, back lumbar support for chair, office chair lumbar support, office chair pillow,back cushion for chair, chair support, desk chair support chair pillow for back support seat back cushion back pad for office chair, chair posture corrector back support for office chair chair lumbar support cushion desk back support, chair support for better posture chair neck support pillow desk chair back support chair support for upper back, gaming chair back support back support pillow for car lumbar back support for office chair back support pillow for chair back support cushion for office chair pillow for office chair"
            },
            {
                "name": "Manufacturer",
                "value": "Niceeday"
            },
            {
                "name": "ASIN",
                "value": "B0839BG29X"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "JXKB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 16,049 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,041 in Home & Kitchen (See Top 100 in Home & Kitchen) #3 in Lumbar Pillows"
            },
            {
                "name": "Refill",
                "value": "Memory Foam"
            },
            {
                "name": "Batteries required",
                "value": "No"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Do you have lumbar pain after working long hours? Do you have lumbar pain during long flights, cars etc? According to relevant statistics, about 70%-80% of the people, in their lifetime have had back pain experience. Experts believe that sitting for a long time, make whole body weight presses completely in lumbosacral ministry, pressure is distributed unevenly, can cause waist, abdomen, back muscle drooping or ache. In addition, fixed posture or posture can also cause back pain. So in order to prevent back pain, sitting during the day, you need a Niceeday lumbar support pillow!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a5cc1a6a-26ad-44c8-941f-d528a619c4c9.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Niceeday 2020 Updated NEW Lumbar Support Pillow Ergonomics and Contoured Design Using ergonomic design to simulate the curve of the human spine, its contoured design can sufficiently alleviate the pain and fatigue of lumbar and vertebra area, and perfect helps to realign your back and spine. A Larger Size than Other Cushions Thicker and wider, this back cushion can perfectly split most of the body's weight evenly on the lumbar spine, provide enough support for your waist,so as to reduce upper, mid and lower back pain from sitting or driving for long periods of time. Product Introduction Size: 18.9 * 15.4 * 5.1 inches；Material: 100% Memory Foam；Color: Black ,Weight: 1.5 LB；Package Included: 1 Back cushion*1 instruction for Use Features 1.Relieves pains of back and lumbar 2.Provides a full lower back support 3.Breathable and Washable Outer Cover 4.Helps for Spine Pressure & Corrects posture 5.Fits many kinds of chairs",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bd27227b-a99e-491b-aa1e-62893b93e0a9.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "100% High Density Memory Foam Niceeday back cushion adopts premium high density memory foam that can keep its shape, absorb the stress from long sitting, release the waist pressure, feel soft and comfortable and made without harmful substances. Removable and Washable Cover 1.With breathable 3D mesh cloth and soft velvet cover, this back support pillow can keep back air circulating well,and keep it soft and comfortable. 2.With zipper, the cover can be easily removed and cleaned. Please wash it gently by hand or by machine. Adjustable Double Straps 1.The adjustable double straps can firmly fix the lumbar support cushion on the back of the chair and keep it in place, without slipping or falling down. 2.The back cushion is suitable for most of office chair, car seat, wheelchair, game chair, home chair or seat on a bus, airplane or train. Side Pocket A pocket on the left side of the back cushion, where you can place or get your pen, mobile phone, power bank or data line at any time.It is very convenient and smart.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/5f476bcc-4065-4f42-929a-18f3fdef5c3a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ff79be28-5837-4382-9d23-f923c6c2f148.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4733353d-8791-434f-9268-807412720b30.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e9ecb659-b41a-4dd0-888b-41e767034b17.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Adjustable Double Straps Wide Range Application 1.Niceeday for every its product, we are dedicated to every detail to do the best. Our back cushion use strong metal zipper to ensure that you can easily put on or take off the cover. You can also see the neat lines, highlighting the quality of the back cushion. High quality buckle allows you to adjust the length of the strap at will, so that the lumbar support pillow is firmly fixed in its position. 2.Adjustable elastic double straps make the cushion suitable for many kinds of chairs and can be used in two ways. You can decide whether to use them in parallel or cross use according to your own needs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0de65da5-d617-471b-b161-0fd9b3456ae1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "ENJOY YOUR SITTING TIME WITHOUT PAIN! Suitable for all kinds of occasions Whether you are in office, studying at home, resting on sofa, or driving a car, the back cushion always can provide enough support for your back and waist. Best gift for people who sit for a long time Niceeday lumbar support pillow can reduce back and waist pain, suitable for all people, especially pregnant women, students,drivers, the elderly, long-time office workers, people in a wheelchair etc. Give them a back cushion to enjoy a pain-free life with you! Warm Tips Inner memory foam which can not washable extends the durability of foam core. Since it's temperature sense memory foam cushion, it's normal that cushions become harder in low temperature, cushion's softness will be adjusted by user or environment temperature. If you have any other questions, please contact u s and we will be happy to assist you. Just find your order of us and click contact the seller. We promise you 100% satisfied reply!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0d759fa6-038c-4c7c-b3ed-f40f16ee54d3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/a5cc1a6a-26ad-44c8-941f-d528a619c4c9.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bd27227b-a99e-491b-aa1e-62893b93e0a9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5f476bcc-4065-4f42-929a-18f3fdef5c3a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff79be28-5837-4382-9d23-f923c6c2f148.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4733353d-8791-434f-9268-807412720b30.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e9ecb659-b41a-4dd0-888b-41e767034b17.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0de65da5-d617-471b-b161-0fd9b3456ae1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0d759fa6-038c-4c7c-b3ed-f40f16ee54d3.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "R-Sora Flood",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY6T7NGJ7D34AVXKI5PCIHHLZZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VI7AODXF1T6C?ASIN=B0839BG29X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Works wonders!!",
                "reviewText": "My husband is an over the road transport truck driver. I’ve done on a couple trips with him, both local and out of state, and my God! The jolts and up and down movement of an 18 wheeler should be considered cruel and unusual punishment! My back was shot the very first time and I got motion sickness as well.My husband has been doing this job for 8 years and it’s no wonder his back hurts so much.He’s very fit, 6’2 and 165lbs. Works out and we have a custom made bed that we for specifically for back pain.But almost daily he complains about how much his back hurts.We got this lumbar support back cushion and he just raves about it. He says it helps keep his back aligned in the drivers seat and provides enough cushion for the shocks his spine gets from the jolting of the truck. You can feel every single turn and bump on the road in an 18 wheeler, so this helped him so much!In fact the first week of use, he didn’t ask me to manage his back not once!Plus he’s able to sleep longer without waking up from being in pain. He’s young, 34yo, so preserving his spine during this type of work is for sure a win for him!The price is great considering how helpful it is. I’d gladly pay more if it’s helping him with the comfort of his job.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AK Bound",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFTC5WEPKXSQOKW2I2Q75GIAMKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33Q3GLWQD4XFF?ASIN=B0839BG29X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Lumbar Support",
                "reviewText": "I fractured my L1 vertebrae and needed a good lumbar support pillow to keep my back straight. I tried several other support pillows, but they seem to be over-sized for my needs or more to the point - designed for larger framed men. As a 5'6\" female the length and depth of this pillow aligns well with my frame (i.e., smaller and more compact than others tried) and provides the required support. well worth the investment and great quality of materials used.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT4ROHZ6KZ36J27CXTRZMTPS3EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYI0UXXXQ33KO?ASIN=B0839BG29X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Back Support",
                "reviewText": "Helps support my back while driving long distances. It’s comfortable, well made & very sturdy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lmg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFES2UDXL25BCCF32HQVRQQSHXOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O57SJ6EK203A?ASIN=B0839BG29X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Worked perfectly with office chair",
                "reviewText": "Started sim racing and needed extra support in the lumbar. This nailed it! It's been a couple of weeks, so far, and it's very comfortable. It's holding its shape and still firm after several two hour sessions.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dani and Andrew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7D2S4CPLRB4QMFUCA3PCQOJYBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31RPOV1UXY7HO?ASIN=B0839BG29X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2023",
                "reviewTitle": "3.0 out of 5 stars A bit awkward but overall gets the job done",
                "reviewText": "I’m big on writing reviews because before I buy anything on here I scour reviews for what feels like forever! So, here’s an honest review:It’s a comfortable, squishy, foam-like pillow for back support IF you can find the right spot and get it to actually stay there.I have had so much trouble getting the pillow to stay put and I feel like every single day I have to readjust it to a point where it actually feels comfortable.That being said- I do work in a doctors office so I get up from my chair about (what feels like) 50 times an hour so it could also just be user error where it’s not meant to be moved around that much.Our office chairs also have a slightly different design than most so that could also contribute to my problem.I’ve also noticed that this back support juts out a lot so I’m left sitting on what feels like the edge of my seat. Again, could just be my office chair. I wouldn’t know how much it juts out on any other chair.PROS:- Soft- Comfortable- 2 straps to adjust tightness to chair- Size covers my entire backCONS:- Trouble keeping it in one spot… constantly having to readjust it- A bit bulky- Straps seem to loosen on their ownTLDR; Comfortable, good support… Make sure to attach snugly to chair and you should be fine.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shansay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKAJTJECLY5F2IKP5WLVNXLK42Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23BWM5L0NTLBA?ASIN=B0839BG29X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars I bought 4",
                "reviewText": "My friend liked it so much after I ordered one for him that I bought two more as gifts for relatives with back issues and one for myself (after trying it). It doesn’t “work magic,” but it does provide support in all the right places. Very helpful and adaptable — can also be used in car. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2RYRB7XK5ROHVPJBBX5BWCSQIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AG2UHEFRN93K?ASIN=B0839BG29X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Purchase for Anyone Working From Home",
                "reviewText": "I gifted this to my fiancé as he works from home and often complains about back pain. This purchase has been a life saver- so much comfort and support! I love that there are two bands to keep it in place, so it never moves around. All around great purchase!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Austin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4JO5ON6TZKV6H7JLGQGUAKUNPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6VMW9W3QI0PT?ASIN=B0839BG29X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Comfortable but doesn't stay in place",
                "reviewText": "It's a good quality back support my only problem with it is that every time I get in my car I need to readjust the height and angle of the back support it would be much more convenient if it was able to stay in place so that I don't have to adjust every time I get in. I have tried to tighten the straps to the point where it is making an indent in my seat and it still moves every single time.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 24, 2023",
                "reviewTitle": "No more back pain!",
                "reviewText": "My work transform to remote work. When I use to work my back always gave me issues. I couldn't sit on my chair for 8 hours straight. I had to massage my back every time., I was so annoyed. Finally I bought this and it has changed my life. Now I dont get lower back pains from sitting too long. It was comforting and it keeps your body posture straight which keeps your spin back straight. Must buy",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "erick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 3, 2023",
                "reviewTitle": "Me ayudó con la postura y dolor de espalda.",
                "reviewText": "El dolor de espalda por la silla de la oficina se había convertido en un infierno. Gracias a este producto las molestias disminuyeron notablemente.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T.H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on March 13, 2022",
                "reviewTitle": "テレワーク用の座椅子に利用",
                "reviewText": "テレワークに座椅子で作業をする際、背中が痛くなるため購入。座椅子にフィットし背中の痛みが緩和される気がします。また、そこまで重量があるわけではないが、ずれたりすることなく、安定して使うことができているので重宝しております。",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Chung",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on March 5, 2021",
                "reviewTitle": "Comfortable, durable",
                "reviewText": "Great lumbar support pillow, best design with washable fabric and looks elegantI have a throughout review of your product and compare with 3 others companies. Noticed that the differences of your product is the temperature control (when weather is cold, will be firmer. when weather is warmth, will be softer according to your product specification) and the material. The cover of the lumbar support pillow is easy to maintain, breathable material in the middle section covering large part of the back area; and the side of the lumbar pillow is using velvet which looks elegant. Quite firm in supporting the back area but not hard like a solid rock which is important.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suzanne Mainguy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 19, 2023",
                "reviewTitle": "fits well on my chair",
                "reviewText": "It is more practical than any other cushion and I sit more straight",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}