{
    "remaining_requests": 36324,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/XUER-Ergonomic-Computer-Adjustable-Headrest/dp/B0C28891V8",
    "body": {
        "name": "Ergonomic Office Chair, Mesh Computer Desk Chair with Adjustable Sponge Lumbar Support, Thick Cushion, PU Armrest and Headrest, High Back Swivel Home Office Task Chair for Work (Grey)…",
        "price": "$119.99",
        "originalPrice": "$189.99",
        "rawPrice": 119.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/XUER-Ergonomic-Computer-Adjustable-Headrest/dp/B0C28891V8",
        "soldBy": {
            "sellerID": "A1DIVMC4W0SNO9",
            "name": "XUER",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1DIVMC4W0SNO9&asin=B0C28891V8&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B083KC5TS4"
        ],
        "asinVariationValues": [
            {
                "asin": "B07QG4PZQS",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$169.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Ax5OS4m0L._SS36_.jpg"
            },
            {
                "asin": "B0C28891V8",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$119.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Zi4R6+bHL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "50",
        "stockDetail": "In stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Zi4R6 bHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41CJhgvtV9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4155wtdvoZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/418hds1RbsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gTMO8VlRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41RRCNKptyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XaNHEYy-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the XUER Store",
            "link": "https://www.amazon.com/stores/XUER/page/E80E9DF3-C859-4F5B-9BD7-B72A254912B2?ref_=ast_bln"
        },
        "brand": "XUER",
        "merchantInfo": "XUER",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2447,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 22 - 23."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "★【Ergonomic Office Chair】XUER office chair features an S-shaped backrest that fits your lumbar spine better, protecting your back and shoulders from pain and fatigue from prolonged sitting. W-shaped design sponge cushion, reduce the pressure on your legs, suitable for long-term sedentary work up to 8 hours a day.",
            "★【Breathable Mesh Chair】Our computer chairs are made of high-quality mesh, which is resistant to abrasion and not easily deformed. The mesh backrest keeps the air flowing, refreshing and comfortable, so that the summer is not sweltering.",
            "★【Adjustable Function】Compared to other desk chairs, we are more adjustable. 3.93 inch stepless height adjustment, 126° super-angle backrest tilt, PU lift armrest and adjustable headrest. Find the most comfortable sitting position for you.",
            "★【High Quality】XUER home office desk chair has passed BIFMA and SGS test. Made from the highest quality and environmentally friendly materials, it can support a weight of up to 330lbs. Rollerblade wheels let you move easily and protect your floors.",
            "★【3-Years Warranty】The installation tools and instructions are in the carton, and the installation only takes 20 minutes. If the chair has quality problems, please contact us, we promise 3-years warranty and replace the damaged product accessories for you free of charge."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Chairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18682064011"
            },
            {
                "name": "Home Office Desk Chairs",
                "link": "https://www.amazon.com/Home-Office-Desk-Chairs-Furniture/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3733721"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "XUER"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Product Dimensions",
                "value": "28.3\"D x 26.9\"W x 51\"H"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "Adjustable Height, Ergonomic, Head support, Adjustable lumbar, Seat lock"
            },
            {
                "name": "Product Care Instructions",
                "value": "擦拭清洁"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Room Type",
                "value": "Office"
            },
            {
                "name": "Included Components",
                "value": "Chair"
            },
            {
                "name": "Theme",
                "value": "Ergonomics"
            },
            {
                "name": "Shape",
                "value": "L-Shaped"
            },
            {
                "name": "Model Name",
                "value": "M18"
            },
            {
                "name": "Arm Style",
                "value": "With arms"
            },
            {
                "name": "Surface Recommendation",
                "value": "Hard Floor"
            },
            {
                "name": "Furniture base movement",
                "value": "Swivel"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Form Factor",
                "value": "Tilt,Ergonomic"
            },
            {
                "name": "Seat Depth",
                "value": "17.72 inches"
            },
            {
                "name": "Fill Material",
                "value": "Sponge"
            },
            {
                "name": "Item Weight",
                "value": "45.7 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "XUER"
            },
            {
                "name": "ASIN",
                "value": "B0C28891V8"
            },
            {
                "name": "Item model number",
                "value": "M18"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,447 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#79,625 in Home & Kitchen (See Top 100 in Home & Kitchen) #212 in Home Office Desk Chairs"
            },
            {
                "name": "Date First Available",
                "value": "April 12, 2023"
            },
            {
                "name": "Material Polyurethane",
                "value": "Item Weight 45.7 Pounds"
            },
            {
                "name": "Seat Material Type 记忆海绵",
                "value": "Maximum Weight Recommendation 330 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f12cca08-c4d5-462e-a991-f88787ca6a9c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/14da8b9a-a08d-442d-88cc-a482cab194c0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/087c8a05-def4-413e-9383-fac437254004.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6800cde8-16ae-42ad-829f-eb69840c0a70.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e0690df-4538-4c30-b347-c690888285da.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c2209b4-f09c-4d87-bf13-0d768cdbe7ec.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bff6d20d-0d4a-43a7-96c1-db8952f63178.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "parkmh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH34GGKXMIAMAENHFR7TBCGJ272A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAXY2TA9VPFQV?ASIN=B0C28891V8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2020",
                "reviewTitle": "5.0 out of 5 stars A good starter chair that adjusts well",
                "reviewText": "This chair works well for me, but the comfort of chairs can depend on your size and shape (I'm 5'6, 120 lbs, with a long torso, so the lumbar support hits me just right). A tall or large person might not feel the same amount of comfort.Main points:[+] This is a support chair, not a squishy chair. The seat is firm and because the fabric is made of mesh netting with little holes that are hard to clean, it's not a chair for slobs. If you eat lunch in your chair and rain down little bits of sandwich while typing, this is not the chair for you. If you want a chair that's like sinking into your couch for a nap, this is not the chair for you. Actually, most ergonomic chairs are probably not it.[+] The seat tension control doesn't do a ton, so if the most important thing in a chair to you is the ability to recline or tilt forward, this isn't the chair for you.[+] Alternatively, if you're like me and you find that most chairs don't support the line of your back, so that you end up with a gap between you and the back support, this is a good chair. The mesh back supports your back without being stiff. Once you get the lumbar support calibrated, it's really comfortable. But again, the lumbar support pushes up and down, not forward and back. If you're looking for that chair that's going to shove you to the end of the seat, this isn't it.[+] There are a bunch of chairs with this design offered by multiple vendors. You take your chances with all of them. I'm happy with this one: the arm rests raise and lower, the lumbar support raises and lowers, the seat chair has a tension knob, the head rest raises and lowers. Is it customizable to a herman miller level? No, but it's also 1/5 the price. You really do get what you pay for, and for the price, this as adjustable as your money will be.[+] The construction is good enough. I can understand how a handful of people might end up with parts that don't quite fit together no matter how hard you turn the allen wrench. If you're mentally prepared for that and are willing to send back the chair for a replacement, then don't worry about the negative reviews about quality. Not every chair that comes off a factory line is a winner, and this is a factory chair at a factory mass produced price.[+] The chair comes with a pair of gloves. Put them on and wear them while piecing the chair together. You'll be surprised at the grease that's on the gloves when you're finished.[+] Putting the chair together was extremely easy and can be done by a single person. Engineering skill doesn't matter, but patience (and not having a quick temper) does. Read the instructions, prepare the bolts ahead of time so you're not trying to put the washer on while you're holding the seat in the air. Start all the bolts so they hold, but don't tighten until they're all in. Make sure the metal bits are flat against the seat when you tighten the allen wrench, especially the arm rests. Once the metal seat adjuster piece goes on, the seat becomes pretty heavy and unwieldy, so make sure to get the arm rests on straight first.",
                "reviewVotes": "174 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Al",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCMOGYIL5ATHSHBPUOYTHI4S3HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7G591SXVZYKG?ASIN=B0C28891V8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 10, 2023",
                "reviewTitle": "4.0 out of 5 stars Comfortable Office Chair with Minor Drawbacks",
                "reviewText": "Pros:○ Comfortable mesh back and sponge lumbar support○ Adjustable armrests and headrest provide extra support and customization options○ Thick cushioning adds an extra level of comfortCons:○ Armrests could be wider to accommodate different body types○ Limited adjustability options may not fit all individual needs○ Chair could be a bit heavier to prevent accidental tipping or slidingReview:The ergonomic office chair is a recent purchase of mine, and I couldn't be happier. The chair came with clear instructions and was very simple to put together. Long periods of sitting are made incredibly comfortable by the mesh back and sponge lumbar support. The adjustable armrests and headrest are also a great feature, and the thick cushion adds an extra layer of comfort.I work from my desk for a lot of the day, so having a comfortable chair is crucial. Regarding comfort and support, this chair has unquestionably surpassed my expectations. My neck and shoulders receive excellent support from the high back as well.The wheels glide easily across my hardwood floor, and the swivel feature is simple to operate. Overall, if you're looking for a supportive and comfy office chair, I'd strongly suggest this chair. I've seen a significant improvement in my everyday comfort while working, therefore it's well worth the money.Despite the chair's excellent comfort and support, there were a few annoying problems that kept me from giving it a perfect score. The armrests may first be a little bit wider to accommodate various body types. Second, the chair might be more customizable to match each person's needs by offering more adjustability options. The chair is strong and well-made, although it should be a little bit heavier to avoid any unintentional tipping or sliding.These are comparatively small problems that don't dramatically lower the chair's overall performance or quality. These are nonetheless important to note because some people may regard them to be crucial aspects when making a purchase.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "randall noblerandall noble",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSK2TQJIX7SCA3GSRWHWXLMZ42A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14OBJCOUZV0SG?ASIN=B0C28891V8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2022",
                "reviewTitle": "5.0 out of 5 stars Updated: Comfortable, if a bit Fragile",
                "reviewText": "UPDATE:After Posting my review detailing the issues I've had, the seller reached out and offered to replace the chair for free, even after owning it for over 2 years! The new chair is still very comfortable, but the armrests are much stiffer than before, but this may be due to the durability issues people have been facing. Assembly is very easy and comes with a tool. I've had this new one for a couple of months now and it seems to be holding up well.I've had this chair for just over 2.5 years now. After only a couple months, the bottom of the left armrest pad started coming apart, and by now, an entire section has broken off, and continues to fall apart; the right pad is falling apart as well. Also, the locking mechanism for the back rest has broken. I'm a big guy, but still well within the 330lb weight limit for the chair. I'm used to cheap chairs falling apart after a year or 2, but at $260, I wouldn't consider this a cheap chair, so I'm pretty disappointed with the armrests and locking mechanism.That being said, the chair is very comfortable. It's the most comfortable office chair I've owned and is only beat by a $1700 chair I used to have at work. The seat padding is very comfortable and still in good shape, the headrest, while a pretty flimsy, works well, and the backrest breathes very well, is comfortable, and isn't showing any signs of wear. The rubber wheels it comes with are really nice for hard wood floors. I do not have a mat under it and after all this time, there is no scarring on the floor.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61OCc0LYQ6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61tLfT7SWgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kip Gire",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKNIZA44NZ3R64QL5JBWBXZ6YMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GHF64X8LIPUI?ASIN=B0C28891V8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars a very comfortable chair for the price",
                "reviewText": "Love love the wheels on this chair. feels like a much more expensive chair, sturdy build, easy to put together!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stuart L Thiel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 12, 2023",
                "reviewTitle": "Even with a fudged fix, warrants the five stars",
                "reviewText": "Quick and easy to assemble. The little gloves to avoid getting greased were a nice touch. They are very comfortable and have a solid adjustment range. The lumbar support is great, as many other reviews suggested.Bought two at once. They shipped four minutes apart and arrived nearly two weeks apart. One had what appears to be cosmetic damage on the arm where the plastic molding attaches to the metal. Sent photo and got a prompt and pleasant reply and the immediate shipping of a new armrest. Unfortunately, it wasn't the damaged part, but it is the part that will eventually need replacement, as that's just the lifecycle of armrests.I don't foresee them sending me something else; they are a business and we hardly even notice it. It looks not to be structural.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AlfonsoMp",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 24, 2022",
                "reviewTitle": "Calidad de materiales",
                "reviewText": "me acaba de llegar y me gusto mucho, se siente de buena calidad y muy suave con sus llantas de navaja, espero que me dure mucho tiempo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 9, 2022",
                "reviewTitle": "Buena relación de precio y calidad.",
                "reviewText": "La silla fue fácil de armar (30 min), las instrucciones claras en 7 pasos ilustrados. No hay pierde. Sugiero tener cuidado de no sobre apretar, pero tampoco dejar los tornillos medio flojos.Visualmente, la silla es bonita, moderna y elegante, con la base porta ruedas 100% de metal.La primera impresión que tienes al sentarte es que el cojín es duro, pero después de un rato de estar sentado, te das cuenta de que es muy cómodo y me da la impresión que no se va a deformar como otros cojines que de entrada son más suave y parecen más cómodos hasta que ceden por completo (como mi silla anterior).Es soporte lumbar es el punto estelar de esta silla, aunque quizás le puede quedar alto a personas de baja estatura. El respaldo se ajusta muy bien a tus necesidades y da un buen soporte (después de una semana de jugar con el ajuste, finalmente me acomodó en el setting mínimo). No vi ninguna otra silla con un mecanismo solido y tan ajustable como este a este precio. Sólo lo ves en las sillas super caras (de más de 20 mil pesos).También me gustaron mucho sus ruedas ultra silenciosas, ya que no son de plástico duro y ruidoso, sino de un material más suave que no raya el piso. Lo que sí es que si tu piso no está bien nivelado, las ruedas se mueven con facilidad.El respaldo es muy cómodo y fresco, y te puedes echar para atrás ajustando la resistencia de la inclinación (incluso bloquear la posición, pero a mi me gusta sin bloqueo). El respaldo está hecho de malla, y no tengo idea que tan duradero será. Pero me gustó que el asiento en sí, no fuera de malla, como otras sillas, ya que en el trasero sí creo conviene un cojín como el que trae esta silla, aunque al principio, como es ortopédico, si lo sientes un poco duro, pero cómodo. Creo que esta silla no es para los que les gusta echarse para atrás todo el tiempo y subir los pies al escritorio, ya que la silla como que te empuja a sentarte derecho. Esté efecto puede no acomodar a algunas personas. Para trabajar y sentarte derecho, me parece una muy buena silla. Para echar las flojera reclinado, no tanto.No había tenido una silla con cabecera, pero después de varios días descubrí que es cómoda cuando te echas para atrás.No le rechina nada. Ya con el tiempo veré si surge algún ruido y qué tan duradera me resulta.Tiene un rango de altura amplio, y con el ajuste de altura de los descansabrazos no pegará con ningún escritorio estándar.Mi única crítica es que los descansabrazos son cortos. Cuando estás sentado derecho funcionan bien, pero cuando te echas para atrás, no tienes dónde descansar los codos. Hay una versión que los puede mover hacia adelante y hacia atrás (los de esta silla solo abajo y arriba), pero en esa versión sube demasiado el precio. Definitivamente esto es lo que menos me gusta de la silla.En fin, le dediqué un montón de horas para escoger esta silla entre cientos de sillas. Soy un poco clavado. Pero ésta fue para mi la ganadora, y no creo que encuentres una silla de está calidad, a este precio. No es tan barata, pero peso x peso me parece que es la mejor.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cdm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 24, 2021",
                "reviewTitle": "more pros than cons",
                "reviewText": "pros- easy assembly- sturdy- easy operation (all tilting and lifting positions on 1 handle)- comfortable (mostly)- high quality bearing rubber wheels provide great smooth and very silent rollingcons- head rest too low. it does not get higher than between the shoulders even when fully extended to its highest position. I admit however being tall myself (6ft 3in)- back rest's straightest position is not straight enough, too laid back. I like sitting down straight while still being supported by the back rest, not laying back too much. chair does not give me that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frida López ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 29, 2022",
                "reviewTitle": "Mucho mejor que las Herman Miller",
                "reviewText": "Comoda, ajustable, si eres alt@ esta es perfecta, se recuesta como asiento de avion pero esta super comoda por los soportes ajustables. y aparte buen precio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}