{
    "remaining_requests": 36385,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Chair-Novel-James-L-Rubart/dp/1433671522",
    "body": {
        "name": "The Chair: A Novel",
        "price": "$14.50$14.50",
        "originalPrice": "",
        "rawPrice": 14.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Chair-Novel-James-L-Rubart/dp/1433671522",
        "soldBy": {
            "sellerID": "A3700H9ZJNSOC",
            "name": "Amazn Same Day Shipping",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3700H9ZJNSOC&asin=1433671522&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "Only 1 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51fSFRQEyZL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61FoOAt6ijL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "James L. Rubart",
            "link": "https://www.amazon.com/James-L-Rubart/e/B002VD08HO/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 523,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Christian Books & Bibles",
                "link": "https://www.amazon.com/Christianity-Religion-Spirituality-Books/b?ie=UTF8&node=12290"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Fiction-Poetry-Christianity-Books/b?ie=UTF8&node=172806"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ B&H Books (September 15, 2011)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 388 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1433671522"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1433671524"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 1 x 8.35 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#256,342 in Books (See Top 100 in Books) #1,921 in Christian Mystery & Suspense #17,329 in American Literature (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 523 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Glenda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFULM6JOIPP3M6GVGTMG66D6KB6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EYN6AL8J1R82?ASIN=1433671522",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2017",
                "reviewTitle": "5.0 out of 5 stars Rupart Places Readers in Times of Decisions...and Guides Us...",
                "reviewText": "After I had finished reading Rooms, my first book by James L. Rubart, I wrote that it was one of the best books I ever read. Although I can't remember the exact story now, since it was in 2009, I still remember the feelings, the emotions, the impressions from that book. Soon after I finished reading Rooms, I ordered The Chair... It had sat on my bookshelf until this month, when I pulled it out, unbelievably exactly 8 years after I bought it... God sends me the right books to read at the right time...Perhaps this is your time to read one or both of these books or others by this outstanding Christian fiction writer!As I think of this book, I find myself picturing Jesus as he grew older, knowing what was coming in His life, realizing that, with His carpenter skills, He could leave a part of Him to actually live on after the Crucifixion. He would be leaving his Holy Spirit, but something tangible might be actually used to perform miracles in His absence... He built The Chair...And when the chair was discovered, it was secretly taken into a woman's hands who would guard and protect it and allow it to be used by those in need, as guided by our Lord...The Chair was then handed down from mother to daughter through hundreds and thousands of years until it was brought into an antique store, owned by Corin Roscoe.Corin...and readers...will wonder why The Chair was given to Corin. He was not a devoted believer nor, even after he'd begun to guess who built the chair, was he anxious to keep it...except, he did have one major issue as well as his own needs that could certainly benefit from healing. It is not my intent to share much about the story; readers need to experience it as it evolves and I don't want to take that away... I will say that Corin had a unique and unusual story in his life that won't match many of what we may have experienced...The key issue, for me, was to learn about events in his life and consider how I would have responded to a similar situation... Then, too, there are principles of trust, judging others, and being forced to deal with the actions of others when they do not support our own will or desires, Rubart brilliantly turns a flip-flop on our own emotional responses and forces us to realize facts that are surprisingly different when faced with the reality of what actually happens...In today's world, The Chair, perhaps is even more important for us to read. We are being tossed and turned, not able to believe or trust was is being said even from our leaders. Certainly it is a time when we must realize that emotional responses from within us can be found to be wrong...and that, we must move away from our emotions, old friendships even, or from whom we may think are men of God (or not) and open our eyes to consider how each may really be...As a straight fictional story, it is a wonderful story with several surprise endings that keep you in suspense until the very end... I enjoyed more, for myself, the lessons to be learned--the realization that over and over, what we each may want is not in sync with God's guidance for our life. Rubart forces us to face reality and learn to trust, first, in Jesus... Even in the presence of The Chair...GABixlerReviews",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donald T.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK6RYXDQVME72CLN6UPLUULFMCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHB5FUQGD2QUH?ASIN=1433671522",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2016",
                "reviewTitle": "4.0 out of 5 stars Although it has its flaws, \"The Chair\" is still a good book worth reading.",
                "reviewText": "“The Chair” is a Christian fiction novel by James L Rubart. I believe it came out after his highly successful book “Rooms”. This story is somewhat similar to the first book in that it revolves around a man coming to grips with his past, dealing with current relationship issues, and finding faith in God. In both books, Rubart uses an inanimate object (a house in “rooms” and a chair in this one) to bring the protagonist to discovery of God. The short premise of this one is that one day a mysterious woman walks into Corin’s antique store and gives him a chair. She tells him the chair is ancient and was hand crafted by the greatest carpenter in all of history. When Corin presses her for additional information, she refuses and tells him that he’s been chosen to be the keeper of the chair and that he’ll have to find answers on his own. Shortly thereafter, a boy with chronic asthma sits in the chair and is miraculously healed. From that moment on, Corin must find out everything he can about the chair, who made it, and what he is willing to believe. While on his journey of discovery, Corin finds that there are others interested in the chair and they are willing to do anything to acquire it.The book is interesting and pretty well paced. Rubart does a great job of drawing you in and making you care about Corin very early on. And despite that fact that much of the plot and events are predictable, I never got bored of the book. There are moments where Corin is a little too dense for my tastes and other times where the plot takes turns that are much too convenient, but the heart of the story is relatable enough that those flaws can be overlooked. The ending (while again is convenient) is satisfying. Overall I enjoyed the book a lot and even though it has some flaws, I’d still recommend it to others.This being my second book into the James L Rubart library, I can definitely say that I have enjoyed both of the first two books enough that I’ll read through the rest of his catalogue soon.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. E. Michel Brazeau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 26, 2017",
                "reviewTitle": "Better than I expected",
                "reviewText": "Having read is novel 'Book of Days', I wasn't expecting a whole lot from this one. It was a real page-turner for me. I enjoyed it a lot.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John from Croatia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 28, 2016",
                "reviewTitle": "Restoration",
                "reviewText": "Corbin was a man who constantly sought out challenges to fill a void in his life. Broken relationships, ridden with guilt, longing for restoration and in the end a simple chair that made him think of the Jesus as more than a carpenter. Perhaps we all deep down seek restoration of the heart , which is a miracle often overlooked yet sought after. A great read for all audiences.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bgalb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 4, 2018",
                "reviewTitle": "Excellent read.",
                "reviewText": "Another great read from the pen of James Rubart.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wildlife lover",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 8, 2015",
                "reviewTitle": "Four Stars",
                "reviewText": "a very good book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$14.49",
                "sellerName": "EasyDeal03",
                "sellerRating": "5"
            },
            {
                "price": "$18.13",
                "sellerName": "Books Unplugged",
                "sellerRating": "4.5"
            },
            {
                "price": "$18.71",
                "sellerName": "BookExcellence",
                "sellerRating": "4"
            }
        ]
    }
}