{
    "remaining_requests": 36325,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Newtral-Ergonomic-Adaptive-Adjustable-Adjustment/dp/B0CF9D4JMH",
    "body": {
        "name": "Newtral Ergonomic Home Office Chair, High Back Desk Chair with Unique Adaptive Lumbar Support, Adjustable Headrest, Seat Depth Adjustment, 96°-126° Tilt Function, 4D Armrest Recliner Chair for Office",
        "price": "$152.99",
        "originalPrice": "$169.99",
        "rawPrice": 152.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Newtral-Ergonomic-Adaptive-Adjustable-Adjustment/dp/B0CF9D4JMH",
        "soldBy": {
            "sellerID": "A2AREQOMD2RS9M",
            "name": "Newtral-Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2AREQOMD2RS9M&asin=B0CF9D4JMH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTTBY4J9"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $40 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31YrYA8XhGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41gMpj-mPTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AwcpfshhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41szfeOSDUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eVgr1CjPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dz9QECVAL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Newtral Store",
            "link": "https://www.amazon.com/stores/NEWTRAL/page/F893AEA1-7EC4-4A50-9D6D-BF3DC3B2D6DE?ref_=ast_bln"
        },
        "brand": "NEWTRAL",
        "merchantInfo": "Newtral-Store",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 305,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 4 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[American Ergonomist Endorsement] IRIS SOKOL, the Founder of Ergowell, LLC,“The lumbar function in the NEWTRAL Chair is one of the most unique lumbar supports I have seen, and I have been evaluating ergonomic chairs and products since the late 80's.”",
            "[Unique Adaptive Lumbar Supports] Newtral office chairs use innovative automatic lumbar tracking technology to automatically follow the movement of your lumbar spine, providing a strong support for your lower back throughout the day. Lumbar support strength can be adjusted according to your needs. It fits the natural curvature of your spine and helps relieve back pain caused by sitting for too long.",
            "[Multifunctional Adjustment] The back of the Newtral ergonomic chair has three height options, and it can be tilted and locked from 96° to 126°. The angle and height of the headrest are adjustable. The seat can be lifted up and down, moved back and forth, also equided with 4D adjustable armrests. You can find the most comfortable support position and strength for your body, whether you are working, playing games or resting.",
            "[Certified Quality] The Newtral home office chair uses the the gas lift is high-quality KGS classe 4 made in Korea, which certified by BIFMA/SGS. Korea Filo Breathable Back Mesh can keep good air circulation in your back, even for longtime sitting. We use 7cm high density sponge cushion with waterproof and flame retardant fabric to ensure that will not collapse though sitting for a long time, they are also safe and durable, provide quality assurance for your healthy work and life.",
            "[Always Stand Behind Our Products] The package comes with clear instruction and tools, you can easily assemble it in about 40mins. You can easily get help with the “Product guides and documents” plate on this product page, or please feel free to let us know through clicking the sold by Newtral-Store on the products details page. We provide a 7x24hours after-sale service to help you."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Home Office Furniture",
                "link": "https://www.amazon.com/Home-Office-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063312"
            },
            {
                "name": "Home Office Chairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18682064011"
            },
            {
                "name": "Home Office Desk Chairs",
                "link": "https://www.amazon.com/Home-Office-Desk-Chairs-Furniture/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3733721"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Newtral"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Product Dimensions",
                "value": "21.26\"D x 20.08\"W x 16.54\"H"
            },
            {
                "name": "Back Style",
                "value": "Breathable Back Mesh"
            },
            {
                "name": "Special Feature",
                "value": "back tilt, Adjustable Lumbar, Adjustable Height, Arm Rest, Ergonomic"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Included Components",
                "value": "Bracket, Armrest, Headrest, Cushion"
            },
            {
                "name": "Shape",
                "value": "L-Shape"
            },
            {
                "name": "Arm Style",
                "value": "With arms"
            },
            {
                "name": "Surface Recommendation",
                "value": "Hard Floor"
            },
            {
                "name": "Seat Back Interior Height",
                "value": "4.13 Inches"
            },
            {
                "name": "Form Factor",
                "value": "Recliner"
            },
            {
                "name": "Seat Height",
                "value": "20.47 Inches"
            },
            {
                "name": "Seat Depth",
                "value": "18.5 inches"
            },
            {
                "name": "Arm Height",
                "value": "31.1 Inches"
            },
            {
                "name": "Item Weight",
                "value": "51 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Newtral"
            },
            {
                "name": "ASIN",
                "value": "B0CF9D4JMH"
            },
            {
                "name": "Item model number",
                "value": "MagicH002"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 305 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,748 in Home & Kitchen (See Top 100 in Home & Kitchen) #62 in Home Office Desk Chairs"
            },
            {
                "name": "Date First Available",
                "value": "August 10, 2023"
            },
            {
                "name": "Material Nylon, Foam, Aluminum, Alloy Steel, Polyurethane, Fiber, Mesh, Acrylonitrile Butadiene Styrene See more",
                "value": "Item Weight 51 Pounds"
            },
            {
                "name": "Seat Material Type Sponge, cloth",
                "value": "Maximum Weight Recommendation 300 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "4D Armrest We choose the 4D armrest for you. You can achieve 4 dimensions adjustment to match your most appropriate support place: Move back and forthInternal and external movementRotate from side to sideRise and fall 3 Height Options When installing the backrest, you can choose the right backrest height from the 'under 165cm', '166~178cm', 'above 179cm' three options based on your height. The right height provides the best fit for your back and will play a role in reducing the pain caused by sitting for long periods of time. Adjustable Seat Depth It is equipped with a seat moving track that can move 5CM back and forth. You can adjust the height of the chair to the needs of work or rest, maintain a normal sitting posture, and reduce lower back pain caused by prolonged sitting.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a4ba95fc-0157-4735-bf03-2534da004046.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cdaeb2e0-df50-47aa-9608-71a0fbfe312c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/897bca9f-9b27-4add-be9d-bbf82de51c77.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Multi-angle Dip The backrest can be tilted to 96°, 116°, 126°. You can enjoy formal work, casual work and relax at different tilting angle. The tilting function can be locked and unlocked with the haft, which will no cause you any inconvenience. Also the tilting strength can be adjusted for your prefer. Waterproof The high-density sponge cushion is wrapped in waterproof fabric, which can be cleaned by simply wiping the fabric, without causing trouble and confusion. Flame Retardant The fabric also has a flame retardant function, making the comfortable 7cm high sponge cushion more safe and more durable.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9c663b2-54e3-413e-89e8-9f1393ab9ec9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4518ed13-5756-4989-9d4a-c5402424c2b4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3dbb2128-51fc-4b3a-8f8c-d6cdf3f6f5c0.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/389eb145-3c65-46e6-9ff7-3a7ba4ff4493.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e9c58e3-ca4c-457b-a6ea-eb73ce6842f6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4029400-0d1e-4e5f-b725-1353f3cdbc8a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a4ba95fc-0157-4735-bf03-2534da004046.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cdaeb2e0-df50-47aa-9608-71a0fbfe312c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/897bca9f-9b27-4add-be9d-bbf82de51c77.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d9c663b2-54e3-413e-89e8-9f1393ab9ec9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4518ed13-5756-4989-9d4a-c5402424c2b4.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3dbb2128-51fc-4b3a-8f8c-d6cdf3f6f5c0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f39a517d-3bc1-4420-bcca-d2d19b734251.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ec7dd28a-d806-40b5-b48c-1e4b64b557ea.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dave Price",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6BURE4TBPBCLX4TZC5M3N6BR2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V5L8ULD7CGOS?ASIN=B0CF9D4JMH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Impressive value!",
                "reviewText": "I spend 12+ hours per day sitting at a desk many days. I'm 5'11, 170 with a boney keister and back problems. I have many decades of office chair experience, so I can usually tell right away if a chair is going to create discomfort for me. You can probably see from the stars I gave it that this passed my initial \"oh no way\" test. I just got the chair, so I can't give any impressions on longevity, but here's my initial impressions:The chair base is powder coated steel. In my opinion, this is an upgrade over your typical plastic chair base. It looks simple, clean, unobtrusive and doesn't look cheap or dated. It's a small thing, but I appreciate it.The wheels are on the higher end of basic office chair wheels. Those rollerblade wheels are all the rage, but those have their own drawbacks - they can suck up your sock or bare foot (ouch!) and on hard floors, they can roll TOO easily. The wheels included with this chair roll smoothly without any of those drawbacks and look a bit nicer than your bottom-of-the-barrel office chair wheel. I have a 4x6 low-pile loop carpet mat that I use as a chair mat/floor protector, and these wheels roll nicely over this mat, while giving me enough resistance so the chair doesn't move when I don't want it to. Perfect.The arms - So, there is a lot of adjustment for these arms. They can raise from about 7.5\"-10.5\" (seat-to-arm) with a little release lever on the outside of the arm. The space between the arms can be adjusted slightly during assembly and there's another 1.5\" of tool-free adjustment, as well as 2\" front/back and a pivot to angle the arms inward or outward. It's cool that there's so much adjustment, but it does mean the arms aren't all that rigid. They aren't loose, but it's fairly easy to unintentionally adjust them. They aren't hard plastic, it's more of a very stiff foam with a plastic coating. They're also contoured nicely in the back and kind of cup your forearm.The seat base/cushion - the seat (together with the arms) can be adjusted forward and backward by about 2\" in set increments (I think there's six notches). This can help your fine tune your seating position in relation to the the back, which is a cool feature. The cushion is soft, but high density foam and the fabric feels durable. Both the foam and the fabric remind me very much of automotive upholstery - in fact, it feels nearly the same as the driver's seat on my Jeep Wrangler, if maybe a bit softer foam. The underside of the seat and along the bottom edge is a plastic shroud, which does have a nice clean look. Time will tell how the foam holds up, but my initial impressions are that it feels good quality. Supportive, not too hard or too soft.The headrest - it's height adjustable and you can pivot it to suit your needs. The height adjustment has detents for a handful of set positions, but neither the height or the pivot can be locked into place, so like the arms, you can move the adjustment unintentionally sometimes. It's a firm headrest, but fine for leaning back for a few moments to rest your eyes. You won't be falling asleep on this headrest though.The back - I quite like the back. It has a plastic reinforcement behind the fabric at the lumbar area that is height adjustable. This makes the lumbar support is very good. The rest of back feels nice and supportive to lean against without any pressure points. The fabric is a linear pattern, not a \"mesh\", so it looks much nicer/modern than your typical mesh back. The back has three height positions that it can be attached to the chair base during assembly giving some additional range of fine tuning for your size. Very cool. The recline tension can go from very loose to very strong and there are three positions you can lock the seat back in. The seat base and arms recline slightly with the back, but they don't move together lockstep, which is kind of great - you get a deeper lean on the back and only a slight raise on the front edge of the seat cushion. Very well engineered mechanism.Finally - the back/gizmo/spring that moves the back forward and backward as you move. I don't like it. I know this is the big selling point of the chair, but, it just doesn't do anything for me. It's kind of noisy as it moves, and it feels like it's either not doing anything or it's pushing you off the chair, depending on the tension you have it set to. Plus it tends to pull your shirt up in the back while it moves, which is annoying. Additionally, if you lean back it can leave you with zero lumbar support unless you shift your tush back as you lean, which is just too much gymnastics for me. That being said, you can lock the mechanism in place at various positions, so it just makes for another adjustment point, which is great! This may just come down to personal preference, it wasn't for me, but you don't have to use it, so win-win.Honestly, the build quality and the adjustments available are very surprising to me at this price point. I don't think you could find a better chair for this price and it likely rivals chairs selling for twice as much or more. Assuming this chair holds up (and I have no reason to believe it won't), it is a very good buy.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isaac SIsaac S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKVUUD7UWINVWFK7ME36JFFUFOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E9EUWBPC066I?ASIN=B0CF9D4JMH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Really comfortable, high-quality chair with great back support, and a breeze to assemble.",
                "reviewText": "I'll preface this by saying that I work from home on a regular basis, so a good office chair is a must for me. For the past few years, I've been using a more basic chair that just adjusts by going up/down or having the backrest tilt. It's been fine, not bad, but as I've been working from home more, I thought I'd try out another chair that has more adjustability.I was not disappointed.Here's my full review after using it for a little over a week on a daily basis for 5–10 hours a day:ASSEMBLY - 5/5Super easy to set up. After unpacking the disassembled chair (about 5 minutes) and removing everything from its plastic packaging (3 minutes), I was able to follow the very well-written English instructions with detailed pictures and assemble the entire chair in about 20 minutes from start to finish. All the pieces are easily distinguishable and simple to put together.USE, COMFORT, and ADJUSTABILITY - 5/5This chair is comfortable! The cushion feels more padded than my prior $100~ chair.I also love just how many options you really have on this thing. I just assumed that you could really only adjust a chair in a few ways. This chair proved me wrong. Not only does the instruction manual detail all the ways you can tweak and adjust the chair, but it's also fairly easy to figure out intuitively.The lumbar support is great. You can move the little slider I show in one of the pictures up and down to get the lumbar support to be exactly where you need it for your back. Even the back piece of the chair has 3 different placement options you can choose from when setting it up (and pretty easy to adjust if you need to after setup) and it feels really good on my back now.You can adjust the tilt of the whole back piece.There is a headrest which you can raise and lower and tilt as well to your needs.You can adjust the pressure in the back piece using the orange knob.You can of course raise and lower the whole chair.The arms can be raised, lowered, and moved forward and back, and titled in or out.It is genuinely a lot more comfortable than the good chair I used to have, and on top of that, it forces me to sit up straighter and have better posture once I get the settings to where I need them to be (of course I'm sure it would let you slouch if you wanted, but I don't want that). I just really like how customizable this is and how good it feels on my back. Much needed for someone who's at my desk at home all day much of the week!EXTRAI hopefully won't need it, but the instruction manual indicates that it does come with a 3 year warranty (which includes free part replacements if needed). And after the 3 year warranty, there's a 7 additional year limited warranty which will ship you free replacement parts if you pay for shipping. That seems pretty reasonable to me—and I like products that have a strong warranty because it tells you the manufacturer stands by their product.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61EwV09UyrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71N4ucx3V+L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71TbKzSCC3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zUWnehLJL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}