{
    "remaining_requests": 36301,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Quik-Shade-MAX-Chair-Navy/dp/B00SKZYHEC",
    "body": {
        "name": "Quik Shade MAX Shade Relaxing Chair With Cup Holders, Foldable, Aluminum, Blue",
        "price": "$52.48",
        "originalPrice": "$62.99",
        "rawPrice": 52.48,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Quik-Shade-MAX-Chair-Navy/dp/B00SKZYHEC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C6BCCBYH"
        ],
        "asinVariationValues": [
            {
                "asin": "B00SKZYHEC",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41tNXGLF-5L._SS36_.jpg"
            },
            {
                "asin": "B0C5YPK22B",
                "variationName": "Color",
                "variationValue": "Red/Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41yjhFURlOL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41tNXGLF-5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51jo-SeCYkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/317dJcd7xkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LmSIQ1NmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aqvWbiyhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XxKeU-bDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61WVJy-SrdL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Quik Shade Store",
            "link": "https://www.amazon.com/stores/QuikShade/page/71C4E973-99B1-4FB9-A461-88E84B7074C2?ref_=ast_bln"
        },
        "brand": "QuikShade",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 4494,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 9 hrs",
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35. Order within 9 hrs"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Note : To ensure proper assembly, please follow all steps provided in the Installation manual (provided in pdf below)",
            "SUN PROTECTION: Patented adjustable canopy for sun protection lowers and tilts easily for shade when you need it",
            "DURABLE, QUALITY FABRIC: Breathable 600 x 300 denier polyester fabric is made for durability and comfort. It's water, stain, and moisture resistant to keep your chair looking brand new",
            "EASY TRANSPORTATION: At only 9 lbs., the canopy chair is easy to transport. Includes carry bag for easy and convenient travel and storage",
            "SUPPORTIVE OUTDOOR CHAIR: Constructed with a sturdy steel frame with higher arched back. 22.5\" wide seat is comfortable and supports weight up to 500 lbs."
        ],
        "description": "Relax and kick back while you shield yourself from the sun with the Quik Shade MAX Shade Folding Chair. Quik Shade's Max Shade Chair is compact, portable, and comfortable. Our patented Quik Shade shade chair is a great portable shade chair solution that offers reliable sun protection that's easy to transport. A rugged fabric carry bag is also included for convenient portability and storage. The patented design allows the sun shade to raise, lower, and tilt to block the sun from any angle, without leaving the comfort of your chair. With the new MAX Shade design, you get 40% more shade making this a great chair to take with you on your next outdoor adventure. The tough 600 x 300 denier polyester fabric is water, moisture, mold, mildew, and stain resistant, and can easily be wiped clean. The chair back has a higher arch and is also constructed from breathable mesh that lets air flow through to help keep you cool while you relax. With the convenient mesh storage pouch on the side, you can keep your snacks, cell phone, or accessories close at hand. Stay hydrated on those hot summer days outside with dual cup holders and lounge around in the superior comfort of the 22.5-inch, oversized seat that supports up to 500 pounds. SIZE: Open 22.8\"L x 22.8\"W x 51.6\"H and seat is 18.5 inches from ground, and weighs only 9 pounds. INCLUDES: 1 folding camp chair and 1 carry bag",
        "breadCrumbs": [
            {
                "name": "Sports & Outdoors",
                "link": "https://www.amazon.com/sports-outdoors/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3375251"
            },
            {
                "name": "Outdoor Recreation",
                "link": "https://www.amazon.com/outdoor-recreation/b/ref=dp_bc_aui_C_2?ie=UTF8&node=706814011"
            },
            {
                "name": "Camping & Hiking",
                "link": "https://www.amazon.com/camping-hiking/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3400371"
            },
            {
                "name": "Camping Furniture",
                "link": "https://www.amazon.com/Camping-Furniture-Hiking-Sports-Outdoors/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3400781"
            },
            {
                "name": "Chairs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3400791"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Quik Shade"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Product Dimensions",
                "value": "22.8\"D x 36\"W x 42\"H"
            },
            {
                "name": "Size",
                "value": "Max Shade"
            },
            {
                "name": "Back Style",
                "value": "Solid Back"
            },
            {
                "name": "Special Feature",
                "value": "Cup Holders, Foldable"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe Clean"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Relaxing"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "225 Pounds"
            },
            {
                "name": "Style",
                "value": "Tropical"
            },
            {
                "name": "Pattern",
                "value": "Chair"
            },
            {
                "name": "Finish Type",
                "value": "Mesh"
            },
            {
                "name": "Room Type",
                "value": "Tent, Outdoor"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Included Components",
                "value": "Canopy chair"
            },
            {
                "name": "Shape",
                "value": "L-Shaped"
            },
            {
                "name": "Model Name",
                "value": "MAX Adjustable Shade Folding Chair"
            },
            {
                "name": "Surface Recommendation",
                "value": "Hard Floor"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Outdoor, Indoor"
            },
            {
                "name": "Form Factor",
                "value": "Foldable"
            },
            {
                "name": "Furniture Finish",
                "value": "Aluminum"
            },
            {
                "name": "Seat Height",
                "value": "22.5 Inches"
            },
            {
                "name": "Fill Material",
                "value": "Polyester"
            },
            {
                "name": "Is Foldable",
                "value": "Yes"
            },
            {
                "name": "Item Weight",
                "value": "9 pounds"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Shelter Logic"
            },
            {
                "name": "ASIN",
                "value": "B00SKZYHEC"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "160070"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 4,494 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#72,090 in Sports & Outdoors (See Top 100 in Sports & Outdoors) #320 in Camping Chairs"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Refill",
                "value": "Polyester"
            },
            {
                "name": "Finish types",
                "value": "Mesh"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "No warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Imported"
            },
            {
                "name": "Material Aluminum",
                "value": "Item Weight 9 Pounds"
            },
            {
                "name": "Frame Material Alloy Steel",
                "value": "Seat Material Type Mesh"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/06aad8cc-4b13-4675-a84b-9e1a3a2908b7.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5cb98105-eb62-4b79-b8a1-f0dfcc98c9bb.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "somebody",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEIQRTCRHJ4UZX4PSW5KXIQRXCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B6TA7EH9L9J8?ASIN=B00SKZYHEC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2020",
                "reviewTitle": "5.0 out of 5 stars This is a fabulous chair and makes hours in the sun bearable",
                "reviewText": "My daughter is taking an outdoor class, which means the parents wait on the sidelines for 2-3 hours in the boiling, blinding sun. The first day was miserable, then I brought hats and cover-ups, THEN I got this chair. The shade over the chair changed everything. It also took care of my \"sun glare\" headaches that even sunglasses could not prevent. The other parents asked for the information so they could get one, too. The only thing to be aware of is the canopy will catch the wind and knock the chair over pretty easily if it is a breezy day and there is no weight in the chair. As long as someone is sitting in it, no problem. So if you get up to do something, put a heavy bag in the seat or offer it to a friend while you step away. I WOULD PURCHASE THIS AGAIN AND AGAIN FOR ANY OUTSIDE ACTIVITY IN THE HOT SUN.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justin Rodriguez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWZKWF3P2LUWALIZA26OD247VHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R59V7I1AHGAXI?ASIN=B00SKZYHEC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for that solo game experience",
                "reviewText": "Going to a game by yourself and don't want to bring the pop up? This chair is for you! Provides great shade with the adjustable top. Isn't too big to take up all the room in your trunk in case you forget it all week between games and is comfortable when you do use it. I utilized this chair all season for my son's traveling soccer team and it shows little signs of wear. Extremely portable and very sturdy. 10 out of 10 recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N3rd Girl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIBWMLCZLLKAXFAXEYOEWDW5KFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YCLCLGH8Z2UF?ASIN=B00SKZYHEC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2019",
                "reviewTitle": "4.0 out of 5 stars Updated review after 1 1/2 years",
                "reviewText": "UPDATE, APRIL 2021:I've had this chair for about a year-and-a-half now, out on my patio in Florida. In the sun and the rain and the Heat.I have to admit it's worn in nicely. And even in the intense heat here it's held up pretty well. I use it daily. And it has stretched out some and become quite comfortable.Unfortunately because of the heat here, I am going to have to replace it soon. But that's the cost of canvas chairs in Florida.If you use this chair occasionally, for instance. throw it in your trunk to go to a game, it'll last you years. To see the original review just scroll down. Because yes, it was the most uncomfortable chair for the first few months. But I went back and added two more stars to it because it's become my favorite chair. And I still absolutely love the top!Original review 2019:This is without a doubt THE most uncomfortable chair I've ever sat in. And that includes sitting on the ground. Where to start? First of all, I'm 5'7\", 130 lbs. This is a key piece of information.This chair is not made out of canvas. I have no idea what it is made out of. Something that's pressed to look like canvas but has the give of Steel. The seat is coated underneath with actual plastic. And I'm pretty sure that the material itself is some sort of plastic. It's very very crinkly sounding. The area in the front of the seat, by the knees, is folded over about 4 in for construction purposes. That 4in feels like a steel bar under your legs. And the area between the two poles by your knees are not far enough apart to sit comfortably. Even if you squish your legs together.The poles up by your shoulders hit me right about in the middle of the my shoulder blade. And I do not have broad shoulders.The way the chair is designed, the arms are quite far away from where the seat is. You can't comfortably use them for an elbow rest.There's a warning label advising you not use the cup holders for any hot liquid. Which sort of reinforces my idea that the whole thing is made out of plastic and might melt. I certainly have no reason to believe it will last very long at all in the Florida sun. Even with the umbrella over top. Which by the way is the only cool part of this chair. The fabric of the umbrella seems to be a little softer and have more give, which is weird. Because you would think they would use that for the seats for comfort.The seat itself has no give whatsoever. It's not even like sitting in a shallow steel bowl. It's more uncomfortable than that. . You have to sit with your knees squished together, your shoulders hunched forward and your hands in your lap.The amount they say this chair can hold is something I greatly doubt. Because someone anywhere close to 160 to 200 lbs couldn't even fit in this thing.Also, as if there were not enough reasons to dislike this chair. I'm 5 foot 7 in and if I lean back my feet can't even touch the ground. Who the heck designed this thing? The Spanish Inquisition?OK... so why two stars? Why not one? Because the top is absolutely genius! It bends, it tilts, it folds back, it truly is brilliant. The mechanism of this top, and the genius of the idea of it, combined with a chair made in a way where you could actually sit in it would go for at least double this price. And be worth it.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol A",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2JSPVLUIDLZE3JGS3375SGXM5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33820MHZOFF6U?ASIN=B00SKZYHEC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Easy to fold and unfold Safety Warning!!! Not for tall or overweight folks.",
                "reviewText": "It is a good quality, easy to fold and unfold. No parts to be attached it all comes in one piece. Use the canopy or not. It is not comfortable due to the placement of the seam between between the back and seat. The seat looks big enough but when you actually sit down you are forced to slide forward making the seat area short. If you are tall or overweight this is not the chair for you. Gives good back support but the short seat is annoying, not for sitting for long term. The bar of the front of the seat causes pressure on the back of my upper legs. The back legs come out of the cups easily so I have to check it before sitting.Safety Warning!!!! The back legs fit into cups built into the frame. If you forget to do this you might have a problem.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark SchmittMark Schmitt",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIA4PU3UNQJMEZU2LHEX7JP2CEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUGDWPEEDEZZC?ASIN=B00SKZYHEC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "3.0 out of 5 stars Nice chair but poor quality",
                "reviewText": "These are nice chairs but the canopy portion is very poor quality. The cross arm on both chairs broke and the canopy itself on one chair ripped after only a few uses. The chairs were stored in the provided bag. The chairs are still usable but the quick damage after only a few uses is very disappointing.On the plus side, the chairs are light and easy to setup. The canopy provides good shade and cover from light rain despite breaking easily.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714W8PRUziL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81P-9Zm81yL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hoppaguy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3AW62XZGNMAIDF3KEOPIAX7PDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37G9SZCY23QYA?ASIN=B00SKZYHEC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Need a convenient chair with a built in shade?",
                "reviewText": "The Good:-Convenient-Easy to set up-Easy to take down and stuff back into bag-Sturdy-Good valueThe Bad:-NoneThe Bottom Line:I own 3 of these Quik Shades after seeing one of son's teammates parents have them. They are super convenient since the chair has a built in shade. It really helps for those all day soccer tournaments in the sun. The chair is sturdy and easy to fold and unfold. It fits back easily into its carry case. Overall, I would recommend this chair for its convenience and practicality.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aliase A Anderson-Wallace",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM2HZXF6NXWDNAQMNDT4PUXZNJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26FOGSQPE0CSA?ASIN=B00SKZYHEC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Pepsi",
                "reviewText": "My Chair I Have Used For Concerts, Picnics, BBQ’s I Love My Big Chair.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doris Lavalley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 3, 2021",
                "reviewTitle": "Good product",
                "reviewText": "Love it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carmen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 5, 2021",
                "reviewTitle": "Excelente relación costo beneficio.",
                "reviewText": "Nos gustó mucho! Llegó rapidísimo. Es ligera, muy simple para sacar y guardar, práctica para llevar y muy útil para lugares soleados. Acá la utilizan personas mayores y les parece amplia y cómoda. Excelente relación costo beneficio.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danny",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 18, 2021",
                "reviewTitle": "Muy útil nos encantó",
                "reviewText": "Me gusto mucho !!! Llego justo a tiempo para lo que la quería y la usamos en un día de picnic en el parqueProtege muy bien del sol y es fácil de transportar",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JefMar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 17, 2021",
                "reviewTitle": "Well designed",
                "reviewText": "Very good shade provider, robust, comfortable and wind resistant.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erick Chavarria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 11, 2020",
                "reviewTitle": "Bueno para la ocasión",
                "reviewText": "Esta fácil de usar y es bueno que el techo se adaptable quizá en el asiento podría ser un poco más cómodo en las orillas donde hacen x los tubos",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}