{
    "remaining_requests": 36542,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BTSKY-Ergonomic-Slipcovers-Polyester-Reclining/dp/B07JLZTHVH",
    "body": {
        "name": "BTSKY Ergonomic Office Computer Game Chair Slipcovers Stretchy Polyester Covers for Reclining Racing Gaming Gaming Chair Black (No Chair)",
        "price": "$15.29",
        "originalPrice": "",
        "rawPrice": 15.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BTSKY-Ergonomic-Slipcovers-Polyester-Reclining/dp/B07JLZTHVH",
        "soldBy": {
            "sellerID": "AJY1G8GFOPGPK",
            "name": "Theoneer",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AJY1G8GFOPGPK&asin=B07JLZTHVH&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BRJBNTQP"
        ],
        "asinVariationValues": [
            {
                "asin": "B07JLZTHVH",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$15.29",
                "variationImageURL": "https://m.media-amazon.com/images/I/31jD8PQu85L._SS36_.jpg"
            },
            {
                "asin": "B08H58F7SL",
                "variationName": "Color",
                "variationValue": "Dark Grey",
                "price": "$16.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/31czwTJZH1L._SS36_.jpg"
            },
            {
                "asin": "B09LTZVF6H",
                "variationName": "Color",
                "variationValue": "Navy Blue",
                "price": "$16.29",
                "variationImageURL": "https://m.media-amazon.com/images/I/31rgTL7EMVL._SS36_.jpg"
            },
            {
                "asin": "B09JVR7PN6",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$16.29",
                "variationImageURL": "https://m.media-amazon.com/images/I/31uv2Zq9fiL._SS36_.jpg"
            },
            {
                "asin": "B0BLH6ZLNF",
                "variationName": "Color",
                "variationValue": "Royal Blue",
                "price": "$15.29",
                "variationImageURL": "https://m.media-amazon.com/images/I/31D0Y8wzgVL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31jD8PQu85L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410G0 y1ZZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411C6qEy7QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZMeRcBstL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tDQR LfYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4115bTVn4ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-2og3uD-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: BTSKY",
            "link": "https://www.amazon.com/BTSKY/b/ref=bl_dp_s_web_20514475011?ie=UTF8&node=20514475011&field-lbr_brands_browse-bin=BTSKY"
        },
        "brand": "BTSKY",
        "merchantInfo": "Theoneer",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1893,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 47 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest pickup Thursday, February 15. Order within 9 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fit for chair SIZE: Chair back height is 31\"-35\",Chair back top width is 8\"-11\",Chair back medium width is 22\"-25\", Chair back bottom width is 20\"-24\", Chair seat length is 22\"-25\"，Chair seat width is 16\"-20",
            "Material: spandex,elastic stretch to install,soft and comfort to seat on it",
            "Functional: Anti-slip,Dustproof,Anti-dirty,Anti-scratch,Washable,Removable,Durable to use; Chair cover with zipper to install easily. It can protect your chair for New, also if your chair is old, cover with this make it look great",
            "PACKAGE includes: 1pc top chair cover and 1pc seat chair cover,1 pair armchair rest cover, note that no chair",
            "Chair cover fit for computer chair,armchair,swivel chair,gaming chair,computer boss chair. Kindly please carefully read the Size Chart we provided in the pictures, and measure your chair size to determine if it will work"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Home Décor Products",
                "link": "https://www.amazon.com/home-d%C3%83%C2%A9cor/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063278"
            },
            {
                "name": "Slipcovers",
                "link": "https://www.amazon.com/slipcovers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063300"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "6\"D x 4\"W x 4\"H"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Chair"
            },
            {
                "name": "Special Feature",
                "value": "Durable,Removable"
            },
            {
                "name": "Material",
                "value": "Polyester, Spandex"
            },
            {
                "name": "Style",
                "value": "Contemporary"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Product Care Instructions",
                "value": "Machine Wash"
            },
            {
                "name": "Closure Type",
                "value": "Elastic,Zipper"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Item Weight",
                "value": "7.8 ounces"
            },
            {
                "name": "Brand",
                "value": "BTSKY"
            },
            {
                "name": "Fabric Type",
                "value": "Polyester,spandex"
            },
            {
                "name": "Unit Count",
                "value": "1 Count"
            },
            {
                "name": "Manufacturer",
                "value": "BTSKY"
            },
            {
                "name": "ASIN",
                "value": "B07JLZTHVH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,893 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#86,562 in Home & Kitchen (See Top 100 in Home & Kitchen) #581 in Slipcovers"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "October 21, 2018"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "BTSKY Chair Covers: -To save your office chairs from pet damage -Redecorate your chairs,changed the look of your desk set.Give your old chair a whole new look.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8005c625-bef0-4687-962b-28a02d92fc56.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Features: - Material is spandex,elastic stretch to install,soft to seat on it. - Anti-slip,Dustproof, Anti-dirty,Anti-scratch,Washable,Removable,Durable to use; Chair cover with zipper to install easily. It can protect your chair for New, also if your chair is old, cover with this make it look great. - Made of stretchable cloth with sew-in elastic hem in different colors, blends well with contemporary and traditional furnishings. Fully machine washable for easy care 4, Chair cover fit for computer chair, armchair, swivel chair, gaming chair, computer boss chair",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25d73b4e-7c1c-4b0b-8ee1-a7d7126e3db1.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Warm Notice: 1. Due to the light and screen difference, the item's color may be slightly different from the pictures. Please understand. Make sure you don't mind before you bid 2. Please allow 1-2cm differences due to manual measurement Package Including: 1pc top chair cover and 1pc seat chair cover,1 pair armchair rest cover, note that no chair",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/703ecccd-33ae-4a60-b6b3-ab45fcd150fe.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Checkered Black Gaming Chair Slipcovers 2 Pack Chair Covers for Low Short Back Chair 2 Pack Chair Covers for High Seat Chair Protectors Black Universal Stretch Computer Chair Slipcovers with Grey Flower Pattern Large Size Stretch Cushion Slipcovers Stretchy for High Back Chair Black Material Plaid fabric/Polyester Polyester Polyester Polyester Polyester Quantity 1 2 2 1 1 Suitable for Gaming Chair Low Short Back Chair High Seat Chair Universal Computer Chair Rotating Chair High Back Chair Boss Chair Executive Chair",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8005c625-bef0-4687-962b-28a02d92fc56.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25d73b4e-7c1c-4b0b-8ee1-a7d7126e3db1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/703ecccd-33ae-4a60-b6b3-ab45fcd150fe.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f05be7c-2357-468d-8225-49dfbe229320.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/260e0ec3-bd5b-490a-81b1-1daad15c00bf.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/268f2986-91ab-4ca1-b3cf-ece5b5121e19.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d40fb6ce-ebcb-4b30-a57a-9fad91923604.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4153fe1e-3ff3-43d9-8e95-c6885a312edf.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "StephanStephan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC2XYK2U6DGCULF2CL7AIALYMRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ABH79H6L6TVK?ASIN=B07JLZTHVH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2021",
                "reviewTitle": "5.0 out of 5 stars Great Fit For the Secret Lab Titan Chair!",
                "reviewText": "The media could not be loaded. Review Fit for Secret Lab TITAN ChairOVERALL IMPRESSION:An excellent budget friendly cover choice for any gaming or office chair that it fits which I can happily say does an excellent job on the Titan Chair by Secret Labs.I have back issues so I bought this chair and was extremely satisfied with its support.But unfortunately this particular titan chair comes with a synthetic leather which although is stated as being pretty durable, I know in time, No matter how durable the synthetic leather is, it will deteriorate.Especially when your raw skin and oil’s continually touch it.So sitting in it With a tank top and/or shorts or with no shirt… doesn’t necessarily feel good because your skin will stick to it and you know that you’re also helping that synthetic leather deteriorate faster.So , a cover is necessary at times.This is why I chose this cover, And I’m happy that I did so because although it covered the beautiful decor of the Titan chair, it still looks pretty good.This cover is a “universal fit” type of product which was designed to fit a multitude of different office and gaming chairs.So, I was quite shocked to see how well it fit on the Titan Chair.Another concern I had was that I didn’t want a cover that was too thick or something that might restrict the comfort that the chair offers out of the box.I wanted a cover but I still wanted to feel the quality of the chair that I purchased.With this cover on I can enjoy the chair and it’s support without any added discomfort or muted chair experience.Package:It comes in a simple clear plastic bag with 4 parts1 Back Seat cover1 Bottom Cushion cover2 arm rest covers.Material:The item description claims it to be a spandex, elastic stretch and I would agree to that.If you ever had a pair of swim shorts that had the integrated silky like nylon underwear ( not the fish net webbing type) then You’ll get a good idea of what this material is like.It does stretch well and seems toBe of a decent quality.To the touch it feels smooth yet soft. Not silky not not cottony either. Somewhere in the middleApplication:It says it’s easy to install but there is a wrong and right way to do it.With no Manual or instructions you might have a trial and error period.It didn’t take me long but the first time I tried to put it on I noticed that the backseat portion should only be put on in one particular way.It doesn’t fit right if you put it on in the opposite direction of the way I describe below.Installing Back seat cover:To start make sure that the zipper tab is facing on the front side of the back seat which should be facing you if your in front of the chair.You’re going to slide it over the headrest and back seat until the zipper touches the bottom seat cushion.Then you push that zipper in between and through where the back seat and bottom cushion meet.CAUTIONWhen you slide the zipper through, Make sure that you guard the bottom cushion and back seat areas with your fingers so as to not scratch the material of YOUR seat with the zipper.It’s not a hassle or anything but it’s something you should be aware of because the backseat and the bottom cushion sit pretty close together.If done correctly when you look at the back of the chair, your zipper should start on the left side of the back of the seat and zip all the way to the right. See photos and videoInstalling bottom cushion cover:This was pretty easy to understand the direction in the way that you apply the cover. The only concern is how the elastic straps in plastic buckles attach around the levers and joints of the chair.I provided photos and a video of this area.The first part is easy. Just slide over the cover until you reach the back part of the cushion.Then slide the elastic strap with the “female” part of the plastic buckles in between the seat cushionsYou’ll then extend the “male” part of the plastic buckle on the side of the cushion to meet the “female” part which will wrap around the “joints” of the chair to secure to the “male” buckle partSee photos/videoArmrest covers are just simple wrap around affair.Fit And Appearance:It fits just about as perfectly as you would like a cover to fit your chair.Although, It makes your very sexy and elegant Titan chair look quite generic.Yet, it is a nice smooth finish and has a nice feel to it.Near the “shoulders” of the chair there is a very tiny bit of “bunching”.It also covers The lumbar adjustment knob so you may either want to set it the way you like before applying the cover or you can do like I do and just turn it slowly a portion at a time while the cover is still On.The cover is thin and will allow that knob to turn but I just wouldn’t turn it too fast and too much at a time.It also does tend to “Web” just a bit in the middle of the back rest (which is not noticeable to the eye) but once you sit on, it will stretch to conform to your back and meet the chair.The armrest covers fits so nicely they look like they belong there.It is a shame to have to cover my titan chair but if I want to protect it I have this option and if I wanted to show his true colors than I can always remove it.It’s not that big of a deal to take it off and on.Generally speaking the chair still looks really nice with this cover on it. You can see for yourself in the photos/videoConcerns:My only concerns at this moment is it’s longevity and durability.I’ve only had this for a couple of days and it is a thin material. It seems decently made but I am concerned that overtime maybe some of the seams will start to come apart or that zipper.Also the elastic straps that connect to the plastic buckles could be an area of concern. But at this point it is mute issue.Only time will tell and I will have to update my review if and when this cover fails me.After carefully reviewing the seams ans zipper, My guess is that everything will hold up well and be fine.It should be noted that this is very cheap alternative to anything else that you could use to protect your chair.So even if it were to fall apart in a year or so it’s not that much to replace it and I can’t really expect it to last forever.With that said it seems to be pretty good in this department.There are some things I would like to address about the item description on the Amazon page.The Amazon item DESCRIPTION says.—-Anti-slip,Dustproof, Anti-dirty,Anti-scratch,Washable,Removable,Durable to use—-Anti-slip? I don’t think so.It does stay in place but you can slide around a bit when moving on it because it’s a little slick. I think it also slips a little bit between the chair and the cover.You won’t slide when not moving though.I have reclined in the chair with it on and it’s not like I’m sliding down or around. It’s only through shifting I sometimes notice a bit of sliding.But it’s not that big of a deal as I said there’s elastic straps and it’s stretchy so it does retain its shape.It’s just not something I would call “anti-slip”.Dust proof, anti Dirty? Yeeeeaaah NO!I was actually doing something that got my hands a little dusty and when I touched my chair it went right onto the fabric.I didn’t even know my hands were that dirty until I saw that I made a handprint on the cover LOLI don’t know what makes them think it’s dust proof. Maybe they’re trying to say that it will keep your chair dust proof which is obvious.Anti Scratch? Again noThis material is thin and if anything sharp comes up against it, it will scratch, tear or rip.I don’t even think it’ll protect your seat very much from anything that can scratch it.But it’s better than leaving it naked.I can also see this material “pilling” over time but I can’t be sure at this time.Durable? Questionable.We will see in time.Pros:* Inexpensive* Nice material that looks great and fits great* Thin enough experience your chair as it was meant to be* Easy to take off and on, washableCons:(More like concerns)* Durability/Longevity in question* You MAY slide a bit while shifting positions* Covers the Lumbar Adjustment Knob* Thinness maybe be a problem for someBottom line:This cover is easy to put on and off (when you understand the right method) Fits well, looks great, feels good, and offers just enough protection while allowing the chair to still function and feel the way it should.At this price anybody I recommend anyone with a Titan chair (or any chair that fits) to have one on hand. I hope this helps.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B10UOQKx2AS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1OnB0cTkHS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1kYLX9x4ZS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1ls+fNWg7S.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1rBTaYyBfS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1xjlNxVISS.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f74aa624-6a5b-46d5-88cd-06c1674f7434/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Real DealReal Deal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7Z57LXPIPMXRIFXY6673V6HTDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXLJ7RUDZK8WN?ASIN=B07JLZTHVH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Transform Your Office Throne with Style and Comfort!",
                "reviewText": "The media could not be loaded. The BTSKY Ergonomic Office Computer Game Chair Slipcovers have completely transformed my office throne into a stylish and comfortable oasis! These stretchy polyester covers are a game-changer for anyone looking to upgrade their chair's look and feel.The first thing that caught my attention was the modern and sleek design of the slipcovers. The stretchy polyester material hugs my chair perfectly, giving it a clean and tailored appearance. It instantly adds a touch of sophistication to my workspace.The ergonomic features of the slipcovers have significantly enhanced my sitting experience. The contoured design ensures proper support for my back, shoulders, and neck, reducing fatigue during long hours of work or gaming sessions.Installation was a breeze. The stretchy fabric easily fits over my chair, and the elastic edges ensure a secure and snug fit. It's like giving my chair a stylish new outfit without any hassle.The stretchy polyester material is incredibly comfortable. It's soft to the touch and provides a pleasant sitting surface. Additionally, it's easy to clean and maintain, making it a practical choice for everyday use.What I love most about these slipcovers is the reclining feature. They are designed to accommodate the reclining function of my chair seamlessly. Now, I can lean back and relax without worrying about the covers bunching up or sliding out of place.The variety of colors and patterns available allowed me to pick a slipcover that matches my office decor and personal style perfectly.I appreciate the versatility of these slipcovers. They fit a wide range of office chairs, making them a great option for anyone looking to upgrade their chair's look and comfort.In conclusion, the BTSKY Ergonomic Office Computer Game Chair Slipcovers are a game-changer for anyone seeking a stylish and comfortable upgrade for their office chair. The stretchy polyester material, ergonomic design, and easy installation make them a top choice in the realm of chair accessories. They have transformed my office chair into a stylish and supportive sanctuary, adding a touch of elegance to my workspace. If you want to give your office throne a makeover with style and comfort, look no further than these slipcovers. I highly recommend them to anyone in need of a chair upgrade!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Pnt71lPIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71asUrd1trL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c7ae4660-7de0-4400-9a66-8d5566cc7526/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Silent_R493",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKJF5K4UPXQPMKRWW7U4WKRSGYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FXUVN6PIYQ1X?ASIN=B07JLZTHVH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "4.0 out of 5 stars Fits well enough and as described",
                "reviewText": "Fits my old DXRacer Max I've had for years.No more peeled/weathered leather appearance for me.Wish it was cotton and a bit thicker.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve Salken",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 8, 2023",
                "reviewTitle": "It fits quickly and easily and quite well",
                "reviewText": "I got this because something in the chair upholstery was giving the backs of my legs hives (Who knows what they make things out of?) The cover has fixed that problem. It's stretchy and fits very well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on October 15, 2023",
                "reviewTitle": "Si adatta a sedie anche voluminose",
                "reviewText": "L'ho comprato per la sedia da gaming di mio figlio che essendo in ecopelle cominciava a perdere dei pezzetti. Ho pensato che per la cifra richiesta avrei anche potuto provare a coprirla. Non mi aspettavo invece una soluzione cosi perfetta. La copertura è molto elastica, in tessuto nero sintetico, si adatta perfettamente alla sedia che è di grandi dimensioni. Si allaccia sotto con una chiusura alla fine di un elastico, in modo da tenerla sempre ben tirata. Ha anche i copri braccioli, ma a noi non servono perchè sono in plastica e ancora perfetti. Sono molto soddisfatta!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 3, 2023",
                "reviewTitle": "Excellent et s'adapte très bien",
                "reviewText": "Utilisé sur une DX Racer Sentinel dont le similicuir à subit le passage d'un chat et franchement le rendu est top. Niveau taille c'est pile poil, j'ai dû tirer un peu sur les fermetures pour que ça se ferme mais le tissu se détend peu à peu et donne un rendu vraiment propre.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 19, 2023",
                "reviewTitle": "PERFECTA",
                "reviewText": "Se ajusta a la silla practicamente como una segunda piel.Tengo una Maxnomic que ya va para los 10 años, y la polipiel parecía que tenía la sarna, pero la he cepillado para que dejase de perder trocitos, le he puesto esta encima y le queda como un guante.Se nota que lleva una funda, pero queda bien tensada y no es molesta para nada. Es más, ahora en verano, la hace mas fresca de usar",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan Ljungström",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on April 15, 2023",
                "reviewTitle": "Perfect fit on my DXRacer",
                "reviewText": "Helped in covering up my busted DXRacer and gave it some new life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}