{
    "remaining_requests": 39938,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/UBeesize-Extendable-Bluetooth-Aluminum-Lightweight/dp/B07NWC3L95",
    "body": {
        "name": "UBeesize Selfie Stick Tripod, 62\" Extendable Tripod Stand with Bluetooth Remote for Cell Phones, Heavy Duty Aluminum, Lightweight",
        "price": "$19.99",
        "originalPrice": "$19.99",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/UBeesize-Extendable-Bluetooth-Aluminum-Lightweight/dp/B07NWC3L95",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CR9MFLQW"
        ],
        "asinVariationValues": [
            {
                "asin": "B07NWC3L95",
                "variationName": "Size",
                "variationValue": "62in",
                "price": "$19.99",
                "variationImageURL": ""
            },
            {
                "asin": "B09PH9PNYY",
                "variationName": "Size",
                "variationValue": "67in",
                "price": "$23.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C6LNFHTP",
                "variationName": "Size",
                "variationValue": "92in",
                "price": "$34.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $2 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31EY4qVUw4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/515anE80HzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514HTggwweL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61pEFmttOlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hRzisImzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61G80VJSmLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZieaEnZaL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/B1Mgr9QsyZL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1Mgr9QsyZL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the UBeesize Store",
            "link": "https://www.amazon.com/stores/UBeesize/page/04111BDD-CAFD-4DB8-8D20-1F5A3BF35738?ref_=ast_bln"
        },
        "brand": "UBeesize",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 84778,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 14. Order within 11 hrs 27 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 19 hrs 12 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Selfie Stick Tripod Combo - Not Only Want To Take The Selfie, But Also Wanna Take Pictures/Videos With Excellent Stability While Liberating Your Hands. Ubeesize Has You Covered With Our All-In-One Professional Combo To Take Your Filming To Next Level. Perfect For Selfies, Group Photos, Adventure Travel, Vlogging, Youtube Videos, Podcasts, Facebook Live, Facetime, Instagram, Live Streaming",
            "Extra Long For More Possibility - Extendable From 17.0 Inches To 62.0 Inches (Longer Than Average), Combined With 180° Neck Rotation And 360° Head Rotation To Find Your Best And Beautiful Shooting Angle, You Can Now Cram In More People Or Background To Take The Most Satisfying Selfies And Capture Awesome Selfies Or Other Photos From Formerly Impossible Angles",
            "Wireless Remote Shutter - The Pocket-Sized Bluetooth Remote Allows You To Take Selfies Or Group Photos Easily From A Distance Up To 30 Feet. Compatible With Most Smart Phones. No App Download Necessary",
            "Widely Compatible - Universal Phone Holder Fits Most Smartphones With Or Without A Case, Compatible With Phones Such As Galaxy S9/S9 Plus/Note 8/S8/S8 Plus/S7 Edge/J7, Google Pixel, Samsung, Huawei. With Universal 1/4 Inch Screw, It Fits For Digital Camera, Dslr, Slr, Action Camera, Gopro, Webcam, Camcorder"
        ],
        "description": "UBeesize Versatile 2 In 1 Selfie Stick Tripod With Universal Phone Mounted You Can Easily Switch Between Selfie Stick Mode & Tripod Stand Mode For Your Preferred Use. Product Features: Portable, Professional, Heavy Duty Aluminum, Lightweight, Non Skid Tripod Feet, Quick Flip Locks Extra Long For Wider Sceneries An Extendable Body Of 62 Inches Maximum Length Allows You To Cram In More People Or Background To Take The Most Satisfying Selfies Universal Compatibility Most Video Cameras, Digital Cameras, Still Cameras, Projector, Camcorders, Webcam, And Scopes With 1/4” Screw Thread Action Cam Like Go Pro Hero 5/4/3+/3/ Session (Go Pro Adapters Included). All Iphone/Android Smart Phones Phone Holder Compatibility The Adjustable Phone Holder Expands Up To 3.54 In, Fits Most Smart Phones With Or Without A Case, Compatible With Iphone X/8 Plus/8/7 Plus/6S Plus/6S, Galaxy S9/S9 Plus/S8/S7 Edge/J7/Note 8/Note 9, Google Pixel & More Android Smartphones. Wireless Remote Control Perfect For Taking Pictures And Video From Up To 30Ft Away. Compatible With Ios Or Android Smartphones (Android 4.2.2 Or Newer Ios 6 Or Newer). In The Boxer 1 - Selfie Stick Tripod'S 1 - Bluetooth Remote 1 - Phone Mounted 1 - Go Pro Adapters 1 - Manual,Trypods For Phones,Outdoor Phone Tripod, Vlogging Equipment 1/4 Tripod,S9 Plus Tripod,Iphone 8S Tripod, Iphone Tripod Iphone Se, Apple Tripod For Iphone, Gym Tripod For Iphone, High Tripod For Iphone, Tripod For Any Phone, Phone Tripod Attachment ,Phone Collapsible Tripod,Chefs Tripod For Phone,Vertical Phone Tripod,Xl Phone Tripod,S9 Tripod Stand,Remote Control Tripod For Android 8S Phone,Floor Mounted Tripod For Android Phone ,Full Foldable Horizontal Tripod For Iphone Phone , Iphone Phone Tripod Kit For Moto Z4 10Rx Mix.",
        "breadCrumbs": [
            {
                "name": "Cell Phones & Accessories",
                "link": "https://www.amazon.com/cell-phones-service-plans-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2335752011"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/cell-phone-accessories/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2407755011"
            },
            {
                "name": "Photo & Video Accessories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=21209100011"
            },
            {
                "name": "Tripods",
                "link": "https://www.amazon.com/Cell-Phone-Tripods/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11139610011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "16.73 x 3.62 x 2.64 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.5 pounds"
            },
            {
                "name": "ASIN",
                "value": "B07NWC3L95"
            },
            {
                "name": "Item model number",
                "value": "TZ621BK"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Metal batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 84,778 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#955 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #12 in Cell Phone Tripods"
            },
            {
                "name": "Date First Available",
                "value": "September 17, 2018"
            },
            {
                "name": "Manufacturer",
                "value": "UBeesize"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "UBeesize"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Compatible Devices",
                "value": "iPhone, Gopro, Camera, Android"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Lightweight"
            },
            {
                "name": "Material",
                "value": "Aluminum"
            },
            {
                "name": "Maximum Height",
                "value": "62 Inches"
            },
            {
                "name": "Tripod Head Type",
                "value": "Ball Heads"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/42571c41-9279-4358-a373-398c096d5cac.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f96f8b45-7c91-4196-99a3-ff73692992ec.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dcc65938-38fa-4121-b2fe-ff2a77784cfe.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/89e86437-5539-4292-bb9b-6d74926d99b2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f3e05ef3-e816-4891-8024-ea384894da57.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rocio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHQVVUOMF7S5DBLRYYVBWMQ5EMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R164I35I77CAZ5?ASIN=B07NWC3L95",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Awesome purchase!",
                "reviewText": "Awesome tripod👌🏼. I love that it came with a remote, which has worked really with my android phone. A little blue light turns on when u turn it on, but once its connected to your bluetooth, the light turns off. Wish it would stay on just so I can make sure if I do have remote on or off, but it's not that big of a deal. U can easily just turn remote on and off to make sure. When you click to take a picture or click start and stop for video, the blue light does turn on (when you click only. It doesnt stay on). I love that the height is easily adjustable. Also, that phone can easily be placed vertically and horizontally. It's cool also that it came with a Go Pro adapter. I haven't used it cause I don't have a Go pro or anything like that, but it's cool its included👍🏼😁. I like that it can also be used as a selfie stick. U can easily use the remote to take a selfie. I dont think the tripod is flimsy. I think it's pretty sturdy👍🏼. The price is great too. Plus, I was able to use a $4 coupon on it so it came out even cheaper! My only suggestions to make this item even better are the following: 1) wish backpack bag was just a little taller cause with phone mount it's a little harder to close bag (you can close it but u just have to move the phone mount part to the side). 2) If lanyard or string would come with remote, that would be even more awesome. This is easily solved by putting your own on it (there is a space on remote to insert string/lanyard. I put a string in it), but just saying. 3) it would have been nice if it came with a pouch or if backpack bag came with a pouch to put the remote and other things tripod came with. Again, you can easily get your own pouch and problem is fixed. I used a pouch I already had, but again just saying. Overall, I'm happy with this purchase and the price I paid for it as well😁.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D Dogs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELBTGMUR7WHC53EDBPTODDH7W6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XKFS9X876AOS?ASIN=B07NWC3L95",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect for what I needed it for",
                "reviewText": "I bought this tripod to video dog agility and it worked perfectly. It was steady during recording, easy to set up and take down. Lightweight for transport and just what I needed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIPQCS3DZURVFHW36ISTOYG4GVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C68HQ4LN5J1W?ASIN=B07NWC3L95",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2022",
                "reviewTitle": "5.0 out of 5 stars Amazing For The Price",
                "reviewText": "I am quite the Instagram addict if I say so myself. I love taking pictures of others and it’s great to have someone return the favor. The only problem is that I usually never like the pictures others take of me. It’s always either too much ground or too much sky or they catch me right when I am about to switch my pose. I don’t know if it’s the phone, my face, or the person’s inability to find good angles. We’ll never know. Anywho…I eventually decided to just start taking pictures for myself. So I invested a few hard earned dollars into this tripod.This is the first tripod that I have owned. I think for the price it is great quality. You can adjust the height considerably. The remote control connects to my phone in a matter of seconds. You literally just turn it on and BOOM! Start clicking away. I love that I don’t have to run back and forth to set a timer for each picture. This allows me to focus on the picture itself to make them more natural. I don’t have to start the timer and then think of a pose. I guess you could say it’s a lot less manual. The one downside is that if you are someone like me that takes at least 300 pictures before picking the 2 good ones, you have to remember to not go crazy with the clicks. Give it time so the pictures are clear. Otherwise they’ll turn out all blurry. Take your time with the shoots. Also, because the remote is very small, it can get lost easily. Try to keep in the same place so it doesn’t get lost.The tripod is relatively compact. I carry it in a tote bag and it fits well. It’s super light weight. When it’s get’s windy, it can get flimsy, swaying back and forth and even fall. Always set it on a flat surface to prevent phone damage.Overall, a great product for recording videos, taking group pictures or taking solos when you see an aesthetic location and decide to pull over. Allows you to enjoy the moment without focusing too much on capturing it :)",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTV7JD6SJHPLVMVXI7EFUZPZBEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GS8EC99TQ8NW?ASIN=B07NWC3L95",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "4.0 out of 5 stars Pretty good, great for solo pictures.",
                "reviewText": "Great for solo picture use and the remote is super helpful, comes with everything you need and fits different sizes. Very sturdy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fadi Shamaan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2UZ52SQ4HSIYYUEBYBY6R76JEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7UPEFK1LT0KN?ASIN=B07NWC3L95",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Unleashing the Power of Epic Photos and Videos!",
                "reviewText": "Are you tired of having to ask strangers to take your pictures during your travels? Do you wish you could capture breathtaking group shots without leaving anyone out? Look no further! I recently discovered the UBeesize Selfie Stick Tripod, and let me tell you, it's a game-changer! With its impressive features, sturdy build, and exceptional versatility, this selfie stick tripod deserves a resounding 5 out of 5 stars!Unleashing the Features:Let's dive into the features that make the UBeesize Selfie Stick Tripod an absolute must-have. First and foremost, the extendable tripod stand reaches an impressive height of 62 inches, giving you the perfect angle for stunning aerial shots. No more awkwardly angling your phone or camera for that perfect Instagram-worthy shot!The heavy-duty aluminum construction ensures stability and durability. I was pleasantly surprised by how well-built this selfie stick tripod is. It easily supported my smartphone and provided a steady platform, even in windy conditions. Plus, the lightweight design makes it incredibly portable and easy to carry during my outdoor adventures.Seamless Connectivity:One of the standout features of the UBeesize Selfie Stick Tripod is its built-in Bluetooth remote. Pairing my phone with the tripod was a breeze, thanks to its intuitive and straightforward setup. I could conveniently control my phone's camera from a distance of up to 30 feet, allowing me to capture those picture-perfect moments with ease.Moreover, the remote offers multiple functions, including capturing photos, recording videos, and switching between front and rear cameras. It became my go-to accessory for both solo adventures and group outings, as I could simply set up my shot and click the remote button to capture the moment effortlessly.Universal Compatibility:One of the biggest advantages of the UBeesize Selfie Stick Tripod is its universal compatibility. It supports a wide range of smartphones, including both iOS and Android devices. Additionally, it can securely hold devices with widths ranging from 2.2 to 3.3 inches, accommodating popular models like the iPhone, Samsung Galaxy, and Google Pixel.I appreciated the adjustable phone holder, which ensured a snug fit for my phone, providing peace of mind that it wouldn't accidentally slip or fall. This feature is particularly important when you're capturing videos or time-lapse sequences and need a reliable, secure setup.Versatility at Its Best:The UBeesize Selfie Stick Tripod offers more than just the typical selfie capabilities. Its versatility shines through in various scenarios. The 360-degree rotation ball head allows you to capture shots from different angles and orientations effortlessly. Whether you're vlogging, live streaming, or capturing stunning landscape shots, this tripod can handle it all.I was thrilled with the tripod's ability to transform into a handheld selfie stick in seconds. This feature was perfect for capturing on-the-go moments or exploring crowded areas where setting up a tripod might not be feasible. It truly enhanced my photography experience and expanded the possibilities of what I could capture.Personal Experience:As an avid traveler and content creator, the UBeesize Selfie Stick Tripod has become an indispensable tool in my arsenal. It has accompanied me on countless adventures, from hiking in picturesque mountains to exploring bustling city streets. This tripod has allowed me to capture incredible memories, and it has never failed to deliver.I particularly remember a recent trip to a scenic waterfall. With the UBeesize tripod extended to its maximum height, I captured a breathtaking shot of the cascading water against the backdrop of lush greenery. The tripod's stability ensured a clear and sharp image, while the Bluetooth remote allowed me to trigger the shot without disturbing the frame. It was a moment I'll cherish forever, made possible by this fantastic gadget.Now, let's add some entertainment and sprinkle in a few funny terms to keep things lively! Picture this: you're at a bustling tourist spot, trying to get that perfect shot, but your arm isn't long enough to include all your friends in the frame. Well, fear not, my selfie-obsessed comrades! The UBeesize Selfie Stick Tripod comes to the rescue like a trusty sidekick, extending to superhero-like heights and capturing every moment with the precision of a seasoned photographer. Say goodbye to awkward arm angles and hello to a selfie stick tripod that's more reliable than your trusty sidekick!In summary, the UBeesize Selfie Stick Tripod is a game-changer when it comes to capturing stunning photos and videos. Its features, including the extendable tripod stand, Bluetooth remote, universal compatibility, and impressive versatility, make it a must-have accessory for all smartphone photographers and content creators. With its sturdy build, seamless connectivity, and user-friendly design, it's no wonder that everyone who uses this tripod gives it a resounding 5 out of 5 stars. Trust me, once you get your hands on the UBeesize Selfie Stick Tripod, you'll wonder how you ever managed without it!",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ronaldo adriano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 5, 2023",
                "reviewTitle": "Ótimo produto",
                "reviewText": "Nota 10",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Muhammad Huzaifa Farooqi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 5, 2023",
                "reviewTitle": "Good length and sturdy",
                "reviewText": "This fits really well onto my iPhone 12 with a case and doesn’t fidget while its clasped, making it stay in place. The base has rubber feet that allows it to be non slip and I love the fact that I can adjust the size of how wide the base should be with a simple twist of the screw clasp. This is a great feature as I can literally place it on any surface big or small and it will sit neatly on it.The stick has a neat clasp system where I can adjust the height of the stick upto my eye level almost (I’m 5,11), by clasping and unclasping the 4 levers. The phone can either be held vertically or horizontally and it can even move 360 degrees while clasped on which is a great feature. The stick itself feels nice and sturdy and the materials used seem good quality - doesn't feel like those cheap ones that might break if you handle them too rough. It also comes with a bluetooth remote to take pictures from a distance. Great product at a great price.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jancruz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 13, 2023",
                "reviewTitle": "tripie Ubeesize",
                "reviewText": "excelente producto y muy seguro y facil de usar",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "I'm so disappointed the only thing that I like is the colours and how it changes. But wouldn't buy it ever again the water spills all around so be prepared to have a wet night stand if you put it there ... Not well fabricated at all. It needs improving, but to be honest it doesn't surprise me with the price of it.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 21, 2024",
                "reviewTitle": "Really good",
                "reviewText": "My fave",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "fou peut-être",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 28, 2023",
                "reviewTitle": "C'est le pied !",
                "reviewText": "Très pratique très ergonomique.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}