{
    "remaining_requests": 39885,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/UBeesize-Portable-Compatible-Spotting-Binoculars/dp/B0CDQ5DZG7",
    "body": {
        "name": "UBeesize 74\" Camera Tripod with Phone Holder and Remote, Heavy Duty Tripod Stand with Portable Bag for Phone and Camera, Compatible with DSLR Cameras, Cell Phones, Spotting Scopes and Binoculars",
        "price": "$39.99",
        "originalPrice": "$39.99",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/UBeesize-Portable-Compatible-Spotting-Binoculars/dp/B0CDQ5DZG7",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNRHV341"
        ],
        "asinVariationValues": [
            {
                "asin": "B08CHFY4R5",
                "variationName": "Size",
                "variationValue": "67Inches",
                "price": "$35.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CDQ5DZG7",
                "variationName": "Size",
                "variationValue": "74Inches",
                "price": "$39.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41B8KazfVDL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51FqIRW6BNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qtMoYdFOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41S6PXD2zrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fvLncpN6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MBEaWN wL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GQVNULJ L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the UBeesize Store",
            "link": "https://www.amazon.com/stores/UBeesize/page/04111BDD-CAFD-4DB8-8D20-1F5A3BF35738?ref_=ast_bln"
        },
        "brand": "UBeesize",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 9846,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 18 hrs 5 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 18 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Precision and Stability: Dual-Handle Triumph】 Seize control with our innovative dual-handle tripod design, providing precise control for exploring diverse perspectives; Elevated Stability, Doubled Confidence: Capture crystal-clear photos and shoot seamless videos, all made possible by the enhanced stability delivered through our dual-handle design.",
            "【Enhanced Versatility in Photography】 The innovative dual-handle design of our camera tripod introduces a new level of flexibility, enabling seamless adjustments for landscape, portrait, overhead, upward and 360-degree panoramic shots. Experience heightened convenience and superior adaptability in capturing the perfect angle.",
            "【High Compatibility 】A Camera Stand for All Cameras (Nikon D3500, Fujifilm X-T200, Canon EOS 250D, Olympus, Panasonic), Cell Phones (iPhone 15 14 13 12 11/15 Pro/Pro Max/XS/XR/X/8/8 plus/Galaxy Note 9/S10/S20), Projectors, Webcams, Binoculars, and Spotting Scopes.",
            "【Capture Every Moment on the Move】 Our tripod is not just a stand; it's your ideal companion for photography adventures. The included carry bag ensures effortless transport and storage. Utilize the central hook for convenient bag hanging, keeping your essentials within easy reach. Moreover, the robust handle allows you to carry the tripod horizontally, ensuring comfort and convenience wherever your photographic journey leads.\"",
            "【Universal Phone Holder & Wireless Remote】Our tripod boasts a universally adjustable phone holder, accommodating smartphones from 2.8 to 5.7 inches. Furthermore, it comes equipped with a wireless remote that seamlessly syncs with your mobile device, enabling you to effortlessly capture photos and videos from distances of up to 30 feet (10 meters)."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Tripods & Monopods",
                "link": "https://www.amazon.com/Tripods-Monopods/b/ref=dp_bc_aui_C_3?ie=UTF8&node=499306"
            },
            {
                "name": "Complete Tripods",
                "link": "https://www.amazon.com/Complete-Tripod-Units/b/ref=dp_bc_aui_C_4?ie=UTF8&node=499310"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "17.24 x 4.96 x 4.72 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.96 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CDQ5DZG7"
            },
            {
                "name": "Item model number",
                "value": "TBC001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 9,846 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#67 in Complete Tripod Units"
            },
            {
                "name": "Date First Available",
                "value": "August 4, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "UBeesize"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "UBeesize"
            },
            {
                "name": "Color",
                "value": "black"
            },
            {
                "name": "Compatible Devices",
                "value": "Camera"
            },
            {
                "name": "Special Feature",
                "value": "Pan-handle"
            },
            {
                "name": "Material",
                "value": "Aluminum"
            },
            {
                "name": "Maximum Height",
                "value": "74 Inches"
            },
            {
                "name": "Tripod Head Type",
                "value": "Pan Heads"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Exploring Nature's Splendor: A Photographic Journey through Outdoor Landscapes Creative Moments Unleashed: TikTok Video Recording Adventures Next page 1 Landscape photography 2 Video Recording",
                "media_link": []
            },
            {
                "media_text": "Previous page Starry Nights Unveiled: Crafting Celestial Wonders Through Mesmerizing Astrophotography Achieve hassle-free and swift photography with the included remote control convenience. Next page 1 Starry Sky Photography 2 Capturing from Afar",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ae063fd-bcc8-4a33-8e24-e28c55bbcfa9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a83d8fbd-60e8-4eb9-8c22-cc452eeb0776.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed0c164e-4410-41a8-a6ec-0962ac67579a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c10e3e24-b4dd-4f69-a408-8e3031ebd29f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/88aaa2ec-4ad6-47f8-8341-16dfd98def93.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/33a8c4c0-f575-4857-a71f-a4aa7cb6000e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa0edcd7-00e4-4558-b08e-c657a221d405.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c4fc0ef-7532-4cd2-a0bf-6dd65e8c54ec.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "SkSk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLYQYWSC7WOMRSLOAWNFQIF6WZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLWDLEZGB5XIP?ASIN=B0CDQ5DZG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Very light weight",
                "reviewText": "I used several tripods over the years, some of the tripod are very expensive for Dslr camera I am looking for light weight and traveling easy. Then on of the my friend suggested this tripod.The tripod itself lightweight, good height. Sturdiness.It’s very light weight look lukae made from very cheap plastic but is not heavy duty durable plastic.This product is reasonable price.Have had others but this was great and strong.Easy to assemble, multi universal for straight spotting scope or top view scope by just tilting 90 degrees..Have remote button to take picture from far.I like this product. Thanks for reading this.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Efr2VnxwL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81AsRH5zBgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81wse+ktEbL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CathyCathy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7BUV4VZENNT2YK6HM4FHQR4P6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D5F4U78Z1OKV?ASIN=B0CDQ5DZG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect Affordable Tripod for Camera and Phone",
                "reviewText": "I recently purchased this tripod, and it has exceeded all my expectations. Setting it up is a breeze, and its versatility in accommodating both my Canon camera and phone makes it an invaluable accessory for any photographer or content creator.The smooth adjustments of this tripod are truly impressive, providing a seamless experience when capturing the perfect shot. Standing at a convenient 22 inches tall, it easily extends up to the advertised 74 inches, offering great flexibility for various shooting scenarios.One of the standout features is the handy carrying case. Not only does it protect the tripod during transport, but it also adds an extra layer of convenience for those on the go.Overall, this tripod has become my go-to camera accessory. It's rare to find such quality at this price point, making it a fantastic purchase that I wholeheartedly recommend to anyone in need of a reliable and affordable tripod.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71f0pySbZ5L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPOETREKB2R64J5EP2XCJZ44VVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33VQFZM4GO6HD?ASIN=B0CDQ5DZG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Tripod",
                "reviewText": "This tripod is of excellent quality, and I was immediately impressed by its excellent composition, configuration, and materials as soon as I opened the box. As a passionate photographer, I’ve always been fascinated by making videos and capturing photos. Simple to put together, it can be used as an overhead view scope by simply tilting it 90 degrees or as an unreflective spotting scope. This tripod is sturdy, can be carried around easily, has a standard height, is easy to operate, and captures all the close-ups. When not in use, it is simple to store in a closet due to its small size. The remote button is superb for taking distant photos. I heartily recommend this fantastic purchase to anyone in need of a dependable and reasonably priced tripod, as it's uncommon to find such quality at this price range.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZJQLQODHBRUJW7FVJ2XEF4GMXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HBPBXMDPVRDM?ASIN=B0CDQ5DZG7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2022",
                "reviewTitle": "4.0 out of 5 stars EXCELLENT FOR IT'S PRICE RANGE!!!",
                "reviewText": "Well I must say, I saw the HORRIBLE reviews this product got based on it practically FALLING APART as soon as they took it out of the box. Others had it for a week or two and the legs just started dropping off or the plastic parts disintegrated in their hands. Now if all of THAT is going on, then YES - THAT'S A MAJOR PROBLEM!! I might suggest MAKING SURE that you're not accidentally buying other people's \"Used crap for a discount\" - I only buy things like this NEW - never used. I DID buy something used before by accident - a water pitcher! OMG... imagine opening your water pitcher and the lid is cracked and somebody else's water is dripping from the filter LOL.. 😂 Yeah! What YOU just said - is what I said!So on this tripod - I had ZERO PROBLEMS with it (so far) falling apart out of the box. I've actually been impressed so far with all of it's many features & how versatile it is. People said the \"plastic locks broke after a week or 2\" - I just got this yesterday, but I can see where that could happen. The plastic DOES feel like something might snap or pop off if I was REALLY using this thing and readjusting it on a daily basis.It's CLEARLY not designed for that. Please keep in mind - IT ONLY COST $35, but it has all the features of the big PROFESSIONAL stands... so OF COURSE there's SOMETHING that got it's corners cut. Now out of curiosity, I scoured around on Amazon to look at the higher-end tripods and guess what.... ALL OF THEM WERE GETTING SHREDDED IN REVIEWS - ALL OF THEM are said to fall apart, or to be made with cheap plastic parts - even the ones costing over $140!! They ALL got 3 or 4 out of 5 stars... all the 1 & 2 star reviews said those tripods fell apart on sight.So I decided to take it a step further and went to the BIG BOYS SHOP - (B&H PHOTO)!! Guess what... The $100 - $200 tripods all had the SAME reviews and were said to have the SAME problems. BUT.... They DID have some $300 - $400 tripods that got RAVE REVIEWS, and that price range is the ONLY place I saw them. So I'd say, if you need a tripod that you can stand-up and break-down QUICKLY while you're filming RARE GOLDEN RAMS IN THE ALPS, or maybe you're doing a FILM SHOOT for National Geographic in the Sahara and need a tripod for your $10,000 video camera, that you can breakdown - throw in the back of the jeep and take off!! Yeah, you're gonna wanna go hit up that $400+ B&H gear. ((((THIS TRIPOD IS NOT FOR PROFESSIONAL OR HEAVY USERS!!! ))))It lists a 15lb. weight limit, but I wouldn't put 15lbs on it with the legs fully extended. MAYBE with them fully retracted and the tripod is just sitting on a table - and the camera doesn't need to be tilted. It would probably be able to handle even 20lbs in that situation. I detected no wobble and the mounting-head is rock solid as far as I can tell. But again - I'm not putting any real weight on it. My little cameras/phones are the size of my hand, and that's EXACTLY what it was designed for.Overall... this tripod is for people like ME!!✨🤗✨ It's for people who want to set it up - maybe for their Youtube recordings - and really don't need to mess with it after it's in place. If that's all you're using it for, it should last for a very long time - maybe decades!! But I'm SURE some plastic would easily break if you tried to readjust it after sitting still for over 10 years! lol... It even comes with a remote control that allows you to make your phone record vis bluetooth - or stop recording just by pressing the button. (I haven't tried it yet, but hopefully it works). I actually bought a separate remote because I didn't know it came WITH one - but it does!I DID knock off a star because I DO feel that if I had to start readjusting it repeatedly - that something would snap off. But I just need something to hold my camera FOR NOW; I'll get one of the big boys from B&H maybe next year - if I feel I just NEED it. But for right now, this is PERFECT - a MUST HAVE for $35 if you're doing ANY kind of camera work. 😊👍",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria A Astorga",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM4WG3SKENMODXI2WEJ2B6IGXMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11KF83M3JK29Q?ASIN=B0CDQ5DZG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Fantastic",
                "reviewText": "I was impressed with the quality and functionality of this tripod; Because the moment I took it out of the box, I could see how good the materials and design were. It's smooth and easy to install.I used this tripod to shoot some home videos. This tripod is pretty sturdy. Easy to control and get all the close-ups. Small and compact, it's easy to put in a closet when not in use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amyamy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFT7EERXT5RY6434JK5T5ECDECA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REZ63SBHQTA6N?ASIN=B0CDQ5DZG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Lightweight yet sturdy tripod",
                "reviewText": "This tripod feels lightweight yet very sturdy. It is very easy to set up, and the 6 level of different heights meet my need to take pictures in any situation. It came with a nice storage bag which is a bonus. Great value for the money!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WQjSCJinL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61jvEovkxsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7112u4RcqvL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IICjmi66L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71fkqCEkYkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBWNVHQVDRQZB5KSILXE72XBUJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28Y6CS1RI2LOY?ASIN=B0CDQ5DZG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Very light and easy to use!",
                "reviewText": "One of the more affordable tripods! It's not very light or very heavy, but strong and rigid! It's high enough to meet any of your needs! Do not hesitate to choose this one for your videography/photography needs is worth it! And I only used it for a few weeks, but found it built well. It also has all the tripod features I'd expect, and it's very portable! .",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hunter Lorance",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFX633PF6UUOXUQGXNGZ7FBO7YJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CB1USXE71313?ASIN=B0CDQ5DZG7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Adjustable, affordable, sturdy. Overall great product.",
                "reviewText": "I used this product for various projects and was very pleased with the adjustability and sturdiness of the tripod. You can use it on uneven surfaces and is very adjustable to allow you to get the angles you need. Great for timelapses, YouTube videos, recording sports, etc. I highly recommend this product after over a year of use.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana Petry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 30, 2022",
                "reviewTitle": "Vale o preço",
                "reviewText": "Produto muito bom, firme, com parte dos pés emborrachados e fácil de manusear. Fiquei indecisa com relação ao valor, mas no final valeu a pena. Pensei no valor da câmera x fragilidade dos outros suportes, e optei por esse, mais confiável.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JLOUED",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 14, 2022",
                "reviewTitle": "Tres bon produit, leger simple d'utilisation",
                "reviewText": "Très bon produit, léger simple d'utilisation",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 26, 2022",
                "reviewTitle": "Super great product",
                "reviewText": "Super sturdy, incredible value. Would 100% recommend",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mark urban",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2022",
                "reviewTitle": "worth the money",
                "reviewText": "works well the way it is. mine came with only three legs though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 28, 2022",
                "reviewTitle": "wobbly head and has a scratch",
                "reviewText": "i was disappointed when i open it cause it has a scratch for a brand new tripod and wobbly head 🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️the legs on this tripod is sturdy and solid",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}