{
    "remaining_requests": 39704,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SmallRig-Aluminum-Desktop-Camcorder-6kg-4289/dp/B0CP4WX98N",
    "body": {
        "name": "SmallRig Aluminum Mini Tripod 20 in/ 52 cm Desktop Tripod with 360° Ball Head, Compact Desktop Tripod for DSLR Camera Video Camcorder, Load up to 13lb/6kg-4289",
        "price": "$54.90",
        "originalPrice": "",
        "rawPrice": 54.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SmallRig-Aluminum-Desktop-Camcorder-6kg-4289/dp/B0CP4WX98N",
        "soldBy": {
            "sellerID": "A22PRX6WI8E2K6",
            "name": "SmallRig",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A22PRX6WI8E2K6&asin=B0CP4WX98N&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/3107Cyrs5HL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51F93Y6Dh3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wZxFOEBoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51q71m7kg1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pDAzvCvJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411C5XkJYVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/6176JJZHvTL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02e3e11c-1f6e-49eb-9cc7-4282bc66b671/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SMALLRIG Store",
            "link": "https://www.amazon.com/stores/SmallRig/page/6EE43315-D8D3-412E-BC03-029F56132C78?ref_=ast_bln"
        },
        "brand": "SmallRig",
        "merchantInfo": "SmallRig",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 15,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 15 hrs 58 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Compact and Convenient】SmallRig Aluminum Mini Tripod VT-20 4289 is the perfect mini tripod for compact DSLRs, mirrorless cameras, smartphones, action cameras and other devices. Its foldable aluminum alloy legs and center column design allow for compact storage, making it only 18cm/7 inches in length and weighing under 700g/1.5lbs.",
            "【Effortless Adjustments】Utilizing a 5-section leg design and a quick tightening mechanism, this mini tripod allows for quick and easy height adjustments, with a working height range of 17cm/6.7in to 52cm/20 in.",
            "【Versatile Shooting Angles】The travel tripod has a quick angle adjustment lever, offering three angle options (23°/50°/80°) to meet different shooting angle demands. The center column can be disassembled and installed in reverse, providing more shooting perspectives.",
            "【360-degree Ball Head】The ball head for Arca-swiss provides 360° panoramic movements and a 90° notch for vertical shooting scenarios, allowing you to take photos at any angle with horizontally and vertically. And it can support a maximum load of 6kg/ 13.2lbs.",
            "【Expandability & Package Includes】The tabletop camera tripod has a 1/4\"-20 threaded hole that are compatible with accessories such as magic arms, allowing for the attachment of microphones, monitors, and other transmission devices. The package includes a tripod*1, allen wrench*1, smartphone holder*1, hook*1, and user manual*1."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Tripods & Monopods",
                "link": "https://www.amazon.com/Tripods-Monopods/b/ref=dp_bc_aui_C_3?ie=UTF8&node=499306"
            },
            {
                "name": "Complete Tripods",
                "link": "https://www.amazon.com/Complete-Tripod-Units/b/ref=dp_bc_aui_C_4?ie=UTF8&node=499310"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "8.23 x 3.82 x 3.58 inches"
            },
            {
                "name": "Item Weight",
                "value": "700 Grams"
            },
            {
                "name": "ASIN",
                "value": "B0CP4WX98N"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 15 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#208 in Complete Tripod Units"
            },
            {
                "name": "Date First Available",
                "value": "December 21, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "SMALLRIG"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "SMALLRIG"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Compatible Devices",
                "value": "Camcorder, Camera, Smartphone"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Compact, Flexi, Adjustable"
            },
            {
                "name": "Material",
                "value": "Aluminum"
            },
            {
                "name": "Weight Limit",
                "value": "13.2 Pounds"
            },
            {
                "name": "Maximum Height",
                "value": "52 Centimeters"
            },
            {
                "name": "Tripod Head Type",
                "value": "Ball Heads"
            },
            {
                "name": "Minimum Height",
                "value": "17 Centimeters"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/73f17a2a-cef0-4ed9-8c22-0cc777c190a6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02138a54-00b1-4816-a491-7cd40a662262.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/85dbe4fe-7a44-4b64-a8c7-c84f93cebfc6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37f2e2df-22ba-4669-8b62-7050f7aaffa4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/84f9bf73-71fe-4281-8c20-ae33d12270f9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efe5fc58-f1be-4996-9fd1-cec8e4198636.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bigg BobBigg Bob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFH2B4BGJAFWENIY5LYTPXK7VICQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8P0I3KUF4KIS?ASIN=B0CP4WX98N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars 5 stars? No way. Not enough. 9.8 stars for me!!!!",
                "reviewText": "SmallRig - you folks KNOCKED THIS RIGHT OUT OF THE PARK, OVER THE PARKING LOT, TO STREET RIGHT NEXT TO IT!!! This is an EXTREMELY well thought out and well engineered tripod. Whether you’re a content vlogger, photography enthusiast, or professional photographer, this mini tripod is wonderful. Everything it says, it absolutely does flawlessly. The build quality is excellent, and, there is absolutely no question whatsoever the design team really considered the potential uses in terms of durability, stability, versatility, and strength. It includes a metal ball head which was honestly unexpected and the locking wing nut tightens down exceptionally well - enough to easily support a professional camera with accessories. The feet do not slip under load and the camera does not tilt down under load. I tested with my Nikon D850 with a 70-200 lens, battery grip, and an L-Bracket which is a tank of a setup;; it was completely stable… meaning that professionals can rely on it even with the newest flagship mirrorless cameras; it did not feel at all like it was going to tip over under load. But if you feel like it might if you put a larger lens on it, well, there’s also a hook that comes with it that attaches to the bottom of the column so that you can weight it down like a standard tripod. That was a very nice touch. But if you don’t have something to effectively weigh it down, just because I’m on the conservative side, I probably wouldn’t put a larger lens on it; but I would feel comfortable adding a teleconverter.The legs can flatten out almost entirely so that the tripod is completely flat on the ground or the table, and the center column raised up to the same height making 4 points of contact with the ground or table surface. The column head does extend up, but just enough so that it is still very stable. The lock ring locked the center column firmly in place and it does not wobble or otherwise feel laterally unstable if you raise the head up to its maximum height. However, just to be conservative, I wouldn’t raise it under full load more than half of its maximum extent… but it can handle it (and I’m just overly cautious).The head of course, is a metal ball head with an Arca-Swiss type plate. It is perhaps a little small, but it can be swapped out readily with a larger plate. The image above is using the plate that came with the tripod which connected perfectly and did not feel like it was poor quality. But, again, I’m really conservative so swapped out the plate with another and of course, the ball head uses standard screws so just about any plate can be used. Swapping out the plates was very easy and they felt very secure when connected.I was shocked to find it also had a female thread (1/4”) drilled into the column allowing you to also connect a (lightweight) accessory light to it if you wish. That really caught my attention. And the really nice touch was the phone clamp. It is very clever and very well designed. It expands like any other, and the connection is firm, but the material feels higher quality, easily accommodated my iPhone 14 Pro Max with a large case, and more importantly, comes with threads on both one of the sides and on the bottom allowing you to mount a cell phone in either a vertical or horizontal orientation, while keeping it centered over the tripod column for stability. And when you’re finished using it, it folds up very small; it is very compact. In fact, it fit completely within the side tripod pouch of my camera backpack.There is one, and only one, thing I noted that could be improved and that is the tripod leg locks. Those did feel rather lightweight and the quality, in comparison with the rest of the tripod, does not feel as robust. They didn’t quickly catch the stops - had to make a couple of tries to get them to lock in place. HOWEVER, in comparison with the rest of the tripod it is a minor deficit. As you can tell from my review, my opinion is buy it, you’ll love it!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BxoUR6vrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Dzl9Qj+PL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71IDGbuVJhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "SocKeTPupPet 🤖",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAWRTD45YBFGH3XKVPUKZKDGGIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28Q7AYCHBEMEV?ASIN=B0CP4WX98N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Stout and versatile all metal mini tripod suitable for my Dwarflabs smart camera",
                "reviewText": "Solid mini sized tripod with very smooth ball head and all aluminum construction. Love the adjustment range on this SmallRig mini tripod. The quick adjusting twist lock legs are more than adequate for quick leveling on uneven surfaces. It's constructed out of aluminum on most of the tactile adjustment components and only the feet are made of non slip rubber. Even the bottom cap that normally has a hook attached to it for loading stability by adding weight is aluminum (although this can't really utilize anything of length to add stability), the construction is more stout than some of my larger full size tripods that actually need the stronger threaded cap/ hook assembly. I usually dislike ball heads, but this one has a super easy and quick to adjust long lever style knob for secure hold. The 1/4-20 threaded hole on the base is convenient for adding my phone when trying to locate stars and constellations at night when the DWARF II cameras is setup on this. Perfect height and adjustment range to setup on a bench or on top of your vehicle for those night time astronomy shots. The Dwarf II smart cam is just under 3 pounds fully loaded, but occupies a wider footprint than your traditional DSLR camera, and solid stability can easily be had with the multi position width legs. This is my first SmallRig Tripod, and if this is their standard of build quality, I'll have to consider them again in the future for my larger tripods. Solid product, but the included plastic phone holder is on the other end of the rating scale. Luckily I have other options in my gadget stash that can replace this for a more secure hold and less flexy option. Easy 5 star rating on this SmallRig mini tripod.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KmplawesqKmplawesq",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZECRBJKJGTE2YGHLLR7WWREDUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R142VH4OU0EYFI?ASIN=B0CP4WX98N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Small and Solid - This SmallRig Tripod is Almost Perfect",
                "reviewText": "Like many amateur photographers my shelf of accessories is full of small, low cost, tripods used for so many situations where the normal, full sized, tripods are either unsuitable or overkill. This SmallRig Aluminum Mini Tripod fills the need for those low to the ground macro shots as well as those table top shots needed for product reviews or other small scale photos; it performs those functions with many of the same mechanical abilities found in its larger brethren.The tripod comes well packed in its branded box with the tripod wrapped protectively in a dedicated cardboard roll. Once unwrapped you'll find the tripod itself, in its transport profile with the legs flipped up surrounding the inner tube and ballhead. After lowering the legs you find the ballhead itself with the quick release plate locked therein. In addition the to provided quick release plate I was able to install other arca-swiss railed plates which all worked perfectly with the ballhead's locking mechanism. The levers to lock/loosen the plates, the ballhead movement and the pan control are all sized well for easy access and use. The tripod itself is made of aluminum and is sturdy enough to carry the weight of my Nikon D750 with both the MB-D16 battery pack (not pictured) and either the AF-S Nikkor 24 - 120mm 1.4 G or the AF-S Nikkor Micro 105mm 1:2.8 G lens attached. Both those setups are very weighty so this tripod is definitely sturdy enough for most users and uses.This is not to say that this tripod is without problems. Chief amongst those is the manner in which the different angled stops of the tripod legs operates. Like many of its larger kin the leg angles are set by use of rocker switches which you push in to move the leg to the either the next of prior angled stop. In my experience with this tripod it is very easy to miss the stop you are attempting to set with the only work around being to very slowly move the leg to the desired position listening very closely to the click sound indicating that it is at the actual stop rather than some other point that is either the wrong stop or, worse, at no stop at all. It is very easy to miss your desired stopping point requiring you to have to move the leg up and down until you finally find the correct stopping place. In addition I was less than perfectly satisfied with the operative tighness of both the central column and pan locks - both of which allow some movement even when fully locked.Having said all that I am, overall, very happy with the SmallRig Aluminum Mini Tripod. Yes there are problems which I hope will be fixed in future iterations and I have therefore deducted 1/2 star from what otherwise would havwe been a solid 5 star rating. But even at the strong 4 star rating that I think this tripod deserves, I still think that anyone looking for a reasonably priced small tripod should definitely have the SmallRig Aluminum Mini Tripod at or near the top of their consideration list.(Please see below for my rating criteria):=============================================================Disclosure:As noted by Amazon, I am part of the Vine Program which means that I acquire products at no cost in return for a truthful rating. However, although Vine Members pay nothing up front to get these free products they are considered by the Internal Revenue Service as taxable income at the full retail price at the time we get them and we, therefore, must pay taxes on these items.On a more personal note I often read reviews for products I am considering buying and rely on those reviews that are detailed and come off as honest and full reviews on the product. I therefore try my best to give a true and honest review based on my own experiences with the product.My Rating Scale:1 star. This is the absolute lowest I can go and is a definite recommendation against being purchased.2 stars. Less than average - having issues that I try to delineate in my review. I personally would not pay for this item.3 stars. Average - neither great nor terrible. It will do the job it is supposed to do but without any obvious good or bad issues.I might or might not buy this item depending on the severity of my need or want.4 stars. While the product is better than average it is not an excellent product. I would probably buy this product.5 stars. Enough above average that it exceeds my expectations of how the product would and should perform. A product getting this rating is highly recommended.Further middle ratings: The above explanation is the base of the recommendations I give in a review. Some ratings are further rated as soft (1/2 star below), solid (the star rating given) or strong (1/2 star above)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51187qmVhCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61F2e9MldML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61SpYmJ9lcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+yc4DXjyL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-QPi9K2HL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71C+TZMYTXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71H5YUCdGfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81LhAK7B-CL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81VKuU9ElZL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}