{
    "remaining_requests": 39760,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SUNPAK-620-020-Sunpak-Tripod/dp/B00009UT28",
    "body": {
        "name": "Sunpak 620-020 Tripod,Black, 3-way",
        "price": "$18.95",
        "originalPrice": "$18.95",
        "rawPrice": 18.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SUNPAK-620-020-Sunpak-Tripod/dp/B00009UT28",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41kwEq-ca2L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: SUNPAK",
            "link": "https://www.amazon.com/SUNPAK/b/ref=bl_dp_s_web_20287047011?ie=UTF8&node=20287047011&field-lbr_brands_browse-bin=SUNPAK"
        },
        "brand": "SUNPAK",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 520,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 35 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 18 hrs 50 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Travel tripod designed for compact still or digital cameras and camcorders",
            "3-way pan head with tilt reference scale and separate locking controls",
            "Quick-release mounting plate with retractable video indexing pin",
            "Gearless lift-and-lock center column permits quick height adjustments",
            "Extends from 18.5 to 49 inches; 19.7 inches when folded; weighs 37 ounces"
        ],
        "description": "Product Description Light duty tripod that extends to 48.9\". Three leg sections and weighs 2.3 lb. Supports up to 4.4 lb. Lift and lock center column. The tripod has a 3-way panhead with quick release. From the Manufacturer Lightweight and compact, the 2001UT is an excellent travel tripod. Designed for use with compact still or digital cameras or camcorders, the 2001UT offers a 3-way pan head with tilt reference scale and separate locking controls, and features a quick-release mounting plate with retractable video indexing pin. With a folded length of only 19.7\", the 2001UT extends to 49\", yet weighs a mere 37 ounces with its solid 22mm leg diameter. Added stability from metal center leg braces with separate locking knob assures rigid support, while heavy-duty rubber leg tips keep the 2001UT tripod in place at all times. Quick-release leg locks make setup fast and easy, even while wearing gloves. The gearless \"lift n lock\" center column, with its large, ribbed locking collar, permits fast height adjustments, while a separate tension/load control can be set for cameras weighing as much as 4 lbs. 6 oz. All UT series tripods feature unique styling and a distinctive champagne finish. Features on all UT series tripods include 3-way pan heads with reference scales, large locking panhandles, quick release platforms, metal center leg braces, tension/load adjustment, quick-release leg locks and heavy-duty rubber leg tips, some with leg spikes, for fast setup and rock solid stability. Every UT series tripod includes a free 2nd quick-release mounting plate for a second camera/camcorder.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Tripods & Monopods",
                "link": "https://www.amazon.com/Tripods-Monopods/b/ref=dp_bc_aui_C_3?ie=UTF8&node=499306"
            },
            {
                "name": "Complete Tripods",
                "link": "https://www.amazon.com/Complete-Tripod-Units/b/ref=dp_bc_aui_C_4?ie=UTF8&node=499310"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "21 x 4.25 x 4.25 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.3 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B00009UT28"
            },
            {
                "name": "Item model number",
                "value": "620-020"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 520 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#624 in Complete Tripod Units"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "May 14, 2003"
            },
            {
                "name": "Department",
                "value": "Unisex-Adult"
            },
            {
                "name": "Manufacturer",
                "value": "Sunpak"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Brand",
                "value": "SUNPAK"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Compatible Devices",
                "value": "Camcorder, Camera"
            },
            {
                "name": "Special Feature",
                "value": "Alcohol-Free"
            },
            {
                "name": "Material",
                "value": "Plastic"
            },
            {
                "name": "Weight Limit",
                "value": "4.4 Pounds"
            },
            {
                "name": "Model Name",
                "value": "Sunpak 620-020 Tripod,Black, 3-way"
            },
            {
                "name": "Maximum Height",
                "value": "49 Inches"
            },
            {
                "name": "Tripod Head Type",
                "value": "Pan Heads"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GreatDane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFS7P5NDOB3YC5QI4UKBYDN7RKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPVXNPAY9LBZL?ASIN=B00009UT28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2011",
                "reviewTitle": "5.0 out of 5 stars Better than expected",
                "reviewText": "The Sunpak 2001UT tripod arrived promptly. It was shipped in a very large box which I thought was a little odd. The retail box inside was in perfect condition - maybe because of the large shipping box ;o)The tripod was also found in excellent condition - no scratches, nothing broken and had that \"new\" smell to it.I found that the tripod was easy to use. I don't have much experience with tripods but the use of this one is very intuitive. I love that it came with two quick-release plates, one for my Rebel T1i and one for my smaller point-and-shoot camera.I originally wanted a tripod so that I could shoot better videos. Panning without a tripod cannot be recommended ;o) I made a couple of tests with my Rebel and a 250mm zoom lens and found that even if I zoom in on something from far away, the tripod performed perfectly. I don't recommend this kind of video shooting with the center pole raised, though. It makes the tripod a little less sturdy. You can raise the center pole when you are not zooming all the way in. That will work just fine.Now that I acquired a tripod, I decided to also experiment with some long exposure still shots. To my surprise, I realized that I had not really been using my Rebel to it's full capability. It's like a new dimension to photography ;o) Exposure times of 3-5 seconds combined with full aperture allows me to shoot extremely nice pictures with very little light. I use a wired remote control for those shots, but I could have used the delayed exposure feature on the Rebel, I guess. I don't think any tripod is sturdy enough to prevent some shaking when the camera is operated the conventional way. With the use of a remote control or delayed exposure this can never be an issue.When I need to level the tripod, I found that my smartphone is an excellent tool. The receptor for the quick-release is flat and level, so with the help of a smartphone app called \"Bubble\" I am able to get the tripod 100% leveled.The Sunpak 2001UT tripod should be your first tripod. I absolutely recommend it for any entry level photographer. You will get a lot more than you pay for!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WakkyWabbit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMYV5RDCUMOZBVE2MRPO6O3PQSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KNTWDRURCB78?ASIN=B00009UT28",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2013",
                "reviewTitle": "5.0 out of 5 stars No brains operation, built solid, great price. I own two.",
                "reviewText": "The media could not be loaded. Initially I bought a flexible tripod for a Roku projector. It took a lot of adjusting. A lot. So, I decided to purchase a real tripod. The cost difference was $4. I thought a nice tripod would cost a lot more.Arrived well packaged and intact. No assembly. No instructions needed. Looks very nice and professional. Appears to be well built and sturdy. It comes with two attachment plates that fit into the bottom of cameras (one already attached to tripod, second in box).I had my Roku attached in less than a minute. Adjustments, including leveling are super easy. It took less than 3 minutes from opening the box til I was watching TV. Height adjustment is by flip levers, not screws. Mounting plate is fixed by a screw knob. There is a handle lever also for adjustment. No brains operation.Very pleased with this purchase.=================2/15I needed a second tripod so I purchased a Targus from Walmart and the quality was very poor. It was flimsy and unstable. None of the locking mechanisms worked. I was holding it together with duct tape. When I say not one part of the tripod worked properly, I am not exaggerating.So, I ordered another Sunpak from Amazon. The quality is consistent with the first unit. For the price, this is a very well built tripod. I am very pleased with both Sunpaks. If you need a well built tripod that has most of the bells and whistles for a cheap price, the Sunpak cannot be beat.Important note: Sumpak customer service does not have a working phone number. I have not tried email.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/D12Jr4F+K8S.mp4"
                }
            },
            {
                "reviewerName": "J. Price",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBGAH7GFQHZTJMQDYHLGNZ5RAAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AYU32NTAEYE9?ASIN=B00009UT28",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2011",
                "reviewTitle": "4.0 out of 5 stars Cheap, Functional, Not Perfect",
                "reviewText": "I guess for the price of $15-20, it's hard to complain too much. I'll do my best to put down some concise ideas about what I'm happy with and what I'm not.Pros:- Simple construction; easy to use- Mounting plate seems to be compatible with any type of camera, video or photo.- Very compact and light construction, easy to carry around- THE PRICE! (cheaper than any tripod I could find anywhere)Cons:- Maximum height is slightly deficient at 40 inches, making nature shots ok but portraits difficult- Light construction means a little less strength and rigidity, legs are spindly and tend to flex a little. The bases or stoppers on the bottoms of the tripod legs are very thin, so a completely level and stable area is needed for the tripod. (ie. if you were to set the tripod on an even slightly uncompacted surface, like soil or sand, the skinny legs would quickly sink in, providing no stability)- No bubble or other type of level to make sure that your recording device is actually level and not tilted to one side or the otherConclusion:- If you just need a cheap tripod to throw around for nature shots and other non-human subjects, this will work perfectly. If you want a tripod for standing level portraits, this will not suffice, due to its height deficiency. It is functional in every other regard.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}