{
    "remaining_requests": 39908,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/UBeesize-Quick-Release-Cellphone-Compatible-Smartphones/dp/B0C69SXB61",
    "body": {
        "name": "UBeesize Flexible Tripod with Quick-Release Plate for Camera and Cellphone, Mini Tripod Stand with Remote and Clip for Video Recording, Vlogging, Compatible with Smartphones,Gopro, Webcam",
        "price": "$15.99$14.12",
        "originalPrice": "$15.99",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/UBeesize-Quick-Release-Cellphone-Compatible-Smartphones/dp/B0C69SXB61",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CN2B52PC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C69SXB61",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41pdy0ZZYyL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41j2yB-sMeL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41pdy0ZZYyL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/519-p9rp2UL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51C3fp6g3VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VAYO42HPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cLrmAQL2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519dNy-NfjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51dRhWNfUWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/9af624ab-5981-4af2-8dbb-b9853f8ff1de/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c0da1aab-0d04-4212-84dd-1cb6e6743b3a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/05b2081f-64e8-4579-8374-79a2de01d4b4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04efd73e-550b-4dcb-a46f-8f7ce0b5c8b6/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a389b511-82e9-4fa4-877b-ecbc305c9875/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/052c8b6d-b470-4d41-9ce1-65ba6ca3e992/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the UBeesize Store",
            "link": "https://www.amazon.com/stores/UBeesize/page/04111BDD-CAFD-4DB8-8D20-1F5A3BF35738?ref_=ast_bln"
        },
        "brand": "UBeesize",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 38287,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 19 hrs 8 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Efficient Quick-Release Plate: The quick-release plate design offers numerous advantages, enabling fast camera or device attachment and detachment. It's more efficient than traditional screw-based fastening methods, improving stability and image quality while reducing the risk of blurriness or distortion caused by unstable mounting.",
            "Various Shooting Angles: The ball head tripod supports 360-degree rotation, allowing for various shooting angles, including overhead, low-angle, horizontal, and vertical shots.",
            "Lightweight and Portable: Constructed with lightweight aluminum alloy, ABS plastic, and rubber materials, our product is easy to carry and transport.",
            "Complete Accessory Solutions: Our product package includes a tripod, phone clamp, wireless remote control, and a GoPro adapter. It is compatible with GoPro, cameras, LED lights, smartphones, webcams, and other devices with a 1/4''-20 mount.",
            "12-Month Warranty Coverage: Enjoy peace of mind with our generous one-year warranty service. Should any issues arise with your tripod, rest assured that we are committed to delivering exceptional after-sales support."
        ],
        "description": "Our quick-release plate tripod enables fast, stable camera setup. 360-degree rotation for versatile angles. Lightweight, portable design. Complete accessory kit. 1-year warranty for peace of mind.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Camera & Photo",
                "link": "https://www.amazon.com/Camera-Photo-Film-Canon-Sony/b/ref=dp_bc_aui_C_2?ie=UTF8&node=502394"
            },
            {
                "name": "Lighting & Studio",
                "link": "https://www.amazon.com/Lighting-Studio-Equipment/b/ref=dp_bc_aui_C_3?ie=UTF8&node=7161086011"
            },
            {
                "name": "Lighting",
                "link": "https://www.amazon.com/Photography-Studio-Lighting/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3347871"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "9 x 2 x 2 inches"
            },
            {
                "name": "Item Weight",
                "value": "9.6 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0C69SXB61"
            },
            {
                "name": "Item model number",
                "value": "TBC001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 38,287 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#936 in Cell Phones & Accessories (See Top 100 in Cell Phones & Accessories) #11 in Cell Phone Tripods #59 in Camera & Photo Lighting"
            },
            {
                "name": "Date First Available",
                "value": "September 9, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "UBeesize"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "UBeesize"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Compatible Devices",
                "value": "webcam, Gopro, Camera, IPhone 15 Pro Max/15 Plus/15 Pro/15/IPhone 14 Pro Max/ 14 Pro/ 14/iPhone 13 Pro Max/ 13 Pro/ 13/ iPhone SE/ iPhone 12/ 12 pro/ 12 pro max/ 12 mini/ 11/ 11 Pro Max/ 11 pro/ X/ XS max/ XR/10, iPhone 8 plus/ iPhone 8/ 7/ 7 plus/6S / 6/Samsung Galaxy S22/ S21 Series/ Galaxy Z Flip/ NOTE/ Google Pixel Series/ One Plus 1+Series See more"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, flexible, Foldable, portable"
            },
            {
                "name": "Material",
                "value": "Alloy Steel"
            },
            {
                "name": "Weight Limit",
                "value": "6.6 Pounds"
            },
            {
                "name": "Maximum Height",
                "value": "9 Inches"
            },
            {
                "name": "Tripod Head Type",
                "value": "Ball Heads"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/caf6944f-d574-4745-a0ae-820c29d250ce.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/29a3d3e9-d17e-49ee-931b-d830abfbb046.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5676a206-d1f8-4001-847a-6c583fd8d347.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f1e68129-8c7c-4760-ac2b-f1892c3c33b7.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/89afe740-7d57-4a77-81af-400700478c03.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Srishtik SikdarSrishtik Sikdar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEV7TVL6IP5YDLBNVURQCH5QGQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16M1ODT44SPZS?ASIN=B0C69SXB61",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Exceptional Quality and Versatility",
                "reviewText": "The UBeesize Flexible Tripod has exceeded my expectations in terms of both build and functionality. Right off the bat, I was impressed by its high-quality construction. It's evident that great care and detail went into making this product.The bendable legs are a standout feature. They not only offer unparalleled flexibility but also serve as a perfect grip for a wide array of objects, from strollers and cribs to numerous other surfaces. Additionally, these legs can be adjusted to function as a handy grip, providing an easy and comfortable handheld option for my on-the-go shooting needs.Most importantly, it accommodates my iPhone 13 Mini flawlessly. The secure fitment ensured that I never once feared my phone would fall out. The secure hold puts any worries about device safety at ease, allowing me to focus solely on capturing the best shots.Overall, I highly recommend the UBeesize Flexible Tripod. Whether you're a casual user or a photography enthusiast, you'll appreciate the quality, flexibility, and reliability that this tripod offers. It's not just a tripod; it's a game-changer in mobile photography.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7136FKXeN7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81409AqIRlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81lD2hKCBjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81oG4+pViqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Michael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2GTP2IFPFFWB4FOGDZ2WMH4J7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SGZQ7OQU8YMM?ASIN=B0C69SXB61",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 24, 2021",
                "reviewTitle": "5.0 out of 5 stars Excellent value, does exactly what it is supposed to do, assembly is child's play",
                "reviewText": "I bought this as a convenient way to position my iPhone when shooting cute little videos for my friends and family. Set it on a desktop, tabletop, dresser, or any flat surface, and it serves that purpose perfectly. Combining that with the fact it is the most economically priced unit of its kind and what else is there to say? Unless you NEED something fancier or bigger (if you don't that you do, you don't) buy it.When I make a purchase on Amazon, I always check the lowest reviews first. If 75% of people give it five stars and 1% gives it one star, I read the one star reviews first.Many of the low reviews I saw on this product bemoaned the fact that it doesn't come with assembly instructions.People, there are FOUR pieces.So allow me to offer a quick tutorial since it does not in fact come with assembly instructions in much the same way chewing gum doesn't come with an insert that says, \"1. Remove wrapper 2. Chew gum.\"The first part is the tripod, it is the largest part, it has legs. You want the legs to point down. At the non-leg end is the mounting platform. It is flat, platform shaped, and has a small threaded bolt sticking up from the center of it, hinting that in the near future you will be screwing something on to it. On the side of the unit is a big, friendly, easy-to-turn knob. Loosen it (turn to the left) and the mounting platform moves in many exciting directions. Tighten it (turn to the right) and platform is locked in place. Experiment, until you find the direction that works for you.The next part is the remote control. It looks like a remote control with buttons and everything. It is for controlling things, remotely. Set it aside for now.The next part is a mounting bracket for a GoPro style camera. If you've never seen one, this might be confusing (and you probably don't need it.) A simple rule of thumb, \"Is there any conceivable way this attaches to my phone?\" If the answer is no, set it aside. For the curious, it has a base with a threaded hole in it, and three black plastic tabs, evenly spaced, with a single long screw running through the center of all three. The case for your GoPro style camera will have TWO tabs on the bottom, usually clear, and these are meant to interlock with the plastic tabs on the base, at which point the long screw is inserted through ALL the tabs and tightened down (remember, to the right) to hold your camera firmly in place.The final piece is the spring-loaded camera bracket. Find the threaded hole in the base of it. Screw it on to the threaded bolt sticking up from the top of your tripod mounting platform until it is snug (righty-tighty.) Congratulations, your tripod is assembled.The bracket has two \"jaws\" that fold down flat for easy storage. Flip them into the \"ready for grabbin\" position, so that they are at a 90 degree angle (or perpendicular as I like to say) to the piece you just flipped them up from. If you apply pressure to these \"jaws\" as though you were trying to move them away from each other, you will find that the unit is spring loaded, the jaws move apart, wide enough to accommodate vary sizes of phone. Stick your phone in there. Well done.There ARE instructions included for pairing the remote to your phone. This is very handy as it allows you to remotely activate either the video or photo function on your phone.Personally, I assume my instructions are unnecessary. I believe that you, dear potential purchaser, can (as I did) look at it for 10 seconds and figure it out. If not, I hope my instructions prove useful. If not, there is a clearly visible tab on your \"order page\" for the product labeled \"GET CUSTOMER SUPPORT.\" They have a support button for a product that any 8 year old who hasn't been eating paint chips for a few years could assemble.So really, dinging a product like this for \"not including instructions\" is just...well, I probably can't use the word I'd like to so let's just say it's unnecessary and more than a little petty.And if you ARE one of those people who felt you needed to lower your rating because it didn't come with an 8.5x11 glossy manual with supplemental color photos and a support animal please remember, take the wrapper off FIRST, THEN chew the gum, not the other way around.For everyone else, it doesn't cost much, it works just fine, it's probably EXACTLY what you're looking for. I'm certainly satisfied with it.Thank you, and good night.",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LORALORA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5TIVS3CD3OJ7QABWXNTO6BL2LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JLMYVW97E1DC?ASIN=B0C69SXB61",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2020",
                "reviewTitle": "4.0 out of 5 stars Delicate. Don't use force! Does what it supposed to.",
                "reviewText": "It definitely has a delicate cheap feeling to it. So I handled it very carefully when testing it out. Installing of the phone holder was easy. Connecting with the remote was easy. Remote feels even cheaper. So delicate hands when pushing the buttons! I wanted this kind of tripod because of its bendable legs. Planning to use it out in the woods and we'll see how it holds up and distance wise for the remote. What I noticed about the remote is that, you have to click it once to wake it up. Then click again to take a picture. If you want to take a video, simply hold down the button. Letting go will end the recording. Very simple to figure out. I didn't even need to read the instructions. The phone holder itself, I accidentally pulled it apart, but it didn't break. Easy to put it back in place. Again, delicate hands needed! Force is very unnecessary. Will update after testing it in the woods.Update: works perfect fine for me! Love it so much! It was exactly what I was looking for",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91xMrNcKgxL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "StephenStephen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOST7PAKU62PN5MQK7P2YSI3WLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D3P7EM1CPR59?ASIN=B0C69SXB61",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for still pictures",
                "reviewText": "I recently purchased the Flexible Tripod with Quick-Release Plate for Camera and Cellphone, and I must say, it's been a game-changer for my vlogging and video recording needs. This mini tripod stand is not only compatible with smartphones, GoPros, and webcams, but it also comes with a remote and clip, making it incredibly versatile. The quick-release plate is a handy feature that allows for easy and secure attachment of my camera or cellphone. The flexible legs are sturdy and can be adjusted to various angles, allowing for creative shots and stable footage. Overall, I highly recommend this tripod for anyone looking to up their video recording game. It's compact, reliable, and offers great value for the price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71oAASIIe3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81ESpY8Hz3L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TheQueenJacaraTheQueenJacara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEG4H2XCKPIHFYXZFPLNMX3GZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSQPALLAJP871?ASIN=B0C69SXB61",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Another content creator must have",
                "reviewText": "I def recommend this little tripod if you make content. Once you get the legs situated it’s stable and sturdy. Your phone won’t slide or fall out. The tripod is small in size to throw in any book bag or purse to take it with you. It also comes with Bluetooth remote for taking your own pics and video. Took me seconds to assemble and gets the job done",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HOMtwGrvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "M21L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Portable",
                "reviewText": "This tripod is very portable and convenient. I bought it to take pictures with in different places of the world by setting it up on a rock or a ledge. Very stable and sturdy. It also works if you want to watch a show on your phone. It stretches to fit all phones. Great product that serves multiple purposes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miguel Angel Alcántara ÁvilaMiguel Angel Alcántara Ávila",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 25, 2023",
                "reviewTitle": "Súper práctico y funcional",
                "reviewText": "Me encantó la base, es muy estable y el material se siente de muy buena calidad, soporta muy bien mi iPhone, que en si es pesado. Incluye un pequeño control por bluetooth que es súper fácil de conectar con iOS, también se puede conectar a android y tiene dos botones para que se pueda usar en ambos sistemas. Por último me encantó que incluyera la base para montar una GoPro. Llego súper rápido y las instrucciones son muy fácil de seguir. Me encantó!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717HhbRAYrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71M38PmIp4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 21, 2022",
                "reviewTitle": "Sturdy and legs are fully adjustable for any surface.",
                "reviewText": "Sturdy and legs are fully adjustable for any surface.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FelsenEule ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 6, 2024",
                "reviewTitle": "Meine erstes Handy Stativ seit damals mein erstes Klapp Handy bekommen hatte xD",
                "reviewText": "Ich hab mich immer bissl geärgert über wackelige oder leicht verschwomme Bilder, wenn ich bei Kleinanzeigen inserierte.Ich bin begeistert. Handy sitzt sauber und fest im Halter, das Mini Stativ steht stabil und auch die Bluetooth Fernbedienung für den Auslöser hat sich beim ersten Mal gleich gekoppelt. Letzteres wäre sicher für Selfies und Bett Fotos sicher praktisch xD Aber für meinen Zweck, nicht lebende wenig bekleidete Objekte zu fotografieren reicht es alle mal. Ein schönes funktionierendes Produkt! 360 Grad dreh und Schwenkbar arretiert gut, gibt nix zu meckern!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stefanie L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 8, 2023",
                "reviewTitle": "Optik gut. Abwaschbar mangelhaft",
                "reviewText": "Das Material ist nicht abwaschbar. Für outdoor Aktivitäten nicht von Vorteil.Daher ging es zurück",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}