{
    "remaining_requests": 44165,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Noctua-NH-L9i-17xx-Premium-Low-Profile-LGA1700/dp/B09HCLB7M3",
    "body": {
        "name": "Noctua NH-L9i-17xx, Premium Low-Profile CPU Cooler for Intel LGA1700 (Brown)",
        "price": "$44.95",
        "originalPrice": "$44.95",
        "rawPrice": 44.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Noctua-NH-L9i-17xx-Premium-Low-Profile-LGA1700/dp/B09HCLB7M3",
        "soldBy": {
            "sellerID": "A1Z5H6ZGWCMTNX",
            "name": "Noctua Cooling Solutions",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1Z5H6ZGWCMTNX&asin=B09HCLB7M3&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31unXZ7tCVL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/311adp1OUIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Fz1LBgqYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YtG4crWrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DEtCaB3wL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/911uCfgrcXL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/911uCfgrcXL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Noctua Store",
            "link": "https://www.amazon.com/stores/Noctua/page/F1E0C546-C237-4169-9654-A6C695FA7E2C?ref_=ast_bln"
        },
        "brand": "Noctua",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 176,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 16 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Proven premium heatsink (more than 200 awards and recommendations from international hardware websites), latest revision for Intel’s LGA1700 (LGA17xx family) platform",
            "Only 37mm height allows it to fit compact HTPC and Small Form Factor (SFF) cases, tailored footprint guarantees 100% RAM and PCIe compatibility on all ITX, Micro-ATX and ATX LGA17xx motherboards",
            "Renowned, award-winning NF-A9x14 slim 92mm fan with Low-Noise Adaptor and PWM for automatic speed control: full cooling performance under load, whisper quiet at idle!",
            "Includes high-end NT-H1 thermal paste and SecuFirm2 mounting system for easy installation on Intel LGA1700 (LGA17xx family) CPUs",
            "Renowned Noctua quality backed up by 6-year manufacturer’s warranty, deluxe choice for Intel Core i7, i5 or i3 with moderate heat load (e.g. 14900K, 14700K, 14600K, see compatibility list)"
        ],
        "description": "Cooler Specifications Please Note: The NH-L9i is a highly compact, quiet low-profile cooler. While it provides first-rate performance in its class, it is not suitable for overclocking and or CPUs that create high heat loads. Please consult our CPU compatibility list to find out whether the NH-L9i is recommended for your CPU. Scope of delivery NF-A9x14 HS-PWM premium fanNA-RC7 Low-Noise Adaptor (L.N.A)NT-H1 high-grade thermal compoundSecuFirm2 mounting kitScrews for 92x92x25mm fansNoctua Metal Case-Badge",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "Fans & Cooling",
                "link": "https://www.amazon.com/Internal-Fans-Cooling-Components/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3012290011"
            },
            {
                "name": "CPU Cooling Fans",
                "link": "https://www.amazon.com/Computer-CPU-Cooling-Fans/b/ref=dp_bc_aui_C_6?ie=UTF8&node=11036281"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "3.74\"L x 3.74\"W x 0.91\"H"
            },
            {
                "name": "Brand",
                "value": "Noctua"
            },
            {
                "name": "Power Connector Type",
                "value": "4-Pin"
            },
            {
                "name": "Voltage",
                "value": "12 Volts"
            },
            {
                "name": "Cooling Method",
                "value": "Air"
            },
            {
                "name": "Compatible Devices",
                "value": "Desktop"
            },
            {
                "name": "Noise Level",
                "value": "23.6 dB"
            },
            {
                "name": "Material",
                "value": "Copper (base and heat-pipes), aluminium (cooling fins), soldered joints & nickel plating"
            },
            {
                "name": "Maximum Rotational Speed",
                "value": "2500 RPM"
            },
            {
                "name": "Item Weight",
                "value": "13.5 ounces"
            },
            {
                "name": "ASIN",
                "value": "B09HCLB7M3"
            },
            {
                "name": "Item model number",
                "value": "NH-L9i-17xx"
            },
            {
                "name": "Batteries",
                "value": "1 Unknown batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 176 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#69 in Computer CPU Cooling Fans"
            },
            {
                "name": "Date First Available",
                "value": "November 7, 2021"
            },
            {
                "name": "Manufacturer",
                "value": "Noctua"
            },
            {
                "name": "Country of Origin",
                "value": "Taiwan"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The NH-L9i-17xx is the latest, LGA1700-specific revision of Noctua’s award-winning NH-L9i low-profile CPU cooler for Intel-LGA17xx based HTPCs and Small Form Factor (SFF) systems. At a height of only 37mm, the NH-L9i is ideal for extremely slim cases and, due to its small footprint, it provides 100% RAM and PCIe compatibility as well as easy access to near-socket connectors even on tightly packed mini-ITX motherboards. The custom-designed SecuFirm2 mounting system for the LGA1700 (LGA17xx family) socket makes installation a breeze and, thanks to the highly optimised NF-A9x14 92mm fan that supports fully automatic speed control via PWM, the NH-L9i-17xx runs remarkably quietly. Topped off with Noctua’s renowned NT-H1 thermal compound, the NH-L9i-17xx combines everything users have come to expect from Noctua’s larger coolers into a super-compact, premium-quality package for ITX and HTPC builds with Intel LGA17xx family CPUs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cb2f650-818d-477b-a4b4-e3bae84b3b3c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "37mm low profile Due to the slim 23mm heatsink and the NF-A9x14 low profile fan that measures only 14mm in thickness, the NH-L9 stands a mere 37mm tall, which makes it ideal for use in compact HTPCs or Small Form Factor cases that offer minimum clearance for CPU coolers. 100% RAM compatibility The NH-L9i has a 95x95mm footprint that complies exactly with the Intel LGA1700 (LGA17xx family) socket keep-out zone. This means that it won't cause issues with VRM heatsinks and doesn't overhang the RAM slots, so it's fully compatible with tall memory modules. 100% compatibility with PCIe cards on mini-ITX Some mini-ITX motherboards have the PCIe slot sitting close to the 95x95mm socket zone. While larger coolers that exceed this zone are likely to block the PCIe slot, the 95x95mm sized NH-L9i provides full compatibility with PCIe cards. NF-A9x14 PWM premium fan The highly optimised NF-A9x14 premium fan features Noctua's proprietary AAO frame as well as sophisticated aerodynamic design measures. Supporting PWM for fully automatic speed control, the NF-A9x14 allows the NH-L9i to stay remarkably quiet.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3383f756-53ef-4cf5-81d8-3cfd5f6ed13e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d3035637-7cd6-4986-adf9-c6f3f7e7773e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd21a800-42ca-4e13-b318-957733545f33.__CR0,0,300,300_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e06c8816-5adc-499e-a6f7-e846fac891aa.__CR0,0,300,300_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Measurements Height (without fan) 23 mm Width (without fan) 95 mm Depth (without fan) 95 mm Height (with fan) 37 mm Width (with fan) 95 mm Depth (with fan) 95 mm Weight (without fan) 345 g Weight (with fan) 420 g Material Copper (base and heat-pipes), aluminium (cooling fins), soldered joints & nickel plating Cooler Specifications Please Note: The NH-L9i is a highly compact, quiet low-profile cooler. While it provides first-rate performance in its class, it is not suitable for overclocking and or CPUs that create high heat loads. Please consult our CPU compatibility list to find out whether the NH-L9i is recommended for your CPU. Scope of delivery NF-A9x14 HS-PWM premium fanNA-RC7 Low-Noise Adaptor (L.N.A)NT-H1 high-grade thermal compoundSecuFirm2 mounting kitScrews for 92x92x25mm fansNoctua Metal Case-Badge",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/e04a707c-b187-4a28-9220-a44add64d577.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "New revision for Intel’s LGA1700 (LGA17xx family) socket Since the original NH-L9i for LGA1200 and LGA115x has received more than 200 awards and recommendations from international hardware websites and magazines, the new 17xx revision builds on the same proven heatsink design to provide excellent low-profile cooling performance for LGA1700 CPUs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/88663b0b-3439-45f3-9a18-33741ff20753.__CR0,0,970,300_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "NH-L9i NH-L9i-17xx NH-L9a-AM5 NH-L9i chromax.black NH-L9i-17xx chromax.black NH-L9a-AM5 chromax.black LGA2066, LGA2011-0 & LGA2011-3 X X X X X X LGA1700 X ✓ X X ✓ X LGA1200, LGA115x (LGA1150, LGA1151, LGA1155, LGA1156) ✓ X X ✓ X X LGA775 & LGA1366 X X X X X X Xeon LGA2011 Narrow ILM / Xeon LGA1366 & LGA1356 X X X X X X Xeon LGA3647 X X X X X X Xeon LGA4189 X X X X X X AM4 with NM-AM4-L9aL9i X with NM-AM4-L9aL9i with NM-AM4-L9aL9i X with NM-AM4-L9aL9i AM5 with NM-AM5-L9aL9i X ✓ with NM-AM5-L9aL9i X ✓ sTRx4, sWRX8, TR4, SP3 X X X X X X",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/48eddcac-2e12-4094-9d60-f80ce9a43494.__CR0,0,600,180_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cb2f650-818d-477b-a4b4-e3bae84b3b3c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3383f756-53ef-4cf5-81d8-3cfd5f6ed13e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d3035637-7cd6-4986-adf9-c6f3f7e7773e.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cd21a800-42ca-4e13-b318-957733545f33.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e06c8816-5adc-499e-a6f7-e846fac891aa.__CR0,0,300,300_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/e04a707c-b187-4a28-9220-a44add64d577.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/88663b0b-3439-45f3-9a18-33741ff20753.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bcde7d8f-2594-45c7-a7a5-201713af6c53.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1a9f023-fb55-40eb-9487-0c0b17ad7f57.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/716fc493-50f7-4418-98b2-87b2de1dbd80.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cfe6d99-667c-4176-8185-ba3143e116bf.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "EmbeddedFlyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY7DVH6BSZWM735FPL7UK74Y57A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGRE987CAXRWO?ASIN=B09HCLB7M3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2022",
                "reviewTitle": "5.0 out of 5 stars Is better in every way than the stock Intel socket 1700 cooler",
                "reviewText": "Ignore the few oddball reviews claiming this cooler is inferior or no better than the OEM stock Intel 12th cooler. They did something wrong. Under identical conditions The Noctua NH-L9i results in temps around 10 degrees cooler than the Intel cooler AND with much less noise. With a six core i5-12400F running various CPU stress tests I couldn't get the CPU over 66C vs 75C with the Intel cooler. With a 8+4 core i7-12700F the Noctua kept it under 85C vs 95C with the stock cooler. I tested with the motherboard in open air under identical conditions. Your temps might vary with your case cooling but the fact is the Noctua outperforms the stock Intel cooler and is quieter while doing it. And that should always hold true.The Intel cooler has a round contact area that only makes contact with perhaps 60%-70% of the rectangular CPU heat spreader. That's just brain dead on the part of Intel. The Noctua cooler makes contact with the entire heat spreader which helps it remove significantly more heat. Further Intel puts stupid cosmetic plastic trim on their cooler which likely only further inhibits airflow. It's classic marketing department form over function.The difference in noise is huge. At any RPM the Noctua is much quieter. Even at full speed (a still low 2400 rpm) the Noctua is impressively quiet and it's subjectively a much more pleasant noise than the jet spooling up for take off noise of the Intel cooler at 100%.The NH-L9i also fit my very cramped mini-ITX Gigabyte Z690 motherboard beautifully. You can also get the Noctua fan shroud kit for some applications so it can pull cool outside air giving it another huge advantage over the Intel and other coolers.The Noctua also provides downward airflow that gets directed over the motherboard chipset, SSD, VRM, RAM, and other parts that really benefit from and are designed around a downflow OEM style heatsink airflow.Those complaining about the mounting tabs not being flush with the motherboard don't understand the need to tension the heatsink to the CPU. The whole idea is to use the mounting tabs as springs to create the perfect tension for the best CPU contact without over-stressing anything. It's a very smart design that creates the right amount of contact force when the arms \"bottom out\" against the motherboard.Overall this is a great cooler for a great many applications. If you want to run an over clocked K series CPU you likely need a bigger cooler. But for compact small form factor builds, this is the best cooler I know of and genuinely shames Intel's provided cooler.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ortron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDN5BPQLIEF7QINYECMXQLF2T3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2O747N1GS046J?ASIN=B09HCLB7M3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Listen Linda....",
                "reviewText": "So, I've fallen hard on the personal PC world. Built a serious PC at first then I wanted a bad@ss smallest possible PC SFF build that had a handle and portable af. Right, so I went with the beloved S300 case and that case is great (really). Went with a Asus Rog 760-i, Teamwork 6400 ddr5, 12600k (oops) the thermals will never allow 4.9ghz. More like 4.2ghz. So, I bought the best low profile CPU cooler money can buy, this one. I even upgraded to the bigger fan that this kit kindfully supplies the screws for. (Very kind and helpful) sooooo I married it with a super slim 4070ti...... keep in mind the 12600k will never reach actually potential. So this radiator does the best it can... You will never reach liquid cooling temperatures, or even a dual fan radiator. Not even close. I'm talking 69 Celsius gaming. It's messed up cause Google tells you anything under 80c is A-ok. So..... I guess this radiator is aces, but you have to be realistic what to expect. My SFF is going to run hot af and there's nothing I can do about it. So far no shut downs, but you can walk next to it and significantly feel heat. Is this unit better than the thermright version, I suppose. I'm happy with purchase just be realistic what to expect. FYI if you tune down the mhz for the ddr5 RAM it will greatly reduce the CPU heat. Don't aim for over 6400mhz. Yet, it still performs surprisingly well when gaming. Best advice, a good buy. If it fits buy thicker fan. Good luck 🤞FYI: my S300 is hella wicked for portable PC gaming.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aaron",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMM6RGMYSPYN5FJNYGWX5ENM5VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MFV7YLVY9G8D?ASIN=B09HCLB7M3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars obviously better temps with less noise than stock Laminar RM1 on LGA1700",
                "reviewText": "If your case has a side panel that lets air through right lined up with the fan on this, I highly recommend also getting the $13 official Noctua fan duct kit, NA-FT1. If you have too much clearance for that kit, look at the Noctua 65mm height cooler instead of this one.I've built 4 computers to date in the InWin Chopin. The first one was using the 200watt version of the original Chopin, and the last 3 were all in the newer Chopin Max. All were using AsRock motherboards, with Intel Core series LGA1700 CPUs.First: Chopin 200w, Intel 12400 cooled by its included Laminar RM1, Asrock B660m-ITX acSecond: Chopin Max, Intel 12100 cooled by its included Laminar RM1, Asrock Z690m-ITX axThird and Fourth: Chopin Max, Intel 12400 cooled by NHL9I with Na-ft1 duct kit, Asrock B660m-ITX acThe first unit just barely fits the Laminar RM1, a gentle pressing on the side panel will grind the fan.The second one, the Chopin Max increases the CPU clearance a little, so that grinding issue is gone, reduces the noise a bit as well, less turbulence of the blades against the mesh. We can't really compare temps as the CPU in the second one is lower powered than the first, but that's not what this review is about anyway.The third and fourth were built simultaneously with the exact same configuration to each other. The temps of the third and fourth units, using ducted Nhl9i-17xx is about 10 degrees cooler than the Laminar RM1 achieved, with significantly less noise at max load and almost no noise at all at idle.Note that I did CPUZ stress tests for my numbers. I watched CPU temps and fan speeds. Initially, I ran one of the new Chopin Max machines without the NA-FT1 duct kit and the other one with that kit installed. The unducted one under the stress test held the same 154.8f temp, but by running the Noctua fan at max 2550 rpm speed whereas the ducted one was running it at about 2270 rpm.When I forced the Noctuas to run at 80% speed, the ducted one held the temp at 158f after about half an hour, with the unducted one settling in at 170f.Once I installed the duct kit on the second machine, both had identical temps, down to less than a degree, so the duct kit is proven.Note that so far as I can tell, in the Chopin case, NHL9i is not all that much cooler than the stock Laminar RM1 included with the non-k Intel LGA1700 CPUs. Ducted, however, it's way better, and it's far quieter. It's quieter even without the duct kit, but with it, it's a whole new ball game",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYAPSUS2WLO33LGZTKLVYANW44A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FQCUVAQDJWLH?ASIN=B09HCLB7M3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Great little cooler for SFF",
                "reviewText": "The cooler is great, keeping a 13600k locked to 125w at 40C idle and 60-70C long gaming load. The fin orientation could be better as it currently faces the io ports. It was sufficient for my midori 5l sff build but I switched to the AP90 36X for a more optimized fin orientation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WVC Asset Protection",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 16, 2023",
                "reviewTitle": "great low profile cooler",
                "reviewText": "Installed these in an ASRock Desk Mini B660W and they worked perfectly. Excellent clearance and great cooling on an i5-12400. Comes with Noctua Paste, all mounting.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hugo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 10, 2023",
                "reviewTitle": "Excelente",
                "reviewText": "Excelente producto, acorde a calidad y precio, ampliamente recomendado sobre todo para formato itx",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wolfi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 6, 2024",
                "reviewTitle": "erstaunlich leise",
                "reviewText": "ich hatte zuerst nach einem low-profile Kühler für ein mini-ITX gesucht.Eigentlich bin ich über diesen Lüfter nur 'gestolpert' - wegen der geringen Bauhöhe.Aber - nach dem ersten Board - habe ich mir gleich auch mein zweites Board damit bestückt.Einen i5-11500H (Mobile-on-Desktop) kühlt er ohne je wirklich laut zu werden.Einen i5-13500 kriegt er auch gekühlt. In beiden Fällen - erstaunlich leise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hans",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on November 13, 2023",
                "reviewTitle": "Tyst och kyler bra!",
                "reviewText": "Använder denna kylare till en Intel 12400 i ett ITX chassi. Spelar dock inte spel, så vet ej hur bra den fungerar till en speldator.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 30, 2023",
                "reviewTitle": "Produit bien fini et très utile dans les boitiers ITX",
                "reviewText": "J'ai utilisé ce ventilateur avec un boitier ITX et il fait très bien le job en silence et sans surchauffe. Recommandé pour les processeurs Intel de la série 3 et 5, viser un autre modèle pour la série 7 ou 9.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}