{
    "remaining_requests": 44374,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/AMD-Ryzen-5900X-24-Thread-Processor/dp/B08164VTWH",
    "body": {
        "name": "AMD Ryzen 9 5900X 12-core, 24-Thread Unlocked Desktop Processor",
        "price": "$299.00$275.08",
        "originalPrice": "$569.99",
        "rawPrice": 299.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/AMD-Ryzen-5900X-24-Thread-Processor/dp/B08164VTWH",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B5HVBK4L"
        ],
        "asinVariationValues": [
            {
                "asin": "B08164VTWH",
                "variationName": "Style",
                "variationValue": "Desktop Processor",
                "price": "$299.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0B5FV26PY",
                "variationName": "Style",
                "variationValue": "Desktop Processor + Motherboard",
                "price": "$458.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BRPDDSJ6",
                "variationName": "Style",
                "variationValue": "Processor + AM4 TUF X570-Plus Motherboard",
                "price": "$478.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BRPHVK2X",
                "variationName": "Style",
                "variationValue": "Processor + AM4 X570S Zen 3 Motherboard",
                "price": "$712.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08QY89KND",
                "variationName": "Style",
                "variationValue": "Processor + Hero X570 ATX Motherboard",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BTTBVQP1",
                "variationName": "Style",
                "variationValue": "Processor + Prime B550-PLUS Motherboard",
                "price": "$428.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BRP7681C",
                "variationName": "Style",
                "variationValue": "Processor + ROG Strix B550-F Motherboard",
                "price": "$458.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41rLUI4FOAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31GZ0zHrQNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41S qv-MuSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FZ5ABii1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21Cc0wEhrUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21EKUwtccoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Cr3szVfuL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a0c2407d-f248-4430-b109-295f35bd60b3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/227f7ad6-a4cb-48aa-a9d2-6e3e4a6736df/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3fb4ad08-3225-47b2-bd82-f6e12bf8516a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/595f2b8f-fb4b-48ff-84c0-2b474303ef74/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e9b92724-868e-4081-94dc-1a5df9a94272/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d3957706-6080-41fe-9e24-fef203c3c19a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b2d87d46-2aef-43d0-a35d-15b5ea49ea52/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0727c6d1-ade3-451e-8f8d-8218d8fec583/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 8,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1yaYGNmI3L.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A1yaYGNmI3L.pdf"
        },
        "byLineInfo": {
            "name": "Visit the AMD Store",
            "link": "https://www.amazon.com/stores/AdvancedMicroDevices/page/8D05F933-0F55-46A5-A940-3711A335A383?ref_=ast_bln"
        },
        "brand": "AdvancedMicroDevices",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 10793,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17",
            "Or fastest delivery Wednesday, February 14. Order within 14 hrs 41 mins",
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The world's best gaming desktop processor, with 12 cores and 24 processing threads",
            "Can deliver elite 100-plus FPS performance in the world's most popular games",
            "Cooler not included, high-performance cooler recommended. Max Temperature- 90°C",
            "4.8 GHz Max Boost, unlocked for overclocking, 70 MB of cache, DDR-3200 support",
            "For the advanced Socket AM4 platform, can support PCIe 4.0 on X570 and B550 motherboards"
        ],
        "description": "Be unstoppable with the unprecedented speed of the world’s best desktop processors. AMD Ryzen 5000 Series processors deliver the ultimate in high performance, whether you’re playing the latest games, designing the next skyscraper or crunching scientific data. With AMD Ryzen, you’re always in the lead. A fast and easy way to expand and accelerate the storage in a desktop PC with an AMD Ryzen™ processor.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Components",
                "link": "https://www.amazon.com/PC-Parts-Components/b/ref=dp_bc_aui_C_3?ie=UTF8&node=193870011"
            },
            {
                "name": "Internal Components",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=17923671011"
            },
            {
                "name": "CPU Processors",
                "link": "https://www.amazon.com/CPU-Processors-Memory-Computer-Add-Ons/b/ref=dp_bc_aui_C_5?ie=UTF8&node=229189"
            }
        ],
        "productInformation": [
            {
                "name": "Processor",
                "value": "‎4.8 GHz ryzen_9"
            },
            {
                "name": "Brand",
                "value": "AMD"
            },
            {
                "name": "Series",
                "value": "‎AMD Ryzen 9 5900X"
            },
            {
                "name": "Item model number",
                "value": "‎AMD Ryzen 9 5900X"
            },
            {
                "name": "Item Weight",
                "value": "‎2.8 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.57 x 1.57 x 0.24 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎1.57 x 1.57 x 0.24 inches"
            },
            {
                "name": "Processor Brand",
                "value": "‎AMD"
            },
            {
                "name": "Number of Processors",
                "value": "‎12"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎DIMM"
            },
            {
                "name": "Batteries",
                "value": "‎1 A batteries required."
            },
            {
                "name": "Manufacturer",
                "value": "‎AMD"
            },
            {
                "name": "ASIN",
                "value": "‎B08164VTWH"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎November 5, 2020"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 10,793 ratings 4.8 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12 in Computer CPU Processors"
            },
            {
                "name": "CPU Manufacturer",
                "value": "AMD"
            },
            {
                "name": "CPU Model",
                "value": "Ryzen 9"
            },
            {
                "name": "CPU Speed",
                "value": "4.8 GHz"
            },
            {
                "name": "CPU Socket",
                "value": "Socket AM4"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/bbfbe630-3b67-4452-8151-73291f69aaf1.__CR0,130,1200,371_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/65952534-be83-47e1-ba32-e7aff4fd0daa.__CR0,4,1200,371_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/41b82a20-d5a0-4378-96a9-fb6db07ba7ce.__CR0,4,1200,371_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/6fe05df4-3de4-44f0-92d1-8beef1666d3c.__CR0,3,1200,371_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/beaa69e2-d169-4533-928d-2003deacddf3.__CR0,3,1200,371_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/900f1d3a-c3b5-48e6-83a9-bd322656d703.__CR0,28,1200,371_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/abccd345-15ae-4879-9b61-11c486adcf77.__CR0,45,1200,371_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "G. Ritter von Olfers-Batocki",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX2HTUL6WAUWPLXISRLHDHRCOEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LWZ665RBEUFR?ASIN=B08164VTWH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2023",
                "reviewTitle": "5.0 out of 5 stars 100% satisfied w/ Ryzen 5900X. Price is to expensive. Still 5 stars.",
                "reviewText": "This is a review of the Ryzen 5900X, the MSi B450-A Max Pro motherboard and the Teamgroup T-Create 32 GB (2x16 GB) 3200 MT/s titanium RAM since I built my new tower with these components.The CPU arrive in an factory sealed box. Seal was not broken. No signs of tampering.The performance of the Ryzen 5900X compared to an Ryzen 5700G octacore I have in my other system is not much greater with this Ryzen 5900X. But the price is about 2 times as much and the power draw is 4 times more. At the moment this 5900X draws 100 Watts total system draw on writing this review.There is no difference on gaming between the 5700G and this 5900X. Cinebench gives me on the 5700G around 12000 points (in the Bios the temperature is limited to 75 Degrees Celsius) and the 5900X gives around 18000 points (again temperature limit of 70 Degrees Celsius on the CPU). I limit the max temperature allways to a difference of 20 Celsius to Tjunc temperature.As now the CPU has an temperature of 50 degrees Celsius with the Gamemax Gamma 500 cooler.I ordered the MSi B450-A Pro Max motherboard when AM5 came out and paid 80$ for it. A bit expensive but it is an ATX board. Super easy to install and flash with the BIOS button the Bios for the Ryzen 5000 series CPU's. Worked right out of the box. The board is better than the B450 board I have from Asus. Easy to install in my XPG Invader case.At the beginning when freshly installed Windows 11 I got lots of sound problems. After installing the crap of MSi drivers and Utilities which actual version MSi's MSi Center was offering, my sound got messed up completely. Sound stutters becauso of the new sound drivers, Chipset drivers and the like. Headphones and 5.1 Speakers intermittently connected/disconnected causing delays and stutters. Looked like an software issue of MSi software. That foreced me to reinstall and erase from scrap Windows 10 and it offered then to upgrade to Windows 11. After that the problem was gone with only Windows drivers. Do not download the crap MSi Center offers. It can break your OS.Other than that this board suggests it has 2 full fledged PCIE x 16 slots of the 3.0 type. At least that is what customers will think easily. Think twice. It has only one x16 PCIE 3.0 slot and the long one below has x16 openings but only half of those have connector pins installed and the manual says it is not even an x8 slot but rather an x4 only. And to add insult to injury that slot is only 2.0. Completely misleading for an new buyer.On the lower slot I have the GT 1030 GDDR5 from MSi installed I had still from Q1 2020. It works on low settings on some games like HnG from 2016 and gets between 52 fps and 60 fps.Other than that this MSi board works way better than the Asus B450 board I have on my other system from last year. The RAM slots are way easier to use and the sticks slide into them like lubricated. The dual channel works on this board which is on my Asus most likely defective (Asus refuses warranty). I use it with 32 GB (2 x 16) TeamGroup TCreate RAM sticks. High quality 3200 Mhz sticks for relatively cheap.It is a good strong board with 2 massive coolers on the Mosfets. These massive coolers impressed me as an new inexperienced buyer for my very first build. So it slipped to me the issue with the PCIE \"x16\" slots.This Motherboard worked straight out of the box. I use the Ryzen 5900X with this with an Gamemax Gamma 500 AM4 cooler. The coolers does not fit well the AM4 system since it's clip is way to stiff so I had to take the cooler off the CPU and bend a bit the clips till it fits just with a little pressure. Install the air coolers without too much pressure so it is not loose but can slide a bit is fine before snapping it gently in place. As original fit I got 66 Celsius to 70 Celsius on idle or doing basic work with that processor, but after bending the clips to aliviate the pressure I get now at the moment 51 Degrees Celsius. So if too much pressure is applied by the cooler onto the processor that rises the heat to a difference of about 20 Degrees Celsius. Any of these standard air coolers with heat pipes will be able to cool the Ryzen 5900X easily. While gaming it gets to about 61 degrees Celsius. My case has 3 fans in the front and 1 in the back.MSi's UEFI is a bit confusing if one is used to the Asus UEFI. But it has basically the same features but it is way more confusing. The fans can be adjusted better on MSi's BIOS. But with this 5900X duo deca core CPU, the PSU is annoyingly loud all the time. While on Ecomode with 65 Watts the whole system draws on gaming about 150 Watts. The board seems to have no problems to deliver power to the 5900X.Running Cinebench with this board and 5900X CPU with settings to Ecomode 65Watt, the case fans kick in, the CPU has an temp of 61 Degrees Celsius after 5 Minutes Cinebench, the Mosfets have an temperature of 58 Degrees Celsius and the PCH has an temperature of 50 Celsius while the Cooler Master Silencio 120mm fan I put on the Gamma from GameMax CPU cooler, turns 1000 rpm and all 4 Arctic F12 120mm case fans show an rpm of 700.I am surprised how this GameMax Gamma air cooler is able to maintain cool this CPU. So the huge aluminum coolers on the Mosfets of the MSi board sure do their job.The board has lots of fan headers. Thats very good.I recommend this board for the AM4 system but be aware of the cheating PCIE slot advertisement, the sound problems and the rather difficult to use UEFI settings. But this is an robust board.After updating all drivers through MSi Center, updating Windows 11 and running sfc /scannow and DISM /Online /Cleanup-Image /RestoreHealth command, all Windows errors are corrected and there is no software or hardware problem whatsoever. No sound problems anymore after this and Realtek Audio Console, which comes as software on the MSi Center works wonderfull as well. Realtek Audio Console only works when you install the latest audio drivers from MSi Center (without that it fails to run).I am now used to the MSi Bios 5 UEFI over the Asus Bios.I have undervolted the 5900X to 0.1 Volts, combined with PBO on auto and the temperature limited to 70 degrees Celsius.I had to open my PSU since it ran considerably and annoyingly loud with this 5900X so I changed the PSU fan. I put there an 120mm Gamemax 3-pin fan in, funneled the wires through the PSU grid and plugged it into the motherboards Pump header. Now I can control the PSU fan in the Bios as well and it runs normally at 900 rpm )(blows now as much or more air out of the back of the PSU and the air is never hot at all, just a bit warmer after 10 minutes Cinebench which draws 200 Watts while running) and the CPU fan runs at 887 rpm. The system is whisper quiet. PSU fans tend to run at 100% speed on normal load with these 5900X and 5950X CPU's so that is an unbearingly loud and annoying sound. I allmost desperated because of this till I changed the PSU fan. I have in this new built an 600 Watt PSU and an GT 1030 GPU. The case fans allmost never run and spin up only after 62 degrees Celsius.Till date the CPU works as it should.However I believe the 5900X is overpriced since I paid 336 US$ for it. It should be only around 200 US$ and the 5950X should be around 300 USD. The Ryzen 5950X is insanely overpriced since any 7900X or 7950X you can cool with an air cooler as well if you trade a bit of performance. Then again I trade with this as well performance with my temp limits and with this cooler.For the same price I would suggest go for the Ryzen 7950X, apply an 70 degrees Celsius temp limit and cool it just with an air cooler like the Thermalright Peerless Assasin.I did not select XMP for the RAM but rather just manually put the speed at it's rated speed of 3200 Mhz and the rest on auto.The Bios does somehow not update on the MSi software or in the Bios so I updated it manually with the Bios flash button which this motherboard has on the back of the I/O to the latest stable version.For flashing the nevest Bios on this motherboard you download manually the Bios from MSi website. extract all files and select the one file (not the text file) and change the name to MSI.ROM. Then format an USB stick to FAT32 and copy there the MSI.ROM file. No other data should be on the USB stick. Then put power to the system not pressing the power button and stick the USB drive in the USB port below the Bios flash button. Press the Bios Flash button on the back for about 5 seconds till a light start to blink and leave it doing it's thing. There will show up 2 lights blinking in an different pace and the USB drive light will show movement as well if it has one. Only take out the USB stick 5 minutes till all lights are out and the system has sort of resumed (case fans will stop and start again. You will hear a sort of resetting the Bios). Then the Bios is upgraded via Flash button mode.If this Processor should become old after 15 years, then put Tuxedo OS or some other Linux in it or Chrome OS. That will give it's some snappy internet browsing life at least till 2060 Anno Domini.Installing the Gamemax Gamma 500 AM4 CPU cooler I had to bend it's snap over hooks a bit down with an hammer and plier since at the first install it seemed to me way to much pressed onto the CPU. So I adjusted the tension of the snap over assembly 3 times till it had some tension but not much (no sliding on the CPU but a gentle press onto the CPU). If the air cooler is to much pressed onto the CPU I got 67 degrees Celsius on idle - adjusted right and spread nice the thermalpaste with an spatula, I get 49 degrees Celsius on idle. These AM4 snap over clip cooler assemblies sometimes need a bit adjustment (unscrew it from the cooler and flatten the bendings of the arms with a plier or hammer it flatter). Originally even with all my body weight I allmost could not get the snaps over the hooks on the cooler and motherboard plastic ears. That was not normal and I bet the chinese did not bend the snap over arms right for AM4. It has to fit gentle and not with all body weight put that cooler onto the AM4 system. Be ready to adjust things if not deemed right - instead of breaking the motherboard or CPU.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sprg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGB5KJ55YCPSH2V7RQ27JB4KO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CXKL3LSRHYOU?ASIN=B08164VTWH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow!",
                "reviewText": "This is an absolute beast of a CPU.I bought this to upgrade my B450 system from a Ryzen 5 2600.First thing I did was check my boards compatibility with this chip, luckily, the BIOS was quite a lot newer than when support was added, so I didn't need to do any updates. If you do though, make sure you do it before you install this CPU.I, really, didn't think I'd feel that big of a performance improvement. Boy was I wrong...I put the CPU into \"eco mode\" through the BIOS (it was under AMD Overclocking on my ASUS Prime B450 board), as I'm only using a Noctua NH-U12S as a cooler. I plan to eventually get a more capable cooler, but this is working just fine, CPU is peaking out at 65C in eco mode with the single tower Noctua, pretty impressive if you ask me.My Ryzen 5 2600 ran around the same temps under load, and idled in the 40s, this idles a bit higher, but it doesn't really get much warmer than idle from what I can tell, at least with my system configuration.While I was removing my previous CPU it was actually \"stuck\" to the cooler. It actually popped right out of the socket... at first I was a bit worried that I may have accidentally broken something but... i apparently got very lucky. No pins were damaged on the old CPU, and it booted up fine in another system I tested it in.New CPU installation was very easy, just line up the triangle to the corner on the socket with a triangle, after opening the clamp bar of course. The clamp bar easily went back into place, and held the new CPU just fine. *Whew*At first I thought I may have damaged the motherboard, but... I took this as a chance to do a good cleaning of the inside of my case, and when I put the system back together... I forgot to plug in the GPU power cable *doh*. After plugging that back in, the system rebooted about 1000 times (got to love ASUS boards!), and then asked me if I wanted to overwrite the fTPM settings. I did, I run Linux and I don't use the fTPM. If you're running Windows 11, you may want to go through whatever procedure you need to go through to save this. You'll need it. You need to do this while your old CPU is installed though, or you'll have to go through the whole process of putting it back in if you don't! Luckily, I didn't need to, but be aware of this.After wiping the fTPM settings and a few thousand more reboots (exaggerating a bit, it was probably 10 total, ASUS boards really like to do that), I was presented with a screen that said a new CPU was detected, and that all BIOS settings were cleared. Cool! So far so good!I spent some time going through and reenabling my RAM speed profile (got to make full use of the 128GB of 3200MHz RAM I installed yesterday!), turning virtualization back on, and enabling eco mode (I didn't want to get a new cooler right now if I could get away with it). Enabling eco mode did bring the CPU temp down about 10 degrees in the BIOS, and from reading around the internet, doesn't really seem to impact performance *that* much. Easier than fiddling with undervolting settings I'd say...After finally getting booted back up into my OS... I was actually kind of impressed already. Just from the increase in boot speed alone I already knew this was going to be good. It wasn't *slow* on my 2600 at all, it's still a very capable chip, but wow, this blows it out of the water.I've been working on a rust project lately, it compiles in about... 45-55 seconds on my 2600... I did the same project compile on the 5900X? 6 seconds. Even in eco mode. Wow oh mighty. The power of 6 more cores and a dozen more threads.I also run a Windows VM for several income producing applications (y'know, we all got to work, otherwise we can't buy these fancy new pieces of sand we send lightning through), and wow. Oh boy wow. Like I said, the 2600 wasn't *slow* by any stretch of the imagination, but the responsiveness and speed now is just absolutely incredible. The VM boots so much faster, every application is up and running almost instantly... and that's with only 6 cores dedicated to it...If you've got an older AM4 system. Buy this. Buy this before they stop making them. Buy this, and upgrade your BIOS if you need to. Just get it. Seriously. This is a monumental leap in performance that will *absolutely* extend the life of your AM4 system by several years. This is *far* cheaper than building a new AM5/DDR5 system, and you will be absolutely blown away by the performance increase.For $350 as of the time of this writing... it's worth every penny. Best performance upgrade I've ever made, for sure.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kbradsha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGURGSJPAYPIWMATQMPTX3HBQYRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVKKCJ3LIY77C?ASIN=B08164VTWH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Best value CPU",
                "reviewText": "In 2023 this CPU is the best value upgrade for an aging AM4 motherboard. Is it the best performer? No. The 5950X has 4 more cores, but just barely edges out this model in terms of performance. Is the extra performance worth the extra price? Maybe, in some certain situations. In every other scenario, you can save yourself 25% of the price of a 5950X, by purchase of the 5900X. It's a solid performer which pairs well with an RTX 3090 or 4090. It tends to run hotter than other consumer models from this same line, but the standard recommended wraith cooler is more than sufficient to keep it running stable. I upgraded from a Ryzen 3600 and the performance boost was significant, but if you're short on cash & considering upgrading, save the money. A 3600 is still plenty sufficient.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sergio ruiz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "great cpu",
                "reviewText": "love this thing, gets a little hot, but so long as your cooling is decent, you'll be fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wagner Bitencourt Rebello",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 15, 2024",
                "reviewTitle": "Desempenho sensacional",
                "reviewText": "Ótimo desempenho, mas prepare-se para comprar um bom kit de refrigeração pois esquenta que é uma churrasqueira, outro ponto é que se você utiliza-lo em conjunto com um Water-Cooler provavelmente terá de ter uma refrigeração EXCEPCIONAL nas VRMs pois elas irão sofrer com o alto consumo de corrente que o processador terá pelo Boost em tempo excessivo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Wilson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2024",
                "reviewTitle": "A great replacement for older AM4 CPUs",
                "reviewText": "The rx5900x is now a great value compared to its original price making it pretty much the fastest and most capable processor without going to AM5.I don't play games but it is noticeably faster than the rx2700x it replaces in my system.When using Plex across my network to my TV, operation is faster and more stable and is reliable even when the PC is running other intensive tasks at the same time.I didn't feel it was worth going for the 5950x at a significantly higher price as the performance benefits seem marginal for my use.I expect this CPU will last another few years and postpone the significant costs of moving to another platform for quite some time.I should mention that if using am older motherboard you'll need to check compatibility and probably do bios upgrades before installing the 9500x. I have a 470 motherboard. It was years behind on updates. It was not a simple one-step upgrade process. You must do the upgrade before installing the new CPU. It took a while to do and, 8n my case, the upgrade left a couple of issues using the older 2700x. I proceeded on the basis that I could change back if necessary. My motherboard stores 2 bios versions.;)Anyway, after the 9500x went in, everything worked fine. I was able to use Precision Boost Overdrive for a bit of extra speed.I am using my old cooler, a Scythe model. Temperatures are fine.But, yes, check the upgrade process before buying and be ready for a possible white knuckle ride when you do it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vimal Parmar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 19, 2024",
                "reviewTitle": "Excellent product and services",
                "reviewText": "Excellent product and services",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tobias",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 6, 2023",
                "reviewTitle": "Hochleistungsprozessor für anspruchsvolle Aufgaben",
                "reviewText": "Der AMD Ryzen 9 5900X, ein 12-Kern, 24-Thread Unlocked Desktop-Prozessor, hat sich als eine beeindruckende Komponente in meinem PC-Setup erwiesen. Die Leistung dieses Prozessors ist außergewöhnlich, besonders bei anspruchsvollen Anwendungen und Spielen. Mit einer maximalen Taktrate von bis zu 4.8GHz bietet der Ryzen 9 5900X eine schnelle und reibungslose Leistung, die auch unter Last stabil bleibt.Ein bedeutender Vorteil dieses Prozessors ist seine Fähigkeit, Multitasking-Aufgaben mühelos zu bewältigen. Egal ob es um Gaming, Videobearbeitung, 3D-Rendering oder andere rechenintensive Anwendungen geht, der Ryzen 9 5900X meistert diese Herausforderungen mit Leichtigkeit. Diese Performance macht ihn ideal für Profis und Enthusiasten, die eine hohe Rechenleistung benötigen.Die Kombination aus hoher Kernanzahl und der fortschrittlichen Architektur von AMD ermöglicht nicht nur eine herausragende Performance, sondern auch eine effiziente Energieverwaltung. Trotz der hohen Leistungsfähigkeit bleibt der Prozessor überraschend kühl, was auf ein ausgeklügeltes thermisches Design hinweist.Insgesamt übertrifft der AMD Ryzen 9 5900X die Erwartungen in fast jeder Hinsicht. Er bietet eine exzellente Balance zwischen Leistung, Effizienz und Preis. Für Nutzer, die nach einem leistungsstarken Prozessor für anspruchsvolle Aufgaben suchen, ist der Ryzen 9 5900X eine hervorragende Wahl. Daher vergebe ich 5 von 5 Sternen.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$298.69",
                "sellerName": "TheTechGroup",
                "sellerRating": "5"
            },
            {
                "price": "$298.69",
                "sellerName": "ALL4COMPUTERS - (SIGNATURE REQUIRED)",
                "sellerRating": "5"
            },
            {
                "price": "$299.00",
                "sellerName": "Better Deals Online",
                "sellerRating": "5"
            }
        ]
    }
}