{
    "remaining_requests": 5310,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/BOD-SUPPORT-Chair-Cushions-Straps/dp/B07BSRXPBX",
    "body": {
        "name": "Seat Cushion with Straps - Seat Cushion for Desk Chair, Car Seat Cushion, Office Chair Cushion Tailbone Pain Relief Cushion design to Relieve Sciatica Coccyx from Prolonged Sitting (Black)",
        "price": "$35.90",
        "originalPrice": "",
        "rawPrice": 35.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/BOD-SUPPORT-Chair-Cushions-Straps/dp/B07BSRXPBX",
        "soldBy": {
            "sellerID": "A27YTL4PDL93MU",
            "name": "Bod Support",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A27YTL4PDL93MU&asin=B07BSRXPBX&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B6YBMVJS"
        ],
        "asinVariationValues": [
            {
                "asin": "B07BSRXPBX",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$35.90",
                "variationImageURL": "https://m.media-amazon.com/images/I/51Bz-AM7lAL._SS36_.jpg"
            },
            {
                "asin": "B076F21H8V",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$35.90",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WB5SEgyBL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 10% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Bz-AM7lAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51iQR3PpzYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xoyhlphOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rdrERUzgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LlVLqqBhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VqON-oBVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81Vw4FVKt1L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Bod Support Store",
            "link": "https://www.amazon.com/stores/Bod+Support/page/BA5D272E-701D-4DEC-8231-041ED3E93353?ref_=ast_bln"
        },
        "brand": "Bod Support",
        "merchantInfo": "Bod Support",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2052,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23",
            "Or fastest delivery Thursday, February 22. Order within 23 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "First Ever Temperature Stable Heat-responsive Memory Foam: Get Year-round Comfort With Bod Support's Innovative Temperature-stable, Heat-responsive Memory Foam Cushion. Ideal For Desk Chair, Office Chair, Or Car Seat, This Cushion Will Make Your Butt Thank You.",
            "Tailbone Pain And Sciatica Relief: Say Goodbye To Tailbone Pain And Sciatica Discomfort With Bod Support's Specially Designed Coccyx Cushion. Featuring A U-shaped Rear Cut-out, It Helps To Relieve Pressure On Your Tailbone And Promotes Blood Flow, Muscle Fatigue, And Pain Relief. Perfect For Anyone Seeking Tailbone Pain Relief Cushion Or Sciatica Pain Relief Pillow.",
            "Ergonomic Design: This Healthcare Professional-recommended Chair Cushion Is Ergonomically Designed With A Contoured Wedge Shape That Evenly Distributes Your Weight And Promotes Proper Spinal Alignment And Correct Posture. Ideal For Anyone Suffering From Back Pain Or Needing A Pressure Relief Seat Cushion.",
            "Versatile Use: Whether You're An Office Worker, Driver, Senior, Or Traveler, This Butt Cushion Is An Essential For You. Perfect For Use At Your Computer, Office, Wheelchair, Airplane, Kayak Seat, Bleacher, Stadium, Or While Hunting. It's The Best Seat Cushion For Back Pain, Tailbone Pain Relief Cushion, Car Seat Cushions For Driving, Or Office Chair Cushion For Butt.",
            "Quality Assurance: Get 100% Customer Support And Quality Assurance With Bod Support's Memory Foam Seat Cushion. Don't Suffer From Discomfort Any Longer. This Cushion Is The Perfect Solution For Anyone Looking For A Chair Cushion For Back Pain, Seat Cushion For Chair, Pressure Relief Seat Cushion, Or Memory Foam Chair Cushion. If You Have Any Questions, Feel Free To Contact Us."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Furniture & Lighting",
                "link": "https://www.amazon.com/Office-Furniture-Lighting/b?ie=UTF8&node=1069102"
            },
            {
                "name": "Furniture Accessories",
                "link": "https://www.amazon.com/Office-Furniture-Accessories/b?ie=UTF8&node=1069190"
            },
            {
                "name": "Back & Seat Cushions",
                "link": "https://www.amazon.com/Back-Cushions-Seat-Cushions/b?ie=UTF8&node=1069194"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "BOD SUPPORT"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Cooling, Lightweight, Seat cushion, Seat Cushion for Lower Back Pain Relief, chair seat cushion, butt cushion, Gifts for wife, office gift, gaming accessories, computer accessories, chair cushions, seat cushions, office desk accessories, Work from home essentials, home office, car seat cushion, chair cushion for office chair, cushion for chair, Removable Cover See more"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Size",
                "value": "One Size"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Shape",
                "value": "Semicircular"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "The orthopedic seat cushion has a U-shaped design that helps to elevate pressure on the lower back, hips, tailbone, coccyx, and more. It is made of high-density foam that contours to your body and provides support and comfort. The cushion has a removable, washable cover and comes with a strap for easy transport and secure adjustment. It is recommended by orthopedic surgeons and doctors across the globe."
            },
            {
                "name": "Use for",
                "value": "Buttocks"
            },
            {
                "name": "Material",
                "value": "Temperature Stable - Heat Responsive Memory Foam"
            },
            {
                "name": "Item Firmness Description",
                "value": "Soft"
            },
            {
                "name": "Product Care Instructions",
                "value": "To remove the cover from your memory foam, simply unzip it and remove it from the foam. The cover is machine washable on a gentle cycle with cold water. You can also put it in the Dryer on a low heat setting, or simply air dry it. However, do not put the memory foam itself in the washer or dryer, as this could damage the foam."
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Item Weight",
                "value": "1.39 pounds"
            },
            {
                "name": "Material Feature",
                "value": "seat cushion with strap, ‎Memory Foam, seat cushions orthopedic"
            },
            {
                "name": "Variety",
                "value": "Seat Cushion"
            },
            {
                "name": "Material Type Free",
                "value": "Chemical Free"
            },
            {
                "name": "Fabric Type",
                "value": "100% Pure Memory Foam"
            },
            {
                "name": "Model Name",
                "value": "‎Memory Foam"
            },
            {
                "name": "Specific Uses For Product",
                "value": "car seat cushions, seat cushions for office chairs, A seat cushion is good to use for the office chair, car seat, boat seat, bus drivers semi truck drivers. The seat cushion conforms to your body shape and provides support and comfort. The seat cushion is made of high density foam that will not flatten over time. The cover is made of durable polyester fabric that is easy to clean. The seat cushion is lightweight and portable, seat cushion for truck driver, seat cushion for desk chair"
            },
            {
                "name": "Product Dimensions",
                "value": "17.5\"L x 14\"W"
            },
            {
                "name": "Manufacturer",
                "value": "Bod Support"
            },
            {
                "name": "ASIN",
                "value": "B07BSRXPBX"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "712038924974"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,052 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#109,761 in Office Products (See Top 100 in Office Products) #341 in Back Cushions & Seat Cushions"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "March 29, 2018"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Elevate well-being with our Seat Cushion A versatile traveling essentials and work from home essentials. This car seat cushions for driving butt pain offers targeted sciatica relief, ensuring a comfortable drive. A thoughtful gift for the elderly in nursing homes or anyone embracing remote work, it blends comfort, support, and style.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86bdc900-4a89-4665-b59b-9cbd3c1b930e.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Traveling Take our car cushions for driving with you on your travels for an added layer of comfort. Experience the joy of arriving at your destination feeling refreshed and pain-free. Kayak cushion Enjoy the beauty of nature while staying comfortable, whether you're a novice or seasoned kayaker. Designed to fit seamlessly on Kayak Seat Cushion, it reduces fatigue during long paddling journeys. Office Chair Cushion Transform your office experience with our seat cushions for office chairs designed for superior comfort and support. Say goodbye to back pain and discomfort during long work hours. Wheelchair seat cushions Perfectly tailored for wheelchairs, it ensures comfort during daily activities. Our chair cushions for elderly is designed to bring unparalleled comfort to Wheelchair Cushions users Bleacher seat cushion Enhance your stadium experience with our Bleacher Cushions, designed for sports enthusiasts. Make every moment memorable with our Stadium Seat Cushion, the ultimate accessory for sports fans. hunting seat pad Enhance your adventures with our Hunting Cushion, designed for outdoor enthusiasts. Make every hunting trip memorable with our hunting seat cushion, the ultimate accessory for outdoor enthusiasts.",
                "media_link": []
            },
            {
                "media_text": "Tailored Support & Pressure Relief: ergonomic chair cushion Adapts to Your Body Explore The Benefits Of Our Butt Cushions for pressure relief And Discover Why They Are A Top Choice For Those Seeking Comfort And Support.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0bf6dce3-6ca7-4bcb-862e-be94765f8c87.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Key Features: Ergonomic Design: Our ergonomic seat cushion boasts an ergonomic design that promotes healthy posture, relieving pressure on your lower back and coccyx. Say goodbye to discomfort during long hours of sitting.Tailored for Multiple Uses: Whether you're at the office, on a road trip, or watching your favorite team play, our bleacher chairs with back and cushion is your versatile companion, suitable for various seating scenarios.Pain Relief: If you suffer from lower back pain, sciatica, or coccyx discomfort, our coccyx cushion for tailbone pain provides targeted relief, helping you feel better and more comfortable.Portable and Compact: Take it with you wherever you go. This airplane seat cushion is portable and easy to carry, ensuring comfort no matter where life takes you.Non-Slip Bottom: Worried about your hemorrhoid pillow sliding around? Our non-slip bottom keeps it securely in place on your chair or seat. Sciatica Relief: Exploring the Benefits of Car seat cushion for back pain with Pressure Relief and Coccyx Cut-Out Features Car seat cushions with pressure relief and coccyx cut-out features are believed to be beneficial for people who experience sciatica pain. These cushions may potentially reduce pressure on the sciatic nerve and provide relief, although individual results may vary. Chair cushions designed for tailbone pain and coccyx cushion with pressure relief features can offer targeted support to potentially reduce discomfort. Tailbone pain relief cushions may also potentially alleviate pressure on the spine, which could reduce discomfort associated with sciatica pain cushion. Celebrate Every Occasion with the Gift of Comfort: Our Versatile Office Seat Cushion Whether it's a birthday, holiday, anniversary, or just a token of appreciation, our office seat cushion is a versatile gift that suits all occasions. For those who work long hours at a desk in the office, it's a daily dose of comfort and support. For travelers, road trip essentials transform uncomfortable journeys into pleasant rides. And for anyone seeking relief from back pain or discomfort during those adventures, these essentials become a thoughtful gesture that shows you truly care about their well-being.",
                "media_link": []
            },
            {
                "media_text": "Can I use this seat cushion for car during long drives? Certainly! It's perfect for road trip. Our Car Cushion ensures a pain-free and comfortable journey by reducing discomfort and fatigue. How do I clean the seat cushions? Cleaning is easy! Just remove the cover and machine wash it on a gentle cycle. The Office Chair Cushion itself is easy to wipe clean. Can I use this cushion on a wheelchair? Yes, it's wheelchair-friendly! Our wheel chair cushions for seniors are designed to fit most wheelchairs, offering enhanced comfort and support. Does the desk chair seat cushion come with a non-slip bottom? Absolutely! Our donut pillow for tailbone pain features a non-slip bottom to ensure it stays securely in place on your chair or seat. Is this orthopedic seat cushion suitable for individuals with sciatica pain? Yes, our cushions for sciatica is ideal for those with sciatica pain. It's designed to target and alleviate sciatic nerve discomfort effectively.",
                "media_link": []
            },
            {
                "media_text": "Chair Pillows Seat Cushions Comparison: Find Your Ideal Fit Chair Cushions - Black Add to Cart Seat Cushion - Grey Add to Cart Lumbar Support - Oval Add to Cart Lumbar Support Adjustable Add to Cart Seat Cushion - Set Add to Cart Customer Reviews 4.4 out of 5 stars 2,052 4.4 out of 5 stars 2,052 4.0 out of 5 stars 215 4.6 out of 5 stars 150 4.3 out of 5 stars 876 Price $35.90$35.90 $35.90$35.90 $18.90$18.90 $26.50$26.50 $39.90$39.90 Materials Heat Responsive Memory Foam Heat Responsive Memory Foam Double Layer Lightweight Mesh Double Layer Lightweight Mesh Heat Responsive Memory Foam Helps Improve Posture ✔ ✔ ✔ ✔ ✔ Dimensions 17.5\" x 14.5\" x 3\" 17.5\" x 14.5\" x 3\" 16.5\" x 16.5\" x 4\" \"17 x 4.5\" x 12.4\" 18\" x 15\" x 3\" Ideal for Lower back, Tailbone, Sciatica Lower back, Tailbone, Sciatica Back Support Back Support Back, Tailbone, Sciatica Machine Washable ✔ ✔ ✔ ✔ ✔ Ergonomic Design ✔ ✔ ✔ ✔ ✔ Portable & Compact ✔ ✔ ✔ ✔ ✔",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86bdc900-4a89-4665-b59b-9cbd3c1b930e.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/422b3e57-9b7f-47f5-abcf-bd50c3a4eb96.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f640844-80d3-4e59-aa7c-2bcf76e942b6.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c86d589b-0947-4052-9886-fe6c631b647b.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c31c1b4a-438f-4216-b5e3-1e4a7c6b6367.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/eb42f440-a5b2-4e1b-9da1-9784bad51d2b.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba005a64-81d9-4190-9149-e516f253c5df.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7edf550-06ad-42dc-8909-a555cd9b9381.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0bf6dce3-6ca7-4bcb-862e-be94765f8c87.__CR0,0,4880,2000_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/776014bc-54af-414b-9846-17c657334e39.__CR0,0,2000,2250_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ba2299d5-5aa9-4f7c-b398-81e72411ae08.__CR0,0,2000,2250_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b77a2de-0cac-4b25-830a-f2e70b831046.__CR0,0,2000,2250_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a28a7953-069b-4608-87b6-f189a35bc09d.__CR0,0,2000,2250_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/50423d1f-5a9a-48a3-9378-61d8fb47f7ec.__CR0,0,2000,2250_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RMH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECVLVBGRLW2H3SE425L6IPOA5KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26QONK5Y2GVB1?ASIN=B07BSRXPBX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent aide after back surgery.",
                "reviewText": "Gave this product as a gift to my sister after her back surgery. She finds it comfortable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allen Owens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3XQLEFYE5FQAJGIIBMXRKBABUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18BI48T8VJPG9?ASIN=B07BSRXPBX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Very comfy",
                "reviewText": "Bought for my elderly mother with a wound and she loves it. It has an adjustable strap for the dining room chair, wheel chair and car.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nancy N.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEEZX4AVAU2IFSR3SHLVJPLXBHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FXNSBVQWEUWH?ASIN=B07BSRXPBX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2022",
                "reviewTitle": "4.0 out of 5 stars Gorilla glue",
                "reviewText": "Ok , the cushion feels fine , seems very comfortable and looks very nice , but then again it’s still brand new . However I do have a gripe . For some reason our buddies in Beijing feel like they need to apply a 2 inch by 3 inch sticker with what must be Gorilla glue on the suede top of the cushion . It doesn’t have any important information about the cushion , it simply lets the new owner , this side up , I’ll admit to only a high school education but really , if I was not able to figure that out then I should not be behind the wheel of the truck I installed this in . I spent an hour trying to get all of the sticker off without tearing up the cover .. can’t really say after picking , scraping, brushing , hot air and ice cubes I failed to get everything off . Please call our buddies and tell them to put the sticker on the plastic bottom . At least there , it really doesn’t need to come off . The cushion does work fine though and the seller has been very responsive.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jeninmaine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY74FF7W6L7OZS43BJ5OCDWTV4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1O6B9YWCMV57W?ASIN=B07BSRXPBX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2019",
                "reviewTitle": "5.0 out of 5 stars Like cherubs are lifting my bumbum.",
                "reviewText": "I don't know how else to say it. I work from home so I'm sitting quite a bit, I got a standing desk, which helps, but was dealing with cumulative soreness in my hip joints that made the end of the work week terrible. I tried replacing my desk chair but as anyone knows that's really hit or miss, dropping a bunch of cash on something that you hope will work out...well, this time it didn't. The chair I got is not really that comfortable or supportive. Womp womp. I had a similarly shaped regular foam cushion that was getting flat and warped and hard that I've been using to try and make this loser chair work, but it was clear that it wasn't getting the job done. The backs of my thighs would be sore from the pressure of sitting on the edge of the seat and it was just overall miserable. Rather than buy yet another new chair I found this seat cushion. I have come to really love memory foam, it is magical stuff in a mattress so I thought I'd give this a shot.Let me just say from the very first time I sat on this cushion the difference was night and day. It feels very firm initially, but as your, um, tuckus warms up the foam it molds into the shape of your peaches. The edges of the cushion compress without lacking support, ending the cut off feeling I would get in the backs of my legs my from the edge of my chair and my old cushion. The more I sit, the more I don't feel any soreness. It is just short of a miracle. If I can use this cushion to get some more value out of this cruddy chair I bought it is well worth the cost.The best thing about memory foam is that it springs back up when you're not using it, so when you sit again later you sink in all over again. These magical cherubs fly back up and gently lift your hiney, cradling it so it's kept snug but without the pressure on your hips.I would say if you are at all on the fence about how good this cushion is, especially compared to others that may look similar but aren't made of memory foam, go for it. You have nothing to lose and cherub bum to gain.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "william e. allender",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5IO26F5FEPZRNF76R6Q6EOFGUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28FDA5OCO8MT6?ASIN=B07BSRXPBX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Good Product",
                "reviewText": "It is very firm but seems a little short in length for me as I am tall. But other wise it seems well made",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWJM6DRI3L7QNGPH3O67ZSTCGXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AOYDLVZO5AK3?ASIN=B07BSRXPBX",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "3.0 out of 5 stars Didn’t work for me it’s too hard",
                "reviewText": "I have really bad back issues and I needed a very cushy cushion and this isn’t cushy enough for me. It is made with memory foam and it does spring back just not enough softness to prevent my pain. Seems to be made very well and it’s fairly inexpensive. I am going to hold onto it to possibly use down the road when I’m in a bit less pain and healthier",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edmond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWD22ROJULSIJIBHQP7Z33FDU7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V3BOG0SWKHBE?ASIN=B07BSRXPBX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfort",
                "reviewText": "Absolutely a great purchase! I gave mine to my husband and replaced with an inferior seat - oh what a mistake! I had to buy an additional one and I was so happy when it arrived!Never again will I give mine up! If you're thinking about purchasing one this is a good value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lisa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH62ZOTDS3E2J77BXZW2DNI73TPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39F81PMSRA26E?ASIN=B07BSRXPBX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Great cushion!",
                "reviewText": "I originally bought this for my kayak, but it didn't work well with my kayak seat. So I decided to try it for my office chair and I love it! Its super comfortable and adds just the right amount of cusion to my seat. Using it along with the mesh back support has really improved the comfort of my chair. Its also improved my posture. The customer service was excellent! They sent me the mesh back support for free after I registered my product. Its one of the best free gifts i've ever gotten. I highly recommed!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Joyce Davies",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 26, 2021",
                "reviewTitle": "Unable to contact seller",
                "reviewText": "This is a very comfortable cushion, but I am trying everything I can to contact the seller, as I have found that my seat has collapsed at the front. The memory foam has gone flat.Does anyone know how to contact the seller?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 24, 2020",
                "reviewTitle": "Dont buy this product!",
                "reviewText": "1. You have NO option to contact the seller2. It was delivered, I placed it on my chair, and after sitting on it for 1 day, it permanently damaged by leather chair. Look at image.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81jmIV5I9DL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$35.90",
                "sellerName": "Bod Support",
                "sellerRating": "5"
            }
        ]
    }
}