{
    "remaining_requests": 5243,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Office-Cushion-Posture-Improving-Incline/dp/B0CS64G9KD",
    "body": {
        "name": "Office Chair Seat Cushion with Posture Improving Incline - Ergonomic Office Chair Cushion - Seat Cushion for Office Chair Back Support- Proprietary Blended Memory Foam Pressure Relief Seat Cushion",
        "price": "$39.00",
        "originalPrice": "",
        "rawPrice": 39.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Office-Cushion-Posture-Improving-Incline/dp/B0CS64G9KD",
        "soldBy": {
            "sellerID": "A2VE22T1UX3WS0",
            "name": "DeskJockey",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2VE22T1UX3WS0&asin=B0CS64G9KD&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CR4FBG93"
        ],
        "asinVariationValues": [
            {
                "asin": "B07DTDHHZC",
                "variationName": "Size",
                "variationValue": "2X-Large (Pack of 1)",
                "price": "$59.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0CS64G9KD",
                "variationName": "Size",
                "variationValue": "Office Seat",
                "price": "$39.00",
                "variationImageURL": ""
            },
            {
                "asin": "B0182G5MW4",
                "variationName": "Size",
                "variationValue": "Large",
                "price": "$49.00",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31 7LVRcVxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/512I7W1BBQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51OtZiA866L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515Vr8N20YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NldqKz-BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511NQVwbmML.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Desk Jockey Store",
            "link": "https://www.amazon.com/stores/DeskJockey/page/1096B392-AECD-47A9-9937-62EB1387F6D8?ref_=ast_bln"
        },
        "brand": "DeskJockey",
        "merchantInfo": "DeskJockey",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 875,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22",
            "Or fastest delivery Wednesday, February 21. Order within 23 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[CORRECT POSTURE WITH GENTLE INCLINE] - Experience superior spine alignment and improved posture with our patented design of the office chair cushion that features a subtle incline, providing natural tilt to alleviate significant pressure on your back.",
            "[ELEVATE EFFECIENCY AND WELLBEING] - Enhance your blood circulation, reduce muscle strains and achieve higher productivity at work with the ergonomically engineered inclined memory foam seat cushion that engages your core muscles.",
            "[EMBRACE UNPARALLELED COMFORT] - Our ergonomic seat cushion features a groundbreaking patented design technology specifically crafted to provide optimal back pain relief. The innovative incline maintains its shape, ensuring lasting support and comfort for an extended period.",
            "[REVITALIZE YOUR WORKSPACE] - Add a touch of luxury to your office space. Our cushion for office chair not only enhances your comfort but also elevates the overall feel of your workspace, creating an environment that you look forward to each day.",
            "[CUSTOMER-RAVED, USER-APPROVED BLISS] - Join the ranks of satisfied users who rave about the transformative benefits of our cushion, delivering a blissful sitting experience that sets the standard."
        ],
        "description": "Desk Jockey Memory Foam Seat Cushion",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Furniture & Lighting",
                "link": "https://www.amazon.com/Office-Furniture-Lighting/b?ie=UTF8&node=1069102"
            },
            {
                "name": "Furniture Accessories",
                "link": "https://www.amazon.com/Office-Furniture-Accessories/b?ie=UTF8&node=1069190"
            },
            {
                "name": "Back & Seat Cushions",
                "link": "https://www.amazon.com/Back-Cushions-Seat-Cushions/b?ie=UTF8&node=1069194"
            }
        ],
        "productInformation": [
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Pillow Type",
                "value": "Furniture Cushion"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Size",
                "value": "Office Seat"
            },
            {
                "name": "Brand",
                "value": "Desk Jockey"
            },
            {
                "name": "Shape",
                "value": "Wedge"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "13.28\"L x 17\"W"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Resting"
            },
            {
                "name": "Theme",
                "value": "Space"
            },
            {
                "name": "Model Name",
                "value": "Desk Jockey Memory Foam Seat Cushion"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Fabric Type",
                "value": "Velvet"
            },
            {
                "name": "Item Weight",
                "value": "2.31 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Desk Jockey LLC"
            },
            {
                "name": "ASIN",
                "value": "B0CS64G9KD"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "101"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 875 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#115,800 in Office Products (See Top 100 in Office Products) #358 in Back Cushions & Seat Cushions"
            },
            {
                "name": "Date First Available",
                "value": "January 12, 2024"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kitty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGTYSMOWZIA5E4XSNCWK6MIWETA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OYFI84LVIMIW?ASIN=B0CS64G9KD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2016",
                "reviewTitle": "5.0 out of 5 stars Premium Therapeutic Grade Bariatric Seat.",
                "reviewText": "So Thrilled with my New Cushion, I let Alison Know what it feels like to have RELIEF after so many years of pain and trying every cushion out there.Hi Alison,You are so right \"Comfort Hunter\" I have two online stores and I realize sitting is not the best way too work, but your right our Mill and Industrial, Physically Exhausting Jobs are over and forced to do other things for a Profession has led to a lot of sitting people. For years I have literally tried all sorts of cushions and I had bought chair after chair after chair. Consistent Back Aches have been a norm. I even sent away for a Cushion for one of my Chairs recently that had a 5 year warranty and it did come, and I'm not good at tools, so I asked my husband for help putting it together and he actually thought I was trying to bully him to put it together. I asked only twice and explained my reasons, physical pain, but he many times interprets that as Crocodile Tears. He even threatened to throw the chair out the door. He was either tv watching or playing games on the computer trying to veg out and relax. He is an OTR Truck Driver having only 34 hours home a week and work is not what he wants to do. I even cried at one point and attempted to do it myself to no avail. So back on the computer and checking out Amazon again for what seemed like an impossible search for comfort. When I saw your Cushion. It was in the car delivered, but my hope had been deflated a long time ago. So later that evening when things quieted down; I went out to get the cushion. What a Big box I thought, but I knew it was the cushion. Amazon said it was delivered. Opening up the box, it did look like the one that one reviewer had left an awesome review when he and her husband bought one for Mom. The guy in the video who also tried the cushion said, he loves his Mom. His wife certainly went right along to get her Mother In law the cushion to make her life more comfortable. All of this blessed my heart and I loved the way the woman demonstrated the cushion. The top is really so so soft and she unzipped it too and showed the memory foam, a nice thick piece. I do feel the limit on weigh should be about 250, maybe you do need to make cushions for those that are about 500. There are no doubt are people out there that are tall and may in fact weigh that much. In any case. It was perfect for me. I loved it ! I wanted you to know so that you could tell your boss how happy I was. I really truly searched and searched and spent so so much, way too much for the comfort I got from your cushion and such a reasonable price. It was that Wonderful Loving Family with the Mother In law that helped me to give it one more try and I'm so happy I did. Thank you. I'm going to leave you 5 stars for sure. I'm totally 5 Star Plus Thrilled about my Wonderful Desk Jockey Cushion and may get one for my back as well for the car or to take along with me wherever I go l Keep up the Great Work and Thank you so so much for this cushion. Sincerely Denise McleanI guess that pretty much said all that was needed to be said. I am so Glad I gave it another try.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eddie M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM7ARSJPB6DKCMDCN4UNZAGAEZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15FW0IJ8LE67A?ASIN=B0CS64G9KD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Tall but very comfortable",
                "reviewText": "This large cushion has made sitting in the office much more bearable. The only downside is that it does add about an extra inch or two to your seat height, so you may sit a bit higher than you are accustomed to. Besides that, it is very supportive and comfortable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott K Woodside",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH63NXHACO276UQVMT6MBI3O442A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SG67AXG5P806?ASIN=B0CS64G9KD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2018",
                "reviewTitle": "4.0 out of 5 stars Best Weight Bearing Cushion! Up To 500 pounds!",
                "reviewText": "I will begin by stating that I am 6'9\" and 530 pounds. This is by far the most supportive and overall size that I have found. All their claims are correct. At first use it seemed hard but after a couple days softened up a bit increasing its comfort. Excellent craftsmanship and visually appealing. Being my size and weight I flatten it almost completely and find it slightly narrow, however do believe, for a slightly lighter (500 or less) person, it is a 5 star product. I place it under my couch cushion and am much more comfortable now. Also constant back ache has now gone and my bottom feels much more accommodated. I would definitely recomend this to other big guys/gals out there. The up to 500 pound rating and wider width is what attracted me to this unique product. The world just doesn't build for us giant folks and I appreciate that Desk Jockey has. Thank you. I feel the only way to improve on this product would be to either make it an inch or so thicker and a couple inches wider. Or a couple inches wider and put a heavy duty air bladder in it. The air bladder, I would say, would make it the most ULTIMATE cushion out there including price. I am satisfied!",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cassandra swanson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP7BVNMC6CTKE5CDIROFDRD3JJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MWAWNDDEG7XN?ASIN=B0CS64G9KD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Very nice, firm but gives, very supportive.",
                "reviewText": "This cushion is on the firmer side yet gives with your weight and supports your hips very well. I am older with osteo and RA, it has been difficult to find that just right cushion that supports and gives enough to be comfortable, nothing gets rid of all the pain but this helps a lot. This pad fits the bill for me. It is thick and I am short so does not work as well in my office chair until I find a foot rest to put my feet higher. I do love the cushion overall and highly recommend it to my friends and family.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Fuss",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWJEEJX3URNXRS3OMDZ7457TIQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26AEDM5JV10Y?ASIN=B0CS64G9KD",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2021",
                "reviewTitle": "3.0 out of 5 stars Not to Expectations!",
                "reviewText": "I had previously ordered one of the Desk Jockey oversized seat cushions (next size smaller than this one). I was very pleased with the quality and comfort, so I decided to order this larger one with one of the back support cushions. The back support is great, but this seat cushion is nowhere near the quality of my previously purchase one. Cover is color is totally different than what is pictured (not the issue), but the supposed “memory foam” is no better than a piece of foam rubber! Was expecting some firmness, but this cushion is very squishy, and basically adds little to nothing in terms of cushioning and support. Will probably swap this for the cushion I have at home because was really needing that little “extra” for my office chair!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca Buskey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVFR5JALUR5TKW3CJB7J57UWFZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18613G0GCH59I?ASIN=B0CS64G9KD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 14, 2023",
                "reviewTitle": "5.0 out of 5 stars This Cushion is Perfect!",
                "reviewText": "This cushion is perfect! I bought this to put in a secondhand office chair and it has great support! No more back pain or discomfort. Even more, I’ve had it for a couple months now and it’s held its shape wonderfully, not breaking down at all. 10/10 Would absolutely recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWKTVRPVJEYC2HZQISSBMC5GW6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EB6VM4V9KNF5?ASIN=B0CS64G9KD",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2023",
                "reviewTitle": "1.0 out of 5 stars Squishes flat in no time",
                "reviewText": "TL/DR: This cushion will go flat under your weight after a very short time.I purchased this seat cushion for my home office chair. I work from home two days a week and needed something to cushion the dining room style chair I use for my desk. After reading many reviews for this and other seat cushions, I thought this would work for me. As a heavier person, finding seat cushion that can support my weight is challenging and this cushion claims to support up to 300 lbs (I am under this weight limit). In the first few days, I thought it would work okay but as time as gone on, I find that the cushion goes completely flat within minutes of sitting on it. No support, no cushion. Just flat squish under my butt and legs. I will continue to use it until I can find a better option because it's better than nothing. Very disappointed.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guy P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 9, 2022",
                "reviewTitle": "Pretty good",
                "reviewText": "I recently bought a new office chair and I found the seat very hard and uncomfortable. After an hour of sitting in that chair, my butt would get so sore. So I shopped around and did my research and finally bought this cushion. It is very big and very thick. When I sit on this cushion, my butt is in heaven. No more pain. I am a big guy so this cushion handles my 315 lbs very well. And when I get up, it always springs back up to its normal thickness. Well worth the money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marchesi Gabriele",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on May 20, 2019",
                "reviewTitle": "SI ADEGUA ALLA NOSTRA ANATOMIA",
                "reviewText": "Al primo impatto sembra duro ma dopo poco prende la nostra forma anatomica ed è incredibilmente comodo al punto di sembrare una parte del nostro corpo. Eccellente la seduta anche per me che sono obeso!!!! 10 e lode!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zanahar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 16, 2018",
                "reviewTitle": "le meilleur et de très loin !.",
                "reviewText": "Après 10 mois d'utilisation, cet excellent coussin est presque aussi performant qu'au premier jour, alors que TOUS les autres utilisés dans d'autres marques (6 8 ou 10 cm) n'ont jamais fait plus de 2,5 mois.Par contre, on touche un peu le fond avec un poids de 85 kg.Si un produit similaire existe en 10 cm signalez le SVP.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendl Gabriele",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 17, 2017",
                "reviewTitle": "Schnelle unbürokratische Lieferung",
                "reviewText": "Eine richtige Wohltat für das Kreuz. Man muss sich erst daran gewöhnen. Aber eine totale Erleichterung beim Sitzen. Die richtige Sitzhöhe. Keine Kreuzschmerzen mehr.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul GloverPaul Glover",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 24, 2017",
                "reviewTitle": "Excellent very firm memory foam seat cushion",
                "reviewText": "Just received the item, with no smell from the foam. The quality is excellent and well worth the Amazon price. The cushion dimensions are 48 wide x 44 x 8.5cm. See the uploaded pic. My mum is 95y and sits for hours every day in her recliner. She has moderate Alzheimers and cannot use the electric rising feature. When I use ithe riser for her, she starts screaming. Recently, after a fall, she finds it difficult to get up from the chair. She weighs around 67kg (10.5 stone).Therefore, I decided to try this cushion in order to raise the seat cushion height. I will report again, in due course, regarding the cushion's effectiveness.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Whv5vdQBL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}