{
    "remaining_requests": 5253,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Atablyn-Ergonomic-Movements-Pressure-Positioning/dp/B0CJNJDLCZ",
    "body": {
        "name": "Ergonomic Chair Seat Cushion, Conform & Track Movements of The Body, Prevent Pressure Injuries, Improve Comfort and Correct Positioning, Best Chair Pad for Impaired Skin, Driver and Seniors…",
        "price": "$25.99",
        "originalPrice": "",
        "rawPrice": 25.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Atablyn-Ergonomic-Movements-Pressure-Positioning/dp/B0CJNJDLCZ",
        "soldBy": {
            "sellerID": "A2A3WPYN5BTKXW",
            "name": "LanShaw",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2A3WPYN5BTKXW&asin=B0CJNJDLCZ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 5% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31A4W5  7pL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41jXtur0OuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41z-psnJNOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YIVX2pcVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yjzaI4KZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51M6adnuJrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91rX1lYjkWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Atablyn",
            "link": "https://www.amazon.com/Atablyn/b/ref=bl_dp_s_web_88092073011?ie=UTF8&node=88092073011&field-lbr_brands_browse-bin=Atablyn"
        },
        "brand": "Atablyn",
        "merchantInfo": "LanShaw",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 31,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 22 hrs 41 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Sunday, February 18. Order within 21 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Long-sitting without Stuffiness】Our memory foam cushion (18\" x 16\" x 3\") fits wheelchairs or seats around 17\"-18\" long and 16\"-17\" wide. The foam is molded to fit the lower body and encourages correct posture.",
            "【Premium Memory Foam】The unique design of our cushion allows the cushion to constantly conform and track movements of the body. The simple adjustment and conformity to the cells accommodates and meets the unique skin integrety and positioning needs of each user throughout the day.",
            "【Built for Year-round】2 materials covers for easy replacement and cleaning. Soft velvet cover for the cold days, airy mesh cover for the warm days.",
            "【Safe & Secure】It also features a high-performance stretch cover that improves moisture evaporation with an aggressive non-slip bottom keeping the cushion firmly in place.",
            "【Amazing Gift】All parts of the seat cushion are certified safe and harmless for human health with no additives, the best lovely gift!",
            "【Customer Service】It's designed for your comfort. However, please allow yourself 1-2 weeks to adapt to a new feeling. Your satisfaction is our top priority. If you’re not satisfied, please let us know, We will serve you until you are satisfied"
        ],
        "description": "Atablyn Ergonomic Wheelchair Seat Cushion, Relieve Coccyx, Pressure Sore, Sciatica, Back and Ulcer Pain, 2 Materials Covers for Replacement and Cleaning, Best Chair Pad for Adults & Seniors…",
        "breadCrumbs": [
            {
                "name": "Mobility & Daily Living Aids",
                "link": "https://www.amazon.com/Mobility-Daily-Living-Aids/b/ref=dp_bc_aui_C_1?ie=UTF8&node=8624314011"
            },
            {
                "name": "Mobility Aids & Equipment",
                "link": "https://www.amazon.com/Mobility-Aids-Equipment/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3776631"
            },
            {
                "name": "Wheelchairs, Mobility Scooters & Accessories",
                "link": "https://www.amazon.com/Wheelchairs-Mobility-Scooters-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=8626646011"
            },
            {
                "name": "Wheelchair Accessories",
                "link": "https://www.amazon.com/Wheelchair-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3777051"
            },
            {
                "name": "Cushions",
                "link": "https://www.amazon.com/Wheelchair-Mobility-Scooter-Cushions/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3777121"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Atablyn"
            },
            {
                "name": "Special Feature",
                "value": "可调节"
            },
            {
                "name": "Size",
                "value": "1 count (pack of 1)"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Shape",
                "value": "Butterfly"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Use for",
                "value": "Back"
            },
            {
                "name": "Material",
                "value": "Memory Foam"
            },
            {
                "name": "Item Firmness Description",
                "value": "Soft"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Material Feature",
                "value": "Breathable"
            },
            {
                "name": "Fabric Type",
                "value": "Velvet"
            },
            {
                "name": "Product Dimensions",
                "value": "18\"L x 16\"W"
            },
            {
                "name": "Item Weight",
                "value": "0.634 ounces"
            },
            {
                "name": "ASIN",
                "value": "B0CJNJDLCZ"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "WC"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 31 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#225,901 in Health & Household (See Top 100 in Health & Household) #293 in Wheelchair & Mobility Scooter Cushions"
            },
            {
                "name": "Date First Available",
                "value": "September 23, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Boshra",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIFILPWJGGUR7HP44NNTP7FRMKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K4F7KKLZQ454?ASIN=B0CJNJDLCZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice addition to my office chair",
                "reviewText": "I recently purchased the Atablyn Ergonomic Chair Seat Cushion, designed to conform and track movements of the body while preventing pressure points. Here's my review:**Design and Ergonomics (5/5):** The design of the Atablyn Ergonomic Chair Seat Cushion is impressive. Engineered with ergonomics in mind, it conforms and tracks movements of the body, providing optimal support and comfort. The thoughtful design contributes to better posture and helps prevent pressure points during extended sitting.**Comfort and Support (5/5):** The cushion excels in providing both comfort and support. The innovative design allows it to adapt to the body's movements, reducing the likelihood of discomfort or pain caused by prolonged sitting. It offers a balance between plushness and firm support.**Pressure Point Prevention (5/5):** The primary feature of preventing pressure points is well-executed in this cushion. The ability to track movements and distribute pressure evenly across the seat helps alleviate stress on specific areas, reducing the risk of pressure-related discomfort.**Materials and Build Quality (4.5/5):** The materials used in the Atablyn Ergonomic Chair Seat Cushion are of high quality. The build is sturdy, and the cushion maintains its shape even with prolonged use. However, long-term durability may depend on factors such as frequency of use and care.**Versatility (4.5/5):** The cushion is versatile and can be used on various chairs, making it suitable for office chairs, car seats, and other seating surfaces. Its adaptability adds to its overall utility, allowing users to experience ergonomic benefits across different settings.**Non-Slip Design (5/5):** The non-slip design is a practical feature that enhances the usability of the cushion. It stays securely in place on the chair, preventing the need for constant adjustments and ensuring a consistent level of support throughout use.**Ease of Maintenance (4.5/5):** Maintaining the Atablyn Ergonomic Chair Seat Cushion is relatively easy. The cover is often removable and machine-washable, making it convenient to keep the cushion clean and fresh. Proper care contributes to its longevity.**Portability (4.5/5):** The cushion's portability is a notable feature. Its lightweight design allows users to easily transfer it between different chairs, providing ergonomic support wherever needed. The portable nature of the cushion adds to its practicality.**Aesthetic Appeal (4/5):** While the primary focus is on functionality, the cushion has a neutral and clean design. It may not be a decorative element, but its unobtrusive appearance allows it to blend seamlessly with various chair styles.**Price and Value (5/5):** Considering the design and ergonomics, comfort and support, pressure point prevention, materials and build quality, versatility, non-slip design, ease of maintenance, portability, aesthetic appeal, and overall value, the Atablyn Ergonomic Chair Seat Cushion offers excellent value for its price. It provides a thoughtful solution for those prioritizing comfort and ergonomics.**Overall Satisfaction (4.5/5):** My overall satisfaction with the Atablyn Ergonomic Chair Seat Cushion is positive. It effectively delivers on its promises of ergonomic support, comfort, and pressure point prevention, making it a recommended choice for individuals seeking a solution for prolonged sitting comfort.In conclusion, if you are in search of an ergonomic chair seat cushion that prioritizes comfort, support, and pressure point prevention, the Atablyn Ergonomic Chair Seat Cushion stands out as a reliable and effective option.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Franco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN5KMPWYMWY3APVPEHPMY5UEXHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E6HZ9W4YBBCY?ASIN=B0CJNJDLCZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfortable and breathable",
                "reviewText": "I'm a teacher, and let's just say that my district doesn't provide a generous budget for teacher desk chairs, so the padding on my chair left a lot to be desired. While I don't spend a lot of time sitting during instructional periods, most of my planning and grading time are spent in the chair, and this cushion is a game-changer.The cushion adds a lot of padding and provides a much more comfortable experience, but it does increase the height a bit, so the chair and armrest heights needed to be adjusted to compensate, but the comfort was worth it. It's squishy but remains firm and supportive, and it molds well to the somewhat awkward shape of the chair's padding. The strap works well to secure it to the back of the chair, and grippy bottom keeps it from sliding around.This was a great option for turning my uncomfortable desk chair into something I can actually use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KimF",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPPBT7L35BSROVD4AX4ZBNFLQFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SHJLRA324ZFB?ASIN=B0CJNJDLCZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Cushy but smaller than expected",
                "reviewText": "I appreciate that the seller packed the cushion well, and it came in a reusable vacuum seal bag. The cushion is soft, yet it has some support. I am heavier than the 200 lb limit so I will have a different result than someone within the weight limit.However, the size is slightly shorter than I expected. I am not using it on a wheelchair, but as added height padding for an office chair that lost some height adjustment capabilities.The cushion comes with removable webbing that hooks to both sides and has a quick-release connector to keep the cushion from slipping off the chair as you get out. It is created to connect behind the back of your chair. The package also has an extra cushion cover; one side is smooth and soft to the touch, and the reverse has small plastic dots to help with airflow. The covers have a zippered closure, making removing and replacing easy.Besides being smaller than expected, this is a good cushion; just be aware of the weight limit to get the best cushion size needed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pogi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX4UT6EO5MUW6EB62XXIG7OZR5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HV0VWBISN0LG?ASIN=B0CJNJDLCZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Bang for your Buck!",
                "reviewText": "This makes a difference in my day, as I am noticeable les fatigued from sitting all day",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R PriceR Price",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPD3T3FWRSZWL4WEEABWOO5VTLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R109ZY5BJM46Q9?ASIN=B0CJNJDLCZ",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "3.0 out of 5 stars Extra covers are nice but it is very squishy",
                "reviewText": "I've been using this type of cushion for a while now for my sciatica and decided to treat myself to a new one for Christmas.It came vacuum packed in a very compact box which was impressive to start with so had high hopes. There was an odd valve on the package to inflate the packaging and remove the cushion which was also fascinating. No instructions are given so it took a moment to figure it out.Once unwrapped you notice both sides have a different texture with the bumps acting in an anti-skid feature. This also came with extra cover and a strap to keep it in place if used on an office or wheelchair.I was eager to give it a go but was quickly disappointed unfortunately. It collapsed immediately and offered no support. I guess it would make sitting a wee bit more comfortable but it did not meet my expectations for support and ease the pain from sitting. If you just need minimal support, or comfort, this might do the trick. If you need medium or more support I would suggest looking elsewhere.I would try another product from this supplier if they enhanced the foam to be more supporting but as is I would take a pass on it in the future.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/615lUaJWIBL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719-ZlQ+30L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LWg8BEjaL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71avS8UVl-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXADT2VXN625GXCUWUVJX74W4SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R111EV4NEUSEGD?ASIN=B0CJNJDLCZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Cushion",
                "reviewText": "Sitting in my dining room chair no longer feels like a punishment now that I have this cushion. I have those industrial cafe-style chairs, that are “padded” but everything hurts when I get up from them. The cushion does add some height and at 5’5, my feet were no longer sitting flat on the floor (important support), but a small 2x4 scrap piece of wood as a foot stool fixes that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brett R. Yee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPMAJB6CHQM6YS6KNXIFTSJYBFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYOMTZELVYFTE?ASIN=B0CJNJDLCZ",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "2.0 out of 5 stars Cushion is good but listed size is wrong.",
                "reviewText": "Feels great but it is advertised at 18x16x3 but it is actually 17x13.5 which was too small for my grandma's wheelchair",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}