{
    "remaining_requests": 5341,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cushion-Office-Support-Cushions-Sciatica/dp/B0CNGFPVP8",
    "body": {
        "name": "Seat Cushion for Office Chair Lumbar Support Pillow Chair Cushions Butt Pillow Relief Sciatica Pain Memory Foam Chair Cushion Work from Home and Office Chair Pad",
        "price": "$44.95",
        "originalPrice": "$49.95",
        "rawPrice": 44.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cushion-Office-Support-Cushions-Sciatica/dp/B0CNGFPVP8",
        "soldBy": {
            "sellerID": "A1GTAKYIUWOKSI",
            "name": "TINAATLAS",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1GTAKYIUWOKSI&asin=B0CNGFPVP8&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CSFHLXJW"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31xo1pEg54L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Yfmwqn2WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415gubaHPTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EATWd uUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510F6ArHsfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vWQqtuqyL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the fremskre Store",
            "link": "https://www.amazon.com/stores/Fremskre/page/893AA799-6DC4-48E4-A8AE-84D360F07859?ref_=ast_bln"
        },
        "brand": "Fremskre",
        "merchantInfo": "TINAATLAS",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 6,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$6.08 delivery February 23 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Tailbone Seat and Back Cushion - 2 in 1 - The contoured shape of the Lumbar Support Cushion for Office Chairs provides relief from a wide range of aches and pains, including upper stiffness and tension, mid- and lower-back pain, and muscle aches and pains. Use our lumbar back cushion for office chairs to create a supportive posture around the lumbar area and provide long-lasting comfort. Great home and office accessory, perfect cushion for back support",
            "Optimal Orthopedic Cushion - Features an ergonomic L-shaped cut for the perfect blend of comfort and support. Relieving pressure on the sciatic nerve and alleviating back, leg and hip pain, it minimizes fatigue and discomfort. The \"L\" shaped ergonomic cushion helps maintain a healthy body posture compared to a regular cushion. If you need more than just a cushion, consider upgrading to an ergonomic cushion. Optimal Back support and tail pillow seat cushion",
            "Improved Memory Foam Orthopedic Seat Cushion - Office Chair Cushion and Lumbar Support Cushion is formulated with high quality memory foam, odorless, firm and supportive, allowing you to maintain a better sitting posture when you are sedentary. The scientific hollow shape is scientifically designed based on anatomical conditions, while the hemorrhoidal area remains suspended, scientifically reducing the sedentary discomfort caused by the traditional large hole cushion due to center collapse",
            "Fits any chair - Inclined support area corresponds to the thighs, favoring blood circulation. Great for office use, truck drivers, frequent travelers, sporting events and during pregnancy. Provides comfort on most hard surfaces!",
            "The cushion is designed with a non-slip pad on the bottom of the cushion and the non-slip adhesive is evenly distributed on the fabric to ensure that the cushion stays firmly in place on the seat. Can be used on a variety of chairs or sofas as well as car seats. Will not slip and the cushion cover is removable for cleaning"
        ],
        "description": "Do you often experience low back pain, tailbone pain, sciatica, hemorrhoids, or pregnancy pain from sitting in front of an office chair/desk/game chair for long periods of time or driving a car/truck for long periods of time? It largely depends on how long we sit and how we sit: how we sit. Our seat cushion are perfect for people who want to alleviate the pain and discomfort associated with poor sitting posture. The specially designed \"L\" shaped cushion supports your back and hips at the same time, and the memory foam cushion is ergonomically shaped to evenly distribute your body weight. It also provides supportive cushioning that gently conforms to the contours of your body, perfect for keeping your tailbone, spine and hips buoyant and relaxed. The memory foam core is not washable, but the jacket has a zipper for easy removal and washing. Is there a hole in the center of the cushion? This hole is key to preventing hemorrhoids. The hole allows ventilation to the buttocks with just the right amount of support around it to promote circulation and greatly reduce the risk of hemorrhoids. Ideal if you suffer from herniated discs, tailbone injuries, sciatic nerve injuries, back pain, inflamed hemorrhoids, or if you are pregnant or in a wheelchair and want to alleviate pain and discomfort with gentle support and a posture that promotes health!",
        "breadCrumbs": [
            {
                "name": "Office Products",
                "link": "https://www.amazon.com/office-products-supplies-electronics-furniture/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1064954"
            },
            {
                "name": "Office Furniture & Lighting",
                "link": "https://www.amazon.com/Office-Furniture-Lighting/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1069102"
            },
            {
                "name": "Furniture Accessories",
                "link": "https://www.amazon.com/Office-Furniture-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1069190"
            },
            {
                "name": "Back & Seat Cushions",
                "link": "https://www.amazon.com/Back-Cushions-Seat-Cushions/b/ref=dp_bc_aui_C_4?ie=UTF8&node=1069194"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "fremskre"
            },
            {
                "name": "Special Feature",
                "value": "Removable Cover"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Size",
                "value": "New Version"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Shape",
                "value": "L-shape"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Sitting"
            },
            {
                "name": "Use for",
                "value": "Hip"
            },
            {
                "name": "Item Firmness Description",
                "value": "Firm"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Material Type Free",
                "value": "Odorless"
            },
            {
                "name": "Fabric Type",
                "value": "Polyester"
            },
            {
                "name": "Model Name",
                "value": "Seat Cushion"
            },
            {
                "name": "Specific Uses For Product",
                "value": "Coccyx Pain"
            },
            {
                "name": "Package Dimensions",
                "value": "19.25 x 7.17 x 6.65 inches"
            },
            {
                "name": "Item Weight",
                "value": "3.16 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "fremskre CYBGQP nexsana"
            },
            {
                "name": "ASIN",
                "value": "B0CNGFPVP8"
            },
            {
                "name": "Item model number",
                "value": "T-SC-001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 6 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#65,608 in Office Products (See Top 100 in Office Products) #229 in Back Cushions & Seat Cushions"
            },
            {
                "name": "Date First Available",
                "value": "November 16, 2023"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Trevor Wren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH37GYDUSX57GUIYWW2YX6SAHDVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RISIXUAR76ZC7?ASIN=B0CNGFPVP8",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "3.0 out of 5 stars Not the best by any means",
                "reviewText": "It's not the best by any means but also doesn't really have any drawbacks or flaws it's not a bad product but it's nowhere near the best it's literally exactly what it states and for the most part no top-tier pros either",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mannix",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 2, 2024",
                "reviewTitle": "Twice as expensive but it's premium for real",
                "reviewText": "My only concern before the purchase (and I'm probably not the only one) is that there's not a single bit of this company existence in Austria, nor a website or a product page anywhere.One single product sold almost only on Amazon and a not well known tech material, Breathair, from a Chinese giant.Found some other products around with Breathair and not everyone was happy about it.Shady, I was betting a 50/50 on a scam.Luckily, seems not to be the case.The manufacturing and the materials are obviously very high quality.This Breathair technology does indeed what the marketing material is selling.Tried a few others in the classical gel; they cost half or less but they all have some issues.Smelling, flattening, uncomfortable, squashing over time...Was lucky to found one years ago that works but it's like playing bingo; you have to be really lucky to find the right one.Therefore I decided to stop finding another good one and bet on this one,I'm using it since one week and it's more than usually needed to understand if it works or not.I have a Noblechairs which would be a nice one if it had a proper seating.Unfortunately, in the middle the cushion thickness is so thin that inevitably you end up with your coccyx screaming pain and after a while a very unpleasant light back pain.You can like hard seating as much as you want but if you are not puffy down there, the pain is inevitable.Can happily say that the pain is gone and the seating is finally comfortable.Pros:- Doesn't collapse over time, when you are seated for hours- Gets back to its original form immediately (you can see the bottom half lightly squeezed, just that)- No weird chemical smell, quite the opposite, textile is very high quality and smells good- Anti skid pads on the bottom, high quality as well- Removable and washable cover and the zip (sual pain point) seems high quality as wellCons:- The price; you can buy a simple office chair at that priceIt's not really a negative but be aware that the seating with Breathair is a bit peculiar.I have a gel cushion that works so I can make a comparison.When you are seated on a gel cushion you feel enveloped; you sink a bit on the center and you feel the sides of the gel cushion higher than in the middle.When you tilt a bit on the sides, more or less it follows you.Breathair is different; you basically seat on something soft but flat, there's no sinking.The feeling is similar as that with inflated cushion.When you tilt in front or the sides, it's like you are being a little pushed outward.It's not a problem when you seat properly on the center but a little awkward if you are a bit offset.Quite different from gel and not an issue really; you should always sit properly on any of these cushion, probably bought it for that very reason.If you have a medical need or don't bother about the price, go for it.Hope it helps.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcus Lori",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 23, 2023",
                "reviewTitle": "Klasse Sitzerhöhung für Auto",
                "reviewText": "Für kleine Menschen die eine ergonomische Sitzerhöhung brauchen sehr zu empfehlen",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelika S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 14, 2024",
                "reviewTitle": "Perfekt für eine gute Haltung",
                "reviewText": "Ein gutes Produkt und gut für die Haltung und schmerzfreies Sitzen. Sehr empfehlenswert",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}