{
    "remaining_requests": 41742,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/%E2%AD%90%EF%B8%8FKlim-Chroma-Backlit-Gaming-Keyboard/dp/B078X7V6Q2",
    "body": {
        "name": "KLIM Chroma Gaming Keyboard Wired USB - New 2024 - Durable Ergonomic Waterproof Silent Backlit - Ideal for Gaming and Office - Teclado Gamer - 2 ms Response Time - PC Laptop Mac PS4 PS5 - Black",
        "price": "$24.97",
        "originalPrice": "$39.97",
        "rawPrice": 24.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/%E2%AD%90%EF%B8%8FKlim-Chroma-Backlit-Gaming-Keyboard/dp/B078X7V6Q2",
        "soldBy": {
            "sellerID": "A1Y2HVFT1GWBYK",
            "name": "KLIM Technologies USA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1Y2HVFT1GWBYK&asin=B078X7V6Q2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BR8G4SDW"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/416k2q2HE5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Odd0sApsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YeVq6axDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KA9ZIEKDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61HSNFyYF7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YOKLdEQiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91K8Bsp2l4L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4fe408f9-8bf5-4c17-be70-1058607a084d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/570407f5-5397-58c8-a307-5897ff0253d2/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the KLIM Store",
            "link": "https://www.amazon.com/stores/KLIMTechnologies/page/EC7CDA15-91E9-4B3F-91EB-AF6EBCF01259?ref_=ast_bln"
        },
        "brand": "KLIMTechnologies",
        "merchantInfo": "KLIM Technologies USA",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3705,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 hr 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "✅【RAPID RESPONSE FOR GAMERS & PROFESSIONALS】 Experience superior gaming and typing with a 2ms ultra-fast response time. Our membrane keyboard is optimized for both office and gaming use, ensuring a tactile and quiet experience, so you can focus without distractions. Unlike mechanical keyboards, our wired gamer keyboard makes less sound, making it a pleasant experience for gamers, office professionals and work from home.",
            "✅【STUNNING AESTHETICS & VIVID LIGHTING】 Elevate your workspace or gaming setup with our vivid color mixing lights. The integrated low-lighting feature allows for easier typing in dim conditions. Plus, our characters are engraved using laser and etching technology, ensuring clarity and longevity. Our rainbow light up keyboard allows you to toggle the lights on and off as per your convenience. This aesthetic keyboard is a must have if you are not used to touch typing.",
            "✅【DURABILITY YOU CAN COUNT ON】 Built with longevity in mind, our keys can withstand up to 10,000,000 keystrokes. Crafted with sturdy ABS plastic, this keyboard is also waterproof, making those accidental spills a non-issue. Kickstands and a mid-low keycap design further enhance the user experience. Mostly made of highly resistant ABS plastic, KLIM Chroma Wired Keyboard is lightweight, durable and reduces paint degradation.",
            "✅【5-YEAR WARRANTY & BROAD COMPATIBILITY】 We trust the quality and durability of our product, which is why we offer a 5-year warranty. Compatible with Windows XP/ME/Vista/7/8/10/11, Mac OS, and PS5, this keyboard is perfect for PC desktops, laptops, MAC, and gaming consoles. If at any point you're not 100% happy, just send us an email, and we promise to make it right! Our Customer Service team is at your disposal and will answer within 24 hours.",
            "✅【PLUG & PLAY WITH ZERO HASSLE】 No need for drivers. This gaming computer keyboard is designed for easy setup. Just plug it in and you're good to go, whether you're working on documents or diving into intense gaming sessions. Plus, it's suitable for various devices, ensuring versatility for all your needs. Whether you need an office keyboard or are looking for gamer accessories, our aesthetic keyboard will be your perfect friend."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "17.32 x 5.67 x 1.14 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.01 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "KLIM"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B078X7V6Q2"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "k907"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,705 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,359 in Video Games (See Top 100 in Video Games) #52 in Mac Gaming Keyboards #308 in PC Gaming Keyboards"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "January 10, 2018"
            },
            {
                "name": "Brand",
                "value": "KLIM"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, PC, PS4, PS5, Mac"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Keyboard Description",
                "value": "US"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Everyday Use, Personal, Education, Student, Gaming, Business"
            },
            {
                "name": "Special Feature",
                "value": "Backlit"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Number of Keys",
                "value": "105"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "RGB"
            },
            {
                "name": "Style",
                "value": "US"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "ULTRA DURABLE Made with ABS, a particularly resistant thermoplastic, the Chroma is a very robust keyboard! Truly built to last, with this model you won't have to worry about accidental drops or even water splashes. INTENSE BACKLIGHTING KLIM Chroma features a trichromatic lighting split in 3 distinct areas. It is a perfect technology to lighten your keys in the dark and see any symbol clearly no matter the time of the day. ACCURATE AND SILENT TYPING Equipped with an internal noise reduction system, its typing is truly silent. Extremely comfortable, this keyboard offers very precise keystrokes, ideal for work or gaming.",
                "media_link": []
            },
            {
                "media_text": "Features Wireless Membrane Backlight 16 oz / 460 g Weight 17 oz / 480 g Wireless Membrane Backlight 16 oz / 460 g Weight 26 oz / 740 g Wireless Membrane Backlight 16 oz / 460 g Weight 19 oz / 560 g",
                "media_link": []
            },
            {
                "media_text": "Is it compatible with PlayStation? Yes, the keyboard works with PS4 and PS5. Is it compatible with Xbox? Yes, the keyboard works with Xbox 360, Xbox One and Xbox S, provided the games support keyboard input (please check your console/software for additional information regarding compatibility). Can you change the RGB backlighting effects or colours? No, the keyboard has a fixed backlighting rainbow effect which cannot be changed. The lights can be turned off by flicking a switch behind the keyboard.",
                "media_link": []
            },
            {
                "media_text": "Dimensions 17.3 x 5.7 x 11.4 in / 44 x 14.4 x 2.9 cm Weight 17 oz / 460 g Response time 2 ms Keyboard type Membrane Backlight modes Fixed, off Compatibility PC, Mac, PS4, PS5 Cable lenght 1.5 m Key lifespan 10.000.000 keystrokes",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/efb3b616-f77a-4add-95b7-193aaca383a5.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0cbdf6c-6adb-4624-a066-65cd4f46e890.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/24b24f0a-dfcc-4edd-b340-aab571520ae6.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/05aec51b-3d00-4847-9f79-ac6351338442.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1970ed1d-ff56-4c45-b577-89b4bea6d4ec.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d980eb6c-68dc-4407-8d7f-db339bee297b.__CR0,0,976,1400_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5447a002-5300-4c33-bee5-fd70f7c4b766.__CR0,0,976,1400_PT0_SX488_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c87a46dd-02b6-49e1-8fc9-4f141af3ae0f.__CR0,0,976,1400_PT0_SX488_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jonathan Holt II",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDSMFIQ2TUIRD5OHUV6WFHCHVXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TCQ8FK9PB51F?ASIN=B078X7V6Q2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2019",
                "reviewTitle": "5.0 out of 5 stars Great keyboard for the price, couldn't be happier with my purchase!",
                "reviewText": "While I'm not a gamer, I was looking for a sleek keyboard to use with my laptop/monitor setup that I use for schoolwork, casual gaming, and uploading YouTube videos. I couldn't be happier with the KLIM Chroma gaming keyboard! The keys are large enough and ideal for someone who makes a lot of typos (like me) and allow for fast typing with less errors! Even some of my friends who are gamers were impressed by its design and are considering this product! I purchased this product twice, first in the beginning of 2019 and unfortunately, the keyboard broke after falling off the desk and smashing into the leg of my chair, so I immediately ordered a second one that I've had for about a week now. I absolutely love it! And the price is great, actually less expensive than what I'd expect for such a quality keyboard! As I mentioned at the beginning of my review, I'm not an avid gamer, so I wasn't going to spend $$$ on a fancy keyboard.The only downside that some gamers may experience is the lighting mode. The lights are multicolored LEDs, and are on as long as the keyboard is plugged in. There is no way to turn them off and you cannot have just a single color at once. It's either all or nothing. I don't see this as a problem, though, as I actually like the multicolored LEDs and it adds ambiance to the room, especially when I'm watching Netflix in the dark!Overall, excellent product at an excellent price! Durable, lightweight, and great design! I also like how it has the little \"feet\" on the back to prop it up, unlike my old el cheapo keyboard that just lay flat on the desk, which makes it a lot easier to type. All in all, highly recommended!",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Efficaciea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVMNBV5HWWQZA2N54XGWDGLDVVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS8OA0TU47HJB?ASIN=B078X7V6Q2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2022",
                "reviewTitle": "5.0 out of 5 stars Great for working",
                "reviewText": "Do you work in an office environment?Are you trying to stand out from your peers?Do you want to increase your typing speed to match Clark Kent's?Most of all, are you trying to impress someone and hopefully ask (insert pronoun here) out on a date?If you have answered YES to any of these questions, THIS IS THE ONLY keyboard for you.Your keys will never get stuck, it is extremely responsive, spill proof, and super quiet, and the backlight is customizable. Upon installing this keyboard you will be the talk of the watercooler and very likely get important assignments at the job that will lead to a promotion. Your whole life experience will never be the same, it will be BETTER!!! Everyone has asked me about this keyboard. My boss, my manager, and my peers, somehow this keyboard has affected their very perception of reality because I have received compliments on the quality and timeliness of my work.You will surely be grateful for this quality acquisition!!!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCLVBEQSECSRWPZAS3QQZ6P5CSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GPTNDAAJ3C1I?ASIN=B078X7V6Q2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2019",
                "reviewTitle": "4.0 out of 5 stars Beautiful keyboard - with some flaws.",
                "reviewText": "Ordered this in August for use as a my main work keyboard. I get so many compliments on the look of it, and I often find myself staring at the colors! Love the look.However, the instant I hooked up the keyboard, I realized the comma key didn’t work. It has to be tapped like 3-4 times in order for it to place a comma in whatever I’m typing. I’m too busy to deal with a return, so I just kept using the keyboard.Also, within the last month or so (like 2 months after purchasing it) the lettering on the A and S keys are worn off so you can’t tell what letter they are. Super frustrating, given that this keyboard was not super cheap and also looks so darn cool.Also wish it was a better fit for my small hands, but I get that that’s a special request. All in all a good keyboard with the exception of those two issues.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Talley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC4IYTBKTAVIAYSINWJHSQ2I4OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R131XF2FSPU6IZ?ASIN=B078X7V6Q2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2018",
                "reviewTitle": "5.0 out of 5 stars Waterproof, multi-color backlight, and quality build for a good price",
                "reviewText": "After using this keyboard for a couple months I feel I have put it through its paces. The keyboard is lightweight and a much welcome bonus of being waterproof. There are little holes behind the keys to allow the liquid to drop out. That was probably my favorite feature that I didn’t know about until reading the box. The backlighting is set and can’t be changed, I am disappointed that in a gaming keyboard the wasd keys aren’t a different color or somehow highlighted. That seems like a must in my mind for a keyboard sold as a gaming keyboard. But in all actuality it doesn’t affect performance, in that regard the keys are very clicky and have a nice feel. I’ve always been heavy handed in typing and these have a satisfying key throw. Key presses were registering nice and fast, no noticeable lag. Since it doesn’t have any super fancy features there is no extra software needed and should just plug and play into any computer. The build quality seemed to be good , I didn’t feel like I would break it easily.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG75O2X42FFOOCISWOIQY4BG4SLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KSC45Q7HYG2A?ASIN=B078X7V6Q2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 2, 2020",
                "reviewTitle": "5.0 out of 5 stars I Love! Love! Love! This keyboard!",
                "reviewText": "PRO's: I love the keyboard...big letters to see and a light you can turn on or off. It's quiet typing if you are not a heavy hitter. It's pretty basic.CONS: The switch to turn the keyboard light on or off was hard to locate and seems a little easy to break if not careful. There is no volume control or mute button. While playing a game, I use the arrow keys for movement but the space bar for jumping however when you are using your left hand for the arrow keys and your right hand for the mouse, using the Space bar is hard to reach to press. Perhaps a longer space bar and the ALT Windows and Ctrol button smaller, actually you don't need the windows key on the right side.OVERALL: Great basic keyboard that's lit! Keys feel well made and not cheap, the overall frame is well made and is weighted perfectly...not sliding around on the table, however I have a mat under it but non the less, I went through 3 keyboards finding this one to be the best.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZGZSMQZPLJ4RE6WQRBYWIH5V2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R308HQNFDRSU9B?ASIN=B078X7V6Q2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2018",
                "reviewTitle": "5.0 out of 5 stars A great product at an affordable price",
                "reviewText": "This is my first keyboard that I purchased for personal use. The RGB backlighting on the keyboard is dim and subdued, which is something that I personally like when I use my computer at night. The keys are very responsive, relatively quiet but still has a satisfying click, and have an overall comfortable feel. The keyboard is also lightweight which can be off-putting for some expecting a heavier keyboard. Even after letting 3 of my friends borrow this keyboard and use it for a week the general consensus is the keyboard has a great quality despite it's price. Only downside I've encountered was the exclusion of a function key (which I need to use to change the function keys from media key to function keys). Definitely a good purchase for people who are on a budget but want a good keyboard.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 6, 2024",
                "reviewTitle": "peggior acquisto fatto!!",
                "reviewText": "come da titolo sconsiglio l acquisto di questo prodotto in quanto alcuni tasti risultano sbagliati(esempio la chiocciola viene fuori premendo il tasto del asterisco invece che il tasto della chiocciola) quindi se non volete cadere in questo articolo difettoso evitatelo...non comprerò mai più un articolo di questa marca",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ami075",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 11, 2023",
                "reviewTitle": "Für diesen Preis eine der besten Tastaturen",
                "reviewText": "Meine Alte Tastatur habe ich leider gewässert, und mir dann diese hier bestellt und ich muss sagen, für diesen Preis die wohl beste Tastatur überhaupt. die Tasten klingen sehr gut, schöne Farbenkombination und das reagieren der Tasten ist weder zu empfindlich wenn man sie drückt, noch braucht man zu viel Kraft. Alles in allem also eine spitzen Tastatur :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mik",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 3, 2020",
                "reviewTitle": "Light, soft, quiet",
                "reviewText": "This is a great little, comfortable, light and illuminated budget keyboard for any purpose.The buttons are sturdy and travel enough down to give you a good feel while typing, especially if faster. The illumination is nice and gentle on the eyes in low lighting conditions yet perfect for typing in even pitch black if you wish. Illumination is activated by a little switch in the upper right corner.The keyboard is otherwise very quiet, very soft to touch thanks to that good coating on the surface (which I hope lasts before it gets all shiny and slippery :)). Overall, prolonged typing on this is great and doesn't fatigue me.As with every keyboard, due to differing positions of the \\ button and shape of Enter, it can take just a bit of time to adjust so that your fingers are reaching for the correct spot.I would say this keyboard works great for a gamer like me, but if you like more function buttons for WOW-type games, you won't find this adequate. I find it fine for me to play games like Skyrim or Fallout. The keys aren't stretched at all so the spacing is small enough that you don't have to reach too far from the WASD to access 10+ other commands/functions.But some function keys like for playing/pausing videos or music, opening calculator, adjusting volume, screen brightness, etc., are missed.Didn't test the spill-proof nature :) But I had a keyboard in the past that had this feature and actually could go into top rack of a dish-washer. It worked great for years. This one has the similar feel so no reason it shouldn't work just as well.The key thing for which I would give this 5 stars is the customer support!I received my first keyboard with a few buttons not functioning. I immediately reached out to customer service and they responded promptly, first asking to test a few things and send them a picture (in which I pointed out what wasn't working). Within 3 days from starting my communication with them, I had my replacement keyboard.Very happy with courtesy and speed of resolution.Would buy again!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 22, 2020",
                "reviewTitle": "Comodidad",
                "reviewText": "Una compra muy recomentada, apesar de no ser un teclado mecánico no tiene nada que envidiarlos, funciona perfectamente y es muy cómodo escribir en él, apenas hace nada de ruido y eso también se agradece.Yo lo he comprado básicamente para jugar y de momento funciona al 100%, no me ha dado ningún problema y responde de forma muy rápida.Hay que tener en cuenta que el teclado no permite cambiar los colores de los LEDS pero al menos en mi caso no es un gran problema, los colores que traen de serie son suaves y es bonito de ver, te dan la opción de apagarlos con un botón.Podría asegurar que si quitamos los teclados mecánicos es el mejor que he tenido en años y por este detalle le doy las 5 estrellas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrés",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 7, 2020",
                "reviewTitle": "Does the work well",
                "reviewText": "I bought this keyboard since I was tired of my laptop's integrated keyboard. For what it is more important, the writing, it works well. While it's not mechanic keys, still is very comfortable, has a good bounce and overall I have a much better experience trying to write fast now than in comparison with my laptop. I am happy with my purchase.My only issue are the lights, since you can only turn them ON/OFF, without being able of configuring the light intensity (until there's some hidden feature I didn't know about). So now on the day, when the lights are not needed, the intensity is OK, but for night when you need the lights turned ON, the light intensity is too high. That's my only complain for now (1 week using the product).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$24.97",
                "sellerName": "KLIM Technologies USA",
                "sellerRating": "5"
            }
        ]
    }
}