{
    "remaining_requests": 41791,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Corsair-Optical-Mechanical-Gaming-Keyboard-Hyper-Polling/dp/B0B9RLFYHW",
    "body": {
        "name": "Corsair K70 PRO RGB Optical-Mechanical Gaming Keyboard - OPX Linear Switches, PBT Double-Shot Keycaps, 8,000Hz Hyper-Polling, Magnetic Soft-Touch Palm Rest - NA Layout, QWERTY - Black",
        "price": "$129.00",
        "originalPrice": "$179.99",
        "rawPrice": 129.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Corsair-Optical-Mechanical-Gaming-Keyboard-Hyper-Polling/dp/B0B9RLFYHW",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CG9H1JQ8"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B9RLFYHW",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41g4ShGQe6L._SS36_.jpg"
            },
            {
                "asin": "B0BBWJ6V1R",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/412lnRV2s-L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41aEu AxLFL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41N2P-0hXpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5128TjvRWmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ivfGs8SNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wwyn9uyPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QFUGidweL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pCRgQWWBL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Corsair Store",
            "link": "https://www.amazon.com/stores/Corsair/page/A8559A65-3FF5-4A92-A08B-15F699944A8E?ref_=ast_bln"
        },
        "brand": "Corsair",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 179,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 10 hrs 28 mins",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Legend Continues: The K70 PRO retains the iconic elements of the award-winning K70 RGB with a durable aluminum frame, CHERRY MX mechanical keyswitches, and per-key RGB backlighting, while setting a new bar for performance with AXON technology, PBT double-shot keycaps, and a tournament switch.",
            "CORSAIR OPX Optical-Mechanical Keyswitches: Hyper-fast input with 1.0mm actuation distance and smooth linear travel, guaranteed for 150 million keystrokes, and register keypresses up to 8x faster than standard mechanical gaming keyboards with CORSAIR AXON.",
            "Powered by CORSAIR AXON Hyper-Processing Technology: Enables a new level of K70 performance, processing and transmitting your inputs up to 8x faster than conventional gaming keyboards with 8,000Hz hyper-polling, 4,000Hz key scanning, and up to 20 layers of hardware RGB lighting processing while maintaining speed performance.",
            "PBT DOUBLE-SHOT PRO Keycaps with Standard Bottom Row: A precision-molded keycap set resists wear, fading, and shine, with 1.5mm thickness for rigid stability and a standard bottom row layout to swap in custom keycap sets.",
            "Switch on the Competition: Flip the tournament switch to focus on winning those crucial games, automatically locking to distraction-free static backlighting and disabling accidental macro activations."
        ],
        "description": "The CORSAIR K70 PRO RGB Optical-Mechanical Gaming Keyboard delivers cutting-edge performance, equipped with hyper-fast CORSAIR OPX optical-mechanical keyswitches and CORSAIR AXON Hyper-Processing Technology. Win in style with an iconic aluminum frame and dynamic per-key RGB backlighting topped by durable PBT double-shot keycaps, easy to take on the go with a detachable USB Type-C cable. Powerful iCUE software on both PC and macOS enables custom macro programming, key remaps, and more, while dedicated media keys and an aluminum multi-function volume roller offer convenient control over media. With a tournament switch for instant compliance with competition guidelines and onboard storage for up to 50 profiles, the K70 PRO is ready to take on any challenge.",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Corsair"
            },
            {
                "name": "Series",
                "value": "‎K70 PRO RGB"
            },
            {
                "name": "Item model number",
                "value": "‎CH-910941A-NA"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 10"
            },
            {
                "name": "Item Weight",
                "value": "‎2.47 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎17.5 x 6.54 x 1.58 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎17.5 x 6.54 x 1.58 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Manufacturer",
                "value": "‎Corsair"
            },
            {
                "name": "Language",
                "value": "‎English"
            },
            {
                "name": "ASIN",
                "value": "‎B0B9RLFYHW"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Date First Available",
                "value": "‎November 29, 2022"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 179 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,494 in Video Games (See Top 100 in Video Games) #193 in Mac Accessories #314 in PC Gaming Keyboards"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, Gaming Console, PC"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB-A, USB-C"
            },
            {
                "name": "Keyboard Description",
                "value": "Gaming"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Volume Roller, Backlit, Hotkeys and Media Keys"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "RGB"
            },
            {
                "name": "Style",
                "value": "K70 RGB PRO"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/110b48fb-74d2-4fab-9653-059b39b807ab.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e112e5d9-b695-4133-853e-d1d134979119.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5aa38867-ff24-45bb-86f4-673bc7aac18e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90d9acad-4424-4faa-856d-72ddef16d6c3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83ddab36-d981-4a0f-b098-d23bcd9edaa3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62224158-8206-474a-9808-12342baa9f0c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/954d5f6b-134b-4c58-b816-3050faef46da.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/da46373f-06c0-4a32-85d6-0839ef116440.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Devin Reitan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5PF5BCXZMJJGHPHKPCHOZWNEXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROSREYDIK9ZS1?ASIN=B0B9RLFYHW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Exceptional performance and design!",
                "reviewText": "I recently upgraded to the Corsair K70 MAX mechanical keyboard, and I am thoroughly impressed with its performance and design. The keyboard's build quality is outstanding, featuring a durable aluminum frame that gives it a premium feel.Typing and gaming on this keyboard are an absolute delight. The Cherry MX switches provide a satisfying tactile feedback and a smooth keystroke, making it perfect for both typing and gaming enthusiasts. The keys are responsive and accurate, enhancing my overall productivity and gaming experience.One of the standout features of the K70 MAX is its customizable RGB lighting. The keyboard offers a wide range of vibrant and customizable lighting effects, allowing me to personalize my setup to match my mood or game theme. The Corsair iCUE software is intuitive and user-friendly, making it easy to create complex lighting patterns and synchronize them with other Corsair devices.The K70 MAX's dedicated media keys and volume wheel are incredibly convenient, providing quick and easy access to multimedia functions without interrupting my workflow. The detachable wrist rest adds to the comfort, ensuring that I can type or game for extended periods without discomfort.Corsair's attention to detail is evident in every aspect of this keyboard, from the premium keycaps to the sturdy USB passthrough port. The keyboard's anti-ghosting and full-key rollover features guarantee accurate input even during intense gaming sessions.In conclusion, the Corsair K70 MAX is a top-tier mechanical keyboard that offers exceptional performance, durability, and customization options. Whether you're a gamer, programmer, or anyone in need of a high-quality keyboard, the K70 MAX is a superb choice. I couldn't be happier with my purchase, and I highly recommend it to anyone seeking the best in class!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JDougal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXSYDKMHTZIGBOH4PYX2SHEYMLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TQM6H22OYC8Y?ASIN=B0B9RLFYHW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2023",
                "reviewTitle": "5.0 out of 5 stars A Premium Keyboard",
                "reviewText": "The Corsair K70 PRO RGB Optical-USB-C Mechanical Gaming Keyboard is a premium keyboard that is perfect for gamers. It is built with high-quality materials and features a number of features that make it ideal for gaming.The keyboard is made of an aluminum frame that is both durable and lightweight. It also features a detachable USB-C cable that makes it easy to transport. The keyboard is backlit with RGB LEDs that can be customized to your liking.The keyboard uses optical switches that are designed for fast and accurate keystrokes. The switches are also very durable and should last for many years of use. The keyboard also features a number of additional features, such as dedicated media keys and a volume wheel.I have been using the Corsair K70 PRO RGB Optical-USB-C Mechanical Gaming Keyboard for a few months now and I am very happy with it. The keyboard is very responsive and the keys feel great to type on. The RGB lighting is also very impressive and can be customized to create a variety of different effects.Overall, I would give the Corsair K70 PRO RGB Optical-USB-C Mechanical Gaming Keyboard 5 stars.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sixxth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJIC5YTL23LQR6K7QXIKOQS4EKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R88R5WF6A21IC?ASIN=B0B9RLFYHW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2023",
                "reviewTitle": "5.0 out of 5 stars White/Aluminum keyboard Glows like Las Vegas",
                "reviewText": "I was looking to get an RGB keyboard to replace a very old keyboard. Ive been getting ridiculous with the RGBs, so I figured Id continue with this. I looked at both the black and the white keyboards, and the white keyboard colors look brighter reflecting off the white, and match my Fractal case. Cool! ICUE is just painful, but I was able to get some really great looking profiles for this.PROS-lights up like the Vega strip-Volume and mute keys on the keyboard-Keys to change brightness of keyboard-The palm rest magnetic attachment is good-clickey OPX keyboardCONS-Still a little more clatter from the keys than I want-Keys are *very* sensitive. I accidentally hit keys just resting my hand sometimes. Adapting to it tho-Key tops a little more raised than Im used toIts a RGB keyboard, looks good, works fine, some nice features. If youre into RGB lighting, you'll like this.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A. L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNWBYIH6GZCCS4TT2S2EZMKYFGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SY7KBNJ1M5MP?ASIN=B0B9RLFYHW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 18, 2023",
                "reviewTitle": "4.0 out of 5 stars Great looking keyboard and nice standard features but...",
                "reviewText": "This keyboard overall is very nice. I really like it white and all but these were the main drawbacks for me.I don't know how or what is happening at the factory but even after exchanging it, I find small black bits, some dirt marks on the keyboard, and scuffing on the plastic. The QC really isn't there for some odd reason and it being white makes it stand out more. Not much of a dealbreaker but is very odd indeed.The main reason I don't like the board is horrendous like the pinging or ringing sound when not seated firmly on a desk or something- the reverb of the click inside the keyboard and since it's metal or smth I assume that is what's making the sound. Once you notice it it's kind of right at you.I would say that if you can get past that sound thing (you can mod foam into it), or my anecdotal experiences with the cleanliness of the device upon reception, then it is a great keyboard. At its sale price, it is a fantastic piece of kit. Otherwise, regular price I would likely avoid it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 13, 2023",
                "reviewTitle": "Keyboard has potential but major issues right away and Corsair iCUE is terrible software",
                "reviewText": "I bought this keyboard because Corsair advertised the magnetic switches with custom actuation points as well as sound dampening inside the case so it wouldn't sound awful like all other gaming keyboards, but as usual with Corsair the product is overpriced and the quality control is a failure.Pros:-The switches seem nice and the actuation adjustment mostly works-The design and layout of the top plate is nice and I like the extra media keysCons:-iCUE software is terrible and makes this keyboard not worth it-Even though Corsair says they added foam and sound dampening, it still sounds loud and awful. It would be so easy to make these keyboards quieter and less annoying like small brand names do, but large brand names like Corsair/Razer don't seem to care and make terrible sounding products. You shouldn't be able to hear CLACK CLACK CLACK from 4 rooms away. I have a mechanical keyboard that cost one third the price and is silent, you can barely hear yourself typing on it-The wrist rest is too high for the keyboard, but you can just not use it if preferred-The price is way too high to justify spending on something with major issues-Firmware update doesn't work at all, causes the software to not recognize the keyboard and does nothing-Actuation colour settings don't actually work or do anything, you can change the setting but it never changes on the keyboard-iCUE tells you to save a profile to the board to use settings while iCUE is not running, but after saving profile to the board and your profile is shown under the \"On Board\" section of saved profiles, closing the iCUE software erases all settings and they don't actually stayThe firmware updater in iCUE is broken completely, it just causes the software to stop recognizing the keyboard and then nothing ever happens. If you close and restart iCUE it will open and prompt you to do the firmware update again because nothing ever updates and it doesn't work. If you click Update like it asks you, it just closes again and nothing happens. The only way to change any settings on the keyboard is to ignore the firmware update, as soon as you click Update the keyboard disappears from Devices but never updates or reappears.It also says you can save your profiles to the board and use your settings without the software running, but this doesn't work either. Even though my profile is saved under the on-board profiles section, closing the software immediately removes all the settings I saved. Pressing the profile key to switch to different profiles doesn't do anything either, my profile is gone completely until I relaunch iCUE.Like Razer Synapse this Corsair iCUE software is terrible bloatware and borderline spyware. At this point I'd rather just return the keyboard. What a terrible experience for over $300.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DanielSR",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 2, 2023",
                "reviewTitle": "Excelente teclado",
                "reviewText": "Es mi primer teclado mecánico y estoy muy satisfecho con él, las teclas son muy suaves. Lo único que hecho en falta es que no había una distribución latinoamericana para que tuviera la Ñ sin embargo, con las posibilidades que ofrece el software de Corsair para configurar teclas, se puede resolver el problema, ya sea que lo configure como si fuera teclado latinoamericano o lo deje en inglés. En cuanto iluminación es muy personalizable y es muy atractivo. Los materiales se sienten de muy buena calidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2023",
                "reviewTitle": "Doesn't work with their software",
                "reviewText": "Didn't work with my icue, submitted ticket with corsair, its been 15 days, still nothing from them. posted on reddit, they said they would look into it, still nothing, absolute junk",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 6, 2023",
                "reviewTitle": "Incredibly sensitive",
                "reviewText": "Would recommend however resting my hands lightly on the keyboard results in keys being pressed",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pavel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on November 1, 2023",
                "reviewTitle": "Really good keyboard",
                "reviewText": "The really good keyboard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}