{
    "remaining_requests": 41810,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Arteck-Keyboard-Universal-Adjustable-Brightness/dp/B09STTTKBK",
    "body": {
        "name": "Arteck Backlit USB Wired Full Size Keyboard with Media Hotkey for PC and Laptop",
        "price": "$29.99$26.79",
        "originalPrice": "$33.99",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Arteck-Keyboard-Universal-Adjustable-Brightness/dp/B09STTTKBK",
        "soldBy": {
            "sellerID": "ALSLF3ULUWXC6",
            "name": "Arteck",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ALSLF3ULUWXC6&asin=B09STTTKBK&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 20%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51EltYkPAdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41 BpBAOfML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51BvXPeHShL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410P1Zy1LoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LmzjGbYoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZsJ1rtB5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91CYo6o4-EL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a2cadeb-a773-42cd-8164-0f8737bc7f3b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f23ab3fd-276d-45af-a655-5809ccd7727c/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Arteck Store",
            "link": "https://www.amazon.com/stores/ARTECK/page/8961EB42-6124-409A-88CB-BB090EF1BDA6?ref_=ast_bln"
        },
        "brand": "ARTECK",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1600,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 13 hrs 16 mins",
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35. Order within 6 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "7 Unique Backlight Color: 7 Elegant LED backlight with 3 brightness level.",
            "Easy Setup: Simply insert the 1.2M (4 feet) USB wire into your computer and use the keyboard instantly.",
            "Ergonomic design: Scissors X structure gives you the comfortable typing experience, low-profile keys offer quiet and comfortable typing.",
            "Ultra Thin and Light: Compact size (16.7 X 4.5 X 0.24in) and light weight (17.4oz) but provides full size keys, arrow keys, number pad, shortcuts for comfortable typing.",
            "Package contents: Arteck Backlit USB wired Keyboard, welcome guide, our 24-month warranty and friendly customer service."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "17.32 x 6.18 x 1.06 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.41 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Arteck"
            },
            {
                "name": "ASIN",
                "value": "B09STTTKBK"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,600 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#51 in Computer Keyboards"
            },
            {
                "name": "Date First Available",
                "value": "February 18, 2022"
            },
            {
                "name": "Brand",
                "value": "Arteck"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, PC, Desktop"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Keyboard Description",
                "value": "Backlit, Multimedia"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic, Backlit, Hotkeys and Media Keys"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "RGB"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Product Dimensions",
                "value": "16.7\"L x 4.5\"W x 0.24\"H"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Let there be Light Elegant LED backlight with 2 adjustable brightness level, 7 different colors(deep blue, soft blue, bright green, soft green, red, purple, cyan) making typing that much more enjoyable and awesome to look at. 1.2 Meters (4 feet) USB cable Plug & Play Just simply insert the 1.2M (4 feet) USB wire into your computer like desktop or laptop, then the keyboard can be used instantly. No need driver. The cable length is 1.2 meters or 4 feet. It allows you to gain quick access to common functions, such as volume level, playback control, brightness, and more. It also provides arrow keys, number pad with slim and compact design. Comfortable, quiet typing x The whisper-quiet, low-profile keys bring a whole new level of comfort to your fingertips. What's more, keep all your most-used functions and media controls closer than ever Windows-dedicated hot keys. The construction of this scissors-kick keys can be used more than 3 million times continuously. 2 Years Service If you have problem to use the keyboard, you can reconnect the keyboard and the keyboard has 3 channels to change. If you still have the issue, you can contact the support team printed at the back of the keyboard as the product has 2 years service.",
                "media_link": []
            },
            {
                "media_text": "HA305-3B HB305-3B HW305-3 HB305-4B HW192 Backlit ✓ ✓ - ✓ - Connection USB Wired 3 Bluetooth USB Wireless Bluetooth USB Wireless Keys Area Main+Arrow+Number Main+Arrow+Number Main+Arrow+Number Main+Touchpad Main+Arrow+Number Recharging - USB-C USB-C USB-C Micro USB Size(inch) 16.84*4.59*0.84 16.84*4.59*0.84 16.84*4.59*0.84 14.25*4.59*0.84 16.85*4.92*0.55 Weight(oz) 17.69 17.64 17.14 15.17 14.89",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6f8b03df-905c-4452-8cd3-2aa198a76d89.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30bfbeec-193f-43d1-bed8-510a99a20f4f.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2beb9f8b-264c-465f-8357-82dd319d214b.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/746f84ec-1166-417e-98eb-dbf9b248215c.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d767d65-a911-485e-92bf-94d6c53fbb2f.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d3de5acd-2593-45b5-a911-9c41ff9b1c13.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2f0a86d3-67f3-4790-ad33-9985b726ee27.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/32381816-8298-4d0e-b989-c7de901a1d54.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/be496781-31af-4592-967b-06d8f02242c0.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Clarissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4PSVOCTH4R353VAC3LY6C7ENWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J6OH5EQSOR44?ASIN=B09STTTKBK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Pleasantly Suprised",
                "reviewText": "My review is totally individual and not a marketing ploy by anyone trying to get you to buy their keyboard. I am on the computer all day long - sometimes after the sun goes down for my job. So I needed a good keyboard with backlighting. I picked this keyboard based on its description and am impressed so far. Some reviews talked about the letters rubbing off the keys. I don't see how because the keyboard lights show thru the letters and numbers of the keys so I don't see how that could happen. You can make it show differnent colors for what you like to see and the lights are great in low room light - a big plus. They keyboard is heavy enough to stay put on the desk and they keys have a good feel. They don't click like other keyboards. The keyboard is not as wide top to bottom as most keyboards but it has not been a problem at all - in fact, it saves space on the desktop so I like that. The keys are spaced just like all normal sized keyboards. I use Windows 11 and haven not had any issues. I only have had this for a few weeks now - and I have used it quite a lot as my job is computer work. I do recommend this keyboard for anyone looking for one with a great feel and backlighting. Time will tell but so far, it fit the bill really well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Millenniakat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOHGF27GPZK5P7CBOCCKCA52QXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OKX55VN1FER6?ASIN=B09STTTKBK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars I LOVE, LOVE, LOVE this keyboard!!!",
                "reviewText": "I thought the first one I bought had given out so I bought this second one, then I discovered the first one still works! All good though, this thing is so comfortable to use, plus it's very quiet - I love that. The keys have just the right feel to them. Whatever the key tops are made with is smooth, has just the right amount of 'dip' in the middle of each key, and an easy touch. The lights are gorgeous, the colors are easy to change depending on my mood, plus the light intensity is adjustable! I've been typing for over 50 years and this is the best keyboard, typewriter or keyboard, that I've ever used. The price is very reasonable, so if you'd like a lighted keyboard with a great touch - this is for you",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4UTJGSTIAXA75D4U73QG7OFTEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REH2ZVS9HUCT8?ASIN=B09STTTKBK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect if you like this type of keyboard",
                "reviewText": "I switched from a large, mechanical type keyboard to this one because I don't really like the loud noise of the mechanical keyboards but also wanted something more compact and backlit. For the price, I don't think this can be beat! It's also very nice that you can adjust the intensity of the lighting and also change the color. The keys feel solid and very easy to type with this keyboard. There's nothing on the back of the keyboard to adjust the tilt for ergonomics, so if that's something that's important, consider before buying this one. It's a pretty basic, compact keyboard which is exactly what I wanted and very happy with this purchase. Time will tell if it holds up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nord",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIXDKZRZY6SVNH6UE65JJC2B3PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYCXY96Y9JMPM?ASIN=B09STTTKBK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2022",
                "reviewTitle": "4.0 out of 5 stars Didn't expect to like it, but I do.",
                "reviewText": "I replaced a mechanical RGB keyboard with this due to \"click\" sound reasons that annoyed my spouse.So, I just returned a great ROCCAT Vulcan 122 keyboard for this low profile RGB keyboard, and I thought I would be greatly disappointed from just owning a award-winning mechanical master piece to a budget version of a scissor switch keyboard. I have to say, after I have been playing with this for a bit I am happily surprised, the keys are somehow soft feeling yet with a tactile feel to them but without the \"click\" noises from a mechanical keyboard, I am very custom to these type keyboard, most people are these days since it is usually the standard issue with new computers, however, they usually don't have any type illumination to the keys so they are not great in low light settings. This keyboard has 7 colors to choose from, you can easily adjust the brightness and which color you want directly from 2 keys on the keyboard set between the right [Alt], [Ctrl] key which I accidentally hit a couple of times with my palm, for future versions maybe put those buttons either under the [Delete], [End], [PgDn] button section of the keyboard to avoid accidental hits. Not a huge issue but a side-note.Other than that, there is not much to say, so far it performs like a keyboard should, it seems to respond well to every keystroke, soft but tactile feel to the keys, firm and steady with no \"wiggly\" keys.The illumination is \"soft\" and bright enough on the lowest settings to lit up every key and it has a backlit that doesn't take over the entire keyboard if that makes sense, some keyboard have such a bright backlit it overpowers the key-lights so they drown and with all that light you still cant see the letters of the key which some people need. I don't have the muscle memory in my fingers to remember the wheree the keys are so I need to see the keys when I type or play, not a problem with this board even on the brightest setting, But really, its good enough on the lowest setting. On my keyboard though, the FN row, Win Alt Ctrl and arrow buttons seem to have less illumination than the main keys of the keyboard, not at all a problem on the bright settings but its worth noting that on the low setting they are visible but much less so. As usual the space-bar, Shift buttons has a slightly louder noise level, I have seen people commenting on that on multiple Scissor keyboards, that usually comes from the added little steel pin, that most scissor keyboards have to make those \"longer\" or \"wider\" keys \"uniform,\" meaning it gives them a more even press, without it you risk ending up with having to make sure to press the key in the dead center for it to register the keystroke, with it you can hit the key on the edges and it will still register, makes sense? but for that reason it gives a bit of a different noise, still very quiet, just adds that little \"plastic hits steel\" sound. This time, absolutely no noise complaints from my spouse.It comes with a 4' cord which is plenty long if you ask me, people want ultra long cords for some reason, I sit with the screen maybe 2' away from me at all times, I see no reason to have longer cords. The cord does feel a bit cheap to me, it works but my other keyboard had this thick braided and nice cord which felt solid and like it was made with quality, this cord is thinner, feels and looks cheap and you get the feeling that this is what will fail first with this keyboard.That said, for the money you are spending on this keyboard I have to say I am surprised so far, typing and using the keyboard it feels almost as good as the $160 mechanical I replaced with this board. Even though it doesn't have any Ghosting or rollover features it responds ok in the game I play and typing, this review is all typed down with this keyboard.For $27 this keyboard is a solid choice if you can't afford a mechanical keyboard or if you like me have a spouse that gets annoyed with the \"click\" sounds from mechanical boards and you are looking for a quiet keyboard with some solid illumination.",
                "reviewVotes": "32 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Artie B.Artie B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYTC353OG7WOTGWT2BLYGA6WKLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUHLNWHZ97SYP?ASIN=B09STTTKBK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent keyboard in this price range!",
                "reviewText": "OK, so I destroyed the keyboard on the best laptop I ever owned. I simply hated to get a new lap top and re-install everything.... IKR ?? I looked at the videos showing how to replace keyboard on this model laptop---and it is a NO GO-- One must break the plastic tabs that hold the existing keyboard in order to remove it... The end result is a yucky-fitting replacement keyboard that will bug the daylights out of the user. Think loose fit...Soi got this replacement keyboard and it is everything they claim. USB is simple plug-and-play and the performance of the keyboard is excellent. And it NEVER turns itself off. Never.The backlights have select-able brightness and a choice of eight colors. Works like a charm.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71L+S7-+CyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wintersoulstice",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMUO26QUOB66NJI2HMISWTJZU3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GZWCISVJ4CYU?ASIN=B09STTTKBK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Great keyboard at a great price",
                "reviewText": "I honestly thought I'd ordered the model with the touchpad, but we have 3 pcs and it'll be a great spare. Love that it's backlit and not wireless. Very sturdy, reasonably quiet, and smooth keystrokes. Nice size, too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Gangi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6DNDU7KS4QKH3TUNUEV3XOZ5LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q22UIJ2C20GR?ASIN=B09STTTKBK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Best keyboard ever",
                "reviewText": "If this keyboard ever breaks, I will immediately buy it again! The keys are not at all clanky and plastic,, but smooth and 98% silent! Beautiful illumination colors and choices of brightness. Excellent.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tzon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 23, 2023",
                "reviewTitle": "Very easy to get used to. Tactile keys. Pretty sweet actually.",
                "reviewText": "This multi-colored back-lit, low-profile keyboard is worth the price for what you get. The keys are tactile, they're tight but not stiff, and very responsive. It almost feels mechanical but much more quiet and less expensive. This keyboard would work for entry level gaming up to intermediate-level. The keyboard is laid out perfectly for my needs. My only two minor gripes is that there's no legs to raise the keyboard up higher. And the RGB lighting doesn't have a setting where the RGB slowly changes from color to color. These are minor details, as I still give this keyboard a full 5 star rating. Great little keyboard. Recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "streetyson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 27, 2023",
                "reviewTitle": "Full sized-ish, fully works",
                "reviewText": "Pros: Buttons all work and are not mushy, feels of decent construction (lightweight, but firm enough when sat on a table). The backlighting works, colour options ok, and the cable on mine was 1.8m rather than the advertised stingy 1.2m. Also, I dealt with Arteck customer support and they were very quick to repsond - and very nice people.Cons: Though styled with a full-sized keyboard's key layout, it isn't full-sized in terms of tradtional keyboard's dimensions but about 85% as long and half as deep as my old fashioned regular desktop keyboard. Also, as the keyboard is low profile and its angle shallow (and no folding feet option either), the low chiclet key press is quite shallow too. All of which makes it that bit bit too low-sitting & shallow for a 6'3\" man with extra large male hands (especially when used to a physically bigger old keyboard with traditional old desktop keyboard keys).But if you're a kid/teen or small adult, or say if you need a backlit keyboard that's nearly full sized layout and yet notably more modern & slimline (and portable) than an old full sized keyboard then this is a good option, and a great choice for the price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jan-Philip Kranzusch",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 16, 2023",
                "reviewTitle": "Zuverlässige und anwendungsfreundliche Tastatur",
                "reviewText": "Ich habe die Arteck kabelgebundene Tastatur mit Hintergrundbeleuchtung und numerischem Keypad gekauft und bin zufrieden mit meiner Wahl. Die Tastatur hat ein ansprechendes Design und ist gut verarbeitet, was sie zu einer soliden Ergänzung für den Schreibtisch macht.Die Hintergrundbeleuchtung ist ein nettes Feature, das das Arbeiten in weniger beleuchteten Umgebungen erleichtert. Die Tasten haben einen angenehmen Anschlag, was das Tippen komfortabel macht, und das numerische Keypad ist gerade für das Arbeiten mit Excel sehr praktisch.Ein großer Vorteil ist die einfache Einrichtung. Die Tastatur funktioniert sofort nach dem Anschließen, ohne dass eine zusätzliche Software erforderlich ist.Insgesamt ist die Tastatur eine zuverlässige Wahl für den täglichen Gebrauch, wobei Design und Funktionalität gut kombiniert sind. Für alle die eine einfache und zuverlässige Tastatur suchen, ist die Tastatur sehr zu empfehlen.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ej",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on January 23, 2024",
                "reviewTitle": "感触よく見やすい",
                "reviewText": "今まで何台か安物を使っていたがそれらに比べると感触、見やすさが優れている。耐久性は今後使用して隙間にゴミが混入したりして故障等の不具合発生しないかどうかなので現状は不明。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Max",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 26, 2023",
                "reviewTitle": "The most amazing keyboard I've ever owned!",
                "reviewText": "I'm super picky about my keyboards. I need to have all my f keys together, not spaced out in sets of 4 like every sinlg PC keyboard. I need the print screen button to be 1 press, not fn button and a press. I also need the f toggle lock button away from my wrists, idc where, just not where I can accidentally tap. I also need the buttons to actually do what they say they'll do, like pg dn actually making the page go down. Big fan of that. Novel idea. This keyboard has all that and more! The only issue is it doesn't have legs, but it has every other thing I like which is really hard to find (apple buttons don't match pc so I can't use those, I can't even find print screen on those with how it translates). The lighting on the keyboard too has 3 different brightness settings as well as all the different colours. I use teal, it's very easy on the eyes, red is also quite nice. It even has pink! Shocker right there. I'll def be buying another of these as back up!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}