{
    "remaining_requests": 41581,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bluetooth-Keyboard-Portable-Rechargeable-Smartphone/dp/B088ZQNNX5",
    "body": {
        "name": "Ultra-Slim Bluetooth Keyboard Portable Mini Wireless Keyboard Rechargeable for Apple iPad iPhone Samsung Tablet Phone Smartphone iOS Android Windows (10 inch Black)",
        "price": "$11.99",
        "originalPrice": "$19.99",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bluetooth-Keyboard-Portable-Rechargeable-Smartphone/dp/B088ZQNNX5",
        "soldBy": {
            "sellerID": "AMTYIYTJGN7E0",
            "name": "Xukinroy",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AMTYIYTJGN7E0&asin=B088ZQNNX5&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CLCKCDHD"
        ],
        "asinVariationValues": [
            {
                "asin": "B088ZQNNX5",
                "variationName": "Color",
                "variationValue": "10 inch Black",
                "price": "$11.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41DqCDrq-eS._SS36_.jpg"
            },
            {
                "asin": "B0CH3MVSZK",
                "variationName": "Color",
                "variationValue": "10 inch Blue",
                "price": "$14.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-Dyjti+XL._SS36_.jpg"
            },
            {
                "asin": "B08HV7HR1Q",
                "variationName": "Color",
                "variationValue": "10 inch Light Green",
                "price": "$13.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/416s5P8FA8S._SS36_.jpg"
            },
            {
                "asin": "B0B2P5C2C9",
                "variationName": "Color",
                "variationValue": "10 inch Pink",
                "price": "$13.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41nrN5oGGmL._SS36_.jpg"
            },
            {
                "asin": "B093KXZYJH",
                "variationName": "Color",
                "variationValue": "10 inch White",
                "price": "$13.49",
                "variationImageURL": "https://m.media-amazon.com/images/I/41dGxiVFzWS._SS36_.jpg"
            },
            {
                "asin": "B088ZWT5N1",
                "variationName": "Color",
                "variationValue": "7 inch Black",
                "price": "$11.56",
                "variationImageURL": "https://m.media-amazon.com/images/I/414UR4bVM+S._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41DqCDrq-eS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51NH0PnzTJS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nMz0LhVxS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 lt-j-VDS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Go9TT5dsS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pXH5wRB2S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31JUomy8pIS.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Xukinroy Store",
            "link": "https://www.amazon.com/stores/Xukinroy/page/B71632A6-7EB9-45A2-812F-B44F814EB1A7?ref_=ast_bln"
        },
        "brand": "Xukinroy",
        "merchantInfo": "Xukinroy",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 6361,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 11 hrs 3 mins",
            "FREE pickup Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest Same-Day pickup Today 2 PM - 6 PM. Order within 11 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Excellent Compatibility: The Bluetooth keyboard compatible with iOS, Android and Windows system. It is perfect for Apple iPhone, iPad, iPad Mini, iPad Pro, iPad Air, Android Samsung LG Windows tablet smartphone.",
            "Light portable and compact: This keyboard is much lighter, smaller than traditional keyboard. You can easily carry it without taking up more space on your desk or bag. 10 inch keyboard dimensions: 25 x 15 x 0.6 cm, weight: 180g. 【Size: 9.84 x 5.9 x 0.24 inch, weight: 6.35ounce/0.4pounds】",
            "Long-term use: Built-in rechargeable lithium battery, after fully charged, it can be used for more than 20 days (When used continuously for 2 hours a day). If you don't use it for more than 10 minutes, the keyboard will automatically enter the sleep state to save power. If you want to continue to use it, just click any key to wake up the keyboard.",
            "Comfortable Bluetooth Keyboard: The keys of the keyboard are scissor structure, square chocolate keycap ergonomic design. Use this keyboard, you can type quietly on your tablet, iPad, iPhone, smartphone and provide you with a comfortable and pleasant typing experience.",
            "Bluetooth Connection: The keyboard adopts stable Bluetooth 3.0 technology, the working distance is up to 10m. The keyboard is US QWERTY layout, easy to use, has hot keys, such as volume control, play and pause, previous and next etc. The front is brushed, the back is ultra-thin and smooth aluminum alloy design."
        ],
        "description": "Keyboard connection method: 1: Turn on the ON/OFF switch. 2: Press CONNECT, the indicator of the Bluetooth logo will flash. 3: Turn on the Bluetooth switch of the device such as tablet/smartphone, search for Bluetooth device, the default Bluetooth name of the keyboard: Bluetooth 3.0 Keyboard. 4: Click the Bluetooth 3.0 Keyboard on the tablet/smartphone, press the Enter to connect. Note: The keyboard cannot be connected to two devices at the same time. Therefore, if you want to replace another device, you must first disconnect the pairing connection of the original device. Product Specifications: Keyboard Layout: US QWERTY Bluetooth Version: Bluetooth 3.0 Buttons: 78 keys Working Range: Up to 10 meters Material: ABS +Aluminum alloy Charging Interface: Micro USB Hot Keys: Fn + function key, press Fn and the blue keys Wide Compatibility: Compatible with Apple iPhone iPad Android Windows tablet phone smartphone.【Note: It may not be possible to connect to the device via the Bluetooth adapter.】 Compatible with iPhone such as iPhone 12 Pro Max mini, iPhone SE 2020, iPhone 11 Pro Max, iPhone X XR XS Max etc. Compatible with iPad such as iPad Pro 9.7/10.5, iPad Pro 12.9 inch 2nd 3rd 4th 5th gen, iPad Pro 11 inch 1st 2nd 3rd generation, iPad Air 3rd gen 10.5, 4th gen 10.9, iPad mini 2/ 3/ 4/ 5 2019, iPad 4th 5th 6th gen 9.7, 7th 8th generation 10.2 2020 etc. Compatible with Android tablet smartphone such as Samsung Galaxy Tab a a7 s6 lite s7 plus s7+ Note S etc. Package including: 1 * Bluetooth Keyboard 1 * USB Cable If you have any questions, please contact us, we hope to provide you with good products and good services until you are satisfied. We provide one year warranty service, so you do not have any risk. If you are not satisfied with our products, we can replace you with a brand new product or a full refund to you.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "9.85 x 5.9 x 0.24 inches"
            },
            {
                "name": "Item Weight",
                "value": "6.3 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Xukinroy"
            },
            {
                "name": "ASIN",
                "value": "B088ZQNNX5"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "zdl0819279"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 6,361 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#24 in Computer Keyboards"
            },
            {
                "name": "Date First Available",
                "value": "May 21, 2020"
            },
            {
                "name": "Brand",
                "value": "Xukinroy"
            },
            {
                "name": "Compatible Devices",
                "value": "iPhone, Phone, iPad, Tablet, Smartphone"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Keyboard Description",
                "value": "QWERTY"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Desk"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Rechargeable"
            },
            {
                "name": "Color",
                "value": "10 inch Black"
            },
            {
                "name": "Number of Keys",
                "value": "78"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "Single Color"
            },
            {
                "name": "Style",
                "value": "Contemporary"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Katie B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCX44ERULK2Y5DVTE2ABBE6AY7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK94YNR28Z7Q2?ASIN=B088ZQNNX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Product at a Great Price",
                "reviewText": "I recently purchased the Ultra Slim Bluetooth Keyboard, and I must say it has exceeded my expectations. This keyboard has turned my son’s ipad into a laptop and enabled me to actually get some work done while he is doing his homework.Key Features:*Quiet - the keys don’t clack loudly, which is great for using in public places*Slim profile - perfect for tablets*Great connectivity - don’t have to worry about wires and stays connected via bluetoothQuality:The build quality is nothing extraordinary, but it feels solid for how little I paid for it. It is pretty thin, which is a positive and something I wanted, but also means it does have a flimsy feel. However, I’m not worried that my teenage son will be carrying it around and using it for school. I think it will hold up just fine.Performance:I am thoroughly impressed with its performance. So far it has not lost connectivity and I haven’t had to charge it yet, which means it has held it’s charge for over a week of use.Design:My son loves the sleek design. It’s so thin, thinner than I realized through the item description. The colorful keys is a nice touch and adds a bit of personality. It’s also just wide enough for an ipad, but the keys still feel comfortable—there’s enough space between the keys to make typing feel natural.Ease of Use:One of the standout features is how user-friendly it is. Even for someone like my son who is not tech-savvy, this Ultra Slim Bluetooth Keyboard was easy to set up and use right out of the box.Value for Money:Considering the quality, performance, and design, this bluetooth keyboard offers exceptional value for money. It was so cheap I was afraid it would not last long, but after using it for awhile, I feel confident it will serve us well.Conclusion:In conclusion, I highly recommend the Ultra Slim Bluetooth Keyboard to anyone looking for a reliable, high-quality, small bluetooth keyboard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randy Browning",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKUW63O2WVYHXMVZ4M3WUCJ77FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RM925YRQQQLZ8?ASIN=B088ZQNNX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Not a perfect typing experience since it is so compact, but it simply works.",
                "reviewText": "First I want to add that the typing experience is not expected to be perfect, and attempting to compare it to a standard keyboard is a horrible approach.I connected it to my iPad Mini 6 and it was instantly picked up, and there is no lag in the time between typing a character and it showing on screen. When my on screen keyboard showed up I expected a conflict, but the first letter I typed the on screen went away. I have two hands filled with thumbs, so I was not expecting it to be a casual typing experience, and I was not wrong. If you type home-row you will struggle, but if you hunt and peck, you won't notice a difference in your experience.The solid metal back was a pleasant surprise, and that gives the very thin keyboard nice rigidity. The keys are smaller than Chiclets, but clearly labeled, and look to be durable.For $11, if you're trying to build a small travel platform, this is both budget friendly, compact and usable. So far a high recommend.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Loeb",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY2GGTIIFUHEDMOU3Z6VZBXINCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XX3A6IM8DZH3?ASIN=B088ZQNNX5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Great Keyboard, but you may not like the function/control keys",
                "reviewText": "This is a great little keyboard with easy connectivity and great battery life. My complaints:1) I did have to add sticky feet to keep it from sliding around. Not a big deal.2) The USB port is micro-USB, not USB-C. Not a big deal but unfortunate.3) My main complaint is that the bottom left CTRL and FN keys are swapped relative to what I could consider typical. In fact, their order is the same as the layout that Lenovo uses and Lonovo has an option in their BIOS to switch them. I would love it if there were some sort of switch to swap them on this keyboard. Since I use the CTRL key a LOT and can't unlearn that muscle memory, I can't use this keyboard and had to choose a comparable one on Amazon which, by the way, has rubber feet and USB C, but the keys require too much pressure, making mistyping an issue for me.Summary, if you don't care about the CTRL/FN key layout, this is a GREAT keyboard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSOJLL6E2XENS2OGKLWNCRDMQIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFXJMCV6D9X57?ASIN=B088ZQNNX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars LOVE!",
                "reviewText": "I needed something I could take to cafes to work on, and my 11+ year old laptop wasn’t going to cut it. I then looked at small portable laptops, tablets, etc. but the price tags weren’t worth it. Finally, I looked up Bluetooth keyboards so I could work on my phone and found this. This keyboard is a game changer! It works wonderfully and I haven’t had any issues with connectivity. I debated between the 7 and 10 inch keyboard and ultimately decided on the 10 which, for me, I think was the right call. It’s slim and fits in my purse just fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynnea Harris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBIVWID4N6AJHAJNNNKRJXQZ3VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SG5XJPTXTLH4?ASIN=B088ZQNNX5",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "3.0 out of 5 stars Keys are sticky",
                "reviewText": "It’s cute and works ok and easy to Bluetooth with any device. Keys are just sticky and you gotta back space a few times to correct any mistakes but it lasts a long time as long as you charge equally long. If you don’t mind sticky keys then I’d recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CEG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZ5VNPAYGFSX74SXZLHVEKMJ75Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ULQLIQY5LY8S?ASIN=B088ZQNNX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2021",
                "reviewTitle": "5.0 out of 5 stars Good for travel.",
                "reviewText": "I was looking for a small keyboard to use with my tablet when I travel. Of them all, this was the right size and price.Battery Life: I do not use this keyboard for long periods of time, but have found that it holds it charge. I used it several times when I was camping for 4-5 days and did not have to recharge it while I was gone. I charge it overnight when I may need it and it holds the charge.Connectivity: I have only used the keyboard with my tablet, but it was easy to set up using the bluetooth connection.Size: This is a SMALL keyboard. Be aware it is the size as described. It is just what I need and travels well. It does take a little typing to get used to how small it is, but after a few minutes, you get used to it.Use Experience: When using, make sure you have the keyboard on a solid, flat surface. The keyboard is thin and it feels more sturdy to do this. The keyboard is sensitive, so if the surface you use is not sturdy, the keyboard may bounce a bit - causing extra keystrokes. When traveling, I put the keyboard in a protective sleeve and pack it between items slightly larger so there is no risk of it breaking. Again - I knew the size and thinness of the keyboard before ordering so this is not a problem for me.I don't use this keyboard for everyday use, just for short spurts at home or when traveling. I recommend this for anyone looking for a keyboard for travel, but is not doing a huge amount of typing. It is perfect for my needs and am very happy with this purchase.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carmen garcia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 24, 2023",
                "reviewTitle": "Compacto y práctico",
                "reviewText": "Mi hija lo utiliza para complementar su tablet cumple bien su funcion, sincroniza bien y la conexión es buena",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonyel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 4, 2022",
                "reviewTitle": "Veio danificado, impossível de usar assim!!!",
                "reviewText": "The media could not be loaded. O local de acoplamento pra carregar veio danificado, impossível o uso, pois está torto. Se forçar irá quebrar.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/I/E1t7nL6l9pL.mp4"
                }
            },
            {
                "reviewerName": "Suzanne Lee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 13, 2023",
                "reviewTitle": "Great, economical product!",
                "reviewText": "I purchased this keyboard with overnight delivery to use with my laptop while I waited for a replacement laptop keyboard to arrive. It works well, although I haven't worked out how to connect to multiple devices and switch between them. Also the keyboard does not seem to have backlighting - which is not a big issue! The instructions included in the pack could be more helpful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "antonio robles",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 11, 2023",
                "reviewTitle": "Buen precio vs calidad, fácil instalación",
                "reviewText": "Buen precio vs calidad, fácil instalación",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nenis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 22, 2022",
                "reviewTitle": "Buen tamaño",
                "reviewText": "Es muy práctico, pero creo que no es tan compatible como dice",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}