{
    "remaining_requests": 41694,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wireless-Keyboard-Cordless-Windows-Computer/dp/B0B1BQNCPR",
    "body": {
        "name": "Wireless Keyboard and Mouse Combo, 2.4G Silent Cordless Keyboard Mouse Combo for Windows Chrome Laptop Computer PC Desktop, 106 Keys Full Size with Number Pad, 1600 DPI Optical Mouse (Black)",
        "price": "$19.99",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wireless-Keyboard-Cordless-Windows-Computer/dp/B0B1BQNCPR",
        "soldBy": {
            "sellerID": "AHAC86748ESAG",
            "name": "Humfine",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AHAC86748ESAG&asin=B0B1BQNCPR&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B1BRWYVP"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B1BQNCPR",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$19.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41A3U9YtUrL._SS36_.jpg"
            },
            {
                "asin": "B0C4XXQ8X4",
                "variationName": "Color",
                "variationValue": "Pink",
                "price": "$22.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SiTiQaV7L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41A3U9YtUrL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51WBNgRblcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412opI9VOSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515 3wR4p0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Y8OobJGZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416bd9Ux8hL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZYz zRrDL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Harburfine",
            "link": "https://www.amazon.com/Harburfine/b/ref=bl_dp_s_web_119058968011?ie=UTF8&node=119058968011&field-lbr_brands_browse-bin=Harburfine"
        },
        "brand": "Harburfine",
        "merchantInfo": "Humfine",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1474,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 23 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Full Sized Keyboard and Mouse Combo: The US QWERTY keyboard features a tilt angle for the great typing position, which provides you with a comfortable and accurate typing experience, prevents wrist fatigue. The ergonomic mouse with a contoured shape that fits perfectly in the palm of your hand and will provide hours of work comfortably. 1600 DPI resolution enables smooth, fast and precise control on most surfaces. Quiet clicks allow you to focus on your work or play without disturbing others",
            "Stable 2.4G Wireless Connection: Both wireless mouse and keyboard combo share the same tiny nano receiver, no need to occupy additional USB ports, plug and play without any drivers. Advanced 2.4GHz wireless technology provides a powerful and reliable connection up to 33 ft with virtually no delays or dropouts, even in the busiest wireless environments. Note: The USB dongle is stored in the compartment next to the mouse battery slot, and can be found by opening the mouse battery cover",
            "Auto Sleep & Power Saving: The mouse and keyboard feature automatic sleep function, when you stop using them for more than 15 minutes, they will go into sleep mode to save power and you can click any button to activate them, the battery life up to 6 months. The external keyboard is powered by 1 AAA battery, and the wireless mouse is powered by 1 AA battery (Batteries Not Included)",
            "Wide Compatibility: Easy to use, simply plug the USB receiver into the USB port and start working. This wireless keyboard and mice combo compatible with Windows 11, 10, 8, 7, Vista, XP, Chrome OS, Linux and Mac OS. Works well with desktop, computer, PC, laptop, Chromebook, notebook and more. Perfect for office & home work, business travel. Enjoy your wireless freedom and keep your desk clean and tidy",
            "Multimedia Shortcuts: The full-sized cordless keyboard with numeric keypad features 12 multimedia hotkeys for instant access to your media player, E-mail, Internet, volume, play/pause, mute, computer and favorites, so you can easily check out your favorite sites. Ideal for office work and entertainment, it saves you time and makes work and life easier. Note: the 12 shortcuts are not fully compatible with the Mac system"
        ],
        "description": "The USB dongle is stored in the battery compartment of the mouse and can be found by opening the mouse battery cover. How to use the Keyboard and Mouse Set: Take out the USB receiver, insert it into the USB port of the PC or laptop, then plug 1 AAA battery into the keyboard, 1 AA battery into the mouse, wait a few seconds, you can start using it. Note: 1. Batteries are not included. 2. The unifying Nano receiver is stored in the battery compartment of the mouse and can be found by opening the mouse battery cover. Product Specifications: Keyboard Size: 42.9 * 12.6 * 2.3cm Keyboard Weight: 423g Mouse Size: 10 * 6.1 * 3.8cm Mouse Weight: 58g Operating Distance: 10m Package: 1 * Wireless Keyboard 1 * Wireless Mouse 1 * USB Receiver (stored in mouse) 1 * User Manual Service Support: We provide you with 12 months warranty and 24-hour email contact service. If you have any questions or needs, please feel free to contact us. We aim to provide you with the most satisfactory customer service.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboard & Mouse Combos",
                "link": "https://www.amazon.com/Computer-Keyboard-Mouse-Combos/b/ref=dp_bc_aui_C_5?ie=UTF8&node=1194464"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "17.24 x 5.29 x 2.44 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.52 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0B1BQNCPR"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,474 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18 in Computer Keyboard & Mouse Combos"
            },
            {
                "name": "Date First Available",
                "value": "May 16, 2022"
            },
            {
                "name": "Manufacturer",
                "value": "Harburfine"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "Harburfine"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB, Wireless"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic"
            },
            {
                "name": "Compatible Devices",
                "value": "Desktop, Computer, PC, Laptop, Chromebook, Notebook"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Celi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6LNQVFEXUACJGTIUGNRRHOOVXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35UWPLYWCTNUP?ASIN=B0B1BQNCPR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Simple and usable",
                "reviewText": "I bought this a while back ago and wanted to make sure I gave it a few months before i reviewed it, so far no complaints. Its cute and affordable!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQWQRORSQ55OFSTICLW53XZOI5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQSVH05YL8KDD?ASIN=B0B1BQNCPR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Keyboard and mouse work great after a bit bumpy setup.",
                "reviewText": "This keyboard and mouse work very well and was easy to set up. However, at first the keyboard missed keystrokes like crazy - it must have been a conflict with my previous setup as a cold reboot of the computer completely fixed that issue. I've had expensive wireless keyboards/mice that didn't work nearly as well as this one does now - at a bargain price. I highly recommend this wireless keyboard and mouse combo.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Okie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6WP3U2F3HVA6LB7WYU2BBMJN2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YXLRYMUT8JEU?ASIN=B0B1BQNCPR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Good Replacement",
                "reviewText": "My old keyboard was messed up so I spent big coin on this. I don't like the feel of the keyboard but I'll get used to it. Mouse is a little wonky in MS Word but works great in all applications, For the money I like it and it seems like a good product. Worked right out of the box.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGON3HDRKRZGJ4C6J54OGAHVHS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VEB4Z47DGTDA?ASIN=B0B1BQNCPR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars A Silent Symphony of Efficiency: Wireless Keyboard and Mouse Combo",
                "reviewText": "As someone who spends significant hours in front of a computer, the Wireless Keyboard and Mouse Combo has become a silent yet powerful addition to my workspace. This dynamic duo seamlessly blends efficiency, silence, and ergonomic design, making it a standout choice for anyone seeking a reliable and quiet computing experience.Pros:Silent Typing Bliss:The promise of silent typing is not just a feature; it's a game-changer. The keys on the wireless keyboard deliver a whisper-quiet performance, creating a serene work environment without compromising on typing efficiency. No more distracting clicks during late-night projects or virtual meetings!Effortless Connectivity:Setting up this combo is a breeze. The 2.4G wireless technology ensures a stable and responsive connection, freeing you from the constraints of cords. The plug-and-play design allows for instant connectivity, sparing you the hassle of complex installations.Compact and Ergonomic Design:Both the keyboard and mouse boast a compact and ergonomic design that enhances comfort during prolonged use. The keyboard's low-profile keys reduce typing fatigue, while the mouse fits snugly in hand, promoting a natural and relaxed grip.Long Battery Life:The energy-efficient design of both the keyboard and mouse extends their battery life, minimizing the frequency of replacements. This eco-friendly feature is not only practical but also a testament to the thoughtful engineering behind this combo.Compatible with Windows:This combo seamlessly integrates with Windows operating systems, ensuring a hassle-free experience for users of Windows-based computers. The compatibility adds a layer of convenience for those seeking a reliable and efficient input solution.Cons:Non-Backlit Keyboard:The keyboard lacks backlighting, which may be a consideration for those who often work in low-light environments. However, this is a minor trade-off given the overall performance and affordability of the combo.Basic Mouse Design:While the mouse is functional and comfortable, it follows a more traditional design. Users looking for advanced features such as additional buttons or customizable options might find the mouse to be on the simpler side.In conclusion, the Wireless Keyboard and Mouse Combo delivers a harmonious blend of functionality and tranquility to my workspace. The silent typing experience, coupled with efficient connectivity and ergonomic design, has elevated my computing experience. If you value a quiet and efficient work environment, this combo is a worthy investment. Highly recommended for those seeking a reliable, silent, and user-friendly keyboard and mouse solution for their Windows-based setups.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazonian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJWDMYSDEULYS5TOGYU2VXQPNHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REYIG2JZ609JY?ASIN=B0B1BQNCPR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Value!",
                "reviewText": "No this set doesn’t sound great, or feel the best, or have the best ergonomics. It does, however, offer an incredible value. I have since upgraded, but the keyboard and mouse both still work great. Thanks to the built-in dongle storage on the keyboard, I can have it tucked away as a back up with no worries!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECLDT4KKAU6KSFCI5TXGOSYTUPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HHBPTJMKOBLG?ASIN=B0B1BQNCPR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Great quality keyboard and mouse",
                "reviewText": "I use this for a home theater system that also has internet browsing capability on the screen. I haven't had any issues with latency even though it's 15 ft away. It's smaller than a normal keyboard but has the same finger spacing I'm used to for rapid typing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJH3BJQCXE5PTSJVQFNCND2ZQJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ARTHWTDYJP2K?ASIN=B0B1BQNCPR",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 28, 2023",
                "reviewTitle": "1.0 out of 5 stars Wanted to like it, but as it is, it is going back",
                "reviewText": "I've been using wireless keyboards and mice for about 15 years now. The only one that still works after all this time is Logitec. A couple of years ago I bought one mouse/keyboard combo from \"Jelly\" and while the mouse was great, the keyboard was far from good. Very quickly it developed poor contact and had to be tapped in a certain spot to work again.Then I ordered this combo, hoping it would work for my basic needs. I mean, how hard can it be to send a 2.4Ghz signal over a few feet distance? Apparently, it's very hard.Both the keyboard and mouse use only one battery. The mouse uses 1 AA battery while the keyboard uses 1 AAA battery. I thought that perhaps things were getting more efficient in the wireless world, but I was wrong. They are only getting cheaper and more useless. As I type this, I have to constantly go back to correct \"errors\" caused by skipped characters. Add to that the fact that the keyboard is not user friendly, with some keys requiring more pressure than others, and the whole experience is a torture. As I typed this previous sentence, entire words got doubled so I'd get \"entirretier\"... and so on.All in all by far the worst experience of any wirerels keyboard soaalavit he errr for you to see how terrible iti(the above is meant to say \"leaving the errors for you to see how terrible it is\" and the previous line is supposed to say \"of any wireless keyboard so far\")p.s. I am about 7 feet away from the computer and little USB receiver, with no other remote devices aroundp.p.s. Old logitec keyboard has no problems at all. It is almost 15 years old and still working. Havy, loud with all letters erased but unlike this garbage, it works.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQFBIE3P46YZJGO43TV7Q7SXBTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z5Q2HJMA6E6W?ASIN=B0B1BQNCPR",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "3.0 out of 5 stars And yet what you pay for, if you buy a cheap keyboard expect a cheap keyboard",
                "reviewText": "In my opinion, it's not worth getting out of paying the extra couple of dollars for a decent Logitech. Flat keys are difficult to use and I just discovered that the key is switched with the apostrophes key somehow I don't know how that happened. Honestly it's just so annoying the little things about it that are a nuisance. It is too late unfortunately for me to return it or I certainly would. Right now I think there's a good chance I will just break down and buy another Logitech good one with Ray's keys that are easy to use",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jaime",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 29, 2023",
                "reviewTitle": "Great purchase",
                "reviewText": "Mouse is quiet and they work great!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 30, 2023",
                "reviewTitle": "GOOD VALUE",
                "reviewText": "IT HAS BEEN WORKING WELL AND GOOD VALUE FOR THE MONEY.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'AmazonJean Claude Veilleux",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 8, 2024",
                "reviewTitle": "facile a installer",
                "reviewText": "Tres bon rapport qualité prixPas de touche inutile",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S-5 Powersports",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "keyboard works awesome",
                "reviewText": "Keyboard fits great at my work space. Mouse is not to big and fits well in hand. Very responsive",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Real",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 3, 2024",
                "reviewTitle": "Good",
                "reviewText": "Hé suis satisfait",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}