{
    "remaining_requests": 41710,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-Advanced-Wireless-USB-Receiver-Multimedia/dp/B0CBPNWCVS",
    "body": {
        "name": "Logitech MK540 Advanced Wireless Keyboard and Mouse Combo for Windows, 2.4 GHz Unifying USB-Receiver, Multimedia Hotkeys, 3-Year Battery Life, for PC, Laptop",
        "price": "$49.47",
        "originalPrice": "",
        "rawPrice": 49.47,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-Advanced-Wireless-USB-Receiver-Multimedia/dp/B0CBPNWCVS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41VFQKUwvTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DBNOt7eIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VosmgIbTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514TqfYGp2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ai sWx9cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MzsblArqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kNmZ AoEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 28,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 23 hrs 40 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Precision Typing: An instantly familiar experience, type with ease and comfort on this full-size wireless keyboard, featuring reduced noise, palm rest, spill-resistant design (1), adjustable tilt legs",
            "Built For Comfort: The sleek combo's wireless mouse features an ambidextrous shape and soft rubber side grips that fit comfortably in your palm, as well as enhanced tracking and precise cursor control",
            "Long-Lasting Autonomy: The wireless keyboard and mouse set come with long-lasting battery life, with the keyboard lasting up to 36 months and the wireless mouse for up to 18 months (3)",
            "Customized Control: Enhanced productivity at your fingertips, the computer keyboard comes built with convenient, essential hotkeys providing direct access to media, calculator, battery check functions",
            "Wireless Freedom: Plug-and-play your keyboard and mouse with the mini Logitech Unifying USB receiver, for a reliable wireless connection up to 33 ft away from your PC or laptop (2)",
            "Compatibility: This Logitech mouse keyboard combo is compatible with Windows 10 or later, Windows 8, Windows 7, Chrome OS"
        ],
        "description": "MK540 Advanced is an instantly familiar wireless keyboard and mouse combo built for precision, comfort and reliability. The full-size keyboard features a familiar key shape, size, and feeling – optimized for precision and noise reduction. The palmrest and adjustable tilt legs keep you comfortable for long stretches and the contoured mouse is designed to fit perfectly into either palm. Plug and play your keyboard and mouse with one tiny USB receiver with Logitech Unifying™ technology. You’ll get a reliable – and encrypted – wireless connection up to 10 meters away with virtually no delays or dropouts. Your keyboard won’t require new batteries for 36 months and your mouse stays powered for 18 months.*",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboard & Mouse Combos",
                "link": "https://www.amazon.com/Computer-Keyboard-Mouse-Combos/b?ie=UTF8&node=1194464"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Series",
                "value": "‎ADVANCED MK540"
            },
            {
                "name": "Item model number",
                "value": "‎920-012585"
            },
            {
                "name": "Operating System",
                "value": "‎Chrome OS Candelabra, Chrome OS, Windows 8"
            },
            {
                "name": "Item Weight",
                "value": "‎2.2 pounds"
            },
            {
                "name": "Package Dimensions",
                "value": "‎20.4 x 7.6 x 1.6 inches"
            },
            {
                "name": "Power Source",
                "value": "‎Battery Powered"
            },
            {
                "name": "Manufacturer",
                "value": "‎Logitech"
            },
            {
                "name": "ASIN",
                "value": "‎B0CBPNWCVS"
            },
            {
                "name": "Country of Origin",
                "value": "‎Vietnam"
            },
            {
                "name": "Date First Available",
                "value": "‎January 1, 2024"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 28 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25 in Computer Keyboard & Mouse Combos"
            },
            {
                "name": "Connectivity Technology",
                "value": "Usb"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic"
            },
            {
                "name": "Compatible Devices",
                "value": "Personal Computer"
            },
            {
                "name": "Keyboard Description",
                "value": "Membrane"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "FAMILIAR TYPING EXPERIENCE The keys have been optimized for improved accuracy and reduced noise – and your fingers will immediately feel at home on the familiar key surface and layout.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/397dd3e6-8903-4732-ae99-15894d531491.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "CONTOURED COMFORT MOUSE The wireless mouse’s contoured shape and soft rubber side grips are designed to fit comfortably in either your right or left palm –and enhanced tracking and precise cursor control keep you in command.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1760809-5ba5-4841-bb5e-75053710e229.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "PRODUCTIVITY AT YOUR FINGERTIPS Convenient and essential hot keys give you direct access to media, calculator and battery check functions. Preset Fn keys can even be personalized in Logitech Options app to meet your specific needs. PLUG AND PLAY WIRELESS COMBO Connect your keyboard and mouse with one tiny Logitech Unifying USB receiver. You’ll get a reliable – and encrypted – wireless connection up to 33 ft away with virtually no delays or dropouts.",
                "media_link": []
            },
            {
                "media_text": "LOGITECH WIRELESS COMBO MK540 An instantly familiar wireless keyboard and mouse combo built for precision, comfort and reliability.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed50fabb-1f56-4a07-86eb-baa9e10a057d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "ESSENTIAL TOOLS. BETTER WORK. Complete your setup with the right keyboard, mouse, headset, and webcam for better typing and navigation, plus superior audio and video—so you can conquer just about any task from home. LOGITECH C310 HD WEBCAM Sharp, smooth video calling with a camera you can attach to your screen or shelf. LEARN MORE LOGITECH WIRELESS H390 HEADSET Experience clear internet calls with simple plug-and-play USB-A connection and a noise-cancelling mic. LEARN MORE",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/397dd3e6-8903-4732-ae99-15894d531491.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1760809-5ba5-4841-bb5e-75053710e229.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5325bc9c-1df7-474f-ae3b-253d3be5e525.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bb4d2225-e929-45eb-afcd-e88939bc3256.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ed50fabb-1f56-4a07-86eb-baa9e10a057d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/18dc49d7-5055-4e9c-90f5-9204ddf9ad82.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/933618e4-2db1-40a0-9bb3-0913672bf95a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d1a51e4c-9086-4df6-b847-333a7d6b5084.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Harry Wensel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNXB6LGMRR32LOUZDNRLJK4U4CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV7LEZ4A141VY?ASIN=B0CBPNWCVS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Still a great model",
                "reviewText": "This keyboard replaces my MK510 that suddenly had failed return and eight keys after five years of hard use. I like the touch of the new keyboard. It is not a click but it does have a sound when you depress the keys. I would call the keys a longer throw vs a flat keyboard if you like that. The mouse is a model M310. The wheel and grip points are rubberized and gives you good control. There is one dongle that services the wireless connection for both devices. Note though that if you have a mouse that you prefer, like in my case an M510 mouse with some extra functionality you can still use your preferred mouse with its own dongle. Also if you wanted you can run one or the other mouse at the same time. I know trivial but I thought you mind find a use for that. One last detail. I saw evidence that the price on this set will soon be dropping to $39.99. I paid $49.99. Perhaps a newer model will be coming out. But I use my desktop every day and a lot. So I am not waiting for a price drop. I recommend this Keyboard and mouse combination.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S200",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXXL3DOQZEK6H3Y3B4SEMH3SJ7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AV93WROK3MKI?ASIN=B0CBPNWCVS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars So far so good",
                "reviewText": "Nice feel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Larry In Billerica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSY6DVNNBMMSDDKKEJOD7GGIPLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TX0GCPT1R3GR?ASIN=B0CBPNWCVS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars I’m picky about keyboards and I like this one",
                "reviewText": "I really like real keys instead of the chicklet keys which have become so common. Love that it's a full keyboard, with F keys, number pad, and all the directional keys where they belong. Worked plug and play out of the box.The mouse is so-so. It's smaller than many others. Wish Logitech bundled the larger M720 mouse with this kit (perfect mouse, in my mind). Fortunately, my old M720 works fine with its old USB receiver at the same time the new keyboard works with its new one that came in this kit. Best of both worlds!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "syntapsyntap",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYIWOGMZEYUJIRE5L6TOPY2BWEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HSZT7IMFSHS1?ASIN=B0CBPNWCVS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars High quality keyboard and mouse set",
                "reviewText": "(edit at end of review on how to remedy a web browser scrolling behavior issue)I have purchased many Logitech products over the years, including mice and keyboards. This keyboard is the same good quality you can expect from Logitech.The keyboard is comfortable to type on, with a soft key click (hardly a click at all) and nice spring action to the keys. I like the function key shortcuts built into this keyboard such as Save, Print, Control Panel and others, I don't think I've had those on a keyboard before. Dedicated buttons for Calculator and screen lock are nice too. The wrist rest adds a bit of depth to the overall unit but not annoyingly-so. The keyboard has three height/angle options... two with different stand pieces, and another with both stand pieces folded in. Logitech says the battery will last 36 months, that's great if it makes it that long.The optional software download will let you change some key assignments.The mouse is simple and comfortable. It features the typical left/right buttons, scroll wheel, and scroll wheel click. It is no-frills but not cheap-feeling either.The only two cons I have found, that I'd maybe take half a star off if I could, were...- In order to default to the \"F-keys\" for F1 through F12, you need to do that in the settings of the optional software download. On other keyboards (Logitech-branded and others) this is usually done with Function-ESC- The dedicated \"home\" button on the keyboard launches a browser, but you can't customize what browser loads. I run different portable Chrome installations for work and personal, and I could not find a way to have the Home button default to the one I wanted. This doesn't bother me because I don't think I'd regularly use a shortcut key to launch a browser anyway, so I reassigned that key with the software to show the desktopOverall a very nice keyboard and mouse set that is comfortable and should last a long time.edit: I wanted to pass on a setting that addressed an issue that emerged... while scrolling web pages in Chrome with the scroll wheel, the scrolling would not stop on a dime when the mouse scrolling stopped, it would kind of slow down and stop. This made immediately clicking on a web page element difficult because the target would still be moving. Also it seemed that pages like Google Maps didn't know what to do with that, with a zoomed-in house zooming out to the entire region with one wheel scroll move sometimes. To turn off this behavior, launch the Logitec Options+ app (if you installed it), click on the mouse, click on \"Point and Scroll\", click on the scroll wheel, and turn off the \"Smooth Scrolling\" option. This change returned scroll behavior to what I had expected, stops on a dime now.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/5103mUS9msL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ted the IT Guy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOKHEMNNVQQ7LH6MZOFPWVOBEXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R309R7HWTM3YBG?ASIN=B0CBPNWCVS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Very nice addon keyboard for a laptop, batteries included!",
                "reviewText": "Having been a computer guy for over 40 years, I have laid hands on literally thousands of keyboards, but I always find myself migrating back to major brands like Logitech. They consistently make decent quality consumer products across the spectrum. They may not be able to touch the more niche markets, but the quality of their products is better than the vast majority of junk being pushed into the American market. As such, I am proud to claim I have several Logitech keyboards and mice, including RF, Bluetooth, Wired and Gaming products. I'm actually typing this review on the great Logitech G910 Orion Spectrum RGB Wired Mechanical Gaming Keyboard right now.This particular keyboard + mouse combo is clearly intended for use with a laptop. It is a 2.4 MHz RF wireless unit (i.e. NOT Bluetooth) with a shared dongle for both keyboard and mouse. Either or both devices can be used independently or at the same time with no issues. I didn't see any noticeable lag when using either the keyboard or mouse during my testing, but that is not usually a big concern for a non-gaming purposes.The keyboard is a Logitech K540, which uses a standard Extended-AT keyboard layout with extra media and application keys. I really like the fact that the application keys seem to work perfectly even without a driver. I tested this on a fully locked down (HP EliteBook) laptop with no administrator rights and had no issues whatsoever. The various FN-shifted application keys did everything they were supposed to do right out of the gate. The keyboard is not heavy and the the low key profile is typical of laptop-style keyboard. The keys move smoothly through the very short throw distance. The keyboard is quiet, but there is enough feedback from each key to let you know you have actually fully depressed each key as you type.The mouse is a Logitech M310, a standard mid-sized ambidextrous \"3-button\" design (two-buttons with a clickable wheel) with a pretty good hand feel with either hand. Like the keyboard, it's very light. Tracking seems pretty good and, because I actually own two other M310 mice, I know it has decent quality microswitches that will easily last a few years under daily use.As with most Logitech wireless products, batteries are included. They are really generic batteries, but hey, they ARE included.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gbatem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXLRC3Y7YO42F65YGMN4NK4PAQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZUFZMD5X123A?ASIN=B0CBPNWCVS",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "1.0 out of 5 stars They Work Great, but?????",
                "reviewText": "Purchased this item as new and received an obvious opened box item with the mouse missing from the package. A used item sold and delivered to me AS New",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}