{
    "remaining_requests": 41797,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Apple-Keyboard-Numeric-Wireless-Rechargable/dp/B071ZZTNBM",
    "body": {
        "name": "Apple Magic Keyboard with Numeric Keypad: Wireless, Bluetooth, Rechargeable. Works with Mac, iPad, or iPhone; US English - White",
        "price": "$107.84",
        "originalPrice": "$129.00",
        "rawPrice": 107.84,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Apple-Keyboard-Numeric-Wireless-Rechargable/dp/B071ZZTNBM",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BYDXXVW5"
        ],
        "asinVariationValues": [
            {
                "asin": "B072QF6XXZ",
                "variationName": "Style",
                "variationValue": "Danish",
                "price": "$61.72",
                "variationImageURL": ""
            },
            {
                "asin": "B071ZZVC3T",
                "variationName": "Style",
                "variationValue": "Japanese",
                "price": "$117.39",
                "variationImageURL": ""
            },
            {
                "asin": "B07HZ44XRB",
                "variationName": "Style",
                "variationValue": "Korean",
                "price": "$128.00",
                "variationImageURL": ""
            },
            {
                "asin": "B072QFVV3J",
                "variationName": "Style",
                "variationValue": "Spanish",
                "price": "$129.00",
                "variationImageURL": ""
            },
            {
                "asin": "B071ZZVCQX",
                "variationName": "Style",
                "variationValue": "Traditional Chinese, Cangjie & Zhuyin",
                "price": "$121.26",
                "variationImageURL": ""
            },
            {
                "asin": "B071ZZTNBM",
                "variationName": "Style",
                "variationValue": "US English",
                "price": "$107.84",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21Eqwbg0YJL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/110kbhiCrGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31nL-G63pnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21CWu ahcTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21-ZuaxmoCL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81imlkWjDAS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81imlkWjDAS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Apple Store",
            "link": "https://www.amazon.com/stores/Apple/page/77D9E1F7-0337-4282-9DB6-B6B8FB2DC98D?ref_=ast_bln"
        },
        "brand": "Apple",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 15774,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "FREE delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "WIRELESS, RECHARGEABLE CONVENIENCE — Magic Keyboard with Numeric Keypad connects wirelessly to your Mac, iPad, or iPhone via Bluetooth. And the rechargeable internal battery means no loose batteries to replace.",
            "WORKS WITH MAC, IPAD, OR IPHONE — It pairs quickly with your device so you can get to work right away.",
            "ENHANCED TYPING EXPERIENCE — Magic Keyboard delivers a remarkably comfortable and precise typing experience. Its extended layout features document navigation controls for quick scrolling and full-size arrow keys. The numeric keypad is ideal for spreadsheets and finance applications.",
            "GO WEEKS WITHOUT CHARGING — The incredibly long-lasting internal battery will power your keyboard for about a month or more between charges. (Battery life varies by use.) Comes with a Lightning to USB Cable that lets you pair and charge by connecting to a USB port on your Mac.",
            "SYSTEM REQUIREMENTS — Requires a Bluetooth-enabled Mac with macOS 10.12.4 or later, an iPad with iPadOS 13.4 or later, or an iPhone or iPod touch with iOS 10.3 or later."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Apple"
            },
            {
                "name": "Compatible Devices",
                "value": "iPhone 15, iPhone 15 Pro, iPhone 15 Pro Max, iPhone 15 Plus, iPhone 14, iPhone 14 Pro, iPhone 14 Pro Max, iPhone 14 Plus, iPhone 13 Pro, iPhone 13 Pro Max, iPhone 13 mini, iPhone 13, iPhone 12 Pro, iPhone 12 Pro Max, iPhone 12 mini, iPhone 12, iPhone 11 Pro, iPhone 11 Pro Max, iPhone 11, iPhone SE (2nd generation), iPhone XS, iPhone XS Max, iPhone XR, iPhone X, iPhone 8, iPhone 8 Plus, iPhone 7, iPhone 7 Plus, iPhone 6s, iPhone 6s Plus, iPhone 6, iPhone 6 Plus, iPad Pro 12.9-inch (1st, 2nd, 3rd, 4th, 5th and 6th generation), iPad Pro 11-inch (1st, 2nd, 3rd and 4th generation), iPad Pro 10.5-inch, iPad Pro 9.7-inch, iPad (5th, 6th, 7th, 8th, 9th and 10th generation), iPad Air (3rd, 4th and 5th generation), iPad Air 2, iPad mini (5th and 6th generation), iPad mini 4, iMac (24-inch, M1, 2021), iMac (Retina 4K, 21.5-inch, 2019), iMac (Retina 4K, 21.5-inch, 2017), iMac (Retina 4K, 21.5-inch, Late 2015), iMac (Retina 5K, 27-inch, 2019 - 2020), iMac (Retina 5K, 27-inch, 2017), iMac (Retina 5K, 27-inch, Late 2014 - 2015), iMac Pro (2017), Mac mini (M1, 2020), Mac mini (2018) Mac mini (Late 2014), Mac Pro (2019), Mac Pro (Late 2013), Mac mini (2023), Mac mini (M1, 2020), Mac mini (2018), Mac mini (2014), Mac Studio (2023, 2022), MacBook Air (15-inch, M2, 2023), MacBok Air (13-inch, M2, 2022) MacBook Air (13-inch, M1, 2020), MacBook Air (Retina, 13-inch, 2020), MacBook Air (Retina, 13-inch, 2018 - 2019), MacBook Air (13-inch, Early 2015 - 2017), MacBook Air (11-inch, Early 2015), MacBook Pro (14-inch 2023), MacBook Pro (14-inch, 2021), MacBook Pro (16-inch 2023), MacBook Pro (16-inch, 2021), MacBook Pro (13-inch, M1, 2022), MacBook Pro (13-inch, M1, 2020), MacBook Pro (13-inch, 2020), MacBook Pro (16-inch, 2019), MacBook Pro (13-inch, 2016 - 2019), MacBook Pro (15-inch, 2016 - 2019), MacBook Pro (Retina, 13-inch, Late 2012 - 2015), MacBook Pro (Retina, 15-inch, Mid 2012 - 2015), MacBook (Retina, 12-inch, Early 2015 – 2017) See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, USB-A"
            },
            {
                "name": "Keyboard Description",
                "value": "Standalone"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office, Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Hotkeys and Media Keys, Rechargeable"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Number of Keys",
                "value": "109"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "Single Color"
            },
            {
                "name": "Style",
                "value": "US English"
            },
            {
                "name": "Height",
                "value": "0.16–0.43 inch (0.41–1.09 cm)"
            },
            {
                "name": "Width",
                "value": "6.48 inches (41.87 cm)"
            },
            {
                "name": "Depth",
                "value": "4.52 inches (11.49 cm)"
            },
            {
                "name": "Weight",
                "value": "0.86 pound (0.39 kg)"
            },
            {
                "name": "System Requirements",
                "value": "Bluetooth-enabled Mac computer with macOS 10.12.4 or later, iOS devices with iOS 10.3 or later"
            },
            {
                "name": "What’s in the Box",
                "value": "Magic Keyboard with Numeric Keypad, Lightning to USB Cable"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Taylor Dake",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE6WHUKPZCNUVTEVDR7UGTLJV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2465IBXC3J1IV?ASIN=B071ZZTNBM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect keyboard!",
                "reviewText": "The design is sleek and minimalistic, matching the Apple aesthetic perfectly. It seamlessly connects to my devices- the Bluetooth pairing is quick and hassle-free.The key feedback is excellent. Typing on this keyboard feels incredibly natural, and the keys are well-spaced, preventing typos and ensuring a smooth typing flow. The low-profile keys also add to the overall comfort, making long typing sessions a breeze.Battery life is impressive. I've been using it for over a week now without having to charge it again yet, but I love that I can charge it easily with the included cable.This keyboard is a fantastic investment for anyone looking to enhance their typing experience with Apple devices. It's well-built, stylish, and performs flawlessly. I couldn't be happier with my purchase! Highly recommended!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Couse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEETKAAQQXZE4H6J4GJMDOU5XQKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNZ8EVNLQY9DQ?ASIN=B071ZZTNBM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 1, 2023",
                "reviewTitle": "5.0 out of 5 stars An Absolute Game Changer for Productivity: Apple Magic Keyboard with Numeric Keypad",
                "reviewText": "I recently had to replace my wired keyboard with the Apple Magic Keyboard with Numeric Keypad, and it has completely revolutionized my productivity. This wireless keyboard is an absolute game changer, and I couldn't be happier with my purchase. Here's why:1. Sleek and Stylish Design:The Apple Magic Keyboard with Numeric Keypad features Apple's signature sleek and minimalistic design. The slim profile and seamless aluminum construction complement my Mac perfectly, creating a cohesive and visually appealing setup. It's a pleasure to look at and use.2. Comfortable Typing Experience:The keyboard's low-profile scissor mechanism keys provide a remarkable typing experience. The keys are responsive, with just the right amount of tactile feedback. I find myself gliding across the keys effortlessly, resulting in faster and more accurate typing. The numeric keypad is a welcome addition, especially for data entry and spreadsheet work.3. Wireless Freedom:The wireless connectivity of this keyboard is a true convenience. The Bluetooth connection is seamless and reliable, allowing me to connect it to my Mac effortlessly. The absence of cables not only reduces clutter but also provides the freedom to position the keyboard at the most comfortable distance and angle for my workspace.4. Long Battery Life:Apple has always been known for its impressive battery performance, and the Magic Keyboard with Numeric Keypad lives up to the expectation. With its built-in rechargeable battery, I can go weeks, if not months, without needing to recharge. The keyboard's intelligent power management ensures that it conserves battery life effectively, giving me peace of mind during extended work sessions.5. Apple Ecosystem Integration:Being an Apple product, the Magic Keyboard seamlessly integrates with the broader Apple ecosystem. The keyboard features convenient macOS-specific function keys, allowing me to access various system controls and shortcuts effortlessly. It enhances the overall user experience and makes it a breeze to navigate through my Mac, adjust volume, control media playback, and more.In conclusion, the Apple Magic Keyboard with Numeric Keypad is a five-star product that delivers on all fronts. Its sleek design, comfortable typing experience, wireless convenience, exceptional battery life, and seamless integration with the Apple ecosystem make it a must-have for any Mac user. Whether you're a casual user or a professional, this keyboard will undoubtedly elevate your productivity and bring joy to your everyday computing tasks.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mustafa Ekinci",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYCNUDCMU5YMSRWDD2WRN26AJKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE0MZZR86L7IB?ASIN=B071ZZTNBM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Sleek Design Meets Functionality: A Must-Have Accessory for Apple Enthusiasts",
                "reviewText": "As a long-time Apple user, I've always been a fan of their sleek and minimalistic designs. When I recently decided to upgrade my desktop setup, the Apple Magic Keyboard with Numeric Keypad was a no-brainer for me.Right out of the box, the Magic Keyboard impresses with its stylish and slim design. The build quality is excellent, as expected from an Apple product, and it feels sturdy yet lightweight. The keys have a low profile, and the scissor-switch mechanism provides a satisfying and responsive typing experience. The added numeric keypad is a game-changer for those of us who frequently work with numbers, making data entry and calculations much more efficient.The Magic Keyboard connects effortlessly via Bluetooth to any Apple device, and the set-up process is a breeze. The built-in rechargeable battery is another great feature, as it eliminates the need for constantly replacing batteries. A single charge lasts me several weeks of regular use, and recharging is as simple as connecting the keyboard to my computer with the included Lightning cable.The only minor drawback I've encountered is that the keyboard may occasionally lose connection for a brief moment, but this has been a rare occurrence and is quickly resolved by turning the keyboard off and back on again.Overall, the Apple Magic Keyboard with Numeric Keypad is a fantastic addition to any Apple-centric workspace. Its sleek design, comfortable typing experience, and added functionality with the numeric keypad make it well worth the investment. I would highly recommend it to anyone looking for a high-quality keyboard to complement their Apple devices.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarkis Barbarian",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGGY3VBS2VWHID6W3ECJUNXMWLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R114UCHGAQD74L?ASIN=B071ZZTNBM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars An Apple product - so expect ease of installation and use",
                "reviewText": "This thing connected on it's own the moment I turned it on. I mean, it's a an Apple product, so it's easy to use, feels great, and does it's job well. I can't comment on battery life yet, but I expect months of use out of a single charge, honesty. Will report back if that's not the case.Also, the number pad is awesome and welcome feature.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Graham K. Glover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERLENABM77HGQ7YJZ2IAHUPGWWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WCET7WV7WLD8?ASIN=B071ZZTNBM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Luxurious Keyboard",
                "reviewText": "This Apple keyboard is luxurious. It feels good, it looks good, it's quiet, and it is reliable. It is not, however, waterproof. This purchase was to replace a keyboard I damaged with spilled liquid.I love having the numeric keypad as I use it frequently. Note this does not have Touch ID. Bluetooth connectivity to my iMac is never an issue. I have an older spare of this same keyboard I use for other things, mainly connecting to my tv (I hate having to use a remote control to enter passwords!) and my iPhone (I equally hate thumb texting!). I can always check the state of the charge of the keyboard through my iMac, though my iMac will tell me when I need to charge it. I think I charge it once every two or three months, taking probably two to three hours for a full charge.There are other keyboards available for the Mac, but this one works just fine as long as you keep liquids out of it! I would recommend this keyboard.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AppleFollow10",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETSFIUWL6HOEKD2A5YO33FNENGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YISGX3CBVDJR?ASIN=B071ZZTNBM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars One of the best Keyboard for Mac",
                "reviewText": "It is a great keyboard for Mac users. Very responsive and light in good quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nash shariff",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2024",
                "reviewTitle": "no issues - great product",
                "reviewText": "love it ! don't have to change batteries - the last one I hadn't used and the battery got corroded and the keyboard got fried",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vidal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 3, 2023",
                "reviewTitle": "Si es original",
                "reviewText": "Teclado llegó en buenas condiciones no requieres cables más que para cargarlo, la sincronización es simple y funciona bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RICCARDO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 18, 2023",
                "reviewTitle": "Ottima",
                "reviewText": "Non sarà retroilluminata come fatto notare da altri, ma la sensazione al tatto è fantastica e la qualità dei materiali altrettanto. La batteria dura un botto e per me è un must have se usate il Mac in modalità docking o se come me non avete una tastiera italiana nativa.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 16, 2023",
                "reviewTitle": "You would not think it was refurbished",
                "reviewText": "Although this item is refurbished, you would never know. Packaging was original, and it is really clean and not a mark on it. It works perfectly. This is the second reconditioned item, and I am very pleased with it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Risto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on February 10, 2023",
                "reviewTitle": "Vilket språk gäller för tangentbordet.",
                "reviewText": "Det är ju huvudlöst att skicka ett tangentbord med amerikanska tangenter till en kund i Sverige. Fick plocka dessa från original.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}