{
    "remaining_requests": 41662,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rii-Bluetooth-Keyboard-Lightweight-Compatible/dp/B0BML42L6X",
    "body": {
        "name": "Rii K06 Mini Bluetooth Keyboard,Backlit 2.4GHz Wireless Keyboard with IR Learning, Portable Lightweight with Touchpad Compatible with Android TV Box/Mac/Windows/HTPC (2.4G and Bluetooth)",
        "price": "$26.99",
        "originalPrice": "",
        "rawPrice": 26.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rii-Bluetooth-Keyboard-Lightweight-Compatible/dp/B0BML42L6X",
        "soldBy": {
            "sellerID": "AD4XU2XBZLYA8",
            "name": "teenemo",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AD4XU2XBZLYA8&asin=B0BML42L6X&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41RCN2Nn6iL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41O6-IzP4OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41LDKfU4nYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4125gaET7vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41mLe2sJuzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fJQ4EVVdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hyQDlKUJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rii Store",
            "link": "https://www.amazon.com/stores/Rii/page/656646AF-3B85-404E-AEDF-F1DF55BFD4EB?ref_=ast_bln"
        },
        "brand": "Rii",
        "merchantInfo": "teenemo",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 271,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 14 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【2.4G+Bluetooth Dual Mode Design】Rii 2.4GHz Mini Wireless QWERTY keyboard is built-in lithium rechargeable battery",
            "【IR Learning Function】This mini keyboard has IR learning function with 10 learning keys,you can throw your own remote away.",
            "【Touchpad and Hotkeys】Mini wireless QWERTY keyboard with multi-finger touchpad and mouse left & right buttons is easy to type/copy/paste. With 8 hotkeys, you can browse the page more conveniently.",
            "【Backlit Design】The 2.4G mini wireless handheld keyboard has backlit mode. Easy to use even in dark environments. Built-in a Li-ion rechargeable battery. With auto sleep and wake-up function, it can remain a long working time.",
            "【Widely Compatible】It can be used as a keyboard remote control for Android TV box, smart TV, PC, x-box, desktop, laptop, smart phone."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "5.9\"L x 2.3\"W x 0.4\"H"
            },
            {
                "name": "Item Weight",
                "value": "5 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "Rii"
            },
            {
                "name": "ASIN",
                "value": "B0BML42L6X"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "2.4G and Bluetooth"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 271 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#126 in Computer Keyboards"
            },
            {
                "name": "Date First Available",
                "value": "November 16, 2022"
            },
            {
                "name": "Brand",
                "value": "Rii"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Keyboard Description",
                "value": "Accessible"
            },
            {
                "name": "Special Feature",
                "value": "Backlit"
            },
            {
                "name": "Number of Keys",
                "value": "84"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Included Components",
                "value": "Rii K06"
            },
            {
                "name": "Power Source",
                "value": "Battery Powered"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Handheld Bluetooth Keyboard Remote Mini Bluetooth keyboardHandle size for operationKeyboard with IR Learning Remote for Android TV /Android TV Box",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b21e8fae-4c76-4e3b-a3d6-25c4115385d5.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Portable Wireless Mini Keyboard Wireless mini size keyboardKeyboard with TouchpadProjector Remote partner",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/47f19f61-573b-4562-bc28-6d984cbec592.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/018c184f-f703-49c2-be97-e2c6bafbc7ed.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b27f767e-ff93-4033-abae-1e48485047cf.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cce7d44f-30b8-496c-8f00-b44bbc9ab50c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b21e8fae-4c76-4e3b-a3d6-25c4115385d5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/47f19f61-573b-4562-bc28-6d984cbec592.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17275762-4b50-4357-8a23-ac0953bf00ca.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jordan HoslerJordan Hosler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYGSJ347RE4XQ34JMTH3JGOP4LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R293ZOR8T6ZM8D?ASIN=B0BML42L6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Almost Perfect For What It's meant For",
                "reviewText": "Tldr: This keyboard is not meant to be a daily driver, it's a utility for when you just need something that works. That being said, it works well. Perfect for travel, good value in my opinion.Pros:-Compact and lightweight-Bluetooth & USB Receiver modes (Very nice!)-Fully functional keyboard and decent track pad-Backlight looks nice in darker conditions, easy to turn on or off-IR learner/blaster works well with my limited testing-Charges pretty quickly & battery lasts a long time-USB-C charging port means one less charger you need to carryCons:-IR blaster took a few tries before it actually learned the signal I was teaching it (minor inconvenience)-The tackpad doesn't do well with small, precise movement. Works fine for navigating, browsing, etc., but with smaller movement the curser starts getting a little jumpy.-Nowhere to store the USB receiver that comes with it. I recommend getting a little bag to keep the keyboard & receiver together or else you'll probably lose the reciever",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81xXVOWN3yL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "CAL_08",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDGKX2LZFFYCY7QQWFRIVYNABJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R398LKF2LP0U25?ASIN=B0BML42L6X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Works well, would be better if slightly larger",
                "reviewText": "I'm using this to control an old android phone to run off my tv and it works good for what I need. I very much love the IR buttons on the backside as they allow me to interact with a 2nd device (the tv) on the fly without needing another remote to do so. Programming the keys were simple and straight forward, I just wish there were a few more buttons to make it truly more functional as only the backside buttons can be programmed to work with the IR. All the keys on the keyboard and IR backside are very responsive and so far the battery life has been great. Also like the option to have backlighting on or off.The other slight drawback is the track pad can be a tad touchy to use. It works fine but it's just so small that there's minimal space to move your finger around on it which can require lifting your finger off and back on to travler further distances on the screen. I think this device is a pretty good choice but it would be absolutly perfect it it was a 1/2\" wider and had a few more IR buttons to preset.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benjamin Scott Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWCKKOFNE7WJRTNLAY7CP33WI2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I6KTHC0DIIML?ASIN=B0BML42L6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Very tiny and great button feel",
                "reviewText": "Works great, plug and play, worth buying.Buttons have nice feel like a flip phone. Track pad is responsive and easy to use. I like the blue function keys and it is pretty easy to use once you get used to the keyboard layout. Scrolling with the up and down keys and blue function for pgup and pgdown works well. My last keyboard had major issues scrolling, constantly zooming in and not responding how I wanted.My only issues with this one is the keys are not staggered like a normal keyboard and the bumps on the home keys are pretty small. Starting out it was slow goings. To type accurately I needed to look where my fingers were.I have large hands so typing with thumbs is awkward but using pointer fingers gripping it on top and botom was easy and accurate. The space bar is shifted to the right side because of the addition of the - and + keys to the left of it. So getting accustomed the layout isn't instantaneous.The remote function side is awesome! I really like that you can program the keys so simply. Worked well with a little testing. Also the USB C charger is perfect! It worked well charging off whatever I plugged it into. No more AA batteries 😁If you're looking for a TV companion keyboard this is the one to get.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cubelodyte",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV2YTB2O35TIXMIPITQ62SUA4EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G62XD8BU5GNP?ASIN=B0BML42L6X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Positively Delightful",
                "reviewText": "This thing is adorable (translation: smaller than I expected--and I expected pretty small). For the price (Black Friday discount included) I couldn't be happier. In the body of this review, I will note some drawbacks, but I believe most of them are related to the paired devices and thus not to be counted against this Rii keyboard.Pros:- 3 distinct modes. Bluetooth, RF and IR. This keyboard can operate a PC (RF with dongle), my ChromeCast with GoogleTV (Bluetooth), and basic up to 10 functions like power on, volume, source selection for TV or Receiver (IR)- I find the touchpad to be very responsive (although I've read reviews to the contrary). It's not speedy. I prefer a trackball when traversing 3 monitors, but that's more about my setup than this keyboard device.- The keys are also very responsive. I've read at least one review that decries the grid formation of the keys over traditional staggering of a QWERTY keyboard. Honestly, I can't imagine anyone is using this to type their graduate thesis. I find it to be quite sufficient to the casual use for which I believe it was intended.- Smaller than several of my other entertainment system remotes, yet allows me to actually type search text rather than the laborious up, down, left, right, click and repeat process one is usually stuck with using simple navigation keys.- Rechargeable using USB-C which has become the standard. Every other mini keyboard I researched still used USB mini.- Battery life seems adequate so far, but I've only had it 24 hours. If the battery performance is poor, I'll come back and knock a star off from this 5-star review.Cons:- Some of the functions I use the most, Home and Return, involve 2 fingers (and potentially both hands) to operate because the require and Fn-key combination. However, this is always going to be the case for someone's favorite function given the size of the unit and the subsequent economy of buttons.- The lack of multi-touch on the touchpad can lead to some awkward click and drag combinations when using as a mouse on a PC.- Media App compatibility is the biggest complaint I can levy against this little keyboard remote. This, of course, I'm inclined to lay at the feet of the App programmers rather than this device.After performing the Bluetooth pairing with my ChromeCast with GoogleTV receiver, I've discovered the following instances of glitchy behavior:--While the cursor arrow drawn by using the touchpad will all activation of anything on the Home screen via tap or mouse-left button, the individual media apps will not acknowledge a mouse click.--The keyboard will go to sleep after a period of time (I believe this to be about 10 minutes). When this happens, the video I'm watching may be affected. On many Apps, this is not the case at all. Max, Disney+, and Paramount+ all remain unaffected.---AppleTV+ will momentarily drop the video stream to a gray screen and then recover.---Hulu, however, will pop back to the ChromeCast Home page every time the keyboard goes to sleep or wakes up. In fact, if the keyboard is set to Bluetooth mode, turning the keyboard on or off will immediately shut down the Hulu App completely.As mentioned above, I consider this to be a flaw in those 2 Apps and not this device. In fact, I've found the Hulu App to be rather flakey in several areas.Conclusion:If you want a small convenient way to operate a PC remotely (say for a presentation), easily type in full search text on streaming devices, or simply want to consolidate several remotes into one universal device, this Rii mini keyboard is an excellent and inexpensive choice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}