{
    "remaining_requests": 41622,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SteelSeries-Apex-Mechanical-Gaming-Keyboard/dp/B07SRCSML4",
    "body": {
        "name": "SteelSeries Apex 7 Mechanical Gaming Keyboard – OLED Smart Display – USB Passthrough and Media Controls – Tactile and Clicky – RGB Backlit (Blue Switch)",
        "price": "$139.99",
        "originalPrice": "$159.99",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SteelSeries-Apex-Mechanical-Gaming-Keyboard/dp/B07SRCSML4",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CHVTW7RY"
        ],
        "asinVariationValues": [
            {
                "asin": "B07SRCSML4",
                "variationName": "Style",
                "variationValue": "Blue – Tactile & Clicky",
                "price": "$139.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07SRCWNFY",
                "variationName": "Style",
                "variationValue": "Brown – Tactile & Quiet",
                "price": "$137.98",
                "variationImageURL": ""
            },
            {
                "asin": "B07SWNSXQN",
                "variationName": "Style",
                "variationValue": "Red – Linear & Quiet",
                "price": "$159.87",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41aSwZ5G1VL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Rh5C479yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WnlYNXngL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cehgPM-nL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PquAYtuvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pguwIrn4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/C1tatoNV1TL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8ef40ea9-9bfb-4bed-9947-eb043a442165/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c1b67f6d-8127-4bcb-817d-74f6603e842d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1aaec589-3c5f-4149-9c97-0a10fd5329e3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c73ca1fc-486b-4693-8c89-05116debc4b8/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/50f1b328-557a-4936-805a-00a80b39d2a9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56e84191-4dc6-4d41-b1e6-bae76c3e6cbf/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91ldlvaKdeS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91qTzRKw1SL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the SteelSeries Store",
            "link": "https://www.amazon.com/stores/SteelSeries/page/D4BCEF25-4932-416B-A862-A764B2DC9BE6?ref_=ast_bln"
        },
        "brand": "SteelSeries",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1161,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 55 mins",
            "FREE delivery Wednesday, February 21"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "OLED smart display - An integrated command center for adjusting settings and tracking on-the-fly info straight from your game, Spotify, Discord, and more",
            "Aircraft-grade aluminum alloy - Built for a lifetime of durability and stability",
            "RGB Illumination - Unmatched customization with 16.8 million colors per key",
            "Premium magnetic wrist rest - Provides full palm support and comfortable, ergonomic feel"
        ],
        "description": "The Apex 7 Keyboard has mechanical switches for 50 million keypresses. Blue switches are known for their click snap-action keypresses so you feel and hear exactly when a key registers. An integrated OLED Smart display with on-board storage is your command center for on-the-fly info from your game, Spotify, or Discord, and provides software-free customization for tweaking and saving your settings. An unbreakable aluminum alloy frame makes it a standout mechanical keyboard.",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Standing screen display size",
                "value": "‎7 Inches"
            },
            {
                "name": "Brand",
                "value": "SteelSeries"
            },
            {
                "name": "Item model number",
                "value": "‎64621"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Item Weight",
                "value": "‎2.1 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎5.5 x 17.2 x 1.6 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎5.5 x 17.2 x 1.6 inches"
            },
            {
                "name": "Color",
                "value": "Blue – Tactile & Clicky"
            },
            {
                "name": "Manufacturer",
                "value": "‎SteelSeries"
            },
            {
                "name": "ASIN",
                "value": "‎B07SRCSML4"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎June 20, 2019"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,161 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,857 in Video Games (See Top 100 in Video Games) #510 in PC Gaming Keyboards"
            },
            {
                "name": "Compatible Devices",
                "value": "OS Windows, Mac OS X, Xbox, and PlayStation. USB port required Software SteelSeries Engine 3.15+ (coming soon) for Windows (7 or newer) and Mac OSX (10.11 or newer) See more"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Keyboard Description",
                "value": "Gaming"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Lighting"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "RGB"
            },
            {
                "name": "Style",
                "value": "Blue – Tactile & Clicky"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "APEX 7 From the inventors of the mechanical gaming keyboard Guaranteed for 50 million keypresses using whichever ultra-fast switch type you prefer: red switches for consistently smooth motion, blue switches for clicky snap-action keypresses, or brown switches for a soft tactile feel.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e50a14eb-5d3e-4ea3-9292-ff9940785d00.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Previous page OLED Smart Display Customize the OLED screen with your favorite gifs, view game info, Discord messages, and more. Aircraft-grade aluminum alloy The Series 5000 metal frame is manufactured for a lifetime of unbreakable durability and sturdiness. Premium magnetic wrist rest A simple magnetic solution for easy and secure attachment, full palm support with soft touch finish. Next page 1 OLED SMART DISPLAY 2 ALUMINIUM ALLOY 3 WRIST REST",
                "media_link": []
            },
            {
                "media_text": "Dedicated multimedia controls A clickable metal roller and media keys allow you to adjust volume and settings on the fly: change brightness, rewind, skip, pause and more, all at the touch of a button. USB passthrough port Avoid crawling behind your desk: insert a flash drive, wireless transmitter, or USB device directly into the keyboard. Three-way cable routing Prevent your cable from getting in the way. The frame has built-in channels that allow you to choose from one of three possible places for your cable to exit, keeping your desk tidy.",
                "media_link": []
            },
            {
                "media_text": "SteelSeries Mice Our gaming mice feature advanced optical sensors, RGB illumination, and are compatible with PC and Mac. Learn more SteelSeries Headsets The most premium headsets in gaming. Every Arctis headset comes with our flagship audio drivers, a Discord-certified ClearCast mic, and extraordinary comfort. Learn more SteelSeries QcK Mousepads Designed for performance and durability, SteelSeries' best-selling mousepads come in a wide variety of styles and sizes, so everyone can find a mousepad perfectly suited to their needs. Learn more",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e50a14eb-5d3e-4ea3-9292-ff9940785d00.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b2e50bf8-83ba-4c7f-bd02-ed47f5446f11.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/faaad084-7b09-4574-8779-96f47a2ae0fb.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eea0f66e-509b-4bf5-b968-1fdb8fe89d81.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6fe46492-0c62-4935-84cf-fae4f51fa169.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e2701af1-e6aa-4050-be91-1da3c07582cf.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/94555e84-28fd-4a14-87b8-8e253518f355.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/868cf53a-3e5b-4603-ae08-3424bcda037e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/91c865ed-ded9-4aa2-b79c-f8275e01a04c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/46c09146-3f6d-43aa-9e4a-09d07bc76841.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/34d12c5f-8bc7-41e5-ba55-22982fbdf6ea.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2d25ef83-571c-43a9-b72f-88babfcabdc6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Dan Deer Park, IL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHARD5NCULG2LUQI5DC443CFQLAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPFKF88DXXGZ0?ASIN=B07SRCSML4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2020",
                "reviewTitle": "5.0 out of 5 stars Update after 8 months: Quality control lacking, OLED display useless, otherwise fantastic",
                "reviewText": "Updating my review after 8 months of use. Aug 13th, 2021After getting use to the feel of the keys I have come to realize this is the best keyboard I have ever owned. This is comparing it to my Corsair K95 Platinum XT keyboard, my Razer BlackWidow, and my Logitech 710+.The ability to adjust the actuation of the key, the actual action of the keys, and the lack of noise when typing cannot be beat. You do not have the traditional mechanical feedback but it is obvious when a key actuates. I have never mistyped due to lack of tactile feedback.The ability to adjust when each of the primary keys activates it fantastic. When I game I rest my finger a little harder on the A key than the WSD keys. To compensate for this I simply changes the activation setting on the A key. Problem solved.They keyboard is very responsive. I do not feel like I have to type any differently on this keyboard vs any of my others.The lack of noise is great for working from home and when on comms for gaming.The ability to switch between profiles directly that not only controls lighting but the key settings is great. I can work all day and then at the end of the day switch profiles directly from the keyboard is great.Yes, you may get a keyboard that is broken but if you can handle dealing with the return it is worth the trouble.The bad.The frame is aluminum so they must have a piece of ferrous metal inside the frame for the magnetic wrist rest to attach to. On my KB there is no ferrous metal on the left side so only the right side attaches. Frustrating.I picked the brown switches. They are defiantly quieter but feel like chicklet keys. Almost zero mechanical feedback to let you know the key actuated. This is after using reds for the last few years.The OLED display is basically useless since it sits flush with the KB. It needs to be raised at least a 1/2\" to really be useful.The good.The form factor is compact but still has a number pad.The KB feels well made. I expect it it to last a long time.The software is easy to use for the basic functions. Per key lighting, profiles, OLED display.Overall a nice KB but the too common issue of poor quality control is frustrating. I have to return my KB and there are none in stock from authorized sellers so I am not able to get a replacement. Very frustrating.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AxisAmazing",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW2GM2BEX7X7TM7WJDN6NABFRHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3O93X4HOX9GRR?ASIN=B07SRCSML4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Not as quiet as I'd hoped",
                "reviewText": "I ended up going with the Apex 7 Brown version of the keyboard. I was coming from a Logitech G510 rubber dome keyboard.After using it for a while, I've noticed a few things:The keys are a little bit higher, so my hand sits at a slightly different angle than I've been used to for almost a decade; so that has been an adjustment. I never used the G510 wrist rest, and I currently don't have it on the Apex 7. I may need to start though because it does compensate a little bit for the shift in key height.Despite the description of the keyboard, the \"tactile/quiet\" doesn't quite accurately describe the sound. Playing games can be quiet if you're only using a smaller subset of the keys (WASD type deal) and press them less frequently, but if you are typing fast (or even average speed), the keys are noticeably louder than the rubber dome keys. I'd say so much louder that I cant imagine the clicky keys on the blue is much louder when typing. My wife has complained about the loudness of my typing now that we share an office.In terms of key feel, I really like it compared to the rubber dome. I wouldn't say it is similar in feel by any means though. It takes less force to push a key down, but because it feels less \"mushy\" I feel like my typing is more precise. If you were to go with the clicky blue version, I'd say you'd get more of that \"key pressed\" feel you get on the rubber dome when you push past the force required to activate a key. On the brown switches, you can push a key slowly down and only feel a minor bump when activating the key.Having per-key color customization and profiles is a neat feature especially if you're going for A E S T H E T I C S on your build. Definitely an improvement over the G510 in terms of brightness and color definition.The inclusion of 6 macro keys is a nice carryover option from the G510, and I definitely didn't need 18 of those. Haven't really had an opportunity to use this feature yet, but it is nice that it is there.One feature I miss is having a clock on the LCD screen. I'd say that as of now, the LCD screen is useless for my purposes with the current app options available. I currently just have a gif on it and the screen serves no functional purpose. The only apps available for the LCD screen from steel series are games I don't really play, or visualizers I won't ever use. If you want a clock, or to display song info (from things like spotify), you're going to have to find someone that has made it and install it manually, or code it yourself.The volume slider is exactly as it was on the G510 and I'd say its even better since you get a little tactile bump each time you spin it. This is a feature I'm glad is exactly the same.The single play/pause/skip key under the volume wheel took a little bit of getting used to, but works as intended. The only negative I'd say is that unlike the G510, when you use the button to play/pause/skip and your monitor is asleep (but PC is still playing music in the background) it wakes your monitors up. The G510 buttons did not do this, and it is something I miss from that keyboard.Final thoughts is that this keyboard has enough features (that I wanted from my G510) to warrant the upgrade. It is a nice keyboard that should hopefully last me the next 10 years. The difference between brown and blue switches is probably just feel and not necessarily noise level (and the reds didn't interest me at all).",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee C.Lee C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET64FD4T3OCG7LC4SQQNMNF5VQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UJIIYO63AFSP?ASIN=B07SRCSML4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2021",
                "reviewTitle": "5.0 out of 5 stars My best gaming keyboard yet!",
                "reviewText": "I've always had Razer brand keyboards before this, starting out with an Ornata Chroma and then the Blackwidow V3. Unfortunately, my Blackwidow began to have issues with registering and muffled switches and their customer service didn't seem to know how how advise me on properly cleaning it more than what I'd already done, so I sought out a more knowledgeable friend than myself who had mechanical keyboard experience and this is the one he recommended to me based on what I wanted (RGB, clicky switches, and the ability to customize keycaps).The blue switches are incredibly precise, tactile and clicky (just how I like it, since I love auditory feedback when typing and gaming). The software driver for SteelSeries has a ton of customization options, and I was pleasantly surprised with all the options it gave as to lighting patterns, lighting responses to key presses, and more. The board itself and the cable feel sturdy and durable, and this is the first time I've liked and used the wrist rest that came with my gaming keyboards. It's a pleasant smooth material and doesn't hinder anything when gaming like the ones I've had in the past. I can now thoroughly enjoy gaming again :) a great board and absolutely worth every penny, I hope to enjoy it for years to come!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71wiEuQzETL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fatih Mehmet Yüksel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGFPEFHMYNTO7N3PIYJPJB664UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFE0F6WF9XBS0?ASIN=B07SRCSML4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Quality!",
                "reviewText": "This item is a huge upgrade for me, Steelseries has made its quality with this product. lighting, press quality, feeling is really great. The software is also great. I was already familiar with the software because I used the rival 650 before. So far, I have not encountered any software problems. If there is a problem with the product, I will write here, but if not, know that I am still using this keyboard and it has not disappointed my hopes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diogo R.Diogo R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 9, 2023",
                "reviewTitle": "Um dos melhores teclados existentes atualmente!",
                "reviewText": "Apesar do seu alto valor aqui no Brasil, ele é um teclado conhecido mundialmente. Com toda certeza é um dos melhores teclados existentes atualmente, o switch é perfeito, o descanso que o acompanha é bem confortável, as opções de personalização são absurdas, havendo até compatibilidade com alguns jogos na tela LED dele.Estou com ele a 1 semana e 0 defeitos até o momento, valeu cada centavo!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81aQO2KDPuL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adrián L.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 1, 2023",
                "reviewTitle": "Equipo entregado en tiempo y forma",
                "reviewText": "Como tip fijense en el color de los switches que trae el teclado, yo por guiarme por precio mas bajo ordene los cafes que segun son \"silenciosos\" y preferia los azules que \"hacen mas click\". Buen producto de calidad, es muy pronto para decir su duracion de vida. Producto llego en empaque original y cerrado, todo nuevo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RicardoRicardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 3, 2021",
                "reviewTitle": "Mejor este a los defectuosos Logi o Hyperx",
                "reviewText": "The media could not be loaded. Excelente teclado. Una muy buena alternativa a marcas populacheras y comunes.PROS. Excelente construcción. No rechina, no tiene ruiditos raros, ensamble muy bueno., Materiales resistentes. El chasis se siente muy bien. Tiene una textura mate que no va a dejar manchitas de grasa.. Teclas resistentes de PBT que supuestamente es más resistente a que se despinte. (Tuve un hyperx elite RGB y en año se empezaron a despuntar algunas teclas). Iluminación suave y muchos efectos.. Software de maravilla. Muy personalizable.. Reposa muñeca es muy cómodo. Tiene una textura sensacional. No es acolchado, es duro. Pero se siente suavecito y es magnético. No es un plástico cascarón como el que traen los HYPERX. Canales para enrutar el cable por abajo en 3 posiciones.. Bajo perfil y lijero.Cons.. Esta marca jamás fabricará teclado en español.. Precio! Aunque lo vale... Ojalá fuera más competitivo.. Brillo del RGB. Aunque es muy bonito y tiene un \"no sé qué\" que se ve más suave parece un poquito menos luminoso.. Cable apenitas del largo suficiente. Ojalá trajera unos 30cm más de cable.. Cable sin protección. No está enmallado en tela como otros. (No se necesita pero se ve más lindo). No incluye herramienta para sacar las teclas ni teclas WASD en otro color como el HYPERX (no es la gran cosa)",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/B13jMSzBuPS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91xcVFYI2AL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/B1v7VoA1ONS.mp4"
                }
            },
            {
                "reviewerName": "W.V. S.W.V. S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 30, 2020",
                "reviewTitle": "Well-built, but a bit gimmicky",
                "reviewText": "Great RGB keyboard. It's built solidly; touches like the firm rubberized wrist rest which attaches magnetically and the aluminum frame really make it feel very premium. In terms of switches, I chose the Brown switches, and while I've never used a keyboard with genuine Cherry MX Browns before, these feel absolutely great; the tactile bump is there while still feeling light and responsive.One of the main reasons why I chose this keyboard was actually because it uses standard key sizes. Believe it or not, that's a rarity among gaming keyboards, as companies like Razer and Corsair like to enlarge the space bar and shrink the Windows keys--which is nice, since the Windows key really isn't that relevant especially in games, but it also prevents you from replacing the included keycaps with cool alternative ones, like what you can see in the picture I've attached. Razer and Corsair have been trying to mitigate this by releasing their own keycaps made to fit their keyboards, but that doesn't change the fact that your options are more limited by choosing one of their boards.The RGB is excellent; the lights are bright and result in the keyboard being really eye-poppingly vibrant. The software to configure it is good, although it'd be nice if SteelSeries allowed you to organize lighting effects into layers, instead of having to first set a colour for all of the other keys and then handpick the keys you want to be different. Having five on-board profiles is also great to have, since that reduces your need to keep the SteelSeries software running in the background and also makes sure your keyboard still looks on fleek if you unplug it and use it on multiple devices.SteelSeries has been adding gimmicky features to their peripherals for a while, but I honestly do like the OLED screen at the top-right. It being there effectively gives you a menu you can navigate on your keyboard to adjust brightness, set macros, and change profiles. It also is nice for setting the mood in some of the profiles, or just indicating what game the profile is intended for. The button and roller next to it are clicky and highly responsive (the roller itself can also click down as an input; it took me a few weeks to realize this), and they work well for controlling volume and media playback when not being used to control the keyboard menu. Do note however that because of this screen, the TKL models of the Apex 7 and Pro omit the Print Screen, Scroll Lock, and Pause/Break keys. These are not very important keys by any means, but they may have a use to you--I personally use the Pause key to open the Steam overlay, since it's seldom ever used for anything at all.The actual issue with gimmicks I have is with SteelSeries's software. When a game integrates with an RGB engine, like Overwatch with Razer or Terraria with Corsair, what I want is to have a dynamic lighting profile that changes depending on what happens in the game and automatically highlights your action keys. Razer Chroma does this brilliantly with Overwatch, having the background key colour change depending on what hero you're playing as, highlighting your movement and action keys, and even having the action keys flash orange while on cooldown. Terraria's integration with Chroma, iCUE, and Logitech G also highlights your keybinds and changes the background colour depending on the biome you're in. These features are excellent; they really make the keyboard feel like an extension of the game and also do wonders helping you remember your keybinds if you haven't played in a while.What I don't want is to have my keyboard clumsily try to indicate to me how much health I have in CS:GO by changing the colour of my number row when there already is something called a MONITOR which tells me the exact health I have in numbers, in a much better location. And no, I don't want to have to look down at a tiny OLED screen to see my health, either. I just want instant, dynamic lighting profiles for games, that remember my keybinds and highlight those keys, and adapt the lighting based on what's happening on-screen. And all the game integration SteelSeries does is this stupid health and ammo indicator crap that does nothing but waste my RAM, and force me to still spend all my time working on making my own custom lighting profiles for the games I like. And don't get me wrong, I do enjoy the creativity involved with that, but I know this keyboard could do more than what I'm capable of given the right software, and I really want it to.But apart from the software... Everything works very well. This is a great RGB mechanical keyboard, and I certainly do recommend it if you can afford it.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71u0eJRXjpL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QIB5WaDGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61kPeSFtAFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "matt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 16, 2021",
                "reviewTitle": "Great product, it just works!!! 👌🏼",
                "reviewText": "Beautiful 😍 keyboard",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}