{
    "remaining_requests": 41639,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Das-Keyboard-Backlit-Mechanical-DKP13-PRMXT00-US/dp/B01L9X1TRE",
    "body": {
        "name": "Das Keyboard Prime 13 Backlit Wired Mechanical Keyboard, Cherry MX Brown Mechanical Switches, Clean White LED Backlit Keys, USB Pass-Through, Aluminum Top Panel (104 Keys, Black)",
        "price": "$139.00",
        "originalPrice": "$149.00",
        "rawPrice": 139.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Das-Keyboard-Backlit-Mechanical-DKP13-PRMXT00-US/dp/B01L9X1TRE",
        "soldBy": {
            "sellerID": "A3M6OHSKSMLKUS",
            "name": "Das Keyboard Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3M6OHSKSMLKUS&asin=B01L9X1TRE&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415pBE1Do5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Msc6Ti10L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qwRrl9-gL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51h-Xi2e4PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xahUqNr1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/413rIgsrHFL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Das Keyboard Store",
            "link": "https://www.amazon.com/stores/DasKeyboard/page/4EAA0CDE-5438-4B2A-8853-CD481A27CA65?ref_=ast_bln"
        },
        "brand": "DasKeyboard",
        "merchantInfo": "Das Keyboard Store",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 399,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 9 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "NO-NONSENSE FEATURES TO GET THE JOB DONE - The Prime 13 is a minimalist, beautiful, and rock-solid keyboard that seamlessly connects the user to the machine for maximum creativity and productivity. Focus on the task at hand and let the keyboard disappear from your mind, seamlessly connecting it to your work displayed on the monitor.",
            "PREMIUM TACTILE EXPERIENCE - Best-in-class Cherry MX Brown mechanical key switches provide tactile and audio feedback so accurate it allows you to execute every keystroke with lightning-fast precision. Factory lubricated stabilizers on large keys for smooth typing with bumps on the F and J keys. Enjoy the tactile experience you love from a mechanical keyboard, with just enough sound to satisfy you - and not annoy your coworkers!",
            "UP TO 50 MILLION KEYSTROKES - Laser-etched keycaps for maximum durability are paired with Cherry MX Brown switches, giving your new mechanical keyboard life up to 50 million keystrokes. High-performance, gold-plated switches provide the best contact and typing experience because, unlike other metals, gold does not rust, increasing the lifespan of the switch.",
            "FULL N-KEY ROLLOVER - Fast typists, productive professionals and gamers will appreciate that Das Keyboard Prime 13 mechanical keyboard supports full NKRO over USB. No need to use a PS2 adapter anymore. Just press shift + mute to toggle to NKRO (works with both Windows and Linux).",
            "2 PORT USB 2.0 HUB & MORE - The convenience to charge USB devices and simultaneously upload content through USB is now right at your fingertips. Extra long 6.5 ft (201 cm) USB cable with single USB type-A connector. Dedicated Windows key disable-control for better gaming. Media and special function keys. White LED backlighting."
        ],
        "description": "The Das Keyboard Prime 13 focuses on minimalists needs to awesome typing experience for maximum efficiency and minimum distractions. It begins with the solid, clean lines sculpted with the sleek anodized aluminum top panel and continues with each defined keystroke against the ambient White backlighting. Without all the excessive frills, this superior quality keyboard focuses on just the typing. It's the tool that connects you to the machine.",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Number of USB 2.0 Ports",
                "value": "‎1"
            },
            {
                "name": "Brand",
                "value": "Das Keyboard"
            },
            {
                "name": "Series",
                "value": "‎Prime 13"
            },
            {
                "name": "Item model number",
                "value": "‎DKP13-PRMXT00-US"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC, Linux, Chrome"
            },
            {
                "name": "Operating System",
                "value": "‎Windows, macOS, ChromeOS, and Linux operating Systems"
            },
            {
                "name": "Item Weight",
                "value": "‎2.9 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎18.03 x 6.77 x 1.22 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎18.03 x 6.77 x 1.22 inches"
            },
            {
                "name": "Color",
                "value": "black"
            },
            {
                "name": "Manufacturer",
                "value": "‎Das Keyboard"
            },
            {
                "name": "ASIN",
                "value": "‎B01L9X1TRE"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎September 7, 2016"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 399 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21,481 in Video Games (See Top 100 in Video Games) #1,610 in PC Gaming Keyboards"
            },
            {
                "name": "Compatible Devices",
                "value": "Gaming Console"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB, USB 2.0"
            },
            {
                "name": "Keyboard Description",
                "value": "Gaming"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Lighting"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "Single Color"
            },
            {
                "name": "Style",
                "value": "Minimalist"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Das Keyboard Prime 13 White LED Soft Tactile MX Brown Mechanical Keyboard Minimalist Design Start with pure lines, sculpted in aluminum, add clean white backlit keys with a modern font face, and you get an incredibly efficient tool that helps get the job done. Connecting Users to the Machine The Prime 13 is a minimalist, beautiful, and rock-solid keyboard that seamlessly connects the user to the machine for maximum creativity and productivity. Focus on the task at hand and let the keyboard disappear from your mind, seamlessly connecting it to your work displayed on the monitor. Product Details: Minimalist design with anodized aluminum top panel German-engineered, gold-plated, Cherry MX Brown mechanical key switches White LED backlighting Full n-key rollover (NKRO) USB pass-through Extra long, 6.5 ft (201 cm) braided cable Quick access media controls and sleep mode via function keys Laser-etched keycaps with keycap puller",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/adfee90a-601e-494f-8069-5721ca88be68._SL300__.jpg"
                ]
            },
            {
                "media_text": "Das Keyboard Prime 13 Features German Engineered Cherry MX Brown Switches Das Keyboard incorporates a product of the highest-quality German engineering: The Cherry MX Brown switches with a soft, tactile bump about halfway through the key press. With gold crosspoint technology, these switches ensure high-precision electrical contact and last over 50 million keystrokes. White LED Backlighting The Das Keyboard Prime 13 wields white LED backlit keys with 7 levels of brightness. Plenty-enough settings even for desks located in challengingly-dark environments. Connect any Device with a USB Pass-Through Conveniently plug a mouse, thumb drive, headset, or phone directly into the keyboard's USB pass-through. Aluminum Top Panel Featuring a minimalist design, Das Keyboard Prime 13 has been designed with a clean looking and incredibly sturdy anodized aluminum top panel.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/dd95bd18-8301-4bb9-bb10-5f578f11370a._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/6100aec1-bf24-441b-81bd-f41aed04d97a._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/20979edc-1604-4c3a-bd92-d2c7991e25b1._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/0d8dacb8-172c-4d0b-b950-54eee1e32b20._SL220__.jpg"
                ]
            },
            {
                "media_text": "Sidelit Media Controls We rotated the LED switches to be front facing so that even the media controls icons located on the side of the keycaps are backlit. The best way to explain this is to create this new word, sidelit. Improved Cable Management With the extra-long braided cable and its rectangular shape, the Prime 13 keeps you knolling more then ever. Full N-key Rollover Programmers and fast typists will love to hear that Das Keyboard 4 supports full n-key rollover (NKRO) over USB. No need to use a PS2 adapter anymore. Just press Fn + F12 to toggle NKRO; lock LEDs will flash once for On and twice for Off. Built-in Energy Saving Features Sleep Control Function: Das Keyboard was one of the initial company to incorporate a computer sleep control to its keyboards. Having a computer sleep when not in use will make it stop burning unnecessary energy. LED Auto-Dim: The Prime 13 backlighting automatically dims after 10 minutes of inactivity. Even keyboards like naps.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/310e4a83-43dc-4250-a5a6-e5ff201b80e4._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/7d59640d-5f83-4a79-ae1c-fbb8fc6a3281._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/07b0b34a-9b7b-4954-be48-fbca2a62cc4a._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/8ef4c7e5-84e6-43b1-8b19-bb276fc29ac0._SL220__.jpg"
                ]
            },
            {
                "media_text": "Das Keyboard 5Q Smart RGB Das Keyboard X50Q Smart RGB Das Keyboard 4 Professional | Ultimate | root Das Keyboard 4 Professional for Mac Das Keyboard Prime 13 Das Keyboard Model S Professional | Professional for Mac Switch Type Omron Gamma Zulu Soft-Tactile with gold plated double cross-points Omron Gamma Zulu Soft-Tactile with gold plated double cross-points Cherry MX Blue (Clicky) or Brown (Soft Tactile) with gold contacts Cherry MX Blue (Clicky) or Brown (Soft Tactile) with gold contacts Cherry MX Brown (Soft Tactile) with gold contacts Cherry MX Blue (Clicky) or Brown (Soft Tactile) with gold contacts Switch Lifespan 100 million 100 million 100 million 50 million 50 million 100 million Keycap Type Double Shot ABS Plastic Professional: Laser-Etched | Ultimate: Blank | root: Laser-Etched UV Hard Coat-Protected Laser-Etched Professional: Laser-Etched | Professional for Mac: Laser-Etched (NKRO) N-Key Rollover Full n-key rollover Full n-key rollover Full n-key rollover Full n-key rollover Full n-key rollover Full n-key rollover (with included PS2 adapter) or 6 keys with USB USB Ports - - Professional | Ultimate: 2-Port USB 3.0 Hub | root: 2-Port USB 2.0 Hub 2-Port USB 3.0 Hub 2-Port USB 3.0 Hub 2-Port USB 2.0 Hub Media Controls Dedicated Media Controls Dedicated Media Controls Dedicated Media Controls Dedicated Media Controls Quick Access Media Controls Quick Access Media Controls (Not available over PS2) Top Panel | Detachable Wrist Rest Black Anodized Aluminum | Detachable Silicone Wrist Rest Black Anodized Aluminum | Detachable Soft Touch Wrist Rest Black Anodized Aluminum Black Anodized Aluminum Black Anodized Aluminum Glossy Black Works With Windows, macOS, Linux Windows, macOS, Linux Windows, Linux, Chrome macOS Windows, Linux, Chrome Windows, Linux System Requirements One 2.0 USB Port, Optional 3.0 USB Port for Enhanced Brightness Mode One 2.0 USB Port, Optional 3.0 USB Port for Enhanced Brightness Mode One 1.1, 2.0 or 3.0 USB Port One 1.1, 2.0 or 3.0 USB Port One USB Port - (optional) Second USB Port for Pass-Through One USB Port, Optional Second USB Port for Hub Key Backlighting RGB+ with Q Notifications RGB+ with Q Notifications - - White LED Backlighting -",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/7767460d-a385-4ade-ac06-40a48d7c0257._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/adfee90a-601e-494f-8069-5721ca88be68._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/dd95bd18-8301-4bb9-bb10-5f578f11370a._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/6100aec1-bf24-441b-81bd-f41aed04d97a._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/20979edc-1604-4c3a-bd92-d2c7991e25b1._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/0d8dacb8-172c-4d0b-b950-54eee1e32b20._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/310e4a83-43dc-4250-a5a6-e5ff201b80e4._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/7d59640d-5f83-4a79-ae1c-fbb8fc6a3281._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/07b0b34a-9b7b-4954-be48-fbca2a62cc4a._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/8ef4c7e5-84e6-43b1-8b19-bb276fc29ac0._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f8edb5db-582e-43c4-b60f-60c2f43d6fb7._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/9b4eb1a2-c03a-4526-8fc1-8ad083db796a._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e9b922e-4c3c-4665-8233-bc619c8c4efd._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/58601a1f-b53a-4afc-805d-195fa4a28424._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/e073b30d-3df6-428a-9661-a7d0bf5806d6._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e9239300-fed2-46de-acf2-db1e565b4548._CR0,0,150,300_PT0_SX150__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M. L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6KI6LB7V5J4G7FIBWCFTKMMKOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VDBV2FQXFBM6?ASIN=B01L9X1TRE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2019",
                "reviewTitle": "5.0 out of 5 stars Excellent, high quality mechanical for a professional setting",
                "reviewText": "My first mechanical keyboard with modern switches (instead of the older buckling-spring assemblies) was a Velocifire VM01. It served me well, but I decided recently to splurge and go for a more premium deck – in this case the Das Keyboard Prime 13 with Cherry MX Brown keyswitches. It does, I must admit, have a very different feel to my significantly cheaper VM01 Keyboard. It’s not unpleasant. The switches feel very similar to the way my old Unicomp Model M buckling spring keyboard felt. There’s a very satisfying buoyancy to the keys (for lack of a better word). It’s a genuine joy to type on. I look forward to using this keyboard for National Novel Writing Month.The backlighting is even and strong – much more so than the VM01. The steel faceplate is cool to the touch and very solid. There’s no noticeable flex, even when I press very hard down on the center of the keyboard or pick it up and twist the corners away from each other.The keycaps feel nice, have a clear and professional-looking font to them, and have very little wiggle which is a nice change from my VM01. That’s a difference that $75 will get you. I may still need to put O-ring dampeners on the keys. We’ll see how loud the keyboard actually sounds once I get it set up in my office.I don’t notice the audible “PING!” when releasing larger keys such as the space bar and backspace buttons that annoyed me with the VM01. That’s a level of quality I expected – but it’s nice to see that my trust in the Das company wasn’t unfounded. This is definitely one of the nicest premium keyboards I’ve ever used – if not the best period.One very minor criticism – on keys that have two legends on them (like the number/symbol keys along the top and the bracket/curly brace keys on the side) the backlight only illuminates the top symbol and not the bottom. This is probably due to the fact that Cherry switches have their LED on the top of the switch…but it would have been nice to have both light up still.I don’t know if it’s just my unfamiliarity with the Cherry MX Brown switches, but I notice myself adding a lot of extra spaces in my writing. I’ll have to see if that goes away with more regular use. It could be that the space bar on my old Velocifire VM01 was just less sensitive and I’m used to really banging it to get it to actuate. Haha. The large buttons on this keyboard do require what seems like a lot less pressure to register than I’m used to on the VM01. I’m not sure if that’s real or imagined.Although I was assured when I bought the VM01 that the OUTEMU off-brand brown switches were comparable to Cherry MX Browns – I’m going to have to disagree. There’s a decidedly different feel to these branded Cherries on the Das. Again, this may just be confirmation bias since I paid almost twice as much for this keyboard as the VM01 – but I feel like the Cherry switches are just smoother, and require less actuation force.This is the closest feel I’ve found in a post-Model-M keyboard to the buckling spring monster I used back in the day. The keys pop back up in a satisfying and strong way. The sound is nice and clacky without being *completely* over the top. The overall look and feel of the keyboard itself is very high-end and professional looking. I see some of my coworkers bringing in high-end VGA keyboards and realize that the “gamer” aesthetic isn’t really for me. I would feel juvenile using a board with multi-colored lights on it like some twenty-something’s sports car.The cord is braided, which you’ll either love or hate. I personally like the look and feel of it myself. It terminates in 2 USB 2.0 plugs – one for the keyboard and one for the USB pass-through port on the top right of the keyboard. I like to use this for my wireless mouse receiver. It’s discreet and keeps it out of my way.This was my first purchase from Das, and I don’t believe it will be the last. It took me a long time to be able to justify the price to myself but now that I’ve used it first hand I don’t know that I’ll be willing to go back to squishy ten dollar membrane keyboards again. Das may well have ruined me for them.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RogerRoger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWI452C24HVTPJSA7KWM3HNOUBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NIX5Z7IE5HL2?ASIN=B01L9X1TRE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 28, 2017",
                "reviewTitle": "5.0 out of 5 stars A nice functioning and overall sturdy basic keyboard. Updated 2021.08.09!",
                "reviewText": "Updated 2021.08.09, see notes at bottom!A nice functioning and overall sturdy basic keyboard.This is my second DAS mechanical keyboard, and fourth/fifth mechanical keyboard purchase. This is my first lit key cap keyboard, as I'm typically frightened by distractor' such as overly bright or flashing LED lights.PROS1) Nice soft (brown) key switch actuation, noticeably softer than the blue key switches. (I well notice I can type more characters in a day using the brown versus blue key switches.)3) No more gimmick magnetized ruler on the underside of the keyboard for elevating and angling the rear of the keyboard.4) No volume control knob, I rarely use as I and most other power users are connected to home stereo audio system via digital S/PDIF or HDMI cabling. The keyboard does have volume controls, using the FN key + Function keys. (Keyboard volume controls are likely intended for laptops and computers having all-in-one sound card with included amplifier.)5) Long USB cable. NOTE: This keyboard has two USB cables, one for the keyboard and the other for USB ports.CONS1) They reversed the positions of the shifted characters labeled on the key caps for the keyboard! Example, instead of the number one \"1\" on the bottom row of the key cap, the number one character is labeled on top with the exclamation mark on the bottom row. This key cap is entirely backwards and somewhat assume the engineers had to do so, in order to make the key cap lighting work? I sympathize with those just learning to type, and note the number pad are the only key caps not having this shifted lettering character anomaly or reversal.2) The key cap lighting does apparently have an adequate lowest lighting level setting, so that I'm not distracted by bright flickering LED lights. However at night or within dark rooms, the lowest LED lighting level is still too bright and does somewhat still flicker. I'm betting if the current lowest lighting level were halved or were a 50% level of the lowest current light setting, then the resulting light level would then be more than likely adequate for use within dark rooms or at night. But dimming LED lights tends to further induce flicker. Few LED lights are currently on the market with dimming features, while boasting stress free reading light. (Remember, the LED lighting around the keyboard is within the field of vision of the user while typing.)2) The shifted characters (eg. !, @, #, cursor number pad keys, ...) are not lit.3) Some different icons are used for key cap lettering, such as a double-ended arrow for the TAB key lettering, upward pointing arrow instead of CAPS LOCK lettering. If you're half blind and just learning how to touch type while looking at the keys, it might be a better system. But for children or those with eye sight, learning a keyboard will likely be far more easier seeing/reading \"Enter\", \"Caps Lock\", \"Shift\" on the key caps. The remainder of the less commonly utilized keys (eg. CTRL, INS, HOME, DEL, END, ...) are spelled-out, likely due to not having a common icon. I remember when the power icon first arrived within software several years ago, it took me several years to learn what the circle with slash really stood for as this power icon was rarely seen prior within software and far less likely hardware. One would rationally think, fewer and fewer non-typing older people with poor eye site will exist within future years, while commonly children typically see extremely well and are more apt to learn to type nowadays. Since I can type, this becomes a moot point, but if you're learning to type, you're likely going to want to study a keyboard layout with these keys spelled-out instead of attempting to comprehend these new icons.So far, the only time these reversed unshifted/shifted lettering and unusual icons become distracting, is when I look down at the keyboard rather than typing without looking. For a second, I'm stumped as this looks extremely odd, then I just switch to typing from memory rather than trying to discern what I am typing. (eg. \"Use the force Luke!\")2021.08.09: Still using this keyboard 4+ years after purchasing, and especially now after recently shopping around the past day or so trying to find a better typist specific typing keyboard. Nothing even comes close to this DAS keyboard, having a standard full-sized non-wireless/USB keyboard with gentle back-lighting. As of 2021, everything on the market is still not geared to the typing profession, but to playing games! My keyboard is primarily used on Linux based operating systems. Nothing has broken on this keyboard and has recently survived being washed in the bathtub after a milk-based drink spill into the key areas. Just wish they had a sensitive scissored key switch model, or something similar to an electronic typewriting experience!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/616tLbUSkYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71z0X45LO-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 3, 2020",
                "reviewTitle": "Alto precio alta calidad",
                "reviewText": "El precio se me hizo elevado, pero una vez lo tuve en mis manos entendí porque. Los materiales son excelentes y la calidad es alta. Es pesado y robusto. La iluminación me gusto mucho pues tiene varios niveles y es blanca. Las teclas se sienten super cómodas y la disposición de estas sobre todo el teclado fueron pensados con la ergonómica como primer lugar, es decir, esta muy bien diseñado. En cuanto los switch son cómodos, este es mi primer teclado mecánico y nunca pensé que fuera tan como uno de esta clase, mi intención de compra no son los vídeojuegos sino la programación (teclear). Me gusto que no parece \"nave extraterrestre\" y su apariencia es muy profesional. En cuanto al ruido ni hablar, si que es muy ruidoso no lo recomendaría si esto es un factor de alta importancia. En términos generales, el precio justifica su calidad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 4, 2019",
                "reviewTitle": "You definitely need this",
                "reviewText": "This is the best mechanical keyboard on the market. I love the illuminated white lights, allows you to type easily in the pitch dark. The prime 13 is far better than the 4 professional since it comes equipped with rubber feet instead of that stupid useless ruler that would make your keyboard slide all over the place. The only downside I could think of is that it no longer comes with the volume knob, but that's not a real deal breaker for me cause I normally use my mouse to control the volume. I had issues with the 4 professional and that's why I upgraded to this model instead. I remember sometimes the blue led lights for the num lock wouldn't always work properly which was really annoying. The prime keyboard, on the other hand, works flawlessly. Feels fantastic while typing and you could use as much force when typing, the keys are super durable. It seems like you can't break this keyboard no matter how hard you type. It comes with a usb pass-through which is great if you have a wireless mouse, you simply attach the usb dongle to it and voila you save yourself a usb slot on your PC. Plus your wireless mouse works better since the usb dongle for your mouse if literally less than a foot away. Another downside to this keyboard, is that you require two usb slots for the keyboard to function properly since it comes equipped with two usb connectors. All in all, this is my favorite keyboard I've ever owned. Das has released a couple of newer keyboards recently and I think they look fantastic with ample functionalities. Das never ceases to amaze me. What a fantastic company.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 14, 2018",
                "reviewTitle": "The keyboard has exceeded my expectations. It is a ...",
                "reviewText": "The keyboard has exceeded my expectations. It is a pleasure to use it. At first, I was wondering wether to invest so much, but I have to say, every penny is worth it and the experience is fab.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aithnea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 19, 2021",
                "reviewTitle": "Spacebar chatter",
                "reviewText": "Looks smart and the keypresses feel nice enough but it's a bit loud, especially with the stands up, and there is very frequent chatter from the spacebar. So my sentences s tart to r ead like this more often t han not.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelvin Lim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on June 23, 2021",
                "reviewTitle": "Well worth the money!",
                "reviewText": "Great product, good metallic casing. Sturdy and great for typing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}