{
    "remaining_requests": 41559,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Das-Keyboard-Professional-Mechanical-DASK3MKPROSIL/dp/B008PFDUW2",
    "body": {
        "name": "Das Keyboard Model S Professional Wired Mechanical Keyboard, Cherry MX Brown Mechanical Switches, 2-Port USB Hub, Laser Etched Keycaps (104 Keys, Black)",
        "price": "$129.00",
        "originalPrice": "$149.99",
        "rawPrice": 129.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Das-Keyboard-Professional-Mechanical-DASK3MKPROSIL/dp/B008PFDUW2",
        "soldBy": {
            "sellerID": "A3M6OHSKSMLKUS",
            "name": "Das Keyboard Store",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3M6OHSKSMLKUS&asin=B008PFDUW2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B092CGM1ZM"
        ],
        "asinVariationValues": [
            {
                "asin": "B008PFABI8",
                "variationName": "Color",
                "variationValue": "Clicky Tactile - Cherry MX Blue Switches",
                "price": "$129.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41vVTvWUeTL._SS36_.jpg"
            },
            {
                "asin": "B003ZG9T62",
                "variationName": "Color",
                "variationValue": "Mac Clicky Tactile - Cherry MX Blue Switches",
                "price": "$129.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41EnKQLnHyL._SS36_.jpg"
            },
            {
                "asin": "B008PFDUW2",
                "variationName": "Color",
                "variationValue": "Soft Tactile - Cherry MX Brown Switch",
                "price": "$129.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41vVTvWUeTL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41vVTvWUeTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41EowFdrxrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51u7qLFm3KL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jLhdqc3RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41T8ZYHGsjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ulnkckpbL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3999adb2-3b1f-47ce-b9e7-45e17db9ede3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/08f622d7-548b-4724-a230-a8a6c82f68e0/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Das Keyboard Store",
            "link": "https://www.amazon.com/stores/DasKeyboard/page/4EAA0CDE-5438-4B2A-8853-CD481A27CA65?ref_=ast_bln"
        },
        "brand": "DasKeyboard",
        "merchantInfo": "Das Keyboard Store",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1524,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Friday, February 16. Order within 15 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HIGH PERFORMANCE AND HIGH QUALITY WITH SUPER AWESOME FEEL - This high-performance, mechanical keyboard feels amazing on your fingertips and offers two distinct tactile experiences - click and soft. Your fingers will love it. Now includes media controls for quick access to the most common media functions.",
            "PREMIUM SOFT TACTILE EXPERIENCE - Best-in-class Cherry MX Brown mechanical key switches provide tactile and audio feedback so accurate it allows you to execute every keystroke with lightning-fast precision.. Enjoy the tactile experience you love from a mechanical keyboard, with just enough sound to satisfy you - and not annoy your coworkers!",
            "UP TO 50 MILLION KEYSTROKES - Laser-etched keycaps for maximum durability are paired with Cherry MX Brown switches, giving your new mechanical keyboard life up to 50 million keystrokes. High-performance, gold-plated switches provide the best contact and typing experience because, unlike other metals, gold does not rust, increasing the lifespan of the switch.",
            "FULL N-KEY ROLLOVER - Model S allows full N-key rollover with an included PS2 adapter, and 6 keys with USB. Great for fast typists and gamers alike.",
            "2 PORT USB 2.0 HUB & MORE - The convenience to charge USB devices and simultaneously upload content through USB is now right at your fingertips. Extra long 6.5 ft (201 cm) USB cable with single USB type-A connector. Special Media Keys (inscriptions in blue): sleep, brightness +/-, mute, volume +/-, eject, play/pause, next and previous track."
        ],
        "description": "Experience faster typing than you ever dreamed. The Das Keyboard professional - soft pressure point mechanical keyboard sports high-performance, gold-plated, mechanical key switches that produce unique click tactile feedback while making the typing experience more comfortable, precise and fast. Now includes Media controls for quick access to the most common media functions.",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "18\"L x 6.5\"W x 1.5\"H"
            },
            {
                "name": "Item Weight",
                "value": "3 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Das Keyboard"
            },
            {
                "name": "ASIN",
                "value": "B008PFDUW2"
            },
            {
                "name": "Item model number",
                "value": "DASK3MKPROSIL"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,524 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,031 in Video Games (See Top 100 in Video Games) #121 in Mac Gaming Keyboards #605 in PC Gaming Keyboards"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "July 31, 2012"
            },
            {
                "name": "Brand",
                "value": "Das Keyboard"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            },
            {
                "name": "Keyboard Description",
                "value": "QWERTY"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office"
            },
            {
                "name": "Special Feature",
                "value": "Multimedia Keyboard"
            },
            {
                "name": "Color",
                "value": "Soft Tactile - Cherry MX Brown Switch"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "Single Color"
            },
            {
                "name": "Style",
                "value": "Professional - Standard Key Caps"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Das Keyboard Model S Professional with Cherry MX Brown Switches High-Performance, High-Quality Experience faster typing than you ever dreamed. The Das Keyboard Model S Professional Soft Tactile Mechanical Keyboard sports high-performance, gold-plated, mechanical key switches that produce unique soft tactile feedback while making the typing experience more comfortable, precise and fast. Now includes media controls for quick access to the most common media functions. This high-performance, mechanical keyboard feels amazing on your fingertips and offers two distinct tactile experiences - click and soft. Your fingers will love it. Best-In-Class Cherry MX Switches Das Keyboard uses best-in-class, Cherry MX mechanical key switches that provide tactile and audio feedback so accurate it allows you to execute every keystroke with lightning-fast precision. Its high-performance, gold-plated switches provide the best contact and typing experience because, unlike other metals, gold does not rust, increasing the lifespan of the switch. Product Details: German-engineered, gold-plated, Cherry MX Brown mechanical key switches Special Media Keys Two-port USB 2.0 Hi-Speed hub Laser-etched inscriptions on keys to resist fading Glossy black upper enclosure Full n-key rollover (anti-ghosting technology) Blue LEDs for Num Lock, Caps Lock, and Scroll Lock Extra long 2-meter USB cable with single USB type-A connector",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/77feecfd-ea09-491a-90e6-2af7f1575a8c._SL300__.jpg"
                ]
            },
            {
                "media_text": "Das Keyboard Model S Professional Features Cherry MX Brown Mechanical Key Switches The Cherry MX Brown switches have a soft, tactile bump about halfway through the key press. The Soft Pressure Point switch technology makes the mechanical keyboard less clicky while providing an awesome tactile experience. USB 2.0 Hi-Speed Hub The high-speed USB hub allows you to sync and charge your iPhone, iPod or any USB compatible devices. Extra-long USB cable Das Keyboard sports a 2-meter (6.6 feet) cable that goes through your desk grommet to keep your workspace neat and tidy. N-key Rollover Model S allows full N-key rollover with an included PS2 adapter, and 6 keys with USB. Great for fast typists and gamers alike.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/484433a9-7d76-4bcb-a982-7d24e59b6ce6._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/85b2ae3c-5866-49ad-8d71-ea2248f5e954._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/de4d8c83-5328-4519-b917-c7533c46e69d._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/b32d572d-f73e-4c8a-b233-823fed5cb9bc._SL220__.jpg"
                ]
            },
            {
                "media_text": "Glossy Black Enclosure Glossy black upper enclosure with matching black USB cable – Darth Vader approved. Quick Access Media Keys Quickly access and adjust the brightness or volume up and down, you can also mute, eject, play/pause, next and previous track, and put your computer to sleep with easy to access media controls. Laser-etched Inscriptions On Keys To Resist Fading The Das Keyboard Model S Professional is equipped with laser etched key inscriptions to prevent fading and provide ease of reading. Sleep Function Help reduce the environmental impact of your computer and save energy by putting your computer to sleep simply by using this handy sleep function even for your shortest breaks.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/24b62113-f8d5-4f97-a2af-6b263e206d73._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/34931bde-de68-4096-bfb8-f1457b602087._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/3730b7be-2149-49a3-b06b-1291a1e86363._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/fdf193ad-d2ac-495c-83a4-784f93f5a269._SL220__.jpg"
                ]
            },
            {
                "media_text": "Das Keyboard 4 Professional / Ultimate Das Keyboard X50Q Smart RGB Das Keyboard 4 Professional | Ultimate | root Das Keyboard 4 Professional for Mac Das Keyboard Prime 13 Das Keyboard Model S Professional | Professional for Mac Switch Type Omron Gamma Zulu Soft-Tactile with gold plated double cross-points Omron Gamma Zulu Soft-Tactile with gold plated double cross-points Cherry MX Blue (Clicky) or Brown (Soft Tactile) with gold contacts Cherry MX Blue (Clicky) or Brown (Soft Tactile) with gold contacts Cherry MX Brown (Soft Tactile) with gold contacts Cherry MX Blue (Clicky) or Brown (Soft Tactile) with gold contacts Switch Lifespan 100 million 100 million 50 million 50 million 50 million 50 million Keycap Type Double Shot ABS Plastic Professional: Laser-Etched | Ultimate: Blank | root: Laser-Etched UV Hard Coat-Protected Laser-Etched Professional: Laser-Etched | Professional for Mac: Laser-Etched (NKRO) N-Key Rollover Full n-key rollover Full n-key rollover Full n-key rollover Full n-key rollover Full n-key rollover Full n-key rollover (with included PS2 adapter) or 6 keys with USB USB Ports - - Professional | Ultimate: 2-Port USB 3.0 Hub | root: 2-Port USB 2.0 Hub 2-Port USB 3.0 Hub One USB 2.0 Pass-Through 2-Port USB 2.0 Hub Media Controls Dedicated Media Controls Dedicated Media Controls Dedicated Media Controls Dedicated Media Controls Quick Access Media Controls Quick Access Media Controls (Not available over PS2) Top Panel | Wrist Rest Black Anodized Aluminum | Detachable Silicone Wrist Rest Black Anodized Aluminum | Detachable Soft Touch Wrist Rest Black Anodized Aluminum Black Anodized Aluminum Black Anodized Aluminum Glossy Black Works With Windows, macOS, Linux Windows, macOS, Linux Windows, Linux, Chrome macOS Windows, Linux, Chrome Windows, Linux, macOS System Requirements One 2.0 USB Port, Optional 3.0 USB Port for Enhanced Brightness Mode One 2.0 USB Port, Optional 3.0 USB Port for Enhanced Brightness Mode One 1.1, 2.0 or 3.0 USB Port One 1.1, 2.0 or 3.0 USB Port One USB Port - (optional) Second USB Port for Pass-Through One USB Port, Optional Second USB Port for Hub Key Backlighting RGB+ with Q Notifications RGB+ with Q Notifications - - White LED Backlighting -",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/a3ffad8b-ac3c-47f6-8136-d91250cb8cff._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/77feecfd-ea09-491a-90e6-2af7f1575a8c._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/484433a9-7d76-4bcb-a982-7d24e59b6ce6._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/85b2ae3c-5866-49ad-8d71-ea2248f5e954._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/de4d8c83-5328-4519-b917-c7533c46e69d._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/b32d572d-f73e-4c8a-b233-823fed5cb9bc._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/24b62113-f8d5-4f97-a2af-6b263e206d73._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/34931bde-de68-4096-bfb8-f1457b602087._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/3730b7be-2149-49a3-b06b-1291a1e86363._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/fdf193ad-d2ac-495c-83a4-784f93f5a269._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e2fc37ad-2604-4cb4-9c09-cf48f11a91ca._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa8827f1-b448-43ab-bd2c-e000695d37e4._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b1fc2133-9a78-40dc-b046-c3356f86c068._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5af52561-ad98-4575-b47e-e53ab0b38877._CR0,0,150,300_PT0_SX150__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/f86b27e1-1518-4328-bb72-2a9723a739af._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2d5200cb-0435-4cb1-a66b-84f5d3d332cc._CR0,0,150,300_PT0_SX150__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "J. Rab",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETWPDFV5FMANMKNN3JDMVCSQP4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGV7USGEAMUH6?ASIN=B008PFDUW2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2013",
                "reviewTitle": "5.0 out of 5 stars An amazing clickity-clack keyboard!",
                "reviewText": "Having used this keyboard now for about a few months, I can say it is by far the best keyboard I've ever used. I've gone through so many keyboards over the years and all of them had their short comings. I mean it's normal -- it's a keyboard -- what more can you want -- or so I thought. When I got this keyboard and started using it, it just felt so different. Not just the keyboard but the feeling of using a keyboard. I was actually having fun typing on it. I'm a software developer and type thousands of lines of codes a day -- so after months of using this I've gotten so spoiled by the clicking noise / feedback. It actually massages my fingers as I type -- sounds ridiculous but the feedback actually helps me finish my work more efficiently. I can't explain it -- it's just an amazing feeling.The quality and build are both pretty solid. It's a HEAVY keyboard so it won't be moving around much as you type like most other keyboards. The keys are spaced out juts perfectly.Now for the issues -- a with most things nothing is ever perfect. I've run into two issues so far while having this keyboard.One: When I first got the keyboard, the Back Space key started making the squeaky noise -- normally I wouldn't notice but the keyboard almost has a musical patter when you type -- and the squeak killed it. So I sent an email over to their customer support and they said it is normal for \"bigger\" keys to develop a squeak to them. The key just has to be pulled out and lubricated. They even sent me a free key puller which was fantastic.Two: This may be a software bug. I am using an iMac and every so often after long periods of hibernation, sleep, usage, etc. the keys on the keyboard stop responding as quickly. Some keys when you press them don't show up on screen and you have to type again. Sometimes you are just typing and the words are missing letters. I've found that unplugging the USB wire for a few seconds and plugging it back in fixes that issue. It's just annoying to have to do it -- but again not a deal breaker.All in all I love this keyboard and is probably one of the best purchases I have ever made. The price tag on this is pretty steep but after using it I've learned it's worth every penny. The company is pretty fantastic too -- I look forward to their future products!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronald Epstein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLBDKWRQHZVKVWRF5TOJJAI4WJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RTBCBGVWDVIW?ASIN=B008PFDUW2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2012",
                "reviewTitle": "5.0 out of 5 stars Buy into the hype...this keyboard is the real thing!",
                "reviewText": "If someone were to ask what computer component deserves the the most investment, my answer would be the keyboard. After all, the keyboard is the one tool on your desktop at home and work that goes through the most abuse. It's also the primary piece of hardware that really establishes the connection between human and computer. It's important that what you press beneath your fingers has the ability to react. The more it reacts, the more confidence you have in what you type, and thus, your typing speed vastly improves.For years I have put a lot of money into the keyboard I type on. I spent almost $300 for the Logitech Dinovo Keyboard. For me, it was well worth the cost, as for the last three years I have been typing on what I consider to be the Cadillac of keyboards. After three years, however, the Dinovo is looking a bit abused (letters have been long worn from the keys), and quite frankly, I was getting tired of having to recharge it every couple of weeks.So, in the market for a new keyboard I started reading about Das Keyboard in some of the Mac magazines. All the reviews I had read pointed to this keyboard being something extraordinary for the fact that it's a throwback to the mechanical keyboards that dominated the 80s (and still hold up well today).Make no mistake about it, Das Keyboard is built like a tank. You really start to marvel at the build quality of this keyboard, that is, until you become distracted once you begin typing upon it. The tactile feel of the keys and the \"clicking\" response you get with each keystroke is something you must really experience to believe. The keys feel solid, quickly snapping back into position with every press. It's a much more gratifying feeling as opposed to the \"mushiness\" that most modern keyboards give in response.I have read many complaints on Amazon about Das Keyboard switching manufacturers. I wish there was a way to find out if my keyboard came from the original manufacturer or not. Nobody has posted any details on how to find out (if there is a way at all). I may be wrong about this, but most of the complaints I see are not tied to the Mac model, so I am hoping for the best.What I can say at this time is that the keyboard is working perfectly. As I sit here and write this review, I am immensely enjoying the audible clacking as I stroke each key. It is true that these mechanical keyboards do wonders for typing speed. I am typing faster and more confidently than I ever have before. I am also making less mistakes.I always question spending hundred(s) of dollars on keyboards every time I make a new purchase. However, for those that can afford the expense, you really go get what you pay for. As much as I loved the Logitech DiNovo, I am equally enjoying Das Keyboard. It actually makes me look forward to using my new iMac even more. After all, most of your daily interaction with your computer happens through your keyboard. You really deserve to buy the best model you can. Your fingers will thank you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ljósmyndari",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGE2UK5VDWCAYP5JI4DDEBQKAZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E8TTCPR5KSYH?ASIN=B008PFDUW2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 16, 2014",
                "reviewTitle": "5.0 out of 5 stars Great Keyboard!! Spend the extra money, you will not regret it!!!!",
                "reviewText": "After my other keyboard died (unfortunately, not by natural causes) I read some reviews and almost everyone loved the Das Keyboards. So, I decided to spend the extra money and purchase the Das Keyboard for Mac.Wow! I forgot how much I miss typing on a \"real\" keyboard! After using chiclet keyboards for several years, this keyboard is a dream to type on. It is noisy, but that is also some of the fun (a little nostalgic for those of us old enough).I have only had this keyboard for a few days now, I have noticed my typing speed and accuracy have definitely increased. Now if only it had the ability to improve my spelling and grammar :-)The keyboard worked immediately out of the box. This keyboard only has 12 Function keys, whereas the Aluminum Apple Keyboard has 19 Function keys. I have an app that I map certain actions to the Function keys so this required me to do some re-mapping. Not too big a deal.The Das Keyboard does not have the Dashboard, Mission Control and/or Expose keys that are found on the Apple Keyboard. For me, this is not big deal as I did not use them anyway. I used those Function keys to replace the F13 - F19 I was using.The Das Keyboard does have controls for audio and brightness and you can put the system to sleep as well; you have to press a dedicated \"fn\" key for those controls. This is very similar to a PC laptop keyboard.Pros: Improves typing skills, feels good to type on, sturdyCons: is noisy when typing, no F13-F19 keys, requires you to plug into two USB ports if you need to use the built in USB hubIf anything changes, I will post a follow-up review.Thanks",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gregorio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 9, 2022",
                "reviewTitle": "Excelente producto",
                "reviewText": "Es mi primer teclado mecánico por lo que no tengo un punto de comparación.Observaciones personales:-El sonido de las teclas no es molesto.-La sensación del pulso de la teclas es muy bueno.-Desventaja es que no hay teclados en español.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Oni J.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 4, 2017",
                "reviewTitle": "A Fantastic Keyboard from Das.",
                "reviewText": "This is a great keyboard for those looking for a great typing experience. The MX Blue switches offers a nice \"clicky\" tactile feedback that makes typing word documents a complete joy. The keys are loud, responsive, and makes the entire typing experience a lot easier to bear after slugging away page after page.The switch from a traditional keyboard to a mechanical keyboard is simply night and day. Previously I was using the standard HP keyboard for my every-day use, and I would grow tired of typing before long. I decided that purchasing a mechanical keyboard would be the best option for me, and I ended up choosing this particular Das product. The difference, as previously mentioned, was night and day. Typing now is no longer a chore, and I can sit for longer periods of time without having to complain about a terrible keyboard. I was pleasantly surprised when I found out that I can also use this on a Windows OS with no problems what so ever right out of the box.One aspect I was slightly disappointed by however was the plastic finish on the keyboard. Paying this kind of money, it would have been nice to see a metal finish, like some of the other keyboards Das has to offer. However, the build quality is still very sturdy and screams quality. The product has a nice bit of weight to it, and the overall feel of the keyboard is premium. A metal finish however, would have elevated the product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vinay Kumar Singh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 21, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "good product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonimo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 8, 2015",
                "reviewTitle": "è un prodotto eccezionale",
                "reviewText": "È un piacere da usare. Ci vogliono alcuni giorni per adattarsi ed avvantaggiarsi della superiore velocità di scrittura e precisione (finché non si capisce l'esatto punto di key pressed). Non è silenziosissima (ma neanche fastidiosamente rumorosa come la versione Blue).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ketan sheth",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 25, 2015",
                "reviewTitle": "Five Stars",
                "reviewText": "It is really professional. AMAZINGLY SIMPLE TO USE.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}