{
    "remaining_requests": 41547,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Redragon-K596-Mechanical-Keyboard-Switches/dp/B0CNGK1FZ1",
    "body": {
        "name": "Redragon K596 PRO RGB Mechanical Gaming Keyboard, 5.0 BT/2.4 Ghz/Wired Three Modes, 87 Keys TKL Compact Keyboard w/Durable Battery, 10 Onboard Macro Keys & Wrist Rest, 10H Play Time, Red Switches",
        "price": "$64.99",
        "originalPrice": "",
        "rawPrice": 64.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Redragon-K596-Mechanical-Keyboard-Switches/dp/B0CNGK1FZ1",
        "soldBy": {
            "sellerID": "A2FK9EP27A6ZE6",
            "name": "Redragon Shop",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2FK9EP27A6ZE6&asin=B0CNGK1FZ1&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQK13LG4"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CNGK1FZ1",
                "variationName": "Size",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41xgbKjjGXL._SS36_.jpg"
            },
            {
                "asin": "B07Z577SBT",
                "variationName": "Size",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41b6PuZJs1L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "Brown Switch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CNGK1FZ1",
                "variationName": "Style",
                "variationValue": "Red Switch",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41xgbKjjGXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41NXxxKa0XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lkx-EflNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qLgbDQNjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HhjodwvmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wWT7-p3eL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IFJNwzoFL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Redragon Store",
            "link": "https://www.amazon.com/stores/REDRAGON/page/C9D23970-BAEE-41FD-9E1B-F6B3A3B895ED?ref_=ast_bln"
        },
        "brand": "REDRAGON",
        "merchantInfo": "Redragon Shop",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1141,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Wednesday, February 14. Order within 11 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "3-Mode Connection - Geared with Redragon advanced tri-mode connection technology, USB-C wired, BT 3.0/5.0 & 2.4Ghz wireless modes which make the user experience upgraded to another level in all fields.",
            "Made for Gamer - 10 key-less design with added macro keys and dedicated media keys makes the keyboard ultra-compact and portable. Saves space in any setup and ideal for minimalistic desk setups. Included wrist-rest supports the wrist during long gaming marathons and clips to the keyboard with magnets.",
            "Hot-Swappable Socket: With the quiet mechanical stock red switch, linear and soft key travel makes every click easy to register. The upgraded hot-swappable socket fits with almost all other switches out there, both compatible with 3/5 pins switches, just enjoy the modding fun.",
            "Programmable Macros - Dedicated macro-keys are easily programmable. Macro can range from just one key to several keys. 5 macros close to WASD for easy access and 5 more on the top allows for 10 different and unique macros.",
            "Ergonomic Wrist Rest - Manufactured for wrist care, which is a good accessory for someone who using computer and typing frequently. This fatigue buster helps you keep online dusk till dawn!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "17.72 x 1.97 x 6.69 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.87 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Redragon"
            },
            {
                "name": "ASIN",
                "value": "B0CNGK1FZ1"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "K596"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Polymer batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,141 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,259 in Video Games (See Top 100 in Video Games) #988 in PC Gaming Keyboards"
            },
            {
                "name": "Date First Available",
                "value": "November 16, 2023"
            },
            {
                "name": "Brand",
                "value": "Redragon"
            },
            {
                "name": "Compatible Devices",
                "value": "PC/Laptop"
            },
            {
                "name": "Connectivity Technology",
                "value": "BT 5.0, 2.4Ghz Wireless, USB-C"
            },
            {
                "name": "Keyboard Description",
                "value": "80% TKL Wireless Gaming Keyboard"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Everyday Use"
            },
            {
                "name": "Special Feature",
                "value": "Volume Roller, Wrist Rest"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Number of Keys",
                "value": "92"
            },
            {
                "name": "Style",
                "value": "Red Switch"
            },
            {
                "name": "Model Name",
                "value": "K596 TKL Gaming Keyboard"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "RGB Side Lights In addition to the 18 RGB modes for the main keys, there are 5 modes of RGB side edge lighting. Angled down and to the side, they will dazzle up your desktop! 80% TKL Design Enjoy the freedom to move your mouse and position your keyboard with compact tenkeyless design, for saving desktop space and maximize in-game performance..",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e083023c-2ad6-4d6b-bbd5-fcdbff142b8f.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b99bcdf1-de3f-42b7-a18d-45e4536ef185.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/971bda46-919b-47d5-b9e5-37e5f1a08d50.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e083023c-2ad6-4d6b-bbd5-fcdbff142b8f.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b99bcdf1-de3f-42b7-a18d-45e4536ef185.__CR0,0,650,350_PT0_SX650_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "caroline",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDNHUUDCHUQC7YWFWDYDZZBCMNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QNILS3L5TK6K?ASIN=B0CNGK1FZ1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars very comfortable to use",
                "reviewText": "The hand rest is very comforting when speeding through the keys strokes. The keys have an indentation that cradles the finger tips and allows for precise centering. The key lights are adjustable and clearly viewed. The F and J key have a slightAll I can say is this was an excellent purchase. Arrived very fast, pricing was excellent on Amazon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Family Bee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2K2PLE47IF6C2C7GW46QWQA7OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R289AZLCHEY4H5?ASIN=B0CNGK1FZ1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2021",
                "reviewTitle": "5.0 out of 5 stars Great for the price. Sturdy.",
                "reviewText": "If you're looking for a gaming keyboard to compare this to as far as looking feel the closest I can think is the Corsair K65, even down to the textured spacebar. But there are a lot of differences. Macro keys are great, programming isn't too difficult and the fact that it costs less than half the price, are the big stands out. It's well-made and heavy even to have so much plastic, but it's not cheap plastic. Outemu switches aren't CherryMX, but optical is impressive. Switches are also hot swappable, which is pretty much a necessity in a gaming keyboard. Customer support is good, as usual, and while the software is in its infancy for a new model keyboard, I'm sure it will come along like other Redragon products. And we do have quite a few. The wireless adapter even works with some of their other more modern items like mice so you can have a spare. It's too new to comment on battery life at this point, but you can use it with the cable or without. NKRO is here, along with lots of options for lighting. I wish I could be a bit brighter or more color variation. They do need more \"off\" settings for underglow etc.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6NKYSRRSRUGGUG5W3YFP2772XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ0EU1BKUQP7L?ASIN=B0CNGK1FZ1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 16, 2021",
                "reviewTitle": "4.0 out of 5 stars Decent board with mushy switches",
                "reviewText": "Linear switches are my favorite. Of the ones I’ve tried, Gateron reds are tops, and Cherry reds are pretty good. The Outemu reds in this board are...subpar. They’re mushy and typing/gaming with them is just...meh. I also don’t like the row of G macro keys on the left. I keep accidentally hitting G5 instead of control.Those are the bad parts. The keyboard is otherwise pretty good - no noticeable input lag in wireless mode, nice RGBs, low cost. But man, I wish this thing had Gateron reds.I’ve read this board will only take Outemu replacements, but I’m gonna try and see if I can swap some gaterons into it.Edit: A few updates after having this board for about 6 months. The board does only hotswap with other Outemu switches, so you're limited to Outemu and Gazzew branded switches. You can also pinch the pins on Gaterons, for example, to try to make them fit, which some people have been successful with. I bought a handful of Gazzew Bobagum linear silent switches to replace the switches I use the most while gaming and they work just fine.That said, the Outemu reds don't bother me as much as they once did, but they're still pretty mushy and the pinging is extra obvious when paired with the Bobagums.Now, the main reason I'm writing this edit. My board stopped charging a few weeks ago. I tried several things to no avail and contacted Redragon customer support, expecting almost nothing considering this is a \"budget\" wireless board. They got back to me quickly and replaced my board with no hassle whatsoever. I was legitimately shocked; so much so that I'm raising my rating by 1 star (from 3 to 4). Still docking 1 star for the mushy, pingy Outemu reds though.Edit #2 - 9-7-2023: Editing this review again to say that I decided to mod it for funsies, and man, I can't believe this is a Redragon board anymore (no shade to Redragon, but this is a budget board). First off, Akko switches fit Outemu sockets, so I replaced the nasty Outemu reds with Akko crystal blues that I hand lubed, filled the bottom of the case with poron foam, tape modded the PCB, and put sound dampening foam between the PCB and the plate. I attempted to replace the stabilizers with Durock v2's, but it just totally didn't work - they all stuck pretty badly. Maybe a plate tolerance issue caused warping or something. Anyway, I just tape modded the stock stabs instead, and finished the whole thing off with PBT pudding keycaps. The board now sounds and feels INCREDIBLE. Deep (not the deepest, but deep!) thocky keypresses as opposed to the mushy, pingy Outemu reds in the hollow stock board. Now, I doubt many people reading this are going to put THIS much effort into a budget board, but just know there's a lot of potential! At the very least, you can pick up $30 of Akko switches to replace those awful Outemu switches.And by the way, since I originally wrote this review, I've acquired/tried many more keebs and switches (KiiBoom rose pink, Akko crystal blue, Ranked water ballets, Epomaker Wisterias, Gateron Ink Reds, and Philikey yellows) and Outemu reds are still the most embarassingly bad switches I've ever tried by a huge margin.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Syd Micheal",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH56YKJ3VEBR3ORCZXTWSTHKHSGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ8QTA4DA7YGA?ASIN=B0CNGK1FZ1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2020",
                "reviewTitle": "5.0 out of 5 stars Fantastic!",
                "reviewText": "A great keyboard! The clicking is satisfactory, but not too loud to disturb family. The colors are great, and the macro buttons are nice. They're not \"fully\" customizable, you have to download the software, but you can accomplish almost anything, especially if you add in AHK or something. This one met all my specs perfectly: One row height enter key, full size backspace key, dedicated media controls. The volume wheel wasn't on my list, but after having it I can comfortably say I'll never get another keyboard without it. It's SO convenient.As for the negatives, I only have two small issues. The macro buttons on the left side kind of throw me off: I learned after having this keyboard that I align my left hand with the bottom left ctrl key when not looking, and they macro keys on the left cause me to have to realign my left hand occasionally. You get used to it after a while, but it's something I didn't think of before. Lastly, I was hoping that the usb dongle would be compatible with a Red Dragon mouse as well (just to save a USB port) but this is NOT the case. For anyone else curious. I have the Sniper Pro (M801).EDIT: Almost 1 year later. I still love the keyboard. I've had a few.. glitches? Some of the keys periodically would seem to stick or not send the keystroke, but would right itself eventually. That's likely the switches, which I could change. The two bigger problems were volume related. I LOVE the volume slider wheel, and it worked perfectly when plugged in. When wireless, which I didn't use much, a few times the volume would jump like, 30 (out of 100 on Windows). So it would get super loud or just mute. There was no indication or anything, and it only happened when using the keyboard in wireless, so that was just kind of an oddity. The more frustrating thing is the dedicated media buttons. The Play/Pause button, maybe 5% of the time, would actually skip forward (or backward) instead of pause. I'm a big media user, so this was very frustrating. I contacted support, who understandably took me through the typical troubleshooting, before sending me another one, which was amazing of them.So overall, despite the issues, I'm keeping it as 5 stars. It's the only keyboard that satisfies all of my needs: Media buttons and volume slider, tenkeyless, wireless capabilities, and extra macro buttons.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JUAN CARLOS ROBLEDO MORALESJUAN CARLOS ROBLEDO MORALES",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 27, 2023",
                "reviewTitle": "Envían el Broadsword K588 (que no es inalámbrico)",
                "reviewText": "Mandan el modelo K588 Broadsword no el K596 Visnu que es el que anuncian, asi que mucho ojo!!!!Físicamente el K588 y el K596 son idénticos, pero con la \"ligera\" diferencia que NO ES INALAMBRICO, entonces todo lo que ponen en la descripción de las 10 horas de batería y la multi-conexión inalámbrica pues esta mal, ojala lo puedan corregir para volverlo a pedir ya que en verdad quiero el modelo K596 que anuncian.|Yo por mi parte quede super mal, ya que era un regalo, afortunadamente me ayudaron a resolverlo, aunque perdi todo el tiempo del envió.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61y10EBtAfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61oXUycno0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61e1D46AzhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fabian MontanaFabian Montana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 2, 2024",
                "reviewTitle": "draadloos keyboard",
                "reviewText": "I`ve bought this after watching a review on youtube. I wanted to buy a wireless keyboard which was not too expensive ( like not above 100 euros).After a couple off days learning how it works I'm really happy with it. Connectivity is really good on a usb connection. The battery life is good so you don't need to recharge it daily .I could really recommend this keyboard.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/818QK6TfVvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paulo SegundoPaulo Segundo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on April 1, 2021",
                "reviewTitle": "Erro no tipo do produto",
                "reviewText": "Gostei bastante do produto, só fiquei chateado pois comprei o modelo Ansi e me foi entregue o Abnt2. Não devolvi pois estava precisando com urgência. E o modelo Ansi, pelo qual paguei, estava mais caro que o abnt2.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91W0qLIHXVL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "attilio b",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 28, 2023",
                "reviewTitle": "stupenda",
                "reviewText": "facile la configurazione delle macro, da capire tutti i tasti funzione5 stelle",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A User",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2021",
                "reviewTitle": "solid built, easy to use",
                "reviewText": "Update: Now had this for a year and used daily 8hrs+ a day (not constantly typing) the battery lasts about a week. I do turn off the little switch on the bottom at the end of the day. It is small but hasn't failed. Only thing I would change, it would be nice to be able to buy one with brown switches.Only one month in with this keyboard, but positive first impressions:- Its definitely heavy, expected with a built in rechargeable battery.- key feel is pretty good. I've been using a logitech K120 previously.- Its very colourful but I've been using it with the lights low bright \"breathing effect\" to get better battery life, (lasted well over a week with regular daily use).- I was able to program the macro keys directly on the keyboard, no software required.Some Cons:- I'm using it in linux so software to setup the colours, macros doesn't appear to be available.- The key markings are dark and hard to read unless you have the lights on. The font is a bit strange as well.- The edge of the spacebar seems a bit to sharp, it could be rounded on the bottom edge more.- on / off switch on bottom, very small, hoping it lasts.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}