{
    "remaining_requests": 41674,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wireless-EarlyLit-Full-Sized-Ergonomic-Adjustable/dp/B0C6P686SX",
    "body": {
        "name": "Wireless Keyboard and Mouse Combo,EarlyLit 2.4G Full-Sized Ergonomic Keyboard Mouse,3 DPI Adjustable Cordless USB Mouse and Keyboard,12 Shortcut Keys and Quiet Click for Computer/Laptop/Windows/Mac",
        "price": "$20.99",
        "originalPrice": "$25.99",
        "rawPrice": 20.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wireless-EarlyLit-Full-Sized-Ergonomic-Adjustable/dp/B0C6P686SX",
        "soldBy": {
            "sellerID": "ADLS5IWJGR4K0",
            "name": "EarlyLit",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ADLS5IWJGR4K0&asin=B0C6P686SX&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CDNJJY3K"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/417IuJXf6YL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51LG4e6cU L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d-NsZq8BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515pJc7g3KL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RcVlQJuZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AzNkEwKCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1CKmKEUwPL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8f7fd027-1c01-42e9-a574-fe93316b82f5/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02a802cd-6323-4f79-a5f6-01e9e7d06873/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/912f8bed-5f19-4d40-a243-92e5ece535fc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3c2fd7fb-db16-429e-aa15-1a5322c4c741/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34b7ad0f-0ac2-47ce-a8e4-89f90e80f426/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3e9d0dd3-f5e0-41d0-a53d-a74057113efd/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/96c24566-f799-4e38-9440-9a286451b31e/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91hj7esLiRL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/B1HWH0WfwpL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the EarlyLit Store",
            "link": "https://www.amazon.com/stores/EarlyLitDRIVESLIFEBYTECHNOLOGYYOUTHINSPIRATIONPASSION/page/1DB6BE77-9469-442D-9276-3810378A8E2E?ref_=ast_bln"
        },
        "brand": "EarlyLitDRIVESLIFEBYTECHNOLOGYYOUTHINSPIRATIONPASSION",
        "merchantInfo": "EarlyLit",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 308,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 17 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Work Anywhere With Wireless Plug and Play】 Enjoy the convenience of 2.4G wireless tech, don't let another cord get tangled in. Simply insert the USB receiver(INCLUDED in mouse’s battery compartment) into your computer and you're on your way. This keyboard and mouse wireless combo tracks every movement with super-fast 2.4 GHz wireless connection, and never worry about delays or dropouts! Thanks to the wireless range of 33 feet, you can enjoy a clutter-free workspace and work from anywhere!",
            "【Full-size 104-Keys and 12 Independent Shortcut Keys】-- With Standard US QWERTY layout and 12 independent shortcut keys, EarLit wireless keyboard makes working more efficient ,and each key on the number pad is well-spaced, greatly avoiding pressing the wrong key. The foldable stand behind the keyboard provides a comfortable typing angle for you, so you can enjoy comfortable typing for hours.",
            "【Silent Optical Mouse with 3-level DPI 】This computer mouse is exquisite and compact, and provides whisper silent click, no need to worry about disturbing others to rest while in use. This DPI adjustable mouse provides 3 levels of DPI (800/1200/1600) to meet your different needs in terms of sensitivity. This optical mouse can also smooth movement even on smooth surfaces. In addition, this wireless mouse is symmetry design, both hands are available, suitable for all people.",
            "【Smart Power Saving Extends Battery Life】-- Keyboard and mouse wireless have power switch to turn on/off, saving unnecessary battery loss. After 10 minutes of inactivity, the wireless keyboard mouse combo will automatically go into sleep mode to save energy,and you can move the mouse or click any button to wake them up. The keyboard requires one AAA battery, and the mouse requires one AA battery(Note: battery not included in the package).",
            "【Splash-proof Design Keyboard】 ABS injection molded, stable structure, non-toxic and odorless. Light matte surface treatment technology cares for your fingertips. The panel has built-in a waterproof conductive membrane and multiple drainage holes for double protection. Just shake the keyboard, and the liquid can be smoothly drained out. From now on, you don't need to worry about your cat knocking over drinks on your keyboard again.",
            "【Broad Compatibility for Most Devices】--This 2.4 GHz wireless mouse and keyboard Combo has built-in adaptive frequency technology, and works seamlessly with Windows XP / Vista / 7 / 8 /10, Mac OS, Chrome OS, and Linux-based operating systems. Instantly connect to your MacBook, iMac, desktop, laptop, PC, or other devices. Whichever team you're on, you're sure to win with this high-performance Wireless Keyboard and Mouse Combo.",
            "【Exclusive Lifetime Warranty Service】 EarlyLit has always been committed to serving every customer well. No matter what problem you encounter, please feel free to contact us to find a satisfactory solution. We provide 24 month warranty and lifetime support as long as it is a product purchased from our store. Contact Detail: Click the store name behind \"sold by\" and click the \"Ask a question\" button to open the contact channel."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboard & Mouse Combos",
                "link": "https://www.amazon.com/Computer-Keyboard-Mouse-Combos/b?ie=UTF8&node=1194464"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "17.24 x 5.87 x 0.87 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.61 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0C6P686SX"
            },
            {
                "name": "Item model number",
                "value": "CK230G"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 308 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28 in Computer Keyboard & Mouse Combos"
            },
            {
                "name": "Date First Available",
                "value": "July 9, 2023"
            },
            {
                "name": "Manufacturer",
                "value": "EL"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "EarlyLit"
            },
            {
                "name": "Color",
                "value": "Pure Black"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless ,Nano USB"
            },
            {
                "name": "Special Feature",
                "value": "Quiet Clicks;Independent Hotkeys; Smart Power-Saving and Independent Power Switches, 104-Keys Full Size;Low porfile and Compact Design; 7Day/24H's Service Support See more"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, Gaming Console, Personal Computer"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "EarlyLit 2.4Ghz Wireless Keyboard and Mouse Combo--Compact,Comfortable ,High Performance, High Efficiency Powerful Features Make the EarlyLit Wireless Keyboard and Mouse Combo the Best Choice Low-profile Comfortable Wireless Keyboard Mouse Combo -- This wireless keyboard and mouse combo, offer a traditional QWERT layout and FULL-SIZED KEYBOARD and ADDITIONAL 12 MULTIMEDIA HOTKEYS, which means no leaning curve involved, you will enjoy the comfort and simplicity from familiar keyboard layout since the first day. Come with a slim and precision mouse, allow you to stay productive and comfortable for a long time.Ergonomic Design Keyboard and New Added Hotkeys -- This wireless keyboard is designed with a 8° tilted angle foldable stands, help you reduce the wrist fatigue and pressure, keep your hand to be comfortable, enhance productivity. 12 FN +12 New Added MULTIMEDIA HOTKEYS for you to quick-access to the email, the internet, favorite website, music and movies.Multifunctional Efficient Mouse -- 2.4G wireless mouse with high precision and 3 adjustable DPI level: 800/1200 /1600. Whisper left and right buttons reduce noise by more than 90% and make your control smoother and quicker. A compact, low profile design is also perfectly contoured for the shape of your hand.2.4GHz Wire Free Connection for Plug and Play -- The keyboard and mouse wireless share with ONE SAME USB RECEIVER , release the USB ports, help you get rid of that haven't enough USB ports to use. The wireless mouse and keyboard work stable within 33feet /10m and you just need plug usb receiver into your laptop, No Delays! USB RECEIVER IS STORED IN BATTERY COMPARTMENT OF THE MOUSE.Anti-Splash & Sweat Design -- The ergonomic keyboard and mouse wireless combo was made with a skin-friendly, anti-sweat and anti-splash material.The texture on both sides of the mouse and anti-splash/sweat material were designed to help you hold the mouse comfortably and keep you typing easily,Never to be worried about spilling coffee on your keyboard, which mostly enhance your working efficient.Independent Switches and Smart Power-Saving Mode after 10 Mins Idle -- Keyboard and Mouse wireless have power switch to turn on/off, saving unnecessary battery loss. After 10 minutes of inactivity, the wireless keyboard mouse combo will automatically go into sleep mode to save energy, and you can move the mouse or click any button to wake them up. The keyboard requires one AAA battery, and the mouse requires one AA battery(Note: battery not included in the package).Widely Compatibility & Lifetime After-sales -- This wireless keyboard and mouse is compatible with Windows XP /Vista/7/8/10/11,Linux, Chromebook, and Mac OS. If you have any question, please connect us !(Note: The HotKeys may not work for MAC OS for the System Reasons.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f187111-b2d4-4b73-b399-f1ba2453cb72.__CR0,0,970,600_PT0_SX970_V1___.jpeg"
                ]
            },
            {
                "media_text": "Sleek design and Ergonomic Structures Makes the Mouse and Keyboard Comfortable for ALL-Day-Long Work Super Comfortable Keyboard and More Suitable Wireless Mouse for Most Users Comfortable Typing Experience-- computer keyboard The bottom of the keyboard is equipped with foldable feet, allowing you to adjust the most comfortable typing angle.With the soft key stroke, the keyboard offers smoother touch. Besides, you will feel the keyboard more responsive that’s easy on your fingers and has no input errors. Slim & Portable Design-- wireless optical mouse Wireless mouse adopts slim and symmetrical design, suitable for right or left hand. Moreover, the thinness makes the mouse easier for picking and moving, especially for kids.If you often need to travel or work away from home, EarlyLit portable mouse is a good choice for you. Easily fits into a backpack and take around. Instruction Take out the keyboard and mouse from the box, and take out the receiver from the mouse battery compartment;Insert a 1.5V AAA dry battery into the keyboard with the correct polarity;Insert a 1.5V AA dry battery into the mouse with the correct polarity;Insert the receiver into the USB port of the computer;Wait for the computer to automatically install the driver and start using it.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d258a5a4-5648-44cb-9932-fd034f91531b.__CR0,0,970,600_PT0_SX970_V1___.jpeg"
                ]
            },
            {
                "media_text": "Smooth Typing and Ultra Quiet Structures Help Reduce the Disturb The keyboard and mouse adopts quiet and soft designs to avoid disturbing the near Colleagues or Family Members",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e04a91b6-daad-4bca-938f-52839ca20b58.__CR0,0,970,300_PT0_SX970_V1___.jpeg"
                ]
            },
            {
                "media_text": "The Ergonomic Keyboard With Kickstands and Smart Indicators Provides Quiet and Precise Typing Experiences Ergonomic Design Our wireless keyboard is designed with a foldable kickstand and a non-slip and sweat-resistant textured wrist rest that takes the pressure off your wrist. The mouse is also ergonomically designed to give you a comfortable experience. Comfortable &Precise Typing Every key of the ergonomic keyboard is fast responsive and tactile, which is also comfortable and easy to type, giving you come a good experience of use. Bright Indicator Light There are 3 LED lights which can help you check whether your Num/Caps locks are enabled or not, and when its battery is running low, the battery indicator will flash to remind you of replacing battery in time.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d65d03f-49c9-4a3f-9d18-94498f0c235b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90e6e6c4-db2c-470f-8b9b-f37925d96d81.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72829f16-ad5d-4105-968d-f192af5d6c67.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "The Optical Mouse With Ergonomic Design and Powerful Functions Meets All your Need 3 ADJUSTABLE DPI(800/1200/1600) This DPI adjustable mouse provides 3 levels of DPI (800/1200/1600) to meet your different needs in terms of sensitivity. This optical mouse can also smooth movement even on smooth surfaces. 4-Button Mouse Meet All The Needs The 2.4Ghz USB receiver is in the bottom of the battery compartment. This computer mouse is exquisite and compact, and provides whisper silent click In addition, this wireless mouse is symmetry design, both hands are available, suitable for all people. Delicate And Portable Mouse The ergonomic mouse can be used by right hand or left hand. The slim design makes it more comfortable and portable.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a752478-85bd-4adb-a27a-3ea9c9c37307.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3e78112-758a-467f-a5f9-9544e35603b7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97526263-8281-4b4d-aecc-044a0c873a83.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Important Instructions You may Need to Know How does the Power Indicator Work ? After the new battery is put into the keyboard and mouse: 1. If the connection goes normally with the computer, the power red indicator will flash 5-8 seconds and then off, the computer will working normally. 2. If the computer is not normally connected with the keyboard, the power red indicator lights on for a long while to indicate you and then off. 3. When on Low battery mode ,the Power Red Indicator will flash when you press any key . So when you first start using, the power red indicator keeps flashing for 5-8 seconds is normal. The Keyboard/Mouse Response Is Delayed and Works Abnormally, How to Solve It? 1. The battery may be low, please replace the battery for the keyboard/mouse. 2. It may be caused by the computer being stuck, please restart the computer and try again. 3. The maximum use distance of this product is 33ft, please keep it within 33ft. 4. And be sure there are no metal obstacles between the keyboard/mouse and the receiver.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/828e5e16-943d-44d6-a243-e1a4f04ffb4c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Tips: Solution to Connection Exception Keyboard 1. Take out the battery and USB receiver, reload the battery and plug the receiver into the computer. 2. Turn on the keyboard switch, which should be within 20cm away from the receiver. 3. Press and hold the keyboard “ESC” + “K” keys together to pair again. Mouse 1. Take out the battery and USB receiver, reload the battery and plug the receiver into the computer. 2. Turn on the mouse switch, which should be within 20cm away from the receiver. 3. Press and hold the Right button and Scroll button together to pair again. Note:If the solution doesn’t help, repeat the steps to pair again. If still fail, please contact our service team.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3b7304d-e827-4dd6-8f70-eb69ada6aa38.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7f187111-b2d4-4b73-b399-f1ba2453cb72.__CR0,0,970,600_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d258a5a4-5648-44cb-9932-fd034f91531b.__CR0,0,970,600_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e04a91b6-daad-4bca-938f-52839ca20b58.__CR0,0,970,300_PT0_SX970_V1___.jpeg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4d65d03f-49c9-4a3f-9d18-94498f0c235b.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/90e6e6c4-db2c-470f-8b9b-f37925d96d81.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72829f16-ad5d-4105-968d-f192af5d6c67.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a752478-85bd-4adb-a27a-3ea9c9c37307.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3e78112-758a-467f-a5f9-9544e35603b7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/97526263-8281-4b4d-aecc-044a0c873a83.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/828e5e16-943d-44d6-a243-e1a4f04ffb4c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e3b7304d-e827-4dd6-8f70-eb69ada6aa38.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZEN436NGH7KCPG3GN75KDANNRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S4I7REI6PWAT?ASIN=B0C6P686SX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Functions as expected. Nothing special.",
                "reviewText": "Easy to set up. This combo does what I expected, nothing more, nothing less. As far as battery life or durability, haven't used it enough to really say.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob in Denver",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHSKTYQLL6O47PGUT7WB6I65B5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QEBZZ3MXH2KV?ASIN=B0C6P686SX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars great value!",
                "reviewText": "Shape is blocky, so just a bit different than my warn out logitec keyboard/mouse combo. very very quiet keys and mouse keys. I like that. Good quality for the price. Signal seems 100% with no delay. Its a good value. great buy!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DeputyDog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA6ZVYLUACJPCUZQINRQV2LRM4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHB55L1VTJTVU?ASIN=B0C6P686SX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice keyboard and mouse",
                "reviewText": "I purchased the wireless keyboard and mouse for work for the purpose of removing all the wires, which this was an absolute plus. So far the keyboard and mouse have functioned perfectly. The only issue I have with the keyboard is the lighting on the caps lock. It’s very dim and I have to place my hand over the section on the upper right hand side of keyboard to see if my caps is on or off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "step12dude",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELESZMW3NWGUAIOMMI53IQWP2EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZLG8K0G8QKRQ?ASIN=B0C6P686SX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Keyboard / Mouse Set",
                "reviewText": "I needed a wireless keyboard and a mouse for a backup computer I use at home. I needed nothing fancy - just something that worked - so I bought this set based on price. But I was so pleasantly surprised with the feel of the keyboard and the mouse that I ordered a second set for my primary computer to replace the older Logitech keyboard and 3rd party mouse that i was previously using.This is a great keyboard/mouse set for the price. HIghly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angry mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLFKBX3P6ZBRAFFA35MPVTDYNYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CH6GT5P8G95T?ASIN=B0C6P686SX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome choice",
                "reviewText": "Works great and easy to setup.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raymond L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSHKX3HTF3HCELIOOYYPNEECAYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R76FE1VWRCOTW?ASIN=B0C6P686SX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Very quite",
                "reviewText": "Love the key board. Only took a few minutes to get use to the key placement. Would buy again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Simmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG55UERFYNNIKWVIRY2Z2AFV3VQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E1ZO6N5Y9MFA?ASIN=B0C6P686SX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Cheap Price and still not worth it-Don't bother purchasing",
                "reviewText": "Both this keyboard and mouse were pieces of junk. Keys kept getting stuck while typing, the keyboard legs fell off and the mouse would not connect unless you took action.Not even worth the gas taking it to the ups store to send back--so I just smashed it against my desk. That at least gave me some satisfaction****UPDATE*****10/28 After this review posted, the seller contacted me to resolve the issue. Even though the return window had closed, they still at their expense had a replacement keyboard sent out from Amazon. I was not expecting it, but they proved they care about the customer above and beyond what's expected. The replacement keyboard seems to work fine, so I am updating here and changing my rating. I appreciate good quality customer service as much as anyone, especially these days.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIJVAQAQU4BIJD6IYYPI4MPG2KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4BRACR50OKPI?ASIN=B0C6P686SX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Products & Customer Service",
                "reviewText": "Everything is grand. Had a problem with mouse and their Customer Service Rep, Sally, sent a new set up immediately. Would definitely recommend this company. A plus service.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}