{
    "remaining_requests": 41836,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-920-002478-K120-USB-Keyboard/dp/B003ELVLKU",
    "body": {
        "name": "Logitech K120 Wired Keyboard for Windows, Plug and Play, Full-Size, Spill-Resistant, Curved Space Bar, Compatible with PC, Laptop - Black",
        "price": "$11.99",
        "originalPrice": "$21.03",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-920-002478-K120-USB-Keyboard/dp/B003ELVLKU",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C8V9SRSC"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31aaVBPTwdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41WiYXfBFPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41dg 2QhewL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jOp333oiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KeI9P9PZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4125l1E4LYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41067ClWJbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/91Y-D7SsGKL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91Y-D7SsGKL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 6431,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Saturday, February 17 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 14. Order within 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "All-day Comfort: The design of this standard keyboard creates a comfortable typing experience thanks to the deep-profile keys and full-size standard layout with F-keys and number pad",
            "Easy to Set-up and Use: Set-up couldn't be easier, you simply plug in this corded keyboard via USB on your desktop or laptop and start using right away without any software installation",
            "Compatibility: This full-size keyboard is compatible with Windows 7, 8, 10 or later, plus it's a reliable and durable partner for your desk at home, or at work",
            "Spill-proof: This durable keyboard features a spill-resistant design (1), anti-fade keys and sturdy tilt legs with adjustable height, meaning this keyboard is built to last",
            "Upgrade to Logitech K270 Wireless Keyboard: Experience wireless freedom with K270, featuring 2-year battery life, plug-and-play simplicity, and reliable hassle-free wireless connection"
        ],
        "description": "With comfortable, quiet typing, a sleek yet sturdy design and a plug-and-play USB connection, the Logitech Keyboard K120 gives you a better typing experience that's built to last. System Requirements: Windows XP Windows Vista Windows 7 Windows 8 Windows 10|USB port|Linux kernel 2.6+",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "RAM",
                "value": "‎4 GB"
            },
            {
                "name": "Wireless Type",
                "value": "‎2.4 GHz Radio Frequency"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Series",
                "value": "‎Slim Corded Keyboard"
            },
            {
                "name": "Item model number",
                "value": "‎920-002478"
            },
            {
                "name": "Hardware Platform",
                "value": "‎PC"
            },
            {
                "name": "Operating System",
                "value": "‎Windows 8, Windows 7, Windows 10"
            },
            {
                "name": "Item Weight",
                "value": "‎1.62 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎0.92 x 17.7 x 6.1 inches"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎0.92 x 17.7 x 6.1 inches"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Number of Processors",
                "value": "‎1"
            },
            {
                "name": "Computer Memory Type",
                "value": "‎SDRAM"
            },
            {
                "name": "Power Source",
                "value": "‎Corded Electric"
            },
            {
                "name": "Department",
                "value": "‎Keyboards/Input Devices"
            },
            {
                "name": "Manufacturer",
                "value": "‎Logitech"
            },
            {
                "name": "Language",
                "value": "‎English"
            },
            {
                "name": "ASIN",
                "value": "‎B003ELVLKU"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Date First Available",
                "value": "‎August 3, 2017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 6,431 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,205 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #8 in Computer Keyboards #46 in Climate Pledge Friendly: Computers"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop"
            },
            {
                "name": "Connectivity Technology",
                "value": "wired"
            },
            {
                "name": "Keyboard Description",
                "value": "QWERTY"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Home, Work"
            },
            {
                "name": "Special Feature",
                "value": "Spill Proof, Spill Resistant"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "Single Color"
            },
            {
                "name": "Style",
                "value": "Keyboard"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us A Swiss company focused on innovation and quality, Logitech designs personal peripherals to help people enjoy a better experience with the digital world. We started in 1981 with mice, which provided a more intuitive way of interacting with a personal computer. Since those early days, we have expanded our expertise in product design beyond the computer mouse, with a broad portfolio of interface devices that are the 'last inch' between you and your computer or your console game, digital music or home-entertainment system.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/f04747b3-89c0-48ed-be37-9d4b41d1f25d._CR0,0,302,302_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/f04747b3-89c0-48ed-be37-9d4b41d1f25d._CR0,0,302,302_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joe Tairei",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSTEJYJ2QVXJ5WQ5S47LY3PVG4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMY6FNTU6KIKQ?ASIN=B003ELVLKU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 4, 2011",
                "reviewTitle": "5.0 out of 5 stars A good, basic, standard PC keyboard",
                "reviewText": "I am a touch typist and computer programmer who spends all day in front of a computer, and I'm picky about my keyboards. When my previous SIIG wireless keyboard began to get flaky, I tried a Microsoft wireless keyboard and mouse, because in the past I've always liked their design. Unfortunately, the keyboard turned out to be weird, with sunken function keys, no spacing between key groupings, and not enough tactile feedback. The mouse is excellent and I've kept that, but I've swapped the execrable keyboard for the inexpensive but nearly perfect Logitech K120.I avoided Logitech in recent years because some foolish person in their product design department decided to squish the central keypad down from 3 to 2 keys per row, so that the traditional Insert-Home-PageUp, Delete-End-PageDown that IBM taught us to love back in the '80s became three rows of Home-PageUp, END-PageDown, Insert-Delete or some such nonsense.Fortunately, it appears that Logitech came to their senses and restored the layout that customers are used to. It goes to show that a company should listen to its customers and not ram a change down everyone's throats.Anyway, the K120 has brought Logitech back to where they should be--a really good, straightforward keyboard that just works. All the keys and lights are in the right place. The keyboard is quiet, and the labeling is excellent--it's not glow-in-the-dark but the letters are large and white on black plastic so you can't go wrong. The function keys and keypads are nicely spaced and your fingers can find them without looking. The ESC key is easy to find, as well.Someone here complained about noise. Unbelievable! This keyboard is quiet. I've used quieter ones, admittedly, but this is about middle of the pack, not what I'd call a noisy keyboard at all. Try not hammering the keys like you're driving nails; you don't need to, and the keyboard (and your fingers) will last a lot longer.Someone else claimed the caps lock key was too easy to hit. Thus far, I've not hit it at all. It has just enough gap that your finger absolutely won't hit it if you're reaching for the \"A\". It just doesn't happen. I have large hands and I type very fast and so far, so good.All in all, this is a great keyboard for the money. I've bought two of them, in fact. Wireless keyboards are cool to look at, but nothing beats a traditional wired keyboard for performance and reliability.",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelique Fireheart ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKT4TNNOI6G2XAKVXO4DQETUTKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPUS1XE4GPR62?ASIN=B003ELVLKU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Keyboard!",
                "reviewText": "Flawless design. Amazing for use with work from home. Seamless ability to type. I had this one before but lost it in a move but I’m happy to have it again. Awesome product.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lilianne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV3C6XKCOIUT6MYSWSC4CU5XMUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3W4E7CFJQ55ZK?ASIN=B003ELVLKU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars It works eith rase",
                "reviewText": "I adore the fact that it’s easy to set up that it works simply and efficiently and the price can’t be beat",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Inspector Gadget",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFU7NX7QV3YIN4EJXUGNNBER4HIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18LIG7ZY8LAGR?ASIN=B003ELVLKU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2013",
                "reviewTitle": "4.0 out of 5 stars A very serviceable 104-key keyboard with a light touch",
                "reviewText": "The Logitech Keyboard K120 is very light in weight, typical of your rubber dome technology used beneath it's keycaps. This is a standard sized keyboard, roughly 2.2cm center-to-center spacing. It has very light keytouch, so if you are elderly, or if this is for a child, then finger strength requirements are minimal.LAYOUT 5: This is the standard 104-key layout. The full-sized Backspace, Tab keys and spacebar make for familiar typing. This is somewhat of a space-saving design, with minimal ridges around the sides and bottom corners of the keyboard. If you are a lazy wrist-rest like me, then your area of your palm below your left pinky will have you executing numerous <Ctrl><Key> sequences where <Key> is any key you happened to by typing at the moment where you inadvertently held down the <Ctrl> key. Cursor controls, Home-End and Page control keys are in their normal configurations so there is nothing new to learn. LEDs are bright for the 3 lock modes, and the 10-key pad is right where you expect it to be.LOOK 5: The letters are printed with bright white lettering and numbering, so it works well in typical office lighting.DURABILITY: 4 I cannot speak for this at this time as it has been in use only for short while. The first one ordered was dead upon arrival, not working on any PC into which it was plugged. This second sample has been flawless in its operation.FEEL 3: This is a rubber dome keyboard, so keypress force is light. If you are a strong typist then you will bottom out the keys with ease, which can actually slow you down. Even the Spacebar has the same tension as all of the other keys. For light key action the return speed on the keys is fast enough to satisfy all but the fastest of typists. Return speed is still higher on full mechanical switched keyboards.SPEED 4: I type 70 WPM, so this is a fast keyboard to me. To those typing faster, say near 90 WPM, this keyboard may force you to make mistakes or skip characters. Rubber dome atop a resistor network isn't the fastest recovering keys.STABILITY 4: This isn't a rigid keyboard, and it is easily twisted. However, for everyday use it may be fine. There are the typical flip-out tabs below the front of the keyboard allowing the user to incline the board. The rubber \"feet\" strips offer plenty of grip when the keyboard is new. However, they become slipperier as the keyboard ages and picks up a coating of dust. Cleaning these feet regularly will ensure the keyboard won't slide on you.SOUND 4; This is a silent keyboard. Rubber dome technology by design is quiet. There is minimal key rattle if a key is pressed hard and quickly released. With careful typing the user can keep sound levels below (<) 60 dB and as high as 70 dB if really pounding the keys, the latter which would be rare. This keyboard is rated on quietness being a desired feature.VALUE 5: An $11+ keyboard is well worth it as compared to mechanical keyboards which can cost >$100.CONCLUSION: Enthusiastically recommended. AN $11 Logitech Keyboard K120 is excellent both for home or office use. It is quiet, fast and very affordable. I will attempt to remember to do a longevity update in a year. Thank you for reading, and I hope this review is helpful to you.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ally",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM4TAJOQ3GCVRBS34VYC7N4X67Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28SVBUKMWAGJP?ASIN=B003ELVLKU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice keyboard! Would give 4.5 stars if I could",
                "reviewText": "I bought this keyboard with the corresponding silicone cover. It's great overall - and to be honest, the cover is what's keeping me from getting a higher-end gaming keyboard at the moment, as I've had my fair share of disgusting keyboards. It's not terribly loud (has some noise to it ofc, but I've dealt with louder keyboards for about half my life, so I don't mind). Probably not the best for gaming, and it's not the most ergonomic thing ever. I really, really wish there were media keys. Backlit keys would be a huge plus, since the cover makes the letters a little harder to see. Overall amazing for the price!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHG3Q3A32MH4MS2L7BGF7LEWIEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EJABRD7EZ6FJ?ASIN=B003ELVLKU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Love my new keyboard!",
                "reviewText": "It's a basic wired keyboard, but it's great. Keys are smooth... makes typing a breeze.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVOUZ474FWBS7M4IDNVHDSNMMAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAWJWR2ASD1XZ?ASIN=B003ELVLKU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Basic Keyboard - Perfect for My Computer",
                "reviewText": "My laptop computer needed a replacement external keyboard. I needed a very basic keyboard compatible with the computer. The keyboard was EXACTLY what I needed. It was delivered timely, was reasonably priced and works GREAT. Now my desktop keyboard is dying and it looks like I need to purchase another of these keyboards!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EGatzzz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7I2QXNK6EC7FGQU6H374SBZ3VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WO4U6K4A1YLR?ASIN=B003ELVLKU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Very sturdy build",
                "reviewText": "The quality of this keyboard is just what you’d expect from this brand. It makes a good “old school” click when you type. The height adjusters on the back a solid and perfectly designed. There are only two options for height and that is with the stands flipped out or just flat on the table.Great keyboard and at an amazing price from this brand!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kalaiselvan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 17, 2023",
                "reviewTitle": "Good quality",
                "reviewText": "Good quality",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jay N",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 26, 2019",
                "reviewTitle": "standard keyboard made for the modern computer user",
                "reviewText": "exceptional. Makes me type faster with less resistance. There is a much appreciated soft tactile mechanical key press sound, the space bar and the bigger buttons like return, enter for calculator keys produce a kluck sound while the other a laser like mechanical klick klack that you can \"feel\". Forget chicklet keys, or other keys or digital keys on iphones or on screen keyboards that I was using while waiting for this one as my old old keyboard 90's style just went dead and I was panicking. I was looking for a value budget keyboard, I don't know about the more expensive ones, I don't need led light up buttons or other fancy gimmicks on the keyboard, I was really considering this other microsoft keyboard in the same price range, Saw a video its got a calculator function button that you press and pop goes the microsoft calculator program, but after some days thought, I dont even use computer calulators that much, and there is a sound controlling function too, but appearantly I heard it just control windows media player, forget other players. Apple has the monopoly advantage over their computer systems, and its a good thing PC's aren't that monopolistic, I don't really feel for the chicklet keys spaced out on the apple keyboards, I have a asus netbook for my mom on which I am typing this review which has the chicklet keys, the key presses are so disturbing now that I found logitec, they don't inspire as much confidence as with the logitec, or maybe that the size of the keyboard is different, the netbood being smaller less confidence bulding while the logitec a standard size brings more confidence when typing, the logitec keyboard is one workhorse of a keyboard, each key press is like a rush or tornado and continuation to other key presses is like music, I like everything about it, its sleek, low profile there is the front raise things so its not flat, in addition each key is ergonomically designed, there is the concave convex subtle element which I think adds the perfect touch, makes it interesting, and the lettering is high contrast, placement of the lettering on the individual keys is good that its not too disatracting, on my netbood the letting is smack dap on the center of each key and well now I see that it makes a difference. the logitec is not disturbing, its very pleasant to type on to look at. its a standard keyboard made for the modern computer user.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge Bravo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 9, 2017",
                "reviewTitle": "Idioma",
                "reviewText": "Funciona bastante bien. Solo notar que el idioma del teclado esta en ingles. Para los que usan caracteres latinoamericanos, ojo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 30, 2018",
                "reviewTitle": "A true US-layout keyboard",
                "reviewText": "As an American living in Europe, I was missing the US-layout keyboard quite a bit. I tried buying one from Amazon Warehouse Deals, but was sent a rebranded UK keyboard, where the keys were no different other than having their buttons relabeled. I found this keyboard instead, and contacted the seller (Bonasus CE&HA). They assured me it was a true US-layout keyboard, so I bought it. It is exactly what I wanted/needed, a true US-layout and not some rebranded UK keyboard. It works great, mostly silent, and has a nice comfortable feel to it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yasu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on March 24, 2023",
                "reviewTitle": "シンプルで手頃",
                "reviewText": "フルサイズのUS配列のキーボードとして値段も手ごろで良かったです。高級なキーボードと比べるとキリがないですが、必要な要素は備えておりUS配列のボタン配置などと相まってシンプルで良いと思います。ボタン文字がシールで無ければ、さらに良かったです。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}