{
    "remaining_requests": 41735,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Redragon-Programmable-Hot-Swappable-Anti-Ghosting-Double-Shot/dp/B0CF3VGQFL",
    "body": {
        "name": "Redragon Mechanical Gaming Keyboard, Wired Mechanical Keyboard with 11 Programmable Backlit Modes, Hot-Swappable Red Switch, Anti-Ghosting, Double-Shot PBT Keycaps, Light Up Keyboard for PC Mac",
        "price": "$34.99",
        "originalPrice": "",
        "rawPrice": 34.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Redragon-Programmable-Hot-Swappable-Anti-Ghosting-Double-Shot/dp/B0CF3VGQFL",
        "soldBy": {
            "sellerID": "A2N5Q13T20FFT2",
            "name": "Redragon zone",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2N5Q13T20FFT2&asin=B0CF3VGQFL&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07554N4SH"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CF3VGQFL",
                "variationName": "Color",
                "variationValue": "RGB LED",
                "price": "$34.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41khzfsV4mL._SS36_.jpg"
            },
            {
                "asin": "B0C5XH23ZK",
                "variationName": "Color",
                "variationValue": "RGB QWERTY",
                "price": "$46.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41JKOe2HfXL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41khzfsV4mL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51yJgZBQ7ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rpmLxwDyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51S6-9VG-tL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gY2ZKhDfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51uYAu7fVRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51m2tgNi5-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/04251041-0dbf-4555-95af-3888de696ca9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/914c1c9c-1100-4cd5-885f-bc7bd40a8813/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/189d6e06-16ad-4c01-9d2f-4fafd62c574b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b7b89af-e947-4436-b3ea-a88d323cd6e3/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Redragon Store",
            "link": "https://www.amazon.com/stores/REDRAGON/page/C9D23970-BAEE-41FD-9E1B-F6B3A3B895ED?ref_=ast_bln"
        },
        "brand": "REDRAGON",
        "merchantInfo": "Redragon zone",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1607,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 23 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Brilliant Color Illumination- With 11 unique backlights, choose the perfect ambiance for any mood. Adjust light speed and brightness among 5 levels for a comfortable environment, day or night. The double injection ABS keycaps ensure clear backlight and precise typing. From late-night tasks to immersive gaming, our mechanical keyboard enhances every experience.",
            "Fully Programmable & Highly Configurable- Expand your options with K671 mechancial gaming keyboard to design your own keys, light effects and macro, the macros with different keybindings or shortcuts combine multiple keys function in one key for more efficient work and gaming.",
            "Hot-swappable Linear Red Switch- Our K671 gaming keyboard features red switch, which requires less force to press down and the keys feel smoother and easier to use. It's best for rpgs and mmo, imo games. You will get 4 spare switches and two red keycaps as a gift to diy your own keyboard",
            "Full keys Anti-ghosting- All keys can work simultaneously, easily complete any combining functions without conflicting keys. 12 multimedia key shortcuts allow you to quickly access to calculator/media/volume control/email.",
            "Professional After-Sales Service- We provide every Redragon customer with 24-Month Warranty , Please feel free to contact us when you meet any problem. We will spare no effort to provide the best service to every customer within 24 hours to help you."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "17.95 x 6.14 x 1.73 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.14 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Redragon"
            },
            {
                "name": "ASIN",
                "value": "B0CF3VGQFL"
            },
            {
                "name": "Item model number",
                "value": "K671"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,607 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#834 in Video Games (See Top 100 in Video Games) #42 in PC Gaming Keyboards"
            },
            {
                "name": "Date First Available",
                "value": "August 9, 2023"
            },
            {
                "name": "Brand",
                "value": "Redragon"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, PC"
            },
            {
                "name": "Connectivity Technology",
                "value": "USB"
            },
            {
                "name": "Keyboard Description",
                "value": "Mechanical"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Video Editing, Everyday Use, Education, Programming, Photo Editing, Student, Gaming, Business"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic, Backlit, Customizable Display Keys, Hot-Swappable"
            },
            {
                "name": "Color",
                "value": "RGB LED"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Style",
                "value": "RGB LED"
            },
            {
                "name": "Material",
                "value": "Acrylonitrile Butadiene Styrene"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Linear feedback, response faster, ideal for typing and gaming Next page 1 Cool Backlit Illumination 2 11 Backlit Modes 3 Responsive Red Switches",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page Note: The driver only supports the Windows operating system",
                "media_link": []
            },
            {
                "media_text": "Spill-resistant Protection Prevent accidental spills from interrupting your game Ergonomic Design Make your typing and gaming more comfortable Full Key Anti-ghosting All keys can work simultaneously, easily complete any combining functions without conflicting keys Double-shot PBT Keycaps No concerns about keycap fading even with prolonged use",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c4bc999-054d-4bd8-9d61-3a057a23ec39.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68fe7f75-e7f3-4eff-b52a-bfc7a01ba371.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e9a54ec-1024-4e19-a743-198ddfc1c205.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5e46b5da-1e87-411f-9c66-cf75c8ae485a.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "How to download the driver? Note: The driver only supports the Windows operating system",
                "media_link": []
            },
            {
                "media_text": "Programmable Mechanical Keyboard Redragon Mechanical Gaming Keyboard with Red Switches and equipped with strong programmable function will be your best teammate. Redragon is always committed to providing the most suitable gaming equipment for every gamer to enrich and enhance your gaming experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5f803d31-f1ac-4054-bb98-69c3f2526601.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25eb1289-9d5e-4f67-9abd-3f65e42ddcda.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/346c1a0f-9c50-4caf-b574-5401cf8d6507.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/468b2ad3-b1bf-4a26-8a40-f526254d65ac.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e959ff91-a0f6-4d5a-b42d-b9cdb1142f65.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5f5bf367-fffd-467e-9ba4-f185982f9222.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56290287-e4a8-4ae2-ab85-664a91bf2475.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c4bc999-054d-4bd8-9d61-3a057a23ec39.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68fe7f75-e7f3-4eff-b52a-bfc7a01ba371.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0e9a54ec-1024-4e19-a743-198ddfc1c205.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5e46b5da-1e87-411f-9c66-cf75c8ae485a.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5f803d31-f1ac-4054-bb98-69c3f2526601.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ruby Carpintero",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKRW32BXQKDYCO6AVRLAB4KLIJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NKCWHE8QFAO5?ASIN=B0CF3VGQFL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2015",
                "reviewTitle": "5.0 out of 5 stars Good for the price, it's my first mechanical keyboard, and it feels GREAT to type on.",
                "reviewText": "TL;DR at the end.So, the Redragon Indrah RGB mechanical keyboard. When I first saw this item on amazon, it had NO reviews, and it was 130 bucks. I decided to take a chance and hope that the build quality was superb and the keyboard felt amazing, because who would release a product that's 130 dollars (close to the price of other RGB mechanical keyuboards) when no one knows about their company? The very next day, the price dropped to 100 dollars, and it was lumped in as an extra color scheme for the rest of Redragon's keyboards; which are all membrane keyboards, save for this one and 2 or 3 others. I promptly bought this keyboard, and I became anxious at the fact that I may have blown 100 bucks on something that wasn't quality. Thankfully, as soon as it came out of the box, my qualms were put to rest. Right out of the box, you can tell that the keyboard is of considerable quality, as the USB is gold plated. Unfortunately, the cable isn't braided, but I suspect this is to lower costs. The top of the keyboard sports a raised key cap design, and a brushed aluminum plate. The bottom is made of plastic, and has two legs to raise your keyboard for comfortable typing. The box also includes a rubberized wrist rest, which, somehow, is a huge pain to get on and KEEP on. It snaps off whenever you lift it up and move it, which is more often than you think, considering this keyboard is incredibly light, and will move, even without that much force. The top of the keyboard has a silver Redragon logo, and 12 keys, split into groups of two. 5 programmable macro keys, including a macro recording button, and 6 dedicated multimedia keys. The font on the keys is strikingly gamer-esque which would be alright for some people, including me, but considering the feel of this keyboard is generally elegant and simple, it's strange they'd go with this font instead of a more neutral font. Just something to know when buying this keyboard. Plugging it in, I was beginning to worry that the driver software would be absolutely ugly and terrible, but, surprisingly, the entire keyboard is driver-less. The back-lighting defaulted to it's color spectrum mode, the first of 6 RGB modes. The color spectrum goes through all the colors of the rainbow (can't be bothers to list them here) and at any point during the spectrum, you can press function and insert (which is labelled with the number 1, home, is labelled with 2, page up is labelled with 3, delete is labelled with 4, end is labelled with 5, and page down is labelled with 6. I'll be referring to them by their respective numbers for the rest of the review.) which will stop the spectrum during it's color cycle and keep it there. So, say for example, the colors were between red and pink, it would stop on a color mix of red and pink. The next back-lighting mode is function and 2, which is an automatic rainbow ripple effect with an off white color for the rest of the keys that is centered on the O key. Pressing function and 2 again makes the rainbow ripple effect happen only when you click. I personally don't like the previous two modes of the ripple effect, because the color of the back-lighting when the ripple isn't happening is a disgusting off white color that isn't good on the eyes. There is one saving grace for this mode, as pressing function and 2 again creates a solid color, full keyboard ripple effect, again, centered on the O key. The next mode is function and 3 which is a slow rainbow effect. Pressing function and the left or right arrow key modifies the direction the rainbow flows; speaking of the arrow keys, pressing function and up on the arrow keys raises the brightness and down on the arrow keys lowers the brightness. A really nice feature they added is when you're at the max or minimum brightness, the num, caps, and scroll lock LED alerters or whatever they're called flash to let you know, so you're not mashing the up arrow thinking the brightness is being raised but it's REALLY hard to tell. Speaking of the brightness, the keyboard is so bright and vibrant it almost gives me a headache to look at sometimes, so don't worry about it being dim like the K65/70/95 keyboards from corsair.Continuing with the back-lighting options, pressing function and 3 again stops the rainbow in it's place, so you could have half the keyboard white, and half the keyboard light blue. The next one is function and 4, which is the same as the slow rainbow, but faster. You can stop the rainbow and change the directions all the same, as well. Pressing function and 5 is the custom back-lighting mode. It's defaulted to white, but if you press function and 5 again, the num, caps, and scroll lock alerter things are continuously flashing. and during this mode, you can press every key multiple times to have it set to any color. Pressing a key multiple times swaps through the available colors, which are off, red, blue, pink, green, yellow, light blue, and white. every key can be an alternating color, and you can even write almost illegible words on the keyboard like \"Hi!\" which i find absolutely hilarious. I have it set to red, since that's my favorite color. The last color mode is a reactive typing mode, activated by pressing function and 6; reactive meaning, the second a key is registers as pressed, the led activates for a short amount of time, and then fades out. Pressing function and 6 again changes the color from white to red, cycling through the available colors. That's about it for the back-lighting options, and the second to last thing to really touch on is the programmable macro keys. You press the record key and then press the macro button to assign the following macro to that button. For example, to create a macro key that types in \"www.youtube.com\" and presses enter, you would press record, any of the 5 programmable macro keys, and then you type on the keyboard www.youtube.com, press enter, and then press record to finish the macro. Assigning macros seriously couldn't be less complicated. The last thing to touch on would the be the keyswitches used. The only switches used in this keyboard are (i think) outemo blue switches, which are light and have two tactile indicators, a click, and a bump. They're incredibly loud, but the sound is absolutely euphoric and it honestly the only reason I've ever wanted a mechanical keyboard. My only gripe with this keyboard are that the num, caps, and scroll lock alerters are defaulted to red and CANNOT be changed, so if you wanted to always have num lock on (maybe you're an accountant?) but you have the keyboard blue, it's a huge annoyance with the clashing colors. The only other gripe would be the 12 keys at the top aren't backlit. It's sort of petty, but if I'm paying 100 bucks for a friggin' keyboard, I want it to be totally tricked out, y'know?If you can't buy a razer blacwidow chroma or you want something cheap, durable, lightweight and vibrant, buy this.TL;DR, It's good, buy it.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Starcaller Dragoness",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVHSHGIL7NC6TI73MLDOV6QTONA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MJJZPOFMIWTS?ASIN=B0CF3VGQFL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2016",
                "reviewTitle": "5.0 out of 5 stars Awesome Keyboard!",
                "reviewText": "Bought this keyboard for my new gaming computer. This is the first mechanical keyboard I've had for gaming, so there was some getting used to. (My old gaming machine was an Alienware M15x, so the keys were considerably quieter, being a laptop.) Anyway, after using it for a few weeks, I can say I definitely love this keyboard. It's very customizable, but I do feel the included documentation could have given some more detail on just HOW to customize it, as I actually did not know until I watched a video on youtube about the keyboard. (I won't link the video, as it was cringeworthy to watch, to be honest.) Anyway, each key can be programmed to one of 7 colors, or \"off\". The colors are quite vibrant, and despite \"only\" having 7 colors to choose from, it's more than enough for my needs.Anyway, there are various modes that are controlled by pressing the FN key, and then INS, HOME, PG UP, DEL, END, or PG DN, brightness is controlled with FN and the Up/Down arrow keys, and the \"Winlock\" function (locking the Windows key) is controlled with FN + Windows Key. Also of note, the keys for the different modes do have numbers in boxes on them.Mode 1 (FN + INS) is a slow rotation through all the colors the keyboard can display (actually getting more than the 7 colors via mixing) and you can press FN + INS again to stop it on a particular color if you are interested in having that as your color scheme.Mode 2 (FN + HOME) is something I've come to refer to as the \"disco floor\" mode. It has various colors that flash from the center of the keyboard out, and pressing (FN + Home) more will pull up other \"modes\" with it rotating through various colors.Mode 3 (FN + PG UP) is a \"wave\" of color from one side of the keyboard to the other. It can be stopped on the currently shown color combination by pressing FN + PG UP again, and the direction can be changed by pressing FN + Left/Right Arrow keys.Mode 4 (FN + DEL) is a lot like mode 3, including the direction changes, but instead it's a rainbow across the whole keyboard that goes in a wave. The colors are about 3/4 columns of keys each, and can also be stopped on the current pattern if the keys are pressed again.Mode 5 (FN + END) is the programmable mode. All keys are by default shown in white at the start, but if you press FN + END after going to this mode, the 3 \"lock\" lights will start flashing, and you can press each key individually to set the colors. After it's set the way you like, press FN+END again, and it will save that as your setting.Mode 6 (FN + PG DN) is a really neat one. The whole keyboard goes black in this mode, but pressing a key will cause it to light up, then fade back to black. The default of this mode is white, but if you press FN + PG DN more, it will come up with alternate colors to light up as.Macro programming is done by pressing the \"REC\" key, then pressing the \"G\" key you want (G1 - G5) to set the macro to. The initial \"REC\" press will cause the \"lock\" lights to flash slowly, pressing the \"G\" key you want will cause them to flash faster... that's recording mode. Press the keys you want as your macro, then press \"REC\" when you're done.I don't personally use the macros myself (yet) mostly because the macros I do use are part of the game I've tested with it most (World of Warcraft).A big plus to this keyboard for me are the multimedia keys. I tend to listen to my music collection while I'm playing WoW. I love the game's music, but there's only so many times you can hear the same songs before needing something a bit different. The keys are some of the few that are not lit on this keyboard (along with the macro keys) but they are easily accessible, and easy enough to identify by touch. (They don't have any tactile indicators on them, but there are only 6, and I've remembered their placement easy enough.)The build quality of the board is fantastic. It feels very high-grade, and the keyboard tray itself is a thick metal plate (it seems to be a brushed aluminum, but I may be wrong). The wrist rest is detachable, and I haven't really used it (though I did just set it up during this review just to see what I think of it. It's pretty comfy.)Anyway, the keyboard is fantastic, and it seems to be constructed well enough to hold up for a good long time. It works great with Windows 10, as well.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justin B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEZJSEVE4S3I3X55B4UQZQ6OPOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WW2S75GD0RB4?ASIN=B0CF3VGQFL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars This'll do.",
                "reviewText": "I had the Red Dragon Vara keyboard that came with my computer when I bought it. I spilled a glass of pepsi on it and well that was that. The vara was a good keyboard, but the keys were a bit clunky and whole thing had a ridge around it that made cleaning it difficult, as well as serving as a trap for anything and everything.I just plugged in this keyboard, just moments ago. It's nice and heavy duty, has the legs to prop it up, has the colors you'd expect. But the keys are so quiet and smooth to press. I've only used it for about 5 minutes now, but it's that good. I'll update this as time goes on if my opinion of this keyboard changes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shazia suleman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 8, 2024",
                "reviewTitle": "Very nice keyboard",
                "reviewText": "I bought this keyboard for my new setup and because it was cheap i thought the product would be low quality. But when i unboxed it and put it on with my setup, it sounded and feeled amazing. I would definitely recommend this product :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eldon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 21, 2022",
                "reviewTitle": "Bueno",
                "reviewText": "Funciona correctamente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Knight",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 7, 2024",
                "reviewTitle": "Nice mechanical keyboard",
                "reviewText": "I've always loved using a mechanical keyboard and the last couple I had before this one wasn't mechanical and as soon as I got this I could feel the difference. Yes it's noisy but so what? Wasn't too sure about the lights, yes it's nice to have to keys visible but why anyone wants or needs a host of colour schemes is beyond me but as a keyboard it's perfect!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 30, 2022",
                "reviewTitle": "Good budget keyboard",
                "reviewText": "I've had no qualms about the product so far. It works fine. But it isn't as quiet as I would like it to be, as it's advertised. Rest everything is fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lalit Umbarkar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 19, 2021",
                "reviewTitle": "Decent Mechanical Keyboard and mouse",
                "reviewText": "Do check it you are ok with clicky switches.Because if you are buying in hope of changing the switches later on, mind you they are Outemu (Gaote) switches and MX switches aren't compatible with it. And finding Outemu Red or any other switch on market is pretty difficult.Mouse is decent. To note you can adjust weight of mouse. Check manual, there's only one line regarding this.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}