{
    "remaining_requests": 41809,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-Wireless-Keyboard-K270-Long-Range/dp/B004N627KS",
    "body": {
        "name": "Logitech K270 Wireless Keyboard for Windows, 2.4 GHz Wireless, Full-Size, Number Pad, 8 Multimedia Keys, 2-Year Battery Life, Compatible with PC, Laptop, Black",
        "price": "$21.99",
        "originalPrice": "$29.99",
        "rawPrice": 21.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-Wireless-Keyboard-K270-Long-Range/dp/B004N627KS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 R7pH 2RL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41lY3ksxHWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41p3vdnihoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jl300d4oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TQA8YtWAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41O34cqZEnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21BucKh1TpL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A16-5pwrTKL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/A16-5pwrTKL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Logitech Store",
            "link": "https://www.amazon.com/stores/Logitech/page/01EFDE77-7D1A-41D7-9EEA-7C2FA22AB12F?ref_=ast_bln"
        },
        "brand": "Logitech",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 7195,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 1 min"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset."
        },
        "features": [
            "All-day Comfort: This USB keyboard creates a comfortable and familiar typing experience thanks to the deep-profile keys and standard full-size layout with all F-keys, number pad and arrow keys",
            "Built to Last: The spill-proof (2) design and durable print characters keep you on track for years to come despite any on-the-job mishaps; it’s a reliable partner for your desk at home, or at work, Wireless range: 10m wireless range",
            "Long-lasting Battery Life: A 24-month battery life (4) means you can go for 2 years without the hassle of changing batteries of your wireless full-size keyboard",
            "Easy to Set-up and Use: Simply plug the USB receiver into a USB port on your desktop, laptop or netbook computer and start using the keyboard right away without any software installation",
            "Simply Wireless: Forget about drop-outs and delays thanks to a strong, reliable wireless connection with up to 33 ft range (5); K270 is compatible with Windows 7, 8, 10 or later",
            "Multimedia Keys: The things you do most are right at your fingertips with 8 keyboard hotkeys for instant access to the Internet, E-mail, play/pause, volume and more",
            "Favorite Wireless Keyboard: K270 brings together familiar typing, wireless freedom, and long battery life; no wonder this is the world's top-selling keyboard (1)",
            "USB receiver included in the box flap"
        ],
        "description": "Logitech Wireless Keyboard K270. Reliable wireless-wherever you use your keyboard. The tiny Logitech Unifying receiver is small enough to stay in your laptop. Plus, you can easily add another compatible mouse or keyboard-without the hassle of multiple USB receivers. With Logitech Advanced 2.4 GHz wireless connectivity, you'll enjoy virtually no signal loss from up to 10 meters away.* You can go for two years without battery hassles.** Eight hot keys and plug-and-play setup that takes just seconds add to the simplicity. The familiar, full-size layout-including number pad-gives you all the right keys right where you'd expect them. And it's built to last with the high quality and reliability Logitech is known for-with a spill-resistant design*** and UV-coated keys for durability. * Wireless range may vary due to environmental and computing conditions. ** Keyboard battery life calculation based on an estimated two million keystrokes/year in an office environment. User experience may vary. *** Tested under limited conditions (maximum of 60 ml liquid spillage). Do not immerse keyboard in liquid.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "0.75 x 5.75 x 17.25 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.1 pounds"
            },
            {
                "name": "ASIN",
                "value": "B004N627KS"
            },
            {
                "name": "Item model number",
                "value": "920-003051"
            },
            {
                "name": "Batteries",
                "value": "2 AAA batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 7,195 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#969 in Climate Pledge Friendly (See Top 100 in Climate Pledge Friendly) #5 in Computer Keyboards #122 in Climate Pledge Friendly: Electronics"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "April 1, 2010"
            },
            {
                "name": "Manufacturer",
                "value": "Logitech"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, PC"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Keyboard Description",
                "value": "Qwerty, Multimedia"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Multimedia"
            },
            {
                "name": "Special Feature",
                "value": "Spill Proof"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Number of Keys",
                "value": "104"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "Single Color"
            },
            {
                "name": "Style",
                "value": "Keyboard K270"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Logitech Wireless Keyboard K270 with Long-Range Wireless Fast, reliable connection up to 10-meters with virtually no delays or dropouts thanks to Logitech Advanced 2.4 wireless technology Take this compact mouse anywhere your computer goes. Go for months without changing batteries. On/Off switches help conserve battery use. Work or play in more places. The wireless connection virtually eliminates delays, dropouts and interference and gives you a range of up to 10-meters range. Take the mouse with you. This comfortable mouse fits easily into computer bags and pocket to travel with your computer. Instant access to media controls—movies, music, Internet, e-mail, play/pause, volume and more—are one touch away The full-size keyboard with number pad, directional keys, and nine F-keys is comfortable, convenient and built to last.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/28cd1f4e-66ad-4c72-bf3e-90ce2f8423f4.__CR113,0,818,818_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/28cd1f4e-66ad-4c72-bf3e-90ce2f8423f4.__CR113,0,818,818_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/02b60336-52f7-46d3-bd75-9ccfc4b76551.__CR112,0,844,844_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/652fecf1-dfc3-41ac-8bb9-571c55e3e6f7.__CR140,0,841,841_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/612432bd-26c4-480f-823c-a01a5b94956b.__CR176,0,838,838_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "67 merc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLYUVXRIK3ZT5PDZBH56A4IZHKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHSZ23NIS36NY?ASIN=B004N627KS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Best bang for your buck!",
                "reviewText": "Almost everyone is familiar with Logitech keyboards & mice by now. They are usually a solid reliable choice and this one is both. I love this one, ,It syncs quickly with the included usb receiver it has great battery life.It uses 2 AAA batteries which I prefer to rechargable because if they die I can replace them and get back to work instead of having to stop and plug it in to recharge and having to wait. Mine usually last 7 or 8 days if I leave it on. The only bad thing about this keyboard is that the caps lock seems to turn itself on randomly.Its not a big deal to turn it back off so I still recommend the keyboard and when the time comes I'd buy this model again. It is very lightweight and compact for a full size (102 key)The keys give good feedback for a membrane (non-mechanical) keyboard making touch-typing a breeze.and its very quiet so it won't keep your roomate awake if you tend to stay up late.This keyboard has survived several drops to a hard floor without damage Compared to other wireless keyboards in this price range this is the clear winner",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NightRunner417",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVLW7JWR5GN75KFFLSCPEQDDGLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DJU0HOHW2UAH?ASIN=B004N627KS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2013",
                "reviewTitle": "5.0 out of 5 stars Nice little compact wireless keyboard...",
                "reviewText": "This year, I've been getting more serious about my home and how I want things to be here. One of those things that I've long thought about but only recently put any real effort into is the living room \"atmosphere\". I've long had dreams of a great audio-video entertainment setup out there, and this year it all came into focus for me and I finally knew what I wanted to do. Believe it or not, this keyboard is central to that idea, though I also recently killed my desktop computer's wired keyboard, so now it's seeing use full time.Basically, my living room now has an excellent 5 speaker (two fronts, two rears and a subwoofer) sound system, and a TV wired to the secondary video output of my desktop computer. That TV is soon going to be replaced by a Vizio 32\" Smart HDTV unit, so that the computer's video will be clear enough to use properly without a magnifier application to help with reading print on-screen. That's where this keyboard comes in. I needed a wireless keyboard that could work the computer from the living room (the desktop machine is in the bedroom) without pesky signal dropout issues and thus nitpicky placement. I'm pleased to say that so far it works perfectly. I paired it up with a Logitech M510 Wireless Mouse, and though the mouse's placement is indeed a little picky, the keyboard works great. Now I can sit out there and bring up whatever I want on the computer, be it a video file, some YouTube or Amazon Instant Video entertainment, music, or my usual run of mad science research, no problemo. I can even check my bank account, pay my bills, all the usual things I do when I'm at the computer properly. Once I get the HDTV, I'll be able to do all that and more without the blurry, indistinct detail that goes with a CRT television. Skyrim in HDTV and Bose surround sound, OMG **** yes. :-)So what is this keyboard really like? Well, it's thin, it's very compact, it's very light, and it does feel a bit cheap. That said, it's got little feets in the back to prop it up at an angle, which gives the feel of a proper keyboard, and thank the Gods, it's a full, proper, keyboard layout with no sensation of the keys being scrunched together. At least, I don't notice it, and I type using just my left thumb and both index fingers WITHOUT looking at the keyboard (don't ask me how I learned to do that, but I can wing out 40WPM easy now this way), so keyboard format is EVERYTHING to me. It speaks volumes that I could go over to this thing so quickly and not immediately hate it, like how I feel about my laptop keyboard. I would NOT be hard on this thing, physically - I don't feel like it's built to be durable under abuse. I also would NEVER spill anything on it if at all possible, because surely it would be easy to kill this way and you don't want to go killing your nice wireless keyboard.I don't use mouse or keyboard software, so I can't comment on that. What I can tell you is that I really like this thing, I'm impressed by its range and I'm good with how it feels, and definitely I'd buy it again. Nice, especially if you need something super portable, reasonably compact, and very lightweight. It also has an on/off switch for those times that you want to save battery power... though I'm not sure it's really necessary. Nice keyboard!As usual, I'll come back and give an update if for whatever reason I think I need to.Rick NR417",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StinkerBell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ6LTTJVMIS57E6GNMAAIEKA6XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NI26035A1WX0?ASIN=B004N627KS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Works good",
                "reviewText": "Edit 7/24/23: I just picked up a Logitech compact wireless mouse, M325. It did have the unifying symbol on it, and I was able to very easily sync it up with the keyboard. Took about 10 secs for it to do it.I just bought this to replace a keyboard/mouse combo I picked up at the W store about 2 years ago. It's the same model, but this is slightly different. It's white on the bottom, the keys are really quiet and seem smoother, and this one has the unifying dongle to it.My other one was not unifying, and the mouse had gone out. That's when I discovered about the \"unifying\", and so it was either pay a few more dollars for this keyboard that is unifying and buy a separate unifying mouse, or buy the same combo that isn't unifying which was on sale for 17. And seeing as if one goes out on the combo, you can't just buy another to use on the same dongle, I went this route. I figure in the long run this would be the cheaper option. I had another mouse handy that is not unifying, and it would not sync up with this keyboard.So, if you want one dongle to run both mouse and keyboard, as well as other stuff you need to look for that orange symbol on the dongle or package. Then you need to use the software on the logitech site to sync them together. IMO kinda dumb. Just make everything sync up together.Overall, decent keyboard for me for basic medium web browsing type of use, no gaming. I have the keyboard about a foot away from the monitor, and no issues with it. My old keyboard was still working ok, it just had a bunch of dust and gunk in the keys and a few keys I never use popped off and lost due to my cat digging it up for some reason. I had spilled stuff on it before, and it still worked fine. Battery had lasted, it was going on about 2 years I'd had it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick L. in Texas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKFKS2CULF7UH2PI455MCK2YZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TF1OEQBTVU5N?ASIN=B004N627KS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Unifying! Works great. But shame on Amazon for sending me a return and calling it \"new\".",
                "reviewText": "The keyboard is fine and I'd give it 5 stars to fit my needs. However, I've ordered 2 others like it and returned them both. One because it was not \"Unifying\". Another was a warehouse deal, but many of the keys did not work. So I ordered this one as \"new\". What arrived as missing the factory tape, had the battery shipping protector tab removed (and laying in the box). The batteries were the same off-brand as those in the Warehouse deal, and not the Duracells that arrived in the non-Unifying version I ordered and returned.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth T.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Great keyboard!",
                "reviewText": "I've tried a lot of different keyboards over the years (and usually throw them out after a week or two!) but this one finally seems to work well and feel comfortable. I've been using it for about two months and have no complaints.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 14, 2022",
                "reviewTitle": "Nice touch of keys and sound, good layout, nice multimedia keys, this top quality keyboard",
                "reviewText": "Make no mistake, this is what a quality keyboard is like. Keys go down with a nice sound and touch. The keyboard has a nice layout like a full sized keyboard (e.g. F<N> keys are in groups of 4 with spacing between them). And the multimedia keys are useful (and require no Function key combination, they are standalone).At the same time, the keyboard size is kept at a minimum. No unnecessary space is wasted \"around\" the keys. So the keyboard looks compact, while being full sized.Another nice touch: there's a caps lock physical LED, unlike most wireless keyboards. Super useful.I can't recommend enough. It is the second time I buy this keyboard model, for two different computers. No regrets.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Klaassen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 17, 2021",
                "reviewTitle": "Excellent Wireless Keyboard",
                "reviewText": "This keyboard is everything they say it is, and has a great rebound feel to the keys that professionals like, without being noisy. Syncs with laptop immediately, no delay",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pvtoor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 4, 2014",
                "reviewTitle": "Good deal and service thnks amazon price are very low",
                "reviewText": "very good price and product thanks regal and amazon platform is good thaks thnks thnks thnks thnks thnks thanks thanks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 23, 2023",
                "reviewTitle": "great keyboard",
                "reviewText": "Just got it and it is perfect. Time will tell but, the price is not excessive, wireless (for the first time) is nice to have, and if it lasts a couple of years, it will have paid for itself comfortably.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}