{
    "remaining_requests": 41663,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/iClever-Bluetooth-Universal-Rechargeable-Connection/dp/B07PV6NDB2",
    "body": {
        "name": "iClever BK10 Bluetooth Keyboard, Wireless Bluetooth Keyboard, Rechargeable Bluetooth 5.1 Multi Device Keyboard with Number Pad Full Size Stable Connection for Mac, Windows, iOS, Android, Laptop",
        "price": "$33.99",
        "originalPrice": "$33.99",
        "rawPrice": 33.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/iClever-Bluetooth-Universal-Rechargeable-Connection/dp/B07PV6NDB2",
        "soldBy": {
            "sellerID": "A2KV19AYUKS3X0",
            "name": "Thousandshores Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2KV19AYUKS3X0&asin=B07PV6NDB2&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BKGKLBTT"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "300",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 15% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Yr4T hiEL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51hIikcRJ3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FCQ3Ioh5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/514WMyDKBYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QSsLLAlhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NR6X8ALsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GX2awSjlL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C1fMWElTTdS.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/C1fMWElTTdS.pdf"
        },
        "byLineInfo": {
            "name": "Visit the iClever Store",
            "link": "https://www.amazon.com/stores/iClever/page/DD030F81-F08C-4264-BCD8-ED33B788728F?ref_=ast_bln"
        },
        "brand": "iClever",
        "merchantInfo": "Sold by Thousandshores Inc and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5753,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 17 hrs 1 min",
            "FREE delivery February 24 - 27 on orders shipped by Amazon over $35",
            "Or fastest delivery February 24 - 26"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SLEEK & WIRELESS: Stainless steel & ABS construction with a 10 tilt. Allows for cluster-free operation on your desktop, making it an ideal choice for office use.",
            "MULTI-DEVICES & MULTI-OS: Seamlessly switches among 3 devices with BT 5.1 tech. Automatically recognizes different operating systems and layouts. Supports Windows PC/Laptop, iMac/Macbook, iPhone/iPad, Android smartphone/tablet.",
            "USB-C RECHARGEABLE: For environmental sustainability advocates, we made the battery rechargeable. It delivers up to 45 days of use (2 hrs per day). Featured power-saving takes the keyboard to sleep after 30 minutes of inactivity.",
            "RESPONSIVE & LOW-PROFILE: The scissor key mechanism enhances feedback and stability. The optimized key-travel, and anti-slip tapes make typing more comfortable, quiet, and precise.",
            "COMPACT & EFFICIENT: Built with a standard numeric keypad. Features hotkeys, Calculator, Fn lock, Mute, Volume up and down, etc., to increase your workflow and productivity.",
            "1-year limited hardware warranty. Attached silicone cover for key protection."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "14\"L x 4.9\"W x 0.48\"H"
            },
            {
                "name": "Item Weight",
                "value": "13.1 ounces"
            },
            {
                "name": "Manufacturer",
                "value": "iClever"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07PV6NDB2"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "BK10"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 5,753 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#44 in Computer Keyboards"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "April 11, 2019"
            },
            {
                "name": "Brand",
                "value": "iClever"
            },
            {
                "name": "Compatible Devices",
                "value": "PC, Laptop, iMac, Macbook, Tablet, Smartphone, iPhone, iPad"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Keyboard Description",
                "value": "Bluetooth Keyboard, Scissor Switch, Compact Size"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office, Home"
            },
            {
                "name": "Special Feature",
                "value": "USB-C Charge, Multi-devices, Laptop typing experience, Multi-OS"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Number of Keys",
                "value": "99"
            },
            {
                "name": "Material",
                "value": "Acrylonitrile Butadiene Styrene"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "BLUETOOTH MULTI-DEVICE KEYBOARD USB-C Charge, Multi-devices, Laptop typing experience, Multi-OS,Scissor Switch, Compact Size, Ultra-Slim COMFORTABLE TYPING Stainless steel & ABS construction with a 10 tilt. Allows for cluster-free operation on your desktop, making it an ideal choice for office use.",
                "media_link": []
            },
            {
                "media_text": "Previous page Laptop-Style Typing The scissor key enhances feedback and stability, makes typing more comfortable, quiet, and precise. Designed for Superior comfort Keyboard with dimensions of 14x4.9x0.15 inches, optimum slope and spacing for fast, fluid typing. Pair up to 3 Devices Switches among 3 devices. Automatically recognizes different operating systems and layouts. Broad Compatibility Compatible with PC/laptop/iPhone/iPad/smartphone/tablet. Support with iOS/Mac/Windows/Android. Next page 1 Scissor Switch 2 Ultra-Slim 3 Multi-Devices 4 Multi-OS",
                "media_link": []
            },
            {
                "media_text": "Compare Wireless Mouse IClever BK20 Keyboard Add to Cart iClever TM254 Mouse Add to Cart iClever WM101 Mouse Add to Cart iClever MD179 Mouse Add to Cart iClever MD165 Mouse See Details Customer Reviews 4.5 out of 5 stars 38 4.3 out of 5 stars 128 4.3 out of 5 stars 3,528 4.3 out of 5 stars 305 4.6 out of 5 stars 497 Price $29.99$29.99 $24.99$24.99 $19.99$19.99 $21.99$21.99 — Connectivity Bluetooth 5.0 USB Receiver USB Receiver USB+Bluetooth USB+Bluetooth Compatibility Windows/Mac/iOS/Android Windows 7/8/10/11 Windows 7/8/10/11 Windows/Mac/iOS/Android Windows/Mac/iOS/Android Tracking — Optical Optical Optical Optical DPI — 800-1200-1600-2400 1000-1600-2000-2400 800-1200-1600-2400 800-1200-1600-2400 Ambidextrous Design — Right Design Right Design Right Design Right Design Hand Size Fit — Small-Middle Small-Middle Small-Middle Small-Middle Features Multi-devices, Multi-OS Mouse Jigger, Rechargeable Ergonomic, Silent Click Silent Click, Multi-Devices Silent Click, Multi-Devices",
                "media_link": []
            },
            {
                "media_text": "Compatibility OS Windows 8 or late Android 6.0 or late iOS 9.0 or late Mac OS X 10.8 or later with HID profile NOTE: Do not compatible with Mac mini, Mac studio, XBOX, Samsung Smart TV, Nokia Phones and Bluetooth adapter. Guide to Use for IC-BK10 Step 1: Power on the keyboard. Step 2: Click BT1/BT2/BT3 button to choose Channel 1/2/3. Step 3: Hold and press BT1/BT2/BT3 buttons for 5s to Bluetooth pairing mode. Step 4: Find the *iClever IC-BK10 Keyboard*, and click to connect it. Fail to connect Step 1: Charge the keyboard for 2 hours. Step 2: On your device, remove/delete all the Bluetooth connection records Step 3: On your device, turn off the Bluetooth and turn it on again to refresh. Step 4: Follow the user manual to connect it again. Delay when typing / frequently gets disconnected or laggy / stop working Make sure that your device and computer are within close proximity of each other.Try moving away from metal and other sources of wireless signal. If your device has removable batteries,try removing and re-inserting the batteries in your device. Charging indicator frequently switches between green and red The green indicator means the keyboard is fully charged. However, the indicator will turn back red even though you use it for 10 seconds. In this case, the keyboard is fully charged, and it can't indicate any charging problem.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4471105d-e024-4580-9f75-2a4e3085607c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/da063a26-e2fd-4abd-a29c-635b6a377630.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6fecf92b-0806-48ce-a108-03c65790e732.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d8ab3c7-a9bc-4310-9cf1-de82997c7157.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c9e93fd1-3659-45fd-94f0-e89327446a51.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c25168a4-1c53-4c4f-88e1-6f1b1fe0f3bd.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/852b4819-3b2e-4caf-b914-1bf52e89142f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6de44b76-ed35-4b95-86ca-43f3f4d53928.__CR0,12,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/907b4586-1db3-4cee-b0b8-1ed181957f8c.__CR50,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a398f464-8559-4906-abfa-1228f4922131.__CR50,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2c4a6d1e-6c9d-4e76-ab23-7af09b451eab.__CR0,0,200,225_PT0_SX200_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ca0ce9a3-f7da-4e12-9700-4eafd47878ab.__CR50,0,200,225_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Damián López",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2GSJVIFX6EG6EFDOXVOUPYIZZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD7PEQJ19N2TP?ASIN=B07PV6NDB2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent, sleek and light",
                "reviewText": "I love this keyboard (and this sort of keyboard in general) because of various reasons.Firstly, ergonomics and design. I work and play from my computer at home, and while I've had larger, bulkier keyboards, I feel like these smaller and lighter ones are far better to alleviate the effects of the repeated movement on my fingers and wrist. It is also quiet, easy to move, and small, so it barely takes up any space in my desk. It does not sacrifice the numeric keypad on the right, which is important to me.Secondly, battery life. I have an easy-to-access cable on my desk, but I don't have to recharge it often. The fact that it goes into sleep mode means I don't have to be turning it off nightly.Thirdly, easy to clean. Other keyboards can often get dust and lint underneath the keys; with this sort of keyboard, a simple dusting now and then suffices.This one has an additional feature which seems very handy, though I won't be using it often, which is the ability to connect to a different device with the touch of a button. Overall, highly recommended and worth the price.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "College Dad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WE4NIBFCHNXHRUSFVWXPI3DEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16KE7EYP3XUH4?ASIN=B07PV6NDB2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2020",
                "reviewTitle": "5.0 out of 5 stars Bluetooth Setup Was Glitchy, Keyboard Action Lacking. iClever Support is Awesome",
                "reviewText": "Update: Nov. 17th, 2020I've had this keyboard for more than 30 days and struggled with it quite a bit. The lack of tactile feedback was difficult to get used to. To \"correct\" that I installed a keyboard clicking app for my Ubuntu Linux 20.04 workstation that this keyboard is connected to. Hearing the \"clicking\" feedback from my speakers helped more than I thought it would and I actually began enjoying using this keyboard. My fingers \"stopped tripping over themselves\" and all in all, I'd say it's been a pleasant experience with this keyboard.And then ... the battery stopped charging. No matter what I did, the battery refused to charge. I'd plug it in for a few hours, the battery meter would read 100% and then drop to 10% when I unplugged the keyboard. I was three days past the return date of the keyboard when it happened, so I contacted iClever support. They responded in less than 12 hours and successfully remediated the issue to make me happy. I have to say, their response and support in my case was world-class. I'm disappointed that the keyboard failed as I was finally beginning to enjoy using it and with that said --- I'm going to give it another try and purchase another. I very much appreciate their Customer Service and am happy to give their product another chance as a result. I like to support companies with excellent customer service and iClever's support is awesome. Nice job!!Original Review:I bought this keyboard to replace an Apple Magic Keyboard (Aluminum, bluetooth model) because a few keys broke on it due to wear and tear and finding replacement keys was very problematic. Placed multiple orders with multiple vendors only to be told after the fact parts were backordered because of the tarrif's and such with China.So I opted to buy this keyboard instead and hey why not, it was actually cheaper than replacing the keys on my Apple Bluetooth keyboard.Aesthetically, this is a very pleasing keyboard. It matches my blacked out workstation and I like the fact it's laid out like a 101k keyboard with the number pad off to the right. It's a sturdy keyboard, there is no \"flex\" when I type on it and it appears to be very well thought through and constructed. 10/10 for that.Getting it to connect to my Bluetooth 4.x on my Ubuntu Linux workstation presented a few issues to overcome.First was that it wasn't visible to my bluetooth. It seemed to take a very long time to be discoverable. Minutes and minutes long. Once found, I connected they keyboard via the first channel. Nothing happened until after another lengthy delay it started repeating the \"d\" character despite my not touching the keyboard. I had to turn the keyboard off to make it stop repeating \"d\" and then removed the keyboard from the list of bluetooth devices in Ubuntu.I repeated the setup instructions documented and the same thing happened. Examining the keyboard the \"d\" key appeared fine and didn't appear stuck, so I tried pairing the keyboard with my Ubuntu workstation again, this time on the second channel. It worked. No repeating \"d\" character, the keyboard functioned as normal.For giggles I removed the keyboard from my bluetooth devices and again followed the instructions to connect on the first channel, only to see the \"d\" key repeating itself again. Dropped the bluetooth connection to the keyboard, re-setup on channel 2 and it's working like a champ. Not sure what's wrong with the first channel, it's definitely kaput. That doesn't matter to me, I'm only connecting this keyboard to one device so that's a non-issue for me and not something I'd return the keyboard for.My last comments are specific to the action in the keys and the feedback they provide while typing. I typically clock anywhere from 95 - 110 wpm on every keyboard I own, whether it's an old IBM CLICKY keyboard (my favorite) an old Logitech K570 and my beloved Apple Wireless bluetooth keyboard. I'm used to the response action on all these keyboards and can switch pretty seamlessly.On this keyboard the action is lacking. The response from the time I press a key to it reverting back to it's resting state seems lacking to me. I expected the action to be similar to that of my Apple wireless bluetooth keyboard. It's not. If that's what you're expecting with this keyboard, do not buy it.The last thing I want to say is that the lack of keyboard \"action\" for me inhibits how quickly I can type on it. I've found my fingers \"tripping over themselves\" trying to type on it. That means more mistakes and backing up to correct. As I typed this review, I switched back and forth between my Apple bluetooth keyboard and this one. The difference in the keyboard action and my ability to type so much faster on my Apple keyboard vs. this one is absolutely noticeable. I'm going to give myself a little more time to get used to this keyboard and if that doesn't do the trick then I'll be sending it back. The \"dealbreaker\" for me isn't the bad bluetooth channel it has, it's the keyboard action and not being able to go as fast as I can on my Apple bluetooth keyboard which has a similar layout and key spacing (I measured the gaps between the keys on both keyboards, they're identical.)About me: I've been in the Information Technology field for 35 years. Yep, I'm an old fart. I write reviews for products I buy because I like to share what I find, both good and bad. I also read others reviews before I purchase a product and rely on the truthfulness of those reviews. If you found my review helpful, please indicate such. Thanks for reading.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7MXY6RAWET623RWDUHNVAR6ZYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MQ5JSZ41G1K0?ASIN=B07PV6NDB2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "4.0 out of 5 stars A Reliable Wireless Typing Companion",
                "reviewText": "The iClever BK10 Bluetooth Keyboard is a reliable, wireless typing solution that offers portability, ease of use, and a rechargeable battery. It's suitable for users who require a compact and lightweight keyboard for a variety of devices. However, be prepared to adjust to the key layout, and consider investing in a separate stand if you prefer an elevated screen angle. Overall, it's a practical addition to my mobile workstation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N. Nguyen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOOTQAICN7PKHALR6YKFSFE5SDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UKSN2I8OKTD3?ASIN=B07PV6NDB2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 12, 2020",
                "reviewTitle": "5.0 out of 5 stars Keyboard is worth the cost",
                "reviewText": "The keyboard was purchased for the SMARTS TV and PCs. I have so may other smaller keyboards in the past, but this one beats the other ones by far. HOWEVER, there are caveats that you have to worry about.Pros:Keyboard is wide enough to accommodate kids (from around 8 years) to adults. It's not really a full-size keyboard, but large enough to make things a bit comfortable to type with when you're sitting down away from the TVIt synchs to three different devices and you can switch very quickly between the devices using the available 3-synch functions.It comes with a keyboard film to prevent nasty greasy hands from making the keyboard feel disgusting, and dirt from getting in-between the keys.Keys are very bouncy. LOVE IT! Just the right tactlessness.Numerical and function keys to match with various OSes, and the numerical pads on the side is a massive plus for number entry freaks like myself.Each charge ranges between 82 hours of continuous usages (yep, 82+ hours of continual usages) to 100+ hours of on-and-off usages. 90 hours is the average I assume.Now, the conditions. This is a BT 5.0/5.1. You use it on a 4.0/4.1, good luck. Your chance of connection is slim to none. I have various laptops, PCs, mobile devices with BT 4.0 and 5.0. The ones with 4.0 will have a hard time connecting, but the ones with 5.0, no issue whatsoever. Fast, responsive, and awesome connection when I need it. It may go to sleep from time to time as a power saving method, but the keyboard will connect to device within a second for typing. There's a momentary lag to wake up the connection within that half second or so, but full connection and responsiveness thereafter.Cons:The design of the keyboard and film don't allow proper stick on. Move the keyboard to the side a bit, and the protective film comes flying off. The film is not large enough to use an adhesive to hold the protective film down securely. Using tape to hold the protective film down looks a bit clunky and unprofessional.As mentioned earlier, better use the USB BT 5.0/5.1 dongles, or devices with built in BT 5.0 or better. Otherwise, a connection to the keyboard will be a 50/50 chance.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos Magno Carneiro da Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 17, 2023",
                "reviewTitle": "fui enganado",
                "reviewText": "o produto ao chegar no brasil eu tive que pagar taxa de importação...nao gostei disso pois nao fui avisar ao vendedor na hora da compra",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SreeSree",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 27, 2022",
                "reviewTitle": "Best portable keyboard, without any compromise in functionality",
                "reviewText": "Pros:> Has full keys, yet portable since avoiding keys between alphabets and numpad> Looks beautiful, sturdy, and is lightweight. Will not move while typing.> No delay between typing and appearing in screen. Since 2.4 Ghz adpter, it will outperform bluetooth keyboards.> Provided a protection sheet, which protects from dirt and water. It will not move even we type very fast> Has function lock (Fn + Esc). This will help to switch between shortcut keys and function keys. This is a life saver if we use for work from home and debugging code. This is not available in most of the portable keyboards.> Working perfectly fine with Android phone & tablet. Use the given type A to C adaptor for connecting wireless receiver to phone.> Has all enough indicator lights - capslock, numlock, Fn lock, and chargingCons:Nothing found as a drawback. One thing noticed is, if we use protection sheet (rubber) and typing very fast (80+ wpm), we feel some restriction to move fingers. But that is absolutely fine & expected and can't list as a drawback! Also, the charging port is micro USB, not type C. That is also can't be listed as a drawback since micro USB cable is given and we can connect it to our existing charger.This keyboard will be best if you need a portable, yet full keyboard for working and for general purpose. Use with Android devices, but quick switching is not needed. Need to use function keys without constantly pressing down 'Fn' keys (this is the case for most quick-switch blootooth keyboards).In brief - light weight, beautiful, full functioning, perfect keyboard!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51UBGruND0L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61L45ub315L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51YzlOnE0TL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elke Schuster",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 26, 2021",
                "reviewTitle": "Achtung, englische QWERTY-Tastatur",
                "reviewText": "Leider stand im Text nicht, dass sie eine englische Tastaturbelegung hat. Auch der Versand aus einem Nicht-EU-Land (GB) und damit steuerpflichtig, wurde nicht erwähnt. Für den Rückversand wird zwar ein Rücksendeschein angeboten, aber den kann man nur als Bild ausdrucken und Porto muss man erstmal selber zahlen. Diese Einschränkungen gehören in die Beschreibung. Keine Kaufempfehlung für Otto-Normalverbraucher.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenpur",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 9, 2023",
                "reviewTitle": "Great product",
                "reviewText": "Excellent",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jose Luis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 8, 2022",
                "reviewTitle": "No sirve, no dura mala compra",
                "reviewText": "Primero no tiene la n con tilde ya que es americano y segundo mis teclas numericas fallan y no se porque, me arrepiento de haberlo comprado",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}