{
    "remaining_requests": 41566,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Arteck-Universal-Multi-Device-Smartphone-Rechargeable/dp/B07VN47CYW",
    "body": {
        "name": "Arteck HB192 Universal Bluetooth Keyboard Multi-Device Stainless Steel Full Size Wireless Keyboard for Windows iOS Android Computer Desktop Laptop Surface Tablet Smartphone Rechargeable Battery",
        "price": "$29.99",
        "originalPrice": "$34.99",
        "rawPrice": 29.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Arteck-Universal-Multi-Device-Smartphone-Rechargeable/dp/B07VN47CYW",
        "soldBy": {
            "sellerID": "ALSLF3ULUWXC6",
            "name": "Arteck",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ALSLF3ULUWXC6&asin=B07VN47CYW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41v71ohjwLL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41mBVF5FSqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/316yucDK4yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vba805lPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eGecDDwAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ggv8yKN0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ipY4sgIEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Arteck Store",
            "link": "https://www.amazon.com/stores/ARTECK/page/8961EB42-6124-409A-88CB-BB090EF1BDA6?ref_=ast_bln"
        },
        "brand": "ARTECK",
        "merchantInfo": "Arteck",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 4783,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 16 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "3 Devices Switch with A Single Clicking: This keyboard is able to connect to 3 devices at the same time. You can switch between 3 devices with a single key clicking.",
            "Ergonomic design: Stainless steel material gives heavy duty feeling, low-profile keys, full size keys, arrow keys, number pad, shortcuts offer quiet and comfortable typing.",
            "Broad Compatibility: Use with all four major operating systems supporting Bluetooth (iOS, Android, Mac OS and Windows), including Computer, Desktop, PC, Laptop / iPad Pro, iPad Air, iPad, iPad Min, iPhone, Smartphone / Android Tablets like Samsung Galaxy, Surface etc.",
            "6-Month Battery Life: Rechargeable lithium battery with an industry-high capacity lasts for 6 months with single charge (based on 2 hours non-stop use per day).",
            "Package contents: Arteck Stainless Bluetooth Keyboard, USB charging cable, welcome guide, our 24-month warranty and friendly customer service."
        ],
        "description": "Industry Leading Ergonomic Design Stainless steel material gives heavy duty feeling and the low-profile keys offer quiet and comfortable typing. It allows you to gain quick access to common functions, such as volume level, playback control, copy paste text, and more. It also provides arrow keys, number pad with slim and compact design.Switch Between 3 Devices with A Single ClickingThis keyboard is able to connect to 3 devices at the same time. After you pair the keyboard with 3 devices by long pressing the blue key at the first time, you can simply switch the keyboard to type on any of the device with a single key clicking.Cross Platform Compatible Fully functional to all four major operating system: IOS / Android / MacOS / Windows, and features system-specific function keys for each operating systems. Any Bluetooth supported devices such as laptop, computer, tablet, smartphone can easily be paired and gained quick access to common functions, such as volume level, playback control, copy paste text, and more. Comfortable, quiet typing The whisper-quiet, low-profile keys bring a whole new level of comfort to your fingertips. What's more, keep all your most-used functions and media controls closer than ever Windows-dedicated hot keys. Keyboard with scissors kick construction can be used more than 3 million times continuously. Rechargeable Battery Built-in industry-high rechargeable Li-polymer battery provides 6-month use on a single charge. (based on 2 hours non-stop use per day)2 Years WarrantyIf you have problem to use the keyboard, you can reconnect the keyboard and the keyboard has 3 channels to change. If you still have the issue, you can contact the support team printed at the back of the keyboard as the product has 2 years warranty.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "16.9\"L x 4.9\"W x 0.16\"H"
            },
            {
                "name": "Item Weight",
                "value": "1.39 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Arteck"
            },
            {
                "name": "ASIN",
                "value": "B07VN47CYW"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 4,783 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#32 in Computer Keyboards"
            },
            {
                "name": "Date First Available",
                "value": "July 29, 2019"
            },
            {
                "name": "Brand",
                "value": "Arteck"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop, PC, iPad, Tablet, Smartphone"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth"
            },
            {
                "name": "Keyboard Description",
                "value": "Wireless"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Office"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic, Volume Roller, Lightweight, Low-Profile Key, Rechargeable"
            },
            {
                "name": "Number of Keys",
                "value": "110"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Material",
                "value": "Stainless Steel"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Raj Against The Machine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGR3TEAGQ3ZELMGXG2EAMJHGLIPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CA0DY8KFDGB?ASIN=B07VN47CYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2020",
                "reviewTitle": "5.0 out of 5 stars Great add-on for the stay-at-home office, definitely glad I got Bluetooth",
                "reviewText": "UPDATE: Nearly 3 years of near-daily use and it still works great. Even small spills of liquid or crumbs don’t seem to affect it. Holds a decent charge; I usually charge it every few weeks. My cat 🐱 jumps onto my desk and will occasionally press a key with her paws; causing a delightful havoc but no damage or other problems. I’m getting another one to use at the office now that we’re back; I’m hoping this will be much quieter than the wired Dell keyboard I have now, and also free up a USB port.After the first week of working from home on my living room couch, I decided I needed to move to a more productive and less distracting space in my downstairs den. I have a PC there with a wireless keyboard but it uses a USB dongle. To use it with my company laptop I'd have to move the dongle from my PC to the laptop. (Yes I know, First World Problem.) My laptop only has two USB ports in it, and I'd hoped not to take up a precious USB port as I need the other for my Jabra. I also didn't want to keep moving the dongle back-and-forth between computers.This has been a great alternative, in terms of price / value, convenience, construction quality, and features. They offer this in a cheaper version without Bluetooth, but I am glad I got this version. It took a couple triesd to pair with my laptop, but once I did it hasn't needed to be paired again since, and is fully functional. It has an on/off switch, but it will also turn itself off to save battery life after a few hours of non-use. Just tap a key or two and it comes awake.It can be set up to work with up to three different devices supporting Bluetooth, including phones & tablets (but I haven't tried that yet). There are three different buttons to tell the keyboard which device to connect to, so I can also switch it to use it with my home PC.It is thin and light, but the keyboard is almost full-size including a numeric keypad and arrow keys. This is nice for all of the Excel work that I do. The keys are somewhat flat and shallow, like the \"chiclet\" keyboards on some 80's computers, but I've gotten used to it. They have solid feedback, and I don't make many errors (except the ones I usually make anyway). One thing I haven't adjusted to yet is, sometimes when I want to use the left Shift key, I usually hit the Caps Lock key instead. I usually see my error and correct it, but I will have to adjust with time. Others here have noted the keyboard is not tilted, but I haven't found it to be an issue.It is also very solidly constructed and good quality so far. As I'm writing this during the Coronavirus pandemic, I do try to disinfect it occasionally (at least a few times a week) with a light mist of either isopropyl alcohol or hydrogen peroxide, and a wipe-down afterward. This has caused no issues to battery life, functionality, or appearance. I haven't tried bleach, nor would I recommend it.",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFHGIAVBWPRCRIONX42RASQ7GPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XIY9JGEXCGW4?ASIN=B07VN47CYW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent keyboard that checks all the boxes, designers put some thought into this one!",
                "reviewText": "So, it's a keyboard, aside from basic function it comes down to personal preference. The only thing I really want is a keyboard that is easy to type with and has quiet keys. I have really come to enjoy laptop style keyboards, specifically the 'scissor' switch style, they are short throw keys that have good tactile feedback (you know/feel when you pressed the key enough).This Arteck keyboard has excellent key movements in my opinion. I am finally moving from a Perixx wired keyboard to this one after being unable to find my normal USB keyboard. Of course I have some reservations about moving to a purely wireless keyboard (battery life, charging, etc).With those points in mind, I have not had any issues with this keyboard at all. The automatic sleep is well implemented, tapping any key wakes it up. I can easily go for a full week without recharging, and I can use the keyboard while it is charging. Bluetooth has had zero issues, (except when I go to airplane mode. DOH!). Bluetooth pairing was super easy, and the keyboard lights work very well to identify which pair I am using (can pair up to 3 devices).On the topic of lights, etc, here is another example of good design (at least in my opinion). The keyboard only has five lights, two are single function, one for charging, one for power. The other three are each dual function, LED 1 is for number lock or BT connection 1, LED 2 is for Caps Lock or BT connection 2, and LED 3 is for Function lock (nice feature!) or BT connection 3. The LEDs are green and stay illuminated when indicating a lock feature. For the BT connections they change to blue, but only stay on for a few moments. For the vast majority of your use the LEDs are green to indicate the features that are active on the keyboard.Overall: keyboard connects and just works. Keys feel great. No issues with lagging, and battery management has been excellent. No reservation at all to purchase again.Only possible downside: this keyboard was thinner than my last keyboard and felt uncomfortable when it first arrived. I added about 1/4\" of foam to the bottom to get similar height as my last keyboard.I am very much enjoying this keyboard and i hope this information helps the next person!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cdp",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 7, 2023",
                "reviewTitle": "Absolutely excellent bluetooth keyboard",
                "reviewText": "This is the third keyboard I've purchased from Arteck. Not because it's a poor product. The exact opposite. I've purchased two of the smaller bluetooth keyboards to use with tablets and phones, and they've been excellent. Long time between battery charges, ability to connect to multiple devices, good key feel, good response. Overall, quality products for a really decent price.So I wanted a full size keyboard to go with my desktop, and purchased this one. It was packaged nicely and came in excellent condition. It already had a charge on the lithium battery, so I used that to do my initial BT pairing with my Dell Windows 10 Pro desktop. That went very smoothly, and so I then plugged it into a USB adapter to fully top off the battery. I've been using it for over a week now... using it at least three to four hours per day, and when I just checked it's still over 75% battery remaining.There's a little key at the top right next to the bluetooth pairing keys, and if you press it, it will flash the blue power light once for every 25% of battery remaining. After a week of daily use, it's still flashing four times, so hardly any battery consumption at all. Which translates into not having to recharge it very often, which is a nice situation to find yourself in. A great feature so you don't get stuck having it die on you in the middle of your work. You can see when it's low and recharge it proactively.As noted, it has a really nice key feel, and it quite quiet. Truly, the only thing I wish it had were some pop out support legs on the underside to raise the back of the keyboard up off the desk at more of an angle. That is my one and only negative associated with the keyboard. And it's not a show-stopper by any means.Am I happy with it? Yes. Do I recommend it? Absolutely.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio MSergio M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 7, 2021",
                "reviewTitle": "Teclado",
                "reviewText": "La verdad tenia mis dudas al momento de comprarlo ya que tenia los teclados de Microsoft que el estilo son muy parecidos pero me lleve una grata sorpresa funciona al 100 y super comodo, liviano y no le falla nada. Ya lo probe con 3 dispositivos y funciona perfecto, en la foto tambien puse el mouse que tambien se conecta a 3 dispositivos y los audifonos bt lo padre es que no tienen problemas de interferencia con los demas dispositivos",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81g5KWo9iFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Krishna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 19, 2022",
                "reviewTitle": "Works fine, Bad packaging",
                "reviewText": "Package looks like its already opened.Also user manual is missing.Tested it working fine, so I kept it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FeO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on January 28, 2024",
                "reviewTitle": "高コスパ",
                "reviewText": "bluetooth接続も問題なく、複数PCの切り替えもスムースです。キータッチも打鍵感がしっかりしていて安っぽさがなく良い感じです。重さも適度に有るので安定しています。2,000円程度で買えたので非常に良い買い物でした。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "madcavs29",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 3, 2021",
                "reviewTitle": "Amazing battery life",
                "reviewText": "Great alternative to Logitech without the high price tag, awesome battery life. When connecting via Bluetooth to multiple devices its fast with no connection issues. Only negative point is there are no legs on the back to change the height, it may sit too low for some peoples liking.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}