{
    "remaining_requests": 41587,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Redragon-K552-RGB-Mechanical-Keyboard-Construction/dp/B019O9BLVY",
    "body": {
        "name": "Redragon K552 Mechanical Gaming Keyboard RGB LED Backlit Wired with Anti-Dust Proof Switches for Windows PC (Black, 87 Key Blue Switches)",
        "price": "$45.09",
        "originalPrice": "",
        "rawPrice": 45.09,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Redragon-K552-RGB-Mechanical-Keyboard-Construction/dp/B019O9BLVY",
        "soldBy": {
            "sellerID": "AAZRLVTNON75Z",
            "name": "Triplenet Pricing INC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AAZRLVTNON75Z&asin=B019O9BLVY&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09QVJDVHN"
        ],
        "asinVariationValues": [
            {
                "asin": "B019O9BLVY",
                "variationName": "Color",
                "variationValue": "Black RGB Backlit",
                "price": "$45.09",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ynHi9PksL._SS36_.jpg"
            },
            {
                "asin": "B07D3GB4N3",
                "variationName": "Color",
                "variationValue": "White RGB Backlit",
                "price": "$42.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41xs2r3kaxL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KeUXBORHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/518Ll5MWo-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eS62w5RnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qeipWk1uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oUFdgyNPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41M-erVk0AL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Redragon Store",
            "link": "https://www.amazon.com/stores/REDRAGON/page/C9D23970-BAEE-41FD-9E1B-F6B3A3B895ED?ref_=ast_bln"
        },
        "brand": "REDRAGON",
        "merchantInfo": "Redragon zone",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 14920,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 29 - March 5.",
            "FREE pickup March 24 - April 3",
            "Or fastest pickup March 8 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "87 Key Mechanical Gaming Keyboard with Custom Blue Switches for longevity with greater durability and responsiveness offering clicky medium resistance audible loud click sound crisp precise tactile feedback for typing and gaming",
            "LED RGB Backlit Mechanical Gaming Keyboard 18 different RGB lighting modes, 9 different colors, 5 backlight brightness levels, breathing speed. Precision engineered keycaps offering crystal clear uniform backlighting",
            "Anti Ghosting, ALL 87 keys are conflict free n-Key Rollover for ultimate Gaming performance. 12 Multimedia keys, Non-Slip Ergonomic, splash-proof Design with adjustable typing angle, High-Speed USB cable with gold-plated corrosion free USB connector",
            "Compact TKL Tenkeyless Ergonomic Designed Computer Keyboard Durable Metal-ABS Construction with Plate-mounted mechanical keys and switches that stand up during marathon FPS gaming sessions",
            "PC Gaming Keyboard Compatibility Windows 10, 8, 7, Vista, XP, Limited Mac OS keyboard support. Works well with all major Computers Brands and Gaming PC"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Video Games",
                "link": "https://www.amazon.com/computer-video-games-hardware-accessories/b/ref=dp_bc_aui_C_1?ie=UTF8&node=468642"
            },
            {
                "name": "PC",
                "link": "https://www.amazon.com/PC-Games/b/ref=dp_bc_aui_C_2?ie=UTF8&node=229575"
            },
            {
                "name": "Accessories",
                "link": "https://www.amazon.com/PC-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=318813011"
            },
            {
                "name": "Gaming Keyboards",
                "link": "https://www.amazon.com/PC-Gaming-Keyboards/b/ref=dp_bc_aui_C_4?ie=UTF8&node=402051011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "13.94 x 4.86 x 1.46 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.98 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Redragon"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B019O9BLVY"
            },
            {
                "name": "Item model number",
                "value": "K552-RGB"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 14,920 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,987 in Video Games (See Top 100 in Video Games) #759 in PC Gaming Keyboards"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "September 25, 2014"
            },
            {
                "name": "Brand",
                "value": "Redragon"
            },
            {
                "name": "Compatible Devices",
                "value": "Limited Mac OS keyboard support, Windows XP, Windows Vista, Windows 8, Windows 7, Windows 10"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wired"
            },
            {
                "name": "Keyboard Description",
                "value": "Gaming, Mechanical"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Gaming"
            },
            {
                "name": "Special Feature",
                "value": "Ergonomic, Anti Dust, Backlit, Mechanical Keyboard, Spillproof"
            },
            {
                "name": "Color",
                "value": "Black RGB Backlit"
            },
            {
                "name": "Number of Keys",
                "value": "87"
            },
            {
                "name": "Keyboard backlighting color support",
                "value": "RGB"
            },
            {
                "name": "Style",
                "value": "Modern"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "K552-KR K552-RGB K551-KR K551-RGB MSRP 34.99 / 39.99 43.98 / 48.99 39.99 49.99 Colour Option Black / White Black / White Black Black Switch Type Outemu Red Switch Outemu Blue Switch Outemu Red Switch Outemu Blue Switch Lighting Rainbow RGB RGB Rainbow RGB RGB Lighting Modes 19 Different Rainbow RGB Lighting Modes 18 Different RGB Lighting Modes, 9 Different Colors 19 Different Rainbow RGB Lighting Modes 18 Different RGB Lighting Modes, 9 Different Colors Size Compact TKL (87 Keys) Compact TKL (87 Keys) Full Size (104 Keys) Full Size (104 Keys) Anti-ghosting Keys 100% Anti-Ghosting 100% Anti-Ghosting 100% Anti-Ghosting 100% Anti-Ghosting",
                "media_link": []
            },
            {
                "media_text": "S113-KN K552-RGB-BA S117-KN K551-RGB-BA Combo Type 2 in 1 2 in 1 2 in 1 2 in 1 MSRP 41.99 54.99 42.99 55.99 Colour Option Black Black Black Black Switch Type Outemu Brown Switch Outemu Blue Switch Outemu Brown Switch Outemu Blue Switch Lighting Rainbow RGB RGB Rainbow RGB RGB Lighting Modes 19 Different Rainbow RGB Lighting Modes 18 Different RGB Lighting Modes, 9 Different Colors 19 Different Rainbow RGB Lighting Modes 18 Different RGB Lighting Modes, 9 Different Colors Size Compact TKL (87 Keys) Compact TKL (87 Keys) Full Size (104 Keys) Full Size (104 Keys) Keyboard Construction ABS Construction Metal / ABS Construction ABS Construction Metal / ABS Construction Mouse RGB Backlit up to 4200 DPI RGB Backlit up to 7200 DPI RGB Backlit up to 4200 DPI RGB Backlit up to 7200 DPI",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/7f1024b2-c527-4907-9bf6-4d4f2680b600.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/89ebfa6e-1a1b-4ce6-bc59-cb29d92dba9a.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f88c10e0-b337-4388-ab86-0a8ea6605c99.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/aed4d5da-faa3-4c02-8b89-67600b3a548d.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/a1eb5116-d978-400b-9714-c958b1b74b3c.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/1da8c6f5-5700-4884-b525-19ca4cabfa73.__CR0,0,450,900_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/31c5d4dc-64d4-43ce-8ac6-e8d00f17064c.__CR0,0,450,900_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/dae6e8fa-98ca-4ad1-b1e0-9ab2b236eb2a.__CR0,0,450,900_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/aa79e1cf-d0e4-41d9-b764-5d1ac22d0099.__CR0,0,450,900_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f24099b6-56f0-400c-a15d-46c4e7a5ee57.__CR0,0,450,900_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/c8274875-cfb2-4bb0-b830-7bc77f695374.__CR0,0,450,900_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/924d45e4-fa4f-48e3-806b-317eb1e5fda9.__CR0,0,450,900_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sc/cc923069-7597-48cf-a62c-b9f40de52318.__CR0,0,450,900_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "WillWill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2XUEPHRYVWIDZDYNVZJMMNU7SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W250HZZJ0OOL?ASIN=B019O9BLVY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2020",
                "reviewTitle": "5.0 out of 5 stars Solid keyboard with lots of features",
                "reviewText": "Reviewed: White w/ RGB lights, blue switchesOverall rating: 9/10 (36/40 = 90% recommendation)After doing alot of research, I chose this keyboard based on a few factors that were very important to me: PRICE, QUALITY, FUNCTION, & AESTHETICS. As I was in the market for a keyboard for the purposes of typing, gaming is not a factor in this review. Overall, I think this keyboard delivered pretty well in almost all areas that were key in my purchasing decision.Price: 10/10Of course I would always want the lowest price possible, but I think given the quality and features of this keyboard, the price is pretty reasonable - especially considering that it feels substantial (overall good build quality, metal construction) and the high number of very customizable lighting effects. At this price, from what I could find, this keyboard simply can't be beat.Quality: 10/10I am really impressed by how solid this keyboard feels. The base is sturdy, the LEDs are very bright (with beautifully smooth transitions), and the blue switches provide delicious tactile and audible feedback. It makes this keyboard truly a joy to use (yes, I am writing this review with it right now!). The keycaps themselves are a hard plastic that adds to the well-made and solid feeling of the keyboard overall.Function: 7/10While overall the keyboard is received is perfectly functional, I was ideally looking for one in this same style (white, RGB, mechanical), but with a 10 key number pad built in as well. It just does not exist for the most part. There are other brands that provide the 10 key functionality, but based on those reviews they are either not good quality, or in my search others were out of the price range for what I was willing to spend. Additionally, I use a Mac - while this keyboard is basically compatible, I would love to see some options for an RGB mechanical keyboard that is more made for Mac. This one gets the job done - but it does leave some to be desired as far as dedicated features go. As I stated earlier under quality, the function of the keys is incredibly satisfying to type on. I have also found the functions to choose the color pattern and speed of the LEDs to be straightforward and easy to use. I am particularly impressed by the smooth, beautiful transitions and fades of the built-in patterns.Aesthetics: 9/10Finally - I was specifically looking for a white mechanical keyboard with RGB functionality. I know that this limited my options substantially right off the bat. I chose this one because the layout is simple and beautiful, the range and possibility of LED color combinations, and for its compact size (if I couldn't find a 10 key option, I figured my next best bet was to choose one that was reasonably compact). The font of the keycaps is not a personal favorite of mine, so I could see myself potentially changing out the keycaps at some point, but that is a low priority for me in the grand scheme. Overall, this keyboard looks great on my desk and I am really pleased with the compact size and the white color. Other than not having a 10 key option, this keyboard was aesthetically almost EXACTLY what I had envisioned.Overall I am very satisfied with this keyboard and I am happy that I chose it. I will update this review should anything change or if I realize I forgot to mention any important aspects. I hope this review has been helpful to you, and thanks for reading!",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Qmf+nISHL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rita and Craig",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMAOAIPXNDZUYL53GDPX4YARUZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R17XGVNQAW70?ASIN=B019O9BLVY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2020",
                "reviewTitle": "5.0 out of 5 stars Improves speed and acurracy.",
                "reviewText": "I love this keyboard. I have it set to solid purple and my mouse matching it. It has many, many options. It is kinda fun to play with the light options although I leave it set to a solid color when I am using it. It is loud, but that turned out to be a good thing. You can hear when a key is pressed hard enough to produce a letter and you don't have to watch your screen for visual confirmation of that. This allows you to watch keyboard as you type if needed. This will lead to fewer mistakes and missed keys or double keys. My daughter said it was loud, but her typing was great on it.My daughter tried my keyboard and is getting one just like mine. I ordered a different model for my husband. He needed programmable macros and this one does not have 10 key or programmable macros. He does use 10 key. This seems to be a good company based on my past experience with their other products. This keyboard appears to be better made than any keyboard I have owned. It takes up less space and I never use the 10 key on keyboards. I needed a smaller keyboard because I have a Midi and a pen tablet taking up real-estate on my desk. I am able to game longer without having to rest my hands.I had no problem learning to setup the lights like I wanted. There are way more options than I expected. I'm really happy I got the RGB model. The included manual mentioned software and a site but I learned this model is plug and play and doesn't need an app to use. There was different site for the products on Amazon and it listed as plug and play 100%. If you loose the manual, its on site with instructions on changing and setting up the keyboard with key commands. The different model I got my husband had a driver there and I was able to verify that before I ordered his model.We have all been using the Perdition Mouse M901 for a while. We loved the mice and they have lasted. My daughters is the very first model and its its still great and she games all the time. Also its nice that my keyboard and mouse kinda match and look good together. My desk looks so much better with these on it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tenli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 2, 2023",
                "reviewTitle": "It’s awesome",
                "reviewText": "I got this to replace my razor huntsmen mercury which I decided to spill soup all over. I didn’t have money to buy a new one at the time so after hella searching, I got this. It was supposed to be temporary but I love it so much I’m not replacing it unless it breaks- I’d still buy this one again tho. The quality feels the same to razor for the most part. The 75% gives me so much space on my desk too !! :) 10/10 buy. Price range is so worth it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rodrigo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 27, 2022",
                "reviewTitle": "Me impressionei de como é bom!",
                "reviewText": "O teclado eu relutei muito em comprar e finalmente ao adquirir percebo como ele é fantástico. Resistente, bonito, \"macio\" de se digitar, é fácil de limpar e tem deixa meu setup incrivelmente belo.Acabei tendo um incidente nele e caiu água nele, tirei todos os botões pra ir fazendo a limpeza e com medo de ele ter pifado... nada, a água não danificou nada! Estou muito satisfeito com o ele.Só acho que devo pontuar que, se você é uma pessoa que gosta de teclados mais baixos ou mais suaves, pode se incomodar com esse teclado, pois as teclas são um pouco mais altas do que um teclado tradicional, mas nada que incomode, apenas se você só for do tipo que gosta de algo mais fino.No mais, é um produto excelente, pode comprar sem medo.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nat",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 7, 2022",
                "reviewTitle": "Vale la pena",
                "reviewText": "Lo compré hace como dos meses y sigue funcionando de maravilla, es justo lo que quería 🫶🏻",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leay IrarrefLeay Irarref",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 5, 2021",
                "reviewTitle": "Teclado bonito y barato.",
                "reviewText": "Llevo poco tiempo con él, pero me encantó (Excelente precio).Siempre he evitado los teclados sin reposamuñecas porque siempre se me han hecho incómodos, pero al ver que necesitaba un nuevo teclado debido a que mi anterior teclado estaba empezando a fallar, decidí optar por este aprovechando que desde hace tiempo quería probar un teclado de Redragon.Lo del reposamuñecas no fue problema y es bastante cómodo a la hora de teclear y jugar, pero yo le coloqué el reposamuñecas por gusto personal, ahí cada quien. Siento que es un teclado robusto, y sin pad numérico me da más espacio para mover el mouse, cosa que me agrada mucho.La iluminación es buena (muy buena en mi opinión), pero no es tan potente como la de mi anterior teclado, aunque para mí la iluminación no es tan importante. Además, tiene su software para controlar la iluminación y macrosMe encantó el sonido del teclado y el tacto, es algo ruidoso, sí, pero comparando el sonido con el de mi otro teclado este se escucha y se siente mejor.Aunque pensé que las letras de las teclas se verían como las de la foto, el teclado llegó con otras, pero está bien.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81fpM2kCLJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/91DrG-LjTYL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shreyansh DubeyShreyansh Dubey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 18, 2024",
                "reviewTitle": "Gorgeous!",
                "reviewText": "The media could not be loaded. I Prefer Blue Switches. They Keyboard is Just Prefection With RGBs and Tactile Feedback.Overall, Very Fabulous Product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61wQLxOiyuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61SfgPh3wDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61y5opuh-YL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/I/E1pu2jIjJDL.mp4"
                }
            }
        ],
        "otherSellers": []
    }
}