{
    "remaining_requests": 41594,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Logitech-Wireless-Solar-Keyboard-K750/dp/B00ZRXMWIS",
    "body": {
        "name": "Logitech Wireless Solar Keyboard K750 - for Windows (Renewed)",
        "price": "$49.49 - $39.99",
        "originalPrice": "$54.52",
        "rawPrice": 49.49,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Logitech-Wireless-Solar-Keyboard-K750/dp/B00ZRXMWIS",
        "soldBy": {
            "sellerID": "A3CKIKHY8A30VC",
            "name": "U.S.A Strong",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3CKIKHY8A30VC&asin=B00ZRXMWIS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07CSGDZ8P"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "11",
        "stockDetail": "Only 11 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41lGvdxh3sL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41-z5rbnJPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41za309m6bL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518hC3KoZlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gULF7e4PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Od7mMEbaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31xSxDT5m L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Lifecycle Pro",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 123,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "FREE delivery Friday, February 16."
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Carbon Neutral Certified by SCS Global Services means the product’s carbon emissions have been measured and reduced, with any remaining emissions offset. Pre-owned Certified: Electronics products are inspected, cleaned and (if applicable) repaired to excellent functional standards. Buying Pre-owned extends a product's life, reducing e-waste and raw material extraction."
        },
        "features": [
            "Light-powered keyboard: The keyboard charges itself with lamplight or sunlight. Easily monitor your power level with the Logitech Solar App.",
            "You pop the tiny Logitech Unifying receiver in your notebook and leave it there. You can even add more devices. Plug it. Forget it. Add to it. Learn more about the Logitech Unifying receiver.",
            "With sleek lines and a thin profile, this stylish, streamlined keyboard adds style to your workspace—whether you’ve got a laptop or desktop.",
            "Treat your hands right with keys that feel good and make every keystroke comfortable, fluid and whisper-quiet.",
            "It almost feels like typing on your laptop, but more comfortable."
        ],
        "description": "Say goodbye to battery hassles. Any light source keeps Logitech K750 keyboard charged and ready. The streamlined designed adds sleek style to your workspace and the keys are designed for comfortable typing hour after hour.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Computers & Accessories",
                "link": "https://www.amazon.com/computer-pc-hardware-accessories-add-ons/b/ref=dp_bc_aui_C_2?ie=UTF8&node=541966"
            },
            {
                "name": "Computer Accessories & Peripherals",
                "link": "https://www.amazon.com/Computer-Accessories-Supplies/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172456"
            },
            {
                "name": "Keyboards, Mice & Accessories",
                "link": "https://www.amazon.com/Computer-Keyboards-Mice-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11548956011"
            },
            {
                "name": "Keyboards",
                "link": "https://www.amazon.com/Keyboards-Mice-Computer-Add-Ons-Computers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=12879431"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "7.87 x 1.38 x 19.09 inches"
            },
            {
                "name": "Item Weight",
                "value": "2.2 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Logitech"
            },
            {
                "name": "ASIN",
                "value": "B00ZRXMWIS"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 123 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,102 in Amazon Renewed (See Top 100 in Amazon Renewed) #3,651 in Computer Keyboards #3,904 in Climate Pledge Friendly: Computers #4,037 in Renewed Computers & Accessories"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 16, 2015"
            },
            {
                "name": "Brand",
                "value": "Logitech"
            },
            {
                "name": "Compatible Devices",
                "value": "Laptop"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wireless"
            },
            {
                "name": "Keyboard Description",
                "value": "Wireless"
            },
            {
                "name": "Special Feature",
                "value": "Wireless"
            },
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Number of Keys",
                "value": "90"
            },
            {
                "name": "Style",
                "value": "PC"
            },
            {
                "name": "Included Components",
                "value": "USB Cable"
            },
            {
                "name": "Hand Orientation",
                "value": "Ambidextrous"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCJVFJMVHMUNCFN4IRNBK2KYGVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR2695GHFEENA?ASIN=B00ZRXMWIS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 28, 2015",
                "reviewTitle": "5.0 out of 5 stars Well worth it!",
                "reviewText": "Been using a Lenovo wireless keyboard for a while now at work. Although the size of the Lenovo keyboard was excellent for me (I hate compact keyboards!), the buttons and overall feel and layout of the keyboard were not comfortable at all. I work on MS Word many hours a day and felt the need to look for something more comfortable.This Logitech keyboard is a definite improvement! Build quality is excellent and you can feel it is not a cheap keyboard. The buttons are comfortable and spaced logically to feel so you won't hit two buttons at the same time. And although the size is just slightly smaller than the Lenovo keyboard it is a good size and didn't feel smaller. The solar power feature is also fantastic as this doesn't need recharging or batteries.My only menial complaints are that the standoffs on the back of the keyboard could have been a little longer as the keyboard is very thin and even with the standoffs it feels only slightly tilted, The other complaint is that the face of the keyboard has a glossy finish which, while it gives it an elegant look, can be a fingerprint magnet. However those complaints do not take from the overall experience of this keyboard which I will definitely get another one for my PC at home.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Actaeon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHD2BCZ6ZJU74JN2VL745S662E3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRSF1P9MCPIYF?ASIN=B00ZRXMWIS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2022",
                "reviewTitle": "5.0 out of 5 stars A little pricey, but you get what you pay for. . .",
                "reviewText": "Best keyboard I've ever used (and I've been in IT for 25 years). I've owned 3 of these, (2 mac, one PC), and there just isn't a keyboard out there that lasts this long, and feels as close to an OG macbook as this one. Couple that with the fact that the solar just always works... (no literally, like the one I'm typing on hasn't been outside or intentionally charged in any way in 3+ years, and it always just works). I wouldn't buy anything else.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christoph A. Lebl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMUWQFB6RERWOGPK4WMFI7HOALQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XD6X60NLI79E?ASIN=B00ZRXMWIS",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2018",
                "reviewTitle": "1.0 out of 5 stars Do NOT buy refurbished - the refurbishment or testing process is not good enough.",
                "reviewText": "This is a review of the refurbished keyboard. This is my second Solar-Powered Keyboard from Logitech. My first one I purchased new and I LOVED it. The purchased-new one has worked flawlessly for years. The refurbished one suffers from missed keystrokes, and space-bar not working at all. Already reached out to the seller and keep you posted how that works. Wish I would have purchased a new one.My take: Do NOT buy refurbished - the refurbishment or testing process is not good enough.UPDATE: Seller responded quickly and offered a return. Won't work for me as the exchange policy only applies for the US. In my case I bought the \"certified refurbished\" keyboard while on a business trip in the US. Well - lessons learned - don't by refurbished - their quality control is not up-to-par",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Toobizzee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEVN5ODQSHC4XMCXX7DSUE4PXOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28Q0DJROOPLAS?ASIN=B00ZRXMWIS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2015",
                "reviewTitle": "5.0 out of 5 stars Loved it. Bought another for work",
                "reviewText": "Loved it. Bought another for work, as they gave me a different one there with a big wrist rest (who uses a wrist rest anyway?). Feels like you're typing on your laptop and it's quiet. I like that it's similar to the laptop, feel is the same so I make less mistakes that way when i cross from one to the other. No lag. Stays charged. Impressed with it so far and like that i don't have to worry about the battery.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JoeInTampaJoeInTampa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQK3XLCHO54I7WFJVUULTI4WKAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GX1HT6QVEKV6?ASIN=B00ZRXMWIS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2016",
                "reviewTitle": "4.0 out of 5 stars Comfortable, responsive keyboard that connected instantly and stays charged with solar cells.",
                "reviewText": "Great keyboard feel and very comfortable to use. Immediately connected to the existing Logitech unifying receiver in place for an existing mouse. The keyboard stays at usable charge level at all times, even though it is not in a very well lighted area. When not in use, I slide the keyboard drawer into its place under the top of my desk, but the keyboard still works perfectly. The only issue I have with this refurbished keyboard is that a part of the clear plastic cover over the solar cells is slightly detached from the surface (see photos). This hasn't caused a problem, but the opening may allow dust to accumulate over time, which I assume would degrade the capacity of those cells. I will fix it with a spot of glue, but in a carefully refurbished device, I did not expect this obvious an imperfection. Other than that one loose bit, the board looks like new with absolutely no signs of wear. Would not hesitate to buy another one.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61Y9HqEzOeL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71Yeq-KQC-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDV4XKK2THHU2CV7GQTQPEIDPDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S6VRASVFDL79?ASIN=B00ZRXMWIS",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2023",
                "reviewTitle": "2.0 out of 5 stars Thin and flimsy",
                "reviewText": "Works as advertised, but it has a really cheap, flexing feel to it. Just plug in a wireless at the end of the day when you're done.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Critical Assessment",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3ZMBIP7WENLQVFG7QBDLGGZCUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IDRSYKKTH58J?ASIN=B00ZRXMWIS",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2018",
                "reviewTitle": "3.0 out of 5 stars Good, but only maintains charge in a well lit room; no alternative charging method; replacement keys are exorbitantly expensive.",
                "reviewText": "This keyboard is great with the primary draw-back that there is no charging option other than Solar, and if you don't use it in a well lit room, the battery will fade and become unmanageable. Buying two keyboards let's you recharge one while using the other, as well as providing a cheap source of backup keys! The action on the keyboard is nice, and as someone who types well over 100wpm, programs and games, I feel I can confidently claim almost all users will be happy with the low profile, well spaced, springy and responsive keys. Even after years of use, most keys remain springy with only a few getting 'soft'.. usually due to food or other matter stuck behind the keys. The 'F' and 'J' keys have an identification bump making typing or even gaming in the dark reasonable even though the keys have no lighting. A nice range of functions compatible with both Mac and PC, I have used both systems while owning no other keyboards, and been pleased for the most part. In a moderately well lit room, the keyboard battery should last around 2 years in my experience. There is no USB port on this keyboard, and the battery tray is designed to be very difficult to open (there's no tool that makes it easier), and will break if repeatedly opened. Once broken, the battery tray still stays in place sufficiently, and becomes much easier to remove/replace... I have intentionally broken or clipped all of my trays so that I can swap them out. A single key for this keyboard can cost over $20-$40 or more, and coupled with the absence of an alternative to solar charging, makes buying a second keyboard seem to be the smart choice if you either lose your charge, or to replace a key. (I lost my left 'ctrl' key, and the solution was to buy a new keyboard :-( The Logitech Unifying receiver is an inferior piece of technology which, for some reason, Logitech cripples all of their wireless devices with. These wireless receivers are prone to interference if the USB receiver is placed next to any other connected USB device. More than two devices will often interfere with each other, and the entire system works on a line of site premise meaning if your leg is between the keyboard and the receiver, your keyboard may well become unresponsive. (I have experienced this with my receiver less than 3 feet from the keyboard) When the connection is lost, the keyboard will buffer your keystrokes, then once the connection is re-established, it will send all buffered keystrokes as well as whatever you're pressing at the time. It's fairly impossible to tell, however, when it will buffer keystrokes vs. when they simply aren't being received, so when your connection is interrupted, you will rarely know whether you just need to move the keyboard and wait for the keystrokes to register vs. when you need to keep hitting keys to get your system to respond to you. Despite having to plug in a custom USB receiver, logitech universal devices do not connect to your computer until you have completed the software setup. This means that if your driver is lost, corrupted, or your computer does not load the driver, this keyboard will not work. If you don't have a backup (non-logitech wireless) keyboard, you very likely will be unable to get in to the logitech unifying software to re-initialize your keyboard. Because I had all wireless products, I have encountered situations where I could no longer use my computer until I jogged out to get a backup keyboard that works when plugged in.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shawn Fairweather",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 20, 2019",
                "reviewTitle": "Good doing business with.",
                "reviewText": "Good product, never need to put batteries in. Product was from AWS but looks basically brand new",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nigel M Burnett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 31, 2019",
                "reviewTitle": "Excellent for a refurb",
                "reviewText": "Seems the F1 key is really touchy. The slightest pressure sends a score of F1s. Other than that, it's perfect. I have three now; one for each computer. One is several years old, looks terrible, and works perfectly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}