{
    "remaining_requests": 17720,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Free-Live-Womens-Dolman-Sleeves/dp/B09PQJS52P",
    "body": {
        "name": "Free to Live 3 Pack Dolman 3/4 Sleeve Business Casual Tops for Women Shirts Fall Dressy Tunic Travel Clothes Work Outfits",
        "price": "$42.95",
        "originalPrice": "",
        "rawPrice": 42.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Free-Live-Womens-Casual-Flowy/dp/B07BLTR9FC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B07BLTR9FC"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CPTQ67LG",
                "variationName": "Color",
                "variationValue": "Black (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ojT3W3tfL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09PQH17LN",
                "variationName": "Color",
                "variationValue": "Black, Charcoal, Navy",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41c6sUU89RL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0BLTSQYNB",
                "variationName": "Color",
                "variationValue": "Black, Heather Grey, White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41FqIpGjwKL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09PQ9GH8L",
                "variationName": "Color",
                "variationValue": "Black, Olive, Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41S5p8CF-nL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CPTQ8MBW",
                "variationName": "Color",
                "variationValue": "Charcoal (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41hyPNj179L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSCJMXM",
                "variationName": "Color",
                "variationValue": "Heather Grey (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41CM2LkiBnL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CPTR2DNK",
                "variationName": "Color",
                "variationValue": "Navy (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41nzBCiYEOL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSJK87H",
                "variationName": "Color",
                "variationValue": "Purple (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41kVUd+YFiL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0BLTRQF1F",
                "variationName": "Color",
                "variationValue": "Purple, Rose, White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41FTmXniKlL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSR3XTY",
                "variationName": "Color",
                "variationValue": "Rose (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41xtD6p1ggL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09PQDR3MN",
                "variationName": "Color",
                "variationValue": "Teal, White, Wine",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41-xo5+HFmL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSZR8DR",
                "variationName": "Color",
                "variationValue": "White (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31kSpcRJd2L._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSLZPD8",
                "variationName": "Color",
                "variationValue": "Olive (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41oqgSwfRVL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSCJPH2",
                "variationName": "Color",
                "variationValue": "Red (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41uxL91zFFL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSSBPCP",
                "variationName": "Color",
                "variationValue": "Teal (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41EBQyYWezL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B0CSSPVVVW",
                "variationName": "Color",
                "variationValue": "Wine (Single)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41hHxLTmEdL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B09PQHXQ1G",
                "variationName": "Size",
                "variationValue": "Small",
                "variationImageURL": null
            },
            {
                "asin": "B09PQ9GH8L",
                "variationName": "Size",
                "variationValue": "Medium",
                "variationImageURL": null
            },
            {
                "asin": "B09PQPBHCB",
                "variationName": "Size",
                "variationValue": "Large",
                "variationImageURL": null
            },
            {
                "asin": "B09PQJS52P",
                "variationName": "Size",
                "variationValue": "X-Large",
                "variationImageURL": null
            },
            {
                "asin": "B09PQB3SVK",
                "variationName": "Size",
                "variationValue": "XX-Large",
                "variationImageURL": null
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41S5p8CF-nL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41iZGA4VPnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41x 73EQiaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41MfxwEHLtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HoAix4-jL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JC0UYlufL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B1QiDWSX8RL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73de1a25-b14c-4216-95f1-bbfdf05a1fa4/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Free to Live Store",
            "link": "https://www.amazon.com/stores/FreetoLive/page/B8104AB4-B848-4D46-B83D-1BD5FF6549CA?ref_=ast_bln"
        },
        "brand": "FreetoLive",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 2749,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type 95% Rayon, 5% Spandex",
            "Care instructions Machine Wash",
            "Origin Made in USA or Imported (Vietnam)",
            "Closure type Pull On",
            "VERSATILE (No elastic shirring) - Not banded bottom nor ruched tops which makes it a nice option to cinched waist tops, these are draped blouson tunic tops for women loose fit flowy on top but tight on the bottom so you can style as gathered waist belly flattering tops to hide tummy or pull down long enough for extra coverage. Versatile womens tshirt pack dressy casual, perfect for summer, fall tops for women, spring, winter, as party tops, yoga top, workout, and even great as a maternity top!",
            "Super soft and comfortable 3/4 sleeve tops for women, a dressy tops women's clothing. These 3/4 sleeve shirts for women or dolman sleeve tops for women are highly recommend as casual work tops for women, business casual outfits for women or casual office clothes for women, travel shirts or teacher outfits for women, can be dressed up or down as long sleeve tunic tops to wear with leggings, with jeans or with skirts, or just to wear around the house. It's a perfect elbow sleeve tops for women.",
            "You'd love these 3 quarter sleeve tops for women, great business casual clothes for women, casual shirts for women dressy casual tops to hide belly for women, a perfect shirts to hide belly fat women ideal figure flattering curvy women outfits and tops for big busted women. These boat neck batwing three quarter length sleeve tops for women are perfect as work outfits for women office casual, a must-have basic tops for women pack capsule wardrobe pieces! Available in small, medium, large to xxl.",
            "These 3/4 length sleeve womens tops rayon tops for women are great lightweight sweaters for women and a perfect dolman tops for women casual fall. These womens tops dressy casual can be pulled down as long shirts for women to wear with leggings or shirts to wear with skirts for women. Basic lightweight long sleeve shirts for women summer tops 2023 trendy, these 3 quarter length sleeve tops for women are easy to pair with anything, available different colors: teal, navy, red, white, black, etc.",
            "SIZE/ COLOR - Please check the size chart BELOW (not Amazon size chart) to ensure you order the right size for you. Color disclaimer: we always strive to make our colors as accurate as possible but due to monitor settings, there might be a little difference from exact color of the product. 100% SALES SUPPORT - Package comes in single pack of your selected color. Should you have any concern on your orders, please feel free to let us know. Your satisfaction is our #1 priority."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Women",
                "link": "https://www.amazon.com/Womens-Fashion/b/ref=dp_bc_aui_C_2?ie=UTF8&node=7147440011"
            },
            {
                "name": "Clothing",
                "link": "https://www.amazon.com/Womens-Clothing/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1040660"
            },
            {
                "name": "Tops, Tees & Blouses",
                "link": "https://www.amazon.com/Womens-Tops-Tees/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2368343011"
            },
            {
                "name": "Tunics",
                "link": "https://www.amazon.com/Womens-Tunics/b/ref=dp_bc_aui_C_5?ie=UTF8&node=5418125011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 10.79 x 10.2 x 2.44 inches; 1.19 Pounds"
            },
            {
                "name": "Department ‏",
                "value": "‎ womens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 9, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Free to Live"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CPTPZ4K1"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,893 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #308 in Women's Tunics"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 2,749 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Elevate Your Style with the Free to Live 3 Pack Dolman 3/4 Sleeve Business Casual Tops for Women Experience unparalleled comfort and undeniable elegance with our 3/4 sleeve shirts for women. This collection of versatile tops is meticulously designed to blend seamlessly with your wardrobe, whether you're dressing up for the office or enjoying a casual day out. Effortless Sophistication Indulge in the beauty of our meticulously crafted tops with blouson tops for women. The batwing sleeve design adds an air of sophistication, while the relaxed fit provides comfort without sacrificing style. Embrace the flattering allure of the dolman sleeve tops for women and the timeless charm of the scoop neck tee. A Wardrobe for Every Occasion Discover the ultimate balance between style and comfort. Our tops effortlessly transition from business casual outfits for women to versatile casual tops to wear with jeans. Whether you're meeting clients or catching up with friends, these casual tops for women will always make a statement. Unmatched Comfort, Unbeatable Confidences into a world of comfort with the soft embrace of our fabric. The long shirts for leggings offer coverage and confidence, making them perfect for office wear and beyond. The 3 quarter length sleeve tops for women add an element of style, making these tops your year-round companions.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28666f4a-bd0b-4855-bc3f-325c779e27c0.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Designed for You Our tops cater to every body, including clothes for big busted women. The tunic tops to wear with leggings provide a graceful drape that flatters all figures. From the office to evenings out, our tops are the epitome of versatility. Packed with diversity, from women's tunic tops and womens long sleeve tops to the versatile tunic tops for women loose fit, these shirts are perfect to be paired with skirts as shirts to wear with skirts for women. The collection, while highlighting business casual tops for women, does not shy away from showcasing pieces perfect for a women's dress shirts look or a more relaxed women's t-shirts feel. With this pack of womens tops, every outfit, whether dressy casual or strictly business, finds its match. Your Style, Your Choice Whether you're dressing up for work or looking for tops for women casual fall, our collection empowers you. Express yourself confidently with our range, including woman casual tops and woman shirts casual. The pack of tops for women provides that you're prepared for any fashion challenge. Elevate your style and exude confidence with the Free to Live 3 Pack Dolman 3/4 Sleeve Business Casual Tops for Women. Embrace the blend of comfort, elegance, and versatility that's designed to empower your every move. Discover a new level of style and comfort with our collection of 3 quarter length sleeve tops for women. These tops are designed to effortlessly complement your wardrobe, whether you're aiming for a professional look or a casual outing. Dolman Design: Where Comfort Meets Elegance Unleash your inner elegance with our batwing sleeve tops for women featuring the unique dolman sleeve design. This design not only enhances your style but also provides a comfortable and relaxed fit. Our dolman sleeve blouse for women takes sophistication to the next level, giving you a confident look for any occasion.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/edc41d3a-b4d3-47e4-a27c-32cbfecd1469.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "A Palette of Styles From business casual outfits for women to casual tops to wear with jeans, our dolman long sleeve tops for women are your versatile companions. Whether you're conquering the boardroom or relaxing with friends, these tops effortlessly adapt to your style and comfort needs. Comfort that Flatters Embrace the comfort of our fabric while flaunting your elegance. The figure flattering tops for women are tailored to enhance your natural beauty, while the flattering tops to hide tummy give you the confidence you deserve. Pair them with our long shirts for women to wear with leggings for a chic and cozy ensemble. Empower Your Professional Journey Navigate your workday with confidence in our office clothes for women collection. Elevate your style with our women business casual outfits, combining professionalism and comfort seamlessly. Express your uniqueness with the perfect blend of elegance and confidence. Versatility Beyond Limits Explore a range of styles with our black shirts for women and red tops for women dressy casual. Add a touch of elegance with our white dress tops for women and white tops for women dressy casual. From the boardroom to casual outings, our draped dolman top transition effortlessly, ensuring you're always in style.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/73a7345c-3302-4588-a3b5-de64b3ef8ed4.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Elevate your wardrobe with the pack of long sleeve shirts women. Experience the fusion of comfort, style, and confidence that redefines your everyday elegance. Immerse yourself in the world of fashion and comfort with our exclusive collection of basic tops for women pack. These tops are meticulously designed to be the cornerstone of your wardrobe, providing a versatile and stylish solution for various occasions. Unleash Elegance with Dolman Design Embark on a journey of sophistication with our tops showcasing the distinctive dolman sleeve desig. This signature element exudes a sense of style while ensuring a relaxed and comfortable fit. Experience elegance redefined with the captivating allure of the dolman shirt and the chic appeal of the dolman sleeve t shirts for wome. Seamless Versatility for Every Moment Navigate your day with seamless style, transitioning effortlessly from professional to casual settings. Explore the charm of our work clothes for women, designed to empower your office attire. Embrace the fluidity of our collection, including the graceful womens dolman sleeve tops and the versatile womens dolman top. Adorn yourself with casual elegance using our womens shirts casual and womens shirts to wear with leggings. Casual Chic, Elevated Confidence These tops are artfully crafted to accentuate your curves while ensuring enduring comfort. For colder days, explore the cozy comfort of our collection, featuring a range of womens sweaters.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d680f006-25b1-435e-b763-79204b722d6c.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Universal Fit & All-Occasion Tops Empower Your Professional Journey Forge your path with confidence in our meticulously curated work clothes for women selection. Our tops seamlessly blend sophistication and practicality, whether you're donning the work shirts for women or the poised work tops for women. Elevate your professional image without compromising on comfort. Elevate Your Wardrobe with Free to Live: The Free to Live 3 Pack Dolman 3/4 Sleeve Business Casual Tops for Women is where style meets versatility. These aren't just any dressy tops for women; they are a harmonious blend of the trending dolman long sleeve tops for women and the versatile three quarter length sleeve tops for women. For those who cherish the timeless charm, the scoop neck tee for women in the pack adds a touch of femininity. Professional Wear to Weekend Chic: Our collection redefines dress shirts for women and dress shirts for women business casual, providing the perfect foundation for office outfits for women. Whether you're heading to a meeting or catching up over lunch, these shirts for women transition effortlessly. Paired with your favorite bottoms, they're perfect as shirts for leggings or even as the go-to tops to wear with jeans. And for the entrepreneur on-the-go, our tops are the epitome of womens dress shirts business casual, merging style with comfort. From the vibrant teal tops for women to the classic white tops for women dressy casual, this pack celebrates diversity. Catering to all body types, we offer tops for big busted women ensuring a flattering fit.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/163c0cd1-f5e6-441f-bb1a-b08a34e742ac.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "3-Pack Long Sleeve, Open Front Drape Cardigan 3-Pack Long Sleeve Knitted Cardigan 3-Pack Short Sleeve Knitted Cardigan 3 Pack Women's Loose Fit Long Elbow Sleeve Extra Long Jersey Tunics 3-PACK DOLMAN TOPS 3 Pack Womens Long, Loose Fitting Tunic Tops with Short Kimono Sleeves Fabric Type 95% Rayon, 5% Spandex 95% Rayon, 5% Spandex 95% Rayon, 5% Spandex 95% Rayon, 5% Spandex 95% Rayon, 5% Spandex 95% Rayon, 5% Spandex",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28666f4a-bd0b-4855-bc3f-325c779e27c0.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/edc41d3a-b4d3-47e4-a27c-32cbfecd1469.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/73a7345c-3302-4588-a3b5-de64b3ef8ed4.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d680f006-25b1-435e-b763-79204b722d6c.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/163c0cd1-f5e6-441f-bb1a-b08a34e742ac.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99e11d62-cb16-4ccc-b3f5-1649dbb8b6d5.__CR871,0,3504,7008_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e3027dd-45c4-4151-83c0-63d778a87706.__CR209,0,1254,2508_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1abf482f-4d0d-4913-8ae5-bd9bab5c8cff.__CR209,0,1254,2508_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c1fdfb2-0880-46c9-9746-8eae972d9242.__CR160,0,960,1920_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffb53d70-884a-41e3-9523-f1a846075006.__CR188,0,1125,2250_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/db65bcd7-42d8-438d-a872-27598edb21b6.__CR160,0,960,1920_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ArtistEye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWB6JAQEGGUAUZXCQ7V7CZCXSLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R108BEBX30AEYC?ASIN=B07BLTR9FC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2016",
                "reviewTitle": "5.0 out of 5 stars A hip-length top, not a tunic, shorter than shown. Very soft, good over pants and skirts",
                "reviewText": "THE FIT: I am 5'6\" and weigh 180, with a 40D bust and broad shoulders. The fit is perfect for a long-ish top, but it is definitely NOT tunic-length as shown on the model (she must be 5'2\"). It only falls halfway over my bum in back and barely comes to crotch in front. I could never wear over just leggings, but will wear as a shirt over jeans or a skirt. It's comfortably fitted around the bust and shoulders, a little clingy but does not show every flaw. This size would also look good on someone a little thinner, or a little taller, as a top. If I purchase again, might get the 2x.THE FABRIC: The fabric is very comfortable, soft and smooth. It's thin, and breathes, but is not see-through in the dark color I chose.THE COLOR: my monitor is pretty accurate, so I have to say that the vendor photo is not. This green is so dark that at first I thought it was charcoal, then took it into daylight and can see that it's a dark olive, but darker than the photo. It looks and feels great over palazzo pants. Search for Beauty Batik and see plus sizes.UPDATE: I washed it on delicate cycle, warm wash/cold rinse, and hung it over a sweater rack to dry. It did not bleed, did not shrink.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice E. Schindler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF6TXFKPHFJI3GG6FRUXHVUDPPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZCFDGL0LOVN2?ASIN=B07BLTR9FC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice wearing shirt for a good price.",
                "reviewText": "I’ve been on a diet and have lost quite a bit of weight but I have a bit more to go. Most of my clothes weren’t fitting me (too big) but since I’m not at my goal I didn’t want to invest a lot of money in clothes right now. These shirts are a great fit and were reasonably priced so I have some great clothing for my transition time. Win, win.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTIHIU7ISZW44SF2B3IK3R374ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HAILQAHLUWBN?ASIN=B07BLTR9FC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Comfy and casual",
                "reviewText": "Ordered a set of these tops and they are very comfortable. I didn’t think they are too thin as some people had remarked and liked the fit. The bottom part can disguise a little tummy bulge so of course that was a plus. I may order an additional set because the top is nice and casual.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kathleen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEJ6VKG6EXP7LQ33WTHB6QYQ2QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PE6UZCLIRSCC?ASIN=B07BLTR9FC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Flattering and Comfortable",
                "reviewText": "I just wore this shirt last night. It bunches around the waist and it helps to now show a belly. It is soft and comfortable. The material is shiny and that makes it look a little dressy. It's a great shirt to go out in when you want to be comfortable and cute without dressing up too much.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPKHSY7H5HOH7LRF5VAV5P6RAYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21C562Z338SQV?ASIN=B07BLTR9FC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "3.0 out of 5 stars Very soft",
                "reviewText": "Actually love these just got em in a medium when I'm a small next time will order small. Material is very soft and love the length. Wish the sleeves were all the way down not mid but really good tops",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Irish Mother",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETNNH3L5D2BMI4YTQAM7PWI7AWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R351CH8HLVUZ56?ASIN=B07BLTR9FC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2016",
                "reviewTitle": "5.0 out of 5 stars Nicely made, well designed, great fit.",
                "reviewText": "This top is fabulous. I bought one, and immediately went back and bought three more in different colors. Having read the reviews, I went one size up (from 2X to 3X) and I'm happy with that fit. It's nice and tailored around the neck, fits well in the shoulders, then flows out nicely skimming the tummy. Doesn't cling too much, so no huge worry on showing bra straps digging in. Sleeves have sufficient room, not too big or small. I think the fact that this product has so many people posting photos is testament to how much people feel good in these tops. I love the Mocha color, it's classy and looks really nice under black and cream work jackets. The purple and navy are deeper and richer colors than the photo would indicate, just lovely, they look expensive. And I have totally fallen in love with rayon as a fabric, the flow and breathability of it works really well. I wouldn't try to wear this with leggings, it's not quite long enough. But it's lovely out over jeans, and really nice tucked in for work.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "petunia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHG4N3KPSPVMDKH3TDPNKNKPRDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DUL6LE4W9O6Y?ASIN=B07BLTR9FC",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2023",
                "reviewTitle": "2.0 out of 5 stars 3/4 sleeve t shirts",
                "reviewText": "VERY thin and deteriorates so easily.Material feels great but to thin.Be careful and maybe hand wash/air dry if want to last.They are flattering on the body.Colors good.Cant let my pup in my lap with this material, catches and tears. I wear under a sweater now.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alice Winterbourne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2I4EIQLJ6GNCH5JQT2A3MPQPDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GAR4WTRH5MC?ASIN=B07BLTR9FC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "4.0 out of 5 stars Perfect except pilling",
                "reviewText": "I love these shirts! The fit is perfect and flattering for pretty much any shape. They are extremely comfortable, I want to wear one every day! They do have a tendency to pill up if you put them in the dryer so best to hang dry and wash on gentle cycle.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}