{
    "remaining_requests": 1740,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trail-novel-Ethan-Gallogly/dp/1737419203",
    "body": {
        "name": "The Trail: a novel",
        "price": "$16.16",
        "originalPrice": "$17.95",
        "rawPrice": 16.16,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trail-novel-Ethan-Gallogly/dp/1737419203",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41eC50rWgdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51fO7l89S6L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ethan Gallogly",
            "link": "https://www.amazon.com/Ethan-Gallogly/e/B09J2ZKQF1/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1708,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"The author shines in his descriptions of the natural world... A subtle and vivid tale of finding peace in the great outdoors.\"-Kirkus Reviews\"Exceptional, original, entertaining, informative, and an inherently fascinating read from cover to cover, The Trail is especially and unreservedly recommended\"-Midwest Book Review\"Fantastic... Entertaining... The Trail will no doubt make readers want to go hiking in the great wilderness.\"-Reader Reviews\"It's a fantastic book. Everything rings true. I already have several people I plan to give copies to. \"-Elizabeth Wenk, author of the best-selling guidebook John Muir Trail: The Essential Guide to Hiking America's Most Famous Trail\"\"A Walk in the Woods meets Zen and the Art of Motorcycle Maintenance.\"-Peter Snow Cao, Bike China Adventures\"Ethan Gallogly has created a wonderful blend of High Sierra history, eloquent descriptions of the range's glorious scenery, and fascinating vignettes of the diverse characters who roam the John Muir Trail.\"-Steve Roper, Sierra historian, mountaineer, and author of Sierra High Route: Traversing Timberline Country\"The Trail leaves the reader with a poignant picture of how nature can heal and reconstruct us.\"-Alyssa Matesic, ASM Editorial About the Author Ethan Gallogly, PhD has been a leader in the Sierra Club, the Cal Hiking and Outdoors Society (CHAOS) at UC Berkeley, and the Outdoors Club of Southern California. His boots have covered countless miles, including the John Muir Trail, the High Sierra Trail, the Oregon Section of the Pacific Crest Trail, the Tahoe-Yosemite Trail, and the Theodore Solomons Trail. He was a reviewer for the Wilderness Press guides: Sierra North, Sierra South, and Yosemite National Park and has read nearly every book on the history of the Sierra Nevada.Maps & Illustrations: Jeremy Ashcroft is an illustrator who specializes in mountains and wild places. He works freelance as an editorial illustrator and has produced content for most UK-based publishers and newspapers. Currently he is working on two art books featuring the US 14ers and the John Muir Trail. https: //www.etsy.com/shop/JeremyAshcroftMapsCover Design: Faith Rumm, a former interpretive and wilderness ranger, creates fine art that celebrates the beauty and power of the High Sierra. Based in Mariposa near Yosemite at RummStudio Interpretive Art and Design www.rummstudio.com, she has been creating custom displays for parks and protected areas for over 20 years."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A Transformative Journey on the John Muir TrailWINNER OF TWO LITERARY AWARDSA NEXT GEN INDIE BOOK AWARD FINALISTIn Kirkus Reviews BEST BOOKS OF 2021 issue\"UNRESERVEDLY RECOMMENDED\" —Midwest Book ReviewSet authentically in the High Sierra, The Trail is a moving story of how nature helps us find what’s missing in our lives.The Trail is fused with humor, philosophy, and trail lore. Woven in is a back story detailing the origins of the John Muir Trail: a 211-mile trail spanning the rooftop of the Sierra Nevada from Yosemite Valley to Mount Whitney, the highest peak in the continental United States.The tale begins with Gil, who in the wake of his father’s death and recently fired from his job, agrees to accompany his father’s old hiking partner Syd on a month-long trek on the John Muir Trail. There’s just one problem: Gil hates camping and is woefully unprepared for the rigors of the journey. Moreover, he soon learns Syd may not survive the hike.Former Sierra Club leader Ethan Gallogly takes you on a wild tour across the Range of Light, describing its glorious scenery in vivid detail while introducing you to a diverse cast of characters drawn from his own personal experiences as a hiker.It’s a beautifully crafted book, with 43 maps and sketches by acclaimed mountain illustrator Jeremy Ashcroft, showing the topography of each section in clear three-dimensional renderings and peppered with drawings of the trail’s iconic scenery, like the Muir Hut, the Rock Monster, and Evolution Lake.Whether you’re a hiker, armchair explorer, or someone trying to find what’s really meaningful in life—this book is for you.Praise for The Trail“The author shines in his descriptions of the natural world... A subtle and vivid tale of finding peace in the great outdoors.”—Kirkus Reviews\"Exceptional, original, entertaining, informative, and an inherently fascinating read from cover to cover, The Trail is especially and unreservedly recommended\"—Midwest Book Review\"Fantastic... Entertaining... The Trail will no doubt make readers want to go hiking in the great wilderness.\"—Reader Reviews“It’s a fantastic book. Everything rings true. I already have several people I plan to give copies to.”—Elizabeth Wenk, author of the best-selling John Muir Trail guidebook“A Walk in the Woods meets Zen and the Art of Motorcycle Maintenance.”—Peter Snow Cao, Bike China Adventures“Ethan Gallogly has created a wonderful blend of High Sierra history, eloquent descriptions of the range’s glorious scenery, and fascinating vignettes of the diverse characters who roam the John Muir Trail.”—Steve Roper, Sierra historian, mountaineer, and author of Sierra High Route“The Trail leaves the reader with a poignant picture of how nature can heal and reconstruct us.”—Alyssa Matesic, ASM EditorialAbout the AuthorEthan Gallogly, PhD (“Po”) has been a leader in the Sierra Club, the Cal Hiking and Outdoors Society (CHAOS) at UC Berkeley, and the Outdoors Club of Southern California. His boots have covered countless miles, including the John Muir Trail, the High Sierra Trail, the Oregon Section of the Pacific Crest Trail, and the Theodore Solomons Trail. He was a reviewer for the Wilderness Press guides: Sierra North, Sierra South, and Yosemite National Park and has read nearly every book on the history of the Sierra Nevada.Gallogly is a modern-day Thoreau, weaving together the majesty of nature with a philosophical sense of humanity.Fans of Bill Bryson’s A Walk in the Woods and Ben Montgomery’s Grandma Gatewood’s Walk will love this Amazon Hot New Release. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Travel",
                "link": "https://www.amazon.com/Travel-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=27"
            },
            {
                "name": "Specialty Travel",
                "link": "https://www.amazon.com/Specialty-Travel-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17205"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Sierra Nevada Press (February 27, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 364 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1737419203"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1737419204"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.18 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.91 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,518 in Books (See Top 100 in Books) #14 in Hiking & Camping Excursion Guides (Books) #27 in Traveler & Explorer Biographies #1,323 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,708 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "James Pindras",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDPYXKLXC4NDU2KFHAHZFTQ7U7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN6S39EBPQ6LO?ASIN=1737419203",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great story!",
                "reviewText": "This story reminded me of taking my son backing for the first time. I loved the writing and message. Time dust off my pack, bag, and tent! Well done!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat G 1945",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4TLXSMVYURH252YRQ3VVLMOU4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R223OOGUYROWD3?ASIN=1737419203",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars This book taught me a lot",
                "reviewText": "Over the years I have read more than two dozen books about hiking the Appalachian Trail. This is the first I have read about the Sierras.I love this novel. The storyline is interesting and seems consistent with the other novels but the author added so much history. I am anxious for the day I can hike the trail.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G  Dickinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUBS2VDZ7CGTBZVYV7CYZKJS4SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S5DCEXWTTJB4?ASIN=1737419203",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars interesting but wordy",
                "reviewText": "Wonderful and inspiring tale of hiking, but at times very long lectures about early explorers of the sierra. At the same time the main protagonist is telling his friend not to lecture you will want to tell the author the same. Also an annoying substitution of “woulda” and coulda” in the text for would have and could have. This would have been okay in dialog but it disrupts the text. Would benefit from better editing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "~KiteFlier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6CVV3VOK6LEKNUJUQ6QCPPJVDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14JAY3Z5HSBYP?ASIN=1737419203",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Taking a trip back in time",
                "reviewText": "Having hiked parts of the John Muir trail myself I was totally engrossed in this story. So much descriptive detail that I felt like I was there again. It was such an excellent read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rudi M Suminski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGU35UB6AMLPIMZOTSUF7AUCUOSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE1IUUM6WLAJD?ASIN=1737419203",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Feel good Adventure story",
                "reviewText": "I always look for feel good stories to read at bedtime. This was a fun adventure story with some coming of age elements and a cool seeing that kept me interested throughout.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Carver",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH3MSUWDAB277347NQOH3G5FLSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GSIFCSPT0AEL?ASIN=1737419203",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2023",
                "reviewTitle": "3.0 out of 5 stars Enjoyable story, somewhat irritating book",
                "reviewText": "Let me start by saying I enjoyed this story. Largely because I wanted to be there. I wanted to be on the trail with Gil and Syd. I wanted to see what they saw, experience the events they experienced. And it's a compelling story - two individuals, each with their own personal issues, fears, dreams, coming together in an unexpected friendship, learning and growing from their experience in nature, and essentially \"saving\" each other. It's a great story, and deserves to be told greatly.However, seemed to me like the author was trying to accomplish too many things in one book. First there is all the stuff about the history of the John Muir Trail and the Sierra Nevada. Very convenient that Syd is a retired college professor who knows more about the history of the trail than any park ranger, and is more than willing to share every detail. He also seems to be able to quote more lines from various poems and books than I will ever remember. His lectures got a little tiresome, and Gil was more than willing to keep them going. At times their conversations seemed very scripted, like Gil was a 5th grader who had an assignment to interview a park ranger about the trail's history. His questions sounded very rehearsed. Real people don't talk like this.Then we had the social commentary on all kinds of issues - education, climate change, food production, trail etiquette... Every so often it was if one or more of the characters felt the need to pontificate about one thing or another. Don't get me wrong - I pretty much agreed with everything they said - this isn't a political disagreement kind of thing. But again it felt like I was being lectured to, and the lectures didn't come naturally. You knew when you read the first sentence that you were in for another two page rant about something. A little bit, okay, but let's not try to cover every social issue, and let's not do it in a way that seems so scripted and forced.My problem with these is that they detracted from the story. No offense to the author, but I just feel that the story itself would have been more impactful if we hadn't been beat over the head with extraneous information and opinions.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marlor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7JRG5WILZBENPHQVU3ZIHSBMYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DURNQSV7IOF8?ASIN=1737419203",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars A great story",
                "reviewText": "This is well written with a balance of human relationships, philosophy on life and hiking information. Nicely done and highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLUHPWRROS74EWIX4W2WS3GTABA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32UB4IU9OAYY1?ASIN=1737419203",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Very Enjoyable Read",
                "reviewText": "I’ve done a bit of backpacking and found this book true to my own experience. I’ve also studied a bit of Asian philosophy so the comparisons along the trail of letting go of the great rat race and experiencing life moment by moment rang true. But my probably poor understanding of the Tao is that a true seeker always experiences, at some point in their quest, Nothingness and that’s one of the high points of the philosophy because it also contains the opposite bit as well, Everything. I’m surprised that an Asian philosophy professor didn’t recognize this. But overall an excellent read. I loved the smattering of Asian poetry throughout and the lovely thoughtful moments along the trail. Makes me want to hike the JMT (John Muir Trail).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edward G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 7, 2023",
                "reviewTitle": "The Trail",
                "reviewText": "This novel is quite out of the ordinary- well written but with philosophical overtones that the writer uses with his Uncle Syd- You will either be completely absorbed in the story or not depending on your view of the extraordinary- hard to stop reading such a heartfelt saga-Bravo to the author",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank Lohner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 29, 2024",
                "reviewTitle": "The Trail - Erinnerungen werden wach",
                "reviewText": "Vor fast zwanzig Jahren bin ich den JMT auch gewandert und viele Beschreibungen in diesem Buch haben meine Erinnerungen wach gerufen und es war, als ob ich erst gestern dort gewesen war. An manchen Stellen war mir das rumphilosophieren ein wenig zu dick aufgetragen, aber dennoch konnte ich das Buch nicht weglegen…. Und ich hatte damals denselben Mantra-Song im Kopf wie der Autor. speziell auf dem Golden Staircase.Was mich allerdings erschreckt hat war, wieviele Leute der Autor auf dem Trail getroffen hat. Vor 20 Jahren war definitiv weniger los gewesen und das war gut so.Ein tolles Buch für jeden, der den JMT schon selbst erlebt und und jeden, der ihn noch erwandern will!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen Pearce",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 6, 2023",
                "reviewTitle": "Exceptional",
                "reviewText": "The story was beautifully written and took the reader on their own journey. The same journey we all share \"life\".=",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 7, 2023",
                "reviewTitle": "This book is a wake up call.",
                "reviewText": "There’s a lot in this book. There’s the angst of youth, the fear of death and all the life in between. Partly a great coming of age book, a study on looking at your demise, a travelogue and a philosophy book. I live it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lindell christian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 13, 2024",
                "reviewTitle": "fiction",
                "reviewText": "I doubt that the 2 hikers made 400 km in 4 weeks - too little supplies with them. You need 2500-3000 kcal/day minimum. Too much philosophies - not all readers are interested in Tennysons poems and likewise .Finally I mourn with the mule that was left to die just because it was stubborn - I will not buy this author again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$15.49",
                "sellerName": "Bread N Butter Sales",
                "sellerRating": "5"
            }
        ]
    }
}