{
    "remaining_requests": 1914,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rising-Charity-McDermitt-Caribbean-Adventure-ebook/dp/B07M5H7QQB",
    "body": {
        "name": "Rising Charity: A Jesse McDermitt Novel (Caribbean Adventure Series Book 14)",
        "price": "$5.99",
        "originalPrice": "",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rising-Charity-McDermitt-Caribbean-Adventure-ebook/dp/B07M5H7QQB",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Zq7UVl4wL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Stinnett",
            "link": "https://www.amazon.com/Wayne-Stinnett/e/B00G1PVHNC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3297,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07M5H7QQB"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Down Island Press; 1st edition (February 11, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 11, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2742 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 364 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#78,472 in Kindle Store (See Top 100 in Kindle Store) #96 in Travel Adventure Fiction #121 in Sea Adventures Fiction (Books) #310 in Sea Adventures Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,297 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John Halajko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7NGSWXAGYFP7DIIADU64MPASAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJVOP1SZ2WZIH?ASIN=B07M5H7QQB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Jesse McDermitt Environmental Agent",
                "reviewText": "Jesse has a new calling along with the rest of the gang has a new job, new direction new boss and he gains a new boat along with probably another new love interest. He deals with dolphins and toxic waste and dives in a submersible too. Good read anxious to see how this new job will work out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C Wm (Andy) Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF7I7LZDDTOCHRMHUMOBXHFTKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIQZWSY7VHSGL?ASIN=B07M5H7QQB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2019",
                "reviewTitle": "4.0 out of 5 stars Another of Jesse McDermitt’s FUN Sea Stories...",
                "reviewText": "On the USS Beacon, we had a gunner's mate that Wayne Stinnet might have found a fit rival for swapping lies. I called the man Seattle McFall due to one of his funnier tales. Unlike Stinnett, though, McFall never bothered to put any of his stories in print.I’ve said it before, but I will say it again. Action-Adventure is probably my favorite genre. This writer probably is not ever going to be regarded as great, in the conventional sense. But, at least for me, his adventures in the Caribbean are certainly among my favorite mysteries. I do want to note that, as a former sailor who spent time sailing the waters that are the subject of this tale, I have a strong prejudice for such fiction that others folks might not have. I also suffer some stress resulting from events I was a part of in the area many refer to as the Bermuda Triangle, but I shall save that for another time…Now, on with my review…POV: Although there is some third person, this story tells us, in first person, how the Jesse McDermitt experiences all that goes on. Note that there is another version of the story, a collaborative work, in which the same tale is relayed to us by author Kimberli Bindschatel, in her book, “Operation: Dolphin Spirit.” That work, though, let’s us experience the story from Poppy McVie’s viewpoint. [Note to self, buy “Operation: Dolphin Spirit.”].BLUSH FACTOR: I found very little cussing and zero eff-words in this novel and I believe it will be found enjoyable by all ages.WRITING & EDITING: Just as with most action-adventure novels, there are bits and pieces that mandate a little effort to suspend disbelief, but only on minor matters. When it comes to the technical stuff, implied when speaking of boats and sailing, it is readily apparent that the author knows what he’s talking about. What he’s especially good at, in my opinion, is giving us sufficient data to picture the scene without stuffing a lot of data down our throats.The above probably explains why this Action-Adventure was fun for me.STAND-ALONE: Although you could read this as a stand-alone, I would recommend reading at least some of the previous books first. If you don’t you will likely miss out on some of the character development that has some bearing on this story.CLIFFHANGER ENDING? No worries here. Have fun knowing that reading this book will not REQUIRE you to read the next one. Just the same, though, I’m betting you will be itching to read whatever comes next from this author.BOTTOM LINEBecause I most enjoy books with more fully-developed characters, I’m rating this four stars out of five.I am striving to produce reviews that help you find books that you want, or avoid books that you wish to avoid. With your help, my improvement will help readers find books they enjoy reading.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul M. Harman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBFZHSQRR6XMQK5XHMOAWTQ3EOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2126SVVWJT7R4?ASIN=B07M5H7QQB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2022",
                "reviewTitle": "5.0 out of 5 stars A Review of Rising Charity: Jesse McDermitt Book 14",
                "reviewText": "This was a totally new twist for Jesse with a scheduled meet coming up for a potential new job, he assists two Fish and Wildlife agents with some clandestine work and then setting five Dolphins free from the control of some Russians. His new job also involves environmental and conservation issues, so great new stories are forthcoming. This one was outstanding and a new lease on life for Jesse.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Big Albert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUYD2WW4QCUYU4LEDHDNAVQ6BTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DO4HZ5GDJCFQ?ASIN=B07M5H7QQB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Good read. Fair winds, and following seas. Go jarheads!",
                "reviewText": "Good read. Wayne really knows Florida. Force Recon does not get enough credit. Fair winds, and following seas to all special operators.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH77ZUSS66OYCDJB5AMVMVXIAE5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIVRXIXRS6YAA?ASIN=B07M5H7QQB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2019",
                "reviewTitle": "5.0 out of 5 stars Great story!",
                "reviewText": "I love this series! I have read all 14 of them. I still remember the first book in the series. Jessie walks into the Rusty Anchor and starts insulting the owner of the bar. Needless to say, the locals were not happy with it until Rusty came out and hugged his best friend. I never thought I'd see the salty dog get married though. Jessie and Charity, along with Deuce and the rest of the gang have just been recruited by a man who shares their passion about the way some things should be done. While on the way home from their meeting with the guy in the middle of the ocean, they are trying out a new software program with the camera mounted on the ship when they witness the ship they were using to refine the software is dumping barrels of toxic chemicals overboard. You'll have to read the book to find out what happens next.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SheriffJohn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPUCCCKQHSEZQ32DGFDQ2GGHQVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGT6AWHUU5G57?ASIN=B07M5H7QQB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 16, 2019",
                "reviewTitle": "4.0 out of 5 stars Not Quite As Captivating",
                "reviewText": "I have read all of Wayne's story's at least twice. They are fast paced and hold your interest. This yarn is a bit slower but is segueing into a new direction, eco terrorism, I think. We'll see. Wayne is a crackerjack writer and a skilled waterman. We live in California kinda' like Florida without mosquitoes and hurricanes. I have scuba dived with two boys, sailed boats and had a center console. Reading Jesse's adventures have given me a lot of hours of pleasure. Wayne is best if you start with him at the beginning. His stories build one upon the other. Have fun. It's a great adventure. Thank you Wayne, I still enjoy Red Stripe.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "moreld",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIXXHCYYGQKI537ORLLJ75VDRRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I24O7XXZ471T?ASIN=B07M5H7QQB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2019",
                "reviewTitle": "5.0 out of 5 stars What a Great New Start",
                "reviewText": "Rising Charity is a great new start for the Jesse McDermitt series. Wayne Stinnett has been working on guiding his 'Fallen' series in a new direction for a while now, and Rising Charity is really the first book with both feet in this new adventure series. Once again, the old crew is the new crew, and it is really nice to see everyone again. This is a great collection of characters, and Wayne has truly brought them all to be living, breathing people. As always, these books take you away to the Caribbean and that is always good. It is also good that Jesse is finally over his 'crisis of character', otherwise known as a mid-life crisis; and comes out the end as strong as ever. So now is the wait for the next Jesse book, always way too long it seems; but always worth it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ed Henry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFISDWQVNE6VFJINYLSF5OGSZYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NWLYCDJIBCV5?ASIN=B07M5H7QQB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 28, 2019",
                "reviewTitle": "5.0 out of 5 stars If you like books with characters that jump off the page...",
                "reviewText": "As the headline eludes to, Wayne Stinnett has done his job very well. I'm a fan of all books based in Florida that have action, mystery and most importantly, character driven.The series this writer has developed gives you everything you ask for. His characters are deeply developed. You have some that come and go through the series. That's real life, so they become believable. Their personalities have you thinking how they would or might handle most situations yet they can still surprise you.This book is a spinoff characters own journey, but when she needs to, she's back as a supportive team member.This book can stand on it's own. But when your done. Start at the beginning of the Jesse McDermitt series and enjoy it all.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heather",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 6, 2019",
                "reviewTitle": "Another great read",
                "reviewText": "The way Wayne writes makes you visualize as though you were part of it. Love the series and the flow from one book to another is good. Well written. Never boring.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcus Grant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 3, 2019",
                "reviewTitle": "We come in on the other side",
                "reviewText": "So Glad we didn't have to suffer the massive bender, it was beneath Jess. It was discussed in a very interesting method as and when. I enjoyed the integration of the group, and the mission. Very much a book 1 to a new series as the players come together for the journey ahead. I would like to praise the Author here, as he has achieved something that Authors with years of experience have failed at numerous times. He has re invented this group almost 3 times. By setting up a slack mission statement and a l will help anyone attitude, this rolling into different adventures isn't jarring or unreasonable. So reminds me of the Clive Cussler books The Oregon Files... But this is on a massive scale. Looks like the next 5 book's could be fun.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 10, 2019",
                "reviewTitle": "Awesome read",
                "reviewText": "Not as full on as other Jessie stories, this one heralds another era, one I’m looking forward to. I wish I didn’t have to wait for more to be written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lloyd",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 9, 2023",
                "reviewTitle": "Griping all the way to the end",
                "reviewText": "Another great story following on from past adventurersThere is enough detail to picture yourself there but still light touch",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra Muston",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 3, 2021",
                "reviewTitle": "Great read",
                "reviewText": "I like the authours stories they bring knowledge on real life situations and how with love and support people can find hope and healing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}