{
    "remaining_requests": 1729,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rising-Force-McDermitt-Caribbean-Adventure-ebook/dp/B07GS7QRXV",
    "body": {
        "name": "Rising Force: A Jesse McDermitt Novel (Caribbean Adventure Series Book 13)",
        "price": "$5.99",
        "originalPrice": "",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rising-Force-McDermitt-Caribbean-Adventure-ebook/dp/B07GS7QRXV",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81zpQiTAoXL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Stinnett",
            "link": "https://www.amazon.com/Wayne-Stinnett/e/B00G1PVHNC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 2932,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07GS7QRXV"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Down Island Press; 1st edition (August 27, 2018)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ August 27, 2018"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3650 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 173223602X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#115,822 in Kindle Store (See Top 100 in Kindle Store) #401 in Sea Adventures Fiction (Kindle Store) #842 in Mystery Action Fiction (Kindle Store) #935 in Vigilante Justice Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 2,932 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "C Wm (Andy) Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF7I7LZDDTOCHRMHUMOBXHFTKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FDV38EJB4W1E?ASIN=B07GS7QRXV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2018",
                "reviewTitle": "5.0 out of 5 stars \"Rising Force;” So Good, I’m Buying ALL OTHER Books in this Series",
                "reviewText": "It’s been awhile since I posted any quotes. After reading “Rising Force,” though, I am motivated to post this:Like all great travelers, I have seen more than I remember, and remember more than I have seen - Benjamin DisraeliDemakis, Joseph. The Ultimate Book of Quotations (p. 487). Unknown. Kindle Edition.This, the 13th book in the series struck a chord with me from a dedication written to his cherished family companion, a 13-year-old Chow mix named Bill Stinnett. “Wow. Such a beautiful, heartfelt statement. If this is any indication of his writing style, I am going to love this book,” thought I.Read on to learn why I gave this novel a five star rating…POV: First person.THE WRITING: For the excerpt, I picked an intriguing section of his writing for the hint at things to come, plus, to show his style of writing as it pertains to mix dialogue, inner thought, and description. One slips so easily into the other that it just feels RIGHT. It does not feel like an ‘info dump.’BLUSH FACTOR: No worries here. Reading to your church prayer group is safe.ADVENTURE: You bet. I felt I was back at sea aboard the twin-diesel gunboat, USS Beacon, once again. Although we cruised much of the region, we did not get to the Bahamas back then, I do feel as though I have now.SOUL: Yes, this writing has soul.EXCERPT‘…“What’s that?” Moana asked, pointing to my laptop.“A computer,” I replied. “I have a satellite connection.”Quickly accessing the portal to Chyrel’s desktop, I began to run an encrypted search. A lot of cruisers have internet forums. It didn’t take long until I found one where people were talking about a boat that was stolen at Half Moon.“What should I do with these?” Fiona asked, returning with the bucket.“Wash ’em down in the sink,” I replied, as I read the accounts from the previous day. “Know how to shuck clams?”“I do,” Moana said, taking the bucket and going to the sink.“Leave a few for Finn,” I said, looking over to where he lay on the deck at the corner of the couch. “He shucks his own.” Finn’s head came up, cocked sideways, as his tail beat a tattoo on the deck.Fiona slid in next to me, looking at the screen. The blog described the same boat Bingham had reported stolen. A fifty-five-foot motoryacht had been boat-jacked while anchoring at Half Moon Cay. Several people commented on it and mentioned the boat’s name: Cruisader, out of West Palm Beach. Of course, by the time the Bahamian authorities arrived, the boat was long gone.Another search for the boat name and home port revealed a website, with numerous pictures of the boat and the couple who owned it, Mark and Cindy Mathis. They looked early sixties and affluent, he a retired software engineer and she a retired high school teacher. The boat looked vaguely familiar, but that style of vessel was very common.“Think it was the Pences?” Fiona asked, reading over my shoulder.Shrugging, I continued to scroll through the conversation. Two boats, Saline Solution and Dirty Little Seacret, had apparently witnessed the crime, and several other concerned cruisers were asking all kinds of questions. It struck me how different the conversation was compared to the stilted, one-sided interrogations I’d had with cruisers while trying to find Savannah.“There!” Fiona said, pointing to a comment the boat called Saline Solution had posted an hour ago.It was three people, too far away to get a description, but definitely a man and two women. They used a tender they stole from HMCR. Please pass the word on other nets, we’re very worried about our friends, Cindy and Mark.“Time’s right,” I said. “This happened at Half Moon Cay an hour after the ship sailed. They could easily have hidden out on the island until Delta Star left, then jacked this boat as they were anchoring.”“What are we going to do?” Moana asked from the galley.I glanced over at her and then at Fiona, sitting next to me. I couldn’t quite tell if the question was what they should do to avoid the Pences, or what we should do to help bring them to justice.“The authorities probably have it under control,” Fiona said after a moment. “Not much we can do from here, anyway.”Her stock rose just a bit, in my mind. Over the next hour, we shucked and ate the clams, though Fiona struggled to get them open.I tossed an unopened clam onto the deck in the salon. Finn clamped his favorite treat in his big paws and bit down on the opening in the shell, lining up his canines on one side with practiced ease. I explained my theory about how he was able to find them. I’d noticed several times, on different beaches, that he was able to sniff them out at the water’s edge, then dig around in the nearby shallows until he found another. Little by little he’d move out into deeper water to search for more. The ones on the beach were sometimes dead and apparently didn’t taste as good.“He’s a dog, sure,” I explained, “but animals have instincts far beyond anything we can comprehend. I think he spots the two locations in his dog’s mind and just draws a line between them, staying in the clam bed, as he moves out deeper.”It was the best theory I could come up with, having observed him hunt clams in the same way many times before.“Charity said you were an orphan,” Fiona said. “Like us.”Looking from one young woman to the other, I nodded. “Not like you…’Stinnett, Wayne. Rising Force: A Jesse McDermitt Novel (Caribbean Adventure Series Book 13) (pp. 29-32). Down Island Press. Kindle Edition.BOTTOM LINEAs I stated up front, the dedication to his deceased 13-year-old dog grabbed me due to the passing of my own 14-year-old dog a little over a year ago. So, that could have prejudiced me for this story. However, if I ever write a novel I could probably do no better than to emulate his style and flow. That does not mean his work is a literary masterpiece, but it does indicate my degree of satisfaction. You can be certain I will be ordering every book in the series to read for my relaxation and pleasant dreams of adventure in the Florida Keys and the Bahamas.Five stars out of five.One last point: As a bonus for readers, or as a teaser to intrigue us into begging for the next story, the author has published the first chapter of his next novel.I am striving to produce reviews that help you find books that you want, or avoid books that you wish to avoid. With your help, my improvement will help you and me improve book reviews on Amazon. Together, you and I can build a great customer review process that helps everybody. Will you join me? It is people such as you who have helped me improve over the years. I'm still learning, and I have a great deal yet to learn. With your help, I'll improve every day.One request: Be respectful and courteous in your comments and emails to me. I will do likewise with you.Thank you so much for indicating if this review helped you, or for your comment.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mimi Mears",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW24QBCC7GPFTDKOGB3MQPQMANQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R167WCISN3VX0G?ASIN=B07GS7QRXV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2018",
                "reviewTitle": "4.0 out of 5 stars Stennetts writing gets better and better, character building and dialog",
                "reviewText": "I read it in two nights, ( had to sleep some), the sailing is very interesting. VERY disappointed that author has Jesse smoking pot and that he can't find any women except trashy losers. But, its HIS books, not mine.. I'd get Jesse back to his island and his friends and a new smart, classy woman. (OF COURSE, he cant marry one!!! that ruins any book series)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "claudette valliere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKCJXG2UQWWIRS6VYEJF2OOFCFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3II07HAIY4XO2?ASIN=B07GS7QRXV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 5, 2018",
                "reviewTitle": "5.0 out of 5 stars Another kick ass read by Stinett",
                "reviewText": "One fine read. Spoiler alert.This one starts with Jessie and his boat, Gaspars Revenge. Jessie is looking for Savannah and daughter Florence one her Sea Biscuit. He's been stopping and asking if anyone has seen her. He's gotten a few tips but not many.Jessie is forty seven years old and a retired Force Recon Marine. He's been all over the world fighting America's wars and his last stint was as a sniper instructor. Jessie has two daughter, both grown. It took a lot for them to finally give him a chance after all their mother had told them about him. Now he has a very good relationship with his daughters and friends all around Marathon in the keys. He's been gone for weeks with his dog Finn searching for Savannah and her daughter. A daughter he thinks might be his. Savannah never said and he never asked but he feels duty bound to find out. Any child of his will have him in their life whether Mom wants it or not.Charity and he had met and he has two girls with him that Charity needs to pick up. That goes off without a hitch and Jessie then headed for Nassau. Charity told him that his boat is putting people off. Revenge is one fine expensive boat and Charity gives him her friend Vic's boat. Its a sail boat and a type of boat Jessie hasn't sailed in quite some time. The boat is being overhauled in Nassau. Jessie didn't want it but Charity makes sense. In a sail boat he may get more info on Savannah's whereabouts.While in Nassau the police contact him about the Pence's, a missing boat along with a missing couple who own that boat. Jessie knows the Pence's in fact they are the folks who killed Vic and are looking for Charity and the two young women she has with her. Jessie knows Charity will keep them safe and he answers the police officers questions. Of course lying through his teeth to do so.The sail boat will be ready on the next day and Jessie and Finn enjoy Nassau harbor. That night he hears people arguing outside his boat. He grabs his Colt 1911 and heads topside. A man is throwing two suitcases on the dock and tells Jessie to mind his own business. He then backs his boat out and leaves. Jessie just shakes his head and head back down below on the Revenge.Later he hears footsteps on the dock and a beautiful young women is swearing and a man named Benny. Jessie assumes the suitcases belong to her. He speaks with her and finds out that yes the suitcases are hers and Benny her former partner is gone. Her name is Kathleen, called Kat, and she needs a ride to Chub Kay. That's the direction Jessie is going so he offers her a ride. She's isn't to sure but decides to take a chance. Its a ride that will turn into murder and death.So begins one damned fine read.This one has Jessie, Kat, Brayden a Kiwi, Macie his wife, the good people at Chub Kay, the Bourgeau brothers who show up for meals that Brayden and Jessie catch, the Bourgeau brother Kat doesn't trust, a Jessie who agrees after watching the two, a Brayden and Jessie who find turtles that have had their shells removed, shells that are worth a fortune, a Jessie and Brayden who catch lobster for a community meal, a Jessie and Brayden who then go after hogfish for another meal, a Jessie who spots what looks like a tugboat, a Jessie who contacts Charity to use her chopper, a chopper he can fly, a flyover the surrounding islands that leads to Jessie and Brayden spotting a pusher catamaran which is what they saw and not a tugboat, a Jessie and Brayden who take his small boat out to get close to the catamaran, a catamaran that has the Pence's and the Bourgeau brothers on it, a Jessie who is spotted after he used a rebreather to get to the side of the catamaran to see who is on it, a gun battle, a wounded Jessie, a Kat who uses his dropped dog tags to let the doctor among them know his blood type, a Kat and Jessie who finally sleep together, a Jessie who leaves and arrives in the Virgin Islands ahead of Savannah, a Savannah who arrives and meets a man and Jessie McDermitt who finally realizes Savannah isn't for him, and a dropped water bottle may tell him if Florence is his or not, a Jessie who will be heading home to his real family in the Keys.Five Stars. Waiting for the next.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig Langford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFVTFPGEY4VCM7BHV4ETYB4MQHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R339L4P4P8LSQF?ASIN=B07GS7QRXV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Increasingly satisfying!",
                "reviewText": "The settings, the action... all great! But it's the characters you fall in love with. Human, believable... this series satisfies!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Halajko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7NGSWXAGYFP7DIIADU64MPASAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FDN50ODKJCIU?ASIN=B07GS7QRXV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Read!",
                "reviewText": "I found this Jesse adventure very engrossing and entertaining, I always looked forward to the next chapter. Loved Kat hope Jesse gets some common sense and go back to this lady…she helped Jesse see a different way of life. I felt bad for Kat and for Jesse in the story…curious as to where Jesse’s life will go now? Wherever it will be an adventure!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian Denner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFMSR767N4Y7ZMUVFBLBUKZCM6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QZN30CJB37JP?ASIN=B07GS7QRXV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2018",
                "reviewTitle": "4.0 out of 5 stars Great book",
                "reviewText": "I waited for so long for the next bbok in the series and enjoyed reading it. But I felt there was something missing from all the previous books in the series. All the friends we made were missing, or just talked about in passing. I sincerely hope we don't have to wait so long for the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2020",
                "reviewTitle": "Non stop action",
                "reviewText": "Nice plot and characters",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Ivory",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 1, 2018",
                "reviewTitle": "Pure escapism",
                "reviewText": "I want to live on Chubb Cay! Just the descriptions are enough. This one was more gentle in the reading. Just very descriptive of sailing around the islands of the Bahamas and making new friends. I could hear Jimmy Buffett playing whilst sat reading. What a way to spend a balmy Saturday evening. A good book, candlelight and a glass of something whilst enjoying the last of the summers warmth sat next to the sea on my balcony. Cant wait for the next installment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Papa Bear",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 26, 2018",
                "reviewTitle": "Another great read!",
                "reviewText": "I have read all the books in the series so far and the stories are getting better. What a relief to read the teaser at the end which points to further cracking stories to come, soon hopefully.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob page",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 2, 2018",
                "reviewTitle": "Great series",
                "reviewText": "Love all his books ,I go through them too quickly wished he could write faster 😄👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra Muston",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 3, 2021",
                "reviewTitle": "Great read",
                "reviewText": "I like the authours stories they bring knowledge on real life situations and how with love and support people can find hope and healing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}