{
    "remaining_requests": 1817,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fallen-Honor-McDermitt-Caribbean-Adventure-ebook/dp/B011MOLOLQ",
    "body": {
        "name": "Fallen Honor: A Jesse McDermitt Novel (Caribbean Adventure Series Book 7)",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fallen-Honor-McDermitt-Caribbean-Adventure-ebook/dp/B011MOLOLQ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91eViEjDm0L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Stinnett",
            "link": "https://www.amazon.com/Wayne-Stinnett/e/B00G1PVHNC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 3173,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B011MOLOLQ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Down Island Press; 1st edition (July 14, 2015)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 14, 2015"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3632 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 370 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#74,466 in Kindle Store (See Top 100 in Kindle Store) #268 in Sea Stories #297 in Sea Adventures Fiction (Kindle Store) #541 in Mystery Action Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 3,173 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Grandpa GARY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRZGXX72PA2TKDSQZJEX23UFHQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32QMIH5B3ZYRC?ASIN=B011MOLOLQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Very interesting serries.",
                "reviewText": "Stinnette writes about boating in the Florida Keys and Carribean as a retired Marine veteran. He gets involved in with other veterans breaking up Carribean Pirates, \"snug drugglers\" and other bad guys. Very interesting set of books and all with different plots.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCIQSLPWJWTMVI34W4OWD5Z7QWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WBMETWNBDF0G?ASIN=B011MOLOLQ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2016",
                "reviewTitle": "4.0 out of 5 stars Not the best in the series",
                "reviewText": "I enjoy reading Wayne's Jesse McDermitt series, but his latest, Fallen Honor, left me somewhat disappointed. It started slow, then picked up and at the end, it suddenly stopped - leaving me with a notion that something is missing. The main character usually gets involved with innocents that are in trouble. However, here, the local girl's boyfriend, was a dope addict and thief, hardly worth saving. But knowing the author, he got involved because of the girl and her aunt.Characters from earlier books join Jesse in this thriller and once it took off, it was difficult to put down. One of these days I'll make it down to Key West and see what I've been reading about all along.In Fallen Honor, a drug addict in Penn. steals coke from his dealer and heads to Key West - selling dope on the way to make money. In Miami, he is robbed of his wallet by a pick-pocket who uses his credit card for meals and rooms. The Kingpin up north - a former professional football player, wants his dope back and employs a computer hack who traces the robber down to the Keys. There is a love interest, and the addict chooses to give it all up to keep the relationship going - dumping over a pound of Coke into the Gulf. When the Kingpin and his hired guns arrive in the Keys, Jesse, and his crew take them on with surprising results​.Looking forward to the next book in the series and hope it's filled with more action and ends more satisfying to readers. Great job Mr. Stinnett for writing the series!John Podlaski, authorCherries - A Vietnam War Novel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly Howard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHOQ2VZ33LETPQTBVTT2AAPN2MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XU37RY0L1ODV?ASIN=B011MOLOLQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2022",
                "reviewTitle": "5.0 out of 5 stars Great new (to me) writer",
                "reviewText": "just ran across Stinnett's Jesse McDermitt books, & have been enjoying the heck out of them. The series, of course, reminds me of John D MacDonald's Travis McGee books, with helpings of Randy Wayne White's Doc Ford series. I actually like these better than Ford (even tho I was a marine biologist), and think Stinnett's a better writer than White, tho not (of course!) than MacDonald.As you go on in the series it can get to feeling like there's a cast of thousands, so many characters keep popping up. But there's sufficient continuity of characters from one book to the next that it's not that much of a problem. There are a number of good, 3-D characters in addition to Jesse, so the books have a depth there. The plots are mostly fresh & mostly make sense,* and I really have spent several nights up later than I'd planned because I didn't want to put it down...something that seems rarer by the year.As a marine biologist, I love the descriptions of the islands, water, and life in the keys. I got to spend some time in them, so it's a real memory starter. I also always loved boats & learned some boating things over the years. I do get a teeny bit tired of the very detailed directions that Jesse relates as he pilots on of his many boats from one place to another; it'd be as if Robert B Parker had described every single block, turn, & direction of all the streets he went over as he went around Boston. We don't need every channel, grass bed, sand bar, inlet, cove, palm tree, etc on every trip...or at least, I don't.*my standards may have deteriorated a tad in the last years of self-publishing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dawn McKenna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5VD3ZDEHUAVGF7PQDCFOLF3A5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PC43FOHWH6UW?ASIN=B011MOLOLQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 17, 2015",
                "reviewTitle": "5.0 out of 5 stars These just keep getting better.",
                "reviewText": "Disclaimer: I know Wayne Stinnett through an online writers' group to which we both belong, but, like a lot of other fans, I trudged to Amazon as soon as Fallen Honor went live and grabbed my own copy.This is the third Jesse McDermitt book I've read so far. My first exposure to Jessee was through the first book in the series. Though I admit I've hopped around the series, Stinnett just gets better with every book. His characters, even the secondary and background characters, have become more developed and textured, and I love the fact that Stinnett is starting to let his humor shine through a bit more. These books are all the better for it.In a really good series, there's a sense of homecoming when you open the latest book. Familiar places start to feel like they belong to you, and characters become friends, even when they're not necessarily the good guys. This series has those qualities, and a little something that I don;t get from other series. I grew up on movies with heroes like Clint Eastwood and John Wayne and lots of old Westerns. They had a comfortable feel. You knew what to expect from them, even if you didn't know what to expect IN them. Reading the Jesse McDermitt books feels like settling in on the couch on a sunny Saturday and watching one of those great movies, with good guys you can depend on and bad guys that get what they deserve in ways that make you really happy, lol. I look forward to reading this series, and enjoying it more and more, for many years.This book is faster-paced than the others I've read, but it doesn't suffer for it - there's just a lot going on. It's not a short book, but I was sorely tempted to finish in one sitting, because there just wasn't a good stopping point. The end of every chapter had me wanting to know what happened next. In the end, It took me two days to read it, but only because I had to work for a living.Hopefully, we'll see more of Rufus in future books - I adored him - and I'm really looking forward to the new spin-off series as well. I have a feeling Stinnett can do a female protagonist that I'll really become attached to.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 1, 2023",
                "reviewTitle": "Love this author",
                "reviewText": "Have started reading this series and they are very good books would recommend to anyone",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 13, 2022",
                "reviewTitle": "Family comes first.",
                "reviewText": "I always enjoy reading this authors books. It hold you rivetfing until the end. All this man Jesse wants to do is live on his island kn peace. Does not happen. He has this incredible sense of justice that must be played out till the end. Excellent reading and would recommend this book. In fact I would endorse reading all his books. I can assure you you wont be disappointed,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane Edwards",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 23, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "Great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Ivory",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 7, 2018",
                "reviewTitle": "An ok read.",
                "reviewText": "Yes, enjoyed this. Not as good a story as others, but still readable. Got a bit lost in the characters and wondering if i missed a chunk of book 6 or there was a book 61/2 as the story of Charity seems to have passed me by. Other than that, Pittsburgh drug dealers in the Keys, different!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 5, 2016",
                "reviewTitle": "Four Stars",
                "reviewText": "Kepy your interest",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}