{
    "remaining_requests": 1928,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Beginnings-heroic-fantasy-adventure-novels-ebook/dp/B01N9ETKDK",
    "body": {
        "name": "Beginnings: five heroic fantasy adventure novels",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Beginnings-heroic-fantasy-adventure-novels-ebook/dp/B01N9ETKDK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91FQQ0f5KtL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lindsay Buroker",
            "link": "https://www.amazon.com/Lindsay-Buroker/e/B004FSRHUE/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 2151,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "When her island home is invaded by enemy soldiers, her family captured, and the town enslaved, Taylina must find a way to fight back and free her people. But their enemies have powerful warships, sorcerers, and dragons. Her simple people are no match. Her only hope is to venture onto the forbidden half of the island and seek the one individual powerful enough to battle their enemies, a dragon known for eating humans rather than helping them. Find out what happens to Taylina and meet the dragon who thinks he’s a god in Dragon Rider, a prequel to Lindsay’s USA Today bestselling Dragon Blood series.In addition to Dragon Rider, Beginnings features four previously published fantasy adventure novels, all with new introductions from the author: EncryptedThe Emperor’s EdgeBalanced on the Blade’s EdgeWarrior Mage",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=668010011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01N9ETKDK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (February 28, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 28, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2935 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 1184 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#138,559 in Kindle Store (See Top 100 in Kindle Store) #125 in Steampunk Science Fiction (Kindle Store) #185 in Steampunk Fiction #1,057 in Coming of Age Fantasy eBooks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 2,151 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ginius",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3LTEMHYN4TTZK5LIMUAEW6O7GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H9UYZT7NKH21?ASIN=B01N9ETKDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars 5 Fabulous Series Starts",
                "reviewText": "Entrancing beginnings to a range of fantasy series written by an author who the reader wants to follow. All invoke likeable characters with some romance sprinkled into adventure and mystery stories that you can't put down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew Boots",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AES4MD7TI2O4IMC3O7YR4BB2C6IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AIBPHW11ES5J?ASIN=B01N9ETKDK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2017",
                "reviewTitle": "4.0 out of 5 stars Decent stories marred by lousy editing.",
                "reviewText": "I enjoy Ms. Buroker's writing. And I thought the gimmick of a collection of Volume Ones was clever. Based on Encrypted, I bought the other two volumes in the series. But then I read The Emperor's Edge ... and was bothered. The set-up is hackneyed -- quirky heroine/brooding-and-deadly mystery man, etc. But the editing annoyed the bejeezus out of me! Maybe this was written before she could employ a decent copy editor, but surely it could have gotten another going-over before being published in a teaser collection!No, it's not \"take another tact.\" It's \"take another tack\" (as in sailing).No, it's not \"laid on her back,\" it's \"lay on her back.\"No, it's not \"if he was hosting,\" it's \"if he were hosting.\"And then there's the first page of chapter 16, where an initial drop-capital has somehow crept in. On my Kindle and my phone, the first page of the chapter consists of and opening quotation mark and a huge letter Y. On the kindle app on my PC, the page text is legible, but this is more detective work than I expect for a 99-cent purchase.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW42ZPFWOVKR5TNCKCFE4ZUNTHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32U97CANAPQLQ?ASIN=B01N9ETKDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 1, 2017",
                "reviewTitle": "5.0 out of 5 stars Perfect Boxed Set with Added New Material",
                "reviewText": "I was very excited to hear of this boxed set release. Not only did it have a brand new story set before the events of the other included books, like Encrypted and The Emperor's Edge, but it included new introductions telling where the inspirations for the stories came from. Dragon Rider was a fun and thought-provoking new story full of adventure and humor, and I only wish it could have been longer! After Taylina's village is attacked she sets out to gain the help of a reclusive dragon who lives on the other side of the island. The dragon she ends up working with is such a hilarious character I actually laughed out loud on several occasions, earning strange looks from my husband when I tried to explain about a dragon acting like a dog. All together, this is the perfect set to introduce yourself to Lindsay's epic world where these stories take place. I was able to get my father thoroughly hooked on her work! Thank you Lindsay for always making my day when you have a new release!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcia E. Marien",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRO36CA3MBJRTL42MJSVCVFSYJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R204GVH7UINC0U?ASIN=B01N9ETKDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2017",
                "reviewTitle": "5.0 out of 5 stars An amazing introduction to this incredible Author",
                "reviewText": "What a great way to spark interest in the works of Lindsay Buroker. Over the past couple of years, I have lost a lot of sleep reading her work. Every book, every series is both a fun and emotional ride. Dragon Rider is a new installment for me...but did I stop there? Noooo...I read Encrypted for the fifth time, then Decrypted it's sequel. Back to the Emperor's Edge series, again for at least the eighth time, maybe ninth. I'm now on the third book in that series. Each time I re-read these books, I find new things to laugh at, innuendo I missed in prior readings. And, like Sci-Fi? Read the Star Nomad series. Want something shorter, take up Rust and Relics (paranormal) or Flash Gold. Wow! All in all, she is stand alone, my favorite author and no, she didn't pay me to advertise her work. I want the kindle world to give her work a try. I guarantee you'll be as hooked as I am.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "corey taggart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBUFBUPTVBFBWAHT5HY4XK6URYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH1XN6WNHCANZ?ASIN=B01N9ETKDK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 23, 2018",
                "reviewTitle": "3.0 out of 5 stars Great author poor amazon sorting",
                "reviewText": "I have little doubt i will enjoy the books (I greatly enjoyed the heritage series) however I am not thrilled with Amazon deciding to mix in items that cost with free whens orting Lindsay Buroker's by price low to high to see what i could read for free via kindle unlimited according to the sort this is cheaper then some free books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K in SK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV74DSDIDM2PZTG7533VFOMC7AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROZDLI5HJE6HK?ASIN=B01N9ETKDK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2020",
                "reviewTitle": "4.0 out of 5 stars Sample collection",
                "reviewText": "I enjoyed this collection of book ones of Buroker's books. I am pretty certain that I will purchase at least one series. I'd already enjoyed the Encrypted series... The Emperor's Edge series seems tempting but it has so many books! Hmmm... seems a major commitment lol. I love how the different stories occur in the same \"world\" but at different times in history. I'm a little confused though because I must have confused timelines. If Sicarius was the young assassin after Starcrest and twenty years later he's in the kingdom of Turgonia, then how is Starcrest president of the Republic of Turgonia at that time? Hmmm...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barrie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFE7EQU6D26OA5465RJ2HP7E3PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11Z9WK313DU6Y?ASIN=B01N9ETKDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2017",
                "reviewTitle": "5.0 out of 5 stars A Great Introduction to a Superb Author",
                "reviewText": "This Beginnings bundle is the perfect introduction to the work of Lindsay Buroker. I stumbled upon her book The Emperor's Edge several years ago and have read everything she's published since then. I've always given her great ratings because she's a superb author whose books bring well-developed characters, innovative plots, lots of action, and more than a touch of humor. Even if you've read the previously published first books in this series, as I have, her new Dragon Rider story is worth the price of the whole bundle by itself. If you haven't read her books, this is a great place to start. I have my personal favorites -- Balanced on the Blade's Edge and Encrypted -- but each book opens its own world of adventure. Do yourself a favor and spring for the bundle, then enjoy the books one by one! You'll be glad you did.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Megan Boomershine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMOYBDULQMZKOUODA3BNH7DWKDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C4V4TT975748?ASIN=B01N9ETKDK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2018",
                "reviewTitle": "5.0 out of 5 stars Loved Dragon Rider",
                "reviewText": "As a huuuuuge Dragon Blood series fan (have read the main 7book series, about to buy Therrik’s story and am on 2/4 of the new spin off that came out this year) I purchased this because it was $1 and there was a prequel starring my favorite character!!! I absolutely adore my Dragon God and I smiled and laughed at every single quote from him. The other main characters were all lovable as well, with the unique perspective of a nonmagical girl with a lame leg trying desperately to save her family and friends and her island. I loved it. Every scene, every word.I’ll start reading her other series but honestly nothing could beat Dragon Blood! Must buy even if you only want to read the prequel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Salman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 19, 2020",
                "reviewTitle": "Always enjoyable reading",
                "reviewText": "Thanks Lindsay, I enjoy reading your stories particularly because you create such engaging, intelligent and memorable characters that make me care about what happens to them. The best thing is the human qualities ring through regardless of which race and nation they belong toThere is also the curious balance between technologies and magic, the old and the new that I enjoyThe storytelling is the icing on the cake 🎂",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denise McGowan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 24, 2018",
                "reviewTitle": "Wonderful stories to read",
                "reviewText": "I thoroughly enjoyed this series. I love booked that include romance and magic. Creating magical items to aid in the quests was thoroughly entertaining.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alocin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 6, 2017",
                "reviewTitle": "Ein toller Einstieg in die Fantasywelt Lindsay Burokers zu einem unschlagbaren Preis",
                "reviewText": "Dieser Sammelband enthält vier Einstiegsbände zu Fantasyserien Lindsay Burokers sowie den kurzen Roman \"Dragon Rider\", eine neue Vorgeschichte zur Dragon Blood Serie. Der aktuelle Einstiegspreis von 0,83€ lohnt sich für Buroker-Fans alleine schon für Dragon Rider. Wer die anderen Serien noch nicht kennt, bekommt hier jede Menge Einstiegsdroge \"nachgeschmissen\".5* Dragon Blood 0.1 - Dragon Rider: Neue Vorgeschichte zur Dragon Blood Serie (leider ziemlich kurz, ca. 150 Druckseiten)Taylina ist eine typische Burokerheldin, wie ich sie immer mag: Selbständig, mutig, ideenreich, ein kleines bisschen irre in ihren Plänen. In diesem Fall dem Plan, einen Drachen als Helfer gegen die Cofah zu gewinnen, die Taylinas Insel überfallen habe. Der goldene Drache Bhrava Saruth, der angebetet und am Bauch gekrault werden möchte, wird ihr schräger aber liebenswerter Partner. Taylinas Einmischung in einen Drachenkampf und der Angriff auf die Cofah bieten eine Menge Action und machen Dragon Blood zu einem kurzweiligen Lesevergnügen. Ich bedaure jetzt schon, dass diese Vorgeschichte nur ein kurzes Streiflicht war. Von dieser drachenreichen Frühzeit der Welt von Dragon Blood würde ich gerne mehr lesen.4* The Emperor's Edge 00.1 - Encrypted1. Band der 2,5 bändigen Miniserie um Rias und Tikaya, die gemeinsam eine längere Vorgeschichte zur erfolgreichen Emperor's Edge Serie sind. Rias und Tikaya sind sympathische Persönlichkeiten. Den humorvollen, wortmalerischen Stil der Autorin mochte ich auch hier. Ein bisschen fallen die beiden aber ab gegen die Helden von \"Emperor's Edge\" Amaranthe (stärkere Persönlichkeit) und Sicarius (geheimnisvoller). Die Handlung in den Höhlen der Aliens hat ein paar logische Macken, dummerweise ist gerade die Auflösung über den \"verstellten\" Reinigungsrobot für mich nicht schlüssig, das stört dann schon ein bisschen, daher ein Stern Abzug.Für Fans von Emperor's Edge ist diese Vorläuferserie interessant, da sie einen Blick auf den jungen Sicarius erlaubt und auch Rias und Tikaya tauchen in späteren Emperor's Edge Bänden wieder auf. Als Einstieg in die Fantasywelten von Lindsay Buroker würde ich aber lieber Emperor's Edge selber oder Dragon Blood empfehlen.5* The Emperor's Edge 01 - The Emperor’s EdgeDie etwas schrägen Charaktere aus Amaranthes Team wirken lebendig und sympathisch. Ich mag die teils witzigen und sarkastischen Dialogen, ich habe an mehreren Stellen laut gelacht - was will ich mehr? Die Sprache empfand ich nicht als Einsteigerenglisch, ich habe einige Adjektive nachschlagen müssen, aber die Beschreibungen wirken dadurch plastisch. Die Storyline ist ein bisschen repetitiv und vorhersehbar, das Tempo dabei aber hoch, so hat es mich nicht gestört. Es war mein erstes Steampunk-Buch, so hatte ich keine Erwartungshaltung an das Genre und kann es auch nicht dahingehend beurteilen. Mir hat die Mischung aus etwas Dampfmaschinenzeitalter und ein bisschen Magie gut gefallen. Eine kurzweilige, mitreißende Abenteuergeschichte mit sympathischen Helden - aus meiner Sicht Lindsay Buroker at her best.4* Dragon Blood 1 - Balanced on the Blade’s EdgeDie Dragon Blood Serie als Ganzes gefällt mir sehr gut. Leider ist der erste Band aber einer der schwächeren der Serie. Action, schlagfertige und teils witzige Dialoge sowie die farbige Sprache Lindsay Burokers gefallen mir wie immer. Aber dieser erste Band war zunächst von der Autorin zunächst als \"stand alone romance\" geplant, nicht als Einstieg in eine Abenteuerserie. Einbändige Schnellschussromanzen sind aus meiner Sicht allerdings keine Stärke der Autorin. Die Beziehung Ridge/Sardelle wird innerhalb von 3 Tagen aufgebaut - das ist mir zu schnell, mehr Gewicht auf körperlicher Anziehung, keine Zeit für echten Beziehungsaufbau (Amaranthe + Sicarius hatten ein Jahr und sechs Bände Zeit :-) ) Nachdem die Beziehung begründet ist, besinnt sich die Autorin wieder auf ihre Stärken Action und Dialog und dies bleibt ab Band 3 der Serie auch so.3* Chains of Honnor 1 - Warrior MageIch freue mich, wieder im Emperors Edge Universum zu sein und Streiflichter und Nebenfiguren von dort zu sehen zu bekommen. Sprache und Stil mag ich immer.Die Hauptgeschichte ist aber ein bisschen dünn, wirkt konstruiert, zu große Zufälle (z.B. wiederfinden von Dak + Arayevo) und wundersame Entwicklungen (z.B. Zeitungsartikel), dadurch wird es zu einer losen Aneinanderreihung von Actionszenen. Dass Yanko nicht töten will, soll vermutlich positiv wirken, tut es aber auf mich nicht. Sowohl die Mage Hunterin als auch Sun Dragon bewusst zu retten erschließt sich mir nicht. Schade.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Storms",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on March 21, 2017",
                "reviewTitle": "must have startpakket",
                "reviewText": "super leuk.mooi startpakket voor verschillende series van lindsayhumor en spanning en romantiek in sf.what a (wo)man wants",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ptrfrs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 7, 2017",
                "reviewTitle": "though the main feature is the slow-burning love relationships and fast friendship and crazy adventures",
                "reviewText": "I have been a avid follower Ms' Buroker's work and have bought this for the Dragon Rider book. Honestly though, all of these 'series starter' are the gateway drug to the the action-laughter-witty-filled worlds that Ms. Buroker has created.These books represents two of the Fantasy World that Ms Buroker has created, first is the Steampunk world of Amaranthe, Sirius the assassin and their merry bands of Emperor's Edge where there is magic and fantastical creatures, though the main feature is the slow-burning love relationships and fast friendship and crazy adventures.In the same universe, you will also find the Encrypted and Warrior Mage, the first set before Emperor's Edge and the second afterwards, and both in a different continents (but the same universe).The second set of universe is the where there is Dragons and flyers, and lots of magic. The Dragon Rider is the prelude, while the Blade's edge is set 1000 years afterwards.But you know, except for Warrior Mage, all of these book have a kick-ass heroine that does not need saving every two minutes, that do not rely on their beauty but instead on their skills and minds. And yet, the males are not doddering fools. Both gender were represented beautifully and they both have their strength and weaknesses.This will be the best $1 you ever spent!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}