{
    "remaining_requests": 1980,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Adventure-Zone-Suffering-Game/dp/1250861721",
    "body": {
        "name": "The Adventure Zone: The Suffering Game (The Adventure Zone, 6)",
        "price": "$17.99",
        "originalPrice": "",
        "rawPrice": 17.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Adventure-Zone-Suffering-Game/dp/1250861721",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "This title will be released on July 16, 2024.",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91eGvlKQkYL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Griffin McElroy",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Griffin+McElroy&text=Griffin+McElroy&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Meet the McElroys! Clint was born first, which recent studies have shown is the best procedure for fathers and sons. Justin came along twenty-five years later, two weeks late, actually, which caused his mother, Leslie, some consternation and more than a little back pain. Three years to the day (yes, the very day) Travis came along, forever ruining Justin’s birthday, at least according to Justin. The decision was made to not have a third child born on November 8th, so Griffin arrived three-and-a-half years later on April 17th. There followed this decade and that, during which there was a lot of school, theater, broadcasting, video games, moving around the country and various and sundry monkeyshines. Then came a time for fewer monkeyshines, so a ton of marriages happened and people were added to the family branch. In the midst of all this begetting, podcasts began springing up in even greater abundance and their names were My Brother My Brother and Me (which spawned a popular tv show), Sawbones, Shmanners, Wonderful, and a farcical romp called The Adventure Zone.Clint McElroy is a 45-year veteran of broadcasting who now works on the popular podcast THE ADVENTURE ZONE, with his sons Justin, Travis and Griffin. He is one of the co-writers of THE ADVENTURE ZONE graphic novels, along with WAR OF THE REALMS: JOURNEY INTO MYSTERY, for Marvel Comics, and MARVEL TEAM-UP. He’s currently working on an animated The Adventure Zone TV show for NBC’s Peacock streaming service. He has three BEST DAD coffee mugs and six BEST GRANDPA...although the titles have been challenged.Carey Pietsch is a cartoonist based out of Brooklyn, NY. Her work includes drawing two arcs of Lumberjanes and the artwork for the Mages of Mystralia webcomic. Carey also makes Keepsakes and other original comics about magic and empathy. Along with brightening her workdays, The Adventure Zone got her to join a D&D campaign, where she’s currently playing a dragonborn sorcerer who cares too much about romance novels."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, July 17 on orders shipped by Amazon over $35",
            "Or fastest Release Day delivery Tuesday, July 16"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Taako, Magnus, and Merle are near the end of their quest to collect the seven Grand Relics, dangerous magical artifacts which threaten the world as they know it. The penultimate item on their adventuring to-do list is the Animus Bell, which The Director tells them is hidden at the heart of Wonderland, a carnival of torment. Once inside, the boys will have their shot at winning the Bell...but each step forward comes at a horrible cost. And the deeper they go ― the closer they get ― the higher a price they’ll pay.And if they can secure the Bell, surely then the worst will be over, right? Surely they’ll go back up to their Moonbase in the sky, and hand the Bell over to The Director, and Bureau life will return to normal while they begin their hunt for the final relic, right? They’re so close to the end, after all, and they’ve gone through so much to get this far. There can’t possibly be any further surprises in store...",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ First Second (July 16, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250861721"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250861726"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,611 in Books (See Top 100 in Books) #9 in Humorous Graphic Novels (Books) #22 in Fantasy Graphic Novels (Books) #28 in Media Tie-In Graphic Novels"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}