{
    "remaining_requests": 2000,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/River-novel-Vintage-Contemporaries/dp/0525563539",
    "body": {
        "name": "The River: A novel (Vintage Contemporaries)",
        "price": "$10.19$10.19",
        "originalPrice": "",
        "rawPrice": 10.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/River-novel-Vintage-Contemporaries/dp/0525563539",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81s6szd5zcL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Peter Heller",
            "link": "https://www.amazon.com/Peter-Heller/e/B001ITVQ14/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 8213,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Amazon.com Review An Amazon Best Book of March 2019: Peter Heller has written three previous novels, but he has been writing about the outdoors in magazines like Outside and Men’s Journal for much longer. In The River Heller has drawn from all that experience to create an exciting, thoughtful, and well-paced thriller about two friends paddling into trouble in northern Canada. A distant wildfire is the first portent of danger. When the friends hear a man and woman arguing on the foggy riverbank, they decide to warn them about the fire—but their search for the pair turns up nothing. The next day a man appears solo on the river. Was he one of the people they heard the day before? The River starts out as a leisurely backwoods paddle and inexorably picks up speed before spilling readers down its cascade of an ending. This is a thriller, an adventure novel, and a meditation on friendship, the outdoors, and something altogether deeper. As I read, I felt like I had been waiting for this book without knowing it, and I fully expect The River to persist as one of my favorite reads of 2019. --Chris Schluep, Amazon Book Review Review Edgar Allan Poe Award Nominee“Vivid and engaging. . . . A suspenseful tale told with glorious drama and lyrical flair.” —The New York Times Book Review“A fiery tour de force. . . . Terrifying and unutterably beautiful.” —The Denver Post“[A] poetic and unnerving wilderness thriller. . . . Full of rushing life and profound consequences.”—USA Today “Packed with action. . . . Engaging. . .satisfying.” —Outside Magazine“[A] modern-day survival tale. . . . Takes on the urgency of a thriller.” —The New York Times “[Heller] has created indelible characters. . . . The River is a beauty-of-nature/cruelty-of-humanity hybrid, but this time he leans into the thriller aspect of the tale, with gripping results.”—Minneapolis Star Tribune\"The prose is glorious, Heller’s evocation of the natural surroundings stunning, the tension razor-sharp.\"—The Observer (London) “Stunning, beautiful, life-affirming, and heartbreaking. . . . Heller writes with deep respect and empathy for not only nature and its inhabitants but also of human frailty, friendship, loyalty, and love. [An] exquisite book.” —Criminal Element “[A] superbly crafted adventure-action-mystery story. . . . Reminiscent of James Dickey’s classic Deliverance.” —New York Journal of Books “As much an allegory about man’s impact on the Earth as it is an adventure story. . . . Heller’s melodious renderings are drawn from a lifetime of not just witnessing nature, but of actively paying attention to how it is woven together.” —5280 Magazine “Using an artist’s eye to describe Jack and Wynn’s wilderness world, Los Angeles Times Book Prize finalist Heller has transformed his own outdoor experiences into a heart-pounding adventure that's hard to put down.”—Library Journal (starred review) “Peter Heller has struck gold again with The River. . . . Masterly paced and artfully told, The River is a page-turner.” —BookPage (starred review) “Fresh and affecting. . . . [Heller’s] pacing is masterful. . . . An exhilarating tale delivered with the pace of a thriller and the wisdom of a grizzled nature guide.” —Kirkus Reviews (starred review) About the Author PETER HELLER is the national bestselling author of Celine, The Painter, and The Dog Stars. The Painter was a finalist for the Los Angeles Times Book Prize and won the prestigious Reading the West Book Award, shared in the past by Western writers such as Cormac McCarthy and Terry Tempest Williams, and The Dog Stars, which was published to critical acclaim and lauded as a breakout bestseller, has been published in twenty-two languages to date. Heller is also the author of four nonfiction books, including Kook: What Surfing Taught Me About Love, Life, and Catching the Perfect Wave, which was awarded the National Outdoor Book Award for Literature. He holds an MFA from the Iowa Writers' Workshop in poetry and fiction and lives in Denver, Colorado. Excerpt. © Reprinted by permission. All rights reserved. Prologue They had been smelling smoke for two days. At first they thought it was another campfire and that sur­prised them because they had not heard the engine of a plane and they had been traveling the string of long lakes for days and had not seen sign of another person or even the distant movement of another canoe. The only tracks in the mud of the portages were wolf and moose, otter, bear. The winds were west and north and they were moving north so if it was another party they were ahead of them. It per­plexed them because they were smelling smoke not only in early morning and at night, but would catch themselves at odd hours lifting their noses like coyotes, nostrils flaring. And then one evening they pulled up on a wooded island and they made camp and fried a meal of lake trout on a driftwood fire and watched the sun sink into the spruce on the far shore. Late August, a clear night becoming cold. There was no aurora borealis, just the dense sparks of the stars blown from their own ancient fire. They climbed the hill. They did not need a headlamp as they were used to moving in the dark. Sometimes if they were feeling strong they paddled half the night. They loved how the darkness amplified the sounds—the gulp of the dipping paddles, the knock of the wood shaft against the gunwale. The long desolate cry of a loon. The loons especially. How they hollowed out the night with longing. Tonight there was no loon and almost no wind and they went up through tamarack and hemlock and a few large birch trees whose pale bark fluoresced. At the top of the knoll they fol­lowed a game trail to a ledge of broken rock as if they weren’t the first who had sought the view. And they saw it. They looked northwest. At first they thought it was the sun, but it was far too late for any lingering sunset and there were no cities in that direction for a thousand miles. In the farthest distance, over the trees, was an orange glow. It lay on the horizon like the light from banked embers and it fluttered barely so they wondered if it was their eyes and they knew it was a fire. A forest fire, who knew how far off or how big, but bigger than any they could imagine. It seemed to spread over two quad­rants and they didn’t say a word but the silence of it and the way it seemed to breathe scared them to the bone. The prevail­ing wind would push the blaze right to them. At the pace they were going they were at least two weeks from the Cree village of Wapahk and Hudson Bay. When the most northerly lake spilled into the river they would pick up speed but there was no way to shorten the miles. *** On the morning after seeing the fire they did spot another camp. It was on the northeastern verge of a wooded island and they swung out to it and were surprised that no one was break­ing down the large wall tent. No one was going anywhere. There was an old white-painted square-stern woodstrip canoe on the gravel with a trolling motor clamped to the transom and two men in folding lawn chairs, legs sprawled straight. Jack and Wynn beached and hailed them and the men lifted their arms. They had a plastic fifth of Ancient Age bourbon on the stones between the chairs. The heavier one wore a flannel shirt and square steel-rimmed tinted glasses, the skinny one a Texans cap. Two spinning rods and a Winchester Model 70 bolt-action rifle leaned against a pine. Jack said, “You-all see the fire?” The skinny one said, “You-all see any pussy?” The men burst out laughing. They were drunk. Jack felt disgust, but being drunk on a summer morning didn’t deserve a death sentence. Jack said, “There’s a fire. Big-ass fire to the northwest. What you’ve been smelling the last few days.” Wynn said, “You guys have a satellite phone?” That set them off again. When they were finished laughing, the heavy one said, “You two need to chillax. Whyn’t you pull up a chair.” There were no extra chairs. He lifted the bourbon by the neck between two fingers and rocked it toward them. Jack held up a hand and the man shrugged and brought the fifth up, watching its progress intently as though he was oper­ating a crane. He drank. The lake was a narrow reach and if the fire overran the western shore this island would not keep the men safe. “How’ve you been making the portages?” Jack said. He meant the carries between the lakes. There were five lakes, string­ing south to north. Some of the lakes were linked by chan­nels of navigable river, others by muddy trails that necessitated unloading everything and carrying. The last lake flowed into the river. It was a big river that meandered generally north a hundred and fifty miles to the Cree village and the bay. Jack was not impressed with the men’s fitness level. “We got the wheely thing,” the skinny man said. He made a sweeping gesture at the camp. “We got just about everything,” the fat man said. “Except pussy.” The two let out another gust of laughter. Jack said, “The fire’s upwind. There. We figure maybe thirty miles off. It’s a killer.” The fat man brought them into focus. His face turned serious. “We got it covered,” he said. “Do you? It’s all copacetic here. Whyn’t you have a drink?” He gestured at Wynn. “You, the big one—what’s your name?” “Wynn.” “He’s the mean one, huh?” The fat man cocked his head at Jack. “What’s his name? Go Home? Win or Go Home. Ha!” Wynn didn’t know what to say. Jack looked at them. He said, “Well, you might get to high ground and take a look thataway one evening.” He pointed across the lake. He didn’t think either of them would climb a hill or a tree. He waved, wished them luck without conviction, and he and Wynn got in their canoe and left. *** On the third day after seeing the fire they were paddling the east shore of a lake called Blueberries. What it said on the map, and it was an odd name and no way to make it sound right. Blueberries Lake. They were paddling close to shore because the wind was up and straight out of the west and rocking them badly. It was a strange morning: a hard frost early that lingered and then the wind rose up and the black waves piled into them nearly broadside, rank on rank. The tops of the whitecaps blew into the sides of their faces and the waves lapped over the port gunwale so that they decided to surf into a cobble beach and they snapped on the spray deck that covered the open canoe. But there was fog, too. The wind tore into a dense mist and did not blow it away. Neither of them had ever seen anything like it. They were paddling close to shore and they heard shouting. At first they thought it was birds or wolves. They didn’t know what. As with the fire, they could not at first countenance the cause. Human voices were the last thing they expected but that’s what it was. A man shouting and a woman’s remonstra­tion, high and angry. The cries shredded in the wind. Wynn half turned in the bow and pointed with his paddle, but only for a second as they needed speed for headway or they would capsize. His gesture was a question: Should we stop? An hour before, when they had beached to put on the spray skirt, they had landed hard. Wynn was heavier and having his weight in front had helped in the wind, but then they had surfed a wave into shore and thwomped onto the rocks, which thankfully were smooth; if the beach had been limestone shale they would have broken the boat. It was a dangerous maneuver. They could not make out the words, but the woman sounded furious and the man did not sound menacing, just outraged. Jack shook his head. A couple might expect privacy in their home, why shouldn’t they be granted the same in the mid­dle of nowhere? They could not see the figures or even the shore, but now and then there was an intimation of trees, just a shadow in the tearing fog, a dark wall which they knew was the edge of the forest, and they paddled on. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 7 hrs 30 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 19 hrs",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 15 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLER • From the author of The Guide and The Dog Stars comes the story of two college students on a wilderness canoe trip—a gripping tale of a friendship tested by fire, white water, and violence.\"A fiery tour de force … I could not put this book down. It truly was terrifying and unutterably beautiful.\"—The Denver PostWynn and Jack have been best friends since college orientation, bonded by their shared love of mountains, books, and fishing. Wynn is a gentle giant, a Vermont kid never happier than when his feet are in the water. Jack is more rugged, raised on a ranch in Colorado where sleeping under the stars and cooking on a fire came as naturally to him as breathing. When they decide to canoe the Maskwa River in northern Canada, they anticipate long days of leisurely paddling and picking blueberries, and nights of stargazing and reading paperback Westerns. But a wildfire making its way across the forest adds unexpected urgency to the journey. One night, with the fire advancing, they hear a man and woman arguing on the fog-shrouded riverbank; the next day, a man appears on the river, paddling alone. Is this the same man they heard? And if he is, where is the woman? From this charged beginning, master storyteller Peter Heller unspools a headlong, heart-pounding story of desperate wilderness survival. Look for Peter Heller's new novel, The Last Ranger, coming soon! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Vintage; Reprint edition (March 3, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0525563539"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0525563532"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.15 x 0.81 x 7.96 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,811 in Books (See Top 100 in Books) #917 in Mystery Action & Adventure #1,061 in Murder Thrillers #1,385 in Thriller & Suspense Action Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 8,213 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Eclectic Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2ZINAZH27J3PN3N53VWMYSWFAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G1R7YA0X1SIR?ASIN=0525563539",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2020",
                "reviewTitle": "5.0 out of 5 stars \"Fire and Ice\"",
                "reviewText": "THE RIVER (2019) is writer Peter Heller’s fourth novel. It is an outdoor adventure novel of survival and to state it is a thrilling work is an understatement.Close friends since first meeting at Dartmouth with vastly different backgrounds, Jack and Wynn, both unattached and having taken the summer and fall quarters off, have been looking forward to their long-planned late August canoe trip on the Maskwa River, connected to a string of lakes, in Northern Canada. Both lovers of nature and the wild who get along well and have taken hurried river trips together before, have anticipated a leisurely time on the river, camping in the wild on beaches, leaving civilization and purposefully all modern means of communication behind them as they work their way to Hudson Bay. On the river, what they don’t expect to discover is they are in the path of a raging forest fire. On their second day on the river they have a quick encounter with a couple of laid back, drunken males who the young men warn about the fire and on the third day they are surprised to hear the voices of an unseen man and woman engaged in what sounds like a fierce argument. Wanting to waste no time getting to safety, they decide to allow the couple their privacy, but half a day later, seeing the fire from atop a tree in the distance growing and moving faster toward them, the friends decide to go back and locate the couple and warn them of the fire, too. Before they can, they meet one of the couple, the male, Pierre, paddling alone, “clearly in shock,” who declares his wife, Maia, is missing and has been “snatched.” Leaving the helpless and incapacitated man behind who demands to go alone and seek help, Jack and Wynn go back in search of the woman and what they discover sets in motion a chain of events of pure horror.Peter Heller is an avid outdoorsman, adventure traveler and adventure writer. He knows of what he writes. He “is a longtime contributor to NPR, and a former contributing editor at OUTSIDE MAGAZINE, MEN’S JOURNAL, and NATIONAL GEOGRAPHIC ADVENTURE.”Heller beautifully brings to life his two main characters, Jack and Wynn. Theirs is a believable close friendship in which the two have some seemingly contradictory things in common: their love of literature, the arts, and outdoor adventure while also being quite different individuals. Jack is the more street-wise of the two, the most physically accomplished, the most daring and skeptical, and at times a bit ruthless. His is the “honed sight of a hunter.” Jack tends to set the pace. Wynn is more cautious, more intellectual, more likely to be a big-picture sort of man, and the less physically capable of the two. However, Wynn has “a lot more whitewater experience and he could see lines through rapids and holes where Jack just saw mayhem. Rather than their differences divide them, their differences support and supplement each other. Wynn figures the two of them “were even.” The depth of their caring for each other and their friendship is unquestionable. For Wynn, Jack is “like a brother but better,” because they did not “have to grow up fighting.”Heller’s command of his narrative in THE RIVER is consistently strong from beginning to end. His story-telling is notable for its clear and concise language and suspense with never a lull in the action. Readers will find themselves mesmerized by Heller’s details of Jack and Wynn’s experiences on the river beginning in tranquility and then moving to life and death emergency conditions. The ever-increasing danger as the fire nears them and the unexpected, rapidly sinking temperatures of an early frost can be seen, heard, smelled, and even felt by the reader through the author’s meticulous use of specificity. The author’s vivid descriptions of the flora, fauna, and geography of the area as well as Jack and Wynn’s various actions on the river places readers in the canoe with Jack and Wynn. Those who have ever camped outdoors will feel the tingle of reliving some of their own experiences, good and bad. Those who have not camped out will either be inspired to or, like swimming in the ocean after reading Peter Benchley's JAWS (1974) or seeing the movie version (1975), will likely cry out, “No way! Ever!”There is nothing of the supernatural in THE RIVER, no mutated creatures or monsters in the forest, although stories of the legendary cannibalistic Wendigo are alluded to a couple of times. There is, instead, nature at its rawest, most powerful, and most uncontrollable, a horrendous, desperate struggle to survive, and the unique savage malignancy only humans can inflict upon each other. All of these aspects of the story come crashing together as THE RIVER surges ever forward.The concluding portions of THE RIVER make for a white-knuckled, harrowing read that takes readers from a natural paradise to “the outskirts of hell.” The climax of the novel is shocking and is bound to leave readers gasping. By the end of THE RIVER one is faced with the fact that in life justice can be an elusive thing and as difficult to control as nature run unrestrained and one must always seek their own acceptance of life on their own.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RSW Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXZLU6VURRSQC2NFU7CK4MH57SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2B0KXRHH1X0BA?ASIN=0525563539",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2022",
                "reviewTitle": "4.0 out of 5 stars 4 Stars!",
                "reviewText": "This slow burn thriller earned <b>4 Stars</b> from me!<b>SUMMARY</b>Jack and his best friend Wynn took the semester off Dartmouth to take their dream trip; several weeks of canoeing and camping down a river in Canada. They planned to rough it; taking a canoe with no motor and no satellite phone.Things were going well until they caught wind of a forest fire. It looked and smelled like a big one and it was definitely headed their way. Plus, it was unseasonably cold, they were experiencing an early frost. They debated turning back but decided to keep moving, just at a faster pace.Then, they encounter someone who desperately needs their help. If they stop to help this person, they will lose time and may not make it down the river fast enough to beat the fire. Not only does the lost time cause an issue, but helping this person could put them in harm in other ways.Will they beat the fire? Will they put themselves in danger by helping this person? Read and find out.<b>WHAT I LOVED</b>I loved the plot. This story started kind of slowly, at first I thought it was just a story about two friends taking a leisurely camping trip but once the fire started, it got very interesting!!I loved the friendship between Wynn and Jack. They had such an easy, companionable relationship. They really seemed to fit together well.I loved the setting. The river played a big part in the story as did the nature around it.The story was beautifully written. The descriptions were almost poetic at times.<b>WHAT I DIDN’T LOVE</b>There were a few times when it was overly descriptive. Yes, I know I just said it was beautifully written, but there were a couple times when the descriptions were too much for me.There was one part where Jack did something very out of character for him toward Wynn. I felt like it didn’t fit with their relationship and Jacks character. I’d like to remove that part from my memory.<b>OVERALL</b>This is a well written, story that will stay with me a long time. I would recommend it to my GR friends who love a suspense filled adventure. I think it would appeal particularly to nature lovers.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ5PZLZMP6SNVZYJ7VK2SQPNYKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A54D4KHIBND2?ASIN=0525563539",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars amazing",
                "reviewText": "Beautiful and horrifying. So well written I was there, with them on that river, in the fire. I couldn’t stop reading until I wish I had stopped. 😢",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "hank the cat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM2ZX3UFV56PEHYJM2DS2UXMENA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MIMP0VRWAAKC?ASIN=0525563539",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 31, 2023",
                "reviewTitle": "3.0 out of 5 stars gothic wilderness bromance",
                "reviewText": "A building tragedy written as a mystery combined with wilderness prose. An unsettling combination. The reader is just not sure what or who will become the victim of the obviously encroaching dark tragedy. Characters were developed, but it was moody, atmospheric and way too much; it got in the way of the story. A better-written book could have been been 25% shorter and less tedious. An interesting plot idea but panned out awkwardly. The book ends quite unsatisfyingly. You're not sure if you want a little more, or if you're just glad it's finally done.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cannt believe it",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 5, 2022",
                "reviewTitle": "Great Story",
                "reviewText": "short simple story about misadventure and crime on a canoe trip. Great to read a canoe trip story! Obvious the writer has spent his time in the bush. Bring on some more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WhiteHorses",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 21, 2021",
                "reviewTitle": "Special",
                "reviewText": "The book is special. The characters well chosen. In a way, the River is a character, an ever present powerful one in the same way that Egdon Heath is in Thomas Hardy's, the Return of The Native. He mixes his styles from descriptive to poetic to mystical and uses the callous iceberg on one occasion to great effect. Heller is a real talent and, this book a most enjoyable experience. I will read it again. Special.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Florian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 25, 2021",
                "reviewTitle": "Pageturner",
                "reviewText": "Hätte nicht gedacht, dass es ein klassisches Abentuerbuch schafft, mich nochmal so zu fesseln. Ich mag auch die genauen, langen Naturbeschreibungen. Tolles Buch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joaco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 31, 2019",
                "reviewTitle": "Una novela de aventura en los bosques con un dejo triste",
                "reviewText": "Es un tipo de libro que, fuera de la tradición en la que está inscrito, no tiene mucha razón para conquistar a una gran audiencia.Por principio de cuentas, no es precisamente un thriller y al lector que sólo lea este tipo de literatura le va a dar una decepción: lo más probable es que le baje estrellas por considerarlo lento. or otro lado, a un lector de ficción literaria puede que el libro lo aparte por tratarse de un tema que, si bien no escandaloso, tampoco es que sea ni muy nuevo ni muy revolucionario.Porque al final, este libro son dos cosas: un \"remake\" de la famosa novela \"Deliverance\" y una actualización del tono y las tramas típicas de los westerns. Los personajes principales, Jack y Wynn, están dibujados como dos opuestos en su relación con la naturaleza: el vaquero que ha sufrido la tragedia en carne y hueso y a su vez ha crecido acostumbrado al mundo natural contrapuesto al chico de Nueva Inglaterra que parece hijo de Thoreau y que a todas las cosas del río y del bosque las trata de ver de forma poética. mbos forman una sentida amistad típicamente masculina de pocas palabras y entendimiento mutuo del que se sabe y rara vez se expresa. El súbito cambio de un inolvidable viaje en canoa a través del río a una desesperada lucha por la supervivencia en la que hay un incendio forestal y hombres armados prefigura un drama con una conclusión que en lo particular no vi venir.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vince",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 2, 2020",
                "reviewTitle": "Somehow novel in the plot, but with limitations",
                "reviewText": "The author has tried to be original with this thriller plot and he partially succeeded. The story is original and I can’t say it’s not interesting. However, my feeling is that the book is way too long for the message it brings. It is boring here and there, insisting on details that are not required by the story. The backbone, i.e. the friendship between the two main characters, is not completely credible as is the story of the couple they meet. Interesting, but not the best thriller I have ever read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.42",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            }
        ]
    }
}