{
    "remaining_requests": 1968,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Adventure-Zone-Here-There-Gerblins/dp/1250153700",
    "body": {
        "name": "The Adventure Zone: Here There Be Gerblins (The Adventure Zone, 1)",
        "price": "$11.71$11.71",
        "originalPrice": "",
        "rawPrice": 11.71,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Adventure-Zone-Here-There-Gerblins/dp/1250153700",
        "soldBy": {
            "sellerID": "A1YF2PESGKL3NT",
            "name": "Shakespeare Book House",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1YF2PESGKL3NT&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/911gxWEr0jL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Clint McElroy",
            "link": "https://www.amazon.com/Clint-McElroy/e/B0749BQ64F/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Shakespeare Book House",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 4297,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A #1 New York Times bestsellerThe Adventure Zone is fun, hilarious, and also smart. Hey, guys, can I have a cameo next time?” ― Adam Savage, MythBusters “My excitement about this existing cannot be dwarfed by anything. You see what I did there.” ― Jean Grae, hip-hop artist, actor, and comedian “The warped fantasy lives of McElroy Sons and Dad are as addictively adorable and unstoppably hilarious as they are on their podcast (a popular mind comic); but somehow Carey Pietsch’s gorgeous and playful art makes this deep dive into their beautiful brains even richer, weirder, and more mandatory. This is a critical hit.” ― John Hodgman, Vacationland“Gorgeous art―the characters come to life! I am so happy that this graphic novel is a thing that exists in the world.” ― Hank Green, Crash Course , The Lizzie Bennet Diaries“Clint, Griffin, Justin, and Travis McElroy team up with artist Carey Pietsch to adapt the show’s first quest in The Adventure Zone: Here There Be Gerblins, and Pietsch’s rich animated art style imbues their characters with life, capturing the distinct personalities that were created through voice on the podcast.” –A.V. Club“Pietsch’s art adds depth to the page at every turn, bringing this world to life in a really exciting way and also giving the characters a full range of expression that almost makes you forget you are reading.” –The Mary Sue\"The larger sardonic commentary on taking fantasy too seriously, matched with the characters’ unwillingness to follow a game’s unrealistic rules, will be clever and hilarious to those in the know. ―Booklist About the Author Clint McElroy is a 45-year veteran of broadcasting who now works on the popular podcast THE ADVENTURE ZONE, with his sons Justin, Travis and Griffin. He is one of the co-writers of THE ADVENTURE ZONE graphic novels, along with WAR OF THE REALMS: JOURNEY INTO MYSTERY, for Marvel Comics, and MARVEL TEAM-UP. He’s currently working on an animated The Adventure Zone TV show for NBC’s Peacock streaming service. He has three BEST DAD coffee mugs and six BEST GRANDPA...although the titles have been challenged.Meet the McElroys! Clint was born first, which recent studies have shown is the best procedure for fathers and sons. Justin came along twenty-five years later, two weeks late, actually, which caused his mother, Leslie, some consternation and more than a little back pain. Three years to the day (yes, the very day) Travis came along, forever ruining Justin’s birthday, at least according to Justin. The decision was made to not have a third child born on November 8th, so Griffin arrived three-and-a-half years later on April 17th. There followed this decade and that, during which there was a lot of school, theater, broadcasting, video games, moving around the country and various and sundry monkeyshines. Then came a time for fewer monkeyshines, so a ton of marriages happened and people were added to the family branch. In the midst of all this begetting, podcasts began springing up in even greater abundance and their names were My Brother My Brother and Me (which spawned a popular tv show), Sawbones, Shmanners, Wonderful, and a farcical romp called The Adventure Zone.Carey Pietsch is a cartoonist based out of Brooklyn, NY. Her work includes drawing two arcs of Lumberjanes and the artwork for the Mages of Mystralia webcomic. Carey also makes Keepsakes and other original comics about magic and empathy. Along with brightening her workdays, The Adventure Zone got her to join a D&D campaign, where she’s currently playing a dragonborn sorcerer who cares too much about romance novels."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 55 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 16 hrs 55 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Welcome to the Adventure Zone! SEE! The illustrated exploits of three lovable dummies set loose in a classic fantasy adventure! READ! Their journey from small-time bodyguards to world-class artifact hunters! MARVEL! At the sheer metafictional chutzpah of a graphic novel based on a story created in a podcast where three dudes and their dad play a tabletop role playing game in real time! Join Taako the elf wizard, Merle the dwarf cleric, and Magnus the human warrior for an adventure they are poorly equipped to handle AT BEST, guided (\"guided\") by their snarky DM, in a graphic novel that, like the smash-hit podcast it's based on, will tickle your funny bone, tug your heartstrings, and probably pants you if you give it half a chance. With endearingly off-kilter storytelling from master goofballs Clint McElroy and the McElroy brothers, and vivid, adorable art by Carey Pietsch, The Adventure Zone: Here There be Gerblins is the comics equivalent of role-playing in your friend's basement at 2am, eating Cheetos and laughing your ass off as she rolls critical failure after critical failure.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ First Second (July 17, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250153700"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250153708"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ GN360L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.25 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.05 x 0.7 x 8.95 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#44,724 in Books (See Top 100 in Books) #58 in Humorous Graphic Novels (Books) #106 in Comic Strips (Books) #134 in Fantasy Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 4,297 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Adventure Zone: Here There Be Gerblins The Adventure Zone: Murder on the Rockport Limited! The Adventure Zone: Petals to the Metal The Adventure Zone: The Crystal Kingdom The Adventure Zone: The Eleventh Hour Read them all! Book 1 Book 2 Book 3 Book 4 Book 5",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30aa6258-4f9a-4e44-b09a-dbb95840e689.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b35f0eb-34c7-4c57-841b-51892241e4fc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cb5e1a9-dcae-44bd-a541-6e7146c34c80.__CR127,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d367105f-342b-4c7d-99b6-383513e500f6.__CR98,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f3fe1a4e-0d0c-449a-b978-eb26ac4f6d79.__CR92,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61b6cf49-97f8-4aab-895f-5cb931267a94.__CR112,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c39b3bf2-b6a3-4da1-b56e-55d8f1de756b.__CR112,0,798,1595_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Justin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYQNSQAFMVALO4C6XBJOU7RFGGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2J181LSWXQQ5Y?ASIN=1250153700",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2018",
                "reviewTitle": "5.0 out of 5 stars Stellar! It's a Good, Good Graphic Novel. From a Good, Good Podcast. From some Good, Good Boys!",
                "reviewText": "I pre-ordered the paperback, but haven't had time to binge-read straight through it until the last two days! I should probably be able to come up with a witty McElroy reference as I started listening to the Balance Arch of the Adventure Zone podcast in April 2018...and finished all episodes in just a few months' time (for anyone reading and aware, yes, I believe I averaged an hour and 15 minutes of TAZ every day), but I'll just leave it at this: it left me happy, and feeling creative, and patiently(??) waiting for next summer's second installment!Clint and other contributing editors did a wonderful job adapting the hours and hours of audio content into extremely concise print format while really maintaining the best lines and exchanges from the podcast...yet remaking the tale into its very own thing–no easy task!In the same vein, Carey Pietsch's illustration work is PERFECT. It is sooo difficult to take an audio medium with such a massive fandom built around it and craft a definitive appearance for the characters and the environments created in TAZ, but it think Pietsch has done a tremendous job! The visual style chosen for the graphic novel suits the TAZ canon well. This could have come out looking so many different ways and it would have been awesome regardless, but the aesthetic choices made are something to be really proud of–and to sleep easy at night knowing great decisions have been made.I was initially unsure why some of the character and place names had been changed from the original podcast material, and then I figured it was some sensible revisionism to tweak the early days of the podcast to be more in-line with what it would become. I convinced my younger cousin to purchase a Dungeons & Dragons Fifth Edition starter kit on Black Friday so we could unbox it and play with family members (all with no D&D playing experience) with myself as DM–starter kits come with remade characters. I was a little worried about running a fun adventure for first time players with an unknown, pre-written, mystery adventure with only seconds or prep time. *Closes eyes and pinches bridge of nose.* Of course, I realized immediately...that I know this pre-made adventure VERY WELL! And it became immediately clear why the revisions are in the graphic novel. All of this came together in a confluence of good, good joy. Many thanks, All!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Washington",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBVJYZVBUDM2TMLXPGNUVIWMUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y2T08NO1X3I3?ASIN=1250153700",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2018",
                "reviewTitle": "5.0 out of 5 stars WARNING: This graphic novel contains high levels of awesomeness!",
                "reviewText": "I can't find the words to express how much I love The Adventure Zone (but that's not going to stop me from trying). While I was visiting my sister, I saw this graphic novel in her room and a quick \"thumb through\" was all I needed. I started listening to the podcast as soon as I left her house (which brought the # of podcasts I listen to up to '1') and ordered this graphic novel the same night. Now, having binge-listened(?) to 40 TAZ podcast episodes so far, I am thoroughly addicted and just can't get enough. The McElroys (in descending order: Clint, Justin, Travis, & Griffin) are so much fun to listen to! So much fun in fact, I couldn't keep all the fun to myself; I've already introduced The Adventure Zone to two other friends of mine who are now just as hooked as I am.Okay, I think we've established that I have a somewhat favorable disposition towards the original subject material this graphic novel is based on, so let's get back to the novel itself. I LOVE THE ARTWORK! Carey Pietsch has done a masterful job bringing these audibly-based McElroy character creations to life in the beautifully colored pages of this graphic novel. The cover art is gorgeous and the novel is very well made. I am ABSOLUTELY going to purchase all of the graphic novels in this series (yes, I am aware that, as of the writing of this review, this graphic novel is the only one available for immediate purchase with \"The Adventure Zone: Murder on the Rockport Limited!\" available in preorder; but I pray to Pan [that's for you Merle] that the McElroy/Pietsch dream team keeps 'em coming!)#thezonecast",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric Speer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHF7G4GCMMUC6IQTWPNX3SKZARVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15GLR1LYSAO77?ASIN=1250153700",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2019",
                "reviewTitle": "5.0 out of 5 stars Funny Escapism",
                "reviewText": "A spoof of Dungeons and Dragons based on a the adventure zone podcast which I've never seen nor played Dungeons and Dragons but I have heard there other well known podcast My Brother, My Brother and Me. You don't have to be a fan of D&D or there podcast though to enjoy because both the humor and art have fantastic synergy to create a hilarious romp of an adventure that keep the jokes coming smart and witty throughout. Whether it's an old priest that casts a holy fire spell with an extreme teen bible or just bringing light to an old D & D setting like adding elevators and green goblins that want you to kill there new boss to get a promotion as if there horde is a professional work place. A fresh approach that is silly and fresh. An Almost AAA graphic novel, would of like to see a bit more detail in the environments although character work is fantastic and loved the art style. They used matte finish instead of glossy that looks nice and glad this novel had quite a premium level of quality that I was pleasantly surprised. I felt there could of been a bit more characterization to add an extra level of depth but i'm just nitpicking. An amazing debut quite unexpected and something I would recommend to anyone to read not just there established niche, a true labor of love and potential to be a cult classic.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Max Fortuna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 15, 2024",
                "reviewTitle": "Awesome Graphic Novel if you love DnD",
                "reviewText": "Really nice art and writing. You can read it really quickly due to its nice pacing overall.The overall quality of the book is amazing and it has the beautiful \"floppiness\" of a paperback.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 15, 2019",
                "reviewTitle": "Sensacional!",
                "reviewText": "O livro excede expectativas em todos os sentidos, a qualidade da impressão e do papel são ótimas, o desenho está muito bonito e a entrega foi rápida.Para os fãs do podcast, é uma experiência sensacional ver a história em desenho e nos faz esperar ansiosamente pelos próximos HQs, como acontece com os episódios do podcast.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Derick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 13, 2019",
                "reviewTitle": "Buena adaptación",
                "reviewText": "Este libro/comic presenta la primera parte del podcast \"the adventure zone\" es una muy buena adaptación de la historia, con los momentos comicos y claves de la historia representados por unos diseños de personajes excelentes.El libro se siente bien y llego en buenas condiciones, esta en inglés. Recomendado si te gusta el podcast.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mercy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 16, 2018",
                "reviewTitle": "Minor printing erorr",
                "reviewText": "I'm always a fan of the McElroys and have been a follower of The Adventure Zone for some time, so I pre-ordered the graphic novel when I heard it was released. As always, the boys' work is wonderful, and a shout-out to Carey Pietsch for the beautiful illustrations! Seeing the story in physical form really makes it seem real, and they did a wonderful job of translating the podcast to comic form.The book I received has a couple of minor errors to it- it looks like two of the inside pages were folded over when the paper was cut to size, requiring the reader to unfold it to see the edge of the illustration, but it doesn't overlap on any words or anything important. The spine of the book also had minor damage to it -Amazon apparently decided to send it in an envelope rather than a box- but I feel as though that was a mistake of the postal service handling the book too roughly during travel, rather than any error on the manufacturer.Overall, while a bit disappointed in the damage, it's nothing major, and I found that my enjoyment and delight with the novel itself overrides any of those concerns I have. Great book, I'd recommend it to all fans of D&D and fans of the McElroys!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 18, 2018",
                "reviewTitle": "Amazing",
                "reviewText": "Truly fantastic",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.13",
                "sellerName": "Revolver Market",
                "sellerRating": "4.5"
            }
        ]
    }
}