{
    "remaining_requests": 1955,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fallen-Palm-McDermitt-Caribbean-Adventure-ebook/dp/B07NKD6RNP",
    "body": {
        "name": "Fallen Palm: A Jesse McDermitt Novel (Caribbean Adventure Series Book 2)",
        "price": "$2.99",
        "originalPrice": "",
        "rawPrice": 2.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fallen-Palm-McDermitt-Caribbean-Adventure-ebook/dp/B07NKD6RNP",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81q-oPN8beL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Stinnett",
            "link": "https://www.amazon.com/Wayne-Stinnett/e/B00G1PVHNC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 9033,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Jesse McDermitt lives alone on an isolated island in the Florida Keys where he runs a charter fishing business. Retired from the Marine Corps for six years, he wants nothing more than to relax, fish, dive and enjoy the laid back lifestyle of the islands.Russ, his former Platoon Sergeant and old friend, dies unexpectedly in a mysterious scuba diving accident and Jesse becomes suspicious. When his friend's son comes to south Florida to ask Jesse if he would take him to a remote reef to spread his father's ashes, the two men discover that Russ was murdered and agree to hunt down the psychotic killer together, unaware that their manhunt will lead them to a Caribbean terrorist cell.Meanwhile, a beautiful woman has returned to the Keys on a manhunt of her own, distracting Jesse with the idea that he could finally leave his warrior past behind. The prospect of finding lost Confederate gold, several high speed boat chases, and dodging demented killers, won't stop Jesse from revenge. Surviving a powerful hurricane puts everything on hold as a top secret government agency tries to recruit him into their fold.When the sun comes back out, will Jesse be ready?",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07NKD6RNP"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Down Island Press; 2nd edition (February 8, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 8, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4349 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 390 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#55,571 in Kindle Store (See Top 100 in Kindle Store) #175 in Sea Stories #236 in Sea Adventures Fiction (Kindle Store) #417 in Mystery Action Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 9,033 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIGMTRBRJPXH5VVEWJJHADGHY4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD25UDBRAGNGE?ASIN=B07NKD6RNP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 20, 2014",
                "reviewTitle": "5.0 out of 5 stars Sunny Review",
                "reviewText": "It's difficult to imagine what the writer was thinking when he wrote the book--or how much of himself he gave away. I've read many books that left me wondering if it wasn't true. But what is fiction if not truth overexagerated?We begin with a man who has experienced the spoils of war. He is a with depth. He also has a past drinking problem, although he does know right from wrong. We see the perfect protagonist in the making.I often think of great writers who have stood the test of time. What is it that they knew? How could such masterpieces roll off their fingertips--or, rather, lead pencils? Of course, a brilliant hero must have an adversary, or an antagonist. At some point the two must collide.Fallen Palm begins with an ex-military man living out his retirement in Key West. Stinnet paints a glorious, impressionistic view of a place for which most of us dream. His protagonist even has his own island, does laid-back charter fishing for extra income. For the most part, everyone leaves him alone. Here, he can live his life in peace, and hope that the love of his life returns. Her name is Alex, and he has never forgotten her.His name is Jesse, and his life is about to change. We fInd that he has hooked up with some Navy Seals, one of which had a father, Russell, who was Jesse's military superior.There is more than meets the eye here. Jesse is told that his ex-commander is dead. Was he murdered? Or did he drown? Right away a ripe, bloated red-herring is dragged through the water.Meanwhile, a hurricane looms in the Gulf of Mexico, threatening to inundate South Florida.We find nonstop action: a page turner.The action abruptly turns to Lester, who is in the process of fencing treasure found while scuba diving. We see he has a book that has the name \"Jesse\" stenciled in it. There appear to be GPS coordinates as well. The antagonist smells blood in the water.What will happen next?Ironically Jesse reunites with Alex, and they are now head-over-heals with each other, two stubborn souls reunited. Jesse takes Alex to his retreat, and Alex learns that the house and the property are everything she's dreamed of. He tells her he's done it all for her.Do I smell a wedding?So now Stinnett throws everybody for a loop. We see that the government has them all under surveillance.Who is playing who? And what is actually going on? You must pay attention!Like all good books and movies, we find a chase, excepts it's on the water--two charter boats going full steam ahead. It gets wild in a hurry.We see tragedy--a twist of fate that is all too real. This book may shock you in the end, so buckle up your seat belt.Compared to many great writers of centuries past, I found the book delivered subtle messages, like some secrets to happiness. Although I have never been to Key West, I felt like I was there, navigating cuts and passages through low and deep water. Stinnett has a mastery to fill in the detail. I recommend this book to anyone who likes thrillers, and has dreamed of going to Key West.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luvs2Read",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3EKTPRWIFUKUGEHMH3VTQJ32UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X2NCSSJQH1DV?ASIN=B07NKD6RNP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2015",
                "reviewTitle": "4.0 out of 5 stars Caution, Addictive Author Here!",
                "reviewText": "I first came into contact with this author when I was referred to the seven book boxed set, \"Seven Seas Mysteries Boxed Set.\" For anyone who hasn't read these, they are a really great set of seven books by seven different authors dealing with protagonists who enjoy sailing. A great set and the entire set is only ninety-nine cents. All these funds are going to a great foundation for retired writers. A must if you enjoy this type of book!When I read my first book by this author, I was hooked! Totally. This is not an author to think you can start and not put down, however. It is fast-paced and well written! The characters are so well done and the entire book is so well edited and proofed! No huge glaring typos every time I turned a page, and a greatly enjoyable read!However, Mr Stinnett... I LIKED the one character whom I won't mention. But I know you will know whom it is that I am referring to!My only criticism for this book is that there is just too much description here about this and that cay, island, etc. I would have appreciated it more if it had just dealt with the major spots that I might recognize. Also, having only a small sailboat parked in my yard more often than not, there were a few nautical terms I just didn't recognize. A little more definition or a little less technical terminology would have been appreciated.Having said this, though, I do have to admonish the readers... this author is totally addictive. At this time, I am well into the next of this series. I do have to admire this author for writing books that are part of a series but yet are totally stand-alone novels!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mick",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNYYJX2BQEDDLXMU5ZZXJAA5VCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R787QY84OROJY?ASIN=B07NKD6RNP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 15, 2023",
                "reviewTitle": "5.0 out of 5 stars FLA. Navy Vet approved👍",
                "reviewText": "Being a retired Navy (Viet Nam through Desert Storm ) vet, Who worked numerous special ops. and was stationed at NAS Key West. I felt like I was there in the moment. The brotherhood of those who serve or have served is strong and \"FallenPalm\" portrayed that comrade. Uhrah Marine RECON and Navy SEALS.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ksmithegv",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLF4WPUGRWISITOMVB7DMN3ZL6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7FF6UK1S8HF9?ASIN=B07NKD6RNP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars I’m hooked",
                "reviewText": "I’ve been reading free books on Kindle for years but am actually purchasing this series because I enjoy it so much. A bit of Jack Reacher in a Marine Corp flavor all set in the Florida Keys. The details on the boating, guns, and fishing can be a slog, but the conversations include the real humor of real soldiers. Going on to the next and hope Jesse finds a number four.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jere F. Moore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP2DIB674Z3JDTKHH57REIBVORA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4KQ1MG2ZXBF9?ASIN=B07NKD6RNP",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2015",
                "reviewTitle": "3.0 out of 5 stars the good. The book was pretty well written by a ...",
                "reviewText": "If I had known the ending in advance, I would not have read this book, but I'm getting ahead of myself.First, the good. The book was pretty well written by a man who obviously knows the area wherein the story takes place. Confusing at times to non-boat-savvy people, but otherwise pretty well written.Now, the bad. First of all, DHS is (are) not the good guys. If they were, however, I do not see why they would want McDermitt. If you read the book, you'll see what I mean. And then the ending. Perhaps it's just a personal thing, but I hate the ending. I understand it - tidy up loose ends to make way for a sequel - but the reason makes me like it even less. There are other things about the story that I did not like, but I would have gotten beyond them, except for the ending.Update: While reading another book, I remembered something that I really liked about this one. The sex was not the in your face, blow by blow description sort of thing, but more the subtle From Here to Eternity sort, and I really appreciated that. If I wanted smut, I would know where to look, but I didn't, so I say well done on this.Update: Dec 14, 2015 - I read another, then another, and, before I knew it, I had read them all. I like Jesse and what he stands for. I also like the settings and characters around him. For me, these are good, interesting reads, and I will probably read any future books in the series. The writing has progressed to what I would call very, very good. Recommended. I still only give this book 3 stars for the reasons stated above, but, if I could, I would give the series 5 stars. When I can, I will go and rate each book in order.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 5, 2023",
                "reviewTitle": "good read",
                "reviewText": "If you liked Clive Cuusler books you like this",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 16, 2023",
                "reviewTitle": "An excellent read",
                "reviewText": "When I read the first book I didn't realise what the second book would be just as good to read as the first on they are both excellent reads..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "skazza",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 4, 2023",
                "reviewTitle": "The Author",
                "reviewText": "I have read ll the books in this series love them all",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KDaH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 29, 2014",
                "reviewTitle": "Prima Abenteuer",
                "reviewText": "Die Story ist gut entwickelt und glaubhaft dargestellt. Die Schreibweise flüssig und temporeich. Keine langweiligen Füller und überflüssige Erklärungen.Es macht Spaß dieses See-Abenteuer zu lesen und ich habe mir die Folgebücher ebenfalls gekauft.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NATALIE NOONAN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 27, 2023",
                "reviewTitle": "As good as the first",
                "reviewText": "Very well done as a continuation of the series. Very sad, but oh so often true I believe in this nasty world that we live in. The characters are meshed with each other perfectly and I love their dynamic. Looking forward to the next instalment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}