{
    "remaining_requests": 1860,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Legend-Star-Runner-Adventure-Solve-Them-Yourself/dp/3963267771",
    "body": {
        "name": "Legend of the Star Runner: A Timmi Tobbson Adventure Book for Boys and Girls (Solve-Them-Yourself Mysteries for Kids 8-12)",
        "price": "$7.29",
        "originalPrice": "",
        "rawPrice": 7.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Legend-Star-Runner-Adventure-Solve-Them-Yourself/dp/3963267771",
        "soldBy": {
            "sellerID": "A1I1V7QUWSMYGA",
            "name": "YourOnlineBookstore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1I1V7QUWSMYGA&asin=3963267771&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5100irAzefL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/614lONMD5dL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Ml09L1F L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51pA16KIc0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51mYNeA-IAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AxeJ9CSiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cw4POWVWL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "J. I. Wagner",
            "link": "https://www.amazon.com/J-I-Wagner/e/B077M3SX2L/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "YourOnlineBookstore",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 4972,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Foreword Reviews Magazine (scored 5 out of 5)\"A splendid homage to adventure\" \"A visual feast\" \"Large-hearted\"A spirited trio of kid sleuths undertake a classic treasure hunt in J. I. Wagner's Legend of the Star Runner. Taking its inspiration from video games and cloak-and-dagger mysteries, this story for middle-grade readers is a visual feast.Lilli's grandfather is facing eviction. With the prospect of a pirate's treasure guiding them, she and her best friends, Marvin andTimmi, set out to find the loot to rescue him from his debts. A large-hearted, naïve, and wildly improbable plot delights as the fearless team - led by a treasure hunter - lands in a series of underground worlds.Several twists and turns hinge on pure luck, timing, and uncanny perceptions. A reliance on video-game staples, including hidden passageways, trapdoors, puzzles, maps, and multiple-choice paths, sometimes threatens to turn the book into a high-concept maze. Still, what the story misses in the depth of its background, the illustrations make up for; they are smart compositions using chromatic palettes and feature clues. From a cluttered kitchen to the check-in desk at the Savoy to a wall of keys at an archive, scenes set a distinct mood for the story.The tone is wisely calibrated; it's neither overly terrifying nor overly lighthearted. The perils the group encounter pose enough danger to build suspense yet leave room for escape. There's seldom doubt that the kids will prevail, considering their Holmesian knack for observation; the book's pleasure rests in their citywide ranging that peels back history to reveal the secrets of a legendary pirate embedded in their midst.A list of fun facts lists the book's film influences, which include Pirates of the Caribbean, and a section of hints offers insights written in reverse. With the exuberance of a caper, determined protagonists, and a message steeped in family legacy, this first in a planned series is a splendid homage to adventure. Reviewed by Karen Rigby May/June 2018 Disclosure: This article is not an endorsement, but a review. The author of this book provided free copies of the book to have their book reviewed by a professional reviewer. No fee was paid by the author for this review. Foreword Reviews only recommends books that we love. Foreword Magazine, Inc. is disclosing this in accordance with the Federal Trade Commission's 16 CFR, Part 255. From the Author A lot of love and attention to detail went into creating Legend. Did youspot an email address in one of the illustrations? Try sending a messageand see what happens... but there is more to it than pure entertainment.A Story for the Heart - A Challenge to the MindThis is a story about friendship first and foremost. A story for the heart.And about the drive to explore, to inquire and to second-guess. All threemain characters require perseverance and courage to succeed, andderive the necessary strength from their friendship.Gets Kids' Eyes Off ScreensThis book is designed to also engage today's young video gamers andwater their taste for books. One of the main reasons for the appeal ofvideo games is a frequent feeling of accomplishment. This book isdesigned to achieve the same. The 31 concise chapters, each ending witha puzzle to be solved, provide an equally rewarding experience. Thehigh-quality visuals are another reason video gaming kids will feel rightat home.Will Girls Like the Book Too?My wife and I are proud parents of our super-cute (no bias here)daughter Emmelie. It was important to me to create a character withLilli, who is ready to take the lead and make things happen. Who doesn'tcare about what society expects but about fulfilling her own dreams andambitions.So yes, I created this story with girls in mind. Hopefully, my daughter(and you too) will love it the way I do.Have fun! From the Inside Flap Empty From the Back Cover Following the clues concealed within a centuries-old family legacy,Timmi Tobbson and his friends hope to save a dear friend. But onlytwenty-four hours remain to unravel the legend of a long-lost pirateship, buried somewhere deep beneath the city streets. Unbeknownst tothem, their search awakens a mystical dark power, sworn to protect whatis hidden on board the once famous Star Runner. Suited for explorers and sleuths young and old. Children under 8 years may need assistance in solving some of the puzzles. About the Author J. I. Wagner lives with his beloved wife, their new-born super-cute daughter, two impressively big orange cats and one equally impressive mortgage right at the edge of a forest near Frankfurt, Germany. He holds a Masters degree from Oxford University where he loved being part of the Christ Church College community. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 27 - 28.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Ages 8-12 | Chapter Book | Short Attention Spans | 30+ Mysteries to Solve | Video Trailer BelowNew: The new Timmi Tobbson Big Boxed Set is now available!Note to Parents: Please see our 'No Bad Language!' notice below.Following the clues concealed within a centuries-old family legacy, Timmi Tobbson and his friends hope to save a dear friend. But only twenty-four hours remain to unravel the legend of a long-lost pirate ship, buried somewhere deep beneath the city streets. Unbeknownst to them, their search awakens a mystical dark power, sworn to protect what is hidden on board the once famous Star Runner.Unravel 'solve-them-yourself picture mysteries' and uncover the Legend of the Star Runner!Mysteries to Solve The adventure is divided into 31 concise chapters, each of which ends with a puzzle to be solved by finding and interpreting visual clues concealed within a beautiful color illustration. Suited for explorers and sleuths young and old. Children under 8 years may need assistance in solving some of the puzzles. Grade level: 3rd and up.Beautiful Color IllustrationsLegend of the Star Runner gives readers the best of both worlds, merging the visual appeal of a graphic novel with text-based storytelling's power to spark imagination.Psst: This book contains a puzzle which is unrelated to the story and involves all thirty-one main illustrations.---No Bad Language:The first edition of this book included one instance of mild language and another instance, in which one character calls out the Lord's name in surprise, when a little white dog walks into the room. Both these instances have been removed. All editions sold here are free of bad language. Also, we can promise this: Should Amazon, for some unlikely reason, send you the old version - please contact us via our homepage (look at the beginning of the book) and we will exchange it for free.Please do not buy used books if you want to receive the updated version.---Manufactured in North America / Europe:This book has been entirely manufactured - printed, bound and packed - by North American (USA and / or Canada) or European companies.---Shelve under:mystery books for kids 9-12mystery books for kids 8-10adventure books for boysadventure books for girlschapter books for kids age 9-12chapter books for kids age 8-10graphic novels kidsbooks for intermediate readersbooks for reluctant readerssolve riddles, solve puzzles, solve mysteriescrack the case like a sleuthchoose your own adventure books for kids 9-12choose your own adventure books for kids 8-10Especially for fans of:Adventures of the Black Hand GangGravity FallsGet a ClueCaptain UnderpantsA to Z MysteriesDog ManBoxcar ChildrenEncyclopedia BrownHardy BoysBallpark MysteriesSeek and Find / Hidden PicturesVideo Games Featuring ExplorationVideo Games Featuring Puzzle SolvingPoint and Click Adventure Games",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ freshabooks; Illustrated edition (May 22, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 160 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 3963267771"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-3963267772"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 7 - 10 years, from customers"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 4 - 6"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.4 x 8.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,124 in Books (See Top 100 in Books) #1 in Children's Renaissance Fiction Books (Books) #1 in Children's Woodworking Books #11 in Children's Mystery, Detective, & Spy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 4,972 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "For explorers and sleuths young and old Unravel mysteries by finding visual clues concealed within beautiful illustrations. Uncover the 'Legend of the Star Runner'.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e6b2ce01-14c5-456c-8d10-98421ffb0312._CR0,0,2910,900_PT0_SX970__.jpg"
                ]
            },
            {
                "media_text": "Where was the ancient key hidden? A mysterious riddle describes a secret hiding place in Granpa's attic. (This is a sample from the book. All pictures are cropped. Solving the puzzle requires reading the story.) Who had been observing the hotel? Marvin noticed someone must have been observing the hotel for at least one hour. Who did he mean and why? (This is a sample from the book. All pictures are cropped. Solving the puzzle requires reading the story.) Which pushbutton opens the secret door? Pressing the wrong button triggers a trap. (This is a sample from the book. All pictures are cropped. Solving the puzzle requires reading the story.) How could she tell it was a forgery? Comparing the photos taken of an old oil painting, Lilli noticed something strange. (This is a sample from the book. All pictures are cropped. Solving the puzzle requires reading the story.)",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/49d28977-2c24-47e0-a2cb-b8fd9fdf8742._CR0,0,1080,1080_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2d3a9fab-6265-41fd-a9b7-c6901b0dd6bc._CR0,0,1080,1080_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/28363aea-b1d1-41f3-a547-093ac2dd6129._CR0,0,1080,1080_PT0_SX300__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/bb37c318-c404-40f5-a082-dc93684c9e88._CR0,0,1080,1080_PT0_SX300__.jpg"
                ]
            },
            {
                "media_text": "Find the homepage of Timmi Tobbson and get the 'Easter-Egg-Companion', 'The Lost Chapter' as well as the 'Numbers Cheatbook' as PDF-Files to download.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/92bdae01-af26-44c1-ac0e-d3011f4526af._CR0,0,2910,900_PT0_SX970__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/1d8c2267-e036-431b-9255-38418a0d1545._CR0,0,3880,1200_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e6b2ce01-14c5-456c-8d10-98421ffb0312._CR0,0,2910,900_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/49d28977-2c24-47e0-a2cb-b8fd9fdf8742._CR0,0,1080,1080_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2d3a9fab-6265-41fd-a9b7-c6901b0dd6bc._CR0,0,1080,1080_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/28363aea-b1d1-41f3-a547-093ac2dd6129._CR0,0,1080,1080_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/bb37c318-c404-40f5-a082-dc93684c9e88._CR0,0,1080,1080_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/92bdae01-af26-44c1-ac0e-d3011f4526af._CR0,0,2910,900_PT0_SX970__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/66564594-5a2e-4b42-800b-eb69cdeb75db._CR0,0,3880,1200_PT0_SX970__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG23774WJXPUWKHLUIEN2ARJTFNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VFOERRBN4HRT?ASIN=3963267771",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book for mystery adventure lovers",
                "reviewText": "My 8 year old loved this book. He enjoyed reading it so much he wanted to share the fun of solving the mysteries with me and would bring it to me everyday to read. He was so pleased and excited with how the story ended that he literally jumped and cheered in delight and insisted on ordering the next book. Highly recommend for kids that love adventure and mystery. Also love that this book is free from any agenda, promotes positivity among characters, includes intelligent writing, and is an all around clean, fun, captivating book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP7UVUY6NQW2N5W2GMQ5TPS5WSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D6FRMCTIRTQN?ASIN=3963267771",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent!",
                "reviewText": "My 6 year old is an avid reader and loves problem solving/mysteries in particular. It has been increasingly difficult to find books that interest her and keep her engaged as she bores quickly of most children’s books. This was such a great find! Plan to order the entire set. I hope more are in the pipeline!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDUBYNWYXFU26GSGBKANGEOJE7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTU63L73W56ZO?ASIN=3963267771",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Love it!",
                "reviewText": "My kids love this series! We read them together before bedtime. They love the mystery and trying to solve the puzzles. The puzzles really make them think, and encourage them to solve the mystery. The series is engaging, educational, and great way to encourage your kids to read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M Mac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMUF3LA6JOZ6BXO7ICZNSEKUDQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K37020TF3MRW?ASIN=3963267771",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "4.0 out of 5 stars Good book",
                "reviewText": "This was a fun, keep you guessing book. My 10 year old really enjoyed this story. It is a pretty long book but worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Rouse",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4MWV4ADXDNOVAL4MGV4IGIR7RA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CV9CPKOLOPWV?ASIN=3963267771",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Short, engaging chapters!",
                "reviewText": "My kids thoroughly enjoyed this book! The short interactive chapters captured their attention. They didn’t want to stop reading it. The additional puzzle aspects of the book had them flipping through it long past its finish.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yvonne Slater",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUMUOEB3NLITQNX4TRPENLTC5CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R328W00VDE9CA?ASIN=3963267771",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "My nephew is an avid reader so I’m always looking for different kinds of books to engage him. He absolutely loved this book! I plan to get him the other two books in the series",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jamesli1220",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI2EVLRG2BPOQ547ND3BSZLFZPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RQCN8IGJVB1G?ASIN=3963267771",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Fun for kid to read",
                "reviewText": "With correct grammar with is hard to find in U.S.Im sorry to say it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEP2EEO7N5QZ7LY5NMLFERGMWRYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38SUGYV12U5CC?ASIN=3963267771",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Gift",
                "reviewText": "This was a gift to my grandson that loves to read and has read this several times and really likes it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sophie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 23, 2023",
                "reviewTitle": "Interesting book",
                "reviewText": "My son likes it very much!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 16, 2021",
                "reviewTitle": "Great puzzle book for kids",
                "reviewText": "My 9-year-old daughter read this book on her own in just 2 days, she was glued to it. She loved solving the puzzles, she only needed help with the most difficult ones. After reading the book she noticed there was another hidden puzzle to be solved via the website to get an extra present from the author himself! She was really excited when she received it! Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "maria matthews",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 16, 2018",
                "reviewTitle": "A teasing treasure hunt guaranteed to please any child",
                "reviewText": "I would recommend Legend of the Star Runner to any parent with a child who thinks of books as being boring as this one provides a challenge at every step of the way. I bought this book to read on my kindle as the notion of going on a fictional treasure hunt by reading a story intriguing, and my curiosity as a writer led me to buy it. I found the story an easy read. I liked the mix of characters. Found Lilli to be easy to picture and Marvin and Timmi were a great combination. The three kids took upon themselves to help Lilli's grandfather avoid eviction by finding buried or hidden treasure - a pirate ship named The Star Runner. The elusive guardians of the mystery were just a nasty enough threat to add that touch of danger to the story. The book is a clever mix of interactive tools with a puzzle being revealed at the end of every chapter and the answer given at the start of the next chapter. I found myself scrutinising the detailed illustrations to find the answer to the puzzle. If it interests me an older child, I could see a lot of children losing themselves in this neat story.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 10, 2019",
                "reviewTitle": "Gripping",
                "reviewText": "My kids loved this book and the solve the clues pictures at each chapters ends.The story was well crafted and kept a driving pace from beginning to end. Twists, turns and treausre.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 21, 2021",
                "reviewTitle": "Great book and great bonding opportunity too!",
                "reviewText": "My 10 year old son and I loved reading this together! We took turns reading aloud and working together to solve the individual puzzles/mysteries. We loved how some puzzles were easier (to set us up for success) and some were more challenging! (He had an easier time than me solving a lot of these!). It felt very rewarding every time we solved a puzzle, and if we didn't solve something it wasn't a big deal to turn to the next chapter and excitedly find out what we missed. We even recieved a little prize at the end for solving the secret challenge and going to the 'legend of the star runner' website online! Looking forward to reading more of these in the near future!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.80",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}