{
    "remaining_requests": 1923,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fallen-King-McDermitt-Caribbean-Adventure-ebook/dp/B00TM5JSR0",
    "body": {
        "name": "Fallen King: A Jesse McDermitt Novel (Caribbean Adventure Series Book 6)",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fallen-King-McDermitt-Caribbean-Adventure-ebook/dp/B00TM5JSR0",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/918YR6z3fnL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Stinnett",
            "link": "https://www.amazon.com/Wayne-Stinnett/e/B00G1PVHNC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 4888,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The quiet and solitude found in the back country and wetlands of south Florida has been shattered. Someone is using explosives to fish the ecologically fragile patch reefs in the shallow waters of Florida Bay, north of the Keys. Retired Marine Jesse McDermitt doesn't like explosions in his backyard. Knowing his penchant for inserting himself in matters best left to the authorities, his friends withhold information from him about the destruction to the delicate, living corals. Jesse doesn't much like this, either.He discovers that a vicious Miami street gang is involved when he and his daughter witness a gruesome double murder on remote Cape Sable. Ignoring his friends advice, he digs for the truth. Why does a gang that deals strictly in lead, kilos, and large bricks of cash want to steal cheap boats in the Keys, just to poach a few bucks worth of gamefish?What Jesse uncovers is far more sinister than he bargained for. A twisted psychopath is in control of the gang and trying to lure him out in the open. Jesse's instinct and training compel him to attack, but conflicts with his newfound parental need to protect. Jesse and the ones he cares for most are caught in the cross-hairs.It's just another day in paradise in this sixth installment of the Jesse McDermitt series. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00TM5JSR0"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Down Island Press; 1st edition (February 13, 2015)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 13, 2015"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3053 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 344 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 069238023X"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#111,150 in Kindle Store (See Top 100 in Kindle Store) #392 in Sea Adventures Fiction (Kindle Store) #419 in Sea Stories #820 in Mystery Action Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 4,888 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPMDXWZRNP36ICA6LR2YXMPLWGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10M8NU795TCNL?ASIN=B00TM5JSR0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars The Florida Keys",
                "reviewText": "This is my second reading of Jessie Adventures, and I have enjoyed them as much this times the first time. Excellent book, Wayne.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCIQSLPWJWTMVI34W4OWD5Z7QWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CEWEBJYI8U9C?ASIN=B00TM5JSR0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2016",
                "reviewTitle": "4.0 out of 5 stars As good as the rest",
                "reviewText": "Somehow, I've completed the entire Jesse McDermitt series and overlooked \"Fallen King\". As with all the other books in this series, I thoroughly enjoyed the story. This one did take some time to launch, but once it started, you'll have to finish it before putting it down. The cast of characters are well developed, and readers are taken back to earlier times to ensure they know everything about that character.I especially like the \"Rules for dating a Marine's daughter\" and thought they were hilarious! But, no doubt, true in every sense.In this story, a Miami-based Haitian gang is going outside of the norm (drugs, prostitution, weapons, etc.) and using grenades to damage the ecosystems around Key West. It soon sinks in that the gang is trying to draw Jesse out of hiding, and this is why the thugs are operating in his neighborhood. His connections in the Homeland Group soon learn that an old foe of Jesse's is manipulating the gang so she can get even with him for an earlier encounter when treasure hunting. Kim develops a love life and goes out on her first date. Then the fireworks begin, and Jesse discovers that his \"personal island\" isn't as defensible as he thought.Great story and highly recommended. Everyone should read all six books in the series - first-timers​ should start at #1 to keep characters and events straight. Looking for another Jesse story to come. Great job, Mr. Stinnett!John Podlaski, authorCherries - A Vietnam War Novel",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grandpa GARY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRZGXX72PA2TKDSQZJEX23UFHQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BAMZS0CW3ULV?ASIN=B00TM5JSR0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Great serries",
                "reviewText": "Stinnette writes about boating in the Florida Keys and Carribean as a retired Marine veteran. He gets involved in with other veterans breaking up Carribean Pirates, \"snug drugglers\" and other bad guys. Very interesting set of books and all with different plots.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William E. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAPESQ6O5P4PSCGKW252PBIZDGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KZ3CQJKPJ1AF?ASIN=B00TM5JSR0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 17, 2015",
                "reviewTitle": "5.0 out of 5 stars A book worthy of your library and to be read again",
                "reviewText": "I have read all six of the Wayne's books and I must admit that they are getting better and better. Some of the comments about pacing, starting and action in Fallen King that are not so positive. However, in fact, these are very positive developments of Wayne as an author and Jesse as a character. Fallen King has plenty of action, more than a few twist, moves right along and blam, drops you right into the story. Yes, there is a little more dialog than before and a little less action and yes the action is more spread around to other characters (But I am sure Jessie would be would be the first to say there is more than enough to go around :-) ) But this does not take away from the book but adds more depth and content.For me, a good story and story teller is someone who can take an ordinary situation and or character and tell the story that shows the extraordinary attributes of such a character or story. And when the character is extra ordinary and the situation is more than ordinary, then you have the makings of a real page turner. Take that and set it into a area the teller is passionate about and you have a great story. Wayne manages to do all of that again and again and again.This book deals a lot with family and the job of protecting the family. But even more so it deals with the fact of life, \"You can not always protect a family member and in some case it is the worst possible thing you can do\". When they reach a certain age or maturity, all you can do is help, be supportive and get out of their way. Not an easy thing to do if you are a parent. and not an easy thing to do if you are this adult who just yesterday was a child. This book manages to bring that to the forefront while not letting up on what is going on in the story. This complexity is not an easy thing to handle, yet it is handled with a great amount of insight. And like real life, Jesse does NOT always get it right!I liked this book, enjoyed it and very much waiting for the next one. I would like to thank BookBub for introducing me to Jesse and Wayne. I might have missed this whole experience otherwise. And thank you too, Wayne, for being the author that you are and being accessible to your readers. You do as your preach.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BigDrumDaddy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPGWT7Z25AULAY5V26PIXVL3XOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GQV37OT8OD9F?ASIN=B00TM5JSR0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2015",
                "reviewTitle": "5.0 out of 5 stars A MASTERFUL ADVENTURE",
                "reviewText": "Will Stinnett's protagonist, Jesse McDermitt, is a shining example of every Recon Marine's dream come true. If only we could all retire to such a life as his. In FALLEN KING, Jesse is once again brought into a battle not of his own making. And this time it's not even he who goes looking for the bad guys. It's they who've shattered his peaceful, island paradise in an attempt to draw him out. It seems Jesse has some unfinished business to attend to, or so his provocateur has made clear. So, once more, with the help of his many friends and his newly found daughter Kim, Jesse seeks to solve a mystery - one which apparently involves him. Author Stinnett has created a setting filled with three dimensional characters, good and bad alike, and brought to the forefront some of the most endearing & enduring characters in modern fiction today. The stories are rich with detail, especially re the southern FL coasts and the many water passages found there - as well the area's rich history and traditions of fishing, trapping and diving. And it is here where Jesse McDermitt lives, works, and tackles the mysteries and dangers of a life unlike any other. Jesse does so from his own little island, which houses his small home, a modern inventive boat dock, quarters for his caretakers, and bunkhouses for guests and the occasional DHS unit quartered there. Jesse, his daughter Kim, and his dog, Pescador, do their best to live a quiet idyllic lifestyle. But try as they might, trouble always seems to find them. And then there's the matter of Jesse's sense of justice, which won't allow him to leave things to the local authorities. After a lifetime as a Recon Marine, where running to the sounds of the guns comes natural, Jesse has yet to learn to leave well enough alone. But then, that's what REAL Marines do. They make things right with the world (even when it's not their job anymore).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 1, 2023",
                "reviewTitle": "Following",
                "reviewText": "I am following this author his books are very good well worth a read but start at number 1",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raymond Wood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 12, 2019",
                "reviewTitle": "A big fan of the Jesse McDemit series",
                "reviewText": "I have read many of the books in this series, if you are like me an have aquired some of these through a service that provides free books consider paying for your next books. I'm certain Wayne is not doing this all for funI've enjoyed going back to the Keys with Jesse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 9, 2022",
                "reviewTitle": "Life was not unfortunately meant to be easy .",
                "reviewText": "This was a great story. Jesse just wants to live in peace. His past seems to continually catch him out. He handles it very well with the help of his friends. How great to have such friends. Would recommend this book to those who love an adventure.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ellen henson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 15, 2019",
                "reviewTitle": "Fallen King",
                "reviewText": "The book is a good read. I enjoyed the varieties of vegetation and fish and the tourist industry in the book. The plot was not over=thought, but moved along nicely.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 1, 2019",
                "reviewTitle": "A bit disjointed but interesting read",
                "reviewText": "Starting with this book I suppose it is unsurprising that I was confused which marred my enjoyment a little. Most of the Keys descriptions went way over my head even though I visited Coco Beach on a long business trip , hired a Lincoln Continental (it was a few years ago!) and drove from one end of the Keys to the other and back again quite unaware of the massive variety of what was on offer. I didn't use a map then stupidly and to follow the story properly I could have done with a map. A wonderful experience and this story both intrigued and pleased me as a result.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}