{
    "remaining_requests": 1719,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fallen-Mangrove-McDermitt-Caribbean-Adventure-ebook/dp/B00O1BU7AW",
    "body": {
        "name": "Fallen Mangrove: A Jesse McDermitt Novel (Caribbean Adventure Series Book 5)",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fallen-Mangrove-McDermitt-Caribbean-Adventure-ebook/dp/B00O1BU7AW",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91qlx9ty1mL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Stinnett",
            "link": "https://www.amazon.com/Wayne-Stinnett/e/B00G1PVHNC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4392,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A Spanish treasure ship is driven by a hurricane onto the rocky shoreline of Elbow Cay in September of 1566. Few of the crew survive, but they manage to salvage most of the treasure and bury it on the island, leaving a clue to its location locked in a chest and placed in the bough of a young mangrove tree..Four-hundred and forty years later, Jesse McDermitt and his friends solve the riddle that was hidden inside a chest found encased in an ancient mangrove tree and go in search of the treasure.When the Miami based Croatian mob learns about the treasure they go to great lengths and expense, in an attempt to relieve Jesse and his friends of the riches.A demented, hyper sexed island woman also wants it for her own, as does a Miami attorney who is married to Jesse’s estranged daughter. As the body count grows, will the crew of Gaspar’s Revenge find the treasure or become one of the island’s statistics?",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00O1BU7AW"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Down Island Press; 1st edition (September 28, 2014)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 28, 2014"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3415 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 427 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#100,914 in Kindle Store (See Top 100 in Kindle Store) #374 in Sea Adventures Fiction (Kindle Store) #387 in Sea Stories #751 in Mystery Action Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,392 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Grandpa GARY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRZGXX72PA2TKDSQZJEX23UFHQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBU7TR6CBBGF0?ASIN=B00O1BU7AW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Great serries",
                "reviewText": "Stinnette writes about boating in the Florida Keys and Carribean as a retired Marine veteran. He gets involved in with other veterans breaking up Carribean Pirates, \"snug drugglers\" and other bad guys. Very interesting set of books and all with different plots.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gaely Holmes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIV4TNJROUIH343RWHD4CWYK26Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HXVLS065BIFN?ASIN=B00O1BU7AW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2022",
                "reviewTitle": "4.0 out of 5 stars What a ride!",
                "reviewText": "This is the fifth book in Mr. Stinnett's well crafted tales of Jesse McDermitt's adventures!His books will keep you turning those pages, as you can't wait to see what is going to happen next, as he and his crew outwita myriad of smugglers, assassins, and other crooks, in search of a fabulous cache of long lost treasure!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "STARVEX240",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH23PYFOEP7IRL5LLA2WUUNQ4ZGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EDLGQHBLDZWY?ASIN=B00O1BU7AW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2015",
                "reviewTitle": "5.0 out of 5 stars EXCITING AND SUSPENSEFUL STORY OF JESSE AFTER THE MARINES",
                "reviewText": "As I sit here looking over the questions that best describe this book, I realize that just one word is inaccurate in some of those questions. For example, describe the plot - some twists and full of surprises; the mood - hopeful, suspenseful, thoughtful and a little dark; the characters - developed and complex. To understand why I say this, you have to read the story. Stinnett's books are not easy to write about as almost all of the story or stories is the story, leaving no avenue to cover without giving something away. Also, by the time you finish reading about a new character, you know about 85 to 95% about that character; the rest you will find out in another book, if they live that long. One of the qualities I like about his books, you have no idea what character(s) will show up in another book.This book did start out slow only because he was giving background info about Jesse and some of his most trusted friends. Once you realize this, at least to me, it was no longer slow. And something told me to start keeping tract of who and what these friends and enemies knew and did and I was right! And I advise you to do this for EVERY ONE OF HIS BOOKS.That being said, I enjoyed reading this book as I did all of them. After being in the marines for so long, Jesse had mixed feelings about retiring, but knew in his heart it was time. He moves to the Keys and, after being mistaken for a Captain, he decides to buy a boat and charters diving and fishing trips. However, before he can get started, something bad happens that he feels he personally has to take care of. Thus begins the exciting and suspenseful story of Jesse after the marines. That is all you get. Sorry can't and won't give anything away that happened in this story!!This book took a turn, no, a couple of turns that I did not see coming. It kept me glued to the story to see what was going to happen next. Some of the turns were dark, in a bad but good way?! After you read the book you will agree but disagree with that statement just as I did when I wrote it. Then read the rest of his books in this series as you don't know what is going to happen at the turn of a page. This is my review for all of the books in this series, because everything I said above holds true for all of his stories. ( I will say this, You Will Hate to Love Book 2!!!) And while you wait for the 8th book (or whatever book you may be waiting for after reading this review) start his new series about Charity Styles, first book titled \"Merciless Charity.\" No I will not tell you who she is, but you are going to LOVE this series too!!!!HAPPY READS",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William E. Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAPESQ6O5P4PSCGKW252PBIZDGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZBNBF1VU3695?ASIN=B00O1BU7AW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2014",
                "reviewTitle": "5.0 out of 5 stars A Book of Fine Vintage",
                "reviewText": "I am just a few chapters in \"Fallen Mangrove\", and while the pacing of this book is a little different, I find that it suits the material. I have read a few of the not so glowing review (and stopping before any spoilers), and I would have to disagree on several points mentioned. I find the back story on some of the villains and the long chapter on sinking of the treasure chip to be an asset in this novel. He could have just let his main characters \"theorize\" what had happened and that would have been OK, but by actually bringing the characters to life make the story telling much more complete, more \"real\". And the back story on the villains have added the dimension of why something is done or not done based on the character and not just blowing the reader off. (See my forum article on \"6 Fathom Characters)Because of various projects and deadlines I am currently reading 5 different books, two technical and 3 fiction. But when I want a little down time to enjoy, truly enjoy, the time i spent with a book, in this case \"Fallen Mangrove\", I read a chapter or so. I like to savor Mr. Stinnett's writing. If you read it slowly you find all kinds of things of interest, that do not have to be there, but overall adds to the depth of the story. If I had to, I could read the book in 3 maybe 4 hours and enjoy it, But since we are going to have to wait for the next novel, I would just prefer to stretch it out. I do not do this with books unless I really enjoy them.I read other action/adventure books, Bolan, Stony, The Destroyer and others and enjoy them. And they are what they are. Stinnett's books offer a different perspective and one of depth as well. Each book has been different (I have read them all) and find it quite amazing that the earlier books do NOT suffer in comparison with his later books and this one. He may not be perfect but he is closer than most and getting better with each book. He has developed a world with his characters that invite you to step in and have a beer. It is going to be another hot one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Bequette",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3B4Q5L4D2QN25YVETJ7IFC6C5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C1EOW90OGJ6Y?ASIN=B00O1BU7AW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2014",
                "reviewTitle": "4.0 out of 5 stars Another Great Read",
                "reviewText": "Once again, Mr. Stinnett has given his readers a terrific adventure story. I love the way the team acts and reacts, but in all honesty, there are a couple of shortcomings to the story. For one, it was confusing having so many bad guys popping up in the story, and was hard to keep them separated (at least in my mind). Also, the two Cigarette boats at the end were also confusing, as I thought all the main bad guys were captured/killed off. His daughter popped up at he beginning of the story, and a setup to have her in danger (while being armed, herself) but it never took place.The overall theme of these books is intact, however, and the good guys win...fortunately without any more losses. Looking forward to the next one, due out in 2015. Great read, but parts felt a bit rushed. It is not for me to criticize a terrific writer, but I would encourage Mr. S to take his time of the next one. I have given all his other books five stars, and hope to do so in the future. This was just a wee bit shy of the mark. Still highly recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott Jung",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6EWBF6SHR6FE3MXMIRJC56U7OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DNR8DYUJ84P2?ASIN=B00O1BU7AW",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "3.0 out of 5 stars Too many characters",
                "reviewText": "I felt like there were too many characters in this one. Some introduced midway in the book. Hard to follow. Also got a little Clancy-esque with all the plane and boat details. Finally, a little too “sexy.”Tied together nicely towards the end, but a few too many cliffhangers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. Gary W Reid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 24, 2023",
                "reviewTitle": "Absobloodylutely wonderful!!",
                "reviewText": "The writing is uniquely very good. This or should I say these books by Stinnett are up there with the best. I’m especially grateful that he does such a good job of writing about the and all things doing with the sea. There is humor, drama, belly laughs, sick humor, sea humor, diving, &Te. One of those authors you just have to say, ‘Thank you, Wayne Stinnett, what a book.’",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 10, 2020",
                "reviewTitle": "Superb",
                "reviewText": "Another great book in the series, by Wayne Stinnett. Some of it may be a bit far fetched, but it makes for an enjoyable read - evidenced by the fact that I am working my way through the Jessie McDermitt series in order and without other distractions.Stinnett is, in my view, an excellent author who paints a vivid picture with his words; the main characters are well developed and portrayed far more imaginatively than in many similar novels.In some respects, I find Wayne Stinnett’s writing similar to that of Lee Child and the lead characters are not entirely dissimilar, which should help guide prospective readers of this series.Although the books follow on in a natural progression, there is enough detail to begin the series anywhere to see if the books suit you.Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Author, David Adams",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 22, 2018",
                "reviewTitle": "Another great yarn in paradise.",
                "reviewText": "As the Author of Terror in Our Homeland I always enjoy another in the Fallen series. Stinnets commitment to strong characters, tropical settings and fast paced action.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noel Rodrigue",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 26, 2019",
                "reviewTitle": "Another in the series.",
                "reviewText": "I started the series and I'm trying to read the books in order. Interest is still present, as I go along the 'participants' get fleshed out better. On to the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tim Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 22, 2017",
                "reviewTitle": "Another great adventure",
                "reviewText": "Some interesting twists but a little hard to keep track of all the names and who they were working for.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}