{
    "remaining_requests": 1961,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Choices-Scott-Jarvis-Investigations-Book-ebook/dp/B07ZQJ1MGM",
    "body": {
        "name": "Choices: A Florida Action Adventure Novel (Scott Jarvis Private Investigator Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Choices-Scott-Jarvis-Investigations-Book-ebook/dp/B07ZQJ1MGM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81lppTUAuUL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Scott Cook",
            "link": "https://www.amazon.com/Scott-Cook/e/B06VVRSGXK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 843,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A simple missing person’s case sparks off an Orlando detective’s journey into a deadly world of shadow and mystery…An idealist at heart, Scott Jarvis finds himself growing more and more disillusioned with police work. Assigned to what at first seems like a fairly mundane case to find a missing NASA engineer, he uncovers a plot that leads him into the dark underworld of organized crime and international intrigue. Just as he’s making real progress, Jarvis is pulled off the case and ordered to lay off or else…Frustrated and haunted by the shadows of his past, Jarvis confronts the most important choice of his life – stay on the job or turn in his badge and become a hard boiled private investigator… play by somebody else’s rules or do it his way – with fists flying and guns blazing!A new Florida action and mystery series that takes you on a journey from Orlando to the Florida Keys where the shadow world of smuggling, murder and a threat to national security could spell disaster for young Jarvis!",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07ZQJ1MGM"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Spindrift Press; 2nd edition (October 28, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 28, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3300 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#36,551 in Kindle Store (See Top 100 in Kindle Store) #141 in Hard-Boiled Mysteries (Kindle Store) #179 in Sea Adventures Fiction (Kindle Store) #182 in Men's Adventure Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 843 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ona",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENLLTAJGIFKBFCVM2KR3VKK5QIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZP6YBRDMHZGJ?ASIN=B07ZQJ1MGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 27, 2021",
                "reviewTitle": "5.0 out of 5 stars Page turner detective fiction",
                "reviewText": "Excellent hard boiled detective fiction. Scott Jarvis is dissatisfied with his role as a police officer. His romantic life isn’t going too well either. It seems that when he reaches the “I love you” stage of a relationship, he immediately backs out. Injured on the job, crooks that he worked hard to build a case against released, and the death of an eighteen-year-old that he felt he should have been able to save push him to the tipping point of a career change. For what happens next, you need to read the book. You will not be sorry. Written in a clear, bright style with just enough grit to make it real, seasoned with a dash of romance and a large scoop of action, this is definitely a page turner. Fans of Micky Spillane, or even of Harry Dresden, will enjoy the snarky repartee, the fast action, and the exceptionally satisfying conclusion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Piaras",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4CHVFNOR7RFE7L7VBZXLPDDQ6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1115CO3O005E4?ASIN=B07ZQJ1MGM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2021",
                "reviewTitle": "4.0 out of 5 stars Action, mystery and adventure.",
                "reviewText": "Choices: A Florida Action Adventure Novel by Scott Cook is the first book in the Scott Jarvis Private Investigator series. The author spins a somewhat persuasive yarn that will take the reader ‘on a journey from Orlando to the Florida Keys where the shadow world of smuggling, murder and a threat to national security could spell disaster’ for its main protagonist Scott Jarvis.The book description gives a sneak preview: ‘A simple missing person’s case sparks off an Orlando detective’s journey into a deadly world of shadow and mystery… An idealist at heart, Scott Jarvis finds himself growing more and more disillusioned with police work. Assigned to what at first seems like a fairly mundane case to find a missing NASA engineer, he uncovers a plot that leads him into the dark underworld of organized crime and international intrigue. Just as he’s making real progress, Jarvis is pulled off the case and ordered to lay off or else… Frustrated and haunted by the shadows of his past, Jarvis confronts the most important choice of his life – stay on the job or turn in his badge and become a hard boiled private investigator… play by somebody else’s rules or do it his way – with fists flying and guns blazing!’The story unfurls in small acts, at first feeling slight to touch, then building in emotional substance. The plot at times seems to be a bit farfetched and unrealistic but there’s an abundance of imagery in the writing style that makes you feel like you are right there in the story. Fans who like their action and adventure infused with mystery and suspense will enjoy the ride!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GDPLewis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDB5B42RUONAQVGVBTKO5APRBHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ITUMGXJGRX3G?ASIN=B07ZQJ1MGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "5.0 out of 5 stars 2nd time",
                "reviewText": "around on this series. Excellent writing, well crafted, good humor interspersed well into the story AND VERY LITTLE ANGST! Can you tell i don't like angst? Plenty of blood and medical insurance being spilled.All in all....worth a 2nd read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bruce smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWTEIH2GUFNTKBF6BLYQ44Q2JDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCWA1CMJDVRXM?ASIN=B07ZQJ1MGM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Pretty good Travis McGee goes 21st century",
                "reviewText": "Scott Cook is not John McDonald and Scott Jarvis is no Travis McGee but the characters are well constructed, you root for (or against) them ANF its juicier than the 60s stuff of McDonald. I'm in for at least one more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J Armstrong",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5SVF75UQNN6QAO26PIT7XHA63Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LC86GLQV6N3W?ASIN=B07ZQJ1MGM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2021",
                "reviewTitle": "3.0 out of 5 stars A detective to PI saga",
                "reviewText": "A new series is here that follows Scott Jarvis, a private Investigator that works out of Orlando, Florida. This being the first book, we get insight into how Scott got into the Private Investigator work as he started out as a Detective. In the middle of a case, just as he gets some good intel and is closing in on the suspects in a missing persons case, Scott is ordered off the case, so he sets out on his own to finish the job. This decision will have deadly consequences as Scott is pulled into a dark web of Mafia operations and then the FBI steps in.The premise was interesting enough, I am not sure that the writing was good enough to carry the story. The protagonist was very caustic towards everyone else, a veritable “know-it-all” and that even applied to situations where he did not have experience. His ability to survive a firefight intact was stretching credibility as well as his handling of certain situations. The book was full of action and some suspense, so if you can overlook the character flaws than you might still enjoy the book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cecil T. Demonbrun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOOHUS5URKFS25KH7GTAFCAURGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JY9E4RMF9AZQ?ASIN=B07ZQJ1MGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Spectacular story",
                "reviewText": "Liked this book from the beginning to the end. Good character development and dialogue. Looking forward to more from Scott Cook!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Phil Bolos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWTHDBUDDCQQG5K3RUZUC7UUAQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VULK7WW5CW0F?ASIN=B07ZQJ1MGM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 3, 2021",
                "reviewTitle": "4.0 out of 5 stars Good beginning to a series",
                "reviewText": "Choices: A Florida Action Adventure Novel (Scott Jarvis Private Investigator Book 1) by Scott Cook is the beginning of the Scott Jarvis investigations series and introduces us to the main character. When we first meet him, Jarvis is a police detective who has been given a missing persons case. Just when he begins to close in on what is really taking place, he gets taken off the case with a threat attached. He decides to leave the police and become a private investigator where he can follow his own rules and pursue what he wants. This leads him down a rabbit hole as he discovers there are far more sinister forces at work in the case than what he suspected.Overall, I liked the story and the characters. I think the series will have potential to have some good investigations and conflicts along the way, and the setting in Florida offers many great opportunities for the characters to get involved with different types of crimes and levels of violence. The story moved slowly, especially in the first half, but picked up some speed once we got into the second act. Some of the things the characters did were a little too far fetched for me as they offered more confusion or questions tahn they provided answers. But, none of these really distracted from the narrative or kept me from enjoying the broad story. I think that fans of police investigations and thrillers will enjoy this read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Evelyn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAKYEYDP3R2B5VSKBISAYRYHFGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROOD9ZA6V1P5C?ASIN=B07ZQJ1MGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 3, 2021",
                "reviewTitle": "5.0 out of 5 stars Pretty good mystery.",
                "reviewText": "This suspenseful, brilliant, compelling and well-written novel really absorbed me as soon as I opened it.Florida author Scott Cook has a rich sense of place and describes the Florida Keys so well that I could imagine I've been there many times and it is for this and his descriptions that I read this book so eagerly. He is a new author for me and I am glad I have found him.It is a pretty good mystery, involving an idealist detective, Scott Jarvis, who has the difficult task to dissolve the organized crime. I really loved the well fleshed out characters and I think they are very believable.I can't wait to read what the author will bring out next. This is a great masterpiece that had me engaged from the start.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cal Bambi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 26, 2022",
                "reviewTitle": "Such a pleasant read",
                "reviewText": "Yes I loved this book. I found it a comfortable even with all the detailed information. The lead character Jarvis and the FBI agent Niki were very good together whether working or loving. The book had some classic confrontations and the end was as I hoped it would be. I just went through hurricane Fiona and when the power came back on it was great to get back to this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richard w hulse",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 31, 2021",
                "reviewTitle": "Solid addition to the gumshoe genre",
                "reviewText": "Sarah Conklin’s husband goes missing, and Orlando police detective Scott Jarvis is assigned to find out where he is. As always in such situations, he uncovers plenty of deception and some corruption from various quarters. When he’s pulled off the case, he determines to quit the force and strike out as a private investigator. Scott Cook knows his genre – he channels Raymond Chandler a bit as any self-respecting noir writer should - and utilizes a snappy, wise-cracking writing style. Our hero may be a little too much of a babe magnet for plausibility and the ending is a little conventionally shoot-‘em-up, but the story is assured and professionally paced. Overall, this is a neatly told mystery/police procedural.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David E McDonald",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 17, 2022",
                "reviewTitle": "very good story",
                "reviewText": "I really liked the story line. A little unusual but it hung together.A little bit of humour and some good action scenes.Yes I enjoyed it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}