{
    "remaining_requests": 1836,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Warriors-Shadow-RiverClan-Graphic-Novel/dp/0062946641",
    "body": {
        "name": "Warriors: A Shadow in RiverClan (Warriors Graphic Novel)",
        "price": "$10.78",
        "originalPrice": "$15.99",
        "rawPrice": 10.78,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Warriors-Shadow-RiverClan-Graphic-Novel/dp/0062946641",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81coFShJGbL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Erin Hunter",
            "link": "https://www.amazon.com/Erin-Hunter/e/B001H6NITG/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 2012,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Erin Hunter is inspired by a love of cats and a fascination with the ferocity of the natural world. In addition to having great respect for nature in all its forms, Erin enjoys creating rich mythical explanations for animal behavior. She is the author of the Warriors, Seekers, Survivors, Bravelands, and Bamboo Kingdom series. Erin lives in the UK."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The warrior cats leap off the page in their first-ever original full-color adventure—a stand-alone graphic novel set in the wild world of Erin Hunter’s #1 bestselling Warriors series.When RiverClan fell under the rule of the vicious Tigerstar, Feathertail barely escaped with her life. Now RiverClan is trying to rebuild in unity and peace—even if Feathertail isn’t ready to forgive her Clanmates.But when RiverClan takes in a rogue cat named Sasha and her two kits, Feathertail must find a way to escape the shadows of the past if she is to be a part of her Clan’s future.Set after the events of Warriors: The Prophecies Begin, this action-packed, stand-alone adventure is perfect for longtime Erin Hunter fans and new readers alike.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Animals",
                "link": "https://www.amazon.com/Animals-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2787"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ HarperAlley; Illustrated edition (June 2, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062946641"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062946645"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.75 x 7 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,923 in Books (See Top 100 in Books) #78 in Children's Cat Books (Books) #160 in Fantasy Manga (Books) #495 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 2,012 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Salty Sweet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTN5PWEANZZ37PTGZIXHHWJD3FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M7OXD2BVZ62C?ASIN=0062946641",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2020",
                "reviewTitle": "5.0 out of 5 stars Don't let the cash grab fool you...",
                "reviewText": "This book is fantastic. Really. It deserves 5 stars alone JUST for all the accurate throw backs. It is CLEARLY WRITTEN BY SOMEONE WHO HAS READ THE BOOKS AT LEAST UP TO SERIES 2, FIRESTAR'S QUEST, AND SASHA'S STORY.It's a fresh breath of air fans have not seen in a LONG time if you are fully aware of how much the Erin's editing team butcher the series as a whole. On top of the Erins' themselves not keeping a personal world bible to keep up with the plot and characters and ruining characters for everyone.In truth, it is far more like a 3 star - 3 1/2 stars book and I'll tell you why with many spoilers.Every time Stormfur opened his mouth, I laughed. Every time I thought about the morals behind this story, I laughed. Every time I saw a panel with a gigantic fox in the page and 4 tiny cats fighting it, I rolled my eyes.Stormfur, the cat who will go on to leave RiverClan and everyone he knows behind to go live in the death trap mountains with a hot female and his sister's future dead corpse (which EVERYONE should know about at this point), is making declarations that he will always live in RiverClan because he loves it there. They also go out of their way TWICE to show that he is just surrounded by groups of friends and is liked by everyone and also has a life outside of his mentor and sister and father. Speaking of which, he is a clone of Greystripe now and everyone loves him.He leaves RiverClan TWICE AND ThunderClan once to live the rest of his days in a godforsaken mountain in the latest books, remember? This cat...declares his loyalty to them like 3 times, as naturally as air. You see why I'm laughing.Honestly, only Stormfur and Feathertail have a different personality in this book while everyone else is pretty spot on.I was annoyed that they kept throwing Hawkpaw and Mothpaw into the mix like they were going to do something special in this book but they never did so it's just timeline accuracy. They actually made Sasha leaving more plausible than the other books so far, which I was never satisfied with. It feels kinda weird how Sasha is clearly fitting in RiverClan much better than her own arc shown, and she behaves like a concerned mother instead of being clearly selfish in the previous edition. I do feel that while her reasons for not staying do make more sense, she could have just never gone to the gatherings and taken a new name. RiverClan didn't border with ShadowClan back then, so the odds of meeting them were next to zero if Leopardstar ordered the Clan to go out of their way to not mention Sasha by name anymore.Also, she kinda just drops the bomb on this anyway by telling the four clans in person just before they leave for good. Sasha is a bit all over the place...I did like how Ferncloud was Feathertail's friend in ThunderClan and that Feathertail is shown to have more complicated feelings towards ThunderClan, who treated them great while her clanmates ordered her death. I always felt it shallow that she, Stormfur, and Mistyfoot just forgave her Clan for that and returned and now she is having moments of regret about that. It feels much more natural and organic than Twigpaw's multi-Clan jumping and I love it.I do wish that Feathertail talked to Mistyfoot about this, or at least confronted her Clanmates about this instead of focusing on Hawkpaw and Sasha. Maybe even said no during her warrior ceremony for a change (like ever) and called them out on it. It's a shame that all this blame was put on Leopardstar. I mean, she is guilty but they never bring up Stonefur's death or even confront the root of all this, which is the moral of this whole thing:Feathertail feels betrayed by EVERY SINGLE ONE of her clanmates when they wanted her dead when Tigerstar was still around.But again, she narrows down on Leopardstar towards the end of this and just doesn't do anything with her Clanmates. And once the thing with Leopardstar is quickly forgiven, she's totally able to forgive EVERYONE and even stops stalking HAWKPAW. Everyone also doesn't know what is stuck up her butt but doesn't ask either, clearly just choosing to forget the past like it never happened. Which even I feel like they just got away with it, like it was a delirious anime fever dream.Not the most thrilling options, but eventually she doesn't trust anyone except Stormfur and Greystripe. FEATHERTAIL: At one point, wishes for Leopardstar to die. (I'd wish for her to die onscreen just once myself but still....This brings me back to the moral of this story: Clan loyalty. Even when your Clan is wrong or being stupid, you have to side with them and nothing and no one else matters beyond your Clan's needs...........This IS Feathertail, right? Remember when I said that Stormfur and Feathertail changed? Feathertail is completely different! I don't hate it, but I laugh when I think about THIS VERSION OF FEATHERTAIL in Series 2.THIS version of Feathertail would NOT die for a bunch of strangers inside a mountain cave.THIS version of Feathertail would NOT fall in love with a WindClan apprentice.THIS version of Feathertail would NOT become a clone of Silverstream that she is in the series as we know.THIS version of Feathertail would NOT have a circle of friends outside Stormfur and her Clan.THIS version of Feathertail WOULD have a life beyond her brother.THIS version of Feathertail WOULD have had a decent life in RiverClan, maybe even have influenced Hawkpaw more and enjoyed becoming mentor to lots of apprentices.THIS version of Stormfur would NOT have abandoned his Clanmates, StarClan, AND his father for his dead sister and a hot female.nope. I love this characterization but it just ain't happenin'. But I forgive it all just the same. It's a nice quick read and nothing more.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Penguin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNKXTIHIPMSKGNLH5TBCDRLLE6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L1PUC1WT2WE6?ASIN=0062946641",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2020",
                "reviewTitle": "5.0 out of 5 stars Great read, just.....",
                "reviewText": "So.... there is a lot to say here..... but I’m gonna try to keep it short and simple.Overall it was a pretty great read. I was SO excited when I found out this story takes place in Riverclan ( has anyone else noticed how there is almost nothing about Riverclan?!)One of the main downsides is it was kinda short and the storyline wasn’t that great. Its mainly about Feathertail informing you on how she doesn’t fit in.... finding Sasha and the kits... fighting a fox.... and Feathertail forgiving Leopardstar way too easily.I do like the art though, and I love those kits!! I always find myself laughing at the trouble and mischief the kits in Warriors get into.The ending also disappointed me a little. (And kinda made me sad cause Feathertail finally fits in... and now she has to go on a journey that leads to her death) I felt that it didn’t leave me with enough to be satisfied. The ending usually pulls you in.... and either leaves you with a cliffhanger or a really memorable line or something to think about. This book did not.Also... why Feathertail??? Couldn’t they have chosen a cat that wasn’t involved is some big heroic destiny....?Ratings:Art: 9.5/10.— amazing.... just a couple panels could be betterStoryline: 7/10 — I think I already explained this aboveCharacters: 8/10 — some cats lack memorable and/or unique personalityDetails: 5/10 — I understand that stories need to mainly focus on on plot... otherwise it gets confusing. But every good story has some “side conflicts”. You know, a little romance, some type of rivalry, SOMEthing. This story has idk maybe one or two... but no good ones.Overall: 8.99/10 — this may seem like quite a high overall rating given that my other ratings weren’t two good. But I’m just pretty critical with books.... even if I really like them.BOTTOM LINE: I would have given this a 4.5 star rating if I could. However, this book was definitely worth my money! Can’t wait for the next Warriors graphic novel!!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amanda maupin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNANB6GT4VLU7RAOB3TPD3WX7VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROERTOG267YF4?ASIN=0062946641",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Book series",
                "reviewText": "My daughter loves this book series",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIJDYBZKNQSZCGEBM63GSYQXP2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KZXZBI2HF95A?ASIN=0062946641",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2023",
                "reviewTitle": "5.0 out of 5 stars AMAZING But I am sad that certain cats had to die but it was really nice seeing them and enjoying the experience",
                "reviewText": "I will literally never stop reading these books more like this please,I really need more books to read like this",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blake Castle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTEXJIWZZ4NQDIIX5JBNLJKBJ3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH8KIVXHGEEOP?ASIN=0062946641",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2021",
                "reviewTitle": "5.0 out of 5 stars It's Very Tight and Well Written",
                "reviewText": "This is what I've been wanting from the warriors series for a very long time - a tightly written narrative with great characters and stacks without the bloat of random plot elements and useless characters. This book is very emotionally driven, with some good introspection on the Clan life, but it still has some good action. The artist has also improved greatly from his first debut and it shows. Everything is beautifully colored. I highly recommend this for all Warrior Cat fans.NEW READERS BEWARE: It stands as a pretty okay stand alone for new readers, though it does talk about some 2nd arc events that may require some pre-reading if you're not very good at picking up on certain story clues. This book is not going to be the one that helps catch you up on the latest arc as this character only shows up in arc 2; The New Prophecy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kenken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDO543RYNC2EJG63O2DVAAMLFPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12N6ZM0593DFX?ASIN=0062946641",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Came dented",
                "reviewText": "It’s just a little dent but it bothers me because this is a christmas present and the dent doesnt make it look new. Everything else is good 👍",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51GJxoYMVrL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71D7fKGKKLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSUTYA73UGDS5GLKRZBH2E4BMGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G7IXA6NYDJRG?ASIN=0062946641",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2020",
                "reviewTitle": "5.0 out of 5 stars finally some good wc content",
                "reviewText": "i've been reading warrior cats for over 10 years and i have to say that this manga was one of my favorite books in the whole series - it's character driven, and we're learning about a situation that has boggled my mind for 10+ years - how DID riverclan react to leopardstar after tigerclan?this book is all about feathertail's character and her personality and i loved what they did with her in this book. she's not what you expect from her new prophecy personality and i loved it so much, she feels so much more real to me now than she did before. my only qualm with this book was the resolution, it felt too abrupt of a solution. but i still really love this book and definitely recommend it to other wc fans!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Helen Musson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 2, 2024",
                "reviewTitle": "Brilliant!",
                "reviewText": "Brilliant!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jewell G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 29, 2020",
                "reviewTitle": "Finally",
                "reviewText": "I wasn't expecting much when it came to a story about Feathertail, but this manga finally shone a light onto one of the rougher patches of the Clans' history. I honestly feel like I genuinely like Feathertail now, while I was ambivalent about her in her own books. Leopardstar has always rubbed me the wrong way, and having her need to face up to what she did in the original series was a fantastic place to take this story. I was thoroughly impressed.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edina P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 19, 2021",
                "reviewTitle": "Feathertail has always been a stunning character",
                "reviewText": "but the comics showed a side of her I deeply enjoyed reading about. Some things just don't pass you by and it's nice to see fictional cats struggle with things and complex emotions and alas, overcoming them. The colored pages add so much life to the comics. A Shadow in Riverclan has yet to be my favorite!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jem",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 30, 2021",
                "reviewTitle": "<3",
                "reviewText": "Easy manga to get through but I enjoyed it and it came quickly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lily",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 26, 2022",
                "reviewTitle": "Great book!",
                "reviewText": "Pretty good book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}