{
    "remaining_requests": 1708,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sword-Art-Online-Light-Novel/dp/B0BHKWTGZN",
    "body": {
        "name": "Sword Art Online 7 (Light Novel): Mother's Rosary",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sword-Art-Online-Light-Novel/dp/B0BHKWTGZN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51WZWpSLhXL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Reki Kawahara",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Reki+Kawahara&search-alias=audible"
        },
        "brand": "Reki Kawahara&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 497,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Kirito and Sinon's battle with Death Gun is over, but mere weeks later, something strange is afoot in the next-generation VRMMO ALfheim Online. A new duelist with a custom sword skill is defeating all comers—including Kirito! But when Asuna goes to face this duelist, she receives something she never expected: An invitation to an exclusive guild! But what is their aim? The Mother's Rosary arc begins! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Teen-Young-Adult-Action-Adventure/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10368508011"
            },
            {
                "name": "Science Fiction",
                "link": "https://www.amazon.com/Teen-Young-Adult-Science-Fiction-Action-Adventure/b/ref=dp_bc_aui_C_5?ie=UTF8&node=10368513011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 4 minutes"
            },
            {
                "name": "Author",
                "value": "Reki Kawahara"
            },
            {
                "name": "Narrator",
                "value": "Cherami Leigh"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 08, 2022"
            },
            {
                "name": "Publisher",
                "value": "Yen Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BHKWTGZN"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#43,193 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #54 in Action & Adventure Sci-Fi for Teens #263 in Teen & Young Adult Science Fiction Action & Adventure #416 in Teen & Young Adult Light Novels"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kimberly Rice",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3Z233DAPVVI5BMKSVS2HVWOGYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37ZQ3CDJWC9O?ASIN=B0BHKWTGZN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 23, 2016",
                "reviewTitle": "5.0 out of 5 stars At long last, SAO is worth reading!",
                "reviewText": "We've finally reached the point where SAO gets good. For once, Kirito takes a backseat to other, more interesting characters. But before I talk about what this book did right, let me talk about what it did wrong.First off, the title. The translator changed \"Rosario\" to \"Rosary,\" which I find to be pretty dumb. Fortunately, he forgot to change it within the text of the book, though. Also, the plot is hackneyed and cliched and brings nothing new to the table. One of the major plot developments is a ripoff of Clannad, and even Kawahara himself admits that it mainly exists to get tears out of the reader. Additionally, this book is too short. Near the beginning, it tells us that Asuna is a \"berserk healer,\" but we never really see that in action. She hasn't done anything significant since the Aincrad arc, and during the Calibur arc that we'll be getting in the next book, she does nothing but heal people. As a result, she comes off as a lot less cool in this arc than she did in Aincrad. Another example of \"tell, don't show\" in this book would be near the end, where we're given a three-page montage of the Sleeping Knights' adventures, which take place over several months (as opposed to the few days the rest of the book covers). Show us that! I want to see them go on silly, fun adventures through ALO! You know, as long as they don't take Kirito with 'em.Okay, now onto the good stuff. Personally, cliche though it may have been, I could kinda relate to the Absolute Sword's major wish. It's one of my biggest fears, right up there with death. At any rate, I'm very glad that Kirito isn't the strongest player anymore, though I do wish that had been shown more. Asuna's conflict with her mother is something that every teen has experienced in one form or another, and I was glad to see that Kawahara has a good grasp on how teenagers act in such situations. Plus, Yuuki and Asuna actually came close to feeling like actual people in this book. For the most part, SAO has been devoid of characterization up until now, but other than Sinon, this was the first time I found myself invested in an SAO character.If you're a fan of this series, let's be honest: you've probably already bought this. But if you're not, I recommend skipping the first six books and starting with this one. It proves for the first time that Kawahara knows how to write a good story in SAO's universe. It's not without its flaws, though - it could easily have been as long as book six, or even longer, and greatly added to the story, but it's still an entertaining and satisfying read. If you've read Accel World, I'd say this is about as good as book two of that.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tristan A. Hayes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3MR2EVAQWHB7PZCHM2NMMVQBAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VW1R4UFSDOHB?ASIN=B0BHKWTGZN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 16, 2021",
                "reviewTitle": "5.0 out of 5 stars Good Sidestory",
                "reviewText": "Mother’s Rosary finds itself in that place where it interrupts the flow of the main story to tell a side story that has no real importance on the main story, or so it seems. There are some world building details here that helps to explain how our characters are living their lives as normal teenagers while coming of age in terms of finding what they want to do with the rest of their life or how to deal with or handle relationships with family now that they’ve faced death before. For Asuna, the main character here, it helps here handle a deteriorating relationship with her parents who seemingly want here to inherit the family business.That aside, the exploration of full dive for terminally ill patients or otherwise disabled patients is a compelling thought or exploration of such technology. Giving such patients the chance to have experiences they wouldn’t otherwise experience in the real world was a touching and heartfelt thought experiment. Perhaps someday such technology will be real.The story was a fast read and emotional showing that Kawahara really knows how to tug the heartstrings. The action was his usual as well even if Kirito or Leafa weren’t the main characters here. The new character, Yuuki, was fantastic.Overall a good read. For anime watchers, found it to be comparable, though I think I give it the edge of the anime, some of the lines just read better/flow better/touch the heart better than what the anime (though good) did. Also, I thought the science explanation here was a bit better, though, a bit too written like someone who did the research but didn’t understand most of what they researched.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Akhelo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6HZTJTIQDWZ4Z52WLOCDGAY5PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MMYTNFXR5S24?ASIN=B0BHKWTGZN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2018",
                "reviewTitle": "5.0 out of 5 stars It doesn’t make difference on a person’s life and relation wheter in real or virtual",
                "reviewText": "It’s the 7th of the very major series but, another reviewer did as well, I storngly recommend to start reading with this for those who have ever read none of the SAO. Never mind, its episode “Mother’s Rosary” will be completed with this single volume, easy to understand without any knowledge of the prior stories. Furthermore, YOU MAY BE UNABLE TO READ IT WITHOUT TEARS, including by watchers of the anime(season 2 #18~#24) , amazingly a lot were reported to have been vastly touched.The coincident and essential theme of the series is “Life and relation with someone else make no difference wheter you’re in a virtual world or real world”.At the first episode “Aincrad”(volume 1 plus extra stories in 2, 8), the players including Kirito and Asuna, the protagonists, had been trapped where uneble to log off out of the full-dive virtual reality game, and death on the game causes one’s real death. After the episode, they didn’t. However, crossing between the both world, the main theme never changes, even the characters doesn’t face any risk of his or her own death, and sometimes dead in the game. Because what’s the most important is how to life and how to relate with others in both viutual and real. Either doesn’t mean to be prior to the other. They’re the same for where one meet and communicate with others.At this episode its essence above has been laid strongly, perhaps the strongest of the all series. It’s hard to descrive how, but I mean, seeing how strongly and vividly to live in the virtual world makes Asuna realize to fight also in her real world. If you find the mysterious girl named Yuuki what she is, you may come to think how willingly to live in both your virtual and real life.This is the word which had changed Asuna’s mind, I hope you’ll make sure how and why it made her do by reading the book!“There are some things which you can’t get across without confronting with others, Asuna. For example, how serious you’re about it.”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 6, 2020",
                "reviewTitle": "Wow",
                "reviewText": "This is one of the very few books that could actually make my emotions go from one side of the chart, to the other. I must commend both the authour, and the translators for this moving, yet heartwarming story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susanta kumar sarangi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 31, 2021",
                "reviewTitle": "Arrived in good condition",
                "reviewText": "Epic story this says it all",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morgan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 22, 2021",
                "reviewTitle": "Amazing book",
                "reviewText": "The best book so far in the SAO series very emotional. Arrived fast and in good condition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emin A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 22, 2018",
                "reviewTitle": "Einer der Besten aAcs in SAO neben dem legendärem Anfangs Ar!!!",
                "reviewText": "Liebe so oder so den Mothers Rosario Arc ,sodass es mich auch nicht stört die Novel Englisch lesen zu müssen...hoffe bald auch auf den Manga auf deutsch!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ramy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 7, 2017",
                "reviewTitle": "Excelente Arco :(",
                "reviewText": "Todo excelente es mi ardo favorito, un solo toml está excelente para explicar toda la historia, esperare el manga al español",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}