{
    "remaining_requests": 1989,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dragon-Teeth-Michael-Crichton-audiobook/dp/B06XT7K8DN",
    "body": {
        "name": "Dragon Teeth: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dragon-Teeth-Michael-Crichton-audiobook/dp/B06XT7K8DN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51SX4xVxdLL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michael Crichton",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Michael+Crichton"
        },
        "brand": "Michael Crichton",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 10971,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Michael Crichton, the New York Times best-selling author of Jurassic Park, returns to the world of paleontology in this recently discovered novel - a thrilling adventure set in the Wild West during the golden age of fossil hunting. The year is 1876. Warring Indian tribes still populate America's western territories, even as lawless gold-rush towns begin to mark the landscape. In much of the country, it is still illegal to espouse evolution. Against this backdrop two monomaniacal paleontologists pillage the Wild West, hunting for dinosaur fossils while surveilling, deceiving, and sabotaging each other in a rivalry that will come to be known as the Bone Wars. Into this treacherous territory plunges the arrogant and entitled William Johnson, a Yale student with more privilege than sense. Determined to survive a summer in the west to win a bet against his archrival, William has joined world-renowned paleontologist Othniel Charles Marsh on his latest expedition. But when the paranoid and secretive Marsh becomes convinced that William is spying for his nemesis, Edwin Drinker Cope, he abandons him in Cheyenne, Wyoming, a locus of crime and vice. William is forced to join forces with Cope and soon stumbles upon a discovery of historic proportions. With this extraordinary treasure, however, comes exceptional danger, and William's newfound resilience will be tested in his struggle to protect his cache, which pits him against some of the West's most notorious characters. Drawing on both meticulously researched history and an exuberant imagination, Dragon Teeth is based on the rivalry between real-life paleontologists Cope and Marsh; in William Johnson listeners will find an inspiring hero only Michael Crichton could have imagined. Perfectly paced and brilliantly plotted, this enormously winning adventure is destined to become another Crichton classic. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thriller-Suspense-Action-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10159268011"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Action-Adventure/b/ref=dp_bc_aui_C_5?ie=UTF8&node=10159270011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 40 minutes"
            },
            {
                "name": "Author",
                "value": "Michael Crichton"
            },
            {
                "name": "Narrator",
                "value": "Scott Brick, Sherri Crichton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 23, 2017"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B06XT7K8DN"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,268 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #16 in Historical Thrillers (Audible Books & Originals) #106 in Action Thriller & Suspense Fiction #223 in Historical Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Headly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHV2W5NOBJQXDPSIMXMESMQRAKBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAM4LYQYFTUEJ?ASIN=B06XT7K8DN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Of course five stars...and more",
                "reviewText": "What to say about a man who was forever writing his ,\"next\" book. You might remember...The Andromeda Strain, The Great Train Robbery, Jurassic Park, Disclosure, Prey, State of Fear, and Next, among many others.This story is part fiction and part true history with an adventure in the late 1800' s dealing with two professors of paleontology from Yale, who hate each other and will stoop to unimaginable lows that border on insanity.Consider that no one knew of dinosaurs in 1824. \" would God make something and then make them extinct? \" .was the thoughts during that time so the finding of huge bones and teeth were a mystery.My first encounter with the late Michael Crichton was The Great Train Robbery and I loved every word. Since then he has been my favorite author with his talent of placing the reader right in the middle of the action.They is nothing \" flowery \" and nothing is \" over explained\" just outstanding writing and a fantastic story.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reviewer #18.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJA2BYLJPLRBMIMVRTPBGJHJPFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HBMIZBWBS2CC?ASIN=B06XT7K8DN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "4.0 out of 5 stars Crichton entertains like no other.",
                "reviewText": "When you pick up a book by \"MC\", you get a story like no other. I liked this book. But having read others by him... I liked it not as much. Still, damn good read. Don't rob yourself by not having read it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERHVSYQXSAUL25EPPEIGBEVB7SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NU9VVGR1YUEP?ASIN=B06XT7K8DN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Westworld and Jurassic park prequel",
                "reviewText": "It's was just his genre to blend history, imagination, and science in order to weave a tale both educational and fun",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee Murray Brazos Booksellers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEBBMSVPL74AVZGE3UITBA6N2VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EUKLIDYHZ4GL?ASIN=B06XT7K8DN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "3.0 out of 5 stars an average read",
                "reviewText": "An interesting story, one with great promise that never reached its full potential . Would like to have seen Mr. Crichton’s final manuscript.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Msfit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWMDYY46GUMEPEBZIRYS46CPPWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNNN7Q5OUASQ1?ASIN=B06XT7K8DN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars wonderful novel",
                "reviewText": "Worth the time to read. Love historical novels and this one was a favorite subject of mine and time period.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQIBEF6DWWCATTGTBZKJAV5D6XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EAFBBDEQ4V7D?ASIN=B06XT7K8DN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 23, 2022",
                "reviewTitle": "4.0 out of 5 stars A Story Before the Story",
                "reviewText": "To be clear, this is part of the Jurassic Park/World universe. However, this book does not follow the format of other novels in the series. Very brief, this book follows the adventures of a college student in the early 1900s who went on an archeological expedition. He is brought along by the leader of the group, Professor Marsh, as a photographer and discover dinosaur bones, a lot of them and even those belonging to undiscovered species. On the way back they are attacked by a group of Native Americans and the main character is split up from the others. He survives alone in a newly established town close to a mine, and somehow manages to keep the fossils in his possessions safe, until he is able to leave and go back home.This book does not focus much on dinosaurs, there is no T-Rex or velociraptors trying to eat people; in fact no dinosaurs are alive. This is, however, a story of growth and of the true monstruous nature that is people. My only gripe with the story is a side character that does nothing to contribute to the story, but you are stuck with this character for a bit. Then all of a sudden the character's portion of the story ends and nothing consequential comes out of it; without this character the story would have remained the same. It is a minor gripe and does not change the fact that I enjoyed the story and got me excited to read the next books in the Jurassic Park/World series.I would definitely recommend reading the book if you like character development and for a little bit of the 'wild west' story type. Do keep in mind that if you expect to read about living dinosaurs eating people you will be disappointed. The events in the book happen as the first fossils are being discovered and being studied; way before the creation of InGen and their methods of bringing these creatures back to life.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bryan Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDDMBW5VPX5POMYJZNLSWKGTPUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38YVQI3FZZHFL?ASIN=B06XT7K8DN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars another great read!",
                "reviewText": "Another great Crichton read about dinosaurs. Mixing history with fiction creates an exciting tale of the dino hunters and the old west!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronald H. Clark",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIPEO6ERJ2RQDHM3G7BYKQJWOJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRZSGAKZ65UXD?ASIN=B06XT7K8DN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 30, 2017",
                "reviewTitle": "4.0 out of 5 stars Not your usual Michael Crichton novel--but interesting nonetheless",
                "reviewText": "I was surprised that there was no full explanation of how Dr. Crichton, who died in 2008, could be publishing a new book in 2017, with the exception of a brief afterword by his wife. But a little research cleared up the mystery. I learned he had been working, on and off, on this for 15 years before his death. His wife discovered the manuscript when organizing his archives. So while the book is represented as all Crichton, I expect there was some editorial work performed on it before publication.I have read with pleasure and benefit almost all of Crichton's previous novels. From that perspective, I would say this novel is OK but not striking--it certainly is not a page turner that grabs the reader. It is typical Crichton in that he instructs while entertaining. For example, he once again attaches a bibliography of related books for readers interested in pursuing the topic. He also stops the narrative at several places (107; 116;and 153) to explain the context of what is happening, so that the reader can fully appreciate the story. Since paleontology is the setting for the story, these brief explanatory interruptions are quite helpful. Crichston also attaches an author's note and postscript at the end explaining a few things.He also adopts the practice of intermixing real figures with the story's characters. This technique requires real skill and discipline in not overdoing it, and Crichton does not abuse the practice. The two central figures in the novel, aside from the young Yale student narrator, are two real professors of paleontology who during 1876 are competing for the academic title of King of Bones. The prize goes to whomever digs up the most important and numerous fossils, generally drawn from the far west. So almost immediately, in effect, Crichton has shifted the story into almost a conventional western--an area I only previously saw him involved with in \"The Great Train Robbery\" and indirectly in \"Westworld.\" So we have gunfights, Indian attacks, Deadwood, the U.S. Calvary, dance hall girls, stagecoach attacks, and other trappings of a western story. Yet throughout, Crichton keeps the theme of dino fossils first and foremost. Additional real life characters appear, including Collis Huntington (one of the big four founders of the UP railroad) and especially Wyatt Earp, who had come into prominence during the 15 years Crichton was crafting the novel.So, folks interested in the West and/or paleontology (the title relates to actual fossil dino teeth) should enjoy this book. Its 283 pages pass quickly, and the author thoughtfully has converted the end papers into a detailed map which makes it easy to follow where all the stages of the story occur. It is good to read Crichton once again!",
                "reviewVotes": "393 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 5, 2024",
                "reviewTitle": "Most excellent",
                "reviewText": "An interesting look at Americas past and the birth of popular palaeontology.Recommended read for any Crichton fans, maybe give a little insight to the beginnings of a Jurassic legacy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randolph Flowers",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 7, 2022",
                "reviewTitle": "A bit slow to get going but a thoroughly enjoyable wild west romp",
                "reviewText": "I was really surprised at how much I enjoyed this book about paleontology in the Wild West, it's actually a great adventure story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 25, 2017",
                "reviewTitle": "Muy Buen libro",
                "reviewText": "Muy buen libro, recomendado. Llegó en el tiempo acordado y sin problemas. Lo recomiendo plenamente para cuál quiere lector, sin problemas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Tolomei",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 26, 2019",
                "reviewTitle": "Fantastic and hilarious read!",
                "reviewText": "Crichton's pungent humor blends in with this historical adventure to spin an intriguing yet witty tale that kept me hooked until the last page!True that Michael Crichton is one of my favorite authors ever, but I didn't know how funny and ironic he could be. This work was therefore an unexpected surprise, and it thoroughly delighted me.I would recommend this book to anyone with a high sense of adventure, a curiosity for the history of the US expansion in the West, a bonding with the fate of the American Indians, but mostly the propensity to make fun of people and situations no matter how dire their conditions.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olivia LG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 13, 2017",
                "reviewTitle": "Como sempre, Crichton nos dá uma estória interessante e um monte de informações",
                "reviewText": "O livro descreve uma aventura em que alguns personagens existiram e fazem parte da história da América e da ciência. O cenário é o Oeste inexplorado, selvagem e sem lei. O momento é da corrida do ouro e das guerras contra os nativos. Além de uma leitura cativante, a estória nos revela aspectos da vida social, das idéias, dos costumes da época. Excelente leitura.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}