{
    "remaining_requests": 1695,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mutiny-Kydd-Novel-Adventures-Book-ebook/dp/B0012GTZ9S",
    "body": {
        "name": "Mutiny: A Kydd Novel (Kydd Sea Adventures Book 4)",
        "price": "$16.99",
        "originalPrice": "",
        "rawPrice": 16.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mutiny-Kydd-Novel-Adventures-Book-ebook/dp/B0012GTZ9S",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81IBhn0kpWS._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Julian Stockwin",
            "link": "https://www.amazon.com/Julian-Stockwin/e/B001HD3REK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 912,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In the grand tradition of Patrick O'Brian, this new installment in Julian Stockwin's epic Napoleonic-era naval adventure series re-creates one of history's most notorious naval insurrections.With all the wind-whipped passion and salty authenticity that only a veteran naval lieutenant commander could bring to the fiction table, bestselling author Julian Stockwin continues the acclaimed saga of seaman Thomas Paine Kydd as he takes on the most perilous venture of his career.The year is 1797. Kydd has been at sea four long, hard years, ever since he was pressed into service. Despite that inauspicious start to his naval career, he has learned to love his life aboard ship. It's in his blood. It's in his soul.Having now risen to the rate of master's mate, Kydd volunteers to join the crew of the frigate Bacchante in a mission to rescue a British diplomat mired in the hostilities of Napoleon's siege of Venice. The city is surrounded. It will soon fall to Napoleon, and the diplomat will be trapped unless Kydd and the men from Bacchante can help him escape.Stockwin's rousing narrative follows Kydd and his mysterious seafaring mate Nicholas Renzi across the Mediterranean to a rendezvous with danger, and then back toward an even greater challenge -- a harrowing fleet mutiny.As the king's loyal servant, Kydd must decide whether to join his shipmates in their uprising. The cause is just -- sailors' pay has not been raised for a century and a half! But to mutiny is to commit the ultimate treason against king and country. Will Kydd honor his pledge to his sovereign lord, or will he stand by his friends?Kydd faces the most difficult decision of his life in this richly nuanced novel from a master storyteller whose naval expertise and love for the sea shine through on every page. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0012GTZ9S"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Scribner (November 1, 2007)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 1, 2007"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2170 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 333 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#167,658 in Kindle Store (See Top 100 in Kindle Store) #259 in Sea Adventures Fiction (Books) #520 in Sea Adventures Fiction (Kindle Store) #652 in Historical British Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 912 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "fred e stewart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD6WRRTSDF7YELFYV4NGTS4GCGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RUUDAPGZLUYP?ASIN=B0012GTZ9S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars as advertised",
                "reviewText": "Book was in pristine condition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fred Camfield",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AES2H2TZVF35I352PKGADID45YXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW8IXA0SLJUIK?ASIN=B0012GTZ9S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2006",
                "reviewTitle": "4.0 out of 5 stars Mutiny at the Nore, 1797",
                "reviewText": "This novel finds Thomas Kydd serving as a master's mate on board the 64 gun ship Achilles. Initially they go to Gibraltar in early 1797, where Kydd becomes involved with a married woman. His friend, Nicholas Renzi, gets him temporary duty on a frigate bound on a special mission to the Adriatic Sea in order to pry him loose from an affair that could ruin his career (and maybe get him horsewhipped by the woman's husband). This adds a side adventure to the plot with a good description of events in Venice as Napolean closes in to occupy the city. We also learn something of Renzi's past life.After returning to his ship in Gibraltar, the Achilles returns to England and is diverted to the Nore after learning of the mutiny at Spithead. That only delays the problem, and actually gets the ship into a bigger problem when the mutiny spreads to the Nore and the North Sea fleet. Kydd finds himself drawn into the plot and putting his life on the line as a mutineer.The novel is one of the better descriptions of the events at the Nore and within the North Sea fleet. The author has carried out some good research, and gives a good description of the area at that time, as well as the events within the mutiny. Nicholas Renzi needs to go to great lengths to preserve Kydd's life, but makes him a turncoat to the foredeck hands. Kydd also loses Kitty, the new love in his life (sailors seem to have raging hormones that take them from woman to woman).The novel ends with action at the Battle of Camperdown, and Kydd's step up to a temporary rank of lieutenant and a meeting with Admiral Onslow, from the same town in England, which brings him to the admiral's attention. The Admiral knows of the school run by Kydd's parents.One reason I did not give the novel a five star rating is because of errors in the extraneous material introduced by the author, always a problem especially when an author inserts color commentary. Some literary license can be tolerated, but not errors in basic geography. In the last sentence of Chapter Two, for example, he puts Naples in the northern Adriatic (please invest in a map before you write the next novel). There is also a problem with the interlude in Gibraltar as women and children had been evacuated before the time indicated in the novel. The evacuation is covered in the biography of Peter Puget, who commanded the ships used for the evacuation.I would note that I have the same problem with Stockwin's novels that I had with O'Brien's novels, i.e., too much action in too short a time period, with ships zipping about at high speed from one point to the next. In reality, sailing was a slow business, especially if you encountered head winds. Also, the descriptions of ship handling may leave the reader a bit glassy-eyed if one is not a deep-water sailor. It was a very technical profession which Stockwin has made very evident.I would question the author's comments about the lack of masters mates, which some accounts from the period seem to indicate were fairly common. Perhaps this was a transition period where more emphasis was placed on midshipmen (who, essentially, were untrained apprentices and highly expendable).",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bret Jensen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZKIAM3O6NJO6JWXBZN33O4C2TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1B0EOB995O01J?ASIN=B0012GTZ9S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Very well written book.",
                "reviewText": "I enjoyed the experience of hearing about a pressed man, moving up the ranks. It's a little bit of a different twist from reading books about the Napoleonic wars.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zkribbler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3NZRJURTT3QANAA5NTS5DX6RIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDDGE66QQRWE2?ASIN=B0012GTZ9S",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 22, 2010",
                "reviewTitle": "3.0 out of 5 stars Mutiny: A Kydd Bureaucratic Adventure.",
                "reviewText": "The first three Kydd adventures gave me great pleasure. This one was a disappointment.The first 150 pages consist of three disconnected stories. In Gibraltar, Kydd becomes infatuated with a married woman. Then he's wisked away on an incursion into the Adriatic which, for awhile, holds promise of becoming an interesting tale. But eventually he sails back to Gibraltar with this adventure inconclusive and unsatisfying. Upon his return, Kydd fears a confrontation with the lady's husband. However, a fortuitous and improbable misunderstanding keeps the husband in the dark. And so, when Kydd departs for England, his romance comes to an inconclusive and unsatisfying end. Crossing the Bay of Biscay, there's a naval battle (finally). But after a great beginning, this confrontation also is inconclusive and unsatisfying. None of these three stories has anything to do with the mutiny or with each other.But at around page 150, begins the infamous Noor mutiny, from which this book derives its name.When a fictional character is dropped into a great historical event, the author must write two stories: the big story of the epic event, and the little story, consisting of the hero's personal tale. And, it is essential that the big story remain in the background while the smaller, personal tale is kept center stage. But here, Kydd has no personal tale. He has no goals outside of the mutiny, and even there, he is ineffective. As acknowledged on page 299: \"[Kidd] had been carried along by events and was as powerless to affect them as a leaf in a fast stream.\" Kydd has been reduced from his normal status as action hero to a mere observer of events. More damningly, the events consist mainly of strategy meetings, negotiations, and political maneuvering. The title of this book should be \"Mutiny: A Kydd Bureaucratic Adventure.\"However, at the 300-page mark, Kydd's old friend Renzi swings into action. It is he who provides the \"little story.\" Renzi must save Kydd from the certain doom towards which Kydd is being carried. Kydd has no idea how to save himself and for most of the time is even unaware of his own danger. Renzi shows insight, cleverness, daring and a dash of perfidy in his efforts to save his old friend. Although Kydd is this book's main character, Renzi proves to be the hero.Then suddenly, Stockwin wakes up and remembers that his title has promised a sea adventure. So, he ends his book with a fleet action--a fleet action which, not surprisingly, has nothing to do with the rest of the book, not the mutiny, not the married lady, not the Adriatic incursion, and not the early sea battle. Although I must admit, it is a wonderfully written fleet action.In sum, the first 150 pages of \"Mutiny\" are irrelevant. The next 150 pages are boring. The final 50 pages save the book, getting it three stars.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William B. Krones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVHUZ2KJ6HJ6P5DXRBDBK2565SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I98RQ9V7OCOY?ASIN=B0012GTZ9S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2004",
                "reviewTitle": "5.0 out of 5 stars If you enjoyed O'Brian...",
                "reviewText": "If you enjoyed reading the fabulous Jack Aubrey series of naval adventure novels from the late Patrick O'Brian, then you will love the Kydd Series by Julian Stockwin. Nothing can replace O'Brian, of course, but these come surprisingly close in some ways. The strength of this series is the sailor's dialogue, as created by Stockwin, a former officer in Her Majesty's Navy. Picture this scene: The press gang has just busted into a busy tavern and the leader of the group has to shout to get the attention of the befuddled customers...Stockwin's dialogue can be very funny...\"So, who's fer a life on the rollin' seas?\" That's from memory--it had me laughing for a day or two--but you get the idea. I have read all of Forester, Kent, Cornwell, and a few of the others, and the Kydd series is right up there with the best of them. In my opinion, the dialogue is a match for O'Brian, or even superior, although, in total, O'Brian's work remains the best that has ever been published in this genre. Moreover, Stockwin's knowledge and descriptions of the technical details of running a King's ship at the end of the 18th century is absolutely on a par with O'Brian, in my opinion.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan Butler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZJOSWQKRHBRK3YNV4EGLYDSZ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHN0WHTHKVWGA?ASIN=B0012GTZ9S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2021",
                "reviewTitle": "4.0 out of 5 stars This series just gets better and better.",
                "reviewText": "I enjoyed this book immensely, and heartily recommend it to anyone who, like myself, wishes to be immersed in the world of the Royal Navy during the Napoleonic wars.Mr. Stockwin knows how to spin a yarn and I am looking forward to starting book 5.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCR6CBKNOJZQ2XLY2HAUFFBRTBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39MIMH4F5LO5N?ASIN=B0012GTZ9S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 28, 2021",
                "reviewTitle": "5.0 out of 5 stars Entertaining Series",
                "reviewText": "Great book. A true Sea Adventure. Very hard to put down. Looking at book 5 right now. Am looking forward to the entire series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Clemens Schoonderwoert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2022",
                "reviewTitle": "A Marvellous Mutiny!",
                "reviewText": "Read this book in 2005, and its the 4th volume of the wonderful \"Thomas Kydd\" series.The year is AD 1797, Kydd, now master's mate, in company of his best high-born friend Nicholas Renzi and the rest of the crew, sails the the fabled Rock of Gibraltar, and in an attempt to win a lady's heart he joins a dangerous to Venice to rescue a diplomat from the clutches of the French.After this experience and heading first back to Gibraltar, Kydd and his men set sail to England, to be confronted with an unusual situation.This unusual situation is their involuntary involvement in the Mutiny at the Nore, with thousands of men holding their ships and cannons at ransom while the Government is nearly bankrupt.This insurrection will finally fail, but it will instil one other important matter and that is when the Dutch threaten England, and the French looking for the kill, England must overcome this threat from the Dutch, and that will be sealed with a glorious but also a very bloody victory at the Battle of Camperdown.What is to follow is a brilliant naval adventure, in which the Mutiny at the Nore as well as the Battle of Camperdown is wonderfully pictured in all its ferocity and bloodletting during this famous Battle, and all this is brought to us in a most authentic and impressive fashion by the author.Highly recommended, for this is another top-class naval adventure to this amazing series, and that's why I like to call this episode: \"A Marvellous Mutiny\"!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Driag",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 19, 2020",
                "reviewTitle": "A great seafaring series",
                "reviewText": "Another fine story in the Kydd series",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "esl75",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on September 24, 2016",
                "reviewTitle": "Stockwin au mieux",
                "reviewText": "Stockwin est toujours intéressant, et ses livres m'interpellent. Cette intrigue est bien écrit, assez halétant. Parfait pour lire lors d'un long voyage en train ou en avion.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "baritonedad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 22, 2016",
                "reviewTitle": "Another wonderful adventure well written by Stockwin",
                "reviewText": "Another wonderful adventure well written by Stockwin. He has great descriptive powers as a writer and puts the reader right in the action.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Klaus Kreitz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 18, 2017",
                "reviewTitle": "Clear Vision",
                "reviewText": "am a fan of Napoleonic wars and British Naval power of that era ... Stockwin writes perceptively about the challenges of living on a Man O' War vessel ... he brings a clear vision of what the action might have been like, and how life on an inactive ship might also brings its challenges. His writing makes one believe one could be right there, in the midst of it all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}