{
    "remaining_requests": 1999,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Island-Lost-Extraordinary-Story-Survival/dp/1616209704",
    "body": {
        "name": "Island of the Lost: An Extraordinary Story of Survival at the Edge of the World",
        "price": "$10.99$10.99$10.44$10.44$10.99",
        "originalPrice": "$16.95",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Island-Lost-Extraordinary-Story-Survival/dp/1616209704",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/511sPjeqrGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51DcQTYsJGL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Joan Druett",
            "link": "https://www.amazon.com/Joan-Druett/e/B000APKEAQ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by LuxuryMerchandise (Veteran Owned) and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 6842,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “One of the finest survival stories I've read.” —Seattle Times “If the southern part of Auckland Island is all Robinson Crusoe, the northern part is more Lord of the Flies . . . Druett is an able and thorough guide . . . [She] shows that real leadership is rare and powerful.” —The New York Times Book Review “Druett’s well-researched account earns its place in any good collection of survival literature.” —Entertainment Weekly “Those yearning for a classic man vs. nature, triumph-over-terrible-odds story, get ready to set sail.” —Paste “Swashbuckling maritime history reanimated by a noted naval enthusiast . . . Druett excels at recreating the men’s struggles and desperation (tempered by boundless hope).” —Kirkus Reviews “This is a fine addition to the genre of survival tales like Endurance or In the Heart of the Sea.” —Publishers Weekly About the Author Joan Druett is a maritime historian and the award-winning author of several books, including Petticoat Whalers, She Was a Sister Sailor, Hen Frigates, Tupaia, and The Discovery of Tahiti. Her interest in maritime history began in 1984, when she discovered the grave of a young American whaling wife while exploring the tropical island of Rarotonga; she subsequently received a Fulbright fellowship to study whaling wives in Massachusetts, Connecticut, and California. Her ground-breaking work in the field of seafaring women was also recognized with a L. Byrne Waterman Award. She is married to Ron Druett, a maritime artist."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 3 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“Riveting.” —The New York Times Book Review Hundreds of miles from civilization, two ships wreck on opposite ends of the same deserted island in this true story of human nature at its best—and at its worst. It is 1864, and Captain Thomas Musgrave’s schooner, the Grafton, has just wrecked on Auckland Island, a forbidding piece of land 285 miles south of New Zealand. Battered by year-round freezing rain and constant winds, it is one of the most inhospitable places on earth. To be shipwrecked there means almost certain death. Incredibly, at the same time on the opposite end of the island, another ship runs aground during a storm. Separated by only twenty miles and the island’s treacherous, impassable cliffs, the crews of the Grafton and the Invercauld face the same fate. And yet where the Invercauld’s crew turns inward on itself, fighting, starving, and even turning to cannibalism, Musgrave’s crew bands together to build a cabin and a forge—and eventually, to find a way to escape. Using the survivors’ journals and historical records, award-winning maritime historian Joan Druett brings to life this extraordinary untold story about leadership and the fine line between order and chaos.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "History",
                "link": "https://www.amazon.com/History-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9"
            },
            {
                "name": "Australia & Oceania",
                "link": "https://www.amazon.com/Australia-Oceania-History-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4921"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Algonquin Books; Primary edition (August 6, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1616209704"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1616209704"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.6 x 0.63 x 8.76 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#21,012 in Books (See Top 100 in Books) #2 in Australia & New Zealand History #5 in Oceania History #383 in World History (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 6,842 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECTAJPIHF3R6PDXNGRRMUMSQGGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U9YA8FZTV2T6?ASIN=1616209704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Both educational and intertaining",
                "reviewText": "Well written, it kept me enthralled the entire book. The last section of the book puts to light the massive amount of research she has done in a monumental effort to produce an accurate depiction of what actually happened. It is interesting to compare the two groups of castaways and how the right leadership, and teamwork can inspire hope and the will to surmount the seemingly impossible. In contrast the opposite leads quickly to despair and death. Excellent work and a joy to read.And for those who think it talked too much about killing seals (like many of the reviews), that was the way they subsisted and occupied large portions of their time. If people don't want to hear about what really happened, they should read a fiction vs historical novel. Sugar coating the facts for the folks that like to have their animals butchered by others is just plain silly. Sea Lions are cute, but when you are starving, you need to kill to survive. This is the brutal reality of being shipwrecked.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mnigrey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK4J5BWE5EMEZM2VEOI7NKSJBQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25MLHS844VSKG?ASIN=1616209704",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 13, 2023",
                "reviewTitle": "4.0 out of 5 stars Shipwrecked: A Survival Story",
                "reviewText": "An entertaining and informative read about both the physical and mental aspects of survival after two sailing vessels and their crews crash on a remote island in the South Pacific.There’s a lot said contrasting the approaches taken by the very different, but equally desperate groups of survivors. The leaders of each group, Musgrave and Holding, are depicted as practical men trying to help their crews survive the best they can. One group turns to bettering their situation, building a crude hut and scouring the area for food. The other basically gives into despair and hopelessness, each choice further dooming them.I was a bit surprised by the level of detail describing the near-constant seal hunting that made up most of the survivors diet. There’s a lot of frankly gruesome content about the most efficient way to beat a seal to death and which variety of seal was the best to eat. Apparently, hitting them in the left eye was favored, and the youngest seals had the tastiest flavor.Despite the harsh, wild environment - spoiler alert - some of each group survives to tell their tale, but not without sacrifice and suffering. The book nicely wraps up the ‘adventure’ with brief epilogues for the surviving crew members, and notes that future castaways were saved by the emergency supplies the islands were seeded with as a result of these shipwrecks.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex E",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYU3SB6LB3W64WWIARMDUXKCA7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BK3A7N4FK139?ASIN=1616209704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book!",
                "reviewText": "Thoroughly enjoyed reading this book! Well written and never seemed to drag out. Highly recommend!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shop Organize",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7X5DMXD52FAP4UMCC47XJBOO3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R270Q0TAJ1OMSA?ASIN=1616209704",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2020",
                "reviewTitle": "5.0 out of 5 stars Incredible characterization and storytelling",
                "reviewText": "This is an incredibly well composed book about tragedy, brotherhood, respect, survival, and the ingenuity of humans and their will to survive. It also clearly illustrates the difference between the power of unity versus every man for himself. In the beginning, the book does start off as cumbersome to read. Once you get past the initial couple of chapters, oh, you're in for a smooth ride that will have you turning pages.The story itself is incredible, two sets of sailors from different ships getting shipwrecked on the same island! Both facing starkly different outcomes.You are going to absolutely fall in love with these characters, the author does an amazing job of characterization here. Every character is expertly built from historical accounts and the author's own ability to breathe life into their long since passed lives. She's not just going to tell you the story of something that happened one hundreds years ago from a distance. This story is told to you on an almost day-by-day basis where you feel like you are there. You are going through this with these characters. Every setback that they have, every triumph that they have, you are a part of that. She does an incredible job of building character relationships, were you can almost see the reactions they would have had toward one another based on a particular action before you even read the authors explanation of their actual reactions.Every character's personality is cleanly portrayed. The captain, a man with a hard exterior with a vulnerable side that cares enormously about his ethics and morality. The jack-of-all-trades Frenchman... Although it is a common belief that Sailors, Wailers in particular, where a group of hard, rough individuals, there is a tenderness to the story that brings to life the side of these men most people weren't privy to.I read a review here that an engineer wrote in appreciation for the author's ability to explain how they manufactured survival tools and invented new ways to survive. That is true. There is a lot of technical explanation and nautical knowledge here that seafaring people will really be able to enjoy. Engineers will love the, well... the ingenuity. Survivalists, long distance families who know what it's like to be so far from a loved one, those partial to bromances. There's something for everyone in this book.Just buy it, read it. Having read an account like this will undoubtedly make your life seem just a little bit better, just knowing that you read the best portrayal of this historical event possible. The only portrayal that can put the reader right there in the thick of it.This being said, I am glad I read this Joan Druett book first! Why? Because I'm also now reading one of her other books, in the wake of Madness. I can tell you for a fact that if I had read the ladder book first oh, I would have never considered by another one of her books. I don't know what the difference was between the time she wrote in the wake of Madness and the time she wrote island of the Lost, but whatever was going on with her when she wrote island of the Lost she needs to continue cloning that same energy.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ABH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 11, 2023",
                "reviewTitle": "Fascinante",
                "reviewText": "História verídica imperdível! Incrível como foi a boa liderança que causou a sobrevivência deles!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ali",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 1, 2021",
                "reviewTitle": "Survival sub-antarctic style",
                "reviewText": "I didn't buy this book expecting to learn anything more than about shipwrecks and survival, but there are so many other intriguing pieces to it, like the sub-antarctic sealing industry, that there is no question that I will be expanding my reading to learn more about this time period.The book's synopsis is a bit misleading; yes, there were two shipwrecks on the island that overlapped much of the same time period, but the focus is on the wreck of the Grafton and its small crew. There are also very serious environmental and seasonal factors (timing) that contributed to the shipwrecks survivors; differences in leadership played a part of how well each group succeeded, but was not the only defining factor in my opinion. As well, and something that the pulled the book together for me, each wreck had at least one individual who had a level of resourcefulness that contributed greatly to each groups survival. The forge building or the coracle building as examples!The author's ability to meld two separate incidents and her writing style that is highly engaging and to the point, made for a relatively quick read and I look forward to reading more of her work on naval history.Highly recommend this book if this topic or region of the world is of interest. However, would caution that there is a great deal of emphasis on killing seals, especially pups, as a main food source and this may be a big turn off to some readers. As the author notes in the afterword, one group of survivors were mentally prepared to kill seals. This was the one area of the book that I was not mentally prepared for myself!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diverstu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 2, 2021",
                "reviewTitle": "What a comparison of skill, leadership and attitude!",
                "reviewText": "This would make a riveting film or tv series….the difference between two independently shipwrecked crews’ eventual outcomes is worthy of a great deal of investigation- neither ‘thrive’ exactly, but one building a forge and ship for self-rescue while the other sat in a hole in the ground is surely indicative of something! A fascinating read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nagendra Nyamgondalu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 7, 2020",
                "reviewTitle": "You will love it if you are a historical adventure buff",
                "reviewText": "Became a big fan of Joan Druett with this book! The smooth narration, the incredible attention to details and the events of 1800s themselves blend to form a fantastic read. The characters portrayal, especially that of Captain Musgrave and Fracois Raynard is compelling - you feel so much for both these men towards the end of the book.All in all, an inspiring story of survival and grit. Highly recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 3, 2023",
                "reviewTitle": "Incredulous at the stories",
                "reviewText": "Wow. And that’s all I have. The ingenuity in the face of desperation after respective shipwrecks leaves this 21st century woman in absolute awe of the resourcefulness of the stranded. In addition, the mental fortitude, given that with the basic communication available, it could be years before you saw your family again. The thing that struck me, as with the other recent shipwreck book I’ve reviewed, is the maintaining of the societal structure that was so entrenched - even with men in rags, at the point of starvation, an attempt was made to differentiate the officers from the ordinary men. Amazing. And despite living in NZ for a large part of my life, have never heard of these stories. Highly recommend this book, drawn in part from the journals of the stranded men, and later on, the press articles, the books produced by the survivors, and stories from those sailors who went after them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}