{
    "remaining_requests": 1938,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Adventures-Sawyer-Dover-Thrift-Editions/dp/0486400778",
    "body": {
        "name": "The Adventures of Tom Sawyer (Dover Thrift Editions: Classic Novels)",
        "price": "$4.79",
        "originalPrice": "",
        "rawPrice": 4.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Adventures-Sawyer-Dover-Thrift-Editions/dp/0486400778",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/819Z9rCY2FL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mark Twain",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Mark+Twain&text=Mark+Twain&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1300,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This childhood classic relates a small-town boy's pranks and escapades with timeless humor and wisdom. With its hilarious accounts of boyish pranks and its shrewd assessments of human nature, The Adventures of Tom Sawyer has captivated generations of readers of all ages. In addition to his everyday stunts (searching for buried treasure, trying to impress the adored Becky Thatcher), Tom experiences a dramatic turn of events when he witnesses a murder, runs away, and returns to attend his own funeral and testify in court.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Dover Publications; Revised ed. edition (January 27, 1998)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 192 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0486400778"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0486400778"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 920L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.25 x 0.5 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,590 in Books (See Top 100 in Books) #262 in Children's Classics #378 in Coming of Age Fiction (Books) #412 in Classic Literature & Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,300 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Twain created enduring works that have enlightened and amused readers of all ages for generations. Samuel Clemens (1835-1910) left his small town to seek work as a riverboat pilot. As Mark Twain, the Missouri native found his place in the world. This childhood classic relates a small-town boy's pranks and escapades with timeless humor and wisdom. With its hilarious accounts of boyish pranks and its shrewd assessments of human nature, The Adventures of Tom Sawyer has captivated generations of readers of all ages. In addition to his everyday stunts (searching for buried treasure, trying to impress the adored Becky Thatcher), Tom experiences a dramatic turn of events when he witnesses a murder, runs away, and returns to attend his own funeral and testify in court.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34821abe-a9f3-4998-90b1-4da3a56d1bc8.__CR132,0,1537,2049_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/064f4e97-9091-4367-ac90-eccd2cda1003.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34821abe-a9f3-4998-90b1-4da3a56d1bc8.__CR132,0,1537,2049_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/064f4e97-9091-4367-ac90-eccd2cda1003.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2bcbb6ad-d4a5-4708-87c1-95c823f0e29e.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "The Wingchair Critic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXB3DQDBR4B62AGNUE5UBLJ26IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1II3EDW0D9W5Y?ASIN=0486400778",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 23, 2003",
                "reviewTitle": "5.0 out of 5 stars \"They Came To Jeer, But Remained To Whitewash\"",
                "reviewText": "127 years after its initial publication, Mark Twain's 'The Adventures Of Tom Sawyer' (1876) remains the definitive account of American boyhood. Bright, sassy, dauntless, charming, and shrewd, Tom embodies the archetype of every healthy, mischievous, and extroverted American boy.The book's plot, probably better known to most readers today via cinematic versions of the story, is uncomplicated. Tom tricks and antagonizes his beloved, easily outraged Aunt Polly, develops a frustrating crush on young schoolmate Becky Thatcher, tricks his pals into doing his chores, reinvents himself as a pirate on the Mississippi, and, with Huckleberry Finn, runs afoul of Injun Joe when they unexpectedly witness a murder in a graveyard at midnight.Like every good story with a traditional structure, the narrative offers a series of contrasts, here between the comfortable, familiar, sunlit world of St. Petersburg and the events that occur when curious Tom strips back daylight's veil and peers into the community's secret life.Interestingly, with 'The Adventures Of Tom Sawyer,' the clever Twain was writing about present day (1880s) America, but simultaneously already portraying that era in nostalgic, sentimental terms.Thus, today's readers may find in a double nostalgia in the novel: the first, their own, focused on a longing for America's mythological \"simpler times,\" and the second a reflection of the homey, intimate, bumpkin-, eccentric- , and \"character\"-ridden American small town that Twain provided for the readers of his own era.By writing so powerfully about boyhood, Twain offers readers of all eras yet another powerful provocation towards nostalgia: that for one's own lost childhood, youthful initiations, and passages from innocence into adulthood.The novel contains seductive, lulling passages of great poetic beauty, such as the following: \"He entered a dense wood, picked his pathless way to the centre of it, and sat down on a mossy spot under a spreading oak. There was not even a zephyr stirring; the dead noonday heat had even stilled the songs of the birds; nature lay in a trance that was broken by no sound but the occasional far-off hammering of a woodpecker, and this seemed to render the pervading silence and sense of loneliness the more profound. The boy's soul was steeped in melancholy; his feelings were in happy accord with his surroundings. He sat long with his elbows on his knees and his chin in his hands, meditating. It seemed to him that life was but a trouble at best, and he more than half envied Jimmy Hodges, so lately released. It must be peaceful, he thought, to lie and slumber and dream for ever and ever, with the wind whispering through the trees and caressing the grass and the flowers of the grave, and nothing to bother and grieve about, ever any more.\"However, most of the book is written in a tone of buoyant theatrical artificiality: in episode after episode, Twain carefully sets his audience up for the punch lines to follow, and does so in a fashion that unabashedly reveals his own calculation as well as his intention that the reader be able to predict exactly what is to come. Even the narrative's tragedy-leaning moments are eventually punctured by corny, charming, tongue-in-cheek humor which seems to suggest that life, when well balanced, is primarily a pleasant affair of straw hats, freckled skin, rolled-up dungarees, molasses candy, indolent summer days, fishing tackle, white picket fences, and lovely chintz wallpaper.A defining moment in American literature, 'The Adventures Of Tom Sawyer' is an evocative, light, and fanciful book littered with shrewd social commentary and fragments of wisdom and insight composed by an American master at the height of his powers.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Auntie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIENYWQ7FWG2EH3U2M6FZS3IWMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZSO31O7WXV6R?ASIN=0486400778",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Just as stated",
                "reviewText": "Fast delivery. I watched a program that said this book was one of the most influental in America, so I wanted to reread it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "fern123fern123",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHFGKR5G774S6SDFLUYREENM4ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1I5FJY4B862CD?ASIN=0486400778",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 15, 2020",
                "reviewTitle": "5.0 out of 5 stars 100% recommended",
                "reviewText": "I personally have really enjoyed The Adventures of Tom Sawyer by Mark Twain. The book is a classic, and enjoyable for readers of all ages. Mr. Twain makes that very clear in his preface (included at the beginning of this copy) along with some background information under the “Note” column before the preface. This book has a variety of genres such as: picaresque, somewhat of a Bildungsroman, comedy, satire, and lastly a folk narrative. It is considered a picaresque and/or Bildungsroman because of Tom’s actions and growth throughout the book. It is comical because of the way that Mark Twain describes Tom’s mischievous and rebellious nature. It includes satire when Tom gets a crush on the new girl. Finally, it is a folk narrative because of the American traditions demonstrated in the way that Tom and all others live. Like their manners, way of speaking, and cultural traditions like going to church on Sundays etc. This copy of the book that I have bought for myself was at a hard to beat price. The text is a bit close together, but on the plus side, the chapters are shorter and so is the book. So it’s not bad for saving paper if you don’t need a fancy copy. I would recommend this copy for personal use, because at that price point you really shouldn’t feel bad for taking notes on it, if you want to. I personally have annotated this book just to analyze the text and gain better understanding. Also this book, not just this copy but The Adventures of Tom Sawyer is written in some dense English. By this I mean that there are some phrases or words that you might need to search on the internet just because they aren’t used nowadays. This book was first ever published in 1876 so that does explain why the Language is dense. Also, many classic books, since they are classics are written in dense language. I would definitely recommend this book because it truly is an adventure haha. This copy that I have purchased (Dover Thrift Editions) was published in 1998. It has 184 pages including the conclusion.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71+deGZa92L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/718WvbUHM7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71BSjYhca7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matheus Silva de Sá BrittoMatheus Silva de Sá Britto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 11, 2022",
                "reviewTitle": "Muito bom!",
                "reviewText": "Apesar de saber que a qualidade do material da capa e folhas não seria boa, eu o comprei mesmo assim. Se você procura um livro bom e barato, essa edição cumpre essa expectativa. Porém, se deseja algo com mais qualidade, invista em uma versão mais cara com papel de melhor qualidade.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61eW0QSfOPL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr CC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 17, 2023",
                "reviewTitle": "Great read",
                "reviewText": "Great read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandre Hanssement",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 13, 2019",
                "reviewTitle": "All stars",
                "reviewText": "Quick and the right size book for travelling",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ainur Akhmetova",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on May 19, 2020",
                "reviewTitle": "Cheap",
                "reviewText": "Cheap newspaper paper. Grey and thin",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria Lucia Cardoso Rocha Barros",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 10, 2020",
                "reviewTitle": "Otimo produto. Adorei !!!!",
                "reviewText": "Otimo produto. Entrega pontual.Adorei ! Parabéns!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}