{
    "remaining_requests": 1725,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Treasure-Lost-Wright-Cousin-Adventures/dp/B086Y24441",
    "body": {
        "name": "The Treasure of the Lost Mine (Wright Cousin Adventures)",
        "price": "$8.99$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Treasure-Lost-Wright-Cousin-Adventures/dp/B086Y24441",
        "soldBy": {
            "sellerID": "A2HQNOTMFBGUMP",
            "name": "Goodwill Minnesota",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2HQNOTMFBGUMP"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51zNaGxFrSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51IaeFhCdfL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gregory O. Smith",
            "link": "https://www.amazon.com/Gregory-O-Smith/e/B086XH7MS3/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Goodwill Minnesota",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 186,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"This is my NEW FAVORITE SERIES!\" -- Anne R.\"Outstanding Kid Series! I normally don't review books on here [Amazon] unless highly impressed! So many children's books today are such a poor excuse for literature - poor plots, undeveloped characters, even poor spelling and use of English. What a delight to find a highly qualified author, Greg Smith and to finally find a series that are uplifting, well written and adventurous!\" (Amazon 5-star review by Buzzyflight, Nov. 10, 2020)\"Kids favorite book--I sent my niece and nephew several books for summer reading. This has been the favorite of both kids...Appropriate for all kids, just good fun...Highly recommend.\"-Consultx\"My kids have read the whole series and asking for more!--My kids are very much into action and adventure books. We have read the entire series together during family reading time. They have loved all of them and now cannot wait for the author to write more. These books are full of tasty little tidbits of true information including some historical references and accurate STEM information applied to situations in the book. I loved these for my kids.\"-Clint G\"Mystery and Fun--Purchased for my grandson--I found it to be quite a thrilling read--perfect for an almost 11 year old. Full of fun and adventure.\"-H. W. Longfellow\"Great new series (to us)--Bought for a 7 year old bookworm granddaughter who loves adventure stories and read it in almost one session!\"-Reviewer in Canada\"Worthwhile books--Wonderfully written story, my son has devoured all 12 of the books in the series.\"-Susan\"A Great Adventure Story--My boy loves it. It's a story about airplane, train, tank, skeleton...what else can you ask?\"-Olivia Y.\"Couldn't put the book down!--I purchased this book for my eight year old granddaughter. She enjoyed it so much she asked me to purchase the next book in the series, Desert Jeepers!\"-KJD From the Author When Greg Smith was writing The Treasure of the Lost Mine, he was digging in their gold mine and building a narrow gauge railroad to haul out the rock. He and his family and were also building a log fort, Fort Daniel Boone, named after one of their American frontier ancestors. A lot of their family history was woven into this book.Gregory O. Smith is the author of the 15 book, award-winning Wright Cousin Adventures series, the time travel adventure The Hat, George Washington, and Me!, the award-winning friendship and wilderness survival adventure Strength of the Mountains, and the exciting, page turning military adventure, Rheebakken 2--Last Stand for Freedom."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 25 mins",
            "$3.99 delivery February 29 - March 1.",
            "Or fastest delivery February 23 - 28.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 15 hrs 25 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"This is my NEW FAVORITE SERIES!\" “My kids give it a quadruple thumbs up!” The award-winning Wright Cousin Adventures series starts here!The Wright Cousin Adventures series is the perfect mix of mystery, excitement, and humor. When the five Wright cousins answer a plea for help from their grandparents, they are quickly thrown into an adventure that will test their courage and ingenuity. With evil forces threatening their beloved grandparents, the cousins must work together to uncover the mystery of the long lost family gold mine, while also protecting their family's legacy.Full of thrilling action, unexpected plot twists, and strong family values, the Wright Cousin Adventures series is the perfect choice for readers who enjoy classic mystery stories such as The Hardy Boys, Indiana Jones, or Nancy Drew. Get into the Wright Cousin Adventures today!“We love these books!”“Awesome read! Our children- ages 15,13 and 8 love hearing books by this author. These books are hard to put down and have been great for our family! I recommended our local library purchase the books by him.”“[The Treasure of the Lost Mine] is a well-written adventure story which the children in my class enjoyed very much. I read it to them over two weeks and they enjoyed all the thrills and spills…reminded me of a classic adventure book from Enid Blyton...Good fun.”For continuous reading pleasure and by popular request, books 1-3 of the Wright Cousin Adventures series are also available bound together in one book, the Wright Cousin Adventures Trilogy 1: Adventures in the West.Gregory O. Smith is the award-winning writer of mystery action adventure books for 9-14 year olds, teen & young adult mysteries and thrillers, teenage adventure books for girls, teen books for boys, books for boys 9-12, middle grade book sets, children's books age 9-11. The Wright Cousin Adventures are best enjoyed when read in order.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B086Y24441"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Independently published (April 9, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 139 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8629293736"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.35 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#78,380 in Books (See Top 100 in Books) #177 in Children's Books on Boys' & Men's Issues #614 in Children's Mystery, Detective, & Spy #2,935 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 186 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "\"Outstanding Kids Series!\" The Adventure starts here--get the complete Wright Cousin Adventures series by Gregory O. Smith today!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/7f934abd-c0f5-43a9-bb11-da195895fc39.__CR0,0,2317,1433_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "\"Whatever it is, it's been locked in there for over a hundred years!\" Meet the five Wright cousins in their first big mystery together. I mean, what could be more fun than a treasure hunt with five crazy, daring, ingenious, funny and determined teenagers, right? \"The Wright cousins saw a crack in the mountainside expand, revealing a dark, shadowy passage!\" The five Wright cousins are having a blast 4-wheeling in the desert as they look for a long-lost Spanish treasure ship. And who wouldn't , there's so much to see--Palm trees, hidden treasure, UFO’s, vanishing stagecoaches, incredible hot sauce, missing pilots. Wait! What?! “Lindy desperately clawed at the rocks around her, trying to stop from being dragged downward into the abyss!” A mysterious map holds the key to the location of an ancient treasure city. When the Wright cousins set out on horseback to follow the clues, they run headlong into desert flash floods, treacherous passages, and formidable foes. Will the Wright cousins find what they are looking for? Trilogy 1. \"This is my NEW FAVORITE SERIES!\" \"So great to have books 1, 2, and 3 now in a single volume. Makes it so easy to read them in order!\" \"Awesome read! Our children—ages 15,13 & 8—love hearing books by this author. These books are hard to put down and have been great for our family!” The award-winning Wright Cousin Adventures series starts here! Trilogy 1: Filled with thrilling action, unexpected plot twists, humor, and strong family values, the Wright Cousin Adventures series is an excellent way to get children into reading.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/77f575f3-d36a-4fb4-b458-d64043c2a5ef.__CR0,546,1853,1853_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/0dc66fcc-28d2-4669-aa32-87bffb37d7b3.__CR0,560,1858,1858_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/90bd09ba-7874-400f-a0c8-bc7ccb09f741.__CR0,546,1834,1834_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/b3ea8525-c740-47f6-97e3-9812de44ccb4.__CR0,587,1874,1874_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Get out and Explore the Great Outdoors with the Wright cousins! \"Tim gulped, not sure whether he wanted to stay there or not. It looked like a dungeon.” The Wright cousins are helping to restore a large stone fort from the American Revolution. They expect hard work but find more—a new girl with a fondness for swordplay, secret passages, perilous waterfalls, and pirates. Can the Wright cousins solve this puzzling mystery before it's too late? The Spy World Will Never Be the Same! The cousins are up to their ears in secret agent humor and adventure. Just who are those top two secret agents they keep hearing about? Where is Katrina? And who is Toronto? It’s action, danger, and page-turning action as the Wright cousins take on their biggest threat yet! The Wright cousins have a Submarine and they know how to use it! The deeper the Wright cousins go in Lake Pinecone, the more mysterious it becomes. Something is wrecking boats on the lake and it’s downright scary. Is it a sea monster? Can they uncover the dangerous secret before it’s too late? “The characters in these books are great role models!\" Books 4, 5, and 6 in a single volume! \"I loved these for my kids!\" Trilogy 2--The Wright cousins go east to help restore an old fortress and Jonathan gets the surprise of his life, Robert and Tim accidentally become America's top spies, and a thrilling submarine adventure!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/07ab78e7-5fd6-4800-be4b-1703b9171323.__CR0,535,1858,1858_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/3ba18fd9-af08-48e3-92ca-df9f271c2272.__CR0,548,1830,1830_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/178d9a92-0b96-412e-ac58-b716b5338420.__CR0,552,1858,1858_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/b685243b-7c2b-49c0-900f-f72e0e9dc9d4.__CR0,572,1888,1888_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "\"Action, Humor, Mystery at its Best!\" -- The Wright Cousin Adventures -- \"This is my NEW FAVORITE SERIES!\" -- Anne R. “J-One, come in J-One,” radioed Robert. When a forest fire erupts in the mountains entrapping their friends, the Wright cousins drop everything to focus on saving them. How can their newly acquired historic airplane possibly help? Hang on tight during this blazing, page-turning action adventure! “Jonathan, get us out of here!” Secret bases, missing airplanes, and an unsolved World War 2 mystery are keeping the Wright cousins busy. But when the cousins are attacked by something in Lake Pinecone, it's a matter of life or death. Will the Wright cousins survive? Can they stop the threat? “We’re not set up for deep space,” said Robert. “We’re in big trouble.” 3-2-1-Blastoff! The Wright cousins are out of this world and so is the fun. Join the cousins as they travel into space aboard the new Stellar Spaceplane. Enjoy zero gravity and the incredible views. But what about the space aliens Tim keeps seeing? The Wrights soon discover there really is something out there, and it’s downright scary. “These books are full of tasty little tidbits of true information including some historical references and accurate STEM information. I love these for my kids.” Trilogy 3--Forest fires, missing planes, trapped friends, and space aliens? How are the Wrights going to solve these mysteries? Books 7-9 in a single volume.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/ce6d75e8-5e1a-4d5e-99e7-78a5d9b25486.__CR0,552,1858,1858_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/f64ade57-d190-47c5-bc47-7e754732d24b.__CR0,567,1862,1862_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/0e29b741-bb0e-4dcf-8354-2d14e8112be5.__CR0,564,1850,1850_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/4050794b-78c1-42eb-a85f-99b08c9b96d7.__CR0,571,1870,1870_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "\"Kids Favorite Book!\" -- \"Fun, Engaging, Highly Recommend!!\" -- \"My Kids have Read the Whole Series and Asking For More!\" Get ready for INCREDIBLE! Enjoy the Wright Cousin Adventures today!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/b2959851-b3ac-42c8-9566-f2a816e5e63b.__CR0,17,4161,2574_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/7f934abd-c0f5-43a9-bb11-da195895fc39.__CR0,0,2317,1433_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/77f575f3-d36a-4fb4-b458-d64043c2a5ef.__CR0,546,1853,1853_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/0dc66fcc-28d2-4669-aa32-87bffb37d7b3.__CR0,560,1858,1858_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/90bd09ba-7874-400f-a0c8-bc7ccb09f741.__CR0,546,1834,1834_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/b3ea8525-c740-47f6-97e3-9812de44ccb4.__CR0,587,1874,1874_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/07ab78e7-5fd6-4800-be4b-1703b9171323.__CR0,535,1858,1858_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/3ba18fd9-af08-48e3-92ca-df9f271c2272.__CR0,548,1830,1830_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/178d9a92-0b96-412e-ac58-b716b5338420.__CR0,552,1858,1858_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/b685243b-7c2b-49c0-900f-f72e0e9dc9d4.__CR0,572,1888,1888_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/ce6d75e8-5e1a-4d5e-99e7-78a5d9b25486.__CR0,552,1858,1858_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f64ade57-d190-47c5-bc47-7e754732d24b.__CR0,567,1862,1862_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/0e29b741-bb0e-4dcf-8354-2d14e8112be5.__CR0,564,1850,1850_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/4050794b-78c1-42eb-a85f-99b08c9b96d7.__CR0,571,1870,1870_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/b2959851-b3ac-42c8-9566-f2a816e5e63b.__CR0,17,4161,2574_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Seth PoulsonSeth Poulson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP63NS2FMLDK4V4T34JOHKIOGDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A53YQJQ29P0Y?ASIN=B086Y24441",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 12, 2021",
                "reviewTitle": "5.0 out of 5 stars Fun, engaging and highly recommend!!!",
                "reviewText": "My 8 or old daughter has not been interested in reading until... this book. I started by reading it aloud to her. By the third chapter she wanted to read by herself. She took the book everywhere she went and finished in a week. This is what I found on my pillow today:)! She’s quickly going through the 2nd book. And now picks up other books to read with excitement! Awesome, fun and engaging series! Highly recommend!!!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/A1F2K3CZK7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Consultx",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH32EF5JOHRKXOE2S774LUUBXFUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DSIDJFPWBKOF?ASIN=B086Y24441",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2021",
                "reviewTitle": "5.0 out of 5 stars Kids favorite book",
                "reviewText": "I sent my niece and nephew several books for summer reading. This has been the favorite of both kids. The little intro video on the authors web site set the stage and they loved it. Appropriate for all kids, just good fun. One child is a slightly slower reader but the story was compelling and kept them engaged.Highly recommend.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. W. Longfellow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFONWSYDNWFRP2TOLXSMVSHWJ2YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17FAJG1M1G41P?ASIN=B086Y24441",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 6, 2021",
                "reviewTitle": "5.0 out of 5 stars Mystery and Fun",
                "reviewText": "Purchased for my grandson - I found it to be quite a thrilling read - perfect for an almost 11 year old. Full of fun and adventure.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Riverdancer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNPLHSXTMSDKELBA22KMPNC3OGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R180Z19ZYQKEZJ?ASIN=B086Y24441",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2022",
                "reviewTitle": "4.0 out of 5 stars A wholesome family adventure",
                "reviewText": "The five Wright cousins are spending the summer on Grandpa Wright’s farm in an effort to provide the work that is necessary to keep the farm afloat. While there, the teens are determined to locate Great-Great Grandpa Jack’s lost gold mine. Between strange occurrences happening nearby, dastardly villains wheedling their way onto Grandpa Wright’s land, and the work that needs to be done on the property, there is no shortage of excitement for the Wright cousins to experience. And when they explore a mysterious clue left behind by Great-Great Grandpa Jack, they discover more than they expected hidden in the nearby landscape. This first in the Wright Cousin Adventures series introduces readers to the close-knit Wright clan and the family farm they love so dearly. Inspired by a real life discovery made by the author and his own family, this novel brings early young adult readers into the Wild West as the Wright cousins discover more about the hidden gold mine with each passing chapter. Occasional illustrations help orient readers to the space in which the Wright cousins find themselves, and the pacing of the book overall makes the narrative highly accessible to young people. Reminiscent of the Boxcar Children series, this wholesome story involves close family relationships, ample dialogue and action, and the danger and humor that naturally enhance tales for young people. Fans of adventure stories filled with heart will fly through this first book and eagerly reach for the next installment.I received a copy of this book from the author and I chose to leave this review.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Victor Welliver",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDNDHMUAUXJAWW5HX2EXYGJHH4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N4RU61DQIUF8?ASIN=B086Y24441",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2020",
                "reviewTitle": "5.0 out of 5 stars good stories",
                "reviewText": "I have a kid who can't read enough and a kid who can't find anything she likes to read. They both loved this book. My girls are 10. I wish I could've bought this books series in a box set.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "aaron cross",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5TQTVNTEMV7PCUM5OHXVQPZ55A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MHTVRS6AN8OA?ASIN=B086Y24441",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2021",
                "reviewTitle": "5.0 out of 5 stars Wonderful",
                "reviewText": "Wonderful product for a great price!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KJD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJ7N37KALO2ZDKPO4AQPLSAUFDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WS0DWZ72EIDR?ASIN=B086Y24441",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2020",
                "reviewTitle": "5.0 out of 5 stars Couldn't put the book down!",
                "reviewText": "I purchased this book for my eight year old granddaughter. She enjoyed it so much she asked me to purchase the next book in the series, Desert Jeepers!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia Hatch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCEHNN7LHCFWYSWROAUBSN6AVOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27ZQJ1TZ9RSRS?ASIN=B086Y24441",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2021",
                "reviewTitle": "5.0 out of 5 stars Good Childs book",
                "reviewText": "Easy reading",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 4, 2022",
                "reviewTitle": "Unable to rate the book because I bought this as a gift.",
                "reviewText": "Unable to rate the book because I bought this as a gift.This said, the book is as pictured and described.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 19, 2021",
                "reviewTitle": "Great new series (to us)",
                "reviewText": "Bought for 7 year old bookworm granddaughter who loves adventure stories and read it in almost one session!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.99",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$14.99",
                "sellerName": "HBBC STORE",
                "sellerRating": "4.5"
            }
        ]
    }
}