{
    "remaining_requests": 1768,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Napoleons-Pyramids-Ethan-Adventure-Adventures-ebook/dp/B000S1L910",
    "body": {
        "name": "Napoleon's Pyramids: A Novel (Ethan Gage Adventures Book 1)",
        "price": "$3.99",
        "originalPrice": "",
        "rawPrice": 3.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Napoleons-Pyramids-Ethan-Adventure-Adventures-ebook/dp/B000S1L910",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81sPImceWtL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "William Dietrich",
            "link": "https://www.amazon.com/William-Dietrich/e/B000APFP4Q/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 639,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B000S1L910"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ HarperCollins e-books; Illustrated edition (March 17, 2009)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 17, 2009"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1391 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#59,090 in Kindle Store (See Top 100 in Kindle Store) #386 in U.S. Historical Fiction #444 in Mystery Action Fiction (Kindle Store) #608 in Historical Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 639 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "maclaugh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCG6W5VQLH3I7Q7JUAI3JFLWMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QI41OMM2XH8G?ASIN=B000S1L910",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars the first book a grand series",
                "reviewText": "I began this series some years ago with the second book. Now was the time to began and I was enthusiastic.A great series Ethan Gage Adventures, and to fill in the full back story was learning more about old friends….",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Victor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELENZJE5ZU2YEDMIO7GYNG5QQXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5ZX3KR0FVEUL?ASIN=B000S1L910",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2008",
                "reviewTitle": "4.0 out of 5 stars a mixture of Indian Jones and Flashman",
                "reviewText": "This book is about Ethan Gage, an American assistant to Benjamin Franklin, a bit adventurer and commodity trader, who is rather unsuccessful in his business endeavors, but happens to win in cards an Egyptian medallion, old and interesting enough, to bring him problems and path of destruction, leading him and all important characters of the book to fabled Egypt. The book is quite fascinating, mixing a bit energy of Indiana Jones movies with farcical adventures of `Flashman' by George MacDonal Fraser. Ethan Gage who exhibits some hero type qualities is also sometimes simpleminded and just simply silly. He follows the secrets of the ancient artifact with help of beautiful Astiza, priestess of Isis, and his Egyptian companions. The mystery is also sought by ghastly count Silano, who lost all his properties to the French revolution, but creates illusion of friendship with no other than Napoleon Bonaparte who also believes in ancient mystery bringing more power to his invasion of Egypt and start of Alexander the Great - like campaign. The book is also exciting because it tries to feed some stirring if not bizarre explanations about the creation of Pyramids. The story continues in \"the Rosetta Stone\" and I hope the author will entertain us with more outrageous Ethan Gage's adventures in books to come.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jersey Exile",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWRMG7PR6GRIQNU6W2BYBKVRMAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27GZZZ776V0Q1?ASIN=B000S1L910",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 4, 2012",
                "reviewTitle": "3.0 out of 5 stars Ethan Gage and the Pyramids of Doom",
                "reviewText": "I've got to admit that while reading \"Napoleon's Pyramids,\" I enjoyed the adventure. It wasn't until I had a chance to think about the book that I realized it was a mess, a pastiche of ethnic stereotypes, Indiana Jones scenes (right down to step-on-the-right-blocks-or-calamity-will-follow), a muddle of mathematics and Egyptology, and even - wait for it - a call to search for the Ark of the Covenant. OK, the book reads along at a fast clip, with sex, murder, spies, gypsies, sinister Masons, noble Masons, Napoleon, Nelson, sea battles, artillery battles, Mameluke charges, French lines and squares, boat chases up the Nile, a sultry Egyptian priestess, noble Arabs, sinister Arabs, noble Frenchmen, sinister Frenchmen, hot-air balloons, hidden tunnels within the Great Pyramid, treasure, curses, etc. And, of course, an American hero. Dietrich keeps it going. And, he writes beautiful descriptions of geography and geology. So, while it's an enjoyable read, on reflection it's a guilty pleasure. Save this one for the beach, where you can identify with the desert for a while.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wayne C. Rogers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXNMTNZ4BONDGTIKJZK2B4MKLUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KZS8JGE4SH7D?ASIN=B000S1L910",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2008",
                "reviewTitle": "5.0 out of 5 stars A fun novel in the grand tradition of H. Rider Haggard and Edgar Rice Burroughs!",
                "reviewText": "It was actually William Dietrich's newest historical novel, The Rosetta Key, which caught my attention and caused me to buy the prequel, Napoleon's Pyramids. I love the Indiana Jones movies and the old serials from the forties and fifties, so a story that deals with an adventurer in search for the Egyptian Book of Thoth and the Ark of the Covenant in Israel during Napoleon's invasion of 1799 was right up my ally, but first I needed to read Napoleon's Pyramids. I picked up a copy of it and found myself quickly immersed in an adventure that was written in the style of H. Rider Haggard and Edgar Rice Burroughs. What flaws the novel may have had didn't concern me as long as my interest was held, and it was straight to the last page.Napoleon's Pyramids opens up with Ethan Gage living in Paris in 1798 after the death of his mentor, Benjamin Franklin, and the aftermath of the French Revolution. He wins an old, strange-looking Egyptian medallion in a card game and soon discovers that it's cursed. In less than twenty-four hours, he's beaten and his room is trashed, he's accused of murdering a prostitute, he finds himself hiding in a horse drawn carriage on its way to the French coast where Napoleon's army is being boarded onto ships for the planned invasion of Egypt, and the villains are still hot on his trail. The person who truly desires the medallion is the evil Count Silano, and he has a following of thugs who are led by a cold-hearted killer who worships and handles poisonous snakes. Managing to squeeze his way into Napoleon's good graces, Gage soon finds himself in the land of the ancient pyramids fighting in hand-to-hand combat with the invading French army. It isn't long before he's acquired a fierce Arab warrior as his slave and a beautiful, alluring priestess, who knows more about the secrets of the medallion than she lets on. Through one peril after another, Gage is eventually led to the Great Pyramid of Giza and finds his way inside to the hidden tomb of the Pharaoh and the ancient mysteries of Egyptian magic and the medallion and perhaps a power strong enough to enable a human being to rule the world.Because of the book's sequel, we know going in that Gage survives the countless dangers of Napoleon's Pyramids. This, however, didn't hinder my enjoyment of the story. While filled with tons of interesting historical information and anecdotes, what makes this novel so good is the character of Ethan Gage and his rogue-type personality. You have our hero, plus the evil villains who are bigger than life, the beautiful female that the hero falls in love with, but doesn't know if he can really trust her, the constant dangers that arise and which he barely survives, and the array of actual historical figures that color this vast canvas. I found Dietrich's writing to be excellent and his story-telling reminiscent of past times, bringing back the pleasures of reading such wonderful stories from my earlier years. This tale of action and intrigue also gives you a stark look at what Napoleon's campaign in Egypt was like and the hardships that were faced by his troops and commanding officers. The desert definitely took its toll on all involved.Napoleon's Pyramids is a novel for those of you who enjoy the magic of adventures to far-distant lands with dangers lurking around every corner and a hero who's flawed, but manages to come out ahead at every turn of the dice. An excellent summer read!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zkribbler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3NZRJURTT3QANAA5NTS5DX6RIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZX1AYEAJKDHV?ASIN=B000S1L910",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 16, 2010",
                "reviewTitle": "4.0 out of 5 stars Not enough swash; too many buckles",
                "reviewText": "The publisher and many of the reviewers here compare Ethan Gage to Indiana Jones. That may be true of the first four chapters and of the last two, but the great majority of the book is a sluggish hodge podge of disparate motifs, such as mathematical puzzles, early Napoleonic battles, Egyptian mythology, and Free Masonry. Each passage may be well written, but their combination makes finishing this book is a chore, and the reader is left with a feeling similar to finishing Thanksgiving dinner. Everything was delicious, but it would have been so much better if the portions would had been halved. This is a good 400-page book, but at 200 pages, it would have been great.In revolutionary Paris, American adventurer Ethan Gage wins a medallion in a game of cards. It turns out to be cursed, and soon he is attacked, framed with murder, pursued across France, waylaid, and thrown in with an infamous British spy and a band of gypsies before he joins young Napoleon's invasion of Egypt. Once Cairo falls to the French, it becomes Gage's task to figure out his medallion's connection to the mysterious Great Pyramid of Giza. Is there some secret hidden deep inside that Napoleon can use as an irresistible weapon? What did the ancient Egyptians know that we don't? Are some secrets better left hidden and forgotten in the sands of time?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeremy F. J. Simpson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 10, 2015",
                "reviewTitle": "A great read for history buffs",
                "reviewText": "A delightful and informative novel that had me checking reference books to confirm that there were real events that formed the basis of this story. A bounder of a hero for whom one has a sneaking admiration and a wonderful female companion!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Khyrstyne",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 2, 2015",
                "reviewTitle": "Great Book!",
                "reviewText": "I loved the book, they get a lot of facts very accurate which was great. The book was a little damaged when I received it and that was a little disappointing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Green",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 10, 2011",
                "reviewTitle": "An Enjoyable Historical Romp",
                "reviewText": "Back when it was first published I'd dismissed Napoleon's Pyramids as yet another 'hunt the lost artefact' adventure riding Dan Brown's coat tails and as a consequence avoided it. It turns out that initial judgement was completely unfair (although in my defense it was marketed as being a Brown-esque adventure); Napoleon's Pyramids has absolutely nothing in common with The Da Vinci Code, Angels & Demons or any other Brown potboiler.For a start this is an outright period adventure. There's no contemporary plot or mere flashbacks to the past; from page 1 to the end the entire story is set in the 18th Century around Napoleon's invasion of Egypt, and it does a grand job of bringing both the period and the invasion to life. William Dietrich, a journalist, is both a gifted writer and a solid researcher. Napoleon's Pyramids is full of wonderful descriptive passages that evoke both Revolutionary France and pre-Colonial Egypt brilliantly, and solid factual detail regarding Napoleon's military escapades and the real-life characters caught up in them.Around the evocative prose and various true events Dietrich then manages to weave a highly entertaining adventure story that both holds the reader's attention and keeps piling on the twists and surprises right up to the very end. In Ethan Gage he has created an affable, relatable hero; flawed but competent, tough but not super-human. The author also wisely avoids burdening Gage with unnecessary emotional baggage. This is a romp, and as such doesn't demand a tortured hero. Gage might be prone to self-doubt and have something of the rogue about him, but that's as far as any 'edge' goes. On the whole he remains a jocular, upbeat figure.Many of the other characters are real life individuals, and they are generally well portrayed. The same could be said, but with some reservations, to go for the fictional supporting characters Dietrich inserts into the story. Dietrich certainly provides most of them with enough depth to satisfy the needs of the story.The mystery that Gage gets caught up in is a pretty standard 'hunt the lost treasure using clues on ancient artefacts' affair, but Dietrich avoids too many cliches (or at least manages to make them feel reasonably fresh) and keeps the story moving and generally exciting. It also remains vaguely within the realms of plausibility and keeps you guessing as to the eventual outcome right up until the final few chapters. Action is frequent and varied, from chases on foot, to break-ins to mass battles on land and sea. Dietrich handles this side of things with aplomb, keeping events clear and dynamic.If there are significant weaknesses they relate to the book's pacing and some characterisation. In the case of the former Dietrich encounters a problem that is common to many authors who try to hang a fictional plot on true events; that reality doesn't always unfold at a dramatically satisfying pace. Whilst Napoleon's invasion of Egypt included several great and exciting land and sea battles there was also quite a lot of hanging around time too. This results in Dietrich having to add some padding around the book's middle section to keep pace with events as they actually unfolded, which robs the story of some of its momentum.In terms of characterisation having Gage act as narrator does have some negative impacts. The two key bad guys never really develop into more than sneering, moustache twirling matinee villains, a feeling exascerbated by the cliche that one is the outwardly respectable, haughty, aristocratic brains behind the operation and the other the swarthy local muscle. The good guys come off a little better, but still lack a bit of depth. A mutual love affair for example, feels under-developed as Gage as a character lacks the self-awareness necessary to identify his changing feelings and the first-person narration denies us woman's perspective entirely. Although the affair is signposted early on when it eventually blossoms it seems to do so from nowhere, rather than developing naturally and gradually.Overall however, Napoleon's Pyramids is a consistently entertaining historical adventure than remembers that such things should, above all, be fun. By the time I reached its open ending I was very keen to pick up the follow-up Ethan Gage adventure The Rosetta Key (Ethan Gage 2) , which suggests that William Dietrich must have done something right.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronald N D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 20, 2016",
                "reviewTitle": "Interesting read, but long winded, and lacking reality.",
                "reviewText": "While background for this book is predicated on historical facts, the fictional liberties interspersed throughout taken by the author serves to create what becomes a completely fictional tome, and, stretches credibility beyond reasonable limits. The fictional hero, and later together with the fictional heroine, is constantly being saved by incredible coincidences and then, when fiction leads into the paranormal/supernatural, the story rather falls apart and completely becomes pie in the sky. The storyline concludes with a setup that leads into the next book which I won't be bothering with. While one of my interests has always been stories based on ancient Egypt, this book is one I should have passed on as there is just to much unrealistic licence taken by the author. And that includes bending/embellishing documented historical facts as well.While I'm sure there are many who will like this book, for me personally, it was barely marginal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denis kilcommons",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 8, 2014",
                "reviewTitle": "A romp through history",
                "reviewText": "This first Ethan Gage novel was a wonderful discovery. Great style, humour, wit, historical detail and a hero I would go out drinking with any time. Great introduction to a great series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}