{
    "remaining_requests": 1713,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Whalefall-Novel-Daniel-Kraus/dp/1665918160",
    "body": {
        "name": "Whalefall: A Novel",
        "price": "$13.99",
        "originalPrice": "$27.99",
        "rawPrice": 13.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Whalefall-Novel-Daniel-Kraus/dp/1665918160",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-UetejO5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/415k-8bMQGL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Daniel Kraus",
            "link": "https://www.amazon.com/Daniel-Kraus/e/B002O1RDT4/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1570,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Whalefall is a rare thing: a page-turning, hold-your-breath, man-vs-nature thrill ride, but also a gripping exploration of the unnavigable relationship between parent and child. It's an anguished cry from the depths of that struggle. Bravo!\" -- Christopher Golden, New York Times bestselling author of Road of Bones and All Hallows“A crazy, and crazily enjoyable, beat-the-clock adventure story about fathers, sons, guilt and the mysteries of the sea . . . [Kraus] brings the rigor of a scientist and the sensibility of a poet to his descriptions of the undersea world.”—New York Times “This gripping sci-fi thriller from bestseller Kraus takes readers quite literally into the belly of the beast […] Kraus provides solid nautical science alongside the stretchy coincidences that fuel Jay’s survival. Just on the brink of horror fiction, especially for the claustrophobic, Kraus’s deep-sea thrill ride will have readers on the edges of their seats.”—Publishers Weekly \"A moving character study disguised as a riveting, cinematic survival thriller...The pacing is relentless, the awe astounding, and the tension palpably constricting, even as Kraus takes time to provide necessary details both scientific and visceral.\"—Booklist, starred review \"This hard sci-fi thriller is full of cinematic and wild suspense and would be great for fans of Andy Weir.\"—Library Journal, starred review “Picture Jack London, but with a more nuanced handling of broken, damaged men.”—Chicago Tribune “One of the most intense — and moving — stories that will grace the bookstores in 2023…what Daniel Kraus has created here is something that can’t be quantified.”—Cemetery Dance “An absolute triumph, a masterpiece of suspense, emotion, and flat-out terror…It’s one of this year’s can’t-miss books, and a journey you won’t soon forget.”—Paste Magazine “Kraus turns the literal guts of this novel into a haunted house, a torture chamber, a church and a uterus for belated rebirth. There is nothing else quite like Whalefall.” —New Scientist“A brutal, unsparing, wildly uplifting book. The sheer buoyancy had me breathless by the end.” -- Clay McLeod Chapman, author of Ghost Eaters and Wendell & Wild“Astoundingly great. Whalefall is, quite simply, a beautiful novel—a must-read story of the sea, the nature of awe, and the briny relationships between fathers and sons.” -- Gillian Flynn, #1 New York Times bestselling author“Brave, bold, epic, propulsive. Whalefall is a deeply moving thriller that holds a planet’s worth of hope in the pit of its stomach.” -- Joshua Ferris, National Book Award finalist“The primordial nightmare at the core of Whalefall is fantastically gripping. A character study developed in the most intense crucible imaginable, Kraus’s latest novel is smart, surreal, and powerfully humane.” -- Owen King, New York Times bestselling author\"A masterpiece. I haven't felt so alive reading a book in a long, long time.\" -- Alissa Nutting, author of Made for Love and creator of the HBO Max series“One of our oldest stories, one of our greatest fears, and one of our most capable writers. Stranger things than being swallowed by a whale have probably happened, but they've rarely been told so well.” -- Stephen Graham Jones, New York Times bestselling author“Whalefall is a mind-blowing, take-your-breath-away adventure, but it’s also a tender and moving story of the relationship between a father and son. Daniel Kraus is a writer I greatly admire. He can do anything, and does.” -- Dan Chaon, National Book Award finalist and New York TImes bestselling author of Sleepwalk“Unexpectedly emotional and wildly entertaining, Whalefall is the tense revamp of Jonah’s tale you didn’t know you needed.\" -- Gabino Iglesias, award-winning author of The Devil Takes You Home About the Author Daniel Kraus is the New York Times bestselling author of more than a dozen novels and graphic novels. He coauthored The Living Dead with legendary filmmaker George A. Romero. With Guillermo del Toro, he coauthored The Shape of Water, based on the same idea the two created for the Oscar-winning film. Also with del Toro, Kraus coauthored Trollhunters, which was adapted into the Emmy-winning Netflix series. He has won two Odyssey Awards (for Rotters and Scowler), and The Death and Life of Zebulon Finch was named one of Entertainment Weekly’s Top 10 Books of the Year. His books have been Library Guild selections, YALSA Best Fiction for Young Adults picks, Bram Stoker finalists, and more. His work has been translated into over twenty languages. Daniel lives with his wife in Chicago. Visit him at DanielKraus.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 18 hrs 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A USA TODAY BESTSELLER Named a Best Book of 2023 by Book Riot, Shelf Awareness, and NPR The Martian meets 127 Hours in this “astoundingly great” (Gillian Flynn, #1 New York Times bestselling author) and scientifically accurate thriller about a scuba diver who’s been swallowed by an eighty-foot, sixty-ton sperm whale and has only one hour to escape before his oxygen runs out.Jay Gardiner has given himself a fool’s errand—to find the remains of his deceased father in the Pacific Ocean off the coast of Monastery Beach. He knows it’s a long shot, but Jay feels it’s the only way for him to lift the weight of guilt he has carried since his dad’s death by suicide the previous year. The dive begins well enough, but the sudden appearance of a giant squid puts Jay in very real jeopardy, made infinitely worse by the arrival of a sperm whale looking to feed. Suddenly, Jay is caught in the squid’s tentacles and drawn into the whale’s mouth where he is pulled into the first of its four stomachs. He quickly realizes he has only one hour before his oxygen tanks run out—one hour to defeat his demons and escape the belly of a whale. Suspenseful and cinematic, Whalefall is an “powerfully humane” (Owen King, New York Times bestselling author) thriller about a young man who has given up on life…only to find a reason to live in the most dangerous and unlikely of places.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ MTV Books (August 8, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1665918160"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1665918169"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.04 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 1.4 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,457 in Books (See Top 100 in Books) #79 in Hard Science Fiction (Books) #346 in Science Fiction Adventures #1,168 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,570 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/43da2f72-fe9a-4738-ab8b-a18e6b6f04dc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ddc8b6f-2b80-4758-9d08-b112951571c6.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8d1ec8da-1b5b-4945-8d80-3a567149e162.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8306d7a4-4162-412a-a9c5-ee7073622353.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6723765d-6eb1-4eff-804b-73ae50d46369.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "The Book Canuck",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPVRJSC7D66RSW4SYZAWM32DMVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MW2BTH8GEJ41?ASIN=1665918160",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Immersive horror experience",
                "reviewText": "•■ THE PUCKERED opening is small, the squids mantle slides first, one huge eye making contact with you before it slides through, slimy tentacles slapping wetly as you scramble for a hold on anything. You feel the tentacle latch on to your calf and realize the squid is taking you with it. A cold rush of water unhinges you, and your inevitable descent into what remains of your life begins as your pushed down the slimy tube and into a flesh sack so tight you barely have room to wiggle...there's other things in here with you too.. ●▪︎● WHALEFALL ▪︎●▪︎ Daniel Kraus ●▪︎● MTV Entertainment Books**Spolier freeOCEAN claustrophobic horror is what makes me cold sweat. I have to say It's my cuppa. I was expecting great things and was indeed delivered a fantastic story. DoNT read this story then complain to me it was boring, I will fight you :) DONT come looking for murder, mayhem, and depravity in this story. It's not included.DONT read this looking for a wham bammer, thank you ma'am'er. She's a lady and is going to feed you at her own pace. DO READ THIS if you like to be wrapped in cold claustrophobic blankets of constricting muscle.DO read this if you need a break from violence but still crave horror and dread.DO read this if you want to witness an author creating an immersive fight for survival tale. Man, vrs beast. No gimmicks THIS is an experience, no mere book. ●▪︎○●▪︎○",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denver Hawkeye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJW72PODO6FGYQMPUKWV4FF7ZYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R376TB5E6L8SVP?ASIN=1665918160",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars A very strange head trip",
                "reviewText": "Halfway through this book I was completely frustrated, suspecting that the rest of the book would be nothing but a description of the physical fight between Jay and the whale. The struggle continues until nearly the last page, but there's a lot more involved than the physical struggle. There are several VERY cool parts that are connected to how whales communicate with one another. A fascinating book but I will not be looking to repeat this experience. Recommended with 4 🌟 stars.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JCStreetSoldier",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDAQ3UFABLSSBYAWEMBMYHCLFMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D238GYUXDLLB?ASIN=1665918160",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Sweetened but lukewarm coffee",
                "reviewText": "(Warning: there are some thematic* spoilers.)“Dying here is so much better than dying on land, where his pale, smelly corpse would be dressed and perfumed only to be mooned at by mourners out to avoid similar fates, before being plugged into overpriced soil, from which his best hope for immortality would be fossilization: a stone in a future museum, propped alongside other long-dead curiosities.”There’s nothing original about a man getting eaten by a whale; we’ve had this story for nearly 3,000 years. The story of Jonah and the “great fish” (people back then probably didn’t know/didn’t care that a whale was technically a mammal) is a fundamental account in Islam, Judaism, and—by association—Christianity.So Kraus didn’t invent or even reinvent the wheel. But I will say that I was pleasantly surprised—if not a bit underwhelmed—how realistic Whalefall was. It has a “true story” kind of mundanity about it. If I told my mom this had actually happened and had her read it, she’d believe it—hook, line, and sinker.What is Whalefall about? Jay Gardiner goes looking for his father’s remains in Monastery Beach, which is a deadly area in Cali. Now, Jay and his father didn’t get along. His father was a free-spirit, hippy, let’s-save-the-fish type—that seemed to put that quest over his family (I’ll give Kraus props for avoiding “I hate my dad because he’s a MAGA Republican” trope). Especially his son. There’s resentment. Obviously.So. Ocean. Diving. Squid. Uh oh. Whale. Oh? Ah. Pinocchio and Jonah, you get it.Daniel Kraus is known for horror. And Whalefall could have been a balls-to-the-wall survival horror extravaganza. Just remix and amplify a few elements, and there you go. But Whalefall isn’t that. It’s more like… a Mitch Albom novel. It pulls—or tries to pull—at the reader’s heartstrings as we cut in and out of the whale and flashbacks between Jay and his father. The problem for me is that his father, Mitt Gardiner, didn’t have enough redeeming qualities; and Jay was too whiny and threw a pity party throughout; and the conclusion of his “hero’s journey” was self-deceptive and deflected any accountability for his own failures as a son.Negatives out of the way, I did enjoy a very smart philosophical concept involving a junkyard flashback, the word “Sheol,” and the climax the novel (it takes a lot of themes from the Books of Jonah, and a little bit from the Passion story of Jesus on the cross); it’s actually quite intelligent. I respect it even more because Kraus doesn’t deliver it on a golden platter, nor does he brag or pat himself on the back and say, “look at me.” In fact, I didn’t even know he’d done what he’d done until I was on a 10 mile run two days after completing the novel.That being said, Whalefall IS NOT Christian- or Jewish-leaning; it’s very New Age, very Zen, very naturalistic, very… Gen Z-ish (and Jay Gardiner definitely fits that trope, always blaming his father and never looking inward, which is why I never liked him—and he never had any kind of meaningful growth).Whalefall is lukewarm. It’s… fine. It could’ve been a horror novel but wasn’t. It could’ve been a coming of age story but wasn’t. It could’ve been religious but wasn’t. It could’ve been political or preachy but wasn’t. In fact, he played too safe; it’s all things for all people but it doesn’t have an edginess that I was craving. A few smart and sneakily inserted philosophical ideas aside, it just felt… flat. Like, well… lukewarm coffee.But it was easy to read, was smartly paced (though it did have some bloat in Act 2), and I never wanted to put it down.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "QQMKXP938",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH4MEGLACCJGZDNX3TVRPFYNM5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTBND9NOQL4ZX?ASIN=1665918160",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing Book !!! Read it!",
                "reviewText": "The book \"Whalefall\" is an experience that will astonish you. The beginning chapters do not inspire continued reading BUT if you keep reading you enter an exceptionally complex, yet exciting and interesting story when Jay gets swallowed by the whale. The writing is superb. The detail is amazing. The development of conversations between Jay's father, the whale, and family are wonderous. This is the best book I have read in a very long time. I picked it up solely based on a review in the New York Times. At the end, everything that occurred in the beginning chapters make total sense.I was tempted to put it down during the beginning chapters...and I think many readers who reviewed this book may have done the same. Read on, please. The experience is astonishing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Worthy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVOS3ZEMJDUT437XCNEVQD4GQSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36XMCLOCG10PJ?ASIN=1665918160",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Unforgettable",
                "reviewText": "Unforgettable book. But fantastic. Do not read if you are claustrophobic or you may not be able to sleep for weeks. I am not, and I still was completely creeped out. And this from someone whose top bucket list item is to swim with whales and whale sharks.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deborah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFX6FS2UJZ5HYDUUD4HKYM6OTCXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36F71E9EY9R1C?ASIN=1665918160",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Incredible.",
                "reviewText": "First, there will be so many readers who love everything about this book. I’ve never read anything remotely like this! I guarantee you will be moved and at times you are sure to be breathless. I am giving this 4 stars because it was too much for me at times. So much detail, so much information! I hope you enjoy it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 23, 2023",
                "reviewTitle": "Fascinating and disturbing",
                "reviewText": "Some scattered impressions of Whalefall. The science was well-researched, and what was going through the thoughts of Jay, a 17-year-old swallowed by the whale, required the author's imagination. It was a fascinating read, but I wasn't prepared for how gory and stomach-churning it was. There were several negative impressions I would have preferred omitted or toned down. I found Whalefall compelling and skipped meals and housework to read in one day, although its vivid descriptions were gag-inducing and gruesome. All the slime, debris, foul odours, and chemicals found in a whale's stomach were something I never wanted to know! I did not care for Jay and how he moved out of the home when he was fifteen, ignoring his dying father and withdrawing from his mother and sisters' presence and pleas. Flashbacks were too frequent, and I felt more forgiving toward his father than Jay did. It finally came to him that the many stories his father told him about diving and sea life might help save him, although, in the past, they never ceased to annoy and enrage him. He refused his family's plea to visit his father when the man was dying from a terminal disease, and his father killed himself by drowning. I wished I had some knowledge of diving equipment, but I understood that Jay's was cheap and needed repair due to his father saving money. Jay decides to dive to try to retrieve some of his father's bones for burial, thinking this would improve his relationship with his family. His father had been a popular diver and storyteller, and his friends resented Jay's estrangement from him.Once in the whale's belly, Jay hallucinates that the animal is speaking to him in his father's voice. Many of Jay's severe and life-threatening injuries were painfully described. Still, I wanted to learn the long-term outcome of his physical injuries, mental state, and whether he reunited with his remaining family members. The book provided excellent information on the lives, deaths, and value of sea mammals, fish and molluscs and how human practices contribute to their decline. There were lots of thought-provoking and uncomfortable arguments for change and conservation. Despite some reservations, I thought this book was compelling and a success.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 21, 2023",
                "reviewTitle": "Well…",
                "reviewText": "It was okay. I didn’t really like the parts when he remembered back to the past years. The book also includes some negative events from real world from the past years (political issue). I read these books to find distraction from real world’s issues. I awaited much more from this book. I won’t read any books from this author again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 11, 2023",
                "reviewTitle": "A mix of troubled childhood with a claustrophobic experience inside the whale stomach",
                "reviewText": "Yes, the idea and the title is interesting, but that is where it ends for me. I went for this book with all the high expectations of a diver and a biologists only to find myself needing a big stamina to keep flipping the pages. A mix of troubled childhood with a claustrophobic experience inside the whale stomach.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice Benthin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 11, 2023",
                "reviewTitle": "A really good/brilliant writer taking that leap beyond 'good' towards greatness.",
                "reviewText": "I just finished this book in two big 'gulps' over the last two days which is unusual for me. So it's compelling. It's incredibly visceral and gross in parts - for a long time in fact. So it's not for everyone. What we have here is a really good/brilliant writer taking a risk, that leap towards greatness with legendary scale and Shakespearian themes. Stretching between the highest highs and the lowest lows of what it means to be physically alive and conscious of what that means. Did he make it? There are phrases that rang so perfectly true and magically said that they'll be dropping into my conversations for years to come. Certainly it's not as dumb as the book blurb or the book cover. Glad he took the shot at it, too bad his publisher didn't 'get it'.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}