{
    "remaining_requests": 1850,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Strange-Adventures-Tom-King/dp/1779512031",
    "body": {
        "name": "Strange Adventures",
        "price": "$22.99$22.99",
        "originalPrice": "",
        "rawPrice": 22.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Strange-Adventures-Tom-King/dp/1779512031",
        "soldBy": {
            "sellerID": "A2QVWT0ESGUXPH",
            "name": "ThriftBooks-Phoenix",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2QVWT0ESGUXPH"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Zd1YSjUcL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/51H-8WL5MQL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tom King",
            "link": "https://www.amazon.com/Tom-King/e/B0066F3XJS/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ThriftBooks-Phoenix",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 708,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 40 mins",
            "FREE delivery February 27 - March 4.",
            "Or fastest delivery February 21 - 23."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ DC Comics; First Edition (December 14, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 376 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1779512031"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1779512031"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.96 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.97 x 0.87 x 10.47 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#152,195 in Books (See Top 100 in Books) #343 in Mystery Graphic Novels #433 in DC Comics & Graphic Novels #2,120 in Superhero Comics & Graphic Novels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 708 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Sheriff of Babylon: The Deluxe Edition Mister Miracle Rorschach Writer Tom King Tom King Tom King Illustrator Mitch Gerads Mitch Gerads Jorge Fornés Synopsis Inspired by his real-life experiences as a CIA operations officer in Iraq, writer Tom King teams with artist Mitch Gerads--the creative team behind the critically acclaimed Mister Miracle--to deliver a wartime crime thriller like no other. No prison can hold him. No trap can contain him. He is Scott Free, the worldwide celebrity sensation known as Mister Miracle, and he is the greatest escape artist who ever lived. But can he pull off the ultimate trick--and escape death itself? What does it mean when Rorschach reappears as an assassin trying to kill a presidential candidate? Who is the man behind the mask? It's up to one detective to uncover the identity of this would-be killer --taking him through a web of conspiracies.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8c1301f0-1a81-4bd2-ae0a-2c2de734b549.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b435cdc-f3a5-419c-bf80-d2637c3ce55b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d08968e5-e266-49ab-8ae6-315c87227d97.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34e937ed-30f4-43f7-a145-5c7cd2cc3a9b.__CR0,0,1500,3000_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25770eb7-6743-4fa6-9a7a-d60632ee8f9c.__CR0,0,1500,3000_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY4ARHQ6B3TAGGA3OMPHNX5RW3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KQX5TUDQIKBI?ASIN=1779512031",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Not Your Golden Age Adam Strange",
                "reviewText": "Tom King does it once again with Strange Adventures. This is yet another example of the masterful way that King can craft a story about things that many of us may experience throughout are lives, masked behind a universe that features epic space battles, gods, and superheroes. This time around King tells a split narrative, showing the brutality of war in contrast to a detective narrative where we see themes of lies, truth, and perception.Evan “Doc” Shaner does the art for the past narrative which focuses on Adam Strange's time on Rann fighting a war against the Pykkts. Shaner draws this in a style that evokes the golden age of comics that almost tricks the reader into believing that this is going to be the lighter hearted segment of the book. Throughout the end of the book, as more is revealed, we see Strange grow more and more cynical, and by the end he is not this happy-go-lucky superhero that we thought him to be. Shaner depicts this in narrative but also in the way he draws Strange. At the start of Shaner’s portion of this book, Strange is a clean-shaven man; however, as we see him go through the trials and tribulations of war, Strange stars to grow this gnarly looking beard. The beard is symbolic of Strange becoming almost just like the ‘savages’ that he is fighting. By the end of the book, the past narrative, while looking reminiscent of the golden age, is almost more hardcore and horrifying than the present.This idea of ‘savages’ ties into the meta narrative of the idea of the “white savior” which has been present in many works of past fiction such as “Lawrence of Arabia” and “John Carter of Mars.” Throughout the narrative, Strange is required to build an army made up of the natives of Rann. The Rannian royalty repeatedly refers to the other groups on the planet as “savages” because they are shown to live in ways that the Rannians consider unconventional. The irony here is that even though these groups are repeatedly thought of as savages, they are instrumental in the war against the Pykkts. Even after their value is proven, the Rannians still end up just using these other groups as cannon fodder, showing that the Rannians are the true savages. This flips the “white savior” narrative on its head, showing that the wealthy and “more advanced” civilizations are not always the saviors that they think they are.The other narrative we see is the crime, noir narrative that Mitch Gerads draws. This takes place in the modern day and focuses mainly on the characters of Alanna Strange and Mr. Terrific. Mr. Terrific’s journey mirrors that of Strange’s in that he also had gone through a traumatic instance in his life and has never really come to terms with it. Terrific never dealt with the death of his wife and daughter and instead had convinced himself that he never wanted a daughter in the first place, and then buried himself in super heroics and science. Terrific’s journey in this story is learning from the mistakes of Strange and learning to move past the lies he has told himself, in ways that Strange never could.This mirrors Alanna’s story, who has basically dedicated her life to her husband. She has almost become a shell of a person since the death of her daughter and has overlooked many of the horrible things that her and her husband have done because of that. It is revealed later in the store that Strange had faked his daughter’s death in a deal with the Pykkts so that Rannians would look like they won the war, with Strange instead aiming the Pykkts at earth. It is revealed that instead of being the hero of two worlds, Strange is the destroyer of two worlds. These revelations shape Alanna into a headstrong character that by the end strives to be the hero that everyone (including herself) thought her husband to be.In Gerads’s sections, the story, like many of his other works with King, becomes very interpretive. Gerads has a very impressive way of making characters appear in a way you may expect, while the story is going in a very different direction. The first two-thirds of the story often leads you to believe that Alanna has villainous motives, with Gerads depicting her as a heavy smoker, almost in a fem fetal role, while she avidly fights against the Justice League’s accusations of her husband. She is shown making poor deals with political figures, and in essence “drinking the Kool-Aid” of her husband’s load of lies. By the end we see that Alanna was being manipulated by Strange but in a way that he felt was justifiable. Gerads makes sure to present Alanna as headstrong but flawed. More so than any character in Strange Adventures, Gerads chooses to always position Alanna in ways that make her motives ambiguous.Strange Adventures is a tale of truth, lies, and perception. With the backdrop of a superhuman epic, King, Gerads, and Shaner tell a fantastic story of what can happen when we refuse to deal with our past, and instead lie out way to the top. There are shades of the strong opinions that became so strongly formed in a 2021 Post-Trump political society, as well as the publics inability to see beyond bias; however, at the end of the day, Strange Adventures is about truth always coming out, and the toll that a traumatic event can take on people’s lives.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLZ4AD6KS6QCRP5P4NNO2MJM2WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV4IZHH05EOWF?ASIN=1779512031",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Wow!",
                "reviewText": "Took a chance on a character I knew nothing about and found my new favorite story in DC. Good god, this was great.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Comics Appreciation ProjectComics Appreciation Project",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH74W5HKKUU4ATDNSACSSQHSE3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25DHPQOVRDZ6I?ASIN=1779512031",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2022",
                "reviewTitle": "5.0 out of 5 stars Strange Adventures deserves recognition as a masterful venture within the genre.",
                "reviewText": "Strange Adventures (2021) by Tom King, Mitch Gerads and Evan Shaner (DC)King tackles another long-standing relatively unsung DC character and deconstructs them for a modern audience. It’s another DC “Black Label” project (similar to Elseworlds) which tends to exist outside normal DC continuity. My previous exposure to Adam Strange was mostly limited to the 2004 series by Andy Diggle & Pascal Ferry (4.8 on Amazon).While some readers may already have strong feelings about Tom King or even Adam Strange, regardless, Strange Adventures deserves recognition as a masterful venture within the genre. The series showed up on the “best of” lists for the Washington Post, Variety, and Entertainment Weekly. It received 2021 Eisner nominations for “Best Limited Series” and “Best Penciler/inker”. It was also nominated for the 2022 Hugo Award for “Best Graphic Story or Comic”. It received a 4.2 on Goodreads, 4.7 on Amazon, and 8.3 Critic Rating on Comic Book Round Up.To quote one of the main characters (Alanna Strange), “It’s a grand space opera about a hero thrown into a faraway land and he marries a princess and he leads the natives and he wins the war”…(or is it?)King does a spectacular job with the pacing and climax of the series. I particularly enjoyed his portrayal and use of Mr. Terrific.It was a skillful decision on the different use of artists Gerads and Shaner for the modern story and flashbacks. The book is beautiful. I also appreciated both the quality of the hardcover and the simple incorporation of the story elements as Adam’s memoir into its design.I thoroughly enjoyed this book.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71CNAJzKSLL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN5VLMCMQ4ZVAHGXNSSZMXQ24QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NULWB9E09GDS?ASIN=1779512031",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Really interesting but predictable",
                "reviewText": "This was a beautiful and fascinating book, but the story is one that sort of writes itself. The whole time, I was thinking, “Okay, so a hero of the ‘old school’ who seems virtuous, whom everyone admires and seems to exemplify traditional virtues. There’s only one way this is going to go—he’ll turn out to be a total hypocrite and monster.”It would have been more interesting if (spoilers) I was proved wrong. I wasn’t, of course.Throughout this book, little pot-shots are taken at the Trump administration—places where Adam Strange is painted as a kind of Trump Lite (albeit better-looking and more decent). But what writers of this type of narrative usually don’t realize is that these sorts of stories are precisely why we got Trump.Because when you train people to be cynical, to assume that every traditionally virtuous man is (in actual fact) toxic and, essentially, putting on an act—and your political opponents come to believe you, at least about national figures, what is left? I’ll tell you—mere thirst for power and hatred for political enemies, without any insistence whatever that your own heroes adhere to any standards besides pure partisanship.The only truly revolutionary story right now would be the one that causes us to believe in heroes again.I think an argument could be made (against mine) that this is a tragedy. But that’s not quite right. While it is about the fall of someone who was once a good man (?), his past goodness (if it existed) is overshadowed by his present hypocrisy. There is nothing interesting about his goodness—nothing compelling about it. A real tragedy is a good man who is destroyed by some sort of flaw, so that we identify with him and feel something has really been lost. But there is nothing terribly good about Adam Strange to begin with. He’s Willy Loman, not Oedipus.The art is beautiful.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cody Eason",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 6, 2022",
                "reviewTitle": "Wow",
                "reviewText": "You would be lucky to read such a great book. To see such great art and hear such great stories. I can say I think Tom is a great Writer, and every one working on this book put together something great. You will be happy you went to work to earn the money you spent on this story. Like a good brunch with friends you will be was to see it come to an end but know it was time well spent.Enjoy this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FunkRocker1992",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 1, 2022",
                "reviewTitle": "Incrível",
                "reviewText": "Que narrativa maravilhosa, intrigante e que te deixa ansioso pelo próximo capítulo, indico a todos que querem ter uma boa leitura.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EgosithEgosith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 5, 2022",
                "reviewTitle": "Me gustó!",
                "reviewText": "La verdad, me gustó. La combinación entre la escritura y el arte me pareció muy atinada.Lo disfruté muchísimo. Me parece que es un autor que está dejando una huella muy importante. Y me da gusto ver que personajes que quizá luego no sean muy conocidos, se les muestras desde una nueva óptica con este tipo de historias.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81D5zQVr9HL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 24, 2024",
                "reviewTitle": "Great comic!",
                "reviewText": "Super story and five stars arts. Looking for more similar dc creations. Enjoyed like a teenager. One of the Best I ever read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 12, 2024",
                "reviewTitle": "Brilliant",
                "reviewText": "A superb comic, telling the kind of story that only really works in this format.A smart reconstruction of the space opera trope.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}