{
    "remaining_requests": 1892,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Treasure-Peril-Island-adventure-novel/dp/1736801309",
    "body": {
        "name": "The Treasure of Peril Island: An adventure novel for teens",
        "price": "$12.99 $7.08",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Treasure-Peril-Island-adventure-novel/dp/1736801309",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/515AvGXP2SS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51dHbwPP6MS.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "C.W. James",
            "link": "https://www.amazon.com/C-W-James/e/B078X6RY7S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by Goodwill of North Georgia.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 51,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Fans of Treasure Island and Jack Sparrow will enjoy The Treasure of Peril Island ... a rollicking good yarn! (Five Stars) - K.Z. Reader's FavoriteC.W. James takes the reader on an engaging, adventure-packed tale of a life-changing journey involving an impoverished young boy, a mysterious pirate, and buried treasure.- Sublime Book ReviewsThe author has crafted a fun and engaging story line that will hold readers' interest from beginning to end. The story unfolds at a quick and steady pace, sustaining intrigue throughout. (James) excels at creating lively, substantive, and memorable characters. Particularly noteworthy is Jack, a sympathetic and smart protagonist that the reader roots for from the start.- BookLife PrizeThe Treasure of Peril Island is a swashbuckling fantasy that is consistently entertaining. If you're a reader looking for a quintessential pirate adventure story, then you'll have plenty enjoy in C.W. James' well crafted novel. - Literary Titan"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 45 mins",
            "$3.99 delivery February 26 - 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The winds of change are about to fill the sails of Jack Drayton…A penniless young man living on a barge on the Thames in 1903 London, Jack Drayton is unsure of where his life is heading. He’s trying to decide what to do with himself next when he meets a peculiar stranger. Needing a ride to shore one evening, Jack hitches a ride from this stranger, who speaks, dresses, and behaves as though he’s stepped out of another era. After Jack helps the man escape a fracas in town, he tells Jack that he is in fact Black Juan Gaskara, an infamous pirate, and claims that he’s on the run for his life.Now, that would be all fine and good, except for the fact that the real Black Juan Gaskara would have to be over 112 years old; or more logically, dead.Despite his disbelief however, Jack is intrigued by the man. Especially when he learns of the treasure that Gaskara has apparently hidden on Peril Island, a place only known to Black Juan.Before Juan is murdered by descendants of the crew he double-crossed over the loot, he leaves Jack with a cryptogram and map that will reveal where the treasure is hidden. Now it's up to Jack to recover the treasure before Black Juan’s enemies – who wish to use it to set up a global crime empire – get their hands on it first. With his best friend Hector at his side, Jack must venture on the dangerous ocean journey of a lifetime, following the cryptic clues to uncover the treasure before Gaskara’s foes put an end to his search…and his life!Using a 1903 novel as the foundation, author C.W. James creates a fast-paced and thrilling historical novel that will capture the imagination of young adult audiences and hold them fast until the very last page. Perfect for casual readers and bibliophiles alike, The Treasure of Peril Island is the kind of book that will ignite one’s love of reading, or continue to kindle the existing flame. A classic story of adventure, mystery, pirate curses and hidden treasure, this is the optimal book to add to any teen library!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Insundry Productions Books (June 27, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 224 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1736801309"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1736801307"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 13 - 18 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.51 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#266,868 in Books (See Top 100 in Books) #45 in Teen & Young Adult Pirate Action & Adventure #188 in Teen & Young Adult Fiction on Boys' & Men's Issues (Books) #944 in Teen & Young Adult Sword & Sorcery Fantasy"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 51 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "\"Someday, if Heaven so wills, a good man will find this vast treasure, and use it only for a good purpose. Such is my wish and prayer. It has cost me my life, and mayhap my soul.\" - Seth Lake",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/bc7749a9-3106-43c2-91eb-3109f01aa447.__CR0,47,980,303_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/bc7749a9-3106-43c2-91eb-3109f01aa447.__CR0,47,980,303_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/803aec8a-e226-44d6-b3b1-d9f0fd1a7a39.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/affd74f6-3c1e-4d11-9fa5-d7177ccc90fe.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/49015274-21c5-4616-a8c8-921e76f07bca.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amelia ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPTOMDTC4GXN5KP5L3DT4NDJURA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MESSWGD1BRGK?ASIN=1736801309",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Interesting book",
                "reviewText": "My grandson loved the adventure book. Read it in one sitting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe Corso",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQQT23GUGHZ5KCDXHTNHYGAB7XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RRZMJ5CF2PHN?ASIN=1736801309",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 1, 2021",
                "reviewTitle": "5.0 out of 5 stars If You Enjoy Treasure Stories, Get This Book",
                "reviewText": "I sort of stumbled onto this book, mainly because I enjoy treasure stories. It was well written with colorful characters. It was refreshing to read of two main characters who were true friends, who shared danger and solved the riddle of the treasure of Peril Island. A 5 star enjoyable bookJoe CorsoAuthor of Lafitte’s Treasure",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Reese",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFMTATACV62Y2M5S7JI62M5W42A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H756QGQ3OFN0?ASIN=1736801309",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2021",
                "reviewTitle": "4.0 out of 5 stars Lots of Action and Adventure",
                "reviewText": "This story is packed with action and adventure as two unlikely friends, Jack and Hector, go in search of a buried, much sought out treasure. Their moral compasses were tested throughout their arduous journey. The story ended with a good message and was quite satisfying.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob Jackson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDVMDANHCP42OYNNCNXOHMJDUXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YOWGYZMQF1QC?ASIN=1736801309",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 7, 2022",
                "reviewTitle": "5.0 out of 5 stars The clarion call of adventure!",
                "reviewText": "Brilliantly written, C.W. James (the author's pseudonym) has put together an adventure-filled tale that would rival Robert Louis Stevenson's Treasure Island. Set in the early 1900's and with a wee bit of magic, the protagonist serendipitously comes across a ruthless pirate who should be long dead. The adventure begins.This is a story of friendship, loyalty, and being truthful to one's word. It is a story of trust and humility and admitting when one has made a mistake. The five hour read is engrossing and almost impossible to put down until finished. I wish this were a series but am content with this most likely HEA end. I very much look forward to more from this writer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LitPick Book Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG77ATAHKFFF75PAKIPMVIWXHOKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKQ6URF614F7?ASIN=1736801309",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2021",
                "reviewTitle": "3.0 out of 5 stars Adventure and mystery",
                "reviewText": "In The Treasure of Peril Island by C. W. James, Jack Drayton takes a boat ride full of adventures and mysteries that unravel as the reader dives into a story full of fun. Jack runs into a pirate who tells him about treasure hidden on Peril Island. From decoding hidden messages to fighting pirates, the path Jack follows to Peril Island is anything but smooth. A ship burns and Jack saves his friends and himself while continuously keeping his mind thinking one step ahead. But what will happen when even Jack doesn’t know what to do?Opinion:The Treasure of Peril Island by C. W. James is a good book stuffed with adventure and mystery. Yet, because of the way the author wrote the book, I felt like the scenes were changing too fast. I had a hard time keeping up with all of the characters and was losing my interest in the book. Something I did like about The Treasure of Peril Island was how the story was full of suspense and mystery. During the parts that were suspenseful, I didn’t want to put the book down, but afterwards I felt like it was a bit boring. I would recommend this book to kids ages 12+ because of the content and plot.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}