{
    "remaining_requests": 1744,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Adventure-Time-Fionna-Natasha-Allegri/dp/1608863387",
    "body": {
        "name": "Adventure Time: Fionna & Cake",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Adventure-Time-Fionna-Natasha-Allegri/dp/1608863387",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51jHzeNezBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/513YmdPaq1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31PT1ujpsjL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Pendleton Ward",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Pendleton+Ward&text=Pendleton+Ward&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 168,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b?ie=UTF8&node=4"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b?ie=UTF8&node=3014"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ KaBOOM!; Original edition (October 15, 2016)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 176 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1608863387"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1608863389"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 9 - 12 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 4 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 14.9 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7 x 0.3 x 10 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#451,735 in Books (See Top 100 in Books) #913 in Children's Action & Adventure Comics & Graphic Novels #1,327 in Children's Humorous Comics & Graphic Novels #12,801 in Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 168 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amber Phelps",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGFBTMZJOW6HPNKK4HRCYUEQCRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NPCQ1J15OKAS?ASIN=1608863387",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2014",
                "reviewTitle": "5.0 out of 5 stars Nobody else brought this up? What the math?",
                "reviewText": "I read oodles of reviews about how awesome the story is, how much people love the art, how it was a perfect gift for a young (to young-ish) child, and how Fiona and Cake comics provide an interesting action/adventure story with a totally adorkable female lead. These things are all totes true but here's what else you need to know about this little treasure. This comic follows a story that (as of now) doesn't occur in the animated episodes of Adventure Time featuring Fiona and Cake. In this volume, fans of FiFi and Cake will enjoy lots of \"screen time\" with the Ice Queen, Prince Bubblegum, Marshall Lee, and Lumpy Space Prince (OH MA GLOB! Check out his totally killer anime eyeeeees!) Readers will also be treated to the first real appearance of the Flame Prince who is saved by Fiona shortly after his introduction and then spends the rest of the arc...just being generally adorbs as Fiona deals with her crazy friends and crazier enemy. At 176 pages, this book is a COMPILATION of six smaller Adventure Time comics which feature Fiona and Cake and the rest of Adventure Time's gender-swapped universe. You can purchase those comics individually but each comic is only about 20 pages and will run you 10-20 bucks. Don't do it, dudes! Why pay anywhere from 60-120 greenbacks when you can buy THIS volume for $16 and get the whole adventure at once?!?!?! There's been some squinty-eyed doubters claiming you can get this for $10 at any bookstore. Naw, bro. If you see THIS book for $10, you send it my way. To be fair, this cover (featuring Prince Bubblegum, Fiona, Marshall Lee, and Cake floating in the clouds) is the same cover as volume 3 of the individual comics, so I see where the confusion comes from. But check your page count, friends! If there's a downside to owning this compilation over the individual comics, I guess it would be the loss of different cover art. All the cover images (including alternates, 'web exclusive', and convention covers) ARE IN THE BACK OF THIS BOOK! But they're shrunk down, sometimes as small as 4 on a page. Sooo...if you're picky about that, I guess...sorry? But for real, dudes! Buy this comic compilation if you got a mad hankering for more Fiona and Cake (surrealiously, where's the love in the form of a spinoff show?) You'll get the full/new story arc with your favorite gender-swapped characters, meet the really hot Flame Prince, get all the cover images in the back pages and even the extra mini comics that were printed in the original volumes! It's mathematical, dudes. Buy this one!",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bookletbeauty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFER6W3K6ECHYAEWKYVXSEZAUWUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK97E22E74EQY?ASIN=1608863387",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2014",
                "reviewTitle": "5.0 out of 5 stars ****Review posted on bookletbeauty blog****",
                "reviewText": "My Thoughts:I really enjoyed this comic! I blew through it, and it was a great story. I love the Adventure Time TV show, so when I found out about the comics I knew I had to get them. Let me just say it was money worth spent. I love Fiona and Cake and I wish there were more than 2 episodes of them, however I am excited that they have comics on them now! Their are a total of 6 Fiona and Cake comics, and me being stupid, I picked up the third one before the first and second.I love the drawings in this comic. It was like the style of the TV show. I HATE it when the drawings look different from what the characters really look like. The whole story was so cute! I just love Adventure Time. It has fun and imagination combined into one cute show (and comic).I was excited because at the end we had as the comic called it *opens book and checks* \"Sweet Shorts\". They really were sweet. The sweater one was hilarious. I found myself laughing so much while reading this. It's just cute and funny to read. It was definitely nice to read a short book for a change. It made me feel like a speed reader flipping through a page every 30 seconds.When you first open the book the inside first page was so cute. The back was cuter though. All the characters were cute, but Lumpy Space Prince was the best. I LOVE Prince Gumball! He's definitely my favorite between Marshall Lee and Prince Gumball.Any Issues?:How can I have an issue with Adventure Time? *Answering a question with a question*My Rating: 5 stars! It was just so perfect and imaginativeWould I recommend it?:Even if you haven't seen Adventure Time I would recommend it. It's very cute and has a nice story to it. If you have seen Adventure Time, then yes, you definitely need to get this in your hands...NOW!If you would like to know....When I bought this I also bought the Adventure Time vol. 1 with Finn and Jake. So, there will be a review of that up soon. Just thought I would tell you that....",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suzi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCQFQCKPGVSRELHFCOOBNUFMKKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF9A0JT8PDC21?ASIN=1608863387",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 21, 2016",
                "reviewTitle": "5.0 out of 5 stars Algebraic!",
                "reviewText": "This volume includes all of Natasha Allegri's Fionna & Cake comics! And to get them all in one volume at about $15 is a steal (please check out the review left by Amber Phelps for the most accurate details), but make sure before you make your purchase that you are buying the compilation with the cover of Prince Gumball atop the umbrella and everyone else trailing along in various ways - this cover is also used on one of the smaller comics - so also pay attention to the page count. The compilation has 176 pages. I'm a huge fan of the art and style in both the Adventure Time cartoons series and the many comics that have followed, and you won't be disappointed with the Fionna & Cake comics. Beautiful, glossy pages with the same heart-wrenching as well as heart-warming story progression as fans of the series have come to love and expect. An absolute must-have for an AT lover.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zombie Kermit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH73LL3BLUBNCCVPAUDW7EDRGEIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HZP6KC6NLLDR?ASIN=1608863387",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2013",
                "reviewTitle": "5.0 out of 5 stars Better than I could have hoped!",
                "reviewText": "Wow, I wasn't expecting this to be as good as it was. I love the series and the comics that go with it, but this is easily my favourite comic so far. The artwork is adorable, and the writing is hilarious. It sat on my shelf for a few weeks before I decided to read a couple of pages. I quickly devoured the entire thing.Honestly, I would say the comic had some of the funniest writing I've seen in the series, and I'm not just talking about the comics. It had me smiling and laughing like a complete dope. Not only that, much like the show, it incorporates genuine emotion into the mix, with some truly beautiful moments. Cake's opening story is a great example of this.You would be forgiven for thinking that Adventure Time may be taking things too far with the comic releases, but do not let that deter you from picking up this little gem. Hopefully the team that produced this will be putting out more comics VERY soon.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana Schreier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2019",
                "reviewTitle": "Great read!",
                "reviewText": "My son really loved this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lukia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 27, 2019",
                "reviewTitle": "super Achat",
                "reviewText": "Trés bonne état . Arriver dans les temps. Je suis trés contente de mon achat. :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ぽりぽり",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on November 24, 2018",
                "reviewTitle": "フィオナとケイク英語版",
                "reviewText": "アドベンチャータイムが好きな方は絶対外せない本。何せフィオナとケイクはアイスキングの妄想のキャラなので登場する機会は少なく……マーシャルリーが拝めるありがたい本です！！！",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mango",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 25, 2015",
                "reviewTitle": "MATH!",
                "reviewText": "Good shipment, as a student I got the quick prime delivery and came when expected. The book itself is awesome, any lover of the Adventure Time comics should like this too. It's longer than the AT comics I have had before and it's nice having a different author & artist deliver it to the same outstanding value. It's a little girly, pink and bows, sort of reminded my of Natasha's Bee and Puppycat with Sailor Moon influence. MATHEMATICAL!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MarS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 8, 2014",
                "reviewTitle": "Gut!",
                "reviewText": "Man bekommt eine gut durchdachte Geschichte, die in einem alternativen Universum in \"Adventure Time\" spielt. Die Charaktere haben alle vertauschte Geschlechter.Als Fan der Serie hat mich vor allem gefreut, dass in den späteren Episoden der Fernsehserie Anspielungen auf diesen Comic vorkommen. Fionna hat nämlich in einer der Erzählungen plötzlich das Schwert, das sie in der Geschichte hier bekommt. Aber das nur so am Rande.Zum Buch:Es ist in einem gut verständlichen EnglischEs hat einen schönen freien Stilund hat natürlich einen guten Humor und trotzdem Spannung und DramaAlso, ich kann es nur empfehlen!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}