{
    "remaining_requests": 1877,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pok%C3%A9mon-Adventures-Vol-Hidenori-Kusaka/dp/1974725855",
    "body": {
        "name": "Pokémon Adventures: X•Y, Vol. 1 (1)",
        "price": "$8.69$8.69$7.10$7.10$8.69",
        "originalPrice": "$11.99",
        "rawPrice": 8.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pok%C3%A9mon-Adventures-Vol-Hidenori-Kusaka/dp/1974725855",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81O+HNlaxwL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Hidenori Kusaka",
            "link": "https://www.amazon.com/Hidenori-Kusaka/e/B006ILTHKE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by ThriftBooks-Baltimore.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 1181,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Hidenori Kusaka is the writer for Pokémon Adventures. Running continuously for over 20 years, Pokémon Adventures is the only manga series to completely cover all the Pokémon games and has become one of the most popular series of all time. In addition to writing manga, he also edits children’s books and plans mixed-media projects for Shogakukan’s children’s magazines. He uses the Pokémon Electrode as his author portrait. Satoshi Yamamoto is the artist for Pokémon Adventures, which he began working on in 2001, starting with volume 10. Yamamoto launched his manga career in 1993 with the horror-action title Kimen Senshi, which ran in Shogakukan’s Weekly Shonen Sunday magazine, followed by the series Kaze no Denshosha. Yamamoto’s favorite manga creators/artists include FUJIKO F FUJIO (Doraemon), Yukinobu Hoshino (2001 Nights), and Katsuhiro Otomo (Akira). He loves films, monsters, detective novels, and punk rock music. He uses the Pokémon Swalot as his artist portrait."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 43 mins",
            "FREE delivery February 27 - March 4.",
            "Or fastest delivery Thursday, February 22.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35. Order within 16 hrs 43 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Awesome Pokémon adventures inspired by the best-selling Pokémon X and Y video games!X was a Pokémon Trainer child prodigy. He hated being in the spotlight, so he took to hiding in his room and avoiding everyone—including his best friend Y. But now a surprise attack has brought X out of hiding!Now it’s up to X to use the skills that made him champion to defeat the threat looming over Vaniville Town. Can the reclusive X and the determined Y help their friends ward off two Legendary Pokémon and the mysterious Team Flare?!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3014"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ VIZ Media LLC (January 11, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1974725855"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1974725854"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 4"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 1 x 7.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#136,941 in Books (See Top 100 in Books) #101 in Children's Manga (Books) #465 in Children's Action & Adventure Comics & Graphic Novels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 1,181 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joseph Guarnero",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPKBT725CLYN2E5HWKOKUNHIHMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CI4LA0HM1B08?ASIN=1974725855",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2020",
                "reviewTitle": "5.0 out of 5 stars Review - Pokémon Adventures “Collector’s Edition” - Vol. 1",
                "reviewText": "Finally, a worthy edition of this underrated classic Pokémon manga! This series - at least the first few volumes - hold a very special place in my nostalgic heart.Following the adventures of Red, Blue, and Green in this series is a delight, encompassing a world of wonder, companionship, and surprisingly, some moral gray areas for characters to explore. This series is a true companion to the mainline Pokémon games, fully fleshing out a story that makes sense, in the most realistic possible way a cute, monster-infested world could be. The characters and storyline are developed in a much more mature and cohesive manner than that of its juggernaut anime counterpart, or even the stories that reside in the games storylines. For Pokémon, this is the end-all, be-all of Pokémon stories and the only Pokémon series’s that even come anywhere within the domain of ‘Adventures’ creativity or level of world-building that come close are the spin-off shorts series, ‘Pokémon: Origins,’ ‘Pokémon: Generations,’ and the recent on-going ‘Pokémon: Twilight Wings.’For someone who has been following the Pokémon franchise since the moment I could insert a Pokémon cartridge in a GameBoy (which, by the way, was ‘Pokémon: Silver‘ from the GameBoy Color on Christmas of 1999), I have never ever come up by another Pokémon series as rewarding as this one.There are through-line stories that weave and interconnect, with changing main characters - just as you would be forced into a new avatar in a new installment of Pokémon on your GameBoy, GB Color, GB Advanced, and so on, that would make, for the most part logical sense. At the same time, these characters receive a full storyline to follow and connections are made by the emphasis of companionship in this series - nearly all of these Pokémon trainers spend thorough amounts of time letting (all?) their Pokémon roam around free, interacting with their good and evil human counterparts around them. The abilities of the Pokémon have real-world consequences too, as evil, brutish Pokémon really do attack people (and conversely, evil people attack people and Pokémon alike). At one point or another a Pokémon or person may even be fatally or mortally wounded, which adds to the realism of monsters duking it out with fire, electricity, ice, and other dangerous abilities.The artwork enhances the simplistic magic that laces this world and it really helps that in nearly every chapter a Pokémon can be utterly hilarious, downright scary, unbelievably threatening, mischievous, good-hearted, and so on. The Pokémon all around are given real personalities, and they aren’t merely dangerous monster pets that can be tamed and kept in a ball - they’re just so much more than that here.Needless to say, there’s a whole lot going on for this series and it couldn’t be recommended enough for any Pokémon fan. It’s a genuinely good read.On to the *product*Pokémon - Adventures - Collector’s Edition is something interesting. It’s near perfect for what it’s trying to accomplish, and I )for the most part) have to give props to Viz Media for this. This edition aims to be a value-bound product but doesn’t skimp out on making this also a quality product as well. at three collected volumes, this first collected volume compiles a meaty 640 pages, and in doing so collects the whole first story arc.This new edition could be compared favorably between the 3-in-1 collections that have plagued many series and is more akin to the VizBig editions of old. The difference mainly lies in the size. These are taller than the standard Tankouban volumes (the same as your average single-volume manga or the 3-in-1) and shorter than the VizBig - they’re somewhere in between (I think potentially around the same size as the Death Note: Black Editions - I don’t have those, but I know I should). Regardless, it’s a pretty generous size.The dust jacket surprised me with its quality. It’s solid, somewhat matte-feel finish makes this book easy and welcome to hold, and the print, from the lettering to the artwork is embossed in a glossy finish that makes it ‘pop’ just right on your shelf.To be honest, I was expecting this release to be all-around budget cheap, my expectations were much closer to the 3-in-1 collections, and we all know how terrible those are. But the paper quality is much closer, again, to that of the VizBig editions, and while none of the paper is not quite as thick as that, it doesn’t feel cheap, you won’t be able to see trough to the next page almost ever unless you really try - which is pretty nice. Additionally inside, you’ll find some colored pages - not many, only 7 - but it is a nice addition none the less. My only gripe here is, of course, there could have been more, but I imagine the base price would have gone up more.As for content, I am very thrilled to say that it is mostly left uncensored, which is, all things considered for Viz Media, a general improvement on other releases. But here lies my biggest gripe: original versions have kept some of the translated ”sexual” jokes, such as Misty calling Red a pervert for “groping her” (he wasn’t, he was carrying her to safety), and some direct mentions of dating one another. This edition seems to have either kept more recent censor revisions, rather than being truly untainted, which I find slightly disappointing. There’s really never any need to censor things, for the most part, and I think this particular instance was a mistake. I am assuming that all volumes retain a certain ‘G-rated standard,’ and luckily, I don’t remember too many ’racy’ moments in this series. If there are moments that seem just slightly off or contrived, I’ll have to assume it’s because of a censorship that’s rewritten my memories.But at the end of the day, this release is a genuine delight. It far exceeds my expectations, as I was fully expecting another cheap Viz release, and I am grateful to have this series back in my shelves for the first time in years, and this time more “complete” than ever before.If you, or someone close to you is/are a fan of the Pokémon franchise in some capacity, I guarantee that this is will be a delight. Take it from a life-long fan that this is the Pokémon story you have been waiting for - and this just happens to be to date, the best (and currently, cheapest?) edition to get ahold of.",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXUGYMMASZGIXQXPJBD6HAULIOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V30BUDO46HJB?ASIN=1974725855",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Great gift for kids and a classic manga. Highly recommended.",
                "reviewText": "I grew up with Pokemon and got this as a gift for my cousin's kids who are aged 7-9. I know the Pokemon manga is considered \"dark\" for a kids manga, but I remember reading it as a kid and loved it. The resounding themes are still focused on friendship and adventure with enemies that are slightly more realistic compared to the anime (as realistic as things can be when they're all about Pokemon). My cousin told me the kids loved it and my cousin is one of those Moms who are kind of controlling about what sort of things her kids consume as media, and I'm glad it also passed her approval. 10/10 great for all ages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKSJKFCVNEXY3ITPW3O4DF4DNUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IDVDK2ECYFPD?ASIN=1974725855",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Good Book",
                "reviewText": "It is an entertaining book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ErikErik",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG27UMQUWCTQ52Y5XK5QTJ7U4FOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KOV8SD7YYCZW?ASIN=1974725855",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Good manga.",
                "reviewText": "Arrived in good condition. The book wasn't at all damaged.Plus, i love the art. I'm a sucker for manga, so this is a nice addition to my collection.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-6KTmX5GL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cZ5D1YewL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81cpMDGkCEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alison Burlage",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZFIIH767C3EWYAWYZSGMRLHKIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OSIN0D1THUZJ?ASIN=1974725855",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Adding to the Obsession!",
                "reviewText": "Prompt delivery, in great condition, and a perfect companion to my other pokemon-related content! Will be buying the other collection books soon.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "StephenStephen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENNLOGDDRJ575WJEPOZ3PLMD7TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22O73Z866FUBF?ASIN=1974725855",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 14, 2020",
                "reviewTitle": "5.0 out of 5 stars An Excellent Collector's Edition",
                "reviewText": "I've always been interested in the Pokemon Adventures comics but in the 20+ years I've been a fan of Pokemon I'd never actually looked into buying them until I saw this product listed here for such a reasonable price.Since this is a collector's edition intended mostly for existing fans I'll focus on the quality of the physical product rather than the quality of the story/art. The book reads right to left as is typical with manga. It is primarily in black and white, with a few color illustrations at the very front. The book feels high quality for a paperback and I see no issues with the print quality.I anticipate I'll be buying volume 2 once I finish reading this one.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/715mf4C8WtL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71VyEWpz5QL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Dc6gkk4rL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel Gutierrez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOYU44GS6DB25ELR6NDXY2DXO5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJDQDM597ZNML?ASIN=1974725855",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 3, 2022",
                "reviewTitle": "4.0 out of 5 stars Good Times for my 7yr old",
                "reviewText": "Order this for my son for summer reading. He likes the books but he's unfamiliar with Red and Blue. He likes it but I could tell he was looking for more familiar human characters like in the show and other manga.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kawaii_girl_167",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP66MOGUQUO65VJET2FAFMSYXBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WK0BGAG7ILW5?ASIN=1974725855",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 1, 2022",
                "reviewTitle": "5.0 out of 5 stars Thick",
                "reviewText": "The media could not be loaded. I didn't think it was going to be this thick lol 😅 I compared it to one of my other books I have .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e86bce5-3407-4384-9e5a-1b7f0aeaf1da/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Gerson Reis de Lima",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 30, 2023",
                "reviewTitle": "Livro Coleção Pokemon",
                "reviewText": "Sim, muito bom o livro e chegou intacto e antes do tempo previsto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 29, 2021",
                "reviewTitle": "Fantastic",
                "reviewText": "Great book, great looking. Could literally only be better if it were hardcover but oh well. Super pleased with this purchase and will be buying them all in this collectors edition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SerwesSerwes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Poland on April 13, 2023",
                "reviewTitle": "Książka nie została odpowiednio zabezpieczona",
                "reviewText": "Książka nie jest najtańsza pozycja na rynku, a nie została w żaden sposób zabezpieczona. Przyjechała tylko w opakowaniu kartonowym ( beż chociażby zabezpieczenia folia bąbelkowa).Na zdjęciach widać jak wygląda zamówiony produkt jakby pochodzil conajmniej od trzeciego właściciela.Zachęcam do rozważenia czy warto zamawiać u tego sprzedawcy. Nie ma tutaj profesjonalnego podejścia do pakowania.Oczywiście sama zawartość, treść mangi to już inna sprawa. Rewelacyjnie się czyta.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61g2zZElJEL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61N67qoESJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/715ZIKL4b6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "H unique",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 30, 2022",
                "reviewTitle": "Great game",
                "reviewText": "Great price! Delivered on time and in great condition. My son was pleased.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GunnarGunnar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on July 13, 2022",
                "reviewTitle": "Damaged book",
                "reviewText": "The book wasn't in good condition when I received it. The corners of the book are damaged",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71RHWIdl0WL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710SOGkv4OL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}