{
    "remaining_requests": 1992,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Five-Hundred-Feet-Above-Alaska-ebook/dp/B07QWF857K",
    "body": {
        "name": "Five Hundred Feet Above Alaska: The Heart-Stopping Adventure Novel of an Alaskan Bush Pilot",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Five-Hundred-Feet-Above-Alaska-ebook/dp/B07QWF857K",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91RpM2GtN+L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Robert M. Brantner",
            "link": "https://www.amazon.com/Robert-M-Brantner/e/B07QZD2Y9V/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 793,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "International #1 Amazon Bestseller in SEVEN Categories in the US and CA, including Weather, Commercial Aviation, Piloting & Flight Instruction in the US. Pacific Northwest, Commercial Aviation, Pacific Northwest United States History, and Pacific West Travel in CA.Five Hundred Feet Above Alaska is the story of Peter Connors, a young man who moves to Alaska in pursuit of his dream of becoming a commercial pilot. While the pilots in Alaska are known for their superior airmanship, they are also famous for their disregard of the rules that govern them. Determined to ultimately be an airline pilot in “the lower forty-eight,” Peter vows to walk the straight and narrow. Yet, when Peter is the only pilot available to rescue a comrade who crashed in the snow-covered tundra, he is forced to compromise the very ethics that define him. Over time, Peter’s competence begins to overpower his regard for the rules. Slowly, almost imperceptibly, Peter begins a downward spiral. The life Peter had carefully constructed for himself is at odds with the “live or die” flying of Alaska. Over the course of a year of doing battle with the elements on a daily basis, armed only with his plane, his wits and his skill to bring him home every night, Peter must decide whether it is more important to embrace life or cheat death.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07QWF857K"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (April 19, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ April 19, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4135 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 337 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#362,459 in Kindle Store (See Top 100 in Kindle Store) #51 in Commercial Aviation (Kindle Store) #66 in Aviation Piloting & Flight Instruction #3,477 in Action Thriller Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 793 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "DS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRV5CPGKDSTTXILRRMVHJUA2CKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RREJGH34TCJER?ASIN=B07QWF857K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2023",
                "reviewTitle": "5.0 out of 5 stars wonderful bush pilot novel",
                "reviewText": "I really enjoyed this book and was sorry when I finished it. I normally read non fiction but this is well worth your read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TaraM",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSX6GCT44FKA64NQ5RZEPHW5R2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCAJLK3VYUSS6?ASIN=B07QWF857K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2019",
                "reviewTitle": "4.0 out of 5 stars A vivid and compelling story of Alaska",
                "reviewText": "A really great read!It's a well written and compelling story. Exhilarating and heartbreaking at times. I was left with a real sense of the thrills and dangers of being a bush pilot in Alaska.You really feel like you know the characters in the book. They would be your neighbors or your friends - if you lived in Anaktuvuk Pass or Unalakleet. Ironically, they seem more genuine than the reality TV stars on Ice Road Truckers or Alaskan Bush People.I've been to Alaska several times on vacation, but, after reading this book, I felt like I lived there. You can really sense the stunning natural beauty of Alaska's wilderness combined with the grittiness of daily life in the villages there.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6OTHQNXWUZ57A2KUYRW757IYWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3T9JXRWZFZ7HA?ASIN=B07QWF857K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2019",
                "reviewTitle": "5.0 out of 5 stars A great story of the heroics performed daily by Alaskan bush pilots!",
                "reviewText": "In this novel, Mr. Brantner truly succeeds at transporting the reader right into the cockpit of the Cessna 207 used to support so many critical parts of every day life in Alaska. It delivers on a very accurate depiction of all of the decisions, considerations, and perspectives a pilot must make and have, sometimes in a split second as countless variables change over the course of even a short ten minute flight.The main characters are instantly credible and comfortable, and the plot twists they must come to terms with as they come to terms with sacrifices of a bush pilot's life keep the reader interested and constantly engaged.This is a great story, and worth putting in your reading queue.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pryzminc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCMSV46RTLRDZDJCEXOQNMARKGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CHWJS5DZ6N81?ASIN=B07QWF857K",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 2, 2023",
                "reviewTitle": "3.0 out of 5 stars Hmmm",
                "reviewText": "This book started out great. I spent a lot of time in Alaska, mostly as a fisherman, but I also had my own Stinson 108-2. I was one of those pilots that the author described as flying in the bush, but not being a bush pilot. If it matters, I am 74 years of age. The last half of the book was so focused on romance, that I had to push my way through it. I have friends who are commercial pilots and I was ready to recommend it, but I won’t. What I’m saying has nothing to do with the quality of your writing, it has to do with the change from flying as a bush pilot and learning in Alaska, to getting married and having a kid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHLRUP6N5MWBTTKLZGTY35BF4PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AWL3IY312I0V?ASIN=B07QWF857K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2019",
                "reviewTitle": "5.0 out of 5 stars The “rogue pilot” is still an inappropriate role model.",
                "reviewText": "Captain Brantner’s “novel” is beautifully written about the challenges of flying the Alaskan bush. Having flown the Twin Otter out of Bethel 40 years ago, I was amazed at the author’s ability to put me back in the cockpit. The book details the human factors and huge pressure to compromise. Most pilots arrive in Alaska with the desire to be legal and safe. But even today, for most bush operators, there strong culture of non-compliance. The “rogue” pilot is still an inappropriate role model. “Airplanes fly over gross but they don’t fly out of gas. And the published minimums are for the new guy.” This book is a must read for pilots who cherish life and seek wisdom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZVNDHOY5L6UBURAHOHNRQAOJTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15R3TPWXGQI3H?ASIN=B07QWF857K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 12, 2021",
                "reviewTitle": "4.0 out of 5 stars An Alaska love story with great description of bush flying.",
                "reviewText": "I liked the description of bush flying in the Alaska wilderness and beginning a career as a pilot. The added factor of a romance was an add on,but enjoyable. I see some reviews didn't think it was necessary and detracted from the actual everyday nuts and bolts of bush pilots. The romance bit added another dimension.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff Watson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPWYO4B5OW3MJ4LVPP4HOWHHSYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z2WQHAH0WF2R?ASIN=B07QWF857K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2019",
                "reviewTitle": "5.0 out of 5 stars Great book about bush pilots.",
                "reviewText": "I love to read and really enjoy any books about Alaska. This was an interesting read about a guy that got a last minute job to be a pilot in Alaska after flying tour groups in the Grand Canyon previously. Nobody expected him to be a good pilot and people; especially his immediate boss, was very surprised how good he was and what he did for him when the boss was in trouble on his flight. It was a good read and I enjoyed the story about his girlfriend also. This was a very straight laced person who wound up fitting in just fine.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kmehta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDA24QYER2RRUTJHYMGNGKN6J7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31Y0DGFTN44ET?ASIN=B07QWF857K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 29, 2021",
                "reviewTitle": "4.0 out of 5 stars Nice read, especially for an aspiring/student pilot",
                "reviewText": "I learn well from the wise, the kind, and the experienced. It is apparent that the author has all three qualities especially within the technicalities, culture, and quirks of aviation. I recommend this to anyone who has had at least a few hours behind the stick.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ehrmann Mario",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 29, 2023",
                "reviewTitle": "Spannung Pur",
                "reviewText": "Lebendig anschaulicher Schreibstil, man spürt die Rauhe Natur des Nordens. Der Druck die FAA Vorschriften und die Certified Aircraft Limits den Bedürfnissen anzupassen. Zwischenmenschliche Differenzen, Versöhnung, Freundschaft und Vertrauen werden einfühlsam umschrieben. Professionalität und Glück bei der Bewältigung kritischer Situationen. Wahrlich wer sich in Alaska als Pilot bewährt, kann überall auf der Welt fliegen. Ein Buch dass man nicht aus der Hand legen kann. Der Titel wahrscheinlich nicht unbedingt Main Stream um so erfreulicher die schnelle Lieferung.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "odjob",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 17, 2019",
                "reviewTitle": "The literary equivalent of Christian rock",
                "reviewText": "If you’re hoping for a book about tough Alaskan pioneering spirit and derring-do, you’ll be bitterly disappointed in this mundane tale of a pious young man plying his trade as an aerial taxi driver. Naïve & inexperienced in matters of the opposite sex, our hero’s first challenge is to overcome the distrust of his gruff pilot instructor, but wins him over by coming to his aid in a tight spot during a snow storm. This initiates a true bromance in which the grizzled old aviator takes him under his wing and teaches him how to talk to girls. But just in case temptation proves his undoing, he becomes a local pastor as well. He finally plucks up courage to find the girl of his dreams, a sassy young thing who is undoubtedly more experienced, but who secretly worships him and thinks he is the bestest pilot everrrr! The dialogue is tediously cringeworthy throughout the first half of the book, which is as far as I was prepared to read. If it wasn’t on my kindle, it would have ended up in my wood burning stove.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2020",
                "reviewTitle": "Appreciated by a fellow pilot",
                "reviewText": "The reality of the flying captures and illustrated in this book could not be relayed so accurately except through the eyes and feel of a pilot who flew there. Well done!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}