{
    "remaining_requests": 1745,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/MERRY-ADVENTURES-Illustrated-Active-Contents-ebook/dp/B00ATFPX5S",
    "body": {
        "name": "THE MERRY ADVENTURES OF ROBIN HOOD [Illustrated With Active Table of Contents]",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/MERRY-ADVENTURES-Illustrated-Active-Contents-ebook/dp/B00ATFPX5S",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71QdYVidj1L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Howard Pyle",
            "link": "https://www.amazon.com/Howard-Pyle/e/B000AP9XDK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1124,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Children's eBooks",
                "link": "https://www.amazon.com/Childrens-Kindle-eBooks/b?ie=UTF8&node=155009011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B00ATFPX5S"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Northpointe Classics (February 15, 2003)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 15, 2003"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1188 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 408 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#110,893 in Kindle Store (See Top 100 in Kindle Store) #20 in Children's Arthurian Folk Tales #26 in Children's Arthurian Folk Tales & Myths #1,026 in Children's eBooks (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,124 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lora S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZL7PB4UL47R3E24ENBLOLK6DVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZN5XMBJWT2L7?ASIN=B00ATFPX5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2018",
                "reviewTitle": "5.0 out of 5 stars Some different Robin Hood stories",
                "reviewText": "The Howard Pyle version of The Merry Adventures of Robin Hood seemed to be the version with the most editions available, so I figured that would be a good starting place for Robin Hood stories. Silly me once again forgot that I had already purchased the Audible version of the book (the Audible version is not free, but I think I got it as a daily deal or something) and got the Kindle version too. Since the Kindle version is a cheap edition of a really old book, I did not particularly expect the Kindle and audiobooks to sync up, but they actually did pretty well together.John Lee does a great job with the narration, voicing everybody from the evil Guy of Gisbourne to the shifty Sheriff of Nottingham with fine distinction. He even sings all the many songs in the book in character very well. According to the section in the Kindle book about the author (this part was not in the audiobook version) Howard Pyle based his version of the Robin Hood stories on a 1795 collection of ballads, so nearly every tale, especially in the first part of the book, has a merry song or two in it.Apparently, there is no original manuscript to base a rendition of the Robin Hood stories on so this collection of ballads may be as close to an original source as we are likely to get. In consequence, while the language of these stories has a suitably Medieval cast to it, it is nevertheless reasonably easy to understand. It’s not like trying to read Middle English or anything.And yet, the stories are set in a time when Middle English would not have been so far off the mark. This collection actually focuses on a time period somewhat earlier than the more recent popular renditions of Robin Hood in the movies. Throughout most of the book, the King is King Henry II. In fact, Henry and his Queen, Eleanor of Aquitaine, appear in a couple of the stories. Queen Eleanor sponsors Robin Hood and some of his men in a tournament, and King Henry, upset that they have beaten some of his favorites, hunts them all over the north of England. This must have been during the time Henry and Eleanor weren’t getting along so well.There were many stories in this book that I had not heard before, or barely heard references to somewhere. And a lot of the stories found in recent renditions of Robin Hood are not there. For instance, Maid Marian is mentioned about three times as the girl Robin Hood loves best, but her story is not told at all. Instead, we have the story of Allan A Dale and his true love, Ellen, and how Robin Hood saved fair Ellen from marrying an old knight so that she could marry the minstrel instead. Guy of Gisbourne is not a knight but another outlaw with an evil reputation whom the Sheriff of Nottingham has hired to kill Robin Hood. And it is King Richard who, after his father’s death and his own accession to the throne, finally catches Robin Hood – and takes him into his personal service.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Pearson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYLAWMCHRUAAGST7UPQXOT3RXPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VA7YF2Y9XTQA?ASIN=B00ATFPX5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2009",
                "reviewTitle": "5.0 out of 5 stars Stories of Adventure and Merriment",
                "reviewText": "The Merry Adventures of Robin Hood is an excellent book of small stories. One will discover this book provides an ocean of emotions and entertainment. Some of the adventures you will laugh at because of the hilarious sly side to Robin Hood and his band of merry men. If you want hilarity and laughter this is an excellent book. Adventurous excursions are also plentiful in this book. Some may want blood and guts adventure but this book provides more of innocent adventures that include wit, charm, strategy, and deception.When considering this book one will encounter older English language. This though does not stop one from enjoying the adventures in each part. If you struggle with older English read for a couple of chapters and you will easily get the hang of it. Also older English provides more of a sensual and realistic feel to the story because this is a medieval tale. The wording puts you in that time frame.It contains some pictures to help the reader formulate an imaginative image of that time. Although if you are expecting a picture book this is not it. When comparing this to other books it is an enjoyable laid back story. I laughed in many parts because of Little John, Robin Hood, and other members of his group's funny comebacks with extreme wit.I highly recommend this book for various purposes. This book can be for children to adults. Read it parts not just chapters. Each part is a riveting tale in itself. It may seem slow in some parts but will pick up quite fast. At the end of the book you would wish the story would continue but to all things comes an end. Enjoy it and I am sure you would even want to re read in the future.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Masumi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELY4ZBMGMDEP4O4MCJOQIZ5NZJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZQ2C6GE2L92H?ASIN=B00ATFPX5S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Indeed merry",
                "reviewText": "Although Robin experiences sword fights and even death, the whole stories filled with merry tone. There are many differences if you compared with the Disney movie (I'm obviously educated by the Disney), especially about the romance between Robin and Maid Marian. But still you can enjoy this version of the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hawksmoor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQARJZRVLFMHH6DGCU2KTVFL7FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25M2ORT4RRFV1?ASIN=B00ATFPX5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2011",
                "reviewTitle": "5.0 out of 5 stars Book order",
                "reviewText": "I am extremely happy with the order of \"The Merry Adventures of Robin Hood\" by Howard Pyle. I own the other twelve books in the Educator Classic Library series but somehow lost my copy of this edition. I am very happy to have been able to find the book and re-complete my set. The first company I ordered this book from sent my another edition which was disappointing but Kelly & Fair International Marketing Inc. came through for me. I wrote a message asking that they confirm that I was going to receive the correct volume ordered and they were quick to respond. I also received this volume in a very short time which also pleased me greatly. It is a wonderful book and the company I ordered it from is certainly a company I hope to do business with again soon.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole Desiree of Filloria",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRJDMM6OQKXQZQT7NK5BA6436BA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGALZH0WTX670?ASIN=B00ATFPX5S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2010",
                "reviewTitle": "5.0 out of 5 stars Incredible adventure I wish would never end",
                "reviewText": "I had a fantastic time reading this book. The great gift of Kindle is the built in dictionary. I found the language much less difficult to get through because I looked up any word I didn't understand. The tales are exciting and humorous. The rich detail on the clothing and food was very interesting. I think reading the stories as an adult may be more fun than as a child. There is a lot of fighting and drinking and singing, which was all part of the joy of reading it. However, I could imagine it geting challenging or boring for children who are not able to get past the language. The writing is so rich, I didn't miss the illustrations that are not available on the Kindle edition.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 29, 2023",
                "reviewTitle": "Great read.",
                "reviewText": "Very well written. Very good story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rizwan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 25, 2023",
                "reviewTitle": "This is the story of a charming little kitty named Moppet, who thinks she's heard a mouse!",
                "reviewText": "This tale deals with Moppet, Tom Kitten's sister, and it is a simple but endearing story for little children about the tricks a brazen mouse gets up to. Unwisely, he finds himself in a precarious situation, but before the story ends, all is made good.'The Story of Miss Moppet' was first published as a panorama fold-out for the Christmas of 1906. However, that format resulted unpopular with bookstores due to its unwieldiness. It would later be published as a regular book to the delight of fans.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ND",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 15, 2023",
                "reviewTitle": "A Timeless Classic Adventure!",
                "reviewText": "I recently delved into \"The Merry Adventures of Robin Hood,\" and what a delightful journey it turned out to be! Howard Pyle's timeless classic is a captivating escapade into the heart of Sherwood Forest, filled with daring feats, camaraderie, and the enduring spirit of justice.Pyle's storytelling prowess weaves a tapestry of excitement, as Robin Hood and his band of Merry Men embark on daring exploits, challenging the tyranny of Prince John and the Sheriff of Nottingham. The characters are vividly brought to life, each with their unique charm and quirks, making it impossible not to root for this band of outlaws.The author's prose is rich and engaging, transporting readers to a world where archery contests, hidden glades, and valiant deeds are the order of the day. The camaraderie among Robin Hood, Little John, Friar Tuck, and the rest is heartwarming, creating a sense of kinship that resonates throughout the tale.\"The Merry Adventures of Robin Hood\" is not just a story; it's an enduring celebration of courage, friendship, and the fight for justice. Whether you're revisiting this classic or discovering it for the first time, be prepared for an enchanting journey that transcends time. Howard Pyle's masterpiece is a must-read for anyone who craves adventure, camaraderie, and the triumph of good over evil. Highly recommended!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cookie42",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 23, 2023",
                "reviewTitle": "Livre très joli et complet",
                "reviewText": "Magnifique livre broché en cuir relié, la tranche est cuivrée et pailletée, belles illustrations qui font d'époque avec un sommaire très détaillé précisant ce que raconte les chapitres.Très bon achat que je ne regrette pas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michel NagmeMichel Nagme",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 24, 2020",
                "reviewTitle": "Uma belíssima edição das histórias de Robin Hood",
                "reviewText": "O livro é realmente lindo. Tenho alguns outros exemplares encadernados em couro da própria Barnes & Noble e também da Canterbury Classics e esse é de longe o mais bonito e bem acabado. O couro da capa em tom verde contrasta muito bem com a pintura em verde escuro, creme e cobre metalizado. A lateral externa das páginas também é metalizada em cobre. No interior, temos as belíssimas ilustrações de Howard Pyle, todas em cores, assim como detalhes e pequenos resumos nos lados das páginas. O inglês usado é arcaico e pode deixar a leitura um pouco lenta no início, mas com o tempo as palavras vão se repetindo e você pega o ritmo. Uma excelente aquisição ou opção de presente para colecionadores e fãs das histórias de Robin Hood.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81rLT9AlqzL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81m++mjOUJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61hw-ljFhsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61SLFdtn-nL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71k6XXiyryL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}