{
    "remaining_requests": 1940,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Adventure-Zone-Murder-Rockport-Limited/dp/1250153719",
    "body": {
        "name": "The Adventure Zone: Murder on the Rockport Limited! (The Adventure Zone, 2)",
        "price": "$12.06 $9.92",
        "originalPrice": "$19.99",
        "rawPrice": 12.06,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Adventure-Zone-Murder-Rockport-Limited/dp/1250153719",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91cZugSAx1L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Clint McElroy",
            "link": "https://www.amazon.com/Clint-McElroy/e/B0749BQ64F/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Zoom Books Company and Fulfilled by Amazon.",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 3809,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 37 mins",
            "FREE delivery Wednesday, February 28 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 52 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Comics & Graphic Novels",
                "link": "https://www.amazon.com/Comics-Graphic-Novels-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=4366"
            },
            {
                "name": "Graphic Novels",
                "link": "https://www.amazon.com/Graphic-Novels-Comics-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=4390"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ First Second (July 16, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250153719"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250153715"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.18 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.34 x 0.65 x 8.93 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#144,423 in Books (See Top 100 in Books) #237 in Humorous Graphic Novels (Books) #332 in Comic Strips (Books) #624 in Fantasy Graphic Novels (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 3,809 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Adventure Zone: Here There Be Gerblins The Adventure Zone: Murder on the Rockport Limited! The Adventure Zone: Petals to the Metal The Adventure Zone: The Crystal Kingdom The Adventure Zone: The Eleventh Hour Read them all! Book 1 Book 2 Book 3 Book 4 Book 5",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30aa6258-4f9a-4e44-b09a-dbb95840e689.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2b35f0eb-34c7-4c57-841b-51892241e4fc.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8cb5e1a9-dcae-44bd-a541-6e7146c34c80.__CR127,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d367105f-342b-4c7d-99b6-383513e500f6.__CR98,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f3fe1a4e-0d0c-449a-b978-eb26ac4f6d79.__CR92,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61b6cf49-97f8-4aab-895f-5cb931267a94.__CR112,0,798,1595_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c39b3bf2-b6a3-4da1-b56e-55d8f1de756b.__CR112,0,798,1595_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Josh Mauthe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESESBLLG3ZZISQONG5SOAEUGC3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5AWGPADT1JK3?ASIN=1250153719",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2019",
                "reviewTitle": "5.0 out of 5 stars Miraculously, it both captures the spirit of the podcast AND adapts it into its own thing",
                "reviewText": "Last year, The Adventure Zone - an RPG podcast hosted by the McElroy brothers and their dad, and my favorite podcast in the world - made the jump from the audio medium into the world of graphic novels, adapting the first arc of the Balance campaign into the bestselling Here There Be Gerblins. Against all odds, Gerblins was a blast, capturing the goofy spirit of the show while also truly adapting an audio-only, collaborative project into something more streamlined and even coherent. And if there were some little bumps along the way in that adaptation, well, Gerblins was the first arc of the show, and had its own issues, so that was to be expected a bit.Now comes the second volume of the adaptation, Murder on the Rockport Limited, which finds our brave adventurers infiltrating a train under false pretenses and attempting to not only find a missing artifact, but also solve a murder - or should that be murders, plural? - along the way. It was the first arc of the show that was all truly the McElroys, as Griffin (the DM) made his own story and the rest of the crew started to truly get into their characters, resulting in one of the funniest arcs of the show, as well as introducing some iconic characters for the whole series.The graphic novel adaptation of Rockport is every bit as good, embracing both the podcast's jump in quality and the larger sense of the Balance Arc, and finding a great balance between both. While Gerblins occasionally felt like great bits were cut out of the adaptation (understandably, given how tangential they often felt), Rockport feels like it's much more able to retain a lot of the anarchy of the original series, from the ruthless mocking of a wizardly train attendant to the unexpected appearance of a beloved hotel spokesman to the odd dynamic that arises when three grown men bully an adorable young boy. Having just re-listened to Rockport recently, I can say that this adaptation absolutely captures the spirit of the original story, bringing out the humor of the characters and the McElroy sensibility, all while still making it fit more into the larger shape of the Balance campaign saga. (This last component is in some ways the most interesting thing about the book from the perspective of a TAZ fan, as it allows the story to start bringing out the emotional beats that make all the goofs so special, but they're hard to talk about in a spoiler-free review.)I can't tell you how you'll feel about Rockport if you're not already a TAZ fan. Is it accessible to non-fans? Will it make sense if you don't already love this story? Will you appreciate the cavalcade of in-jokes from MBMBaM and TAZ tossed into the background by artist Carey Pietsch? (Okay, definitely not the last one, but trust me, they're there, and only add to the evidence of how great of a choice Pietsch is for this project.) But as a long-time fan of the series, Rockport is a ton of fun to read, bringing the arc to life, but more importantly, capturing the spirit of it all wonderfully, and conveying the fun and silliness - and the stakes! - of what the McElroys created.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Casey W.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUWG2EKI7NXTY2G663KRUSRMO5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IJ1L87JF6PC?ASIN=1250153719",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2020",
                "reviewTitle": "5.0 out of 5 stars It's not the same as the podcast, but that's not a bad thing",
                "reviewText": "I love these comics as a supplement to TAZ. The artwork is funny and often breathtaking, the story is far tighter and easier to follow, and nothing significant feels left out of the volume. Besides, being able to see it is a delight all its own. Clint and Carrie did an excellent job bringing this to life, and while I miss a lot of the banter and hijinks that come from listening to a podcast of close family -- and I have to admit, the times Griffin pops into the narrative and they try to include some of their meta jokes/gaming actually are a detriment to the overall comic, in my opinion -- but it illustrates one of the things that makes TAZ so special:It's not just a funny podcast about 4 idiots playing DnD. I mean, it *is* that, but it's also just a really good story, with some of the most lovable characters of any medium. In some ways, by pulling away some of the jokes the comic lets characters and relationships shine through that get a little lost in the shuffle when you're just listening -- Magnus and Taako, for example, have some particularly sweet moments this 'episode.'I personally wish it was just the Balance Arc told straight, without the meta stuff, because the story's good enough not to need it. I understand why it's kept in there, and it certainly doesn't ruin the story for me; I imagine some fans would hate this if it didn't include Griffin's talking head or mentions of stats. But that does kind of render it difficult to enjoy without already knowing and loving the podcast. I can't picture handing this to someone who hasn't heard the podcast and expecting them to have fun with it and not be a little confused by all the weird asides. It's a great *supplement* to the podcast, but it can't replace it and I personally wish it wouldn't try so hard to have that same podcasty feel.This is a very minor nitpick, all in all; these comics still get 5 stars from me, because they're amazing. But if you've heard of TAZ and are thinking of reading the comics before or instead of listening to the podcast, I'm not sure you're going to enjoy how delightful either of them are unless you start with the original thing.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLM3RPTDKHJYCOGGEHYWFSS66TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SQDGD15Y7M6K?ASIN=1250153719",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2021",
                "reviewTitle": "5.0 out of 5 stars It's great",
                "reviewText": "When reviewing a book, I feel like it's important to qualify what you're reviewing. The shipping was fine, it showed up in great shape, and the book is of fantastic quality, identical to the first volume, Here There Be Gerblins.As a fan of the podcast, I think this is a surprisingly faithful interpretation. The names of things get changed to avoid butting heads with Wizards of the Coast, who own D&D, but in print the whole thing comes across with a very Looney Tunes-like vibe, as if you can feel how the humor is VERY SPECIFIC to the last few years. Some of it may come across as totally intelligible to someone who picks this up to read as someone entirely new to The Adventure Zone. On the contrary, to someone like me who's listened to the whole thing and been to live shows and who has an idea of the expanded canon, there are tons of little details that hint at things from non-campaign episodes of the podcast that the books would never approach in strictly following the story of the campaign, like how Jess the Beheader is seen scowling disapprovingly at a figurine of Jeff Angel in the conductor's room.The whole thing is great, from top to bottom, and if you like the show, you'll like this.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellen Alves",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 11, 2020",
                "reviewTitle": "Love it",
                "reviewText": "I heard the podcast and they did a fenomenal job summarising it all in this book with a gorgeous art!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dimly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 11, 2019",
                "reviewTitle": "Excited for more",
                "reviewText": "I really loved this book, like the first it charges some small elements of the story but it is all in service of making everything more cohesive and adding some good foreshadowing. I’ve listened to the whole podcast, so I won’t spoiler you, but I am so excited about what is to come going forward! I love Carey’s art for this and the range of emotions she is so good at portraying. There is also a section in the back of alternate fanart interpretations of the cast which is such a good touch when the original medium is audio only so the entire fandom has such diverse interpretations of the cast. 10/10, would buy again (and I probably will, I need a physical copy for my shelf)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Seven Birds",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 7, 2020",
                "reviewTitle": "Faithful adaption with amazing artstyle",
                "reviewText": "+Beautiful colors, high quality print+Pietsch is very consistent, the positions and actions of the characters are always clear+The additions to the story (foreshadowing) are amazing+Very clear format, amazing word art- Had a hard time understanding some of the inside jokes as a non-american (but the humour is overall very entertaining)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "keck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on March 17, 2020",
                "reviewTitle": "Absolument génial !",
                "reviewText": "Un petit bijou qui se fait attendre (compter plusieurs semaines pour la livraison en France) mais qui en vaut la peine sans la moindre hésitation ! Dans la continuité du premier tome, vraiment un plaisir à lire autant pour les fans de longues date que pour les petits nouveaux qui ne connaissent pas le podcast !Impatiente de pouvoir découvrir la suite !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on August 8, 2019",
                "reviewTitle": "Excelente, más por favor.",
                "reviewText": "Gran adaptación del podcast, de nuevo vuelven a recoger los mejores momentos y a adaptarlos de forma excelente, me ha gustado tanto que he empezado a escuchar los episodios desde el principio. ¡No puedo esperar a que salga Petals to the Metal!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}