{
    "remaining_requests": 1859,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Heroes-Novel-Harbor-Alan-Gratz/dp/1338736078",
    "body": {
        "name": "Heroes: A Novel of Pearl Harbor",
        "price": "$15.18$15.18",
        "originalPrice": "",
        "rawPrice": 15.18,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Heroes-Novel-Harbor-Alan-Gratz/dp/1338736078",
        "soldBy": {
            "sellerID": "ATI98LKNTU9X8",
            "name": "TTPDC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=ATI98LKNTU9X8"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71-dbyjUj0L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Alan Gratz",
            "link": "https://www.amazon.com/Alan-Gratz/e/B001JRTGEY/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "TTPDC",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 39,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 16 hrs 41 mins",
            "$3.99 delivery February 28 - 29."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Children's Books",
                "link": "https://www.amazon.com/Childrens-Books/b?ie=UTF8&node=4"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Childrens-Books/b?ie=UTF8&node=2966"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Scholastic Press (February 6, 2024)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 272 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1338736078"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1338736076"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 8 - 12 years"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 3 - 7"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.7 x 1.1 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#726 in Books (See Top 100 in Books) #1 in Children's Military Fiction (Books) #1 in Children's 1900s American Historical Fiction #30 in Children's Action & Adventure Books (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 39 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Captain America: The Ghost Army (Original Graphic Novel) Refugee Two Degrees Ground Zero Allies Heroes More from Alan Gratz Award-winning, New York Times bestselling author Alan Gratz merges the worlds of historical fiction and super hero comics in this one-of-a-kind graphic novel that is sure to be met with major enthusiasm from fans of all ages. This action-packed novel tackles topics both timely and timeless: courage, survival, and the quest for home. Fire. Ice. Flood. Three climate disasters. Four kids fighting for their lives. Two kids. One devastating day. Nothing will ever be the same. June 6, 1944: German forces are terrorizing Europe, on their evil quest to conquer the world. The only way to stop them? The biggest, most top-secret operation ever. An inventive and powerful new novel about the attack on Pearl Harbor. This riveting book explores themes of prejudice, power, and what it truly means to be a hero.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d69be984-6121-4577-8bad-b7819d9df14d.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c3b4ffa1-75ec-4a60-84fd-324fac142c31.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1057a400-019c-44fc-b1eb-a21e0485155f.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/568f3216-f3e4-4fa6-a41f-1b2cc0fd2621.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de4644c9-5e44-4a67-903c-439a65a9ffa4.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a500f54b-59fd-4edf-956e-c8a518d80b32.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7fe8e53-d2c9-4571-a15d-668c300a5f3f.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d0a42244-3846-4603-af7f-062fd6f9d9c7.__CR0,0,300,600_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sargjo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLTGW5L6LEQISNCCFL7RTA3C46Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RWBJCVSI0A1C7?ASIN=1338736078",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Another winner",
                "reviewText": "The latest from Alan Gratz is an ideal addition to my middle school library. The story is fast-paced, culturally sensitive, and brings younger readers into the realities of historical events. Many a reader has become a World War II buff after reading an Alan Gratz work and this one is no exception.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jothebookgirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQ7UK5P5GHFONYXLNSGDNOMCLAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RW3BKJY92Y1P?ASIN=1338736078",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars All is peaceful then suddenly torpedoes drop and bullets strafe the lane.",
                "reviewText": "Best friends, Frank and Stanley are motoring their boat back to Ford Island military base where their families are stationed. Both fathers are military pilots. Stanley is Japanese American. Frank is white. The boys love comics and superheros, and are penning a comic book in their heads. Frank has a secret from his past that causes him to be overly cautious about everything confounding his friend. In fact it nearly ruins their relationship when he doesn’t come to Stanley’s aid when he is bullied. Frank’s sister Ginny is hoping to marry Brooks who works on The USS Utah. He invites Frank and Stanley to come aboard and he’ll show them around. The next day dawns beautiful and the boys are on board the boat. When the planes begin to arrive, at first all seems like a routine military drill. Then the whole world falls apart as the torpedoes drop and bullets strafe the land.Most men have just awakened and the artillery guns are covered. It takes a crane to lift the covers. No one is prepared, Hawaii was supposed to be safe. The Utah is one of the first ships hit and as it sinks, Frank and Stanley must abandon ship and swim back to Ford island. Get ready for relentless intense scenes one after another.Though an American citizen, just like Frank, Stanley must face a new reality of racism because of his appearance and Japanese ancestry. The Japanese Americans are literally digging holes in the yard to bury any relic of ancestry.This is such a well penned novel, one I couldn’t put it down and read the whole novel all in one day.Historical, heart pounding, informative, heroes, sad reality",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica at Cracking the Cover",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3DICKCDVG5C6AQQRWRICN7OFSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CF3OATNVAHJ1?ASIN=1338736078",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent",
                "reviewText": "Alan Gratz has a way of bringing history to life that you can’t ignore. From beginning to end, Heroes is a high-stakes read that you won’t want to put down.Gratz takes young readers to the center of action by placing Frank and Stanley on the deck of the battleship Utah when the Japanese start dropping bombs. Seeing the ensuing chaos through their eyes brings an immediacy to the story you couldn’t catch otherwise.With so much going on, it would be easy for readers to get lost, but Gratz deftly shepherds his audience from place to place in a way that makes sense. He removes the confusion for the reader while still conveying that overwhelming feel of mayhem.At the center of it all is a friendship that is built on the love of comic books but is fractured by racism. Frank and Stanley are best buds that are well developed and likeable. They’re easy to root for both during and after the attack. You want them to succeed and you hope for a future where their friendship endures.Heroes ends with an all-original, 10-page black & white comic that brings to life the comic book idea that Frank and Stanley brainstorm in the novel. The comic is written by Alan Gratz and illustrated by Judit Tondora. And it’s a lot of fun to see the ideas realized. Also included is a map of Pearl Harbor on Dec.7, 1941 and an author’s note about WWII, a section about the story, and a discussion of Asian Americans in comics.Heroes is an action-packed read that should appeal to a large cross-section of readers. I read it in one sitting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joanna  Varnum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3JJMV5UJMA7YQZ6XZD7SSAF2QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D2F5SJK9J9N7?ASIN=1338736078",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Excellent MG Historical Fiction as always!",
                "reviewText": "Heroes is one of my most-anticipated Middle Grade releases of 2024, and it did NOT disappoint! Alan Gratz is the GOAT when it comes to Middle Grade Historical Fiction, and I know that my students (and my sons) are going to absolutely love this book. I’ve preordered two copies already - one for my school library and one for our home!Frank is a Navy kid stationed with his family at Pearl Harbor who struggles with debilitating anxiety after a traumatic childhood experience (yay for a mention of my hometown of Pensacola, even if it involves some trauma!). His neighbor and best friend, Stanley, is also a Navy kid but is Japanese-American. Together they share a love of comics and a dream of creating their own in the future. On the day that lives in infamy, they find themselves caught right in the middle of the Pearl Harbor attack and must confront their own fears and biases, as well as the biases of others, in order to make it through the disaster.Gratz is SO GOOD at taking historical events and making them read like thought-provoking action movies with incredible themes and characters. The action starts quickly and doesn’t let up through the book, and yet the author expertly weaves in anxiety representation, death and loss, racism, propaganda, and even tackles lack of Asian-American representation in superhero culture. What’s really incredible is that these themes are incorporated seamlessly into the story so that at no point does it feel that the reader is being preached or condescended to.This book is fast-paced and action-packed, so don’t be surprised if a student devours it in a day or two. There’s also a great comic at the end of the book that gives the reader a glimpse of what happens to Frank and Stanley after the events of Pearl Harbor. I loved it from start to finish, and I know lots of other readers will as well!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$9.19",
                "sellerName": "baileycobooks",
                "sellerRating": "5"
            },
            {
                "price": "$15.18",
                "sellerName": "Spyglass LLC",
                "sellerRating": "5"
            }
        ]
    }
}