{
    "remaining_requests": 1995,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Fallen-Out-McDermitt-Caribbean-Adventure-ebook/dp/B07NJCWXRL",
    "body": {
        "name": "Fallen Out: A Jesse McDermitt Novel (Caribbean Adventure Series Book 1)",
        "price": "$2.99",
        "originalPrice": "",
        "rawPrice": 2.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Fallen-Out-McDermitt-Caribbean-Adventure-ebook/dp/B07NJCWXRL",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81XNW8NCdWL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Wayne Stinnett",
            "link": "https://www.amazon.com/Wayne-Stinnett/e/B00G1PVHNC/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 14314,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "When Jesse McDermitt leaves the Marine Corps, he has no plans in place for the rest of his life. His greatest skill is neutralizing the enemy from up to a mile away, but there are few opportunities in the civilian world for a warrior. He only knows he doesn't want to spend the coming winter wearing a heavy coat and boots.Jesse knows his way around boats and has an old friend in the Florida Keys, living day to day in paradise. Being an experienced diver and angler, Jesse immediately heads south toward the end of the road in Key West, a long dormant dream in his thoughts. With the help of friends, new and old, and a bulging bank account, Jesse finds just the right boat to not only live on, but soon uses to start a “very part-time” charter business. Things go smoothly until a barefoot Carolina girl, a Cat-5 hurricane, and a human trafficker all conspire against him at the same time.Danger lurks in the sparkling waters off the sleepy little town of Marathon, in the heart of the Florida Keys, as well as in the dark, murky waters of the Everglades. But danger doesn't expect to run into someone like Jesse McDermitt—a man who will not only respond swiftly in facing it, but with overwhelming force. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07NJCWXRL"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Down Island Press; 2nd edition (February 7, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 7, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3235 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 262 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#41,854 in Kindle Store (See Top 100 in Kindle Store) #195 in Sea Adventures Fiction (Kindle Store) #340 in Mystery Action Fiction (Kindle Store) #420 in Vigilante Justice Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 14,314 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "scott tucker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYNCT3DDUSQIIGAIR724OIT5VPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KM867M7H01WH?ASIN=B07NJCWXRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Page turner",
                "reviewText": "Very entertaining read. I enjoyed the characters and the stories. Hard to put this book down! A real page turner.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee Gimenez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP3RQPENFI66V6LO34NFITUAIBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUF79A81M1KIQ?ASIN=B07NJCWXRL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "4.0 out of 5 stars Fallen Out is a well written mystery novel.",
                "reviewText": "Fallen Out is a well written mystery novel. The main character in the book, Jesse McDermitt, is great. I enjoyed reading about him and his exploits. The story begins when Jesse retires from the Marines and moves to Florida to set up a charter fishing business. He also becomes a private investigator. Good plot development and supporting cast of characters. I will be sure to read other novels about Jesse McDermitt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mountain woman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLLW3622CPBHW3WKKJBKYD363UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO2PYIZF0XCQM?ASIN=B07NJCWXRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Jesse’s beginning!",
                "reviewText": "This is a fun book, especially if you are a Jesse McDermitt fan already. It fills us in on how his early life was and how he came to be a boat captain. I love these stories of Mr Stinnett’s and the different characters. This is a perfect first read if you haven’t experienced Jesse before. I highly recommend this book for everyone.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMELVT3A5KOZ6HMMZBWCV555J3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R371T9SLCRPNTF?ASIN=B07NJCWXRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars definitely worth the read",
                "reviewText": "This was an easy read. One or two settings I definitely recommend it. The characters are likable the writing style is fluid and easy and descriptive. You won’t go wrong with this book. I’m moving onto book number two I believe there were 26 books in the series.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Lang",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFB5E3ELJZAMXMDJ2DB3BMVIRZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z67NPR2TXN?ASIN=B07NJCWXRL",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 23, 2021",
                "reviewTitle": "3.0 out of 5 stars Book one or book twenty one?",
                "reviewText": "Fa!!en Out was originally written as a prequel after Stinnett had published three volumes of his Jesse McDermot stories, essentially to answer questions from his readers. With this release he's gone back and cleaned up the original, he says. Even added an entire chapter, he says. Having read the first version at least twice, however, I'm not so sure of what he's done. It raises a question worth considering.When is a \"version 2.0\" really necessary? IS one really needed by the readers? There's another author I've read who has been rewriting the five books that made up one of his series, and now this. What's the point? It sides smells like an attempt to lure readers to essentially repurchase work we already have. Except for cash flow, however, I don't get it.Look, I enjoyed revisiting Jesse's history. I mean, I like the character enough to have all the books. A retired Marine sniper turned charter boardwalk in the Florida Keys, imbued with a strong moral streak and willing to take justice into his own hands, he's a good hero for today. The cast of characters are rich, the issues that arise are handled, and then it's time for the next book.One is t gain any new insight in the character. I wasn't blown away by brilliant new language. Frankly, when I finished I felt that I'd been had. If you want a.fine origin story for a good character, by all means. If, on the other hand, you are a long time reader, there's nothing new here. Please don't do this again, sir. Each book is done and published, and once it's out in the world there's no need to rewrite things for your readers. Move on and give us new material.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jimmy Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE232OOVTM6DTRJ74RYKETLOU2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DWEG9GGZ4DIP?ASIN=B07NJCWXRL",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2019",
                "reviewTitle": "4.0 out of 5 stars A good opening book to a series about the Florida Keys and the Ocean",
                "reviewText": "This is the first of Wayne Stinnett’s “Fallen” series. It is a good start. The story concerns 37 year old Jesse McDermitt, who is a 20 year veteran of the Marine Corp. He had worked himself up from a grunt to being an elite sniper and eventually a sniper instructor. However, after 20 years, it was time for him to retire and begin the next chapter of his life.His life as a warrior had taken its toll on his home life. With each deployment he became further and further removed from his wife and two girls. Eventually she just divorced him, moved away with his kids, and poisoned their memories of him with stories and depictions of him being a “Killer”.He retires, going through a nice description of the ceremonies involved, and goes with one duffle bag and a rented car to visit an old friend and compatriot named James “Rusty” Thurman, owner now of the “Rusty Anchor Bar and Grill”. Jesse had called down before driving there, and Rusty told him that people in the Keys don’t get a job, they “hustle”. He told him to “get his ass down here, and we’ll figure out what kind of hustle you are good for!”Jesse meets Rusty’s daughter, surprised to see how she has grown up to be a nicely formed young woman. He buys an old beat up truck for land transportation. He meets a young man named Jimmy, who he initially finds smoking a joint, but who ends up being an indispensable First Mate. He goes to Miami with Jimmy and, using a sizable bank roll that he gathered by way of inheritance and investments from the 20-year stint in the Marine Corp., buys a boat he plans to use for fishing and dive charters.Due to Jimmy’s expertise in computers and computer graphics, they quickly develop a niche clientele with the dive groups, particularly with the divers who are interested in underwater photography. Things in the charter business go well.The conflict in the book comes in the form of four drunken jerks that are taking liberties with two good looking women that were drunk themselves. The first incident ends in the four being beaten badly by Jesse and some of his friends. When the cops investigate Jesse is left out of it, and the men are arrested and taken by the cops to jail.The second comes in the preparation and stowage of Jesse’s boat and an additional boat that goes up into a river and Mangrove swamp to get out of the worst effects of a hurricane. I personally had a father-in-law that was a shrimper, and his boat was moored on the Mississippi Delta, so just from the stories he told about doing this very thing I know that the episode in the book is very accurate.The same four men were close by riding out the storm themselves, and after recognizing Jesse and his boat they decide to attack them. Jesse of course realized that first, and he and his friend get the jump on them instead. After the confrontation, they overwhelm the men, disable them and leave them stranded on a sandbar before the hurricane hits full force. In the process, they investigate the boat of the bad guys and realize they were Pirates and Sex Slavers. They find a mother and her daughter kidnapped in the hold and release them. The Coast Guard is called in, and the Pirates are arrested. The leader of the Pirates, a man named Earl, promises revenge on Jesse.Earl does in fact escape during transfer. The rest of the book details Jesse’s actions going on the offensive to catch and kill Earl.The characters in the book are good, the storyline is credible, and the action is very good. However, I was reminded of Hemingway while reading this book. I’m sure the author would not be mad at me for saying his writing reminded me of Hemingway, but what I mean by that is in both cases the description of the surroundings and the day to day goings on are so excessive that the action suffers. And as I said before, his action is very good!This may be a fault of my own, as I will admit I would rather watch an Arnold Schwarzenegger movie than an Academy Award winner. But for this reason, I give this a 4 out of 5. I wish I could give it a 4.9 out of 5, as this is a minor point and will not keep me from reading the rest of the series.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Todd Douglas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3RYDHVS7RBB6ZQ4JJDPDOCZ6AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCUVLFX5IJO21?ASIN=B07NJCWXRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Found a new friend to follow via this story",
                "reviewText": "I always love finding a new writer who tells a great story that moves at a comfortable pace and teaches me things along the way. I like a tough main character who also has a soft spot for the unfortunate. I enjoyed this experience in the Florida Keys. Thanks to Wayne Stinnett for providing me a new action hero. This will not disappoint.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "radtate",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNB7RGSMZITV64TMNPO2ZYLLNYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OI5D38T9H9DL?ASIN=B07NJCWXRL",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2023",
                "reviewTitle": "5.0 out of 5 stars A good book",
                "reviewText": "A story about a real man making his way after serving in the Marines. He is quick to help or defend those he cares about or those who have need of his help. Values we need more of these days, but without being preachy. Enough action intertwined with good characters, and a bit of useful knowledge too. Looking forward to the next book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ron matsu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 18, 2022",
                "reviewTitle": "A Laid Back Life on the Keys !",
                "reviewText": "Life was good for Jesse as he started the next chapter in his life. But when kidnapping and murder disrupts his new career as charter boat Captain his old marine training and sense of justice reappears and he has a new mission. An uncomplicated novel great for reading at the beach.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve Costello",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 22, 2023",
                "reviewTitle": "Great stories, great characters",
                "reviewText": "Have pretty much read the whole series, and some of the spin offs, great characters really engage the reader",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MajorDad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 14, 2016",
                "reviewTitle": "Good story.",
                "reviewText": "Well crafted with a good plot line. McDermitt probably a little larger than life and while I have known a couple of soldiers like that, McDermitt is more of a montage of a lot of good guys rolled into one. However, the character balances well and is plausible. I like the setting for the book and the associated characters compliment each other well. The thing that I liked about the story was that it unfolded in a natural progression with a sense of reality. I look forward to reading more by this author. If you want a knock down, shoot it out character that is unbelievable then this story is not for you. If you want an honest believable story with a military background then enjoy this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ikebana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on September 17, 2016",
                "reviewTitle": "Great Plot",
                "reviewText": "Really enjoyed this well-written short novel set in the Florida Keys. The plot was interesting and fast-paced. Will probably look at other books by the author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 12, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "A typical Jesse McDermitt thriller, full of action and lot of lovable characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}