{
    "remaining_requests": 1811,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sourdough-Robin-Sloan-audiobook/dp/B073JZNP18",
    "body": {
        "name": "Sourdough: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sourdough-Robin-Sloan-audiobook/dp/B073JZNP18",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 sx5sqmwL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Robin Sloan",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Robin+Sloan"
        },
        "brand": "Robin Sloan",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 5347,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From Robin Sloan, the New York Times bestselling author of Mr. Penumbra’s 24-Hour Bookstore, comes Sourdough, \"a perfect parable for our times\" (San Francisco Magazine): a delicious and funny novel about an overworked and under-socialized software engineer discovering a calling and a community as a baker.Named One of the Best Books of the Year by NPR, the San Francisco Chronicle, and Southern Living Lois Clary is a software engineer at General Dexterity, a San Francisco robotics company with world-changing ambitions. She codes all day and collapses at night, her human contact limited to the two brothers who run the neighborhood hole-in-the-wall from which she orders dinner every evening. Then, disaster! Visa issues. The brothers quickly close up shop. But they have one last delivery for Lois: their culture, the sourdough starter used to bake their bread. She must keep it alive, they tell her—feed it daily, play it music, and learn to bake with it. Lois is no baker, but she could use a roommate, even if it is a needy colony of microorganisms. Soon, not only is she eating her own homemade bread, she’s providing loaves to the General Dexterity cafeteria every day. Then the company chef urges her to take her product to the farmer’s market—and a whole new world opens up. Includes bonus material that provides an audiobook-only glimpse at the evolving relationship between Lois and Slurry, the company upon whose dystopian meal replacements she and her engineer friends all subsist. \"Robin Sloan's second novel is an entertaining concoction of probiotic and high-tech ingredients...This is a funny, effervescent book told in the first person and given full range by Therese Plummer, whose youthful voice captures the matter-of-fact nature of Lois's unjaded, scientific temperament and the dizzying ups and downs of her spirits.\" — The Washington Post \"Therese Plummer, veteran narrator of more than 300 audiobooks, brings a delightfully loopy creativity to the delightfully loopy novel...\" — Chicago Tribune Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Science Fiction & Fantasy",
                "link": "https://www.amazon.com/Science-Fiction-Fantasy-Books/b?ie=UTF8&node=25"
            },
            {
                "name": "Fantasy",
                "link": "https://www.amazon.com/Fantasy-Science-Fiction-Books/b?ie=UTF8&node=16190"
            },
            {
                "name": "Magical Realism",
                "link": "https://www.amazon.com/Magical-Realism/b?ie=UTF8&node=9045831011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "6 hours and 47 minutes"
            },
            {
                "name": "Author",
                "value": "Robin Sloan"
            },
            {
                "name": "Narrator",
                "value": "Thérèse Plummer"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 05, 2017"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B073JZNP18"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#28,763 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #102 in Magical Realism Fiction #816 in Magical Realism #1,130 in Literary Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Norm Zurawski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3W42PCY64XYTSQTFVLFHPQWHLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LQKCKZJSHGJG?ASIN=B073JZNP18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book, great author, looking forward to more.",
                "reviewText": "Robin Sloan is really good. He doesn't write enough books. I hope he changes this soon enough.In a day & age where every NYT fiction best seller (and sone less than best sellers) travel down a journey of \"woe is me here is my story,\" Sloan writes stories that are stories in & of themselves. Much like Frederick Backman, he writes fiction that is alive, that makes you feel good about yourself, and life in general. This is not to say that all of Sloan's works are without conflict in some way. But the stories are a capsule of why life is fun & interesting.I read the Penumbra book almost 3 years ago, and bought this shortly after. I saved it for a long time for reasons I cannot quite put my finger on. I often do this, thinking that a book with these expectations is like a fine wine that should be opened on a special occasion. This was not a special occasion, I just felt it was time to revisit. And it lived up to that expectation.Normally I am surprised at the Amazon rating system and that every hunk of trash printer is 4.5 or more stars. Oddly, this one is only 4 stars. I guess in the indulgent NYT-fiction world we live in, there isn't enough post-apocalyptic angst to sustain a year's worth of therapy sessions? I really don't know. This is a well-written, easy to relate to book about a quirky series of life choices. I am not talking about major life choices here (ok, the job thing can be). We're talking about baking bread.I often find men who write female characters really off the mark, but that is not the case here. While not a woman, I can see where a narrative might be cringe-worth, which this is not. It's a journey, a fun journey, where you root for the protagonist from the first to the last page. I think it is worth mentioning that a good portion of books written these days have absolutely abysmal protagonists. How does this fly anymore? How can you read a book that has a main character that is a jerk?Not the case here. The main character and everything around that character is nice, enjoyable. The story is also enjoyable. The last few chapters are quirky and out of left field, but totally in line with what you would expect of the author. I look forward to more works y Sloan, and will pick up the short works as I wait.Great book, great author, looking forward to more.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KasaC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLJ7GWIA6KYU5X47DCVLFQHTKGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R46V7AP79GDDX?ASIN=B073JZNP18",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2017",
                "reviewTitle": "4.0 out of 5 stars Take me to the Marrow Fair",
                "reviewText": "Lois, a recent transplant from Michigan to the Bay Area, works in the tech industry, and finds her life transformed when she orders delivered spicy soup and sourdough bread from two mysterious brothers. That is the basic story line, but as anyone familiar with Robin Sloan's Mr. Penumbra's 24-hour Bookstore knows, he has more up his sleeve. Being familiar with the San Francisco landscape Lois inhabits, I was immediately charmed and delighted by the story, skewers pinning the \"food as porn\" (per Anthony Bourdain) culture, and in particular, one hilarious portrait of a self-satisfied doyen of the Berkeley food scene. I also loved the idea that there were Lois Clubs worldwide consisting of women whose only ticket to join was that they be named Lois (when she arrives, one Lois is surprised that they were \"still making Loises.\")When the brothers find themselves having to leave precipitously, they present Lois with a gift, a rather high maintenance sourdough starter, tall order for someone who grew up on McDonalds Happy Meals. But the starter has a will of its own, and as it inspires her to learn to bake ethereal loaves, the story really takes off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa Shafer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7ZKVIQK66Z5RLYKH27VLSPKKRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI1ODEW733DNZ?ASIN=B073JZNP18",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 15, 2021",
                "reviewTitle": "3.0 out of 5 stars Meh.",
                "reviewText": "I absolutely ADORED Mr. Penumbra's 24-Hour Bookstore, so I had great hopes for Sourdough, but I was left disappointed.It began fine. We have the Alice/Lois parallels, the underworld market/Wonderland down the rabbit hole; we have a yellow tape road leading to an Oz-like televised, not-quite-real talking leader (although the Billy Bass still life touch is a great moment of humor.But.But the romance really is totally unrealistic this time as a side plot (she's seen the guy ONE TIME), and Lois' character development is the only real plot. She simply finds there's more to life than coding and that she's happier if she interacts with other people. OK. But it's hardly Penumbra.And the climax and denouement are dull; Lois is never in any real danger (physical or otherwise), so there's no tension. It's just all so very bland, even down to the \"new\" sourdough starter for which she settles.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHARP57TTVMLHNFJ4Z4QI4YNLQWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RNQ1OMXW22TM?ASIN=B073JZNP18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Enjoyable Read",
                "reviewText": "An enjoyable read, perhaps.colored by my enjoyment of the bashing of the Silicon Valley overwork ethic. Enjoyed the references to familiar Bay Area haunts.The importance of good food, artisan foods, for health and enjoyment of life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7PLA5NUXCWUIBT43JKFVQWNXSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W6VOHD98613E?ASIN=B073JZNP18",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2018",
                "reviewTitle": "4.0 out of 5 stars Loved the first half... the second? Not so much. But you're gonna want sourdough",
                "reviewText": "Beware: You're gonna want to go out and buy yourself a good loaf of sourdough bread after reading this book!I was a big fan of Mr. Penumbra's 24-Hour Bookstore, so when I found this one, I was excited. I knew it was going to be unlike any other novel out there. That is true, it is a truly unique story. It is intelligently written, not dumbing down anything for the reader. I loved the first half of the book, quickly became invested in following Lois' journey with the starter into sourdough expertise. Her commitment to her new craft is intriguing and I was rooting for her. But the story started to lose me when she joined the Marrow Fair and the world of the underground. It turned dark (no pun intended) and started to grow a little far out there for me, just like the starter did. I didn't like those characters as much and the whole thing just felt shady. I'd give this one a 3 1/2 stars if I could, but a 4 works since it is so well written. The Lois Club scenes were fun though! I'll still be on the lookout for the next novel and in the meantime will reread Mr. Penumbra.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH27WFBAZ5IN7SZKFYM2DC2P6SOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJBC4P9GXF323?ASIN=B073JZNP18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2023",
                "reviewTitle": "5.0 out of 5 stars SF based food mystery",
                "reviewText": "What I like about this book is it's different. Kind of a mystery, kind of a beach read. Takes place in San Francisco and I found myself getting sucked in to the mystery just as the main character does.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL4UH2N4A6DL4CNEYHRDGMIGUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EWGOT11WXXDD?ASIN=B073JZNP18",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2022",
                "reviewTitle": "4.0 out of 5 stars Fun book",
                "reviewText": "A cool story with a good amount of fun and excitement without being too overbearing. I thought the ending and the last act were a little weak, but perfect for anyone somewhere between tech and nature.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cecilie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6DN35C3RW3PRCV37ZIOP7VWZLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RH8357YUNLWS7?ASIN=B073JZNP18",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Top 5 favorite novels",
                "reviewText": "I work in tech and I love reading fiction novels about life in the tech industry. This book nourished my soul like a hot stew with warm bread on a cold day :) I've read it twice and am looking forward to the third.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 8, 2022",
                "reviewTitle": "Thoroughly enjoyable!",
                "reviewText": "I really enjoyed this book. It had a hopeful feel to it, like all things are still possible if you have the will and open mind to embrace the prospects. The characters were also fun and colorful. I wish I worked with someone like Horace! We'd get along very well. Lois was quite interesting. i really enjoyed her character and how she developed into the strong and fearless person that she knew deep down was always inside her. Imaginative books with a 'what if' perspective always spark good vibes. I enjoyed this book as I did Mr. Penumbra's 24 Hour Bookstore. Looking forward to Robin Sloan's next book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manikarnika",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 29, 2021",
                "reviewTitle": "Like having sourdough and hot soup after a long day at work",
                "reviewText": "Great read. The whole story has a really interesting vibe. White it’s set in the practical everyday world, there is a sense of otherworldliness lurking just around the corner. Loved the ending too. To me this book feels just like a bowl of hot soup and sourdough - wholesome, filling and tasty. Looking forward to new works by the author😍",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauricio S Jardini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 27, 2018",
                "reviewTitle": "Fantastic",
                "reviewText": "it's not about bread. it's about a war inside the dough starter. you will not be able to stop reading. Robin Sloan did it again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alex",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 8, 2018",
                "reviewTitle": "If I could buy it again, I would!",
                "reviewText": "I first came across Robin Sloan when I read Mr Penumbra's Bookstore last years, then I read the prequel - Ajax Penumbra. Then when I found this was on promotion for 99p I was delighted.This was a thoroughly enjoyable book. It had all the sass, all the beauty and all the vivid imagery of San Francisco. It had the encroachingly uncomfortable technology industry. It had the incomer protagonist who was incredibly relatable, like in Penumbra. It had some really clever devices to tie together all these people. Then it had the Mazg tribe who are a soulful group, always on the move and who are close to food and music and all the best things in life. It just made me feel warm and fuzzy inside.It's a clever book, it's an intelligent book, it was just totally magnificent. If I could buy it again on Kindle I would. It's worth the full price £4.99, probably more. If I could buy it again I would.What am I on?Sourdough, obviously.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jenia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 24, 2018",
                "reviewTitle": "Short, charming, hopeful book!",
                "reviewText": "Robin Sloan’s Sourdough is a short, charming book that’s just the sort of thing to cheer you up on a bad day.Lois is a software engineer who’s recently moved to San Francisco to work in a high-end, high-tech robotics company. The lifestyle the company demands of her is stressful and the only thing that keeps Lois sane is her favourite sandwich shop. Then the owners run into visa problems and the shop closes up. But before the owners leave, they give her their starter to make her own delicious sourdough bread (a starter being the combo of flour, water, and wild yeast; you use small bits of it to “start” making bread). As Lois slowly switches her attention to baking, she realises there’s a lot more to her starter than meets the eye…This book is a cross between magic realism, low-key sci-fi, and slice-of-life. There’s a mystery to the sourdough (for one, upon baking the dough a face is formed on the crust of the bread). There’s a mystery to the shop owners’ culture (the ever-wandering Mazg). And there’s a mystery to the underground farmer’s market that Lois becomes involved in (who are heavily involved in technologically-augmented food).But at the heart of it all is just Lois, fresh out of college, overwhelmed and craving that tiny bit of old-fashioned in her hyper modern life. Sourdough definitely has some interesting things to say about the (perhaps inevitable?) combination of food and technology. But it’s the connection to something traditional that stuck out to me. Maybe because it’s something that’s helped me too, although I picked up crocheting instead. Lois’ discovery of a whole new “subculture” revolving around baking reminded me of finding about “Stitch ‘n’ Bitch” knitting/crocheting meet-ups, and her feelings of satisfaction at producing something tangible echoed my own. The book ended up feeling almost painfully real for me. (This also really helps ground the pretty crazy “slightly shady, intense, sci-fi farmer’s market” plot.)Altogether, whether you’ve ever felt the urge to pick up an old-fashioned craft or not, Sourdough is a book I’d recommend to anyone who just wants to read something quiet and hopeful.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}