{
    "remaining_requests": 1818,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Adventures-Augie-March-Penguin-Classics/dp/0143039571",
    "body": {
        "name": "The Adventures of Augie March (Penguin Classics)",
        "price": "$14.89$14.89",
        "originalPrice": "",
        "rawPrice": 14.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Adventures-Augie-March-Penguin-Classics/dp/0143039571",
        "soldBy": {
            "sellerID": "A1II99X94Y85PU",
            "name": "Ryan's Online Outlet",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1II99X94Y85PU&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/51Rh26VzkTL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Saul Bellow",
            "link": "https://www.amazon.com/Saul-Bellow/e/B000APTGKK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ryan's Online Outlet",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 788,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review By the Winner of the Nobel Prize in LiteratureWinner of the National Book Award in Fiction“[Bellow’s] body of work is more capacious of imagination and language than anyone else’s…If there’s a candidate for the Great American Novel, I think this is it.” –Salman Rushdie, The Sunday Times (London) About the Author Saul Bellow was praised for his vision, his ear for detail, his humor, and the masterful artistry of his prose. Born of Russian Jewish parents in Lachine, Quebec in 1915, he was raised in Chicago. He received his Bachelor's degree from Northwestern University in 1937, with honors in sociology and anthropology, and did graduate work at the University of Wisconsin. During the Second World War he served in the Merchant Marines.His first two novels, Dangling Man (1944) and The Victim (1947) are penetrating, Kafka-like psychological studies. In 1948 he was awarded a Guggenheim Fellowship and spent two years in Paris and traveling in Europe, where he began his picaresque novel The Adventures of Augie March, which went on to win the National Book Award for fiction in 1954. His later books of fiction include Seize the Day (1956); Henderson the Rain King (1959); Mosby's Memoirs and Other Stories (1968); Mr. Sammler's Planet (1970); Humboldt's Gift (1975), which won the Pulitzer Prize; The Dean's December (1982); More Die of Heartbreak (1987); Theft (1988); The Bellarosa Connection (1989);The Actual (1996); Ravelstein (2000); and, most recently, Collected Stories(2001). Bellow has also produced a prolific amount of non-fiction, collected in To Jerusalem and Back, a personal and literary record of his sojourn in Israel during several months in 1975, and It All Adds Up, a collection of memoirs and essays.Bellow's many awards include the International Literary Prize for Herzog, for which he became the first American to receive the prize; the Croix de Chevalier des Arts et Lettres, the highest literary distinction awarded by France to non-citizens; the B'nai B'rith Jewish Heritage Award for \"excellence in Jewish Literature\"; and America's Democratic Legacy Award of the Anti-Defamation League of B'nai B'rith, the first time this award has been made to a literary personage. In 1976 Bellow was awarded the Nobel Prize for Literature \"for the human understanding and subtle analysis of contemporary culture that are combined in his work.\" Excerpt. © Reprinted by permission. All rights reserved. Excerpt from the Introduction by Martin AmisThe Adventures of Augie March is the Great American Novel. Search no further. All the trails went cold forty-two years ago. The quest did what quests very rarely do: it ended. But what was that quest, anyway - itself so essentially American? No literary masterpiece or federal epic is mentioned in the Constitution, as one of the privileges and treats actually guaranteed to the populace, along with things like liberty and life and the right to bear computerized machineguns. Still, it is easy enough to imagine how such an aspiration might have developed. As its culture was evolving, and as cultural self-consciousness dawned, America found itself to be a youthful, vast and various land, peopled by non-Americans. So how about this place? Was it a continental holding-camp of Greeks, Jews, Brits, Italians, Scandinavians and Lithuanians, together with the remaining Amerindians from ice-age Mongolia? Or was it a nation, with an identity-with a soul? Who could begin to give the answer? Among such diversity, who could crystallize the American experience? Like most quests, the quest for the Great American Novel seemed destined to be endless. You won't find that mythical beast, that holy grail, that earthly Eden-though you have to keep looking. As with the pursuit of happiness, the pursuit was the thing; you were never going to catch up. It was very American to insist on having a Great American Novel, thus rounding off all the other benefits Americans enjoy. Nobody has ever worried about the Great French Novel or the Great Russian Novel (though it is entirely intelligible that there should be some cautious talk about the Great Australian Novel). Trying to find the Great American novel, rolling up your sleeves and trying to write it: this was American. And so it would go on, for ever, just as literature never progresses or improves but simply evolves and provides the model. The Great American Novel was a chimera; this mythical beast was a pig with wings. Miraculously, however, and uncovenantedly, Saul Bellow brought the animal home. Bellow sorted it. He dedicated the book to his father and published it in 1953 and then settled down to write Seize the Day. Literary criticism, as normally practised, will tend to get in the way of a novel like Augie March. Shaped (loosely) as an odyssey, and well stocked with (unsystematic) erudition — with invocations and incantations — the book is very vulnerable to the kind of glossarial jigsaw-solver who must find form: pattern, decor, lamination, colour-scheme. But that isn't how the novel works on you. Books are partly about life, and partly about other books. Some books are largely about other books, and spawn yet other books. Augie March is all about life: it brings you up against the dead-end of life. Bellow's third novel, following the somewhat straitened performances of Dangling Man and The Victim, is above all free — without inhibition. An epic about the so-called ordinary, it is a marvel of remorseless spontaneity. As a critic, therefore, you feel no urge to interpose yourself. Your job is to work your way round to the bits you want to quote. You are a guide in a gallery where the signs say Silence Please; you are shepherding your group from spectacle to spectacle - awed, humbled, and trying, so far as possible, to keep your mouth shut.*A brief outline. The Adventures of Augie March is about the formation of an identity, of a soul — that of a parentless and penniless boy growing up in pre- and post-Depression Chicago.Augie's mother is 'simple-minded' and so is his younger brother Georgie, who 'was born an idiot'. Simon, his older brother, is hard-headed; and Simon is all he's got. The domestic configuration is established early on, with typical pathos and truthfulness: Never but at such times, by necessity, was my father mentioned. I claimed to remember him; Simon denied that I did, and Simon was right. I liked to imagine it. 'He wore a uniform,'I said. 'SureI remember.H e was a solider.' 'Like hell he was. You don't know anything about it.' 'Maybe a sailor.' 'Like hell. He drove a truck for Hall Brothers laundry on Marshfield, that's what he did. I said he used to wear a uniform. Monkey sees, monkey does; monkey hears, monkey says.'His mother sewed buttonholes at a coat factory in a Wells Street loft and his father was a laundry driver; and Augie is simply 'the byblow of a traveling man'. What comes across in these early pages- the novel's first act - is the depth of the human divide between the hard and the soft. The home, with its closed circle, tries to be soft. The outside world is all hard - isn't it? (It certainly looks hard.) Georgie is soft. He puts 'his underlip forward' in search of a kiss, 'chaste, lummoxy, caressing, gentle and diligent'. Given his chicken gizzard at noon, he 'blew at the ridgy thing more to cherish than to cool it'. Later, Georgie sits at the kitchen table 'with one foot stepping on the other' while his grim future is grimly discussed. This leads to the famously unbearable scene where Augie accompanies his brother to the institution:We were about an hour getting to the Home- wired windows, dogproof cyclone fence, asphalt yard, great gloom . . . We were allowed to go up to the dormitory with him, where other kids stood around under the radiator high on the wall and watched us. Mama took off Georgie's coat and the manly hat, and in his shirt of large buttons, with whitish head and big white, chill fingers- it was troubling they were so man-sized - he kept by me beside the bed while I again showed him the simple little stunt of the satchel lock. But I failed to distract him from the terror of the place and of boys like himself around- he had never met such before. And now he realized that we would leave him and he began to do with his soul, that is, to let out his moan, worse for us than tears, though many grades below the pitch of weeping. Then Mama slumped down and gave in utterly. It was when she had the bristles of his special head between her hands and was kissing him that she began to cry. When I started after a while to draw her away he tried to follow. I cried also. I took him back to the bed and said, 'Sit here.' So he sat and moaned. We went down to the car stop and stood waiting by the black, humming pole for the trolley to come back from city limits. Mama, too, simple, abandoned, a fool for love, is soft. As with Georgie, when Augie evokes his mother he accords her the beauty and mystery of a child. Family disruptions (of which there are many) frighten her: 'she was upright in her posture and like waiting for the grief to come to a stop; as if this stop would be called by a conductor'. But her distress is also adult, intimidating, unreachable. In the days after the decision is made to commit Georgie, Mamamade no fuss or noise nor was seen weeping, but in an extreme and terrible way seemed to be watching out the kitchen window, until you came close and saw the tear-strengthened color of her green eyes and of her pink face, her gap-toothed mouth . . . she lay herself dumbly on the outcome of forces, without any work of mind . . .In Augie's childhood world, with its hesitancy and its peeled senses, it is as if everybody is too delicate to be touched. Too soft, or too hard - like Simon. Simon is Augie's parallel self: the road not travelled. All Simon ever does is set himself the task of becoming a high-grade American barbarian; but on the page he becomes a figure of Shakespearian solidity, rendered with Dickensian force. And there is a kind of supercharged logic here. To the younger brother, the older brother fills the sky, and will assume these unholy dimensions. Simon sweats and fumes over the novel. Even when he is absent he is always there. Parentless and penniless: the basic human material. Penniless, Augie needs employment. If the novels of another great Chicagoan, Theodore Dreiser, sometimes feel like a long succession of job interviews, then Augie March often resembles a surrealist catalogue of apprenticeships. During the course of the novel Augie becomes (in order) a handbill-distributor, a paperboy, a dimcstorc packer, a news-vendor, a Christmas extra in a toy department, a flower-deliverer, a butler, a shoesalesman, a saddle-shop floorwalker, a hawker of rubberized paint, a dog-washer, a book-swiper, a coalyard helper, a housing surveyor, a union organizer, an animal-trainer, a gambler, a literary researcher, a salesman of business machines, a sailor, and a middleman of a war profiteer. As late as page 218 Augie is still poring over magazines in search of 'vocational hints'. 'All the influences were waiting for me. I was born, and there they were to form me . . . ' Malleable and protean, 'easily appealed to', busy 'trying things on', Augie is a natural protege, willing prey for the nearest 'reality instructor': would-be 'big personalities, destiny molders, and heavy-water brains, Machiavellis and wizard evildoers, big-wheels and imposersupon, absolutists'. First there is Grandma Lausch (no relation), the old widow who directs and manipulates the March family with the power-crazed detachment of a eugenicist. 'Her eyes whitely contemptuous, with a terrible little naked yawn of her gums, suck-cheeked with unspoken comment', Grandma Lausch is definitely of the hardness party. But she is old-world, Odessan, 'Eastern'; and Augie's subsequent mentors are embodiments of specifically American strategies and visions, as their names suggest: Mr Einhorn, Dingbat, Mrs Renling, Joe Gorman, Manny Padilla, Clem Tambow, Kayo Obermark, Robey, Mintouchian, Basteshaw (and Simon. Always Simon). With each of these small-cap 'universalists'- who believe that wherever they happen to be standing 'the principal laws [are] underfoot' - Augie goes a certain distance until he finds himself 'in the end zone' of his adaptability. Then he breaks free. So what are all these roles and models, these outfits and uniforms, these performances? Augie is on a journey, but he isn't going anywhere.I f he has a destination, it is simply a stop called Full Consciousness.I n a sense, Augie is heading to the point where he will become the author of his own story. He will not necessarily be capable of writing it. He will be capable of thinking it. This is what the convention of the first person amounts to. The narrator expresses his thoughts, and the novelist gives them written shape. Like all narrators, Augie is a performing artist (as a young man). And it is Bellow who provides his Portrait. The artist, perhaps uniquely and definingly, gets through life without belonging to anything: no organization, no human conglomerate. Everybody in Augie's familial orbit is eventually confined to an institution - even Simon, who commits himself to the association of American money. A leaf in the wind of random influences, Augie wafts through various establishments and big concerns, leagues, cliques and syndicates. As he does so it becomes increasingly clear that whatever identity is, whatever the soul is, the institution is its opposite and its enemy. This commonplace does not remain a commonplace, under Augie's gaze. Human amalgamation attacks his very sensorium, inspiring animal bafflement, and visionary rage. Dickens' institutions are neurotic; Bellow's are psychopathic. Small isn't always beautiful, but big vibrates with meshuggah power.This is the dispensary:like the dream of a multitude of dentists' chairs, hundreds of them in a space as enormous as an armory, and green bowls with designs of glass grapes, drills lifted zigzag as insects' legs, and gas flames on the porcelain swivel trays a thundery gloom in Harrison Street of limestone county buildings and cumbersome red streetcars with metal grillwork on their windows and monarchical iron whiskers of cowcatchers front and rear. They lumbered and clanged, and their brake tanks panted in the slushy brown of a winter afternoon or the bare stone brown of a summer's, salted with ash, smoke, and prairie dust, with long stops at the clinics to let off dumpers, cripples, hunchbacks, brace-legs, crutch-wielders, tooth and eye sufferers, and all the rest.This is the dimestore:that tin-tough, creaking, jazzy bazaar of hardware, glassware, chocolate, chickenfeed, jewelry, drygoods, oilcloth . . . and even being the Atlases of it, under the floor, hearing how the floor bore up under the ambling weight of hundreds, with the fanning, breathing movie organ next door and the rumble descending from the trolleys on Chicago Avenue- the bloody-rinded Saturday gloom of wind-borne ash, and blackened forms of five-story buildings rising up to a blind Northern dimness from the Christmas blaze of shops.And this is the old folks' home, where Grandma goes:We came up the walk, between the slow, thought-brewing, beat-up old heads, liver-spotted, of choked old blood salts and wastes, hard and bone-bare domes, or swollen, the elevens of sinews up on collarless necks crazy with the assaults of Kansas heats and Wyoming freezes . . . white hair and rashy, vessel-busted hands holding canes, fans, newspapers in all languages and alphabets, faces gone in the under-surface flues and in the eyes, of these people sitting in the sunshine and leaf-burning outside or in the mealy moldiness and gravy acids of the house. Such writing is of course animated by love as well as pity and protest. And there are certain institutions and establishments to which Augie is insidiously drawn. The poolhall, for instance, and the anti-institution of crime. Here is Augie, in a new kind of uniform:Grandma Lausch would have thought that the very worst she had ever said about me let me off too lightly, seeing me in the shoeshine seat above the green tables, in a hat with diamond airholes cut in it and decorated with brass kiss-me pins and AI Smith buttons, in sneakers and Mohawk sweatshirt, there in the frying jazz and the buzz of baseball broadcasts, the click of markers, butt thumping of cues, spat-out pollyseed shells and blue chalk crushed underfoot and dust of hand-slickening talcum hanging in the air. Along with the blood-smelling swaggeroos, recruits for mobs, automobile thieves, stick-up men, sluggers and bouncers . . . neighborhood cowboys with Jack Holt sideburns down to the jawbone, collegiates, tinhorns and small-time racketeers and pugs . . .That frying jazz! Criminals are attractive because their sharply individualized energies seem to operate outside the established social arrangement. Augie is deeply candid, but he is not especially honest. Invited along on a housebreaking job, Augie doesn't give any reason for saying yes; he simply announces that he didn't say no. 'Are you a real crook?' asks Mr Einhorn. 'Have you got the calling?' At this point Mr Einhorn, the crippled propertybroker ('he had a brain and many enterprises, real directing power'), is still Augie's primary mentor. Mr Einhorn knows how the world works; he knows about criminals and institutions. And here, in one of the book's most memorable speeches, he lets Augie have it. One hardly needs to say that Bellow has an exquisite ear, precise and delighted in its registers: Guillaume, for example, the dog-handler who has become over-reliant on his hypodermic ('Theesjag-offis going to get it!'); or Happy Kellerman, Simon's much-abused coalyard manager ('I never took no shit in bigger concerns'); or Anna Coblin, Mama's cousin ('Owgie, the telephone ringt. Hear!'). Naturally, Bellow can do all this. But from time to time he will also commandeer a character's speech for his own ends, keeping to the broad modulations of the voice while giving them a shove upwards, hierarchically, towards the grand style. Seasoned Bellovians have learnt to accept this as a matter of convention. We still hear Einhorn, but it is an Einhorn pervaded by his creator: 'Don't be a sap, Augie, and fall into the first trap life digs for you. Young fellows brought up in back luck, like you, are naturals to keep the jails filled - the reformatories, all the institutions. What the state orders bread and beans long in advance lor. It knows there's an element that can be depended on to come behind bars to eat it. Or it knows how much broken rock for macadam it can expect, and whom it can count on to break it . . . It's practically determined. And if you're going to let it be determined for you too, you're a sucker. Just what's predicted.T hose sad and tragic things are waiting to take you in - the clinks and clinics and soup lines know who's the natural to be beat up and squashed, made old, pooped, farted away, no-purposed away. If it should happen to you, who'd be surprised? You're a setup for it.' Nevertheless, as the novel nears the end of its second act, Augie continues to feel the urge to bottom out. At least the bottom is solid, when there's no further to fall - and nothing else in his life seems solid. Soon after Einhorn's speech Augie goes on another incautious jaunt (in a hot car) with the same hustler (Joe Gorman, the housebreaker), up north, Toledo way. Augie escapes the state troopers but gets incarcerated on another charge, in Detroit: 'Lock 'em all up.' We had to empty our pockets; they were after knives and matches and such objects of harm. But for me that wasn't what it was lor, but to have the bigger existence taking charge of your small things, and making you learn forfeits as a sign that you aren't any more your own man, in the street, with the contents of your pockets your own business: that was the purpose of it.S o we gave over our stuff and were taken down, past cells and zoo-rustling straw . . . An enormous light was on at all hours. There was something heavy about it, like the stone rolled in front of the tomb.Augie's durance, though, on his detour in the Midwest, unmoored fi·om Chicago, is internal and spiritual. Here for the first time he sees human misery stretched across a natural landscape: war veterans, the unemployed, 'factor-shoved' bums, haunting the railtracks (they 'made a ragged line, like a section gang that draws aside at night back of the flares as a train comes through, only much more numerous') and sleeping in heaps on the floors of disused boxcars:It was no time to be awake, or half awake, with the groaning and sick coughing, the grumbles and gases of bad food, the rustling in paper and straw like sighs or the breath of dissatisfaction . . . A bad night - the rain rattling hard first on one side and then on the other like someone nailing down a case, or a coop of birds, and my feelings were big, sad, comfortless, of a thinking animal, my heart acting like an orb filled too big for my chest- 'not from revulsion,' Augie adds, 'which I have to say I didn't feel.' And we believe him. Passively, directionlessly, Augie is visiting the dark and bestial regions occupied by his mother and younger brother - alike incapable of 'work of mind'. Some pages earlier, after an extreme humiliation, Augie has said,I felt I had got trampled all over my body by a thing some way connected by weight with my mother and my brother George, who perhaps this very minute was working on a broom, or putting it down to shamble in to supper; or with Grandma Lausch in the Nelson home - somehow as though run over by the beast that kept them steady company and that I thought I was safely away from. And by the time Augie limps back to Chicago his family is gone. Simon has taken off, in obscure disgrace; Mama has been farmed out; and Grandma Lausch ('My grates couldn't hold it. I shed tears with my sleeve over my eyes') is dead. Childhood - act one - ended with the house getting 'darker, smaller; once shiny and venerated things losing their attraction and richness and importance. Tin showed, cracks, black spots where enamel was hit off, thread barer, design scuffed out of the center of the rug, all the glamour, lacquer, massiveness, florescence, wiped out'. The second act - youth- ends when there is nothing to go back to, because the home is no longer a place. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 37 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“The Adventures of Augie March is the great American Novel. Search no further.” –Martin AmisA Penguin Classic As soon as it first appeared in 1953, this novel by the great Saul Bellow was hailed as an American classic. Augie, the exuberant narrator-hero is a poor Chicago boy growing up during the Great Deptression. A “born recruit,” Augie makes himself available for a series of occupations, then proudly rejects each one as unworthy. His own oddity is reflected in the companions he encounters—plungers, schemers, risk-takers, and “hole-and corner” operators like the would-be tycoon Einhorn or the would-be siren Thea, who travels with an eagle trained to hunt small creatures. This Penguin Classics edition, with an introduction by celebrated writer and critic Christopher Hitchens, makes a literary masterpiece available to a new generation of readers.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0143039571"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Classics (October 3, 2006)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 608 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780143039570"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0143039570"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 1040L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.06 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 8.23 x 5.55 x 1.43 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#109,689 in Books (See Top 100 in Books) #994 in Contemporary Literature & Fiction #3,530 in Classic Literature & Fiction #7,632 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 788 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Wordsworth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG4PXBUJGIK7AFW6OIT5ZN42FKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H7JLH8SZ31IG?ASIN=0143039571",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 1999",
                "reviewTitle": "5.0 out of 5 stars A literary masterpiece",
                "reviewText": "This novel is unquestionably one of the great masterpieces of our time.Saul Bellow paints portraits of characters like Rembrandt. He has a brilliant technique for divulging not only the physical nuances of his characters but also gets deep into the essence of their souls.He has an astute grasp of motivation and spins a complex tale with an ease that astounds. Even the most unusual twists of fate seem natural and authentic.Augie is a man \"in search of a worthwhile fate.\" After struggling at the bottom of Maslow's hierarchy of needs as a penniless youth in Chicago, he ultimately discovers that alignment with the \"axial lines\" of his existence is the secret to human fulfillment.While his brother is engrossed in chasing after financial enrichment and social esteem, Augie learns through his own striving that such pursuit is \"merely clownery hiding tragedy.\"Augie is a man dogged in his pursuit of the American dream who has an epiphany that the riches that life has to offer lie in the secrets at the heart's core. If, as Sartre says, life is the search for meaning, then Augie is the inspired champion of this great human quest.The true test of a great book is that you wish it would never end. Fortunately, Saul Bellow is as prolific as he is brilliant and there is much more to explore.Bellow is worthy of the characterization of one of America's best living novelists: he is a treasure. His wisdom staggers the imagination.Don't let this novel pass you by!",
                "reviewVotes": "95 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Straus",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSE3DJEUS7MBZLDH5WVLAA42HQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R269RC99UQFNF0?ASIN=0143039571",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Pretty great",
                "reviewText": "Seems the plot meandered maybe for some in the reviewa above, but for me it’was a brilliant tapestry of the American experience before and after WWII. Found the prose difficult to grasp and comprehend at times but that was more a fiunction of my shortcomings as a reader than anything having to do with Bellow. Wasn’t sure what to make of the ending. Felt like his adventures would continue on and on. Overall I see why some deem it the great American novel. Went over my head in places so not sure it’s that for me, but agree that it’s in the conversation.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "La Yhadira",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED4AAV42GVQFUUEEV3B7XHWWZLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP3KH5IPDOTFX?ASIN=0143039571",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2020",
                "reviewTitle": "5.0 out of 5 stars Just Wonderful!",
                "reviewText": "This is such an aesthetically pleasing edition of the book. The hardcover design is a rich red and even features a golden bookmark. Everyman's Library truly has mastered the art of presentation.As for the novel itself, it is nothing short of a masterpiece. For years, I'd regretted not having finished the book. I am so glad I have picked up where I'd left off. I simply must know what happens to Augie during his love escapade to Mexico.Joyce Carol Oates and other luminaries have identified this novel as the one in which Saul Bellow found his voice. And what a wonderful voice it is! Augie is such a lovable character in his follies and rebelliousness.This book is perfection.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anne Gentry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMOLDRHVETZGW7E7LVZGTVZUM7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R65ORNU7JSCCQ?ASIN=0143039571",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "3.0 out of 5 stars Waste of time.",
                "reviewText": "Completely overrated by literate. If a book has excessive big words strung together in one sentence, there must be something great to be told. Drifted to \"The Emperor's New Clothes\": bang made no boom.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catherine Choi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHUTVTEJEZYWIY3PM6W4DPLMUZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NKF6DFTUVENJ?ASIN=0143039571",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 21, 2016",
                "reviewTitle": "5.0 out of 5 stars A masterpiece",
                "reviewText": "Saul Bellow's writing style is incredibly detailed and can feel a bit meandering at times, but this book is undoubtedly a masterpiece (although I felt that the first third was stronger than the rest of the story). The novel explores Augie's relationships in Chicago, then Mexico, and eventually widens his scope of acquaintances internationally. At times, it can feel that the characters that Augie's meets are more well developed and interesting than Augie's himself (notable examples include Grandma Lausch and Einhorn), but the book is undoubtedly about Augie's maturation and finding his own path. The struggles that Augie's faces in deciding his own motivations and his desire to push against the influences around him seems relatable for the modern audience, especially those searching for their own purpose in life. As a word of warning, the book is quite long and trying to keep track of the thousands of little details that Bellow throws in is impossible.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brian D. Timms",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZF3P4E4WV7QCZEXZHTWJ2MBFKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTHNRFZWZCRS6?ASIN=0143039571",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Pure Jazz",
                "reviewText": "What a beautiful John Coltrane solo of a novel! Most certainly in my top five ever.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N8RMama",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK2LNB2CODMLXKXUDYFZMNXIYBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MPPW3MFKN8CL?ASIN=0143039571",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Ten in one",
                "reviewText": "After reading this one, I am beginning to wonder if modern fiction has become overly formulaic. Any one of these adventures would have been its own book nowadays. But in this one each was just one ingredient in the recipe. Together they made a fantastic yet believable dish, though the first bites just weren't as tasty as the later ones.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richardovaz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFPLCI4T6RHWOOIYF2L72QX7EXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BR4MMFI2CFCU?ASIN=0143039571",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2022",
                "reviewTitle": "5.0 out of 5 stars SUPER-SPEEDY DELIVERY OF A PERFECT COPY OF A GREAT NOVEL",
                "reviewText": "BILLY BUDD OWNER, NANETTE ATLER, GOT THIS COPY TO ME IN TWO DAYS.THE BOOK IS ABSOLUTELY PRISTINE, LIKE IT'S NEVER BEEN TOUCHED, MUCH LESS READ.GREAT SELLER!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 16, 2023",
                "reviewTitle": "What an adventure!",
                "reviewText": "I have been to Chicago so I recognised some of the locations. It is a terrific adventure where the characters find out along t about themselves. Some of the characters are very rich and others are diet poor but it doesn't seem to make a lot of difference. It is a good read I can recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Howard Hilton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 29, 2020",
                "reviewTitle": "Unmissable",
                "reviewText": "A wonderful book. Bellow had such genius and energy. It is a book about Augie and his mileu and it is almost entirely written from a man's perspective. Nonetheless it is superb. It does help to be Jewish as there are bits of yiddish all through. A most touching, affecting and brave work.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica L",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 30, 2014",
                "reviewTitle": "Augie March",
                "reviewText": "Roman acheté pour mes études LLCE anglais. Histoire sympathique mais pas transcendante.- - - - - - - -",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Mayo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 29, 2006",
                "reviewTitle": "A verbal feast",
                "reviewText": "Saul Bellow uses Augie March's fairly extraordinary saga to allow us all, and probably himself too, to muse our ways through a succession of reflections on the human predicament. I would be surprised if most readers did not discover from time to time in these pages something of themselves; of their fears, hopes, dismay, despair, and perhaps resilience. It's a very rewarding read. Not that it's not difficult sometimes. In fact, either he, S.B., simply ratchets up his verbal dexterity beyond my reach from time to time, or could it be that his determination to find ever more complicated verbal chords actually sometimes produces combinations that don't really work. Certainly sometimes they don't work for me. But there are also passages of breathtaking effect which leave one to wonder how words can be crafted with such skill to describe with such extraordinary clarity our previously unvoiced (because by us un-voicable, if not un-thinkable) feelings and reactions to so many situations, some common enough. A master at work.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrick McCusker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 4, 2015",
                "reviewTitle": "Excellent book",
                "reviewText": "Can there even be a Great American Novel? Looking in from the outside, I'd argue otherwise. There are too many American experiences, and such a diversity of experiences across a nation the size and population of Europe that arguing a single novel can articulate them is futile. This is borne out by the way in which novels as different as The Great Gatsby, The Sound and The Fury, The Adventures of Augie March and Infinite Jest are all trumpeted as Great American novels. Given that these books have nothing in common given a common language and the nationality of their authors, perhaps it makes more sense to speak of Great Novels of a particular American experience - in which case The Adventures of Augie March is a triumph, articulating the interwar American experience of the working class to such a degree as to make it intelligible and resonant across the ages, long after the historical events informing the life and times of the aimless but highly intelligent Augie March have receded into history.Whilst this mightn't be the place to start with Bellow (mostly due to length, the much shorter Seize The Day provides a better introduction to his body of work), it's a great novel and the best of his I've read. All varieties of life are contained here, understood in joy,tragedy and madness through the eyes of Augie March, a deceptively intelligent everyman scattered by the winds of change.There are strong parallels between Bellow's life and March's - in some ways Bellow uses the novel as a vehicle to understand the kind of man he'd have been were it not for his art, exploring the tensions created by an inability to specialize or focus when all around him manage to, much as Bellow went from a variety of odd jobs to joining the military to becoming an academic before choosing to pursue literature properly, much as March does, albeit in the manner of a Dedalus whose Bloom never truly arrives (apologies for the nerdishness). I feel that this is a book that it's worth buying a copy of, as I started reading a library copy of this before. Whilst it seemed great (if nothing else, Bellow is a good storyteller and witty with it). I didn't manage to finish it on time. I really enjoyed the chance to reread the chapters I had read, and to appreciate how strong Bellow's prose is: Martin Amis' claim that \"his sentences seem to weigh more than anyone else\" has some truth to it. Bellow manages to be incredibly articulate and learned without ever being ostentatious- every sentence feels necessary. Whilst I still suggest reading Seize The Day first so as to get a feel for Bellow and his themes, this book is outstanding and deserves the praise it receives.The Great American Novel? No, but it's the great novel of a certain American experience, much as Updike's Rabbit saga is of the WASP experience Fitzgerald's The Great Gatsby of the aristocracy and David Foster Wallace's work is of the MTV/Facebook generations.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}