{
    "remaining_requests": 1967,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Adventures-Huckleberry-Finn-Mark-Twain/dp/0486280616",
    "body": {
        "name": "Adventures of Huckleberry Finn (Dover Thrift Editions: Classic Novels)",
        "price": "$5.39$5.39",
        "originalPrice": "",
        "rawPrice": 5.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Adventures-Huckleberry-Finn-Mark-Twain/dp/0486280616",
        "soldBy": {
            "sellerID": "A27EK23NIPUXRO",
            "name": "glenthebookseller",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A27EK23NIPUXRO"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "80",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51JUzISa5qL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Q9yGnkczL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YXQkNzBML.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mark Twain",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Mark+Twain&text=Mark+Twain&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "glenthebookseller",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 3183,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 16 hrs 55 mins",
            "$3.98 delivery Friday, March 1."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The novel's preeminence derives from its wonderfully imaginative re-creation of boyhood adventures along the Mississippi River. Most of all, Huckleberry Finn is a wonderful story, filled with high adventure and unforgettable characters. Climb aboard the raft with Huck and Jim and drift away from the \"sivilized\" life and into a world of adventure, excitement, danger, and self-discovery. Huck's shrewd and humorous narrative is complemented by lyrical descriptions of the Mississippi valley and a sparkling cast of memorable characters.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 0486280616"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Dover Publications; First Printing - First Thus edition (May 26, 1994)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 224 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9780486280615"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0486280615"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ 990"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.6 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,407 in Books (See Top 100 in Books) #126 in Children's Classics #205 in Coming of Age Fiction (Books) #566 in Literary Fiction (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 3,183 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Twain created enduring works that have enlightened and amused readers of all ages for generations. Samuel Clemens (1835-1910) left his small town to seek work as a riverboat pilot. As Mark Twain, the Missouri native found his place in the world. The novel's preeminence derives from its wonderfully imaginative re-creation of boyhood adventures along the Mississippi River. Most of all, Huckleberry Finn is a wonderful story, filled with high adventure and unforgettable characters. Climb aboard the raft with Huck and Jim and drift away from the \"sivilized\" life and into a world of adventure, excitement, danger, and self-discovery. Huck's shrewd and humorous narrative is complemented by lyrical descriptions of the Mississippi valley and a sparkling cast of memorable characters.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/40c51eb2-f06d-48ce-a05a-cf50622f10a9.__CR0,0,300,400_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e631d96-044c-4df8-8408-93b057fe047b.__CR0,0,350,175_PT0_SX350_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/40c51eb2-f06d-48ce-a05a-cf50622f10a9.__CR0,0,300,400_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9e631d96-044c-4df8-8408-93b057fe047b.__CR0,0,350,175_PT0_SX350_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2bcbb6ad-d4a5-4708-87c1-95c823f0e29e.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kristi P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIY2S4ZGOTTKIXS4QLH6RK4ISUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OKJ3VYVL37LQ?ASIN=0486280616",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2017",
                "reviewTitle": "5.0 out of 5 stars ... most interesting books I have read because of the great life lessons that it teaches and the continuously intriguing ...",
                "reviewText": "Mark Twain’s Adventures of Huckleberry Finn is one of the most interesting books I have read because of the great life lessons that it teaches and the continuously intriguing plot. One of my favorite parts of the story is during the rising action when Huck runs away from his father and fakes his death so that he go to the island, where he eventually finds Jim. Huckleberry begins abandoning many of the rules that he has been taught to help Jim and stay with him during their adventures. The most captivating part of the novel is during the climax when Huck does not tell Miss Watson where Jim is because he and Tom want to rescue Jim. Later on in the story, during the falling action, Aunt Polly identifies Huckleberry and Tom and Tom informs them that JIm was released, according to Miss Watson’s will. This leads to Tom’s plan to travel west because he decides that he does not want to deal with the normality of society anymore and the viewpoints that many people have. Overall, the story is about a boy who is proved to be different from the people around him because he believes that a lot of what he has been taught is right, is actually wrong. He comes to these realizations on his own and understands the real right from wrong. It is about a boy who sees the world a little differently from others and how he reacts to all of it.Huckleberry Finn is not only the main character of the story, but he is a round and dynamic character as well. Huck changes throughout the story with his realization of the difference between his version of the right things to do and other people’s version of it. Over the course of the story he learns to get over what society has taught him and accepted Jim when others did not. Furthermore, he is also the protagonist of the story because of how he spends time with Jim and actually wants to be with him, which goes against the beliefs that he grew up with. On the other hand, Jim is more of a flat character. Although he transitions from being a slave to being a free man, his morals and viewpoints do not change at any point in the novel. I like how the characters all have something unique about them that none of the other characters possess. For example, Huckleberry thinks differently from other people in the story.One of the most significant elements to the story is the irony throughout it. Twain uses a lot of situational and dramatic irony in the novel. At the beginning of the story, Huckleberry’s father gets angry whenever he goes to school, which is a topic that most parents would not get angry over. Additionally, when the Grangerford’s and the Shepherdsons go to church, they leave their guns at the doors to establish peace in the church community. However, they grab their guns and continue their feud as soon as they leave the church, showing how it is ironic that they want to maintain a peaceful atmosphere in the church while they are fighting under any other circumstances. Twain also writes in the same way that he thinks his characters would speak. This element gives more personality to the characters. The irony also makes the story enjoyable to read because it gives the readers something that the characters are unaware of or something that they do not think about as much as the audience does.Huckleberry Finn struggles with where he is in his environment and society trying to change him so that he will eventually become an adult. He goes against many of the things that he has been doing and has seen other people doing his whole life, creating conflict. For example, Huck wonders about whether he should turn Jim in or not because it is what he had been taught to do, but he does not think that it would be right to do that because Jim had become his friend over the time that he spent with him. Huckleberry shows a normal life through his uncivilized ways and his want to escape the society that he is in. He grows up believing that African Americans are not as intelligent as people with light skin are. During the story, it surprises him when he finds Jim to be more “level headed” than he assumed he would be. This establishes the theme of civilization interfering with life, rather than improving it. Overall, Mark Twain’s Adventures of Huckleberry Finn is a story about a boy figuring things out in his life and how he handles them.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "regates",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJK262C2LKOPRZPIVR4OWDXPZJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2157S5PY27IST?ASIN=0486280616",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Important historical classic",
                "reviewText": "I read this in high school and never got around to owning a copy until now. I'm quite happy to have one as there's only about a half a dozen books that have lasted from school in my mind.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Budgiegirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDGSMGZMQGE5EUNRJ5GBD7SDQNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OKG1TEJAB71Z?ASIN=0486280616",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2014",
                "reviewTitle": "5.0 out of 5 stars Yes it takes work to read this book, that's what makes it so good!",
                "reviewText": "Alot of the complaints in the reviews about this book are that \"It is too slow\", and \"It is too difficult to read.\" Guess what! This is not The Hunger Games or The Twilight Series. This is actual literature from over 100 years ago. Yes it takes work to get through the dialogue. It is not exactly a page turner in that regard. But if you can be patient, and \"get into the groove' of the dialect, then you will soon be able to read through the conversation with less effort. It is rewarding! Of course, I am reading this as an adult, and because I chose to do so, and not for a homework assignment. I am glad I took the time to do so, because this to me is what literature is all about. It's rewarding - not just a book you cruise through in two days, and then give it to your 10 year old who also reads it in two days. There is a lot of social commentary, as well as commentary about the inherent decency of man, and what we do to screw up our kids along the way. Critics are correct, this is not a children's book. It just happens to be about a child. Mark Twain was a masterful writer. I hope you take the time to work through this book. Also, the Dover Thrift version does not appear to be censored - as some of the other books are purported to be.",
                "reviewVotes": "163 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann Terrio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFA7QJPNBUKBHGLFQLCBWEWT67FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2132Z2YT7M9LG?ASIN=0486280616",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2016",
                "reviewTitle": "4.0 out of 5 stars Great story - beautifully written.",
                "reviewText": "I am sure I must have read this story many years ago, but I didn't remember much about it. Now that I am retired, I have the luxury of going back and reading books with a different perspective. This is a book a story that is full of adventure and gives us a look at what life was like when slavery existed. It is also a story of trust, love and hope -- all of which we need more of in today's world.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cricket",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDQ77PNTRCBOWR7BSO6SWPQRTVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2F43G25DUF2G8?ASIN=0486280616",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 12, 2014",
                "reviewTitle": "5.0 out of 5 stars Classic",
                "reviewText": "Who doesn't like Mark Twain's classic tale about Huckleberry Finn's adventures? Sailing down the Mississippi with Huck and his friend, Jim, a runaway slave. There has been some controversy over the book lately because of the use of the N word. But the reader must remember that this is set in Missouri in the 1830's, thirty years before the Civil War, and Twain writes it as true to its time.To those who are offended or uncomfortable reading about this very real slice of American society and customs of the time period, I would recommend they just don't read it. However, I do not agree that Twain's words should be changed, \"cleaned up to be politically correct\" for today's readers. This is his work of art, not anyone else's. I was raised in the Deep South in the 50's and 60's and believe me, the offending word was commonly used then.I think the most important thing a writer can do is be true to his characters and the customs and the culture that they lived in. Would you put a loincloth on Michelangelo's David? As George Santayana warned: Those who forget the past are doomed to repeat it. Reading about this time in our history reminds us of things we don't want to repeat.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W Bruce Ayers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA6YXFWPHTXSWSSZSQ3U6MJ2EOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RHURN6NK613X?ASIN=0486280616",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Mark Twain’s Best!",
                "reviewText": "Adventures of Huckleberry Finn is consistently rated as one of the best—if not the best—American novel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daunts",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 16, 2023",
                "reviewTitle": "Book with paper",
                "reviewText": "I read the first five pages, I’m sure the story’s good but I guess I’ll never know. Would buy again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eduarda BastosEduarda Bastos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 13, 2022",
                "reviewTitle": "lindooooo",
                "reviewText": "estou ansiosa para ler, o livro chegou antes do prazo, veio bem embalado, mas a caixa estava revirada, como se tivesse sido aberta antes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81bXel0MCYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71UXAmAnwSL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 8, 2023",
                "reviewTitle": "One of the greatest adventure novels ever written!",
                "reviewText": "I read The Adventures Of Tom Sawyer before reading this book as the events in that take place before this one.It took me a bit of time to properly get into the story but it picked up and I was engrossed from that moment. I enjoyed it very much and now consider the two novels to be two firm favourites of mine. It was a fantastic book with some really exciting events during the story.It's well worth a read and whilst I said it was one of the best adventure novels ever written in my review heading I'd also consider Tom Sawyer and Huckleberry Finn to be two of the greatest literary characters ever created.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MoraGalindo MoraGalindo ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 11, 2019",
                "reviewTitle": "Dañado",
                "reviewText": "El libro si está nuevo, pero vino como con un hueco en la pasta de la parte de atrás lo cual no le da buen aspecto",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WKd-+HzSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+z9U27uGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71VIXypNcWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on July 30, 2019",
                "reviewTitle": "spedizione ok",
                "reviewText": "arrivato con i tempi giusti",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}