{
    "remaining_requests": 1876,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Her-Adventures-Temptation-School-Scoundrels-ebook/dp/B0C3D3236B",
    "body": {
        "name": "Her Adventures in Temptation: A Novel (School for Scoundrels Book 3)",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Her-Adventures-Temptation-School-Scoundrels-ebook/dp/B0C3D3236B",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71CLhDxAukL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Megan Frampton",
            "link": "https://www.amazon.com/Megan-Frampton/e/B001KDXFF8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 64,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "In this newest addition to the School for Scoundrels series, Simeon Jones and Lady Myrtle Allen tell all the ton that they are engaged to be wed, fully knowing that once the season is over they will quietly part ways. They each have their reasons, but neither expected love to tempt them into turning a pretense into reality!Simeon Jones has a secret—he is soft-hearted. Despite his scandalous exterior, he will quietly give money to orphans (after all, he was one himself), animals, and damsels in distress. One such damsel is Lady Myrtle Allen—but it’s not her funds that are lacking, but rather she needs to get to London—fast.And so begins a wild adventure. First, the pair tells all the ton that they are engaged to be wed—how else to prevent scandal once they are found together—alone! They plan to carry out this deception, fully knowing that once the season is over, they will quietly part ways. But then, they discover that they have fallen in love, which was definitely not part of their plan! Can this scandalous man and adventurous woman turn this pretense into reality?",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C3D3236B"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (January 23, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 23, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3947 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 350 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0063224291"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#65,546 in Kindle Store (See Top 100 in Kindle Store) #662 in Women's Historical Fiction #1,158 in Victorian Historical Romance (Kindle Store) #3,219 in Women's Romance Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 64 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Terri B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7BRMES2FSM66UMERHL7TD6XVGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33H2HBYK67PS9?ASIN=B0C3D3236B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Engaging couple",
                "reviewText": "I thoroughly enjoyed reading this book. The characters are well written and engaging. I would highly recommend. Looking forward to her next book in the series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJHEBXMYQFZHVM47KC7UF46244A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FV9QYGGKTAUR?ASIN=B0C3D3236B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars The best FMC!",
                "reviewText": "Myrtle is an intelligent mathematician who likes cake, which unfortunately makes her too intelligent for the loads of suitors she has turned down for marriage proposals. Simeon is a painter and a bit of a rake that has just gotten entrapped in a situation at Myrtle’s brother’s house resulting in a quick exit. Hoping to escape to London where she can start her own business for women seeking accounting help, Myrtle attempts to escape with Simeon, scandal be damned. These two have to pretend to be married, share only one bed, and tempt each other with flirtatious banter as they head to London.This book was so much fun. I laughed so much in the beginning at Myrtle’s straightforward nature and inability to hide her true opinions. “Do keep up,” became a repeat witticism between Myrtle and Simeon who dish out comedic banter for the whole first third of the novel. These two couldn’t be more opposite on paper, but as we find, their wants are so similar, and Simeon truly has the biggest heart! He gives all of his money away because he is always helping others, causing him to be ridiculously poor. Myrtle meanwhile has amassed a fortune because her mathematical prowess has helped her invest and grow her monies. When an improbable (for romance reasons) fake engagement throws them into each other’s arms, their feelings on what they want from life (to marry or not?) and from each other begin to change.As part of their fake engagement Myrtle and Simeon decide to have a sexperiment over the duration of their time together and Megan Frampton knows how to bring the heat and intimacy. I loved seeing these two fall for each other; Simeon time and again says how much he loves Myrtle’s brain, and Myrtle first falls for his looks, but then falls for his heart. Being a loner is something they have in common and they way they quickly notice things about one another makes the second half of the book full of thoughtful gestures and kindheartedness.This is the third book in the School for Scoundrels series and I have been along for the ride since the first, loving each story of the Bastard Five. This can be read as a standalone or even out of order, but knowing some of the other “Bastards” made it much sweeter. Myrtle definitely takes the cake in this book (ok, pun fully intended) with her personality and frankness, but Simeon lets her—a perfect example of a strong man behind a strong woman. I received this copy from the publisher. All opinions are my own.4.5 stars rounded up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mjlink",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLGD52HGDAPQQHUAGVVI7SBJZ2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U851V538ONWS?ASIN=B0C3D3236B",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "3.0 out of 5 stars The Bastard and the Brain",
                "reviewText": "Myrtle is a clever awkward mathematician. Simeon is a good looking artist who also happens to be a bastard and therefore outside society. This third installment in the School for Scoundrels series, does not quite live up to the promise of the first novel. The relationship between Myrtle and Simeon builds too quickly, goes south rapidly, then rectifies seemingly instantly. Fans of the series may enjoy the continuation, but new fans can skip this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dyanne Gray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKEVHQW3LM6NVTNZDXBFMSRDM2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LLD8K2XSK4KJ?ASIN=B0C3D3236B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars Friends to lovers to love story",
                "reviewText": "I really enjoyed the premise of this series: 5 Orphan Bastards of various circumstances are still friends and bond together over their lives and books. Book 3 is about Simeon, who is an artist by trade and a softhearted fellow by deed. Simon wants to create great significance works of art but has to fund his work by taking portrait commissions which is how he finds himself at the country home of his newest commission for Lord Richard Allen, Viscount Leybourne. Lady Myrtle Allen, Richard’s sister is a very intelligent woman, she excels in mathematics and in the first few chapters makes the reader well aware of just how smart she is and how no one appreciates her talents , especially her brother and the 27, or was it 32 men who have proposed to her. I have to admit, that it took me about 1/3 of the book to like Myrtle. I think the author was going for a neurodivergent character but for me she was just over-boasting and annoying. Yes, she was very annoying….. until she wasn’t.After a misunderstanding involving Richard’s lush of a wife, Simon has to make a hasty exit and Myrtle manages to convince him to take her to London with him because she wants to set up her own financial advise business for women ( incase you forgot, she’s good at maths). Then you start to think “Oh, I know where this is going, 2 people alone on the road for a few days, marriage of convenience….” Nope, they part ways in London but are intrigued by one another. Well through a weird series of events, they end up with a “fake engagement “. But the fake engagement is only to usher Myrtle’s niece through her debut and was suggested by her brother Richard.Confused yet?It feels like you should be.But somehow Ms Frampton seems to pull this off into a delightful friends to lovers to love story. I really started to sympathize with Myrtle. All she really wants is someone to respect her for her intelligence and to want to marry her for more than her dowery. And if she can’t have that she would rather make her own way in the world. Simone is very attracted to Myrtle and it’s no hardship to be her fake fiancé, As someone who is passionate about his art he comes understand Myrtle’s drive as well. This is a nice love story about two people needing a friend who understands them and then realize that they want more than just that friendship.The steam #s in this is low, but those scenes are 🔥🔥. I think that’s this book is a fine addition to the previous 2 of which I’ve enjoyed very much And I’m looking forward to find out what has Fenton all tied up in knots.As always, I thank the author and NetGallery for allowing me to read this ARC for my honest review.8",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 27, 2024",
                "reviewTitle": "Just lovely!",
                "reviewText": "Another great story! Simeon deserved a great love and so did Myrtle! Great to meet up our usual friends and very curious to find out about Fenton...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}