{
    "remaining_requests": 8015,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Clothesline-Portable-Clothespins-Accessories-Retractable/dp/B0CHRPTXHC",
    "body": {
        "name": "2 Pack Camping Clothesline Portable 12 Clothespins, Camping Accessories Travel Clothesline for Outdoor Indoor, Retractable Clothes Line Elastic Clothesline for Camper Hotel Room",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Clothesline-Portable-Clothespins-Accessories-Retractable/dp/B0CHRPTXHC",
        "soldBy": {
            "sellerID": "ATHZ0BI0D2RLH",
            "name": "MCIGICM",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ATHZ0BI0D2RLH&asin=B0CHRPTXHC&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "35",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51jekBoBonL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51-fEquyHUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Xs2E-Oo9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51d6gPL PbL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513Q2jbOiEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61M2xnSAUfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yAdlmdLnL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: DAGONGREN",
            "link": "https://www.amazon.com/DAGONGREN/b/ref=bl_dp_s_web_37183659011?ie=UTF8&node=37183659011&field-lbr_brands_browse-bin=DAGONGREN"
        },
        "brand": "DAGONGREN",
        "merchantInfo": "MCIGICM",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 36,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 12 hrs 52 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[Innovative Design] The travel clothesline features 12 colorful clothesline clamps and 13 windproof, non-slip clamps, all designed with a positioning bead. Our sturdy elastic rope supports heavy clothing more effectively than other clotheslines.",
            "[Portable Perfection] Our backpacking clothesline, lightweight and compact, includes a waterproof bag. The portable clothesline can fold into a pocket-sized package—ideal for travelers and outdoor enthusiasts.",
            "[Easy to Use] Our heavy-duty retractable portable clothesline is effortlessly fastened using two sturdy stainless steel hooks, which can be easily removed. Secure it to hooks, doorknobs, shower rods, or branches.",
            "[Wide Application] Our outdoor clotheslines can serve as camping clotheslines, perfect for RVs, yachts, and tents. They can also be used as portable indoor clotheslines, making them equally versatile and suitable for hotels, student dormitories, and balconies.",
            "[Quality Satisfaction] Package included 2 clotheslines + 2 bags. The elastic, non-slip clothesline is 4.6 feet long and extends up to 9 feet, offering durability for your camping needs. If you are unsatisfied, please email us, and we will work to provide you with a satisfactory solution!"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Storage & Organization",
                "link": "https://www.amazon.com/storage-organization/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3610841"
            },
            {
                "name": "Laundry Storage & Organization",
                "link": "https://www.amazon.com/laundry-storage-organization/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3744341"
            },
            {
                "name": "Clotheslines",
                "link": "https://www.amazon.com/laundry-clotheslines/b/ref=dp_bc_aui_C_4?ie=UTF8&node=695487011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions",
                "value": "6.77 x 6.77 x 2.68 inches"
            },
            {
                "name": "Item Weight",
                "value": "1.12 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "DAGONGREN"
            },
            {
                "name": "ASIN",
                "value": "B0CHRPTXHC"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "M6001"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 36 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,830 in Home & Kitchen (See Top 100 in Home & Kitchen) #6 in Clotheslines"
            },
            {
                "name": "Date First Available",
                "value": "October 31, 2023"
            },
            {
                "name": "Brand",
                "value": "DAGONGREN"
            },
            {
                "name": "Color",
                "value": "Colorful"
            },
            {
                "name": "Style",
                "value": "Elastic"
            },
            {
                "name": "Line Weight",
                "value": "Light"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71a7b144-26f6-4706-8e78-55e44b88d8e0.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/12087aad-24a2-4a90-bc5d-53bf2d64af96.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1f7e14a8-dfb5-4f30-abab-f2fff995811a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/34bd2fc5-93f3-4690-bf16-011eac036548.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61e539b0-1acf-4bcb-8bc0-1ee99efebd25.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alana Williford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDYNOWNPU3MW2RXMIMZFF5QGAXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGLB9PNY8JHQB?ASIN=B0CHRPTXHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Cruise/camp must have",
                "reviewText": "This is an absolute cruise or camp have. Sturdy and practical! Kept wet bathing suits out of the way while constantly air drying while on our cruise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah B BuddeSarah B Budde",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXRQRAEQE53UVX74Z64MTMWBEZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QV99L4X9N6RF?ASIN=B0CHRPTXHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Cute clotheslines",
                "reviewText": "",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MmPC4baoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71RWtW2B+VL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shinrai",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDA2AKLU2VWGUKMGQLREB634OMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNN33038GNU4P?ASIN=B0CHRPTXHC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "4.0 out of 5 stars Super great for light use",
                "reviewText": "I travel a TON and use all kinds of clotheslines until they shred apart. I gave this one a pretty fair shake last summer during my cross country travels.The bungee is fairly okay. I’m not bowled over by the quality and tension. This is the kind of bungee that will fail after maybe 20-40 uses, so it’s not something you want to rely on. Plus, it gets weighted down easily, so this is really best for light garments like underwear, or light t-shirts made of nylon or other very breathable, quick drying material. When loaded down with cotton, since cotton holds moisture longer, it makes the bungee sag, which definitely isn’t good for it. I’m also not in love with the hooks, but I knew what I was getting into so I just work around it and try not to scratch the surfaces I am adhering it to.The clips though, kick ass. After the bungee fails, I am definitely removing these clips and using them all over the place. The springs are very tight and I have no worries with them gripping the items I hang.Maybe another use case for this clothesline is to make a cute and colorful place to hang artwork and Polaroids. Careful though, because the clips might warp your paper. Better for heavier duty things, or put a small sponge or packing peanut behind, so the clip has something to bite into.All in all, I am mostly satisfied with this because I knew what I was getting into, but if this is your ONE chance to get a clothesline bungee, just be aware that it’ll fail you eventually and you should be okay with that.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raymie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHM6G5WQICRTAO4NJRWBCB37P5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16SL90YWW4V1Z?ASIN=B0CHRPTXHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent item for camping or for drying clothes if your space at home is limited!",
                "reviewText": "My family and I like to camp in the summer and washing clothes is always a chore because it's difficult to get them dry. The weather is a bit too cold for camping right now, but I received this item, and let me tell you... it's going to make washing laundry at the campsite an absolute breeze!The clothesline is well-made. It's sturdy and solid and I truly mean that. The cord is loose enough to be easy to work with, but it's got heft to it and it's not going to buckle to the ground underneath the weight of wet clothes. The attached clothespins are high quality and they have small rubber tips on them so they don't snag your clothes. In between each clothespin is a small adjustable ball that also snaps into place. (That's not the best way to explain it. The balls stay in place until you use the push button to open them up to move. The balls are similar to ones you'd find on the ends of cords used to pull your hood tighter on a parka. They're just larger.) You can slide the balls and clothespins along the clothesline to wherever you want, making variable widths for the clothes you're hanging up. You can hang up a wet sweatshirt, adjust the balls along the cord, and then hang up a pair of wet socks. It's super easy, but it's an ingenious way to keep your clothes separate on the clothesline.The clothesline has a strong hook on each end that is woven into the cord. It's not going to come loose and render the clothesline unfunctional. All you have to do is find somewhere to attach the hook on one end, stretch the clothesline out, and then find somewhere to attach the hook on the other end. Shouldn't be a problem at the campsite. There are many areas where the clothesline could be attached.For people who live in a small space that doesn't have a dryer, I think this would work well, too. My thought is that you could attach a Command hook to two separate, opposing walls and then use those to stretch out and attach the clothesline. This definitely would've come in handy when I was younger and didn't have the money to go to the laundromat as frequently as I should have.I almost forgot the best part! There's not just one clothesline in this pack... there's two! You get two! And there are two really nice carrying bags that come with the clotheslines, so you don't even have to worry about them getting tangled up in your suitcase! Given the fact that you're getting two of them, this is an amazing price. I'd have paid this price just for one, but you get two!This is a great, ingenious item that is really going to help my family out when the weather gets warmer. It's well-made, clever, useful, and inexpensive. Full five stars for this clothesline set. It's a 10/10 item, a perfect score!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Texas Rose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHPJU6UJJ3UKSZG56MGDZ4YSFQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROA83A2JINJFZ?ASIN=B0CHRPTXHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars So cute! Sturdy clips!",
                "reviewText": "Everything about this is nice. Nothing to snag your clothes from the line to the clips!With the hooks, it only took seconds to string it between the fence and the tree - about 6' without stretching it. The colorful clips are smooth and strong. They won't come apart like regular clothespins. I've never seen positioning beads on a clothesline before ~ what an ingenious solution to a problem!There are two lines and sets of clips with 2 separate small, packable bags. I used to travel for a living and this would have been great in hotels. Now I live in an RV, and line dry about half our laundry. Two lines give me more options in the fresh air and sunshine!The pins are strong enough to hold wet jeans and bath towels but I don't think the line will support the weight - maybe if stretched tightly. But I can see how nice these will be for drying pillow cases, kitchen towels and blouses in the sunshine, and lingerie and night clothes indoors.I already had 6 of these clips before these clotheslines arrived. They are strong enough to hold a nearly-full 13-gallon trash bag to a frame. If you are a camper or working outdoors, having a trash bag securely fastened to your clothesline is super handy. These clips will not let go even in some wind. They also are strong enough to keep my wet jeans on a metal drying rack on a semi-windy day, so I'll try drying jeans on the new clothesline next time.Lots of value here for the current price!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wills_dad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSQJJNG3YWAKAQUV5A34BH4CKQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZK73PZK6Q99L?ASIN=B0CHRPTXHC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars nice solution - self contained - easy to use and easy to store",
                "reviewText": "When we go camping, it seems like there is always something that could use airing or drying out. In the past, nearby trees and undergrowth would be used. Not any more!These 'clotheslines' are easy to store and toss into a camping pack. They are self-contained in that the line and the clips are all right there. As with most camping situation, the stretch in the rope allows for reaching between attachment points that might not exactly match the rope length.And, when it isn't camping season, these work great for having temporary clotheslines in the laundry room/garage to also dry/air out clothes.Nice solution and great way to get more functionality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}