{
    "remaining_requests": 8078,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Stall-Mates-individually-Vitamin-Biodegradable/dp/B00PRJT9RY",
    "body": {
        "name": "Stall Mates Wipes - Flushable Wipes | Individually Wrapped | Travel Friendly | Unscented with Vitamin-E & Aloe | (30 on-the-go singles)",
        "price": "$11.39$11.39 ($0.38$0.38 / Count) $10.79$10.79 ($0.36$0.36 / Count)",
        "originalPrice": "",
        "rawPrice": 11.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Stall-Mates-individually-Vitamin-Biodegradable/dp/B00PRJT9RY",
        "soldBy": {
            "sellerID": "A3Q2QK9MZKWSCL",
            "name": "Grevin Products, Inc.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3Q2QK9MZKWSCL&asin=B00PRJT9RY&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B014V8YWHI"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "14",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418FQXEKazL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41BqkQ2DSIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ziLBUB-HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31lTwHxoAfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31OV3nFpv5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jghiaJ6vL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TMC4wE CL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/39047ea2-5809-4646-89f3-903a705a6a5c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/694658c2-a0a1-4f25-9e94-de659ced9cbe/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/07524055-6a45-4d1d-b695-d308b89e0ddd/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7022b63d-808d-4b36-9578-62309dfb8159/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/de78463d-d6e4-41cc-8ec1-92e769caa875/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c80bb559-54dc-4c25-ad0a-65bdb83765a3/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Stall Mates Wipes",
            "link": "https://www.amazon.com/Stall-Mates-Wipes/b/ref=bl_dp_s_web_12686172011?ie=UTF8&node=12686172011&field-lbr_brands_browse-bin=Stall+Mates+Wipes"
        },
        "brand": "Stall Mates Wipes",
        "merchantInfo": "Grevin Products, Inc.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 8864,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 3 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 3 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🚽Flush Em': Certified Flushable. Septic & Sewer Safe. Stall Mates exceeds the highest levels of dispersibility with significantly higher strength and softness than other wipe brands, making our wipe certified flushable.",
            "🇺🇸American Made: Made in USA using clean, renewable solar energy. Our company will forever uphold a passion for the highest standards, an appreciation for diversity, and a commitment to corporate integrity. Stall Mates will give back to its community, care for the environment, and strive for ever-strengthened social responsibility.",
            "🌱Natural Ingredients: Made With Aloe, Cucumber & Chamomile. We use cucumber in our formula, to reduce inflamed or irritated skin, and hydration thanks to its high water content. Aloe vera is rich in water, which helps hydrate the skin. soothe, comfort and moisturize the skin, particularly those with sensitive skin. Chamomile helps soothe, comfort and moisturize the skin, particularly those with sensitive skin.",
            "💚Sensitive Formula: Hypoallergenic (Paraben, Alcohol, and Fragrance-Free) Your Stall Mates will remain sealed, sanitary and ready for use for two years, even in the most rugged environments. Our fragrance-free wet wipes feature plant-based and aloe vera-infused wipes, ensuring personal cleanliness. These hypoallergenic personal hygiene wipes for adults flushable merge convenience with conscientiousness.",
            "🌫Unscented Flushable Wipes: Introducing Stall Mates personal hygiene wipes designed to cater to men and women. Great for home, apartment, and travel. Our toilet wipes for adults flushable are perfect for personal cleansing. These unscented flushable wipes are designed for wipes for men and wipes for women. Stall Mates cleansing wipes for adults are perfect for backpacking wipes, camping wet wipes, and even apartment essentials."
        ],
        "description": "Individually Wrapped Certified Flushable Wipe Experience on-the-go freshness with Stall Mates dry toilet paper alone can't match. These flushable wipe singles are designed for travel and an on-the-go lifestyle. Stall Mates are individually wrapped moist towelettes that will keep you fresh and clean throughout your day. At the gym, office or a night out, Stall Mates will keep you prepared for any bathroom encounter. Made with aloe, cucumber and chamomile, Stall Mates are manufactured right here in the USA using global components. This hypoallergenic wipe is paraben, alcohol and fragrance free, produced in a facility that is 100% solar powered. Ingredient List Water, Polysorbate 20, Cucumis Sativus (Cucumber) Fruit Extract, Althaea Officinalis Root Extract, Avena Sativa (Oat) Kernel Extract, Aloe Barbadensis Leaf Extract, Chamomilla Recutita (Matricaria) Flower Extract, Tocopheryl Acetate, Phenoxyethanol, Caprylyl Glycol. Never Any... AlcoholsParabensFragrances",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Tissues, Toilet Paper & Sprays",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=23700319011"
            },
            {
                "name": "Personal Cleansing Wipes",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=16284870011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 7 x 3 x 3 inches; 0.11 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SM001"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 18, 2014"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ GREVIN Products, Inc."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00PRJT9RY"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,096 in Health & Household (See Top 100 in Health & Household) #13 in Personal Cleansing Wipes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 8,864 ratings"
            },
            {
                "name": "Brand",
                "value": "Stall Mates Wipes"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            },
            {
                "name": "Material Feature",
                "value": "Plant Based"
            },
            {
                "name": "Unit Count",
                "value": "30 Count"
            },
            {
                "name": "Number of Items",
                "value": "1"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Experience on-the-go Freshness with Stall Mates that dry toilet paper alone can't match. Using public bathrooms can be a gamble. Thin, dry, and sometimes non-existent toilet paper just won't cut it. With Stall Mates Wipes, you will always be left feeling clean, refreshed, and ready for the day ahead. Your Stall Mates will remain sealed, sanitary and ready for use for two years, even in the most rugged environments.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/395d3f79-cd21-44a4-aadc-16163c168ec2.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Designed for the Bathroom. Sensitive Enough for Face, Hands, and Body. Even Babies! CUCUMBER Cucumber has a way of making the simplest. things better, like a cold glass of water or a sushi roll. But did you know that this produce section staple can also dramatically transform your skin's health and appearance? That's why we use cucumber in our formula, to reduce inflamed or irritated skin, and hydration thanks to its high water content. Even people with the most sensitive skin types can use cucumber to their advantage. ALOE Aloe vera is a species of the aloe plant that grows around the world — perhaps even in a pot a few feet away from you as you're reading this, as it's a common houseplant. But in addition to being a lovely succulent with distinctively spiky leaves, what's in those leaves makes it a very desirable ingredient for our wipes. The leaf of the aloe vera plant is rich in water, which helps hydrate the skin. Aloe is also calming for sensitive skin. CHAMOMILE One of the most relaxing nighttime rituals is sipping a cup of chamomile tea. Coming from the Anthemis nobilis plant, chamomile is said to be able to treat everything from bloating to insomnia to headaches to PMS symptoms. Along with boasting some major health benefits, did you know that chamomile also provides skin care benefits? Because of chamomile’s ability to inhibit inflammation, it can have some pretty cool effects on your skin. It can help soothe, comfort and moisturize the skin, particularly those with sensitive skin.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0277ae51-f8f3-4e61-b394-11c842600a78.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4fee5b9-1741-490a-892c-9598475df99e.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e22a3d98-ca9e-49bf-acef-ad8691341a5c.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "We Set The Standard Made In The USA Using Global Components Stall Mates are high quality, American-made wipes using global components. Our company will forever uphold a passion for the highest standards, an appreciation for diversity, and a commitment to corporate integrity. Stall Mates will give back to its community, care for the environment, and strive for ever-strengthened social responsibility. Can other brands say the same? Certified Flushable When it comes to flushable wipes, softness matters. Stall Mates exceeds the highest levels of dispersibility with significantly higher strength and softness than other wipe brands, making our wipe certified flushable. With custom designed fiber blends from sustainable natural resources, our wipes are extraordinarily soft yet durable for flushability. Designed to meet the rapidly changing demands of the dispersible wipes market, the use of custom designed fiber blends allows for the development of higher wet strength while maintaining outstanding dispersibility properties that exceed current INDA/EDANA industry standards. Social Impact At Stall Mates, we strongly believe that it is each and every company’s responsibility to improve the quality of our lives — while improving the livability of our world. Our company has been implementing conscious and meaningful changes since inception to make our business more responsible and sustainable. Planting trees provides families with more than just food. It provides income, empowerment, unity, leadership, education and even saves lives. When we can teach people to value themselves and their environment, they see amazing improvements in their standard of living. Your purchase has a direct impact on the earth and lives of the people who need it most. By helping us plant trees, you give families the ability to transition from unsustainable farming techniques to a flourishing Forest Garden system. Your donation not only helps the environment, but it also empowers farmers to end poverty for their families.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8334863f-c904-4520-9a1a-c0bf90480a5e.__CR0,0,1000,1000_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6535bbe3-92a9-4b6c-a64b-e064528353a2.__CR0,0,300,300_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7940e5c7-8c02-47f8-8abd-53e6eea20376.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "We Make Your #2 Our #1 Priority!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/239a456f-f495-48fc-b22f-e2b8768f9cb0.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "Individually Wrapped Certified Flushable Wipe Experience on-the-go freshness with Stall Mates dry toilet paper alone can't match. These flushable wipe singles are designed for travel and an on-the-go lifestyle. Stall Mates are individually wrapped moist towelettes that will keep you fresh and clean throughout your day. At the gym, office or a night out, Stall Mates will keep you prepared for any bathroom encounter. Made with aloe, cucumber and chamomile, Stall Mates are manufactured right here in the USA using global components. This hypoallergenic wipe is paraben, alcohol and fragrance free, produced in a facility that is 100% solar powered. Ingredient List Water, Polysorbate 20, Cucumis Sativus (Cucumber) Fruit Extract, Althaea Officinalis Root Extract, Avena Sativa (Oat) Kernel Extract, Aloe Barbadensis Leaf Extract, Chamomilla Recutita (Matricaria) Flower Extract, Tocopheryl Acetate, Phenoxyethanol, Caprylyl Glycol. Never Any... AlcoholsParabensFragrances Key Features Flush em': Certified Flushable. Septic & Sewer Safe Portable and Discreet: Individually wrapped Natural Ingredients: Made With Aloe, Cucumber & Chamomile Sensitive Formula: Hypoallergenic (Paraben, Alcohol, and Fragrance-Free) American-Made: Made in USA using global components with clean, renewable solar energy",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b855666-e68b-49f3-9341-37dda5a740fc.__CR0,0,1000,1000_PT0_SX300_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/395d3f79-cd21-44a4-aadc-16163c168ec2.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0277ae51-f8f3-4e61-b394-11c842600a78.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4fee5b9-1741-490a-892c-9598475df99e.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e22a3d98-ca9e-49bf-acef-ad8691341a5c.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8334863f-c904-4520-9a1a-c0bf90480a5e.__CR0,0,1000,1000_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6535bbe3-92a9-4b6c-a64b-e064528353a2.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7940e5c7-8c02-47f8-8abd-53e6eea20376.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/239a456f-f495-48fc-b22f-e2b8768f9cb0.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5b855666-e68b-49f3-9341-37dda5a740fc.__CR0,0,1000,1000_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d916c8c9-a141-4a92-ba33-0a025f794564.__CR0,0,600,180_PT0_SX600_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "BigMac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTHKBSCNK4VZPHXYF5U5K57EV6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R260BAW0ZN5KSB?ASIN=B00PRJT9RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent product, well designed and handy",
                "reviewText": "I like everything about this product. My husband and I both use them. You know what I mean when I say I don’t seem to get clean from toilet paper alone. Enough said. We previously used Preparation H “Totes” but they changed the packaging and they got really hard to tear open. I saw these on Amazon and we’re now on our 3rd box. The turquoise color makes them easy to locate in my purse. They are a full sized sheet, soft, wet enough to be effective, odorless (although I’ve never given them a sniff test!). If I’m heading out without my purse or pockets, I’ll stick one in my bra to have on hand. The packaging is not stiff and doesn’t make a loud crinkle sound. They are perfect for taking to work, travel (very handy on an airplane), out running errands. I’ve used them as general handy wipes when we couldn’t wash our hands. Since they’re made for “sensitive areas”, there’s no alcohol to sting. That probably means they don’t disinfect like Purell, but that’s okay for general use. It’s also important that they are flushable and safe in septics. At home, we keep regular containers of wipes in our bathroom. It would be wasteful to use these at home. They are designed perfectly for using while out and about. I see there are other similar products out there, but this is the only one we’ve tried since the Totes. Very happy with Stall Mates and will keep on ordering.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCEC3HKFFE4YAW5YNWVXITYTYVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XQNRAYMI3LVX?ASIN=B00PRJT9RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars You won’t regret buying this",
                "reviewText": "I appreciated the thoughtful packaging and the convenient size of the product. The wipes contained an adequate amount of moisture, which was quite satisfying. Moreover, they were effortless to carry around, making them versatile for various situations. Without a doubt, I would recommend this product.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "@thisangelshine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUTQYXRMVFPFG5X5UHXNQHEW6AQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HPOFZT0ND1TG?ASIN=B00PRJT9RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Super convenient",
                "reviewText": "Pleasantly unscented, hasn't disturbed ph during monthly cycle and clean better than other individually wrapped wipes I've used, durable yet flushable (if you open packet across top you can tuck wipe back inside to throw away where flushing isn't an option), I've also used these as body wipes in a pinch to just freshen up so I always keep a few on me",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laurie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3YL4D6WE6N6O2EDCCDGUGUJLFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R347XFYOPCJMYX?ASIN=B00PRJT9RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars So good",
                "reviewText": "So easy to travel with and they truly are flushable. Big and soft with just the right amount of moisture. No strong smell too. They’re perfect.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CharLena Pearson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFKMYFV7IPBY23QESXKF5PPHQCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZFFVXDZ2B4U4?ASIN=B00PRJT9RY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "4.0 out of 5 stars Perfect for traveling.",
                "reviewText": "Stall Mates, fit perfectly in your pocket or purse or bag. And they are easy to access while traveling or just living in New York City and having to go to the bathroom while you're out and about. They're perfect too, if you have more than one and you're in dire straits, but in ordinary circumstances you would dare use a facility, you have at your fingertips a cleaning mechanism as well.In any event when using Stall Mates for what they were designed for you leave your stall feeling refreshed, clean. I'll definitely order again. I ike them.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Kay Sherman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYCAIGLOWKDOPT7F7IOCWG4FV6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CLMDK7OLPX95?ASIN=B00PRJT9RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great to travel with in foreign countries, where they have very little toilet paper",
                "reviewText": "I just use this product all over Africa. Almost none of their bathrooms had toilet paper in it. They worked great. I also used it in Abu Dhabi in several bathrooms. That had no toilet paper. It can always be in my pocket. It’s easy to carry. I also used it on the plane when Turkish Airlines ran out of toilet paper.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVIILECW4XCBJP67REOKRYLTJ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H2K4R3428NBJ?ASIN=B00PRJT9RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Its a must have for travel!",
                "reviewText": "I am a serious Amazonholic and shop here every freaking single time! I always filter my products according to customer reviews and it's a shame that I myself never took the time to write reviews. So finally I have decided to write reviews so I can help other buyers make the right decisions.I recently took a trip to India and did not want to carry a giant wet wipes pack. I spread individual packets over my carry-on, checked, and personal items and did not have any airport issues! I used it to wipe clean my body off of humidity and sweat in India. It came in super handy in my bathroom visits to village areas where no water or paper was available. It left me feeling fresh and clean! the size is also very generous as compared to other wet wipes, and I loved how it was not dripping liquid as some wet wipes do. So if you are traveling to India or even anywhere then it's a must-have! just stick some of these in your purse and you are good to go! I would recommend it 100%",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "handiman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV5NBEUS3JRYVWLNBK5VMYBHHWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5BC4B1OX0DU6?ASIN=B00PRJT9RY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Must have",
                "reviewText": "These are great for travel or otherwise. Not to be indelicate, but these will keep you feeling clean and fresh. They also help prevent chaffing on those five mile marathon days on vacation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Merrill Mason",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 31, 2024",
                "reviewTitle": "Handy for travel",
                "reviewText": "Easy to keep in purse or briefcase. Discreet packaging. Very large moistened cloth. Excellent product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 17, 2023",
                "reviewTitle": "Exactly what is advertised!",
                "reviewText": "Decent price and good size!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bridget C. Williams",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 1, 2024",
                "reviewTitle": "tall Mates Wipes: Flushable,",
                "reviewText": "Great for travel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jack",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2024",
                "reviewTitle": "Saved me several times",
                "reviewText": "I've used this both to clean myself and to clean gross public toilets before going on them, and it works perfectly for both uses. They fit perfectly in my shoulder bags.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BEEDOG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2024",
                "reviewTitle": "Good Size",
                "reviewText": "Easy to open, no obnoxious odour and good size for purse.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}