{
    "remaining_requests": 8180,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Depoza-Pack-Travel-Bottles-Set/dp/B0BZ418TWS",
    "body": {
        "name": "16 Pack Travel Bottles Set - TSA Approved Leak Proof Silicone Squeezable Containers for Toiletries, Conditioner, Shampoo, Lotion & Body Wash Accessories (16 pcs/White Pack)",
        "price": "$12.99 ($12.99 / Count)",
        "originalPrice": "$15.98",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Depoza-Pack-Travel-Bottles-Set/dp/B0BZ418TWS",
        "soldBy": {
            "sellerID": "A3G0G5KCBDP62I",
            "name": "Depoza",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3G0G5KCBDP62I&asin=B0BZ418TWS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BZ3X59WV"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BZ3W2P4X",
                "variationName": "Color",
                "variationValue": "16 pcs /Black Pack",
                "price": "$12.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/410JPVzrTHL._SS36_.jpg"
            },
            {
                "asin": "B0BZ418TWS",
                "variationName": "Color",
                "variationValue": "16 pcs /White Pack",
                "price": "$11.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/417yC03ZKyL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/417yC03ZKyL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Tigop9wIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51s2W63HA9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 WPPjaJQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nB3MM6QOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61UMCBmn6LL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518kN7HNs9L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the DEPOZA Store",
            "link": "https://www.amazon.com/stores/TravelingisaspiritualpracticeDepozawillaccompanyyouonyourspiritualpath/page/2EBC76F9-F200-4166-A4C8-4EF62B60446E?ref_=ast_bln"
        },
        "brand": "TravelingisaspiritualpracticeDepozawillaccompanyyouonyourspiritualpath",
        "merchantInfo": "Depoza",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 1184,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 13 hrs 21 mins",
            "Or fastest delivery Tuesday, February 20"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Useful Travel Accessories - This is a practical travel container set inside a zipper box, which includes 4 travel bottles, 4 travel jars, 2 spray bottle, 2 spoons, 1 funnel, 1 cleaning brush, and 1 label, as well as 1 transparent makeup bag. The diverse containers allow you to bring different beauty products and cosmetics according to your needs.",
            "Leak-proof travel bottle - The leak-proof design prevents liquid from leaking or spilling, providing protection for your luggage and clothes. The ball-shaped design ensures that no liquid gets trapped in the corners of the bottle, and helps you use up the last drop of your personal care products without wasting any. We offer leak-proof travel bottles for you.",
            "Wide mouth design for easy filling and cleaning - Unlike most travel bottles, this bottle's wide mouth design makes it easier to pour thicker liquids and allows for easy cleaning with a brush on the inside of the bottle.",
            "No-drip valve - The bottle cap features a no-drip valve that prevents leaks and makes sure you always dispense just the right amount",
            "Lightweight and Portable - All travel accessories are packed in a handy bag, fits in any small space, easy to take on the go and save your toiletry space. Perfect for travel, vacation, plane trip and camp"
        ],
        "description": "Introducing the DEPOZA Squeezable Bottle the ultimate travel companion that combines convenience and versatility. Made from soft, rugged silicone material, this bottle is easy to squeeze and ensures that every last drop is extracted. The large sizes are perfect for air travel, while the smaller, travel-sized bottles make for easy portability on the go. Not only are the DEPOZA travel bottles perfect for storing liquids, but it's also made from food-grade silicone material that can be used for storing salad dressing in your lunchbox. The leakproof design ensures that your gear stays protected, while the wide opening makes for easy filling and cleaning. Whether you're jet-setting around the world or packing a lunch for work, the DEPOZA travel containers are the perfect solution for portability and convenience. Say goodbye to bulky and inconvenient travel bottles and hello to hassle-free storage with DEPOZA bottle.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Tools & Accessories",
                "link": "https://www.amazon.com/Tools-Accessories-Hair-Makeup/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11062741"
            },
            {
                "name": "Refillable Containers",
                "link": "https://www.amazon.com/Refillable-Cosmetic-Containers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11062781"
            },
            {
                "name": "Kits",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23627243011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.9 x 5.1 x 7 inches; 7.83 Ounces"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 762704115403"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ DEPOZA"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0BZ418TWS"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#381 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #1 in Refillable Cosmetic Container Kits"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 1,184 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Are you tired of constantly worrying about leaky or bulky travel containers that take up too much space? Our practical travel container set is the perfect solution! This kit includes 4 travel bottles, 4 travel jars, 1 spray bottle, 2 spoons, 1 funnel, 1 cleaning brush, and 1 label, as well as 1 transparent makeup bag. With its diverse range of containers, you can easily bring all of your favorite beauty products and cosmetics with you on the go.One of the standout features of our set is its leak-proof design. You won't have to worry about any liquid spilling or leaking onto your clothes or luggage, as the bottles are specially designed to prevent any leaks. Plus, the ball-shaped design ensures that no liquid gets trapped in the corners of the bottle, meaning you can use up every last drop of your personal care products without wasting any.Unlike most travel bottles, our wide-mouth design makes it easy to fill up with even the thickest liquids, and the inside of the bottle is easy to clean with the included brush. The bottle cap features a no-drip valve that prevents leaks and ensures you always dispense just the right amount.All of these travel accessories are packed into a handy bag that fits into any small space, making it perfect for travel, vacation, plane trips, and camping. Don't let bulky, leaky containers ruin your next trip - invest in our travel container set for a stress-free, organized, and enjoyable travel experience!",
                "media_link": []
            },
            {
                "media_text": "Introducing the DEPOZA Squeezable Bottle the ultimate travel companion that combines convenience and versatility. Made from soft, rugged silicone material, this bottle is easy to squeeze and ensures that every last drop is extracted. The large sizes are perfect for air travel, while the smaller, travel-sized bottles make for easy portability on the go. Not only are the DEPOZA travel bottles perfect for storing liquids, but it's also made from food-grade silicone material that can be used for storing salad dressing in your lunchbox. The leakproof design ensures that your gear stays protected, while the wide opening makes for easy filling and cleaning. Whether you're jet-setting around the world or packing a lunch for work, the DEPOZA travel containers are the perfect solution for portability and convenience. Say goodbye to bulky and inconvenient travel bottles and hello to hassle-free storage with DEPOZA bottle. Our Advertisement Soft, rugged silicone material that is easy to squeeze and gets every last drop out Large sizes designed specifically for air travel, with smaller travel-sized bottles for portability Food-grade silicone: versatile for dressings & lunch boxes. Leakproof design that protects your gear during travel or storage Wide opening that makes for easy filling and cleaning of the bottle",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f418758-abf1-45b9-a75c-d82b5431b20e.__CR0,0,1500,1500_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "More detail",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55df5c93-f45d-40d5-a082-eae7dcad170e.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9ded144f-c764-4f64-b6c4-42dc59464980.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68174fda-d6ff-43fc-a4d2-675aac9f9f41.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de6d43e7-a2d7-4a29-891b-7451db41c693.__CR0,0,1500,1500_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "DEPOZA 4Pcs Travel Size Bottles TSA Approved 3.4oz Silicone DEPOZA 4Pcs Travel Size Bottles TSA Approved 3.4oz Silicone Portable Perfume Atomizer Spray bottles (Pink) Depoza 16 Pack Travel Bottles Set - TSA Approved Leak Proof Silicone Squeezable Depoza 16 Pack Travel Bottles Set - TSA Approved Leak Proof Silicone Squeezable For Travle ✓ ✓ ✓ ✓ ✓ Refillable ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f418758-abf1-45b9-a75c-d82b5431b20e.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac22c46c-3896-4926-8e4e-0d550b144b01.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96b78a31-b71c-468e-9e6f-4c4f76ac4684.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e0c6a235-ded0-45b3-a7ee-101d7d769d74.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/55df5c93-f45d-40d5-a082-eae7dcad170e.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9ded144f-c764-4f64-b6c4-42dc59464980.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68174fda-d6ff-43fc-a4d2-675aac9f9f41.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de6d43e7-a2d7-4a29-891b-7451db41c693.__CR0,0,1500,1500_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7994c5a1-2be8-4936-ac72-fae087557ff6.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ab10d1f7-d80a-447d-8acd-c10dbd160c24.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/adf05aba-4615-4543-a3e2-4b5c3321f036.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e7f6856f-4042-42c2-9588-3e339bc71c34.__CR0,0,300,600_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9060ebe1-7855-4164-9dc9-13269807a3ee.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/caf416c2-5779-402c-9208-abaa9279a7db.__CR618,0,1164,720_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amanda Root",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECHATNCYZHQGXLRRRV2OL2ITD7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13B46JBPF2LP1?ASIN=B0BZ418TWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Travel Essentials Perfected with Depoza's 16-Pack Bottles Set",
                "reviewText": "he Depoza 16 Pack Travel Bottles Set is a game-changer for anyone who values convenience, organization, and compliance with TSA regulations. This meticulously crafted set of leak-proof silicone squeezable containers has become an essential companion for my travels, and here's why.First and foremost, the TSA-approved design ensures a hassle-free experience at airport security checkpoints. The bottles meet the size requirements for carry-on liquids, allowing you to breeze through without the stress of confiscation. The clear, quart-sized toiletry bag provided adds an extra layer of organization, making it easy to locate your essentials.Leakage is a common concern with travel-sized bottles, but Depoza has conquered this issue with their innovative design. The silicone material not only makes the bottles squeezable for effortless dispensing but also guarantees a tight seal. I've experienced zero leaks, even when the bottles were subjected to various movements and changes in air pressure.The set offers a variety of bottle sizes and types to accommodate different toiletries. From shampoo and conditioner to lotion and facial cleanser, each bottle serves its purpose efficiently. The wide openings make refilling a breeze, and the labels included help distinguish the contents of each bottle – a thoughtful touch for those who like to stay organized.The durability of the silicone material ensures that these bottles can withstand the rigors of travel. They're flexible enough to squeeze out every last drop of product, and the translucent design allows you to monitor the remaining amount easily. The sturdy caps and well-designed spouts further contribute to the overall reliability of the set.Beyond air travel, these travel bottles have proven handy for camping trips, gym sessions, or simply keeping your favorite products on hand in your everyday bag. The versatility of the Depoza 16 Pack extends beyond travel, making it a practical investment for various occasions.In conclusion, the Depoza 16 Pack Travel Bottles Set has truly perfected the art of travel-sized toiletry containers. With a focus on TSA compliance, leak-proof design, and overall convenience, this set has become an integral part of my travel routine. Say goodbye to spills and fumbling through security – elevate your travel experience with these reliable and well-crafted travel bottles.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZYECQMEN6LHNMR2BNCLSWSN25Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA9E92A41950O?ASIN=B0BZ418TWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect assortment of travel containers",
                "reviewText": "Was happy to find a kit that had two larger containers for shampoo and conditioner, which I use the most, and smaller ones for just the right amount of other things. Plus really appreciated the two spray bottles, smaller than the usual travel bottles and perfect for hair spray or body mist. So far the small tubs are proving leakproof, at least for the foundation and hand cream I put in them. The tiny spoons and brush nice touches for filling/emptying and cleaning. Also love how soft the containers are, very easy to squeeze contents out.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maddie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI42AMT5FVGG3GFFMKORFXVGG3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RFP6KA8RSBXT?ASIN=B0BZ418TWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars A convenient and useful product!",
                "reviewText": "I ordered this for a recent international trip I went on. The product worked great, no spillage or leaking in my full suitcase. The stickers they provided were useful for labeling my shampoo, conditioner, etc. I also liked the design of the bottles and the variety of shapes/types and sizes— for example, I put leave in conditioner in the spray bottle and face lotion in the smaller round containers. The clear bag was also nice to see everything that I had packed. Very solid and reliable product!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julia Z.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7KJLA75M7VOHDYBRJF7LWRSYZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CUKCVQRDC9CI?ASIN=B0BZ418TWS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Great set, bright colors, small containers are not super leak proof",
                "reviewText": "This is a nice travel set and I like the spray container. It's also easy to clean each of these. My only issue is that the smallest containers leak occasionally.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFADNXWCVMFCMGZFLJ24C7RDCVXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAJKX3HHM3H2X?ASIN=B0BZ418TWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Travel containers",
                "reviewText": "This is a great set of travel containers. Comes with labels, scrapers, funnel & cleaning brush. So many sizes for liquids & solids. The silicone is so soft & flexible! Sizes are TSA approved & all in a handy bag.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ChiSouthernGirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQK3ZUCXB6FHJ4J3PBQWTBSLNSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGZUFYFME2WNR?ASIN=B0BZ418TWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Great for carry-on & staying within regulations",
                "reviewText": "Great little set. I used it for mouthwash, facial cleanser, toner, and two facial creams as well as shower soap, shampoo, and conditioner. It was perfect. It comes with little scoopers to transfer your creams into the little jars. It made my life easier having this set to accommodate my personal care products.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EvaMc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDAE5AGG2N7OR4HGJVCNMJCRNCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XFW6Q6MKZ0DY?ASIN=B0BZ418TWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for travel",
                "reviewText": "Set is good. Didn't try the spray bottle, but the other ones kept everything in. Only problem I had was with the tiny short transparent ones. Ok for creamy stuff, but not liquids. Had my liquid nitrogena and it kept leaking out during my travel making everything in the pouch a mess, no matter how much I tighten it up.Otherwise, the bigger ones contained more than I expected. Was away for over a week and came back with some bottles still half full.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. HasenP. Hasen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELT2IJDSDV66NLE5XW4HFRU5AKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QTM3OJJM3N9?ASIN=B0BZ418TWS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "My first trip with these to Hawaii and no leaking! The bag fits perfectly in my new toiletry bag and no leaking for me. I also didn’t super fill them up either. I did use shampoo, conditioner, lotion, and facial cleanser. And in the small little pill boxes I put eye serum, face moisturizer and foundation make-up. In the spray bottle I put some Burke Williams essential oil shower spray so we can enjoy it on our trip. So glad these didn’t leak. And very thankful for the little spatulas and the cleaning brush and labels!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71BVFHtvHmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81MK-MxyTzL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}