{
    "remaining_requests": 8114,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Perfume-Refillable-Atomizer-Essentials-Accessories/dp/B0C39568C9",
    "body": {
        "name": "Perfume Travel Refillable Mini Spray Bottles Atomizer Travel Perfume Bottle Refillable Empty Cologne Travel Essentials for Women Mens Small Mister Spray Bottle for Travel Accessories 6 Pack 5ml/0.2oz",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Perfume-Refillable-Atomizer-Essentials-Accessories/dp/B0C39568C9",
        "soldBy": {
            "sellerID": "A10XD6HZ2MH16H",
            "name": "BX INC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A10XD6HZ2MH16H&asin=B0C39568C9&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C64R5SD3"
        ],
        "asinVariationValues": [
            {
                "asin": "B0C9Z4Z7P1",
                "variationName": "Color",
                "variationValue": "12 ml (0.4oz) /pc",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41BdJgnB7JL._SS36_.jpg"
            },
            {
                "asin": "B0C6KTZBXM",
                "variationName": "Color",
                "variationValue": "6 Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41wqbMLJy-L._SS36_.jpg"
            },
            {
                "asin": "B0C6KSF9YB",
                "variationName": "Color",
                "variationValue": "6 Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bcmpByY+L._SS36_.jpg"
            },
            {
                "asin": "B0C39568C9",
                "variationName": "Color",
                "variationValue": "6 Colors",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41iH2oNUZZL._SS36_.jpg"
            },
            {
                "asin": "B0CLXX2MC4",
                "variationName": "Color",
                "variationValue": "6 Gold",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41FtZ-dRwHL._SS36_.jpg"
            },
            {
                "asin": "B0CMPS3S1F",
                "variationName": "Color",
                "variationValue": "6 Green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41WH6O3HfxL._SS36_.jpg"
            },
            {
                "asin": "B0C3LS9CM5",
                "variationName": "Color",
                "variationValue": "6 Pink",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41XomXICqKL._SS36_.jpg"
            },
            {
                "asin": "B0CLXWK7W9",
                "variationName": "Color",
                "variationValue": "6 Purple",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41I5mR1MJTL._SS36_.jpg"
            },
            {
                "asin": "B0CMPSGFHQ",
                "variationName": "Color",
                "variationValue": "6 Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41eUNZtAvqL._SS36_.jpg"
            },
            {
                "asin": "B0CMPST5Y3",
                "variationName": "Color",
                "variationValue": "6 Rose Red",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ENHWVvNUL._SS36_.jpg"
            },
            {
                "asin": "B0CLXWL3W9",
                "variationName": "Color",
                "variationValue": "6 Silver",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41TpaFNKYCL._SS36_.jpg"
            },
            {
                "asin": "B0C3LSPFD9",
                "variationName": "Color",
                "variationValue": "9 Colors",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/4162dQwF5YL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "15",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41iH2oNUZZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51OopcnFGtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hyNgne jL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LgU2bDVtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51YSrVrDK-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410G3kkUWfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pl-Mk7WGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the IMPORX Store",
            "link": "https://www.amazon.com/stores/IMPORX/page/6619B35F-713F-44C7-98E9-432871EFCC73?ref_=ast_bln"
        },
        "brand": "IMPORX",
        "merchantInfo": "BX INC",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1473,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs 8 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【 PREMIUM QUALITY TRAVEL ESSENTIALS 】The outer shell of Travel Perfume Travel Refillable Bottles are made of high quality aluminum and the inside of durable acrylic. The mini spray bottle is perfect as mini perfume refillable bottle travel essentials for women cologne samples for men,plane travel essentials for flying travel accessories travel spray bottle mini perfume set travel bottles for toiletries vacation essentials travel toiletries spray mist bottle mini perfumes for women.",
            "【 VISUAL DESIGN TRAVEL SPRAY BOTTLES 】The small spray bottle uses a visually visible design. The window on the Atomizer Perfume Bottle allows you to monitor the amount of liquid and replenish the empty spray bottles in time. Comes in 6 different metallic colors, this refillable perfume bottle helps you organizing your different scents. Great perfume travel refillable mist bottle sprayer perfume sampler sets for women pocket perfume dispenser travel size perfume for women.",
            "【 TRAVEL SIZE TOILETRIES 】 The size of the Travel perfume bottles is 3.19 x 0.67 x 0.67inches and the volume is 5ml. Lightweight and durable aluminum material makes this atomizer ideal for placing in your handbag or pocket. Easy and can be used with almost all standard perfume bottles! The must-have of travel size toiletries for women spray bottles travel must haves travel size toiletries travel bottles for toiletries mini bottles gadgets for women perfume travel refillable stocking stuffers.",
            "【 EASY REFILL TRAVEL PERFUME BOTTLE REFILLABLE 】 Innovated design with a valve on the base of perfume atomizer, different from the common mister spray bottle, it's easy to refill. Remove the top of your perfume sprayer and insert the tube into the base of the atomizer. Then pump to fill. With each push, perfume sprays into the Atomizer. Finish the refill when its filled, but Do not overfill. Before filling the liquid, squeeze the travel size bottles to remove the air to prevent liquid leakage.",
            "【 NO LEAKAGE MISTER SPRAY BOTTLE 】 This portable perfume atomizer set is airplane safe and it will not broken when drop on the floor, durable and without leaking travel containers for toiletries international travel must haves toiletry bottles for traveling travel size cologne for men travel bottles vacation essentials mister spray bottle travel containers for toiletries travel perfume bottle refillable travel size bottles continuous spray bottle alcohol spray bottle travel toiletry bottles"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Tools & Accessories",
                "link": "https://www.amazon.com/Tools-Accessories-Hair-Makeup/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11062741"
            },
            {
                "name": "Refillable Containers",
                "link": "https://www.amazon.com/Refillable-Cosmetic-Containers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11062781"
            },
            {
                "name": "Spray Bottles",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=23627244011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "IMPORX"
            },
            {
                "name": "Color",
                "value": "6 Colors"
            },
            {
                "name": "Capacity",
                "value": "5 Milliliters"
            },
            {
                "name": "Number of Items",
                "value": "6"
            },
            {
                "name": "Product Dimensions",
                "value": "0.67\"W x 3.19\"H"
            },
            {
                "name": "Special Feature",
                "value": "‎Lightweight"
            },
            {
                "name": "Item Weight",
                "value": "‎2.89 ounces"
            },
            {
                "name": "Included Components",
                "value": "‎Comes as a Combo Set"
            },
            {
                "name": "Product Care Instructions",
                "value": "‎Hand Wash Only"
            },
            {
                "name": "Reusability",
                "value": "‎Reusable"
            },
            {
                "name": "Manufacturer",
                "value": "‎IMPORX"
            },
            {
                "name": "Part Number",
                "value": "‎IMRB-6PACK"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎IMRB-6PACK"
            },
            {
                "name": "Finish",
                "value": "‎Matt"
            },
            {
                "name": "Special Features",
                "value": "‎Lightweight"
            },
            {
                "name": "Usage",
                "value": "‎Outside; Professional"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0C39568C9"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,473 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,059 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #13 in Refillable Cosmetic Spray Bottles"
            },
            {
                "name": "Date First Available",
                "value": "April 28, 2023"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Perfume refill bottle perfume refill bottle travel travel needs black spray bottle pink travel accessories cute travel accessories perfume travel travel bottle set travel must haves for airplane empty travel bottles for toiletries travel squeeze bottle travel toiletry mini cologne for men 1 oz travel bottles travel size containers for toiletries bottle sprayer refillable travel size perfume spray bottles men accessories european travel must haves mini travel items gadgets for women mini water bottle fun stocking stuffers for adults girlfriend stocking stuffers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4076fa1b-a235-44c6-9673-5314e7210858.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Travel Accessories Spray Bottles Travel Bottles For Toiletries Perfume Travel Refillable Perfume Sampler Sets Travel Gifts For Women Travel size containers: perfume atomizer travel accessories for women,travel tools can easily handle security checks on airplanes trains and subways,without hindering your travel.mini perfumes for women plane travel essentials travel kit mini spray bottles atomizer empty spray bottles travel spray bottle spray bottles small mist spray bottles cologne travel bottle refillable travel size toiletries containers perfume bottles empty teacher stocking stuffers.Travel essentials for women airplane travel essentials Travel bottles are suitable for various personnel working on airplanes and are also the best choice for business trips. vacation essentials mister spray bottle travel containers for toiletries travel perfume bottle refillable travel size bottles continuous spray bottle cologne samples for men for toiletries tsa approved travel bottles traveling essentials international travel must haves last minute stocking stuffers.Best travel accessories empty bottles small spray bottles mini spray bottle travel containers for toiletries leak proof small spray bottle 1 oz vacation perfume travel size perfume refill bottle travel toiletries containers travel bottles tsa approved cologne spray bottle travel perfumes for women travel minis perfume travel bottle travel size essentials portable fragrance bottle for travel perfume atomizer bottle refillable stocking stuffers women 2023.preppy perfume amazon travel must haves airplane travel essentials for long flights travel perfume refillable mister bottle perfume rollerball refillable perfume atomizer portable mini refillable perfume atomizer bottle perfume sample bottles refillable travel perfume bottle portable perfume bottle cologne atomizer perfume rollerball empty empty perfume spray bottles mini perfume bottle tiny spray bottles stocking stuffers women.Stocking stuffers for women ladies stocking stuffers adult women ladies stocking stuffers 2023 stocking stuffers for men christmas stocking stuffers for husband fun easter stocking stuffers best stocking stuffers best womens stocking stuffers stocking stuffers bulk adult fun stocking stuffers fir men.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c91e6cb1-3e9c-4fa8-872d-b9c1a7730a2e.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfume Bottles Travel Bottles For Toiletries Tsa Approved Travel Perfume Bottle Mini Items Travel Hacks Travel Size Bottles Refillable perfume spray bottles has pump-to-fill technology for spill free refilling in seconds! No need for any filling tools. Travel essentials perfume refill bottle travel size toiletries great choice for travel accessories spray bottles travel bottles for toiletries perfume travel refillable perfume sampler sets for women travel essentials for flying pink spray bottle stocking stuffers for grandparents teenage girl stocking stuffers.Travel must haves small spray bottle travel size toiletries for women travel size travel toiletries travel containers refillable perfume bottle travel gifts for women perfume bottles empty vintage fun stocking stuffers for men stocking stuffers for mothers oriental trading stocking stuffers mom stocking stuffers.Vintage perfume bottles travel bottles for toiletries tsa approved travel perfume bottle mini items travel hacks travel size bottles for toiletries atomizer spray bottle refillable cosmetic containers airplane essentials travel accessories for airplane coworker stocking stuffers stocking stuffers for women under 10 dollars.Travel toiletries men travel mini perfume refillable atomizer container portable cologne sprayer travel atomizer refillable cologne refillable spray bottle cologne atomizer for men cologne bottle stitch stocking stuffers unique stocking stuffers for women.Perfume travel atomizer perfume decanter kit portable mini perfume refillable bottle refillable cologne bottles for men pocket perfume refillable cologne spray bottle refillable mini refillable perfume atomizer bottle mini atomizer sprayer for perfume refillable travel cologne bottle travel mini perfume refillable savage cologne men eau de perfume mini perfume spray bottle travel size perfume container perfume container for travel.Adult stocking stuffers under 10 dollars mens stocking stuffers funny fun stocking stuffers under 20 dollars cool men's stocking stuffers stocking stuffers for adults in bulk men stocking stuffers for christmas best stocking stuffers women black friday deals 2023 stocking stuffers baseball stocking stuffers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95aab904-b9ed-4a63-aeab-0783f69d9826.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Cologne Travel Bottle Refillable Mini perfume atomizer The spray of this mini perfume atomizer is more delicate and soft, which effectively helps perfume diffuse into the air and leave lasting fragrance. The perfume sprayed out can be quickly and accurately distributed in your body, clothes and everywhere you want. Different Metallic Colored perfume bottles are good for organizing your different fragrances. New Leak-proof design Upgrade the bottom pump device to wrap the perfume interface more powerfully. The perfume spray bottle is made of aluminum material, which will not lead to the leakage of perfume even if it falls on the ground. The matte material coating will not stick other cosmetics on the subpackage bottle when it is placed in the bag, nor will it leave your fingerprint on it, which will always give you a delicate and perfect feeling. Travel size containers Capacity: 5ml Color：Pink, Purple, Silver, Black, Gold, Blue Size: 3.19 x 0.67 x 0.67inches Material: Plastic and Aluminum Package includes: 6 x Mini perfume atomizer the best stocking stuffers",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7b39c72-9feb-4ee8-905a-f5dafcd6f5af.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f8242718-e748-4c3f-a583-e009e9e6ae33.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74dad1f1-a21c-470b-b34c-2980f5cf44b6.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Sampler Spray Bottles: mens cologne sets atomizer sprayer for perfume misting spray bottles mist sprayer travel size perfume for women spray bottles mist sprayer travel accessories must haves travel essentials toiletries travel necessities water mister spray bottle travel size perfume travel size spray bottle unique stocking stuffers for adults funny stocking stuffers for men.TSA approved travel bottle: travel necessities moisturizer container pocket perfume dispenser perfume bottles travel cologne sprayer travel perfume atomizer refillable fine mist spray bottles must haves for women travel must haves for women vacation essentials for women travel gadgets toiletry containers for travel perfume atomizer travel spray bottle small travel items travel bottles.Mini perfume sets for women: perfume spray bottle portable perfume refillable bottle travel leak proof travel bottles airport travel accessories packing essentials for travel traveling essentials for women empty perfume bottles women accessories cologne sampler pocket perfume mens cologne sampler sets stocking stuffers for sister inexpensive stocking stuffers.Bottle spray mens travel accessories travel essentials for women for flying travel size toiletries bottles travel atomizer travel cosmetic containers mens travel size toiletries perfume spray bottle refillable women travel essentials travel size products poison/perfume for women continously mist spray bottle christmas bulk stocking stuffers cyber monday stocking stuffers.Small perfume bottles small bottles for travel travel hacks for women travel size perfume bottle mini cologne spray bottle puppy spray deodorizer perfume travel size setting spray travel perfume holder tiny perfume bottle decant perfume perfume decanter bottles pocket perfume bottle the pocket perfume stocking stuffers women funny.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b98b6351-5796-40b6-9bb6-55aa490f344f.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Perfume bottles empty refillable travel accessories for men mini alcohol bottles womens perfume sampler sets mini travel bottles mini refillable perfume bottle mini perfumes travel cologne for men small perfume spray bottle tsa travel bottles for toiletries refillable travel bottles travel container travel stuff mini spray bottles 1oz perfume decanter travel size body spray pocket perfume fill from bottom perfume container refillable cologne bottle cologne bottle refillable men perfume mini travel refillable perfume bottle mini mister spray bottles mens essentials accessories refillable spray bottle travel cologne bottle refillable travel size cologne refill bottle mens travel size toiletries travel size cologne atomizer cocktail travel size essentials for women perfume dispenser pump purse mini essentials stocking stuffers for men under 10 dollars.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ddb68f80-20b5-4e1b-84c6-38ca49508fe2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4076fa1b-a235-44c6-9673-5314e7210858.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c91e6cb1-3e9c-4fa8-872d-b9c1a7730a2e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95aab904-b9ed-4a63-aeab-0783f69d9826.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b7b39c72-9feb-4ee8-905a-f5dafcd6f5af.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f8242718-e748-4c3f-a583-e009e9e6ae33.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/74dad1f1-a21c-470b-b34c-2980f5cf44b6.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b98b6351-5796-40b6-9bb6-55aa490f344f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ddb68f80-20b5-4e1b-84c6-38ca49508fe2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/019a6f5a-de0d-4fbb-a3f6-193ffa3c9069.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Maurice Liu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7RQQGZYMWNA6GQA7ZSMR6U7VLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUS1ZXX9GVEB8?ASIN=B0C39568C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Perfect for traveling",
                "reviewText": "Bought this for business trips and travel instead of bringing my large bottle of cologne, especially for carry on limits. So far it has been great. Very easy to fill from the base, and the spray work perfectly once filled. It would be enough to last 1-2 weeks, if I use 2-3 sprays every day (I don't use cologne daily, so it seems to really last). The only one thing is that it leaked when bringing onto the plane due to air pressure, but this would essentially happen to anything with liquids. Overall, I would disregard the leaking, as I put it in a sealable bag with some tissue. Would recommend.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashlie McCabeAshlie McCabe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGTUI3UBZNOWM7WT7GNR4L2TOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32M4MFW73O0M1?ASIN=B0C39568C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars LOVE This 😍 You Will Too!!",
                "reviewText": "I’m no longer spending money on travel size versions of my perfumes! Take your expensive large bottles and use these for travel or throw them into your purse to refresh through out the day/night. Love the color options so that my husband or son can use for their colognes! I used the tiny funnel and just poured my perfumes in. Super easy!!! Kit included 2 extra spray nozzles too! All for $8.00 where a travel size of my perfumes can run up to $30 and are 10ml or smaller. I prefer this larger 12 ml compared to a 8 or a 4. This allows me to take this for travel for several weeks. The spray is not too large but not too small. It covers a nice range of skin on my neck but not too big for my wrist. Love this!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vXGsHTlQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81YWYJXahmL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81tAOKPJEOL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terry",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMNY7NYT3JHGPPMJGQSGOYIOFKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RK6DAZYDTFBB?ASIN=B0C39568C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars They work like advertised",
                "reviewText": "I recently purchased a set of Perfume Travel Refillable Mini Spray Bottles Atomizer and I'm really happy with them! They are the perfect solution for taking your favorite fragrances on the go. I have always hated carrying around large, bulky perfume bottles, so these mini atomizers are a lifesaver.**Here are some of the pros and cons of these atomizers:****Pros:*** **Compact and portable:** These atomizers are small and lightweight, so they are easy to toss in your purse or travel bag.* **Leak-proof:** I haven't had any problems with these atomizers leaking, even when I've thrown them in my bag.* **Easy to refill:** The atomizers have a simple pump-to-fill system that makes refilling them quick and easy.* **Durable:** I've dropped these atomizers a few times and they haven't broken.* **Affordable:** These atomizers are very affordable, especially when you buy them in a set.**Cons:*** **Limited capacity:** Each atomizer only holds 5ml of perfume, so you may need to refill it frequently if you use it often.* **Not suitable for all perfumes:** Some perfumes with thick consistency may not work well with these atomizers.**Here are some tips for using these atomizers:*** **Before filling the atomizer, spray a few times into the air to clear out any air bubbles.*** **Don't overfill the atomizer, as this can cause it to leak.*** **Store the atomizer in a cool, dry place.****Overall, I would highly recommend these Perfume Travel Refillable Mini Spray Bottles Atomizer. They are a great way to take your favorite fragrances on the go without having to lug around a bulky perfume bottle.****Here are some additional details about the product:*** **Material:** Glass and aluminum* **Capacity:** 5ml* **Colors:** Available in a variety of colors* **Price:** $10-$15 for a set of 4",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cat Redmon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEV2F74FGLJVCMLOLCECWYN6WRYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FS331G6LP9AZ?ASIN=B0C39568C9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "4.0 out of 5 stars Not all leak proof",
                "reviewText": "Most of the bottles worked great but if the 4 I've used 1 of them leaked right out of the bottom.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TM ConwayTM Conway",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHE6A2KMCMQSOHCMNE7JQHSAHTRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24NYPISCXLXUE?ASIN=B0C39568C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars REALLY nice",
                "reviewText": "I like that these are larger (12 ml instead of 10 ml) than some others I have. Having different colors (which are all pretty) is nice. I gifted some DIY fragrances to the ladies in my family, and I'm pretty sure they liked the bottles as much as they did the fragrances!These, thankfully, do NOT leak. The glass tubes fit VERY tightly inside the metal cylinders, and that's a good thing for when traveling, but it does take some effort to remove them. The accessories are really decent. I was worried they would be flimsy, but they work really well. I especially like the metal funnels because they are the right size & don't tip over the container.If I have to buy more atomizers, it will be these. I actually came back for this set after buying one a few days before. They are that nice & I love the pricing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61EhZKAPdKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61WHyonMVWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dWL2wx9DL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Neesh ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXWULMGBEMQCWBU25RCQL6YQ2UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22DWCFJ2RGK79?ASIN=B0C39568C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Comes in handy",
                "reviewText": "These are very handy and great for traveling with. They all spray perfectly fine. Need to order more for all my perfumes😭 They don’t fit all bottles of perfume though, that’s my only issue.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC5ZWAOLOMVOD2N543EMUNGCLMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ46T6UDKP8JC?ASIN=B0C39568C9",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "3.0 out of 5 stars Almost great",
                "reviewText": "Used these for a long trip. They were easy to fill but one leaked after two weeks and one slow leaked for two weeks. Probably better quality out here.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Orlando A. Velazco",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBMEQI7RMGT52UIGYI3DZICSJKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LO4QOJLWWCVX?ASIN=B0C39568C9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing product! Perfect for travel!",
                "reviewText": "Yeah, so I recently went to a conference and couldn't pack any of my scents so I purchased these to transport my fragrances with me. Easy to fill and none have leaked yet. Atomizers provide great dispersal area. Super happy with this purchase. And ironically, I have 5 colognes and 5 of the bottles match the colors. Anyone has suggestions for a EdP cologne that would aesthetically match the pink atomizer? Lol!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}