{
    "remaining_requests": 11580,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ecopiggy-Rounded-Natural-Pacifier-0-6m/dp/B003LVXSQ8",
    "body": {
        "name": "Ecopacifier Natural Rubber Pacifier Round 0-6m (1pk)",
        "price": "$12.50",
        "originalPrice": "$14.50",
        "rawPrice": 12.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ecopiggy-Rounded-Natural-Pacifier-0-6m/dp/B003LVXSQ8",
        "soldBy": {
            "sellerID": "AG5MZBNLOTOZT",
            "name": "Junni",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AG5MZBNLOTOZT&asin=B003LVXSQ8&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07CRKBBKY"
        ],
        "asinVariationValues": [
            {
                "asin": "B003LVXSQ8",
                "variationName": "Size",
                "variationValue": "1 Count (Pack of 1)",
                "price": "$12.50",
                "variationImageURL": ""
            },
            {
                "asin": "B003LVXSQI",
                "variationName": "Size",
                "variationValue": "6 months+",
                "price": "$12.50",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41AtG7SGJUL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/314DOu3sCdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31IhmdA1FCL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Ecopiggy",
            "link": "https://www.amazon.com/Ecopiggy/b/ref=bl_dp_s_web_2591072011?ie=UTF8&node=2591072011&field-lbr_brands_browse-bin=Ecopiggy"
        },
        "brand": "Ecopiggy",
        "merchantInfo": "Junni",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 420,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Sunday, February 18. Order within 3 hrs 59 mins",
            "$6.99 pickup Tuesday, February 20",
            "Or fastest pickup Sunday, February 18. Order within 7 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "natural rubber pacifier, plastic-free, bpa-free, pvc-free, paraben-free, no chemical-softeners, no colorants"
        ],
        "description": "Ecopiggy Ecopacifier is the preferred natural rubber pacifier. Sustainably made from 100% natural rubber, from the tree Hevea Brasiliensis, ecopacifier is softer and more natural than artificial silicone. Our round shield lightly touches the child’s nose, simulating the soothing feel of breast feeding. Ecopacifier’s single-piece design ensures no small pieces to gather dirt and germs, and no small pieces means no choking hazards. Ecopiggy natural rubber pacifiers are made without chemical softeners or colorants, and are BPA-Free, Phthalate-Free, PVC-Free, and Paraben-Free. Children love the natural soothing effects of Ecopacifier, offered in two styles; Orthodontic and Rounded. Due to the soft quality of Ecopacifier, our natural rubber pacifier will not leave marks on your child’s face. Child happy. Parents happy. Ecopiggy’s Natural Pacifier, Ecopacifier, is made of 100% pure rubber from the rubber tree, Hevea brasillensi. These trees are sustainably grown in plantations in Malaysia. The rubber tree exudes a latex sap, the world's primary source of natural rubber, which is tapped in a similar manner to maple syrup from a maple tree. After about 20-25 years the tree stops producing latex sap. The trees are then harvested and replanted. The harvested wood is used extensively in furniture, flooring, construction and even toys. From seed to tree to ecopacifier to wooden toys, the Rubbertree has an eco-friendly, sustainable and high quality life. Ecopacifier is sustainably made in Malaysia. Ecopiggy is committed to offering the highest quality, natural products. We feel it’s equally important to think of the overall footprint when manufacturing products, so we manufacturing our natural rubber pacifiers right at the source of natural rubber! They ship consolidated, and are once again hand-inspected and packaged in the USA. Happy Earth. Happy Families.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Baby Care",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17720255011"
            },
            {
                "name": "Pacifiers, Teethers & Teething Relief",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17720259011"
            },
            {
                "name": "Pacifiers",
                "link": "https://www.amazon.com/Baby-Pacifiers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2237476011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎1.5 x 2.5 x 4.25 inches"
            },
            {
                "name": "Item model number",
                "value": "‎0094922014146"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Material Type",
                "value": "‎Rubber"
            },
            {
                "name": "Material Composition",
                "value": "‎100% natural rubber"
            },
            {
                "name": "Material free",
                "value": "‎PVC Free, BPA Free, Phthalate Free"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Item Weight",
                "value": "‎0.64 ounces"
            },
            {
                "name": "ASIN",
                "value": "B003LVXSQ8"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 420 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#44,229 in Baby (See Top 100 in Baby) #838 in Baby Pacifiers"
            },
            {
                "name": "Brand",
                "value": "Ecopacifier"
            },
            {
                "name": "Material",
                "value": "Rubber"
            },
            {
                "name": "Material Type Free",
                "value": "PVC Free, BPA Free, Phthalate Free"
            },
            {
                "name": "Pattern",
                "value": "Solid"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jensookim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIM5VEFOKFDHEVVXJYOUKPZPDZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M08LD5595LOA?ASIN=B003LVXSQ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2020",
                "reviewTitle": "5.0 out of 5 stars Squishy and perfect, we LOVED it",
                "reviewText": "We LOVED this pacifier! I know it says to replace after a few months but it took a year for me to notice any stickiness or wear on this thing. It was super squishy and my son who is a belly sleeper could sleep with it without knocking it out of his mouth constantly. He would only suck on this and the Bibs pacifiers but if I let him choose he would choose this one. After a year of using it I finally threw it away when it got sticky but he only used it at night and during naps. It never had any tears or wear on it. In fact my second son used it for a few times before I put it in storage for 2.5 years. I thought it was too long of a nipple, I thought \"what newborn baby would suck on this?\". He just didn't like pacifiers. I was going to get rid of it but I thought I'd give it a wash and see if my third son would like it and he did, right away! And after washing, it still looked good so we kept it. A great gift for someone who is going to be breastfeeding or naturally minded. If I have another child I'll be getting another.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ladybug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERLWO7ATGG25DG7H4XAC5QRRE7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PZOIKHXU4DM?ASIN=B003LVXSQ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2017",
                "reviewTitle": "5.0 out of 5 stars I love it. The first week or two after he ...",
                "reviewText": "My baby is now 5 months old and this is the only pacifier I have used for him. If I had another baby I would buy this again. I love it. The first week or two after he was born, I thought the pacifier might be too big for his tiny newborn mouth. However, I gently encouraged him, putting it back in his mouth again after he would push it out, and by his third week he was loving it. Now, at 5 months, he still loves it and he likes to hold onto the big looped \"handle\". He can play with it and sometimes even put it in and out of his mouth by himself. Since the whole thing is soft and rubbery, he sometimes chews on the sides of it as well as sucking it the way it was intended. As every parent knows, waking from a dead sleep at midnight to find a pacifier that the baby can't get back in his mouth is not a favorite task. Hurrah for a soft, comforting pacifier that the baby can hold onto and get in his mouth by himself at an early age!Update: Baby is now 7 months old and still loves this pacifier. However, the second pacifier (which I bought to use in case we lost the first one) is so much smaller that my baby doesn't like it. It looks the same as the first one except for the size, which is significantly smaller. I double-checked my order and I had in fact ordered the exact same thing as I ordered the first time.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Y. Lario",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETQ2I3ZSMSYKKLZD4733CDMD6ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R50HN0NVDKZGO?ASIN=B003LVXSQ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2014",
                "reviewTitle": "5.0 out of 5 stars Good for exclusive breast feeders !",
                "reviewText": "I actually purchased this for my hopefully soon to be born son. I had it sterilized and ready to roll for him however this weekend we had a family party at my house and my cousins 2 1 /2 week old baby came to visit ♡ she's exclusively breastfed and her mother has tons of milk however the baby loves to pacify on the breast as well even after a feeding. She told me that the baby refuses pacifiers any pacifier she's attempted and so she will put her to breast only to have her spit up from over eating :/ well my light bulb went off and I brought out my son's eco piggy to have her try it... drum roll please..... she LOVED IT! I ended up giving it to her and ordered another, just wish I could find these in store so they wouldn't cost so much after shipping and handling is tacked on :/ other than that I have no complaints , definitely recommend it for exclusive breast feeding mama's who needfor say a long car ride or to simply get 15 minutes of mommy time to shower lol",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Medici",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGP5L6HI6BRVHXXZ2BOEIARJCU6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I5QCEX9032TE?ASIN=B003LVXSQ8",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "3.0 out of 5 stars My child doesn’t like this but it’s not the manufacturers fault",
                "reviewText": "Product is as described but my child prefers the smaller pacifiers that are molded to fit around his nose and chin. He spits this out I think it’s just too big for his preference.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montana folks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3OGDZJOBJCPMB62K5MJJDLSJKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BWLPJZPCJWMT?ASIN=B003LVXSQ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2014",
                "reviewTitle": "5.0 out of 5 stars I really like the pacifier",
                "reviewText": "I really like the pacifier, however it is a little big for my 5 month old. He is almost 20 lbs, so he is bigger and it is still too much for him. I am anxious for him to grow in to it because I am very happy with the pacifier and quality.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Henderson ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHSBO3HXYFRPXDFKWZNT62RONYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U8Q3PYBE44EW?ASIN=B003LVXSQ8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2019",
                "reviewTitle": "4.0 out of 5 stars Perfect for breastfeeding",
                "reviewText": "This replaced the other pacifier I had forgotten where I ordered from. I like that the bulb was smaller so it helped my LO ween into a regular pacifier. I like the bump because it stays in and now that he’s teething he can pull it out a little and teeth on the sides and the holder. I did notice a slight rubber scent that doesn’t really go away. I’d buy again though",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Sanchez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELYQA7CCUYAC6SI5A6E2LHNRAPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVDLWY7T8K3L5?ASIN=B003LVXSQ8",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2016",
                "reviewTitle": "1.0 out of 5 stars Not the greatest.",
                "reviewText": "Smells horribly, like a rubbery chemical scent. I gave it a shot despite the bad reviews of the smell. My baby immediately spit it out. Plus I wouldn't want my baby smelling it that close. Also the nipple is large and round. Too big for my baby's mouth. And it discolors after sterilizing. I did not like anything about this product.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brittany EBrittany E",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKWQYGVFRLXQ2K4BDTVEBBBN72Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UUIX8M35MDCK?ASIN=B003LVXSQ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 8, 2019",
                "reviewTitle": "5.0 out of 5 stars Our 6th Pacifier and Finally a Winner!",
                "reviewText": "Great paci! We chose not to introduce a pacifier until our son was almost 5 weeks old and my milk was fully producing. Long story short, this was our 6th pacifier. He took to it almost immediately! Within 15 mins he had the hang of it. I followed instructions and boiled it for a few minutes. I did not notice the rubbery smell mentioned in some other reviews. We had tried MAM, Nanobebe, Soothies, Wubanub & a few others and this has been the only one he’s been able to keep in his mouth. He only really needs it for naps and car rides, but with him having to go into daycare I was worried about him not being able to keep one in these first few months. I’m so thankful we found this one! (side note, we will be working to switch to an orthodontic pacifier once he begins to get teeth should he still be using a pacifier then)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/814jt0K94-L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.50",
                "sellerName": "Junni",
                "sellerRating": "5"
            }
        ]
    }
}