{
    "remaining_requests": 11812,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/WubbaNub-W32430-Brown-Monkey-Pacifier/dp/B0028IDXDS",
    "body": {
        "name": "WubbaNub Infant Pacifier - Monkey",
        "price": "$16.95",
        "originalPrice": "",
        "rawPrice": 16.95,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/WubbaNub-W32430-Brown-Monkey-Pacifier/dp/B0028IDXDS",
        "soldBy": {
            "sellerID": "A32VEP1U5Q7HGC",
            "name": "The WubbaNub Store, LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A32VEP1U5Q7HGC&asin=B0028IDXDS&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31ZS8PHJbgL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31dbavmdh2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ZT0MeY1FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AGnMcq IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PI020uFRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81WYVhu8sML.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/36d2ed7e-b90d-5710-8bf1-fd2bbf4090bc/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WubbaNub Store",
            "link": "https://www.amazon.com/stores/WubbaNub/page/CC2089CD-2549-43D6-AB08-668CA25E6E4E?ref_=ast_bln"
        },
        "brand": "WubbaNub",
        "merchantInfo": "The WubbaNub Store, LLC",
        "customerReview": "4.9 out of 5 stars",
        "customerReviewCount": 5028,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 21 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "plush: polyester Fibers Pacifier: 100% silicone",
            "Imported",
            "WubbaNub Brand- The Original Pacifier/Plush Animal combination",
            "Durable one piece construction is both functional and stylish. Patented design makes it easy for baby to grasp",
            "Made with 100% silicone pacifier. Latex free, BPA, PVC and Phthalate free",
            "Recommended for newborns through six months. (Not suggested for babies with teeth or in teething stage)"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Baby Care",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17720255011"
            },
            {
                "name": "Pacifiers, Teethers & Teething Relief",
                "link": "https://www.amazon.com/b?ie=UTF8&node=17720259011"
            },
            {
                "name": "Pacifiers",
                "link": "https://www.amazon.com/Baby-Pacifiers/b?ie=UTF8&node=2237476011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "‎6 x 8 x 2 inches"
            },
            {
                "name": "Item model number",
                "value": "‎MPY-WB-22330"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Safety warning",
                "value": "‎Do not tie pacifier around child's neck as it presents strangulation danger."
            },
            {
                "name": "Target gender",
                "value": "‎Unisex"
            },
            {
                "name": "Material Type",
                "value": "‎Silicone"
            },
            {
                "name": "Material Composition",
                "value": "‎plush: polyester Fibers Pacifier: 100% silicone"
            },
            {
                "name": "Material free",
                "value": "‎BPA, latex and PVC Free"
            },
            {
                "name": "Additional product features",
                "value": "‎Original plush pacifier for over 20 years"
            },
            {
                "name": "Number Of Items",
                "value": "‎1"
            },
            {
                "name": "Best uses",
                "value": "‎Pacifier"
            },
            {
                "name": "Batteries required",
                "value": "‎No"
            },
            {
                "name": "Is portable",
                "value": "‎No"
            },
            {
                "name": "Item Weight",
                "value": "‎1.6 ounces"
            },
            {
                "name": "Country/Region of origin",
                "value": "‎China"
            },
            {
                "name": "ASIN",
                "value": "B0028IDXDS"
            },
            {
                "name": "Customer Reviews",
                "value": "4.9 4.9 out of 5 stars 5,028 ratings 4.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,157 in Baby (See Top 100 in Baby) #105 in Baby Pacifiers"
            },
            {
                "name": "Brand",
                "value": "WubbaNub"
            },
            {
                "name": "Color",
                "value": "Brown"
            },
            {
                "name": "Material",
                "value": "Silicone"
            },
            {
                "name": "Material Type Free",
                "value": "BPA, latex and PVC Free"
            },
            {
                "name": "Pattern",
                "value": "Animal,Monkey"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Fall in love with our award winning WubbaNub Pacifier, the original part plush, part pacifier. The patented WubbaNub design is sure to be your baby’s first friend. The unique style of the original WubbaNub Pacifier allows it to remain near baby’s mouth, easy to grasp, nearly impossible to lose and may assist baby to self soothe. WubbaNub is distributed in hospitals, NICU and well-baby units nationwide and is made with a 100% silicone pacifier, a non-latex and BPA, PVC and Phthalate-free. The durable one-piece construction of the pacifier means no germs hiding between cracks. WubbaNub is a safety-first company that mandates all infant/baby products are completely safety tested. NOTE: WubbaNub Pacifiers purchased online are packaged in a clear polybag with header card that further describes features and benefits. For additional details and support please refer to the links below.",
                "media_link": []
            },
            {
                "media_text": "WubbaNub Infant Pacifier - Monkey",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/CeZaOfNNRjGV._UX220_TTW__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/cSG2Qf8jQnmo._UX220_TTW__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/I3uoBKxTsa._UX220_TTW__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/jw93rllcS0y._UX220_TTW__.jpg"
                ]
            },
            {
                "media_text": "WubbaNub Brand- The Original Pacifier/Plush Animal combination Durable one piece construction is both functional and stylish. Patented design makes it easy for baby to grasp. Distributed in hospitals, NICU and well-baby units nationwide. Made with 100% silicone pacifier. Latex free, BPA, PVC and Phthalate free. Recommended for newborns through six months. (Not suggested for babies with teeth or in teething stage)",
                "media_link": []
            },
            {
                "media_text": "NOTE: WubbaNub Pacifiers purchased online are packaged in a clear polybag with header card that further describes features and benefits. For additional details and support please refer to the links below. Product measures approximately 7 x 5 x 2 inches.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/673f3a66-b820-43a5-8e00-7b9f4dba71f0.__CR0,23,990,612_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Matching Monkey Lovey WubbaNub-Monkey-Lovey Is there anything better than a fun-loving companion? Our Monkey Lovey is the familiar first friend that your baby will recognize from our WubbaNub family and have tons of WubbaNub fun for playtime. Designed with an ultra-soft plush for the cozies and playful rattle for the giggles, WubbaNub Monkey Lovey is the perfect companion that your baby will Wub! WubbaNub Monkey Lovey can be found on Amazon and Lovey dimensions are approximately 14 x 8 x 4 inches",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/cba67322-ebc9-4e61-b132-6693ec24d55e.__CR0,401,2100,1299_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/baf1c0dc-363c-4fb1-9c06-c59293b5bbbd.__CR0,166,737,221_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/CeZaOfNNRjGV._UX220_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/cSG2Qf8jQnmo._UX220_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/I3uoBKxTsa._UX220_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A32VEP1U5Q7HGC/B0028IDXDS/jw93rllcS0y._UX220_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/673f3a66-b820-43a5-8e00-7b9f4dba71f0.__CR0,23,990,612_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/cba67322-ebc9-4e61-b132-6693ec24d55e.__CR0,401,2100,1299_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GIA's Mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHMH3RY675VGIJB7BGBPCA2HY6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X186IN4XVUF0?ASIN=B0028IDXDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2012",
                "reviewTitle": "5.0 out of 5 stars Same hospital pacifier material and I haven't lost one yet!",
                "reviewText": "I first bought these when I again had to replace the 12 pacifiers that had gone missing. My daughter had grown accustom to the feel of the hospital brand pacifiers since she spent a couple of months there after birth. I came across these and bought them because they were super cute but was unsure if my daughter would like them. Previously I had bought pacifiers that looked like the ones the hospital provided but were not. The plastic used to make them were shiny and for whatever reason my daughter had no interest in them. I later discovered that the Gum Drop pacifiers were identical to the ones provided by hospitals. They have a vast variety of styles and colors like GumDrop Pacifier Full-Term Natural Scent Orange 5 Pack and Gum Drop Preemie Pacifier Vanilla Scent (Green) for preemies. These wubbanubs were in fact made of the same material and perfect for my little one. I only wished I had found them sooner since my other two children are grown. I could have saved myself from trips to the crib in the middle of the night to give baby back her pacifier. These pacifiers are perfect for little hands to find and grab in the middle of the night. My daughter just puts her own pacifier back in her mouth. I have yet to lose these unlike the gazillion other pacifiers I have purchased over the years. They make a great toy for baby as well. While the pacifier is in her mouth she tends to play with the plush and tag. It is a somewhat meditative motion that helps to sooth her and/or occupy her in her carseat/stroller/crib. So not only is it a pacifier and toy but it helps build motor skills. There are a number of different colors, animals and even textures like this one Wubbanub Plush Pacifier Toy, Mango Monkey . The WubbaNub Tabby Kitten is my favorite. I have noticed that it is slightly smaller than the other ones I've purchased but my daughter loves it just the same. The pacifier itself is sewn very well to the plush, however, I usually cut the pacifier out after its seen some wear. Just as a caution. Once you stitch the the hole back you have another little toy for baby to play with unlike the plain pacifiers that you have to dump. They make great gifts and additions to a shower basket. I have bought many for my friends. When you think of the must haves in baby gear, I personally would add this to my list.Update: To wash or sterilize, I place a small plastic sandwich bag around the plush to prevent it from getting wet. I can then wash the pacifier with warm water and anti-bacterial soap or clean with a baby safe sterilizer. Then I just take a sterile wipe or even a baby wipe to gently rub the plush doll. It has worked well for me and keeps baby's gear germ free.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sanmacd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM3DBSIY7DNVN5U4X3TQBZUNDJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PQCJ6SMN8ILF?ASIN=B0028IDXDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2016",
                "reviewTitle": "5.0 out of 5 stars Great for stimulating baby's development",
                "reviewText": "This is wonderful. I used this for my child and buy them for others. Yes, it is a binky. But it's easier to break the binky habit than it is to break the thumb sucking habit. The pacifier itself is the exact same one the hospital gave me when my child was born. I got one with a stiffed animal attached for multiple reasons, but mostly because we got tired of always bending over to pick it up when my 2 month old would spit it out of his mouth.So after using one for about a year, here's what we have learned. The fabric of the animal is soft and gives baby a feel of texture. It is light weight, yet stays put on baby when spit out. Don't have to keep bending over to pick it up. Teaches baby eye- hand coordination by baby putting it in and out of the mouth at 3-6 months old. Teaches self soothing, by baby being able to put it in his/her mouth on their own. And of course, easy to get rid of without having to worry about continued thumb sucking.It is not machine washable, but can be spot cleaned. Ours lasted about a year before we stopped using it, when our son began to teethe, and the pacifier was still holding well, no chips etc. It is NOT recommended to continue to use this once baby begins teething. And of course, it's a cute monkey!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGBWTTLD26UURX2Y42W4L7PSJ7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R276AP2AG34UC6?ASIN=B0028IDXDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Baby like’s it",
                "reviewText": "This the second one I purchased. Used by by both my granddaughters. Very cute and they both liked the monkey.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carrie RogersCarrie Rogers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENEVJH3U3MYSPDNE6VBEQCW2V4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LON9MNN82MZP?ASIN=B0028IDXDS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2014",
                "reviewTitle": "5.0 out of 5 stars Clean often--your baby will love all over it! -- updated with a warning for older kids",
                "reviewText": "After stumbling into my six-month-old's bedroom in the middle of the night and searching around her crib for her paci in the dark, I posted a little rant on Facebook about how pacis should glow in the dark. A flood of friends commented that I need to forget the simple paci and graduate to the wubbanub.Okay, I thought, I'll try it. After a month, i love it! Here are my thoughts:Pros:--my daughter can easily hold it and put it in her mouth. She doesn't quite have the motor skills to get the nipple of the paci in her mouth without the Wubbanub attachment.--The hands and feet have little beany things in them, which makes them fun for my daughter to chew on. She's teething now and I think those beany things provide a nice texture for her. The fabric material of the Wubbanub is also soothing to her while she munches down on the feet and hands of the little monkey.--It's machine-washable! Wahoo!Cons:--This thing is filthy. My daughter has been chewing on it a lot lately because of the teething thing. In fact, she doesn't really use the paci part at all right now. So because the fabric part is in her mouth so much, it's a really dirty toy. I would absolutely recommend buying a darker color Wubbanub and washing it often. I have friends that have lighter color ones and they just look so, so dirty and gross.--My daughter is in a dropping phase. We love toys that can be hooked onto her seat or stroller. Unfortunately, this monkey Wubbanub cannot be hooked onto anything. I could probably improvise by either making a hook thing myself with a suspender clip and ribbon, but it would be great if this came with a loop that I could hook a ribbon or other pre-made device through.All in all, my friends are right: the Wubbanub is fantastic and my daughter absolutely loves it!Updated 5/13/2016When my second daughter was born, we bought another monkey \"Wubby\" for her and she has slept with it every night since she was about 3 months old. I put a paci clip through the hole in the pacifier so she can have it attached to her pajamas and never lose it at night. This has been the perfect solution to every missing paci issue.However, a couple of weeks ago (when she was 18 months old), she bit off the tip of the pacifier. I couldn't find it anywhere and assumed she swallowed it...I found it yesterday on the living room floor (no idea how it got there). I contacted the company to let them know what happened and to ask if this is normal. Most of my friends have wubbys and use them for years as their security toy. The company said that the Wubbanub is not for older babies--just babies 0-6 months old and that they are working on products for older kids. SOOOOO...bear in mind that the Wubby is only for babies 0-6 months. The company refunded my money, which I thought was an incredibly nice gesture that I didn't even ask for.I let my 18 month old have the monkey part of the wubby with the nipple cut off so she can't chew it off any more. The monkey stays with her in her crib at night and is her favorite toy/security item.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81dwzA8RLvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Casual Wrist",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2023",
                "reviewTitle": "It’s fantastic",
                "reviewText": "Easy to find in the middle of the night in the crib. It’s a staple in our home. We’ve got like 5 and my little man loves them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "aurore ide",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 3, 2019",
                "reviewTitle": "Cadeau ideal",
                "reviewText": "Cette tétine permet une prise facile à mon fils grâce à la peluche.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Imogen cain",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 17, 2018",
                "reviewTitle": "Really good buy for breastfed baby",
                "reviewText": "This is the only dummy my breastfed baby would take. I tried the same dummy without the teddy but he kept dropping it and getting frustrated. He now loves grabbing it for himself. Very easy to clean and a good size in his mouth (7 months)",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pablo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on May 22, 2018",
                "reviewTitle": "Un capricho práctico",
                "reviewText": "Fue el primer chupete de mi bebé, probé con otros que no le gustaron, pero éste, como lleva incorporado el chupete de avent que es redondito, le encantó. Es cierto que hasta los tres meses no le ha hecho mucho caso al peluche pero aún así era muy práctico para encontrarlo rápido en la cuna y muchas veces se quedaba dormido acariciando el peluche.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Avna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 1, 2015",
                "reviewTitle": "Die beste Entscheidung für Babys!",
                "reviewText": "Ich habe sehr lange nach den richtigen Beruhigungssauger für meine Tochter gesucht. Da sie als Neugeborene Schwierigkeiten hatte andere Sauger zu akzeptieren und sich davor geekelt hatte und sie aber einen Saugersatz brauchte, da ich nicht länger stillen konnte, wurde ich nach sehr langem Suchen und Ausprobieren fündig!Die schmale Form ist perfekt für kleine Baby Münder und nicht so riesig wie manch andere. Dadurch das es keine Ränder und Löcher gibt, ist er sehr hygienisch und Kinder bekommen dadurch keinen Mundsoor, wie meine ältere Tochter es oft hatte mit anderen Schnullern!Dadurch das ein niedliches Stofftier dran ist, kann das Kind es wirlkich gut kuscheln, bei Säuglingen ist es zum Vorteil da der Nucki oft rausfällt, hier aber durch das Gewicht im Mund bleibt, oder man kann den Nucki neben dem Babykopf legen, so das es Luft bekommt, aber den Nucki im Mund behält. Also wenn das Baby seitlich liegt kann man den Nucki gut so legen dass er drin bleibt, ohne das er rausfällt. Wenn das Baby auf den Rücken liegt, platziert man den Nucki auf der brust und es kann das Stofftier begutachten und gleichzeitig dabei saugen.Meine Kleine ist nun 1 Jahr alt und er ist einfach ihr liebster Gegenstand, er ist ihr Beruhiger in allen Situationen, er kommt immer mit, er wird stets gebraucht und geknuddelt - und wehe nicht!Es ist einer der besten Erfindungen und wird wenn sie älter ist und den Sauger nicht mehr braucht, als Stofftier dienen, dann muss man den Sauger eben abtrennen.Ich hab mich für den Affen entschieden, da er super auf den Bauch liegt, man kann ihn gut formen so wie man ihn braucht. Dadurch das man die Arme und Beine auseinander machen kann, liegt der Nucki perfekt so dass er nicht runterfällt, selbst wenn das Baby sich bewegt, bleibt er in Position, so dass es sich auch selbst helfen kann. Später, nimmt ihr Baby den Nucki sowieso so wie es will. Er eignet sich übrigens auch super oder gar besser als manch Beißringe!!! Das muss man noch dazu sagen. Wenn ihr Baby anfängt zu zahnen wird es auch darauf rumkauen und er wird dadurch nicht kaputt gehen! Es ist ein geniales Ding und den Preis Wert! Wie gesagt er wird von Anfang an geliebt und passt sich der Mundform an, ist angenehm zum saugen und einfach ein \"Must Have.\"",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}