{
    "remaining_requests": 49898,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/amazon-fire-tv-65-inch-omni-qled-series-smart-tv/dp/B0BJMGB9RN",
    "body": {
        "name": "Amazon Fire TV 65\" Omni QLED Series 4K UHD smart TV, Dolby Vision IQ, Fire TV Ambient Experience, local dimming, hands-free with Alexa",
        "price": "$679.99",
        "originalPrice": "$799.99",
        "rawPrice": 679.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/amazon-fire-tv-65-inch-omni-qled-series-smart-tv/dp/B0BJMGB9RN",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BFDHS11P"
        ],
        "asinVariationValues": [
            {
                "asin": "B09N6LRBTR",
                "variationName": "Size",
                "variationValue": "43-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09N6TPZ1K",
                "variationName": "Size",
                "variationValue": "50-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09N6ZRH6C",
                "variationName": "Size",
                "variationValue": "55-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BJMGB9RN",
                "variationName": "Size",
                "variationValue": "65-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09N6Y5BTL",
                "variationName": "Size",
                "variationValue": "75-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BJMGB9RN",
                "variationName": "Configuration",
                "variationValue": "TV only",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Configuration",
                "variationValue": "with 4-Year Protection Plan",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Configuration",
                "variationValue": "with Alexa Voice Remote Pro",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/412TIqdiXGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41lzEESe7HL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61WbCwT00WL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F-MUs7JjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-TkJ6lYdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SO5-9UK6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61dANfwjILL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3f216376-8d0d-445b-8fbe-54cfd4b97eb6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4bfa36f5-218c-4df7-bae1-a294b872aa8c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/033e6485-cc3f-47f8-b728-dcc856e437a1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dc87f842-f0b7-4d60-95d1-8e4bbb23b6b1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/837d720a-56e1-4fb3-b230-12b8df0e0418/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/34002a77-5f20-414d-80e8-2612f545db19/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 2967,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 16 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Stunning 4K Quantum Dot Display (QLED) - Makes movies, shows, and live sports pop in brighter, richer, and more lifelike colors.",
            "Advanced HDR - Scenes leap off the screen in deep, realistic color with Dolby Vision IQ and HDR10+ Adaptive. HDR10 and HLG are also supported.",
            "Adaptive Brightness - Fire TV automatically optimizes the brightness of movies and shows through a built-in sensor that detects the lighting in your room.",
            "Bolder contrast - Experience deeper darks and brighter whites with full array local dimming in 80 individual zones enhancing contrast.",
            "Fire TV Ambient Experience - Turns your TV screen into a canvas for displaying over a thousand pieces of free artwork, personal photos, helpful Alexa widgets, and more.",
            "Watch what you want - Stream over 1.5 million movies and TV episodes. Watch favorites with subscriptions to Netflix, Prime Video, Disney+, and more. Subscription fees may apply.",
            "Hands-free TV with Alexa - With built-in microphones, just ask to turn on the TV, and find, launch, and control content, so you can put down the remote.",
            "Build your home theater - With Alexa Home Theater you can wirelessly pair Echo speakers using the Alexa app, or connect a soundbar or an AV receiver.",
            "Connect all your devices - Use the 4 HDMI inputs to connect to cable or satellite and video game consoles. The HDMI eARC lets you add audio equipment for enhanced sound.",
            "Designed to protect your privacy - Built with privacy protections and controls, including a switch that electronically disconnects the microphones."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Resolution",
                "value": "3840 x 2160"
            },
            {
                "name": "Display Resolution",
                "value": "4K UHD"
            },
            {
                "name": "High Dynamic Range (HDR) format",
                "value": "HDR10, HLG, HDR10+ Adaptive, Dolby Vision IQ"
            },
            {
                "name": "Backlight type",
                "value": "Full array local dimming"
            },
            {
                "name": "Refresh rate",
                "value": "60 Hz"
            },
            {
                "name": "Screen size",
                "value": "65”"
            },
            {
                "name": "Viewable display size",
                "value": "64.5”"
            },
            {
                "name": "HDMI ports",
                "value": "3 HDMI 2.0 + 1 HDMI 2.1 with eARC"
            },
            {
                "name": "Ethernet",
                "value": "1 Ethernet port"
            },
            {
                "name": "USB",
                "value": "1 USB 2.0 port"
            },
            {
                "name": "IR device control with included Fire TV Alexa Voice Remote",
                "value": "The included Fire TV Alexa Voice Remote can control certain functions, such as power and volume, on a wide range of compatible IR-enabled devices, soundbars, and A/V receivers. Note: Certain functions may not be available on some IR-enabled devices."
            },
            {
                "name": "Voice support",
                "value": "Yes, hands-free with Alexa, press and ask Alexa with the Fire TV Alexa Voice Remote or the free Fire TV app (available for download on Fire OS, Android, and iOS)."
            },
            {
                "name": "Audio support",
                "value": "Dolby Digital Plus with passthrough of Dolby-encoded audio"
            },
            {
                "name": "Audio power",
                "value": "12W + 12W"
            },
            {
                "name": "OS",
                "value": "Fire TV OS"
            },
            {
                "name": "Product size without stand (WxHxD)",
                "value": "57.1” x 33.4” x 3.2”"
            },
            {
                "name": "Weight (without stand)",
                "value": "45.4 lb"
            },
            {
                "name": "Bezel size (mm)",
                "value": "1.2 mm"
            },
            {
                "name": "Front finish",
                "value": "Gray metal"
            },
            {
                "name": "Distance between TV legs",
                "value": "55.4”"
            },
            {
                "name": "SKU Number",
                "value": "QL65F601A"
            },
            {
                "name": "VESA Wall Mount Standard",
                "value": "400 mm x 300 mm"
            },
            {
                "name": "Accessibility features",
                "value": "VoiceView screen reader enables access to the vast majority of Fire TV features for users who are blind or visually impaired. Screen magnifier enables viewers to zoom in and out, and pan around the screen. Text Banner consolidates onscreen text into a compact, customizable banner that appears on the screen. Watch videos and TV shows with closed captioning displayed. Use Audio Description for verbal descriptions of what is happening on the screen, including physical actions, facial expressions and scene changes. Captions and audio descriptions are not available for all content. Fire TV 2-Series, Fire TV 4-Series, Fire TV Omni Series, and Fire TV Omni QLED Series support audio streaming for select compatible Bluetooth hearing aids and devices for a private listening experience. You can also listen to Fire TV with compatible Bluetooth headphones.Learn more about accessibility for Fire TV. Note: “Hearing aids” refers to compatible Bluetooth hearing devices such as traditional hearing aids, cochlear implants, and bone conduction hearing devices."
            },
            {
                "name": "Content availability",
                "value": "Certain apps and services are subject to change or withdrawal at any time, may not be available in all areas and languages, and may require separate subscriptions."
            },
            {
                "name": "Connectivity",
                "value": "Wifi or Ethernet"
            },
            {
                "name": "Digital Optical Audio Output",
                "value": "1 Digital Optical Audio Port"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Optional 3-Year and 4-Year Extended Warranty available for U.S. customers sold separately. Use of Fire TV is subject to the terms found here."
            },
            {
                "name": "Included in the Box",
                "value": "Fire TV Omni QLED Series 65”, Fire TV Alexa Voice Remote, power cord, 2 AAA batteries, IR emitter cable, 4 screws, TV stand (2 legs), Quick Start Guide (PDF / Accessible HTML)"
            },
            {
                "name": "Software security updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire TV, visit Manage Your Content and Devices for information specific to your device."
            },
            {
                "name": "Support",
                "value": "Explore the User Manual to view more information about Fire TV Omni QLED Series."
            },
            {
                "name": "Size",
                "value": "38.2 x 157.7 x 17.1 mm"
            },
            {
                "name": "Weight",
                "value": "51 g (without batteries)"
            },
            {
                "name": "Batteries",
                "value": "2 AAA required (included)"
            },
            {
                "name": "Technology",
                "value": "Bluetooth 5.0"
            },
            {
                "name": "Compatibility",
                "value": "Compatible with Amazon Fire TV smart TVs: Fire TV 2-Series, Fire TV 4-Series, Fire TV Omni Series, Fire TV Cube (3rd Gen), Fire TV Omni QLED Series"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John Wesley HesterJohn Wesley Hester",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRPOMO3F4AE7DOQ54YKI3XPY2SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28MFQ8MJEEZD3?ASIN=B0BJMGB9RN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Just What I Wanted",
                "reviewText": "Great Fire TV for the price and features. Picture and sound are both good on the 50” version that still has local dimming. Some infrequent blooming but overall another TV that proves less dimming zones isn’t a detriment with proper processing. Peak brightness isn’t as high as more expensive TV’s but is still noticeable with HDR content and very acceptable at this price. HDR10, HDR10+, HLG and Dolby Vision IQ all work well with good brightness range and color volume. Note: no Dolby Atoms for sound. I knew this, my TV is wall mounted high and tilted down slightly in a small bedroom and I have no need for a sound bar. NOTE: if using a sound bar with an optical cable, try turning the TV speakers off AND changing the output to PCM or Dolby Digital; and use HDMI 4 (ARC/eARC).This TV is a great value for my application and the budget I set for it.I’m just using the Fire TV interface and none of the HDMI inputs. So I can’t speak on Hue, Contrast and Color issues others may see. Out of the box, mine seems spot on and I currently have no want or desire to go in and adjust any settings based on the content from the various apps I’ve used.The interface isn’t as fast as the Fire TV Cube 3 or Fire Stick 4K Max but still pretty good overall. Note to new Fire TV users: the interface is slower when updates are being downloaded and installed. Check the Device Info for updates several times when first starting the TV. There will be several updates: some very big ones and 2 to 3 more little ones at the least. Keep checking back until it says that it’s “up-to-date”. THEN start to really enjoy the interface. Also the network connection and its QUALITY also plays a factor. This TV supports 2.4/5Ghz and wired (100Mbps).Ambient mode is great but just remember what the TV tells you. The power button on the remote TOGGLES between the Fire TV interface and ambient mode and that long pressing it turns the TV off. No issues with any widgets so far for me. Also, my TV easily recognizes when I enter and exit the room.If you have other Amazon products nearby that listen for “Alexa”, simply change the TV’s wake word to Computer, Amazon or Echo. Absolutely no issues with this.1. I haven’t found any “inescapable” ads to get to content. You can “click” on these shortcuts if you want but you can just user your voice to search for titles instead. Like every other TV interface or box, third party apps have their own interfaces, sign-ins, ads, etc. that can’t be controlled by Amazon, Apple, Google, TCL, etc. Third party apps also place their own ads onto the TV platform they are on based on the deals they have in place.2. The Fire TV interface is anything but complex. You can set it up anyway you want. Again, the various interfaces, profiles, etc. of third party apps are completely independent from Fire TV and on the makers of them and this would be the same on any other TV platform.3. YMMV on the interface. Third party crashes and bugs are possible too. Third party interface issues need to be reported to their makers. They manage the various versions of their app across various platforms and sometimes they aren’t all equal in performance or features offered by platform.4. It hasn’t quite been a decade for Apple to allow the removal of 1st party apps (2016) but maybe Amazon will allow certain apps to be deleted one day. But understand these devices are meant to interface with and promote Amazon products and services primarily.5. The remote button press sounds can be turned off in options for the main interface. Don’t know about the Alexa Home Theater mode but if there isn’t a way, find out if there is one and if not ask that it be implemented.6. Again, out of the box settings being what they may for everyone, at least there are detailed picture settings available for the TV and all of its inputs – all independent of one another to get things looking the way you personally prefer.",
                "reviewVotes": "217 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61dqrtA2VmL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HJeffKHJeffK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDRFBA64VH2SHGAB5W27J4ZTKHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MTKHGM3LOA5S?ASIN=B0BJMGB9RN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Five star TV when you look the the value.",
                "reviewText": "I have a lot of TV'S that run the full spectrum price wise. I recently am dealing with a housing change (divorce, ugh) and needed to get something quickly that I would like, but wouldn't kill me financially as my cash flow is locked down. For reference, at my original house, I have an 65\" LG G2, a 55\" 2022 Sony Experia, and two 43\" Amazon Fire TV'S for bedrooms that are not the Omni versions.I was very impressed with the 43\" base Fire TV. It had a solid albeit a bit dim picture, a fast responsive menu, and just generally was a good set for $300. I bought another, which is the ultimate sign if confidence. Two years later, they are still charging on. So, when I hit this current crummy reboot, I immediately looked at these again, but immediately moved on to the Omni option. I really needed a big TV. The LG C2 was what I really wanted, but the almost $3000 price tag was just beyond what I could do right now. Given all of this, I swallowed my TV snobbery, and ordered up the 75\" Omni which I believe is manufactured by TVL for Amazon. Here are my thoughts.First off, what matters most is the picture. It is shockingly good. Mini LED tech is not generally as good as OLED. However, this picture really works. It is reasonably bright and the HDR content shines on Netflix and other high quality streams. This is a 60hz panel, so I do miss the faster processing on my higher end TV'S, but it is surprisingly close. The blacks here also surprised me. This TV can get really dark. Is it LG OLED good? No. Is it way better than one third of the price good? Heck yes! Most average eyes, will be really happy with the picture here.In terms of menu and interface, Gire TV'S are better than many including LG. I know, blasphemy! Try an LG and you will know what I mean. Their screens are absolutely the best, but the menus are a mess. At least for me. This TV automatically recognizes when I turn on the PS5 amd everything you need is right there. I don't notice the bloatware others have had issue with. I live in the Amazon ecosystem though so keep that in mind.In terms of gaming, this is where you will likely feel the difference. The picture looks amazing but when a game really gets going, on the PS5, you will notice some speed issues. However, it is very marginal. I think it really works just fine for the average gamer.So, what are you missing? First is the aforementioned screen speed. 60hz isn't fast enough. You get a really good HDR format though, and gaming images are very detailed and high end. You don't get Dolby Atmos but sound is OK. I really recommend a sound bar. I bought a 7.1 Vizeo with Atmos and the content sounds amazing via the HDMI Arc connection. The picture still isn't that bright. It is way better than the base Fire TV'S but it isn't amazing. There just isn't that much missing for me at this price.The bottom line is this: This is a tremendous value for the money. I can nitpick some things, but a 75\" TV makes a big statement in most rooms and this one doesn't disappoint. Are there way better TV's out there? Oh, yes. Are ther better values? Not that I have seen. Buy with confidence.",
                "reviewVotes": "423 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81j4-4TFAsL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}