{
    "remaining_requests": 49574,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-Class-Sero-QLED-Built/dp/B087T9ZZJM",
    "body": {
        "name": "SAMSUNG 43\" Class The Sero QLED LS05 Series TV - 4K UHD Quantum HDR Smart TV with Alexa Built-in (QN43LS05TAFXZA, 2020 Model)",
        "price": "$997.99",
        "originalPrice": "",
        "rawPrice": 997.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-Class-Sero-QLED-Built/dp/B087T9ZZJM",
        "soldBy": {
            "sellerID": "A1DBFBMEE74TRM",
            "name": "SKG USA",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1DBFBMEE74TRM&asin=B087T9ZZJM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09MTS14R6"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31n5KKawcGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21MmIJDonnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31CL 4AZMLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31IOMHVG5YL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AE4 HES5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31n8Td2OQUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31hZx6J6KXL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/50f62d67-e5f5-4c15-9fa2-71883295eac9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2860f8d8-5af8-4442-983c-e0df137d1bbb/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d8967ae8-9931-46c1-90bc-9afded1b8f38/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b2f32ba-5b49-4ea1-82f7-f7f599079c8a/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3780499e-61a8-4d30-acbd-9bead896a3e3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/907ae6a2-c86f-4879-b7c7-5a6be1becf96/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0724d0a2-e541-423b-a58d-763ceb95c42e/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung%C2%AE/page/F50AFABA-4CDE-4A95-84D0-CA4C61819FEB?ref_=ast_bln"
        },
        "brand": "Samsung®",
        "merchantInfo": "SKG USA",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 47,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 15 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MOBILE OPTIMIZED SCREEN: Designed to watch mobile content. Easily connect and share smart phone images and video vertically, full screen, on the Sero. Alternate: Content is optimized for mobile viewing, providing a vertical view of all of your favorite content.",
            "ROTATING SCREEN*: Flip the way you watch TV. The screen rotates to landscape mode for TV and movies and changes to portrait for mobile content and apps. Disclaimer: *Rotating Screen can be activated through the supplied remote control, the Smart Things app or with Samsung Galaxy devices Android 10 and above.",
            "PREMIUM 4.1CH 60W SPEAKERS: Powerful speakers with Dolby Digital Plus deliver a remarkably immersive experience.",
            "TAP VIEW: Tap The Sero with your smartphone to mirror your mobile’s content to the within seconds.",
            "QLED TECHNOLOGY: Get an incredible QLED picture with a billion shades of color that come alive with Quantum Dot making everything more brilliant.",
            "ALEXA BUILT-IN: Voice control your TV and your day, hands-free. Just ask Alexa to change the channel, search for movies, play music, control, smart home devices, get sports updates and more.",
            "TV WIDTH: 22.2 inches in portrait mode, 38.3 inches in landscape mode."
        ],
        "description": "Flip the way you watch TV either horizontally or vertically. Easily cast from your mobile phone to a full screen, and the TV rotates depending on what you are watching.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1266092011"
            },
            {
                "name": "Televisions",
                "link": "https://www.amazon.com/TVs-HDTVs-Audio-Video/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172659"
            },
            {
                "name": "QLED TVs",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=21489946011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Samsung"
            },
            {
                "name": "Item Weight",
                "value": "‎73.4 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "12.9\"D x 47.2\"W x 22.2\"H"
            },
            {
                "name": "Item model number",
                "value": "‎QN43LS05TAFXZA"
            },
            {
                "name": "Batteries",
                "value": "‎2 AAA batteries required. (included)"
            },
            {
                "name": "Special Features",
                "value": "‎Mobile Optimized Screen; Rotating Screen; Portrait Mode; 4.1Ch Powerful Sound; 100% Color Volume with Quantum Dot"
            },
            {
                "name": "Speaker Type",
                "value": "‎4.1CH"
            },
            {
                "name": "Standing screen display size",
                "value": "‎43 Inches"
            },
            {
                "name": "Voltage",
                "value": "‎5 Volts"
            },
            {
                "name": "Wattage",
                "value": "‎60 watts"
            },
            {
                "name": "ASIN",
                "value": "B087T9ZZJM"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 47 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#107,826 in Electronics (See Top 100 in Electronics) #139 in QLED TVs"
            },
            {
                "name": "Date First Available",
                "value": "May 11, 2020"
            },
            {
                "name": "Screen Size",
                "value": "43 Inches"
            },
            {
                "name": "Brand",
                "value": "Samsung"
            },
            {
                "name": "Supported Internet Services",
                "value": "Netflix, Hulu, Amazon Instant Video, YouTube, Browser"
            },
            {
                "name": "Display Technology",
                "value": "QLED"
            },
            {
                "name": "Resolution",
                "value": "4K"
            },
            {
                "name": "Refresh Rate",
                "value": "60 Hz"
            },
            {
                "name": "Special Feature",
                "value": "Mobile Optimized Screen; Rotating Screen; Portrait Mode; 4.1Ch Powerful Sound; 100% Color Volume with Quantum Dot See more"
            },
            {
                "name": "Model Name",
                "value": "The Sero"
            },
            {
                "name": "Included Components",
                "value": "User Manual, E - Manual, Power Cable, Samsung OneRemote (TM-2050A) with Batteries"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Sero Mobile Entertainment, better on TV Ever wish you could watch your favorite mobile content full screen on your TV? The all-new Sero makes that dream a reality.¹",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/9a57e240-c078-4ff5-9388-ec567d619fd6.__CR0,0,800,600_PT0_SX800_V1___.jpg"
                ]
            },
            {
                "media_text": "TV that moves to fit your content The Sero's screen rotates so you can watch your favorite content whether it's in portrait or landscape. Whether vertical for mobile content and apps or horizontal for movies and TV shows, you'll always have the best viewing perspective.¹ Rotating Screen The most mobile-friendly TV Tap to mirror content Simply tap your phone to your TV to seamlessly start casting content. It's never been easier to watch mobile content on the big screen. *Compatible devices only. This service only works when mobile is on.",
                "media_link": []
            },
            {
                "media_text": "Mobile content just got bigger No more black bars when you play a mobile video on your TV. The Sero displays an optimized aspect ratio so you can enjoy content, apps, and social media on the entire screen.* *Feature availability may vary by mobile device. Check before use. Control your home with SmartThings The Sero works with SmartThings to put you in control of your smart home. The Sero links with IoT devices and sensors so you can turn on the lights, check what’s inside your fridge, and even run the robot vacuum cleaner right from the comfort of your couch.* *Each device must be connected to Wi-Fi or other wireless network. Must download and install the SmartThings app. For interoperability through SmartThings, all the devices should be registered with a single Samsung Account. Works with AirPlay 2 With AirPlay 2, you can stream or share content from Apple devices to the big screen. Effortlessly play videos, music, photos and more from your iPhone, iPad and Mac on your Samsung TV.² Portrait Modes The Sero blends seamlessly into your space even when you're not watching content. Match or redefine any room's ambience with one of five modes - poster, clock, photo, sound wall, or Cinemagraph. Ambient Mode + Beyond the black screen Watch your TV virtually disappear into the walls of your home. Ambient Mode + mimics the wall behind it and elevates your space by turning the screen into décor, artwork, the weather, today's headlines, and more.³ Easy Mobility So easy to move around The optional Sero Wheels allow you to easily move your TV so you can enjoy it in any room of the house.* *The Sero Wheels sold separately.",
                "media_link": []
            },
            {
                "media_text": "A display as unique as your style Elegantly minimal with a navy blue stand, The Sero is beautiful from any angle. No matter how you use it, it's a space-saving and stylish addition to any room's design. Singular display, unparalleled style Premium 4.1ch 60W Speakers Deep, premium sound Whether you're playing your favorite videos or streaming the latest playlist, The Sero’s powerful 4.1ch 60-watt audio system packs a real punch so all your content sounds as great as it looks. Dolby Digital Plus gives you premium sound throughout the room with plenty of bass. Active Voice Amplifier (AVA) Catch every word without distraction Background noise from your home can disrupt your viewing experience. Active Voice Amplifier analyzes the ambient noise and enhances the voices in the scene so you can hear the dialogue clearly. 100% Color Volume with Quantum Dot Bring more than a billion colors to life With 100% Color Volume⁴, Quantum Dot Technology delivers over a billion shades of color that stay true-to-life without washing out at any level of brightness. AI Upscaling Upgrade what you like to 4K Now you can get 4K resolution picture, regardless of the source. 4K AI upscaling automatically analyzes the input source to reduce image noise, restore lost detail, and define edges around objects and text.* *Viewing experience may vary according to types of content and format.",
                "media_link": []
            },
            {
                "media_text": "Adaptive Picture Surroundings change, picture stays perfect Whether in a sunlit living room or a darkened den, Adaptive Picture optimizes the TV by analyzing the picture and the room's lighting conditions for an amazing picture - wherever and whenever you are watching. Mutiple Voice Assistants Bixby The Bixby voice assistant can go beyond just controlling what you want to watch on TV, just ask Bixby and get more.⁵ Mutiple Voice Assistants Alexa Control your TV with your voice. Just ask Alexa to change the channel, search for movies, play your favorite music, show the front door, and more.⁶ Mutiple Voice Assistants Google Assistant Easily find and enjoy your favorite photos, quickly access entertainment and ask questions. Dim the lights and control smart home devices. Just press the mic button on your remote to get started.⁷ Smart TV Powered by Tizen Rethink what Smart TV can do Go beyond Smart TV with next-gen apps, super easy control, and a host of enhancements that elevate the TV watching experience.⁸ Download SmartThings App⁹",
                "media_link": []
            },
            {
                "media_text": "World’s No.1 TV brand 14 years running¹⁰",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a088bf0b-9f84-4c38-a63f-03ed45ccf2d2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "¹Images and videos are simulated and for illustration purposes only. The appearance, design and GUI (Graphic User Interface) specifications not affecting product performance are subject to change without notice. ²AirPlay 2 functionality is available on all 2020 and later Samsung smart TV. AirPlay 2 requires iOS 12.3 or later, or macOS 10.14.5 or later for horizontal only mode. The content within the screen are simulated images and are for demonstration purposes only. ³Ambient Mode+ works only when The Sero is in horizontal mode. Background feature accuracy may vary based on TV location and is dependent on wall designs, patterns and/or colors. SmartThings app on a mobile device (Android, iOS) is required for some functionality. App features may be limited at launch; please continue to check for updates. ⁴QLED have received verification from world-class testing and certification association, Verband Deutscher Elektrotechniker (VDE), for its ability to produce 100 percent color volume. QLED : Samsung QLED is Quantum dot based TV. 100% color volume measured to DCI-P3 standard, certified by VDE. Compatibility with all HDR content is not guaranteed. The range of HDR claims luminance based on internal testing standards and is subject to change according to viewing environment or specific conditions. ⁵Available technology, functions, GUI (Graphic User Interface) and smart features may vary by region, service provider, network environment, mobile devices or TV product, and are subject to change without notice. Actual user experience may vary. Bixby voice command recognizes English (U.S.), Mandarin Chinese and Korean. Not all accents, dialects and expressions are recognized. The list of features that can be controlled by voice commands via Bixby will continue to expand. Mobile functionality compatible with Samsung Galaxy 8 series or higher with Bixby function. Samsung account log-in and data network (Wi-Fi or internet connection) required to fully operate Bixby features. ⁶Available technology, functions, GUI (Graphic User Interface) and smart features may vary by region, service provider, network environment, mobile devices or product, and are subject to change without notice. Actual user experience may vary. ⁷Available technology, functions, GUI (Graphic User Interface) and smart features may vary by region, service provider, network environment, mobile devices or product, and are subject to change without notice. Actual user experience may vary. The service may not yet be available at the time of purchase of this product. Plan to have the service available later this year, in certain countries and languages. ⁸Smart services and GUI (Graphic User Interface) may vary by model, region, language and mobile device. A Samsung Account is required to set up the TV. Actual user experience may vary. Some features and functions provided by connected devices may not be supported or limited to use. Turn-on TV feature support may vary by model. ⁹Each device must be connected to Wi-Fi or other wireless network. ¹⁰Samsung is ranked No.1 TV brand for 14 years. Source – Omdia, Jan-2020. Ranking in terms of shipments. Results are not an endorsement of Samsung. Any reliance on these results is at the third-party’s own risk.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9a57e240-c078-4ff5-9388-ec567d619fd6.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eb5aea93-deb1-4254-aa97-63b49a239b80.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/548857f6-8fa0-463c-ad4f-2770a28a5ec4.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c327df35-2153-406d-b625-08d11cf15e73.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c6a2b12b-dbbf-4c8b-9d95-869e3b6b0799.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/394279a1-749d-469e-959b-9cf51b277c2f.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5444f7e1-7d3f-4f48-81e7-84a614f0a661.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e6d47a3f-6b6c-4e54-a50c-70378d9a5d2b.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3a99c21c-536c-4ed8-b638-7104dbe10c14.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6d26f245-fc18-4f1b-9211-054b616609b4.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c5e9a365-b6d5-4b7a-991c-b3c420d38c91.__CR180,0,1080,810_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/17d7c8c1-777e-4173-b660-a57999d85412.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/be3d2bb7-9f99-495b-a32b-eb9ddfa2e166.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c5f15516-194b-48b0-8a09-f4664b28c507.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7c125b9e-9060-4c0c-90b9-044d2942d3ad.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/83bca5eb-5c07-420a-8a9c-14f12df33bbf.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/83d708dc-fc1b-4371-a61f-4af531340c20.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1320a2dc-2b99-4793-9c48-fa9f210b9f69.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/33282319-c1e3-4087-85c3-fc5e7c32ea4d.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4c779c7-9a61-440f-a5b0-7477356164f9.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6eb43564-3d2c-4ed1-853c-f4cad685bad2.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e8d45eab-e9b0-42b1-9e65-619900d6a0f0.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/aa8ebcda-e4ab-4bb6-bea8-56590d996eec.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a088bf0b-9f84-4c38-a63f-03ed45ccf2d2.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Drew BuchananDrew Buchanan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER27U35RRBRJXGHVWR5WKNSDF4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLS6WGCR84TM8?ASIN=B087T9ZZJM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2021",
                "reviewTitle": "5.0 out of 5 stars Unique and actually useful",
                "reviewText": "The media could not be loaded. This TV isn’t for everyone. At first glance, it seems like a gimmick (and maybe it is), but for certain situations and needs, it definitely fills a need. First of all, the picture AND sound quality is spectacular. The picture performs just as well as near any current leading display and the sound is fantastic, as the floor mount doubles as a speaker with some actually booming sound with the built in subwoofer.Now, on the main feature of the rotating screen. This works best with rooms/homes that need to prioritize and maximize available space. I think this works best in a bedroom or small living room setup where it can turn vertical to save space and act as a digital clock or even artwork or slideshow display and when you need it, it’ll rotate to widescreen for whatever you’re watching. I think this is the real use over any kind of social media app gimmicks.Bottom line, if you’re looking for something that’ll save space and has great sound/picture quality, this is a great pick.",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/B1PrU-vT+LS.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6594a69e-cb99-4b53-a2a9-676eedc1cfd9/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Joel A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJW4N2RB2FFD2ZRIDGKM5BUF7GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R266K5AQTFBV5F?ASIN=B087T9ZZJM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2022",
                "reviewTitle": "5.0 out of 5 stars I love this TV",
                "reviewText": "I first purchased the serif and I loved the style of it. I then decided I also needed the Sero and this tv is awesome. The look and the way it automatically goes from horizontal to vertical and vice versa is awesome. I don’t use it for my phone much, but that is the idea at the vertical. I just like that’s how it stores itself when not in use. But this tv, great picture quality too.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bradley Branch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3JM4BBC2DCIBQDA4QDI2MCBXDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D32KJ1Y4FZ5T?ASIN=B087T9ZZJM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2020",
                "reviewTitle": "5.0 out of 5 stars I don't own one but I have owned a lot of nice TV's. The SERO is just plain, cool.",
                "reviewText": "kudos to Samsung, this is a fantastic design for these new thin screen TV's I can see a lot of artsy people using these units. I want one, :-(It could also be a digital mirror that can rendering different light situations for the clothes being worn!WOW I can set one on my desk and use it as a monitor!!!!!!!!! that can be turned horizontal for newspaper and magazine layout design!!!! Perfect for the print office. Samsung is going to sell millions of these things........ oh! don't forget scrolling games,",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Stearns",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5ZGO5FNTRU64ADK2OVPNQTTMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R99MDM7YR554U?ASIN=B087T9ZZJM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2022",
                "reviewTitle": "4.0 out of 5 stars GREAT Concept, Great Smart 4K TV",
                "reviewText": "This was a stroke of genius from Samsung - a smart 4K TV that can easily adapt to the gajillion applications one can cast from their phone without losing screen size of quality where applicable. This TV can do and does everything our other smart TV's provide, and because of the optional wheels, this unit can be maneuvered into rooms where there is either not a constant need for a TV or no real space to mount or have a TV stand. Just a great idea! That said, what is preventing me from giving this unit a 5-star review? Two things, and they may not apply to everyone, but the stand of the TV is just a bit low. About 6 inches too low. If you have couches, arm chairs, or other standard sized furniture, there is a possibility of impeded sight lines. The other is the cord is woefully short for being praised as a portable type unit (wheeled from place to place or room to room). Because of a few of our rooms we wheel this to have outlets that are not in the most optimal position for where we want this tv, we need an extension cord. Not the end of the world on both counts, and we have a few work-arounds, but wanted to share. All-in-all, a tremendous TV.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Will C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBCL6FNEXCNKNV6JWHXGIWL5L6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAORGQCTOXEEB?ASIN=B087T9ZZJM",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 12, 2022",
                "reviewTitle": "1.0 out of 5 stars Does not pair with iPhone when you try to watch TickTock’s it’s slow and drags",
                "reviewText": "That’s not fair correctly with iPhone is slow and drag when you try to watch Tik Tok on the TV the whole reason I bought it",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.A - Prime Member",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ3GJENIM4P7CCEEMDFMDPB42WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3550FVF4AZ67D?ASIN=B087T9ZZJM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 13, 2020",
                "reviewTitle": "5.0 out of 5 stars [The Sero]: \"A Problem occurred during Rotation...\"",
                "reviewText": "43\" Class The Sero QLED 4K UHD HDR Smart TVQN43LS05TAFXZAWhen rotating from PORTRAIT to LANDSCAPE an audible indicator followed by a pop-up ERROR MESSAGE: \"A Problem occurred during Rotation. Please solve the problem and try again.\"An End User solution is required in order to achieve LANDSCAPE by the application of consistent pressure to edge of TV Screen guiding the direction of the rotation.However, if this application by the End User is interrupted before the rotation to LANDSCAPE completes the screen orientation immediately returns to PORTRAIT.[ACCESSORY]: The Sero Wheels (VG-SCST43V/ZA)[CONCLUSION]: Ordered directly through SAMSUNG website but RETURNED.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. Bauer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYQ3YRU3EUIGJUOE5BPSIWYQ7MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RURJTLF7OUUR9?ASIN=B087T9ZZJM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 1, 2020",
                "reviewTitle": "5.0 out of 5 stars Item width",
                "reviewText": "It says in the description: \"... Item Width: 22.2 Kilometers ...\"I am not sure this fits well in my living room?",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Solar_Ize",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEU6VIRPBN27IARCZKEKPHHVLS4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D1PN076307NK?ASIN=B087T9ZZJM",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2020",
                "reviewTitle": "2.0 out of 5 stars Cool concept, flawed software and integration, false advertisement",
                "reviewText": "First of all The Sero concept is very interesting because not only the TV occupies little space, it also does not require to be mounted on a wall or standing on top of a media console. Also, it comes with AppleTV embedded on it, as well as all the apps you may probably need such as Netflix, Hulu, Prime, Sling, PlutoTV, YouTube, Spectrum, etc. You basically will not need to connect anything to the HDMI ports, just the power plug and that's it (unless you still use your DVD or want to hook up a gaming console). Therefore this new concept of \"apps-only generated content\" makes this TV very easy to install, but at the same given its form factor Samsung should have added mobility to it, for instance, two rear or front wheels so that we could move it to another conference room by just tilting the TV and pushing it. Without this mobility, the TV is extremely heavy therefore hard to transport.In terms of functionality and integration, the Samsung Smart software is designed for Samsung phones only. For example, you can't use your iPhone keyboard to enter text while using the AppleTV app (which is possible when you use an AppleTV box), so you still need to use the Samsung remote control and select letter by letter on the screen like in the old days, a show-stopper to me. Indeed, the iPhone Remote app won't control your AppleTV on the Samsung. Also, forget about AirPlaying in portrait mode using an iPhone, it only works with Samsung phones. And the \"tap your phone\" feature you see in the videos? For Samsung phones only!Summarizing, this is a compact TV, nevertheless very heavy and with no mobility although its design may suggest otherwise. All the features announced by Samsung are for Samsung phone users, so don't get mislead by their false advertisement and lack of full disclosure.And no, I am not returning it because it's so heavy and hard to repack that I just live with it, but it's certain I'll never buy a Samsung product ever again.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}