{
    "remaining_requests": 49544,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Emergency-Season-Two-Kevin-Tighe/dp/B07896NHTJ",
    "body": {
        "name": "Emergency! Season Two [DVD]",
        "price": "$19.99",
        "originalPrice": "$24.98",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Emergency-Season-Two-Kevin-Tighe/dp/B07896NHTJ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51rv6tiroiL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61pqGYcN8OL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Kevin Tighe",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_dvd_1?ie=UTF8&search-alias=movies-tv&field-keywords=Kevin+Tighe"
        },
        "brand": "Kevin Tighe",
        "merchantInfo": "Sold by PD&C Media and Fulfilled by Amazon.",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 570,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 16 hrs 1 min",
            "FREE delivery Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 13. Order within 10 hrs 31 mins",
            "FREE pickup Friday, February 16 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 12. Order within 1 min"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "When lives are on the line, the Emergency! team is there and ready for action. Reunite with Squad 51 and the heroic staff of Rampart Hospital in all 21 gripping Season 2 episodes of the pioneering series that was the first to show the real-life drama of being an EMT. From mysterious widespread viruses to dangerous overdoses to a treacherous gas explosion, there's no crisis too tough for brave paramedics Roy DeSoto (Kevin Tighe) and John Gage (Randolph Mantooth). With their trademark wit and humor, they're always ready to race to the scene of LA's most dire situations. Along for the ride are some of TV's most popular stars, including Dick Van Patten, John Travolta (Welcome Back Kotter), Deidre Hall and many more. From legendary producer Jack Webb (Dragnet) comes the incredible second season of Emergency!—the TV show that broke new ground for all action series to come.]]>",
        "breadCrumbs": [
            {
                "name": "Movies & TV",
                "link": "https://www.amazon.com/movies-tv-dvd-bluray/b/ref=dp_bc_aui_C_1?ie=UTF8&node=2625373011"
            },
            {
                "name": "Featured Categories",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_2?ie=UTF8&node=2644980011"
            },
            {
                "name": "DVD",
                "link": "https://www.amazon.com/DVD-Featured-Categories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2958934011"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2959099011"
            }
        ],
        "productInformation": [
            {
                "name": "Aspect Ratio ‏",
                "value": "‎ 1.33:1"
            },
            {
                "name": "MPAA rating ‏",
                "value": "‎ NR (Not Rated)"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 0.7 x 7.5 x 5.4 inches; 6.31 Ounces"
            },
            {
                "name": "Media Format ‏",
                "value": "‎ NTSC, Subtitled"
            },
            {
                "name": "Run time ‏",
                "value": "‎ 17 hours and 40 minutes"
            },
            {
                "name": "Release date ‏",
                "value": "‎ March 27, 2018"
            },
            {
                "name": "Actors ‏",
                "value": "‎ Kevin Tighe, Randolph Mantooth, Robert Fuller, Julie London, Bobby Troup"
            },
            {
                "name": "Language ‏",
                "value": "‎ English (Dolby Digital 2.0)"
            },
            {
                "name": "Studio ‏",
                "value": "‎ Universal Pictures Home Entertainment"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07896NHTJ"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Number of discs ‏",
                "value": "‎ 6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,185 in Movies & TV (See Top 100 in Movies & TV) #1,449 in Action & Adventure DVDs #2,159 in Drama DVDs"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 570 ratings"
            },
            {
                "name": "Genre",
                "value": "Drama, Action & Adventure"
            },
            {
                "name": "Format",
                "value": "NTSC, Subtitled"
            },
            {
                "name": "Contributor",
                "value": "Harold Jack Bloom, Julie London, Robert A. Cinader, Kevin Tighe, Jack Webb, Randolph Mantooth, Bobby Troup, Robert Fuller See more"
            },
            {
                "name": "Initial release date",
                "value": "2018-03-27"
            },
            {
                "name": "Language",
                "value": "English"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us Universal Pictures is an American film studio, owned by Comcast through its wholly owned subsidiary NBCUniversal, and is one of Hollywood's \"Big Six\" film studios. Its production studios are at 100 Universal City Plaza Drive in Universal City, California. Distribution and other corporate offices are in New York City. Universal Studios is a member of the Motion Picture Association of America (MPAA). Universal was founded in 1912 by the German Carl Laemmle (pronounced \"LEM-lee\"), Mark Dintenfass, Charles O. Baumann, Adam Kessel, Pat Powers, William Swanson, David Horsley, Robert H. Cochrane, and Jules Brulatour. Six of Universal Studios' films; Jaws (1975), E.T. the Extra-Terrestrial (1982), Jurassic Park (1993), Despicable Me 2 (2013), Furious 7 (2015) and Jurassic World (2015) achieved box office records, with the first three (which were directed by Steven Spielberg) all becoming the highest-grossing film at the time of its initial release.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/bd5e512f-7f44-433f-9dfe-b8852840355a.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "NBC Universal NBCUniversal owns and operates a valuable portfolio of news and entertainment television networks, a premier motion picture company, significant television production operations, a leading television stations group, world-renowned theme parks, and a premium ad-supported streaming service. NBCUniversal is a subsidiary of Comcast Corporation.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/7627515e-dfa7-4f0e-8ba8-c1a0c0611f79.__CR0,0,970,600_PT0_SX970_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/7ba2e07e-90a8-457b-869f-7afb091e8aeb.__CR287,0,1101,681_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/bd5e512f-7f44-433f-9dfe-b8852840355a.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/67b49f0b-b400-4d3f-8a02-23f17c9e1608.__CR101,0,1584,490_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/00d69c61-2777-43b0-bbf6-f4328ad18095.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/sota/7627515e-dfa7-4f0e-8ba8-c1a0c0611f79.__CR0,0,970,600_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBMB7EZW3XJLSDEO2QZVFUYW5NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R99I5TWHK85IS?ASIN=B07896NHTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Good video & audio quality considering the age of the TV series",
                "reviewText": "Bought several years ago, watch on and off. Great quality considering the age of the original series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. Fadden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBR7U4GPQQ5LLC6PHAKHE4CST7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S0D7VO80I9AH?ASIN=B07896NHTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 5, 2012",
                "reviewTitle": "5.0 out of 5 stars Excellent Show ENDURES!",
                "reviewText": "There are so many shows I loved as a kid. I have revisited many of these shows years later and found myself scratching my head in dismay that I could have EVER actually liked that!Then you have EMERGENCY!I was in grade school when I loved this show. I watched it religiously. Now fast forward 40 years into the future. I haven't watched EMERGENCY since the 1970's when it first came out. I have forgotten all the episodes and story lines. It's like I'm watching them all again for the first time.I was a big fan of ER. You would think after ER with all its quality and realism, EMERGENCY, a spin-off show from ADAM 12 (Remember THAT???) wouldn't even remotely compare. That's what I thought.Ok, granted, the show is dated. You can't get around this fact. There were no computers then, or cell phones. Digital did not exist. Everything takes longer. Even the phones are DIAL phones, not even the button variety. The cars all look like boats--it's laughable. The first season the ambulances look like white hearses. The hair styles...everyone looks like they just emerged from a hair salon--the men too. The nurses are all female with the funny paper hats, and most of them obviously wearing false eyelashes. There is no swearing. In the first season not one single person dies. The dialog is laughable in some places. And yet....One thing that's cool about EMERGENCY--you're looking at real fires. Some of the scenes are actually quite amazing when you consider when this show was filmed. EMERGENCY simply WAS the \"ER\" of its day. It was the best television could offer, and in my view, ahead of its time.By Season Two we see a bit more modern style vehicles. The ambulances look more like they do today, and so do the fire trucks. But people die sometimes. You have that little bit of added realism.Strengths that carry through every season I've watches so far-- EMERGENCY is character driven. I defy anyone to try to watch this show and not fall in love with firemen paramedics Johnny and Roy, or laugh at Chet Desoto's practical jokes, or feel along with the head nurse Dixey.McCall.ER was great, but EMERGENCY did it first. ER probably wouldn't have been what it was without this founding show which demonstrates the importance of strong, multi-faceted, FEELING characters.You will be transported back in time in EMERGENCY. After you get through Season Two you will be used to the outdated styles of clothing, cars, technology and mentality. In a way Emergency is a time capsule in that respect. The 1970's get to live again. And though every now and then you'll be brought up short (when it comes to the attitudes/portrayal of women back then especially), much of the time you will forget the outdatedness of the show because you will be so caught up in the STORY.I am again, to Season Four and so far not one story hasn't been exciting, funny, interesting, moving. EMERGENCY has still got it. If you loved ER, you need to experience this show that came first.As for the quality of the DVDs--they are bar none. I feel, for the most part, like I'm watching them new again on TV. Season two, if I recall, has one episode that suffered a little deterioration in its quality--but that was the one exception I have seen so far.Very HIGHLY recommend. I'm still a big fan of this show. I'm guessing now I'll always be.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Kramer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTSEWQ6SUNLM42SYLSSDPEN7RRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q6TUR5GA04TR?ASIN=B07896NHTJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2010",
                "reviewTitle": "5.0 out of 5 stars A Blast from My Past",
                "reviewText": "The TV show \"Emergency!\" has a special place in my heart for two reasons: the first one being that it was a show I enjoyed watching when I was a little kid. The second one being that at the same time this show was airing, my father was also a volunteer firefighter, so watching this on TV was sort of a way for me to see what it was my dad did whenever he got called out to go and fight a fire.Watching this show as an adult, I love it even more! It's like visual comfort food.I love the fact that Emergency! was always about people doing their jobs and not about people in the medical and public service professions obsessing about and navel gazing over the goings on in their personal lives. It would be nice to have a show on the air currently that focuses on these people doing their jobs. The time capsule angle is also something I get a kick out of, particularly because I'm old enough to remember a lot of this stuff (i.e. when nurses still wore caps and white uniforms, no VCR's, cell phones, personal computers, scanners at the grocery store, leaded gasoline, glass thermometers, etc). I also like how there is enough humor to balance out the seriousness of the rescues. And I really like the fact that the cast seems to be very tight and they work well together.The RTV channel airs Emergency! on Monday through Friday, and that is what led me to start purchasing each season on DVD.I give this series five stars because of the episodes and the acting. The only nitpicks I have are with the DVD's themselves and how Universal decided to put them out. I wish Universal would have cleaned up the master copy of the film before transferring it to DVD. I also am not a fan of the double sided disc (but I am happy that subsequent box sets stopped doing this). My biggest nit pick, though, is the lack of extras. I hope that Universal is listening and if they decide to put out the final season of two hour movies, that they also give us extras. There are so many things that they could have extras about (interviews with the cast and crew, the history of the paramedic program, outtakes, etc).",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel L Little",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 4, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "It was so nice to re-watch a great television show from a simpler time!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 9, 2020",
                "reviewTitle": "Was hour shows I was to watch when there was nothing on tv",
                "reviewText": "Emergency 2 was really great I would recommend it to anyone",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 2, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "Fantastic, love these 70 shows. Hoping the price on season five and six comes down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wayne Montgomery",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 21, 2016",
                "reviewTitle": "Squad 51...",
                "reviewText": "Great show.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jim Quinlan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2015",
                "reviewTitle": "Great series",
                "reviewText": "One of the best shows out there.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}