{
    "remaining_requests": 49655,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Samsung-UN65KS9000-65-Inch-Ultra-Smart/dp/B01C5TFNN2",
    "body": {
        "name": "Samsung UN65KS9000 65-Inch 4K Ultra HD Smart LED TV (2016 Model)",
        "price": "$2,999.99",
        "originalPrice": "",
        "rawPrice": 2999.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Samsung-UN65KS9000-65-Inch-Ultra-Smart/dp/B01C5TFNN2",
        "soldBy": {
            "sellerID": "AMKD79KD72FUX",
            "name": "NYCelectronic",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=AMKD79KD72FUX"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B01FXPZC22"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Usually ships within 6 to 7 days",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51pQbm2eE2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61IH5fUAPhL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/439a17ff-1a90-5c1c-b245-2dfad4b56658/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/48e3f3e9-a368-4845-8887-aec8857ed8c9/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SAMSUNG Store",
            "link": "https://www.amazon.com/stores/Samsung%C2%AE/page/F50AFABA-4CDE-4A95-84D0-CA4C61819FEB?ref_=ast_bln"
        },
        "brand": "Samsung®",
        "merchantInfo": "NYCelectronic",
        "customerReview": "3.4 out of 5 stars",
        "customerReviewCount": 125,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 26 - March 1."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "The Ultimate Flat 4K SUHD Picture powered by the Quantum Dot Color Drive. Fires off a billion more colors than HD TVs for a lifelike picture unlike anything else",
            "More than just pitch black, get the best shades of black with Triple Black Technology. Never miss a detail in the dark.",
            "HDR 1000 mirrors the high contrast and vividness the way movie makers intended",
            "Advanced contrast, color and sharpness for true-to-life image quality with Supreme UHD Dimming",
            "Smart 2016 - Use one universal remote to switch from Live TV to streaming seamlessly. Easily access everything you want to watch."
        ],
        "description": "Product Description The Samsung 4K SUHD TV completely redefines the viewing experience with the revolutionary Quantum Dot nano-crystal technology. The KS9000 features innovations that produce a remarkable High Dynamic Range picture experience, regardless of room-light interference. Access your favorite streaming content services easier and faster with our premium design Smart Remote Controller. Amazon.com",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1266092011"
            },
            {
                "name": "Televisions",
                "link": "https://www.amazon.com/TVs-HDTVs-Audio-Video/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172659"
            },
            {
                "name": "LED & LCD TVs",
                "link": "https://www.amazon.com/LED-LCD-TVs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6459737011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎SAMSUNG"
            },
            {
                "name": "Item Weight",
                "value": "‎63.1 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎57 x 16.3 x 36.6 inches"
            },
            {
                "name": "Item model number",
                "value": "‎UN65KS9000FXZA"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Color Name",
                "value": "‎Black"
            },
            {
                "name": "Specification Met",
                "value": "‎Energy Star"
            },
            {
                "name": "Special Features",
                "value": "‎Flat"
            },
            {
                "name": "Standing screen display size",
                "value": "‎65 Inches"
            },
            {
                "name": "Aspect Ratio",
                "value": "‎16:9"
            },
            {
                "name": "Wattage",
                "value": "‎70 watts"
            },
            {
                "name": "ASIN",
                "value": "B01C5TFNN2"
            },
            {
                "name": "Customer Reviews",
                "value": "3.4 3.4 out of 5 stars 125 ratings 3.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#543,963 in Electronics (See Top 100 in Electronics) #2,471 in LED & LCD TVs"
            },
            {
                "name": "Date First Available",
                "value": "March 20, 2016"
            },
            {
                "name": "Screen Size",
                "value": "65 Inches"
            },
            {
                "name": "Brand",
                "value": "SAMSUNG"
            },
            {
                "name": "Supported Internet Services",
                "value": "Netflix, Hulu, Amazon Instant Video, Browser"
            },
            {
                "name": "Display Technology",
                "value": "LED"
            },
            {
                "name": "Resolution",
                "value": "4K"
            },
            {
                "name": "Refresh Rate",
                "value": "240"
            },
            {
                "name": "Special Feature",
                "value": "Flat"
            },
            {
                "name": "Model Name",
                "value": "KS9000"
            },
            {
                "name": "Included Components",
                "value": "REMOTE MODEL: Premium Smart TM1680^ONE CONNECT BOX^OCB CABLE LENGTH: 2M (6.56’)"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "John D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMDMX4VFCSBDJGAN6ULWGZK5LXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39FINLGXGLBB5?ASIN=B01C5TFNN2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2017",
                "reviewTitle": "5.0 out of 5 stars Great TV",
                "reviewText": "Purchased through Video and Audio center. They seem to be the real deal. I decided on this model because I own a KS8000 and am very happy with it. Also, the KS900 is rated higher than the 2017 models by almost all reviewers. TV was advertised as \"open box never used.\" Although the box arrived in pretty poor shape it was the original packaging and all accessories were included. The TV was in perfect shape and the panel display time indicated it was indeed almost new.Now to the TV itself. Sure, it's blacks are not perfect. However, unless you're watching an OLED test video with bright objects against a pure black background, you're unlikely to notice this. In my mind, there are several factors that more than make up for this shortcoming. This is a beautiful design: very thin, even at the bottom with almost no black bezel. The colors are extremely vivid, whites are bright and pure white, and the overall brightness is just amazing. 4K UHD video is breathtaking! I'll probably be buying an OLED in five years but for now this TV is perfect for me!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AnonymousAnonymous",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYI7STNE3AEWVVHEPMKFBMLI4BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO7NAST8FBU4P?ASIN=B01C5TFNN2",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2016",
                "reviewTitle": "3.0 out of 5 stars 2 TVs arrived with the top bezel and screen bent.",
                "reviewText": "Update: the 3rd TV arrived this afternoon.. the delivery guys and I took extra special care getting it out of the box. There is one very small bend in the top bezel, but I'm keeping this one. Its the best of the 3. I haven't had time to check out the rest of the picture quality but it looked good for the 5 minutes I watched it before leaving for work.I'm updating my review to 3 stars. Id like to rate it higher but I have too much effort in this TV to feel it was a 5 star experience.Original Review:This TV is very thin. The TV was delivered by pilot freight. The first TV had the top bezel bent in two places causing the screen to deform at the bends when viewed. It also caused backlight bleeding at those damaged locations. The second TV arrived today and was bent worse than the first TV so I refused delivery. There is a giant kink right in the middle of the top bezel and the screen is bent there about half way down the TV. I can only think these TVs are too thin to be shipped or the damage was done before the TV was put in the box. Amazon customer service is great, but I'd really like to have a TV arrive undamaged so I can get this headache over with. Maybe number 3 will be lucky.The picture on this TV is amazing, the smart interface works very well. it's snappy. blacks are black, colors are very good. The viewing angle is not the best. There is also motion blur and in my case very little light bleeding except for the areas the screen is damaged. There are also times where the picture jumps a few frames during slow panning scenes, but I seemed to have improved it by adjusting one of the video settings. Sorry I don't remember which setting. I'm moving up from a 7 year old excellent plasma TV and the picture quality of this is much better, minus the refresh rates.come on number 3....no more bent TVs please!",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71zeQZzv9aL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Informed Consumer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2NNFJGJMCINX5DAJPJ4GGVFVNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXFTC8R6FZTQL?ASIN=B01C5TFNN2",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2017",
                "reviewTitle": "1.0 out of 5 stars Good TV...when it works.",
                "reviewText": "I wanted to write this review for 2 reasons:1 – Share my issue with the UN65KS9000 TV2 – Share my experience and feedback on the Samsung Warranty Support/Claim process1- The Issue: About two months ago, my new Samsung UN65KS9000 TV developed a sharp static sound coming from the unit speakers after switching off the TV via the Remote Control (the closest sound I can compare this to is a “DC discharge”).2- My warranty claim experience: The TV is still within the 1 year Samsung Warranty period, so I filed a warranty claim. My initial troubleshooting began over the phone with Samsung tier 1 tech support who failed to understand the issue, and quickly claimed the noise is normal, and is being caused due to the expansion/contracting process of the unit (sounded scripted). I respectfully disagreed with the misdiagnosis, and requested a tech come over to check it out. A week later, a field tech came out and confirmed the symptoms I had identified, and changed out the main board on the TV. Once the new board was put in, the TV screen's back light kept flashing and the tech proceeded to order a new board hoping to resolve the issue….So far the field tech has made a total of 3 in-home service calls, each time with a different part in attempt to get the TV to function….no dice. I was told that the KS series are finicky where parts have compatibility issues (not sure what it means, but ok).My Feedback to Samsung: Please don't make consumers chase you to honor a warranty claim....I am guessing Samsung is going comment on my review with a canned response about calling the 800 number etc to resolve the issue. Please note that I have already attempted communication over the last 3 weeks, and have had no luck with Samsung delivering a working product thus far.…here is my case # : 4144183303. At this point I am looking for Samsung to contact me and arrange a drop-off (or pick up) of my existing TV and a issue full refund.Update 08/22/2017: Radio silence from Samsung on the warranty claim. Called them again and spoke to someone in the Executive Solutions Team. I was asked to reach out to the Samsung authorized tech who attempted to perform the repairs, and acquire the 3 repair work orders and email them to Samsung (efax@sea.samsung.com). WOW! I fail to understand why the customer needs to play the middle man when Samsung owns the warranty claim and have assigned their own authorized technician to perform the repair... Samsung, are you going to own up, and what is going on over there?",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.Lamb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 11, 2017",
                "reviewTitle": "... that the experts were still saying Plasma was the best picture. My 4 or 5 year old Samsung ...",
                "reviewText": "It wasn't that long ago that the experts were still saying Plasma was the best picture. My 4 or 5 year old Samsung plasma had a realistic picture but not the best and no pop. This TV has pop. The Best Buys always play a totally fantastic 4K video on the demos so you don't know what you will get until you set the TV up at home. This TV does a great job with the regular HD provided by our cable company. As for higher def, I tried House of Cards on the upgraded HD from Netflix and was completely blown away. Can't say how this TV would compare to an OLED but can say it's much cheaper and totally happy with this upgrade.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EventualPyre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 11, 2017",
                "reviewTitle": "Love it!",
                "reviewText": "Once calibrated, you'll never want to leave home again. Game mode is fantastic, 4K HDR content (bluray) is orgasmic, and even clean 1080p content looks realllllly good. Would buy again :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steeve Girard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 21, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "Trés satisfait !",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}