{
    "remaining_requests": 49937,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Toshiba-All-New-65-inch-Class-65C350LU/dp/B0BTTTWHBW",
    "body": {
        "name": "Toshiba 65-inch Class C350 Series LED 4K UHD Smart Fire TV with Alexa Voice Remote (65C350LU, 2023 Model)",
        "price": [
            "1 option from $379.99"
        ],
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Toshiba-All-New-65-inch-Class-65C350LU/dp/B0BTTTWHBW",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": [
            "B0C629GJMR"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BTTX3Z1P",
                "variationName": "Size",
                "variationValue": "43-inch",
                "price": "$219.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BMK5B4TF",
                "variationName": "Size",
                "variationValue": "50-inch",
                "price": "$249.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BTTV2P88",
                "variationName": "Size",
                "variationValue": "55-inch",
                "price": "$269.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BTTTWHBW",
                "variationName": "Size",
                "variationValue": "65-inch",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "Currently unavailable.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31mba7GBihL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41LXoTVyAnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411oMSjoagL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31vxvPjMvjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nP14m4nOL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Toshiba Store",
            "link": "https://www.amazon.com/stores/Toshiba/page/82274DB8-CB79-44BB-82BC-AAE3ED418DB7?ref_=ast_bln"
        },
        "brand": "Toshiba",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1789,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fire TV - Fire TV brings live, over the air TV and all your streaming channels together on one, easy to use home screen. Connect any HD antenna and ask Alexa to instantly search for and watch live TV, or choose from a vast catalog of streaming movies and TV shows.",
            "Regza Engine 4k - Regza Engine 4K is Toshiba’s high-performance 4K engine for stunning picture quality. With the ultra-essential PQ technology combined with a high-quality LCD panel, you can get incredible ultra HD 4K images with breathtaking picture quality.",
            "4K resolution - Four times the resolution of Full HD, and four times the detail. With Toshiba 4K TV, you can enjoy uncompromisingly crisp, clear visuals for a fully immersive, professional theater-quality experience.",
            "Dolby Vision HDR and HDR10* - Dolby Vision HDR and HDR10 transform your TV into an entertainment powerhouse. The image technology from cinemas, now brought together in the home, provides amazing realism you'll see, hear, and feel like never before.",
            "Auto Low Latency Game Mode - Enjoy a better gaming experience. In Game Mode, input lag is significantly improved, so your commands from the controller are virtually instantaneous on the screen."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Screen Size",
                "value": "65 Inches"
            },
            {
                "name": "Brand",
                "value": "Toshiba"
            },
            {
                "name": "Supported Internet Services",
                "value": "Browser"
            },
            {
                "name": "Display Technology",
                "value": "LED"
            },
            {
                "name": "Product Dimensions",
                "value": "12.1\"D x 57.2\"W x 35.2\"H"
            },
            {
                "name": "Resolution",
                "value": "4K"
            },
            {
                "name": "Special Feature",
                "value": "Flat"
            },
            {
                "name": "Model Name",
                "value": "C3"
            },
            {
                "name": "Included Components",
                "value": "Stand, TV, Remote"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "All-in-one entertainment With Fire TV built-in, you can enjoy a world of entertainment from apps like Prime Video, Netflix, Disney+, and Hulu. Plus, stream for free with Freevee, Pluto TV, Tubi, and more. Apps and services are subject to change or withdrawal at any time and may require separate subscriptions.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e36dfd-c6f5-40fc-8eb5-57fe1f4e5ff5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Voice Remote with Alexa Just press and ask Alexa to find, launch, and control your content. Go beyond streaming to check the sports scores, set timers, and reminders, and more–plus, easily launch into Prime Video, and Netflix with quick access buttons. \"Alexa, play ________.\"",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/370ab7dc-5326-4b90-ad23-585c1b4afa27.__CR0,0,800,600_PT0_SX800_V1___.jpg"
                ]
            },
            {
                "media_text": "A smarter TV experience Fire TV is always adding new Alexa skills, features, smart home capabilities, and voice functionality. You can ask Alexa to do things like start a video call with Alexa Communications or Zoom, or show picture-in-picture live camera feeds without interrupting your workout.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0df353c-dcff-4b82-bfe5-3172ff8ed391.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Over 1 million movies and TV episodes Enjoy favorites from Netflix, YouTube, Prime Video, Disney+, Apple TV+, Peacock, STARZ, Paramount+, and others. Plus, play millions of songs through services like Amazon Music, Apple Music, Spotify, Pandora and iHeartRadio. Subscription fees may apply.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fd88fbd-77f6-4326-8b25-1b9e9077c08a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Level up gaming No matter what kind of gaming you're into, Games on Fire TV has you covered. Play games like you stream movies with Amazon Luna or download games from the Appstore.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df642247-f790-4abe-ba24-2a3ce400dbd4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0a4f6419-62a9-4093-9511-93786ff76c19.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e36dfd-c6f5-40fc-8eb5-57fe1f4e5ff5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/370ab7dc-5326-4b90-ad23-585c1b4afa27.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0df353c-dcff-4b82-bfe5-3172ff8ed391.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fd88fbd-77f6-4326-8b25-1b9e9077c08a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df642247-f790-4abe-ba24-2a3ce400dbd4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marjun A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZKDOQDEMUD6QGPFVR6NBFPHBOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VYD60WFVGG3Z?ASIN=B0BTTTWHBW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Unbeatable Value for a Spectacular TV!",
                "reviewText": "I recently acquired the Toshiba 55-inch Class C350 Series LED 4K UHD Smart Fire TV, and I must say it has exceeded all my expectations. Here are a few aspects that truly stand out:1. Price Point is Amazing: The first thing that caught my attention was the incredible affordability of this TV. It offers an impressive 4K UHD experience without breaking the bank. The value you get for the price is simply unbeatable, making it an ideal choice for budget-conscious buyers.2. Setup for the TV is Extremely Easy: Setting up this TV was a breeze. The user-friendly interface and straightforward instructions made the entire process quick and hassle-free. Whether you're a tech-savvy enthusiast or someone who's not particularly fond of tech setups, you'll appreciate how intuitive and simple it is to get this TV up and running.3. Picture Quality Matches Other TVs that are Double in Price: The picture quality of this Toshiba TV is outstanding, rivaling models that cost significantly more. The 4K UHD display provides crisp, vibrant, and detailed visuals. I was pleasantly surprised by the depth of colors and the clarity of images. It's perfect for enjoying movies, gaming, or streaming your favorite shows, and it stands toe-to-toe with pricier competitors.In conclusion, the Toshiba 55-inch Class C350 Series LED 4K UHD Smart Fire TV is an incredible find. The price point is unbeatable, the setup process is a breeze, and the picture quality competes with more expensive options. If you're in the market for a budget-friendly TV that doesn't compromise on performance, this is the one to go for. It's a fantastic addition to any home entertainment setup and offers an excellent viewing experience without breaking the bank. Highly recommended!",
                "reviewVotes": "154 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "loongirl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXD46ENPQ4FP33WOFHJ3D3PJZFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A9V5PHVTJIKJ?ASIN=B0BTTTWHBW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars A Great TV for the Money",
                "reviewText": "Bought the first one several months ago, liked it so much that I bought a second one for my bedroom. Clear and detailed picture (when you can see the actor's actual makeup, you know you are getting a sharp image!), and fairly easy to set up (I'm tech challenged). Love that it includes Prime Video, which I use often for both tv and music. I'm on an antenna, no cable here, and the tv's scanner picked up 53 channels. Haven't used the sleep timer yet, but will eventually now that I know where it is. This was a surprisingly good buy (the first one I found on sale for under $200, the second was just a tad over $200) - a lot of tv for the money.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerry Geiss",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMICRXMEURRQXIUNHVGE56VVGLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1F7QA31NTJCRN?ASIN=B0BTTTWHBW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Good TV for the price",
                "reviewText": "We bought the TV because we moved into a new house and had an area that would handle a bigger TV. We also got the TV with the built-in fire TV as we use streaming services for our TV watching. The picture is good for a 1080 HD TV. I have had Toshiba TV's before and this one was what I expected it to be. The initial turn on had me log into my Amazon account which loaded most of the Apps I already subscribe to which made changing to this new TV easy. There were a few Apps I had to manually download and log into, but the majority were loaded at this initial startup. The audio is a bit tinny, but we got an optic audio cable to connect to a surround sound stereo and that audio was good.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAD3GQOYL5RYO45PAS34QFAM2QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36JTSPZFYE3C3?ASIN=B0BTTTWHBW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Data hog, Good TV for the price, but horrible for game consoles",
                "reviewText": "The price/value of this TV is good, if you like the Amazon Fire interface. Comes with basic features other similarly prices TVs leave out like USB ports, wired and wireless network connectivity, multiple HDMI, optical audio, etc. This TV is also super lighter weight compared to prior TV generations. First time I’ve been able to carry a 55” TV up stairs and mount it without a requirement to have help (although a second set of hands was helpful). We’ve used it for over a month for streaming video services and connected to a cable box via hdmi. Both look great, although similar to our fire stick, Amazon’s Fire TV platform uses a LOT of data, which is a concern when internet providers have a data cap/overages.We added a cheap wifi access point and locked its uplink to 10Mbps/half + rate throttled it’s port and the TV works great without eating up as much data. We went all the way down to 4Mbps and saw some video artifacts and a short buffer pause starting a movie but not bad enough for us to care.But as others have stated, this TV is horrible for gaming. The refresh rate is POOR. While scrolling around a in-game map there are artifacts and the image looks warped while it’s moving. Doesn’t matter which settings are on/off in the TV, it simply can’t keep up. Sharpness and color is also not great, but overriding the defaults on the TV can help compensate.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ATVDUDE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWSOR6JQ7ULLO55DRFYXF43XI5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20JSQPIYVJVN9?ASIN=B0BTTTWHBW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Bargain 4k TV!",
                "reviewText": "This is a really good TV. I like the picture quality and HDR. The Amazon Fire integration is nice and the TV is very fast and does not lag. This TV is a total bargain. Good TV for gaming, I tried my PS5 and Xbox Series X on it and they both look great.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Gilbert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDSKVPLEMTURH242TFKQIAPHAMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WWH7054ORLV8?ASIN=B0BTTTWHBW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Good quality, easy to get going",
                "reviewText": "Disclaimer: I'm absolutely not someone who is going to nitpick about the picture quality to the point of caring about how truly HD something is. I can tell if the picture is bad or grainy or if there are burned out spots, but otherwise I'm not that concerned about it. What mattered to me is having a TV that made it easier for me to get to everything I have on streaming and to get a slightly better quality than my old TV without paying a lot. This definitely works on those fronts.Navigating settings is pretty straightforward and this thing honestly works pretty decently out of the box. It's not too hard to add a soundbar to this, and odds are good that you'll want to consider one as I'd say the only drawback about this TV I've noticed is that the sound isn't as good as my old one was. Your mileage may vary/tolerance level may as well, but a soundbar fills in that gap nicely. The remote it comes with is honestly pretty much geared to assume you're using Fire to stream (which seems fair - after all, this IS a fire TV, though my Roku would also have plugged in fine if I wanted to keep using it).As I mentioned, the only thing I love less is the sound on this TV and even there it's not a big deal. I'll see how this holds up over time but for now I consider it a pretty good value and wish I'd sprung for it earlier.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}