{
    "remaining_requests": 49719,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/amazon-fire-tv-50-inch-4-series-4k-smart-tv/dp/B0B3GTSQ9Q",
    "body": {
        "name": "Amazon Fire TV 50\" 4-Series 4K UHD smart TV, stream live TV without cable",
        "price": "$299.99",
        "originalPrice": "$449.99",
        "rawPrice": 299.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/amazon-fire-tv-50-inch-4-series-4k-smart-tv/dp/B0B3GTSQ9Q",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0971YMVC8"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B3HG269B",
                "variationName": "Size",
                "variationValue": "43-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B3GTSQ9Q",
                "variationName": "Size",
                "variationValue": "50-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B3H6JPYZ",
                "variationName": "Size",
                "variationValue": "55-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0B3GTSQ9Q",
                "variationName": "Configuration",
                "variationValue": "TV only",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BVWZ3NJ4",
                "variationName": "Configuration",
                "variationValue": "with 4-Year Protection Plan",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CBQH2XJT",
                "variationName": "Configuration",
                "variationValue": "with Fire TV Soundbar",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51kBfQ96zNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41YuCIrxq-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21P MbcF7VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21fa8nQvmLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/312gijLxNeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sRF x-FrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Pzse4jjRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 36415,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 17 hrs 21 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Bring movies and shows to life with support for vivid 4K Ultra HD, HDR 10, HLG, and Dolby Digital Plus.",
            "4K Ultra HD, HDR 10, and HLG deliver a clearer and more vibrant picture with brighter colors compared to 1080p Full HD.",
            "Press and ask Alexa to easily find, launch, and control your content, or check the weather, sports scores, and more.",
            "Stream over 1.5 million movies and TV episodes. Watch favorites with subscriptions to Netflix, Prime Video, Disney+, and more. Subscription fees may apply.",
            "Enjoy MGM+ on us - Receive a 6-month subscription to MGM+, including access to thousands of Hollywood movies and Original series with your Fire TV purchase. Terms apply.",
            "Watch live and free TV, play video games, and stream music.",
            "Fire TV adds new Alexa skills, features, smart home capabilities, and voice functionality all the time.",
            "Use the 4 HDMI inputs to connect all your gaming, cable and audio equipment."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Noreen HeikesNoreen Heikes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFNP7RG7QQ62IRUJ5YYY5NYGGNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNBBG5OIM3NVZ?ASIN=B0B3GTSQ9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice TV, easy setup!",
                "reviewText": "I considered getting a larger TV for several years before finally ordering one last week. I got a good price, and it was delivered in 4 days, just as advised when I ordered. The Amazon delivery driver carried the package upstairs without being asked, and was pleasant and helpful.The TV itself is quite light, and I was easily able to unbox it myself (but anything larger than the 44” would need 2 people). The legs attached easily, and the cord and HDMI cables were obvious and easy to hook up. I had the unit in place and connected in just over 5 minutes.Since I’m not very tech-y, setup of new electronics is always a worry. I turned on the TV with the remote, selected my wifi network and entered the password. The TV then cycled several times through “downloading software” and “installing updates” screens. I was worried that I was stuck in some tech vortex, but just waited. After about 10-15 minutes, the TV prompted me to sign in with my Amazon account, asked whether I wanted extra channels or parental controls, then boom, it was on its regular Home Screen and I was good to go!Picture is clear and colors very saturated compared to what I previously had. Sound is good (general purpose, I’m not a music critic) and refresh rate very adequate for TV (I’m also not a gamer). I think that for my purposes (occasional TV viewing, probably less than 8 hours per week), this will be an excellent set that I will enjoy.",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71lf3zl9wQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda S.Linda S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6YPO7JQCUV6JA4V5XR6TYEZTIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIBSGXQ6C1IMW?ASIN=B0B3GTSQ9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great tv with an awesome picture",
                "reviewText": "This is the first actual fire tv I've had. And I love it. It was easy to set up and has the best HD picture I've ever seen on a tv. It makes you feel like you are right there with the people. The 50 inch screen makes it feel like you're in a movie theater. I like that it came with a firestick remote. Now I have a new one to use for my new tv. This was a very worthwhile purchase. It's worth every penny I paid for it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61RJ6W1JFvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Mertz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWNX4LIIUKXMT3VMRBNJ4766GVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAT0XV20I3V52?ASIN=B0B3GTSQ9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars nice lower cost unit",
                "reviewText": "50\" firetv is lightweight, and has a nice picture. assembly is straight forward, but it comes with the wide stance legs. This did not fit on my TV stand so I installed a different aftermarket center style base via the wall mount screws. the smart interface will be loaded with amazon's ads, which is cumbersome and a bit of an eyesore, but otherwise works well enough once you learn where everything is located. the alexa integration works like expected. my polk soundbar works properly through the provided HDMI-ARC/eARC port. in the software version as of the review date, note that without an internet connection the OTA antenna channel list will not automatically refresh the available programming without first going to the individual channels which seems to force a refresh for that channel. the remote is small and lightweight with only a few buttons, and relys heavily on either navigating the menus or using alexa. the lower 4 buttons are shortcuts to popular streaming services and are just an annoyance when accidentally pushed- all of that is available from the menus or alexa like everything else so they are unnecessary. if you want your TV to turn on to wherever you were when it was last turned off you will need to enable that in the settings as default behavior is to always bring you to the main menu screen to see the ads.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUBYAJNJKRSQ3MZYZUOPLDZX46Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3THAN1K7SVZMR?ASIN=B0B3GTSQ9Q",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Great tv.",
                "reviewText": "Great TV for a great price. It is a little slow for NFL network, or NFL network bandwidth is bad. Great picture, Alexa mic. in remote, good sound. Amazon prime homepage is a little clunky and filled with too much cash grab stuff, but it works and you or Alexa can find plenty of stuff to watch.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martha T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEX23PKMF7R4KYNEBTCCUHTJMR3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K0V5LI4P6M0C?ASIN=B0B3GTSQ9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Great TV",
                "reviewText": "This TV is awesome! We've had it only for a couple of days and still learning about it. We do mostly antenna TV and it picks up more clear stations than our previous Roku TV did. I love that it works with our Alexa so I don't have to find the remote if I need to turn the volume up, down or mute if I'm across the room. Also it helps search for shows when we can't decide what to watch...lol. Everyday I'm learning something new about this TV. We are very happy with it!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "My Public Name",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEEJWIPEDQ4MDBYB52EAI4OXT3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO72Q5Q9MZJCY?ASIN=B0B3GTSQ9Q",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great smart TV for the price",
                "reviewText": "The 55\" smart TV for a little over $300 (was on sale at the time) was delivered almost immediately. Was easy to assemble the \"feet\" and was already configured to connect to my network. It integrated my Recast almost instantly, without being prompted and was also easy to connect to an Echo Studio for \"surround sound\". Well, not quite with just one of them, even with ATMOS content, but it beats the built-in speakers.Speaking of the Echo Studio, you lose the on-screen volume indicator and apparently can't hold the volume buttons down, as you can when using the TV speakers. The former is irritating and the latter is just plain silly for such an expensive add-on.UPDATE:Added a second Studio and subwoofer and they were also easy to connect to the TV. Now it does surround sound about as good as an average sound bar, though will pale in comparison to high-end sound bars. Still, these have the potential for a lot more separation, as you can put the two speakers anywhere in the room.This makes for an amazing home theater experience in virtually any room. They appear to connect over ad hoc WiFi networks and the reliability is good, though it will occasionally drop the left or right channel (or both).Generally, it either snaps out of it in a minute or two or pausing and then playing or switching inputs or asking one of the speakers a question or whatever seems to make it reconnect. It's mildly annoying, but have never had to stoop to unplugging anything to get around it. Can always switch back to the TV speakers in the Home Theater settings in a pinch, but that hasn't been necessary here, at least not yet.And, as expected, the speakers play music on demand. Unexpectedly, the cover art, lyrics, playback controls, etc. are displayed on the TV. That's a nice feature.It also integrated with my Ring cameras effortlessly, showing them in the PiP when people are detected. I think that's the the threshold anyway (i.e. not just for motion). May be a Ring setting that controls this, but happy with the way it is working; though beware, Ring cameras sometimes fail to identify people.And speaking of the remote. The redesigned button layout is really stupid. The old layout was much easier to find the right buttons with your thumb. The new one is all uniform rows and columns of same-sized buttons. Maybe they thought that looked \"cleaner\", but the ergonomics have taken a huge step backwards. Also wish they'd lose the dedicated buttons for Disney+, Hulu, etc. It's advertising and only convenient for those who subscribe to the sponsors' services.Still, couldn't be happier at this price point. Picture looks great to me, though surely pales when compared to sets that cost twice as much. And, as expected, built-in speakers are not great, but soundbar support is rumored to be very good with this model (unlike some previous Amazon-branded TVs that I've owned).Hopefully it will last. I still use the other two I bought three years ago. And hopefully they'll fix the stupid Alexa bug that prevents turning it on and off by name. (!) Yes, \"Turn on Den TV\" responds with \"Den TV doesn't support that\". (!!) Oddly enough, this \"trick\" works fine with the older models, though one of them will go into a \"coma\" once it is off more than a few minutes, foiling all attempts at automation until the remote is used to turn it back on (defeating the whole purpose). That happened about a year in and they never fixed it, no matter how much feedback I sent. The best advice they could offer was to factory reset the thing. :(Workaround for this new one is \"Turn on Fire TV\", which is ridiculous and will only work with the linked smart speaker. Support was no real help, but supposedly they escalated the problem. I've heard that before, so won't hold my breath. But at least it stays responsive in standby mode. For now anyway. :)UPDATE: Support indicated that the reason I am having problems with \"Turn on Den TV\" is that I had the Echo Dot linked to another TV previously. Yes, I did and I unlinked that one and linked Den TV. No idea what I was supposed to do differently, but sure seems like a bug.NBD, as I generally just tell it what I want to watch, rather than telling it to turn on. Still would be nice if I could turn it on and off from the other speakers in the house, as I can do with the other two TVs. No idea whether this bug will prevent using routines to turn the den TV on and off, as I haven't tried that yet. They work with the others, except the one that goes into a coma.",
                "reviewVotes": "245 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}