{
    "remaining_requests": 49733,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/amazon-fire-tv-55-inch-omni-series-4k-smart-tv/dp/B08P3QVFMK",
    "body": {
        "name": "Amazon Fire TV 55\" Omni Series 4K UHD smart TV, hands-free with Alexa",
        "price": "$389.98",
        "originalPrice": "$549.99",
        "rawPrice": 389.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/amazon-fire-tv-55-inch-omni-series-4k-smart-tv/dp/B08P3QVFMK",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0971XBV8M"
        ],
        "asinVariationValues": [
            {
                "asin": "B08T6DZ81T",
                "variationName": "Size",
                "variationValue": "43-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08T6F8YBH",
                "variationName": "Size",
                "variationValue": "50-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08P3QVFMK",
                "variationName": "Size",
                "variationValue": "55-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08T6J1HG8",
                "variationName": "Size",
                "variationValue": "65-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08T6JZTH4",
                "variationName": "Size",
                "variationValue": "75-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08P3QVFMK",
                "variationName": "Configuration",
                "variationValue": "TV only",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09TCVT6PZ",
                "variationName": "Configuration",
                "variationValue": "with 4-Year Protection Plan",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CBQGTJ4X",
                "variationName": "Configuration",
                "variationValue": "with Fire TV Soundbar",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/417aHSj62OL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41iqN-frQaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21g-29srF9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21uzlEdW91L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31BTVvToeNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51sRF x-FrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41K1zhU8NOL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 25821,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "This item cannot be shipped to your selected delivery location. Please choose a different delivery location.",
            "This item cannot be shipped to your selected delivery location. Please choose a different delivery location."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Brilliant 4K entertainment - Bring movies and shows to life with support for vivid 4K Ultra HD, HDR 10, HLG, and Dolby Digital Plus, and control the TV hands-free with Alexa.",
            "Scenes that leap off the screen - 4K Ultra HD, HDR 10, and HLG deliver a clearer and more vibrant picture with brighter colors compared to 1080p Full HD.",
            "Hands-free TV with Alexa - With built-in microphones, just ask to turn on the TV, and find, launch, and control content, so you can put down the remote.",
            "Watch what you want - Stream over 1.5 million movies and TV episodes. Watch favorites with subscriptions to Netflix, Prime Video, Disney+, and more. Subscription fees may apply.",
            "Enjoy MGM+ on us - Receive a 6-month subscription to MGM+, including access to thousands of Hollywood movies and Original series with your Fire TV purchase. Terms apply.",
            "All your entertainment in one place - Watch live and free TV, play video games, and stream music.",
            "Smart and always getting smarter - Fire TV adds new Alexa skills, features, smart home capabilities, and voice functionality all the time.",
            "Connect all your devices - Use the 3 HDMI inputs to connect to cable or satellite and video game consoles. The HDMI eARC lets you add audio equipment for enhanced sound.",
            "Designed to protect your privacy - Built with privacy protections and controls, including a switch that electronically disconnects the microphones."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brett L.Brett L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFXMFTVFY3BWI2YCN5AS6TKS5GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2EGIYIS6U8TM8?ASIN=B08P3QVFMK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Great 4K, Great HDR, Quick Response, Amazing Price",
                "reviewText": "I got this TV on sale for $279.99 ($299.99 total), and this is, by far, the best TV I have ever purchased in terms of available features, picture quality, and pricing.Features: Every streaming app is available, and the UI is the least laggy out of any brand I've tried. It is literally just like having a Fire TV Stick built into your display. You can plug 4 HDMI cables into it, and you can also use 3.5mm or optical SPDIF audio ports to plug in speakers. The overall build quality feels very sturdy while remaining lightweight.Quality: The video quality is great on this TV. 4K movies look very sharp, and black levels are surprisingly low. HDR content also looks great on this display. It doesn't introduce any banding or contrasting issues, in movies or games, as far as I've seen. The Auto-HDR feature also makes some SDR content look really good, but I recommend turning it off if things begin to look TOO vibrant. The audio quality is on par with every other normal TV. The speakers aren't very loud, and they can't reach very low. I suggest doing what I did and buy yourself a basic 2.1ch speaker setup or soundbar.Gaming: Gaming is great on this TV. When you are playing on an Xbox, PlayStation, or Nintendo Switch and you launch a game, the TV will automatically switch to a \"Game Mode\". This \"Game Mode\" reduces input lag, making it so that there is a very small delay between your input and when the action occurs on screen. There is a picture setting preset for game content, and it is perfect for almost anything I've played so far. I love playing Forza and The Legend of Zelda on this TV.Setup: If you sign in with your Amazon account, and you link your other accounts with Amazon, signing into things is a breeze. Also, using your phone to set up the TV works very well. There are a TON of options that let you adjust how you want the picture to look or the audio to sound. No other brand lets you tweak that many settings.In conclusion: This is a great TV at a great price. You are not being scammed, and you do not need that $1000+ Samsung QLED. The only thing those might have over this one is they get much brighter. Anyone will be happy with this display, and most people will be happy they saved a few hundred dollars or more.My entertainment setup:1) Fire TV Omni Series 50\"2) Xbox One X3) Sony 4K UHD BD Player4) Nintendo Switch5) Nintendo Wii(the Wii is plugged in using a component to HDMI adapter, and it looks great)",
                "reviewVotes": "61 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/714qObzOP7L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71GefLTncPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71QE8aPcyNL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Fagerson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF33MDV2SC7VGWEUO2JFO3WZIAOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D5357UXN54U2?ASIN=B08P3QVFMK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2022",
                "reviewTitle": "5.0 out of 5 stars Great display, but needs some upgrades",
                "reviewText": "My wife sent me the listing for this TV when she received it as a special sale item and even though my current old TV was still working fine, I decided that it was a good enough deal that I would upgrade to 4K finally. I liked that it had a lot of potentially beneficial connectivity between other devices, like cameras and other smart home stuff. I already had a TV wall mount from my old TV. The only problem was the mounting holes on the back of this TV were different and I didn't have the leftovers from the mounting hardware, so I had to wait until the next morning to run to the hardware store and get what I needed. After that, it was up on the wall within minutes. Another problem: the mounting of the bracket on the back on the TV is much lower than my old one, so the TV sits about 8-10\" higher than before. I will need to take down the TV and move the entire wall bracket down so it sits at the right height.Setup is pretty easy, getting through the general stuff, the WiFi connection, updates, and scanning through the TV channels...yes, I still use antenna for a couple local channels I can't get through streaming. That all went fine. I connected my existing in-wall HDMI cable to the ARC port and set my receiver to the Roku input. I had great picture and audio. I decided that I should also try using the TV with its built-in Fire TV capabilities.That's where things went off the rails. The ARC was working fine for all of a few minutes, and then after changing a couple unrelated settings and rebooting the TV, I had no more sound over ARC. I messed with settings on the TV and my receiver for 10-15 minutes before turning to the internet for help. I found an answer that said to unplug the TV for a few minutes and then it should work again. Great. Did that and I did indeed have sound over the ARC channel, but it would cut out every 5-7 seconds. I tried messing with all sorts of settings but eventually gave up and just connected an optical cable between the TV and receiver to get sound working properly. I might have to try a newer HDMI cable to see if that makes any difference.With that working, I was able to use the native Fire TV apps. I've been using the native Fire TV system now for a couple months and I have to say, it needs work. When the apps work, they work. But every once in a while, and it's happening almost daily now, I'll load an app and it won't respond. I'll have to reboot the TV and then the apps will start working most of the time. Sometimes even a reboot won't work and I just have to wait for the app to eventually load. I don't think its an internet or WiFi issue, since nothing else seems to have any problems. I just think the Fire TV environment is slow. I don't know if it's because of the hardware or the software, but the instant I started using it, I could tell how much slower it was to respond to anything compared to the Roku box I have.Needless to say, as a display, this thing works great. The picture is clear and bright, the details are amazing. I haven't played much with the picture settings, as out-of-box, it was already good. I like that it integrates the OTA TV channels right into the menu so I don't have to change the input. I also like the on-screen notifications from Alexa for specific things that I have set up. I haven't played much with the integration of the Ring doorbell and the picture-in-picture display for it. I also plugged a web camera into the USB port on the TV and it recognized it, but I haven't tried to use Zoom yet with it.I gave it 5 stars, despite the issues with ARC, as that may not necessarily be the fault of the manufacturer, but more an issue with my cable, or the setup between the TV and my receiver...maybe they just don't work well together. I've read that Yamaha's receivers all tend to be finicky with ARC, so it may just be that. I'm also not dropping any stars, despite the speed issues, as it could potentially be related to my network, or might work fine after an update. Either way, I could use it as just a display with my Roku and it would be a 5-star display at that point. But then I'd lose any capabilities with the integrated Alexa and smart features.",
                "reviewVotes": "278 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}