{
    "remaining_requests": 49716,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/INSIGNIA-42-inch-Class-Smart-NS-42F201NA23/dp/B0BCMND272",
    "body": {
        "name": "INSIGNIA 42-inch Class F20 Series Smart Full HD 1080p Fire TV with Alexa Voice Remote (NS-42F201NA23, 2022 Model)",
        "price": [
            "1 option from $89.99",
            "1 option from $149.99"
        ],
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/INSIGNIA-42-inch-Class-Smart-NS-42F201NA23/dp/B0BCMND272",
        "soldBy": {
            "sellerID": "ANSF0RE9FUP82",
            "name": "Best Buy",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=ANSF0RE9FUP82&asin=B0BCMND272&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BL5QGX27"
        ],
        "asinVariationValues": [
            {
                "asin": "B09ZLTWXST",
                "variationName": "Size",
                "variationValue": "24 Inches",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BCMND272",
                "variationName": "Size",
                "variationValue": "42 inches",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "5",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41KPMYMrEqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/410QPbcCLPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41hZ4uWGRWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31jzXNgPV4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31zpjSI1B0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31eqcFkQQmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31n84GeaY-L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/956f2889-d597-4c12-b103-d32ff8f68881/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ff59225-98c2-412c-8352-8bba3c40b65e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/40ddf23d-fdff-42f4-a4eb-59f4a6661128/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d92c2f96-dcbc-49b1-8151-22535e36361d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/321ad4f0-c5c4-49ad-ae9d-2f6e23ae490c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41f1172b-8793-4c1f-8e0f-6ae6e58339b3/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e7a311b-929d-49e6-9ed7-efd1ed65cebc/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 7,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the INSIGNIA Store",
            "link": "https://www.amazon.com/stores/INSIGNIA/page/656AD711-9291-45D4-91CD-0456C86329BA?ref_=ast_bln"
        },
        "brand": "INSIGNIA",
        "merchantInfo": "Best Buy",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5458,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1080p resolution View your favorite movies, shows and games in high definition.",
            "Alexa voice control - The Alexa Voice Remote lets you easily control your entertainment, search across apps, switch inputs, and more using just your voice. Press and hold the voice button and ask Alexa to easily find, launch, and control content, and even switch to cable.",
            "Fire TV experience built-in - Watch over 1 Million streaming movies and TV episodes with access to tens of thousands of channels, apps, and Alexa skills.",
            "Supports Apple AirPlay - Share videos, photos, music and more from an Apple device to your TV with the touch of a button.",
            "Supports HDMI ARC - Sends audio directly from the HDMI jack to a compatible soundbar or AV receiver, removing the need for an extra cable."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=1266092011"
            },
            {
                "name": "Televisions",
                "link": "https://www.amazon.com/TVs-HDTVs-Audio-Video/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=172659"
            },
            {
                "name": "LED & LCD TVs",
                "link": "https://www.amazon.com/LED-LCD-TVs/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=6459737011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎INSIGNIA"
            },
            {
                "name": "Item Weight",
                "value": "‎20.7 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "8.7\"D x 37.4\"W x 23.5\"H"
            },
            {
                "name": "Item model number",
                "value": "‎NS-42F201NA23"
            },
            {
                "name": "Color Name",
                "value": "‎Black"
            },
            {
                "name": "Special Features",
                "value": "‎Flat"
            },
            {
                "name": "Speaker Type",
                "value": "‎Built-In"
            },
            {
                "name": "Standing screen display size",
                "value": "‎42 Inches"
            },
            {
                "name": "Voltage",
                "value": "‎5 Volts"
            },
            {
                "name": "ASIN",
                "value": "B0BCMND272"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 5,458 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#42 in Amazon Devices & Accessories (See Top 100 in Amazon Devices & Accessories) #2 in Smart TVs #3 in LED & LCD TVs"
            },
            {
                "name": "Date First Available",
                "value": "September 22, 2022"
            },
            {
                "name": "Screen Size",
                "value": "42 Inches"
            },
            {
                "name": "Brand",
                "value": "INSIGNIA"
            },
            {
                "name": "Supported Internet Services",
                "value": "Netflix, Hulu, Amazon Instant Video, Browser"
            },
            {
                "name": "Display Technology",
                "value": "LED"
            },
            {
                "name": "Resolution",
                "value": "1080p"
            },
            {
                "name": "Special Feature",
                "value": "Flat"
            },
            {
                "name": "Model Name",
                "value": "F20 Series"
            },
            {
                "name": "Included Components",
                "value": "Stand, TV, Remote"
            },
            {
                "name": "Connectivity Technology",
                "value": "Wi-Fi"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "All-in-one entertainment With Fire TV built-in, you can enjoy a world of entertainment from apps like Prime Video, Netflix, Disney+, and Hulu. Plus, stream for free with Freevee, Pluto TV, Tubi, and more. Apps and services are subject to change or withdrawal at any time and may require separate subscriptions.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e36dfd-c6f5-40fc-8eb5-57fe1f4e5ff5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Voice Remote with Alexa Just press and ask Alexa to find, launch, and control your content. Go beyond streaming to check sports scores, set timers, reminders, and more. Plus easily launch into Prime Video, and Netflix with with quick access buttons. \"Alexa, play_____.\"",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/370ab7dc-5326-4b90-ad23-585c1b4afa27.__CR0,0,800,600_PT0_SX800_V1___.jpg"
                ]
            },
            {
                "media_text": "A Smarter TV experience Fire TV is always adding new Alexa skills, features, smart home capabilities, and voice functionality. You can ask Alexa to do thing like start a video call with Alexa Communications or Zoom, or show picture-in-picture live camera feeds with out interrupting your workout.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0df353c-dcff-4b82-bfe5-3172ff8ed391.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Over 1 million movies and TV episodes Enjoy favorites from Netflix, YouTube, Prime Video, Disney+, Apple TV+, Peacock, STARZ, Paramount+, and others. Plus, play millions of songs through services like Amazon Music, Apple Music, Spotify, Pandora and iHeartRadio. Subscription fees may apply.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fd88fbd-77f6-4326-8b25-1b9e9077c08a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Level Up Gaming No matter what kind of gaming you're into, Games on Fire TV has you covered. Play games like you stream movies with Amazon Luna or download games from the Appstore.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df642247-f790-4abe-ba24-2a3ce400dbd4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ad3834bd-18bb-447e-9b75-dafc9243127c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e36dfd-c6f5-40fc-8eb5-57fe1f4e5ff5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/370ab7dc-5326-4b90-ad23-585c1b4afa27.__CR0,0,800,600_PT0_SX800_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0df353c-dcff-4b82-bfe5-3172ff8ed391.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0fd88fbd-77f6-4326-8b25-1b9e9077c08a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df642247-f790-4abe-ba24-2a3ce400dbd4.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Paul W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER7GWKDTDHXS6MWLWNRVGM7N7LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZKW40XJZVAOP?ASIN=B0BCMND272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent for the Price",
                "reviewText": "At 1080p on a 24-inch screen, it works well for television. It's great for an extra TV and the picture seems pretty good. Setup is easy and it would be hard to find anything at this good for the price anywhere else. (I one one of these1080p TVs and also a 24-inch at 720p) The TV is also light and easy to move, so it is very portable. You can set it up at the kitchen table one day, and move it to the garage or breezeway the next. It has a decent selection of channels such as Freevee, Netflix, Tubi, etc. You can plug a Wi or old-style VCR into it also.I have had mine for about a month now and have no complaints. I have this one set up on the floor with a dust cover out of the way in the living room. I can pull it out and have it on a small table in about 30 seconds. It's a perfect solution for a room where you do not have a place for a full-time television, and do not fell like moving the big master TV around. You can get used to the screen being smaller quite easily.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hawk eye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGSZQNLKBBDWHFKZ2ZJJSHN3D3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QJBC5ZZMPMP4?ASIN=B0BCMND272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "5.0 out of 5 stars It was the best compromise for me...",
                "reviewText": "I've got a 32 inch Sony Bravia that I bought back when flatscreen TV's first appeared on the market. Literally, you had to go to a specialized home furnishings or entertainment store. If you went to a big-box store, you'd only see CRT TVs for sale.Well, my old Bravia's power cord has continuity issues after decades of mechanical strain. Not a big deal, I could repair it easily, but I decided it was finally time for an update and cruised Amazon's Spring Prime Day event here in 2023.That ties into my review title: For the variety of equipment I use, this TV was the best compromise I could find. I really hesitated buying this TV. I'm not familiar with Insignia, and I'm certain this TV isn't going to last a quarter as long as my venerable Bravia has.Before I dive into the particulars, here's a summary for readers who just want the points:This TV has been good so far, having been used nearly daily for about six months. I have a couple of gripes, most of which can be adjusted, and some which are my fault due to the dated equipment I persist in using. I mostly play video games, but occasionally watch something on Prime TV. For both those functions, this TV works great, and it's processing speed is noticeably faster compared to my old Bravia, which is nice for gaming (I doubt this TV could stand toe-to-toe against the latest, cutting edge TVs in that regard though).Onto the details.Out of the box, I was REALLY grateful that this TV is feather-light compared to my Bravia. Had my lower back been acting up, I would have needed to enlist some help moving the Bravia. But sore back or no, I can easily handle this Insignia. The included stand legs are cheap and flimsy. They can hold the TV up, but this TV sat way too low in my entertainment center; I had to hunch way forward just to see the screen. I immediately had to get a height-adjustable stand. With the adjustable stand, I've got the TV at a good viewing height and angle.Plugging in my devices, it was clear I was going to need splitters. One of the main reasons I got this TV is because it has an optical audio port, which is what I needed to run my old Yamaha audio receiver. I have an extensive collection of Nintendo and Sony video game consoles, and while I don't intend to try and connect all of them, the three HDMI ports and single series of A/V ports are wholly insufficient.That situation is still being worked. But for the time being, I have my PlayStation 5, Nintendo Switch, and Nintendo Wii U connected to the HDMI ports of this TV, and can connect one of my older consoles to the A/V ports. This TV handles it all in stride, and of course makes older game consoles video output look odd since it's too crisp and fast for the console. But, that's where yet more adapters will be needed, and why this situation is ongoing.Again, this TV runs itself and the connected equipment I've listed just fine. Picture quality is improved over my old Bravia, and audio is just as good. Since this is a smart TV, it has some extra functions, which I like, dislike, and nearly hate.With this TV not being locked to exclusive hardware like Roku does, I was able to program this TV's remote to power on my old Yamaha receiver along with this TV. I like this! On occasion, I'll join some friends online in voice chat, and thus don't need my receiver to power on. I can just hold the remote very close to the TV, so the remote's signal doesn't hit the receiver, and I only power the TV on.This TV will send power-on commands to devices via the HDMI ports. I like, dislike, and hate this.Sometimes, when I come home from work, I just want to fire up the PS5 and game. Since the PS5 is connected to HDMI 1 (ARC port), firing up the TV also fires up the PS5 and receiver. One button gets me ready for gaming and I love it.Sometimes, I want to play games on my Switch or just watch some TV. If I don't frantically mash the remote's Home button after pressing the power button, the TV will stubbornly fire up my PS5 and keep reverting the input to HDMI 1. This annoys me, as sometimes I don't mash the Home button enough or in time, and I have to wait for the PS5 to finish booting up, wake it's controller up, and put the PS5 back to sleep mode and quickly change this TV's input mode to either HDMI 2 (the Switch) or Home, which is the Prime TV main menu.Seriously, the TV is stubborn. There've been times where I've had to turn off my PS5 multiple times because this TV keeps sending power-on signals and forcing the input picture to HDMI 1. I hate that.But, the TV is just doing what it's programmed to do. I either need to take the time and set my PS5 to not react to power on signals through HDMI, or just deal with it. I've messed with settings on the TV as much as I could, so all that's left is to mess with settings on the PS5. But again, when I come home from work, burnt out and needing to just chill and relax, pressing one button to send me into a relaxing gaming session of No Man's Sky is just wonderful. Again, like, dislike AND hate.Overall though, I'm satisfied with this TV. It's not perfect obviously, but for what I need it to do, it does it well enough and still has connectivity for older equipment that I have that simply isn't found on the new, cutting edge TVs that most people go for. The fact that this was on sale during Prime Day makes me even more willing to overlook it's shortcomings.I don't know if this TV is even available any more at the time of writing this, but if it's available when you read this review, I'd recommend this TV if like myself, you don't NEED a smart TV but don't mind having one, and have older and newer equipment you'd like to connect to one TV.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James C Young",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIFQ2M4OJBXTDQFXOUCIYOTDHEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJ9BGG6I6UNBJ?ASIN=B0BCMND272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Purchased This Spur Of The Moment As Our Sony Bravia 1080i HD TV Stopped Working!",
                "reviewText": "Update December 10th, 2023Our television seems to working fine still, however the surround sound receiver decided it was time to bite the bullet. It’s an Onkyo 5.2 model that we have had for over 10yrs . We purchased the tip of the line model and they gave us a rally deeply discounted price for the second unit. The flagship unit had to be repaired twice before we decided that it was not worth the price to ship it to the factory service center and we started using the smaller unit as the replacement surround sound system. This was back when we were still using our Sony Bravia and the much less expensive unit out lasted the much more expensive unit by about 3Xs the life of the 7.2 model. We had the unit in a cabinet style unit that the television sits on top of. After the first time we had issues with the expensive Flagship unit, I was reading that a closed cabinet was a terrible idea. I thought , well that makes a lot of sense, and cut the back panel off of the cabinet where the A/V equipment was stored. I also purchase a thermostatically controlled fan unit that was pulling off the hot air and installed two computer fans in the shelf so that it was getting fresh air in and hot air out. Basically so that the receiver was not just recirculating the hot air that the thermostatically controlled fan unit that was sitting on top of the receiver was expelling out the back panel that I had completely removed. We finally got frustrated with the high end unit and started using the cheaper “little brother” model of the same Onkyo series. We have two height speakers that we lost as the smaller unit didn’t have the ability for them. We basically have been using the speaker system that is built into the television. It took a while to get use to the difference in the sound and we reminded ourselves that we plan to purchase a new Surround sound system and a 4K television in the next few months, basically after we find out how much “Uncle Sam” is going to hurt us in April. We received some inheritance money and we have moved some investments around as the market is very precarious and we made some changes to our investments. The only thing we have noticed is that the sound of the television speakers built into the television sometimes seem to get louder or lower on thier own. We never noticed this until our surround sound system completely stopped working. I’m honestly surprised that it lasted as long as it did as Onkyo was notorious for having problems with their HDMI boards. Still a great television, even if it stopped working tomorrow, it has been a life saver for us as we watch a lot of television. The fact that we purchased a television that has a great picture for what it cost to fill up our SUV when it gets really low on gas is a huge comparison. It will be used in a guest room once we decide on what we’re going to do as far as buying a new entertainment system. The sound issue might have something to do with the fact that the Roku device has been on continuously since we purchased it, and we have been using it over the built in apps as it seemed like way too much work to move the streaming services from the Roku to the TVs built in version of streaming. It might be a setting that we overlooked when we started using the speakers on the television, or several other possible solutions for this issue. Still worth the 5 stars and worst case scenario is it will be my monitor for our computer. I’ve been told that Integra receivers are basically Onkyo receivers that are branded for sale by BestBuy. It’s actually really sad that Onkyo has been around since since 1946 and they have apparently had to file bankruptcy because of the problems with their newer receivers. Japan is notoriously know for making the absolute best audio equipment in the world. Unfortunately, they are not alone in this problem with their flagship products. My brother in law has a Yamaha Advangate 11.2 pre amp and main 11 channel amp that has had to be serviced for issues with the chipset on the HDMI boards. The pandemic is still making it hard for these popular brands with getting the best quality chips for their products. I have a two channel Onkyo receiver from the late 80’s that sounds incredible. It was a determining factor in the purchase of the new products. I also think Sony has some issues that they have never had in the past. We have a small television my husband purchased in Hong Kong in the late 60’s and it still works to this day. It’s just a lot of television and a little over 7 to 10 inches of television. But it was built to last and Japan is very proud of making products that will outlast the technology. So we are still “tire kicking” on what Surround sound processor we plan to purchase. It will have to handle bi-amped speakers, dual subwoofers, and the biggest and hardest thing to find is the ability to playback MQA CDs. I’m currently doing this with my MacBook Pro and a special program that unfolds the true depth of MQA. Teac makes a CD player that can playback this format natively , but it’s a Japanese version that I think is 220volts. So I don’t want to run a separate 220 line for that type of device.We will know exactly what we want when we start looking for the components and hopefully we can find exactly what we want. Otherwise , I can live with the volume fluctuations of the television speaker output and ad I mentioned, this is the most unbelievable High Resolution television we have ever purchased for the price of dinner for four friends, a tank of gas, or several other things we have purchased that we paid far more money for and we we’re let down after a couple of weeks. I just haven’t had time to really look at the Television settings to see if the sound is set up correctly. I was running a $300.00 optical cable from the television to the receiver made by Audioquest, and it worked perfectly. I’m going to try purchasing a couple of new HDMI cables and double check the receiver. Unfortunately, I don’t have any extra ones on hand. But it’s worth trying to get back the 5.1 audio experience.Update November 5th, 2023Well our Insignia/Fire TV is working better than ever. I took me a little bit of time to get the color set properly and I flat out refused to pay for someone to come out and calibrate the color as it was more than what the TV cost. It’s like it took some “burn in” time for the colors to really pop! They kind of looked either too light or too dark, but with the time we have had it, the picture seems much better looking and more vibrant than it originally looked out of the box. I don’t know if a TV is like speakers, but it seems like the picture looks more natural than it originally did when we first purchased the TV. I also read some reviews on the 4K models where the built in streaming service was causing issues with the apps cutting out and requiring a restart of the app. I personally am not a huge fan of built in streaming software and we have an external Roku device which is the newest model hooked up to ours and it works great. Plus you can upgrade your streaming device and not have to purchase a new television if it doesn’t get a firmware update. We have had a much better year after buying this television than before and I know it has nothing to do with the television, but we have updated our surround sound system and speakers. My husband’s melanoma is in the remission stage , but I try not to worry about that as it will be what it will be. If this television was to stop working today, I would still feel like we definitely got our money’s worth out of this purchase. I’m still considering buying one of the 4K models for my MacBook Pro as an external monitor instead of the screen on the MacBook Pro. Then I can put it in the folded up mode and add a cradle to hold the MacBook Pro and clear up some much needed desk space. We’re very satisfied with this television and people that come over can’t believe how little we paid for it. I honestly thought that unless we paid more than about $2,000 for a television, it would not be satisfactory, and boy was I wrong about that notion. I don’t see us upgrading anytime soon as we have gotten so use to the picture and the color of this model, I just think it’s our new TV for as long as it last.Original Review:We purchased a Sony Bravia from Best Buy in like 2003 when these Television started becoming popular and it was really expensive. I think it was over the $3,000 price range and it lasted for longer than it’s life expectancy. Several internet reviews of the model of Sony Bravia we purchased rated the life expectancy somewhere around the 10yr to 15yr range. Well, we have watched ours for several years longer and it was a very good television. Personally, I think Sony use to make really good products for the mainstream market, but now I’m not exactly impressed with their products anymore. Our Sony Bravia stayed on more than off and it started to act up in late July just when we were considering buying a new 4K Television and new Surround Sound Equipment and High Resolution 7.2.1 audio equipment for our den. It was almost like our old faithful Sony was listening to our plans and threw a monkey wrench into them. We also had purchased our dream SUV in the color and options we had spent the first part of the year looking everywhere for and it got rear ended. Then when we thought things couldn’t get any worse, we found out that my husband has Melanoma. Everything we didn’t necessarily need was put on the back burner.The Sony Bravia was state of the art for the time and it was a 40in screen, but the first HD televisions are not exactly the same as the newer models. It measured more like a 50 inch screen as the bezel was slightly larger and the speakers that are built in the television also took up more space as they where in the bottom of the television, which we never used them anyway. It’s is also several inches thicker and it’s actually a lot heavier than I remembered it being. It was also in a built in entertainment center and that was one of the obstacles we faced when considering a new 4K system as we couldn’t figure out how to get a larger screen size without tearing out the built in system and having the wall dry walled in and paint matched. Then there was the issue of where we we’re going to store the thousands of DVDs and Blu-Ray movies that we had amassed over the years that you can now basically stream. We have several movies on both formats and it’s always hard to find a movie when you have them packed in a closeted style area. The Sony Bravia still works for several hours and then the picture cuts out. I initially thought it might be the Roku or the Onkyo receiver that the company had several issues with their HDMI boards on several model years of their top of the line receivers. We sent a very expensive model in for repair work and it lasted about another year and I found a guy in Dallas who fixed it in like two hours, the second time it stopped playing sound and it finally stopped working. I was through with getting it repaired and unhappy with Onkyo forever. It was a networked $1,500 receiver that had a slew of problems that eventually led to them going out of business, as I’ve heard. We also got a deep discount on a brand new Onkyo 5.1 receiver at the time for like an extra $200. It’s still working, until I post this review, then it will die. That’s the kind of year it’s been for us and I hope it gets much better.The Sony Bravia has got something to do with heat and not getting enough circulation to it. But the parts are obsolete now and it wasn’t worth the trouble of finding the part, then paying too much for it, and then having other problems with the Television in a few days or so. I have listed it on a local website for free and we have the original box and paperwork for it, but no bites on it yet. Best Buy will take monitors and televisions up to 40 inches and I might call them and see if they’ll take this one. It’s larger than 40 inches but it’s a 40 inch screen.My husband immediately started looking at Amazon and I said that I didn’t think having a television shipped to our house was a good idea. The various delivery options I thought might be used to ship the item have been much harder on large items now than ever before. Sometimes the USPS driver has to deliver our four cases of Fuji water and he gets extremely frustrated with doing so. I have offered him a hand truck to help him, but he just kind of moans and says he’s got it. Then my husband read that we could pick this up at Best Buy. I looked at it and checked the compatibility with our receiver and said “buy it.” My thinking was if it last for three months, we haven’t spent several thousand dollars on a 4K television yet. I measured the opening and it fit with about half an inch on each side, but there plenty of room around the television for air to circulate and it is nowhere near as thick or heavy as our Sony. There’s also plenty of space behind it and it is much easier to get to the hookups than the older Sony Bravia was. We purchased the 42”model and it has been a great television. It took me a few hours setting up the surround sound to run through our receiver and then setting the picture was not exactly easy to do, but I think it’s just that we had gotten so use to the Sony picture, which was really good, that we couldn’t get it exactly like what we had gotten use to watching for over 20yrs. So the hook up was easy to do, but it took some time for me to realize that it isn’t going to look identical to what I had gotten use to watching. We had the Sony Bravia professional calibrated. I was not going to pay more for calibrating the television than it was purchased for. I thought the brightness was too bright , so I would adjust it and then it would look darker in some different channels and on Prime Video. I hit the reset button and it actually worked perfectly. It is not a matte finish like the Sony was, so the picture looks different, but extremely good. I honestly don’t know if a television has a “burn in time” like some audio equipment, but it seems like it looks better now after several weeks of using it basically more on than off. The picture quality is incredible and the lighting has kind of changed to match what I think it should look like the longer we have used the television. It has built in streaming capabilities through Amazon Fire, but I like our Dolby Digital DTS Roku player and it is what we use instead of the built in streaming media player. I’m just picky about how surround sound quality sounds and the Roku was already set up for streaming our Prime Video and some other apps. So it saved us from having to activate everything over again and it was just plug and play for the Roku player. Otherwise, the Amazon Fire being built into the television is just another example of how much you get for the price of the Television.I’m considering getting one of these for my Apple MacBook Pro for a monitor. I’m not a gamer and I don’t have to have a 4K display for what I use our MacBook Pro for anyway. The price of this is just unbelievable and there is not much else in this price range that you can buy and not have a lot of problems with. My newest iPhone case was almost as much as this television. The picture is incredible and the fact that you can pick it up at , in our case Best Buy, made the whole process easier than having this shipped through UPS or USPS. I would have never thought that you would ever be able to buy a 42 inch HD television for the price we paid which was under $150.00 when we bought this item. I was pleasantly surprised by the quality of the product and how well it displays our favorite shows and movies. I’m still amazed at the fact that it was so well made, yet very cheap in price. It was perfect actually because our pre 2020 Onkyo receiver is the same refresh rate as the television.We might get that amazing 4K television but now it’s just not priority anymore because we have been extremely happy with the Insignia Television with Amazon Fire for just under two months now that we have not thought about spending the money on new Receivers, speakers , or other devices that we don’t have to have in order to enjoy a great television experience.Highly recommended for so many reasons. I have considered buying a couple more for the guest room and our bedroom, but we don’t watch television in bed. We had a very large television in there for years and I can’t remember even watching it.I’m still amazed by how little we paid for how much incredible quality we got for the price of what some hotels cost per night. When our vehicle was rear ended, the rental car was costing the guys insurance more a day than this television cost. I’m just amazed at this well built television can be so cheap and look so expensive in 2023!I started to post a photograph of the picture, but I don’t think it would be an accurate representation of the quality of the image as different devices produce different results for television photos. We had some paint samples sent to us from the painter and they looked entirely different in person than the images we received. So I’m glad we didn’t go on the images as the color was completely different in person.",
                "reviewVotes": "116 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joe GoodVibes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5ZG32UU6WUXZ6XPB4Q6LIYRFVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XRXO1418XFLI?ASIN=B0BCMND272",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Good quality TV for a simple price!",
                "reviewText": "The INSIGNIA 24-inch Class F20 Series TV is a solid, no-frills option for those seeking a straightforward and reliable television. Its compact size makes it ideal for smaller spaces without sacrificing display quality.The HD resolution provides a clear and crisp picture, making it suitable for casual viewing or as a secondary TV. The interface is user-friendly and easy to navigate, making setup and operation hassle-free.While it may lack some of the advanced features found in higher-end models, the INSIGNIA F20 Series offers good value for its price point. It's a practical choice for those who prioritize simplicity and functionality over bells and whistles. Overall, an honest and dependable option for basic entertainment needs.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}