{
    "remaining_requests": 49834,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pyle-TV-Flat-Monitor-Television-Operating/dp/B0CF3NZZLH",
    "body": {
        "name": "Pyle 75' 2160p UHD Smart TV-Flat Screen Monitor HD DLED Digital/Analog Television w/Built-in WebOS 5.0 Operating System,Full Range Stereo Speaker,Wall Mount,Includes Remote Control,HDMI,USB,AV,Black",
        "price": "$586.84$463.04",
        "originalPrice": "$586.84",
        "rawPrice": 586.84,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pyle-TV-Flat-Monitor-Television-Operating/dp/B0CF3NZZLH",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51TmcV2ayPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51cOvvz4i4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513BSPYXEZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vflfqQ8zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51K5HHEiuIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XJmEYKXeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41e8pU6pSdL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Pyle Store",
            "link": "https://www.amazon.com/stores/PyleUSA/page/D79E9149-99F8-49A4-8E8C-D24560694FC2?ref_=ast_bln"
        },
        "brand": "PyleUSA",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "",
        "customerReviewCount": 0,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE scheduled delivery as soon as Saturday, February 17, 11 AM - 2 PM",
            "FREE scheduled delivery as soon as Saturday, February 17, 11 AM - 2 PM"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "POWERED BY WebOS Hub : The HD DLED TV features WebOS Hub platform that allows you to browse the web and play online videos. Lets you stream apps like Netflix, Hulu, Sling, Prime Video, and more. Supports wired and wireless internet connection",
            "UHD 2160p SUPPORT: The Smart TV features a UHD 3840x2160p widescreen hi-res display creating a more expansive spectrum of colors and more realistic picture with a massive 75” screen size. Offers 178° vertical, 178° horizontal viewing angles",
            "INPUT/OUTPUT INTERFACE: The HD TV boasts built-in full range stereo speakers & selectable multi-viewing display. Input interface has included 3 x HDMI, 2 x USB, 1 x AV, RF (antenna), and output interface includes optical (digital) audio & headphones",
            "UPGRADED FEATURES: The LED TV screen features V-chip, closed caption option, back panel button controls & sleep timer functions. Also included in the set is a full function LED TV remote control that includes 2 AAA batteries",
            "MOUNTS ON WALL: Allows you to save space in your home and opt for a clean design with the LED TV monitor. The removable base stand makes mounting to the wall a simple process. Features universal VESA mounting compatibility (600mm x 400mm)"
        ],
        "description": "Features: - Powered by WebOS Hub - WebOS Hub Platform Delivers Streaming Simplicity - Supports Wired and Wireless Internet Connection - Browse the Web and Play Online Video - Stream Apps like Netflix, Hulu, Sling, Prime Video, and more - Full HD 2160p Support - Widescreen Hi-Res Display - Selectable Multi-Viewing Display Modes - Built-in Full Range Stereo Speakers - Input Interface: (3) x HDMI, (2) x USB, (1) x AV, RF (Antenna) - Output Interface: Optical (Digital) Audio, Headphones - Removable Base Stands for Wall Mounting - Includes Full Function Remote Control - V-Chip, Closed Caption & Sleep Timer Functions - Back Panel Button Controls What's in the Box: - 75’’ UHD DLED Smart TV Technical Specs: - Operating System: Powered by WebOS Hub - Screen Size: 75’’ -inch - Screen Display Type: D-LED Backlight - Display Resolution: 3840x2160 Pixels - Signal Support: 2160p,1080p, 1080i, 720p, 480p, 480i - Display Modes: 16:9 - Viewing Angle: 1780 Vertical, 1780 Horizontal - Speaker Power: (2) 8 Watt, 8O - T.H.D. +N: <10% @1KHz - Refresh Rate: 60Hz - TV Tuner: ATSC/NTSC - Response Time: 8.5ms - Max. Color: 1.07G - Contrast: 5000:1(Typ.) - Brightness: 280 cd/m2 - Universal VESA Mounting Compatibility (600mm x 400mm) - Power: 100/240V, 50/60Hz - Power Consumption: 300W - Remote Control Battery Operated, requires (2) x ‘AAA’, Included - Product Dimensions (L x W x H): 66.35’’ x 12.36’’ x 40’’ -inches (With Stand) - Product Dimensions (L x W x H): 66.35’’ x 3.5’’ x 38.1’’ -inches (Without Stand) - Base Plate Bracket Width:12.36’’ -inches",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1266092011"
            },
            {
                "name": "Televisions",
                "link": "https://www.amazon.com/TVs-HDTVs-Audio-Video/b/ref=dp_bc_aui_C_3?ie=UTF8&node=172659"
            },
            {
                "name": "LED & LCD TVs",
                "link": "https://www.amazon.com/LED-LCD-TVs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6459737011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Pyle"
            },
            {
                "name": "Item Weight",
                "value": "‎102.5 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "66.35\"D x 38.1\"W x 3.5\"H"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Color Name",
                "value": "‎Black"
            },
            {
                "name": "Special Features",
                "value": "‎Flat"
            },
            {
                "name": "Standing screen display size",
                "value": "‎75 Inches"
            },
            {
                "name": "ASIN",
                "value": "B0CF3NZZLH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#71,505 in Electronics (See Top 100 in Electronics) #328 in LED & LCD TVs"
            },
            {
                "name": "Date First Available",
                "value": "August 8, 2023"
            },
            {
                "name": "Screen Size",
                "value": "75 Inches"
            },
            {
                "name": "Brand",
                "value": "Pyle"
            },
            {
                "name": "Supported Internet Services",
                "value": "Netflix, Hulu"
            },
            {
                "name": "Display Technology",
                "value": "LED"
            },
            {
                "name": "Resolution",
                "value": "3840x2160"
            },
            {
                "name": "Refresh Rate",
                "value": "60"
            },
            {
                "name": "Special Feature",
                "value": "Flat"
            },
            {
                "name": "Included Components",
                "value": "Stand, TV, Remote"
            },
            {
                "name": "Connectivity Technology",
                "value": "HDMI"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About us In the late 20th century, Pyle established itself as a premium source for replacement speakers and car audio. By the year 2000, Pyle had undergone a massive transformation, expanding into the nascent market spaces of competitive car audio, home audio, marine audio, and professional audio & musical instruments - our Pyle Pro line. As you sit in your car, you are isolated from outside noise and surrounded by speakers. You become enveloped in sound. We have a wide range of speakers, amplifiers, and head units that will enrich your car audio experience. You’d be surprised at how much better your music can sound with an upgrade from the factory speakers and amplifier.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/666a16ea-ac68-4a16-899b-0974dc06168a.__CR15,0,385,385_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Pyle Car: We have a wide range of speakers, amplifiers, and head units that will enrich your car audio experience. And we don’t just focus on audio at Pyle Car. Cars are a big part of our lives, and we offer a variety of products and accessories that can enhance your experience and turn your car into a modern media system on wheels, including navigation systems, DVD players, and iPod interfaces. At Pyle, we also care about your safety. That’s why we’ve also got a full line of rear and front-facing cameras that can be wired to a monitor in your car – so you can park in those tight spots or see around corners with ease. Pyle Home: Start with your home theater, a stalwart of any modern house. We’ve got projectors, TVs, mounts, and stands, just to get started – all fully equipped with state-of-the-art HD technology, compatible with beautiful video game consoles like Xbox 360, PlayStation 3, and Wii, as well as your favorite Blu-Ray players, for crisp, hi-res images that explode in your eye on a mind-blowing scale. Of course, Pyle Home also carries all the cables and adaptors you need for a fully operational setup that’s sure to be the envy of your neighbors. There’s plenty more to keep you entertained. Bass-expanding mini speakers that run on rechargeable batteries and play your digital music, wherever you go. Perfect for the dorm room or sitting by the pool. Headphones. Vintage turntables – get the look of yesterday’s classic phonographs with today’s high-quality manufacturing standards. Power amplifiers, horn speakers, and waterproof speakers for your garden. Tripods and speaker stands. Pyle Pro: features a huge range of musical instruments, DJ equipment, and accessories for your every need. All of our products have been designed with the professional in mind. You don't just see or hear the quality - you feel it. And whether you're a hard-working musician, studio engineer, or even a budding amateur, Pyle Pro has something to offer. Among Pyle Pro’s most popular items are our PA Systems. Pyle is constantly modernizing these powerful devices to meet the demands of the modern user. Our flagship PAs include wireless microphones, rechargeable batteries, and iPod/iPhone docks. They’re great for use in large areas and events – at churches for weddings, at schools, gyms, birthday parties – anything indoor or outdoor where your voice needs to be heard loud and clear. And they’re easily transportable, thanks to caster wheels and telescoping handles. Use it for any audio – voice, guitar, CD, MP3 player – they handle everything. Pyle’s emerging guitar line is also grabbing the attention of the music industry. Models are available in double-cutaway and Les Paul styles, with solid rosewood bodies in a variety of colors. Beginner kits including Pyle has also introduced a huge variety of effects pedals. Rounding out Pyle Pro’s line are our USB-to-analog converters, including a 2-channel mixer with USB input and output.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/666a16ea-ac68-4a16-899b-0974dc06168a.__CR15,0,385,385_PT0_SX300_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [],
        "otherSellers": []
    }
}