{
    "remaining_requests": 49718,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/introducing-amazon-fire-tv-32-inch-2-series-hd-smart-tv/dp/B09N6F9NV3",
    "body": {
        "name": "Amazon Fire TV 32\" 2-Series HD smart TV with Fire TV Alexa Voice Remote, stream live TV without cable",
        "price": "$119.99$105.59",
        "originalPrice": "$199.99",
        "rawPrice": 119.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/introducing-amazon-fire-tv-32-inch-2-series-hd-smart-tv/dp/B09N6F9NV3",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BYKZFL3R"
        ],
        "asinVariationValues": [
            {
                "asin": "B09N6F9NV3",
                "variationName": "Size",
                "variationValue": "32-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09N719G17",
                "variationName": "Size",
                "variationValue": "40-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09N6F9NV3",
                "variationName": "Configuration",
                "variationValue": "TV only",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BVF8MX9K",
                "variationName": "Configuration",
                "variationValue": "with 4-year Protection Plan",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41ewL73ENML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/418UoVylqyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MNXU34MdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Zq9I5QQDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51xxLHXSsaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Fz2rz- SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41z8G5WBZSL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Amazon",
            "link": "https://www.amazon.com/Amazon/b/ref=bl_dp_s_web_20784502011?ie=UTF8&node=20784502011&field-lbr_brands_browse-bin=Amazon"
        },
        "brand": "Amazon",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 5573,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 16 hrs 20 mins",
            "FREE delivery Monday, February 19"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "High definition TV - Bring movies and shows to life in HD 720p resolution, with support for HDR 10, HLG, and Dolby Digital Audio.",
            "All your entertainment in one place - Fire TV gives you quick access to live TV, video games, and music, and lets you stream over 1 million movies and TV episodes with subscriptions to Netflix, Prime Video, Disney+, and more.",
            "Stream for free - Watch free movies and TV episodes with apps like YouTube, Freevee, Tubi, Pluto TV, and more.",
            "Enjoy MGM+ on us - Receive a 6-month subscription to MGM+, including access to thousands of Hollywood movies and Original series with your Fire TV purchase. Terms apply.",
            "Watch from room to room - All of your movies and shows from your Fire TV devices will stay in sync, for a seamless viewing experience from one room to the next.",
            "Smart and always getting smarter - Fire TV adds new Alexa skills, features, smart home capabilities, and voice functionality all the time.",
            "Press and ask Alexa - Use the Fire TV Alexa Voice Remote to find your favorite content, get sports scores, control smart home devices, and more.",
            "Connect all your devices - Use the 2 standard HDMI inputs to connect to cable or satellite and video game consoles. Use the 1 HDMI ARC input for audio equipment for enhanced sound.",
            "Wireless Bluetooth listening - Connect Bluetooth headphones for private listening to watch TV without disturbing those around you.",
            "Games on Fire TV - Discover, explore, and play games from the Appstore, Amazon Luna, and Twitch."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Resolution",
                "value": "1366 x 768"
            },
            {
                "name": "Display Resolution",
                "value": "HD"
            },
            {
                "name": "High Dynamic Range (HDR) format",
                "value": "HDR10, HLG"
            },
            {
                "name": "Backlight type",
                "value": "Direct LED"
            },
            {
                "name": "Refresh rate",
                "value": "60 Hz"
            },
            {
                "name": "Screen size",
                "value": "32”"
            },
            {
                "name": "Viewable display size",
                "value": "31.5”"
            },
            {
                "name": "HDMI ports",
                "value": "2 HDMI 1.4 + 1 HDMI ARC"
            },
            {
                "name": "Ethernet",
                "value": "1 Ethernet port"
            },
            {
                "name": "USB",
                "value": "1 USB 2.0 port"
            },
            {
                "name": "IR device control with included Fire TV Alexa Voice Remote",
                "value": "The included Fire TV Alexa Voice Remote can control certain functions, such as power and volume, on a wide range of compatible IR-enabled devices, soundbars, and A/V receivers. Note: Certain functions may not be available on some IR-enabled devices."
            },
            {
                "name": "Voice support",
                "value": "Yes, with Fire TV Alexa Voice Remote (included) or the free Fire TV app (available for download on Fire OS, Android, and iOS)."
            },
            {
                "name": "Audio support",
                "value": "Dolby Digital Plus with passthrough of Dolby-encoded audio"
            },
            {
                "name": "Audio power",
                "value": "8W + 8W"
            },
            {
                "name": "OS",
                "value": "Fire TV OS"
            },
            {
                "name": "Product size without stand (WxHxD)",
                "value": "28.6” x 17.0” x 3.2”"
            },
            {
                "name": "Weight (without stand)",
                "value": "7.7 lb"
            },
            {
                "name": "Bezel size (mm)",
                "value": "9.9 mm"
            },
            {
                "name": "Front finish",
                "value": "Black Plastic"
            },
            {
                "name": "Distance between TV legs",
                "value": "22.5”"
            },
            {
                "name": "SKU Number",
                "value": "HD32N200A"
            },
            {
                "name": "VESA Wall Mount Standard",
                "value": "100 mm x 100 mm"
            },
            {
                "name": "Accessibility features",
                "value": "VoiceView screen reader enables access to the vast majority of Fire TV features for users who are blind or visually impaired. Screen magnifier enables viewers to zoom in and out, and pan around the screen. Text Banner consolidates onscreen text into a compact, customizable banner that appears on the screen. Watch videos and TV shows with closed captioning displayed. Use Audio Description for verbal descriptions of what is happening on the screen, including physical actions, facial expressions and scene changes. Captions and audio descriptions are not available for all content. Fire TV 2-Series, Fire TV 4-Series, Fire TV Omni Series, and Fire TV Omni QLED Series support audio streaming for select compatible Bluetooth hearing aids and devices for a private listening experience. You can also listen to Fire TV with compatible Bluetooth headphones. Learn more about accessibility for Fire TV. Note: “Hearing aids” refers to compatible Bluetooth hearing devices such as traditional hearing aids, cochlear implants, and bone conduction hearing devices."
            },
            {
                "name": "Content availability",
                "value": "Certain apps and services are subject to change or withdrawal at any time, may not be available in all areas and languages, and may require separate subscriptions."
            },
            {
                "name": "Connectivity",
                "value": "Wifi or Ethernet"
            },
            {
                "name": "Digital Optical Audio Output",
                "value": "1 Digital Optical Audio Port"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Optional 3-Year and 4-Year Extended Warranty available for U.S. customers sold separately. Use of Fire TV is subject to the terms found here."
            },
            {
                "name": "Included in the Box",
                "value": "Fire TV 2-Series 32“, Fire TV Alexa Voice Remote, power cord, 2 AAA batteries, 4 screws, TV stand (2 legs), Quick Start Guide (PDF / Accessible HTML)"
            },
            {
                "name": "Software security updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Fire TV, visit Manage Your Content and Devices for information specific to your device."
            },
            {
                "name": "Size",
                "value": "38.2 x 157.7 x 17.1 mm"
            },
            {
                "name": "Weight",
                "value": "51 g (without batteries)"
            },
            {
                "name": "Batteries",
                "value": "2 AAA required (included)"
            },
            {
                "name": "Technology",
                "value": "Bluetooth 5.0"
            },
            {
                "name": "Compatibility",
                "value": "Amazon Fire TV 2-Series, Amazon Fire TV 4-Series, Amazon Fire TV Omni Series, Amazon Fire TV Omni QLED Series, Fire TV Cube (3rd Gen)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Lisforlatisha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4NHJZRIABAINUBDISHRXQYV2PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31PK3Q6S6BREA?ASIN=B09N6F9NV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great value for the cost!",
                "reviewText": "The Amazon Fire TV 32\" 2-Series HD smart TV is a fantastic value for its price, offering easy setup, clear picture quality, and an impressive in-voice function with the Alexa Voice Remote. The setup process is quick and hassle-free, and the 32\" screen provides a perfect balance of size for an immersive viewing experience without overwhelming the space. The picture quality is surprisingly sharp and vibrant for its price point, making it great for streaming movies and watching live TV. The standout feature is the responsive in-voice function, which adds a futuristic touch to the overall user experience. If you're in search of an affordable smart TV with excellent features, this one comes highly recommended!",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "QueenvikQueenvik",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGNSU5FBITFSXMJV4KATMYURMGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI2XL511121PL?ASIN=B09N6F9NV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Great choice for Short Term Rentals",
                "reviewText": "The Amazon Fire TV 32\" 2-Series HD Smart TV has become a standout feature in all of my short-term rentals, and it's easy to see why. The 2023 release combines the convenience of a smart TV with the reliability of Amazon's Fire TV platform, creating a seamless entertainment experience. The inclusion of the Alexa Voice Remote adds an extra layer of user-friendly control.Guests consistently rave about the ability to stream live TV without the need for cable, providing a wide range of entertainment options. The 32\" HD display offers clear and vibrant visuals, making movie nights or binge-watching sessions a pleasure. The setup is straightforward, and the interface is intuitive, ensuring that even guests unfamiliar with smart TVs can navigate with ease.Overall, the Amazon Fire TV 32\" 2-Series HD Smart TV has become a guest favorite in my short-term rentals. Its combination of smart features, voice control, and impressive streaming capabilities make it a reliable and enjoyable addition to any stay. Highly recommended for hosts looking to enhance the entertainment experience for their guests.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712C2XnOBCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71rSSfYhSxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71t6xCK+mDL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rick D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEE3B7PN3LDZZRWBKHYDGV4LNKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G8ADETAIULAS?ASIN=B09N6F9NV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars A Smart Entertainment Upgrade",
                "reviewText": "I recently added the Amazon Fire TV 32\" 2-Series HD Smart TV to my home, and it has proven to be a game-changer in terms of both entertainment and convenience. This budget-friendly smart TV from Amazon offers a fantastic viewing experience while seamlessly integrating the power of Amazon's Fire TV platform.First and foremost, the 32-inch HD display delivers vibrant colors, sharp images, and a crisp resolution that enhances the overall viewing experience. Whether you're streaming your favorite shows, movies, or gaming, the picture quality is impressive, providing a visually immersive experience that belies its affordable price tag.The integration of the Fire TV platform directly into the TV eliminates the need for external streaming devices, making it incredibly user-friendly. The interface is intuitive, and navigating through apps, channels, and settings is a breeze. With access to a wide range of streaming services, including popular ones like Netflix, Prime Video, Hulu, and more, the Fire TV 2-Series ensures that you never run out of content to enjoy.The voice remote that comes with the TV is a standout feature. The voice recognition is remarkably accurate, allowing for quick and easy searches without the need to type. Whether you're looking for a specific movie, TV show, or genre, a simple voice command gets you there in seconds. It's a small touch, but it significantly enhances the overall user experience.Setting up the Amazon Fire TV 2-Series was a straightforward process, and the TV seamlessly connected to my Wi-Fi network. The inclusion of multiple HDMI ports and a USB port provides flexibility for connecting various devices such as gaming consoles, Blu-ray players, or sound systems, enhancing the overall versatility of the TV.The inclusion of Dolby Audio enhances the audio experience, delivering clear and immersive sound. While it may not replace a dedicated sound system, the built-in speakers are more than adequate for everyday viewing, and the option to connect external audio devices is always there for those seeking a more robust audio setup.In terms of design, the Amazon Fire TV 2-Series sports a sleek and minimalist look that complements any living space. The TV is lightweight and easy to mount or place on a stand, offering flexibility in how you choose to set up your entertainment area.The Amazon Fire TV 32\" 2-Series HD Smart TV is a budget-friendly option that doesn't compromise on performance. With its impressive display, integrated Fire TV platform, voice remote, and user-friendly interface, it provides a seamless and enjoyable entertainment experience. Whether you're a cord-cutter or simply looking to upgrade your viewing setup, the Amazon Fire TV 2-Series is a solid choice that delivers exceptional value for the price.",
                "reviewVotes": "43 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mac Maven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKFX5IYVBKZODETCAWILCBVXXVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y15G78IKAJ6R?ASIN=B09N6F9NV3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Excellent and versatile TV/computer, but….",
                "reviewText": "Modern television are increasingly extensions of computer technology and they all have one thing in common; a lack of useful documentation. Pairing my Xfinity ( or FIOS) remote to the TV has been frustrating. Turning on thr TV requires answering “Who’s Watching” then speaking HDMI One to reach Xfinity when all I want most of the time is only TV. Perhaps there is a way to default to HDMI one but so far I have not figured it out and the website documentation is barely useful.Regardless, the image quality is excellent. There are more apps than I care to count. I have an older optical only sound bar that cannot interface with the HDMI-ARC feature But that is my problem and not Amazon. Of course, Amazon does offer a good sound bar at a reasonable price supporting HDMI – ARC.This is the second Fire TV I have purchased this year and the interface issues are the same for both. They are reasonably priced and they both perform well. I don’t believe there are any fundamental problems and perhaps it is “my bad” that I do not speak Amazoneese",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3DNFZYEIMKIZ5P5JATYEMFHUOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FVXC3EGELFOC?ASIN=B09N6F9NV3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect fit!",
                "reviewText": "Got this for our teenage son’s bedroom. It’s the perfect size, has great features, was easy to install (just screw on the feet, turn it on and do the update and you’re ready to watch!). Great price, great quality. High recommend!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}