{
    "remaining_requests": 49692,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hisense-43-Inch-43H5500G-Android-Remote/dp/B08BWJDYKC",
    "body": {
        "name": "Hisense 43-Inch 43H5500G Full HD Smart Android TV with Voice Remote (2020 Model)",
        "price": "$259.99",
        "originalPrice": "$329.99",
        "rawPrice": 259.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hisense-43-Inch-43H5500G-Android-Remote/dp/B08BWJDYKC",
        "soldBy": {
            "sellerID": "A36O232WZIIZWX",
            "name": "StuffRich Global Trading, LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A36O232WZIIZWX&asin=B08BWJDYKC&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "In stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51zmXP N83L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51GKxAnlGdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wBd7B6LSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511qCD9rTAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PK7gJsx L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oqVRKmmSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PuASoz4SL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6ac68079-26fd-4ed1-978e-a35f09ccbd21/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/51N2FuobBnL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91lz2Sq-qHL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Hisense Store",
            "link": "https://www.amazon.com/stores/Hisense/page/3C8FD5D9-E721-4938-8E17-A6944A23F3C7?ref_=ast_bln"
        },
        "brand": "Hisense",
        "merchantInfo": "StuffRich Global Trading, LLC",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 2206,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 15 - 20."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Inputs & Outputs: 2 HDMI ports, 1 Ethernet port, 2 USB Ports (v 2.0), 1 Digital Audio Output (Optical), 1 RCA Composite Video Input, 1 L/R Audio Input for composite. Product dimension (with stand)-37.6 W x 23.9 H x 7.2 D inches",
            "The H55 Series Full HD Smart TV is an entertainment must-have that feature an Android Operating System (OS) with the built-in Google Assistant, so you can search for movies and control the lights without ever leaving your couch.",
            "Voice control makes interacting with your Smart TV easier and more intuitive; open or search for apps, control the volume and inputs, or search for your favorite TV shows and movies simply through the power of your voice.",
            "DTS Studio Sound creates virtual surround sound for a crisp, immersive audio experience while full High Definition 1080p resolution delivers a sharp and detailed picture for better clarity.",
            "Motion Rate image processing helps to reduce lag during fast-moving scenes while the 43-inch screen size also makes it ideal for smaller rooms—and budgets.",
            "Built-in Bluetooth connectivity expands your entertainment options by wirelessly connecting a compatible soundbar, headphone, or stereo components to your TV."
        ],
        "description": "The H55 Series Full HD Smart Android TV is an entertainment must-have that feature an Android Operating System (OS) with the built-in Google Assistant, so you can search for movies and control the lights without ever leaving your couch. DTS Studio Sound creates virtual surround sound for a crisp, immersive audio experience while full High Definition 1080p resolution delivers a sharp and detailed picture for better clarity. Voice control makes interacting with your Smart TV easier and more intuitive; open or search for apps, control the volume and inputs, or search for your favorite TV shows and movies simply through the power of your voice. Built-in Bluetooth connectivity expands your entertainment options by wirelessly connecting a compatible soundbar, headphone, or stereo components to your TV. Motion Rate image processing helps to reduce lag during fast-moving scenes while the 43-inch screen size also makes it ideal for smaller rooms—and budgets.",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b?ie=UTF8&node=1266092011"
            },
            {
                "name": "Televisions",
                "link": "https://www.amazon.com/TVs-HDTVs-Audio-Video/b?ie=UTF8&node=172659"
            },
            {
                "name": "LED & LCD TVs",
                "link": "https://www.amazon.com/LED-LCD-TVs/b?ie=UTF8&node=6459737011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand Name",
                "value": "‎Hisense"
            },
            {
                "name": "Item Weight",
                "value": "‎13.9 Pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "3.4\"D x 37.6\"W x 22\"H"
            },
            {
                "name": "Item model number",
                "value": "‎emareg-870"
            },
            {
                "name": "Batteries",
                "value": "‎3 AAA batteries required. (included)"
            },
            {
                "name": "Color Name",
                "value": "‎Black"
            },
            {
                "name": "Special Features",
                "value": "‎DTS Studio Sound; Voice Remote; Google Assistant Built-In; Chromecast Built-In"
            },
            {
                "name": "Speaker Type",
                "value": "‎Soundbar"
            },
            {
                "name": "Standing screen display size",
                "value": "‎42.5 Inches"
            },
            {
                "name": "Voltage",
                "value": "‎120 Volts (AC)"
            },
            {
                "name": "Wattage",
                "value": "‎75 watts"
            },
            {
                "name": "ASIN",
                "value": "B08BWJDYKC"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 2,206 ratings 4.1 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#121,595 in Electronics (See Top 100 in Electronics) #502 in LED & LCD TVs"
            },
            {
                "name": "Date First Available",
                "value": "June 26, 2020"
            },
            {
                "name": "Screen Size",
                "value": "42.5 Inches"
            },
            {
                "name": "Brand",
                "value": "Hisense"
            },
            {
                "name": "Supported Internet Services",
                "value": "Netflix, Hulu, YouTube"
            },
            {
                "name": "Display Technology",
                "value": "LED"
            },
            {
                "name": "Resolution",
                "value": "1080p"
            },
            {
                "name": "Refresh Rate",
                "value": "60 Hz"
            },
            {
                "name": "Special Feature",
                "value": "DTS Studio Sound; Voice Remote; Google Assistant Built-In; Chromecast Built-In"
            },
            {
                "name": "Model Name",
                "value": "43H5500G"
            },
            {
                "name": "Included Components",
                "value": "Stand, TV, Remote Control, Power Cable"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Vivid Colors and Detailed Images High Definition 1080p resolution delivers a sharp and detailed picture for better clarity. Impressive and Accurate Sound DTS Virtual:X Sound creates virtual surround sound for a crisp and immersive audio experience. Smooth Motion Don’t struggle to keep your eye on the ball—enjoy fast-paced sports, movies, and gaming without lag. Wireless Bluetooth Audio Stream your favorite music via Bluetooth through a soundbar or headphones. Next page 1 HD Resolution 2 DTS VirtualX Sound 3 Motion Rate 120 4 Bluetooth Audio",
                "media_link": []
            },
            {
                "media_text": "Compare Hisense Smart TVs 32/40/43 inches Display Sizes 32/40/43 inches 120 Motion Rate 120 Built-in WiFi Android TV TV Platform Roku TV Bluetooth DTS Virtual:X Sound DTS TruSurround Built-in Google Assistant Compatible 32/40/43 inches Display Sizes 55/65 inches 120 Motion Rate 240 Built-in WiFi Android TV TV Platform Roku TV Bluetooth DTS Virtual:X Sound Dolby Atmos Built-in Google Assistant Compatible 32/40/43 inches Display Sizes 55/65 inches 120 Motion Rate 240 Built-in WiFi Android TV TV Platform Android TV Bluetooth DTS Virtual:X Sound DBX-TV Built-in Google Assistant Built-in 32/40/43 inches Display Sizes 50/55/65/75 inches 120 Motion Rate 240 Built-in WiFi Android TV TV Platform Android TV Bluetooth DTS Virtual:X Sound Dolby Atmos Built-in Google Assistant Built-in",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/82e464e1-6abe-46b0-bf4d-6f1c82f9c6d6.__CR3,0,2494,1022_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0bf75e54-7c80-4c83-b2d5-6623c65fe984.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/127f416e-499a-42fe-ba6e-f6621370a63f.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/51dab72d-a120-425c-bfb9-7550d1297e7c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d7653a9a-adfc-4107-974e-37367c3f1a02.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cff7a323-6277-411b-95ff-e09bf221dfa6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/61787257-7074-46e9-a402-56fa63c7ba05.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a6e33fec-ddca-45d4-9232-2e78c75fb859.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3f3538de-ac74-4c8f-9ef8-d78dd2e60258.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/24c73d66-4cee-4e51-b927-375492c48c40.__CR0,0,488,700_PT0_SX488_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Avery G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT4KEJC4MBNMQOKGYHEWKFTJIHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OAPXJ3HOW9DI?ASIN=B08BWJDYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2021",
                "reviewTitle": "5.0 out of 5 stars A great budget TV, but there are things you must do for best experience!",
                "reviewText": "Firstly, I purchased the 43 inch version with no sound bar. The packaging it was shipped in was the TV box with a shipping label, so everyone including your neighbors will know what you purchased including porch pirates, although with a package this big, I doubt that will make it any less enticing to steal if you have this issue.The tv comes with a smart remote, two legs that can be attacked to the tv with a screw and an hdmi cable. The power cable is preattached to the TV. The legs will not screw into the TV unit easily, so unless you have a really grippy screw driver and you’re strong, I highly recommend purchasing an electric screwdriver to attach them. I purchased one from Amazon for $18 and it did the trick.The picture quality is as advertised, 1080p. Due to the size of the TV the pixels are definitely noticeable, but for the $200 I paid for it, the quality is beyond acceptable.The remote is really good, despite what other reviews may say. You absolutely will notice a lag when you press a button on the remote, as well as it being finicky registering keys if you do not pair it to the tv!!! The remote will work out of the box with the TV using the IR sensor on the TV but to pair it you have to go into the TV settings on the top right and go into remotes and accessories. Once there hold the button with 3 lines on the remote which is above the arrow buttons to the left for about 10 seconds and the remote will show up on the tv. Select the remote and it will be paired. After pairing you can point the remote in pretty much any direction and it registers instantly!The tv can be slow to respond sometimes even after the remote is paired but keep in mind the price you paid for the TV and it’s a very small inconvenience in comparison and I consider myself picky.This tv has 2 hdmi ports and it is easy to switch between them using the input button. I can switch between my Nintendo Switch and Xbox with little issue.I am unsure if it just doesn’t support it, but I was unable to connect the tv via WiFi to our 5Ghz network and had to use the 2.4Ghz network. I think it doesn’t support the 5Ghz band but I’m not sure.Overall, for the price and advertised features, I give it a 5 start review. As a TV in general, I give it 3 stars due to it being a bit slow to respond sometimes and the fact you must pair the Bluetooth out of the box.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lydia1117",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFERSIKTTRKOYFM6JG5BKBYIFJXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YZPKAIU7HCI8?ASIN=B08BWJDYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2021",
                "reviewTitle": "5.0 out of 5 stars For $200, 5 stars",
                "reviewText": "I got this on flash sale for just $200 - and it's a great product at this price point. 2 HDMI ports aren't enough for you? Boo-boo, grow up and buy an HDMI switch. I don't care about 4K (I don't have anything else that high-res), I just needed more screen real estate - Full HD is plenty good enough. I would've given it 5 stars if it was a non-\"smart\" TV, the android tv stuff is just a GIGANTIC bonus to me (I had a Chromecast on my old TV, and use Google Home quite a lot, so the built-in Chromecast on this TV is pretty sweet). The voice commands don't work on the remote that came with mine, but I really don't care. Only one of the 2 USB ports on the TV works, also not a problem for me. I can plug a keyboard into the working slot to control playback and type in search boxes, and HDMI-CEC lets me use not only the TV remote for my PS4, but my keyboard, too! It seems to only work on main menus and not in games, but I'm still impressed (If you set the HDMI-CEC to have them turn each other on, make sure you leave the TV on the home screen or a different input before you turn it off, otherwise the other device will turn on/off when you just want to use the TV, or vice-versa). I don't use built-in speakers, but the amplifier they have built-in has some serious juice. I barely have the TV and stereo volumes up at all, and it gets MORE than loud enough. The only actual complaint I have is that, when streaming spotify, the sound quality is not good. It might only be noticeable if you're an audiophile too, but it matters to me. Also you have to format any USB storage you try to plug in so that it only works on that TV? Never heard of that kind of crap, but my computer is hooked up right to the TV so it's only annoying in principle.If they tried to sell me this for even twice as much, I'd be a nay-sayer. But to do all this at just $200? I've been bragging about this TV to anyone that will listen!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danielle R",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETP6NVRVAJUMVLQKU2AJIQ5AQOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQZ9EP0IPDK4U?ASIN=B08BWJDYKC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2021",
                "reviewTitle": "4.0 out of 5 stars Slow to react",
                "reviewText": "The picture is nice and I like how it connects with your accounts and shows suggestions and previously watched on home screen but the remote is slow to react and the TV is overall a little laggy. I prefer our Roku TVs honestly but this works fine for my daughters bedroom and the pictures nice!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cyprus Hart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSFXCRV7VP7MM4KEP6FXWKEV6OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYP6PBIL37J3Y?ASIN=B08BWJDYKC",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2023",
                "reviewTitle": "1.0 out of 5 stars Dumbest SmartTV of All Time",
                "reviewText": "As a TV it's fine, I guess. Shows the pretty pictures, makes the noise. 10/10. Whatever.As a *smart*TV, however, something has gone terribly wrong. I'm curious where they got the hardware for this particular TV, because I have begun to deeply suspect they make trips to their local landfill to dig up the remnants of defunct toasters. I have never, in my modern life, been so frustrated with a device before.I once made the rookie mistake of trying to search for a show. It froze for upwards of a minute between each letter. When I mistakenly selected the wrong letter I briefly considered leaping off my balcony and running headfirst into traffic, as it might be less painful.You want to turn it on after it's been sitting off for a few days? Hah. You fool! This TV does not simply obey commands. Instead, turn on that part of your brain that warns you it's too cheap to be true.No, to use it again, you have to unplug it for 30 seconds to do a hard reset. In fact, that's a recurring theme with this TV. Been waiting 8 minutes for it to scroll through all those recommended shows you're definitely never gonna watch? Time to unplug. Video won't load? Unplug. Settings won't open? Unplug. You have never known frustration until you've spent 20 torturous minutes moving like a sloth through menus, found your show, somehow got it to load, only for the whole app to freeze. And... you guessed it. Time to unplug!Because of how useless it's been, I've barely used it in all the time I've owned it. I bought a Roku today in the hopes it will make this TV usable. But if you need to bring in a second brain because the first brain can't stop drooling everywhere, can we really call it a SmartTV?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edwin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 2, 2022",
                "reviewTitle": "Buen producto por el precio que se encontró",
                "reviewText": "La calidad de la imagen se ve muy bien, en cuestión de su uso, es mejor no apagarla del todo, dejar que hiberne, porque tarda algo en cargar las apps, lo que provoca latencia en el movimiento",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raúl RE",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 9, 2021",
                "reviewTitle": "Buena TV, pero el mismo detalle del control",
                "reviewText": "La TV es buena, gran relación calidad/precio, sin embargo, el control remoto que incluye no trae micrófono para utilizar Google Assistant, es un control remoto común y corriente. Para mí no representa gran problema, pero creo que debería especificarse en la descripción del producto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Saul Castro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 5, 2021",
                "reviewTitle": "Decente",
                "reviewText": "Lo único que no me agradó mucho fue que tarda en responder la pantalla con respecto a las órdenes con el control remoto y que está pésimo el micrófono del mismo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro Daniel Garza Montes de Oca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 11, 2022",
                "reviewTitle": "Muy buen aparato",
                "reviewText": "Muy amigable y súper imagen",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco Hernandez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 13, 2021",
                "reviewTitle": "Buena opción",
                "reviewText": "La pantalla tiene un tamaño ideal, se conectó sumamente facil a mi red wifi el control reacciona muy bien y no tiene el más minimo retraso.Excelente compra.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}