{
    "remaining_requests": 49815,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SuperSonic-Widescreen-Compatible-Built-19-Inch/dp/B0057IM9EU",
    "body": {
        "name": "Supersonic SC-1912 19-Inch LED HDTV with 1080p Picture Quality, Built-in DVD Player, HDMI, USB, PC Monitor Capability, and AC/DC Compatibility - Ideal for RVs & Kitchens",
        "price": "$154.47",
        "originalPrice": "$154.47",
        "rawPrice": 154.47,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SuperSonic-Widescreen-Compatible-Built-19-Inch/dp/B0057IM9EU",
        "soldBy": {
            "sellerID": "A2CT3PWBGDZXM8",
            "name": "Outlet",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2CT3PWBGDZXM8&asin=B0057IM9EU&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07DLGVJMQ"
        ],
        "asinVariationValues": [
            {
                "asin": "B0057INQX8",
                "variationName": "Size",
                "variationValue": "13.3 in",
                "price": "$142.00",
                "variationImageURL": ""
            },
            {
                "asin": "B005Z44QSI",
                "variationName": "Size",
                "variationValue": "15 in",
                "price": "$144.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0057IM9EU",
                "variationName": "Size",
                "variationValue": "19 in",
                "price": "$154.47",
                "variationImageURL": ""
            },
            {
                "asin": "B0066ACQKU",
                "variationName": "Size",
                "variationValue": "22 in",
                "price": "$161.25",
                "variationImageURL": ""
            },
            {
                "asin": "B007GFD3EW",
                "variationName": "Size",
                "variationValue": "24 in",
                "price": "$163.85",
                "variationImageURL": ""
            },
            {
                "asin": "B07S2T3YVN",
                "variationName": "Size",
                "variationValue": "32 in",
                "price": "$185.79",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41FudnTXHGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41H2bxUp73L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CPOFdy02L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31YhiKSrpML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51kI8SidZ3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51g9wFlJh L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Supersonic Store",
            "link": "https://www.amazon.com/stores/Supersonic/page/F33C4B76-A82D-4251-A9F4-B39C11EA7341?ref_=ast_bln"
        },
        "brand": "Supersonic",
        "merchantInfo": "Ships from and sold by Brilliant Trading (We record SN).",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 4405,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 16 hrs 36 mins",
            "FREE delivery February 15 - 20.",
            "Or fastest delivery Wednesday, February 14."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "📺 Stunning Full HD Picture Quality: Enjoy stunning detail and contrast with our Supersonic HDTV, delivering a crisp 1080p picture quality that brings your favorite content to life. Immerse yourself in a spectrum of vibrant colors for an incredible viewing experience.",
            "📺 Built-In DVD Player: Say goodbye to extra equipment! Our Supersonic HDTV comes with a built-in DVD player, supporting various formats like DVD, CD, CDR, CDRW, DVD+/- R, DVD+/- RW, VCD, and SVCD. Watch your favorite movies and shows hassle-free.",
            "📺 Multiple Connectivity Options: With HDMI, USB, and AC ports at your disposal, our TV offers endless entertainment possibilities. Seamlessly connect your Firestick or other devices to access thousands of channels and apps like Netflix, Hulu, HBO, Showtime, and more. Enjoy ultimate flexibility with input compatibility for HDMI, VGA, RF, USB, PC Audio, CVBS, and Audio L/R.",
            "📺 Versatile Compatibility: The Supersonic HDTV is your all-in-one entertainment solution. It's compatible with Amazon Firestick and video game consoles, making it perfect for gaming and streaming enthusiasts. The built-in ports and DVD player add to its versatility.",
            "📺 Transform Your TV into a PC Monitor: Need a computer monitor? No problem! Utilize the PC input feature by connecting a HDMI cable and selecting the right settings. Our TV's screen size and resolution offer a fantastic PC experience, combining entertainment and productivity seamlessly."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Electronics",
                "link": "https://www.amazon.com/electronics-store/b?ie=UTF8&node=172282"
            },
            {
                "name": "Television & Video",
                "link": "https://www.amazon.com/Televisions-Video/b?ie=UTF8&node=1266092011"
            },
            {
                "name": "Televisions",
                "link": "https://www.amazon.com/TVs-HDTVs-Audio-Video/b?ie=UTF8&node=172659"
            },
            {
                "name": "LED & LCD TVs",
                "link": "https://www.amazon.com/LED-LCD-TVs/b?ie=UTF8&node=6459737011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "2\"D x 170\"W x 100\"H"
            },
            {
                "name": "Item Weight",
                "value": "6.3 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B0057IM9EU"
            },
            {
                "name": "Item model number",
                "value": "SC-1912"
            },
            {
                "name": "Batteries",
                "value": "2 AAA batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 4,405 ratings 3.9 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,919 in Electronics (See Top 100 in Electronics) #142 in LED & LCD TVs"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Date First Available",
                "value": "June 22, 2011"
            },
            {
                "name": "Department",
                "value": "LCD-Flat Screen"
            },
            {
                "name": "Manufacturer",
                "value": "Supersonic"
            },
            {
                "name": "Standing screen display size",
                "value": "19 Inches"
            },
            {
                "name": "Aspect Ratio",
                "value": "16:9"
            },
            {
                "name": "Voltage",
                "value": "12 Volts"
            },
            {
                "name": "Wattage",
                "value": "36 watts"
            },
            {
                "name": "Screen Size",
                "value": "19 Inches"
            },
            {
                "name": "Brand",
                "value": "Supersonic"
            },
            {
                "name": "Supported Internet Services",
                "value": "Netflix, Hulu"
            },
            {
                "name": "Display Technology",
                "value": "LED"
            },
            {
                "name": "Resolution",
                "value": "720p"
            },
            {
                "name": "Refresh Rate",
                "value": "120"
            },
            {
                "name": "Special Feature",
                "value": "sleep timer"
            },
            {
                "name": "Model Name",
                "value": "SC-1912"
            },
            {
                "name": "Included Components",
                "value": "product, manual"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "For over 30 years, Supersonic is a leader in Consumer and Mobile Electronics manufacturing. Success has been derived from our core mission statement: To provide Design, Value and superior Quality products, which ensure years of ultimate entertainment experience for our consumers. We strive to offer innovative and quality products that fit into every individual lifestyle. With collaboration from our partners, suppliers and customer feedback, Supersonic is continuously making an effort to satisfy the consumer’s current electronic needs.",
                "media_link": []
            },
            {
                "media_text": "Supersonic 19\" Widescreen LED HDTV Enjoy stunning picture quality and feel like your right in the middle of the action with this LED HDTV. With a built-in DVD Player, there's no need for additional boxes and cords. This 19\" LED HDTV with built-in DVD player compatbility plays your favorite DVD's with ease. HDMI input compatibility means that your media gets shown in beautiful 1080p. The built-in USB and SD card slots allow you to easily provide this set with what you'd like to watch. The built in speakers and small portability will allow users to get the perfect use out of its capabilities no matter where its location is.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/83db51cf-2217-4e85-ab37-4c257cfa83d8.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "What's in the Box: Remote ControlAC Power AdapterDC Car CordUser Manual Specifications: Product Dimensions: 17.32\" x 6.49\" x 11.57\" (with stand), 17.32\" x 2.0\" x 10.47\" (without stand)Product Weight: 5.94 Lbs.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sc/53604d2c-3a03-4cc6-b97a-fe2c2b4be439.__CR350,0,2000,2000_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sc/b44777f5-9606-4847-a23d-03807bf89efa.__CR250,0,1000,300_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/83db51cf-2217-4e85-ab37-4c257cfa83d8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/53604d2c-3a03-4cc6-b97a-fe2c2b4be439.__CR350,0,2000,2000_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tigger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH32TGM7OV6ERVAN3DNMZR72F6DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VXPGTQ4Y6WC5?ASIN=B0057IM9EU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2022",
                "reviewTitle": "5.0 out of 5 stars Know what you are buying",
                "reviewText": "I bought this to replace a 23 yr old conversion van CRT. After reading all the reviews, It seemed people liked this unit over a competing brand because the other unit had a clunky remote. This remote works very well IMO. SO good choice there. Speaker and sound level output is not great on ANY TV in this price/use case scenario. Know that going in. Rattling down the road in a 23 yr old vehicle that has 8 million screws added by conversion jockeys is an orchestra of clanks and bangs. Add wheelchairs, lifts and an engine at your feet and you get the idea. You need to ROCK OUT with sound.That means either a sound bar.(My 24 in size had no blue tooth- BIG MISTAKE) or you will need other output choices. I wanted to use the factory 4 speakers which were already drilled and mounted in my roof and rear panel. When I was reviewing this unit I saw 3 RCA jacks that were in a picture labelled OUT. Great, I can use those, convert that to an HDMI and have 2 HDMI signals! TV arrived and they were not there. I had been looking at pictures of another unit size- but same page and add. They do not all have the same outputs..sigh. I was able to use the headphone out to an RCA splitter, but my bad for not looking at the adds closer- but the info was VERY scrambled..TV has a load screen that takes about 15 seconds to clear- every time. And changing to DVD repeats the 15 second load screen. DVD player is excellent. It reloads to your last place on a new power cycle which is impressive. You can unload the DVD with the remote.I was able to output the optical SPIF to PCM and RAW formats with no issue. This TV keeps the TV speakers active during this format which I liked. Most units shut off the TV speakers if another output is active.Picture quality meets my expectations for what it is. Know what you are buying here folks. I use a firestick on this with no issues. I was able to pair it for volume and power control to the kindle remote. Awesome. Just followed the Kindle instructions- took several tries to get the right signals, but kindle found this TV brand and kept trying until it worked.Nice TV that packages well in a conversion high top van. Its very long and not too tall (24 in model) I used a 20 dollar wall mount that locks in place so this is stable on the road. My passenger is very pleased with the outcome :)",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Easy's Cycles & MoreEasy's Cycles & More",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2BYOMP33XBUEOK5UKAXOXEXXPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSYKY5HEXRFGE?ASIN=B0057IM9EU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2015",
                "reviewTitle": "5.0 out of 5 stars 24 inch LED HDTV, perfect for our off grid 23 foot Holiday Rambler... but adjustments needed... UPDATED!!!",
                "reviewText": "It's an LED HDTV for under $200! I'm amazed that for that price I could get such an amazing picture, a DVD player and it's 12 volt for the camper trailer. I have it installed on a ceiling mounted swivel so that we can watch it from the bedroom or from the living room and it will be wired into our stereo for much better sound quality. The 12 volt feature is what I was looking for and was actually looking into installing on of the 14 inch screen TV's for SUV's, but when I found this one (even cheaper than I could get a built in for) I had to have it. It's small enough for the camper trailer and big enough that we can see it clearly from both ends of the trailer. I'm still building the trailer, but installed this for wiring and trial purposes. (gotta know where the plugs go, had to reinforce mount surface to hold it) The downsides: It's LED so viewing angle matters. You will have to angle it for best viewing (got that covered with a swivel/tilt/folding ceiling mount ) The speakers are small and it does not get loud enough to hear (I have a stereo that is being installed and it has input features just for this type installation) While installing it, I found that the screw holes in the back (for the mount) are very shallow. I can cut off the screws, so to me it's not a big deal but the screws that came with the mount are too long for it. They need to be 8mm long or 5/16 of an inch. Easy fix for me. For you RVers: This TV draws very little power at all! In our 23foot Holiday Rambler this is a bigscreen! You will need to put a 12 volt power outlet close to it and be ready to put a 3.5mm speaker output wire in as well so that you can wire it to your sound system. I can hear it as-is over the Air Conditioner, but just barely. I'll update this as time goes by... Stay tuned! Well after 6 months of use in our camper (as we're still working on it as well) I'm very happy with it. We had a few really severe storms that came though and we had a lightning strike. I figured that the TV was toast as we no longer had a nice crisp clean picture. With a little investigation I found that the power cord and the antenna cable were burned. I replaced them both and we're back up and watching an amazing picture. One problem though; every now and then the picture seems to pixilate and freeze. It's easily remedied by changing the channel and going back, but it's still bothersome. If I have to buy another, I'll still buy this same one!",
                "reviewVotes": "404 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61IMgnLIavL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ProductReviewProductReview",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDW7IRHH3VI4BQPH7Q3DLIXUGUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EEN889OXX0TU?ASIN=B0057IM9EU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2023",
                "reviewTitle": "4.0 out of 5 stars Works well for the kitchen. Hard to find small size TV's.",
                "reviewText": "Purchased the 19 inch to replace a worn-out TV in January 2023 and still working great!It is hard to find small size TV's now in days. Happy to have found this model!Needed it to connect to a cable box. Please read the directions carefully or else may have a hard timetrying to connect the cable box with the TV as I did at first. Save directions for future reference.[See photo for *Quick TV Setup Sheet* that came with my unit as an example.]* It is the right size I needed. Any bigger would not without giving up counter space in my small kitchen.* Picture quality doesn't match up to the top brands but decent at eye level.* If seated below eye level, the tv appears darker.* Sound is not perfect though it is loud enough for me and ok.* Since it is not a known brand, it did not connect with the cable box remote. No worries there asthe TV does come with it's own remote which I keep by the TV anyway.* Haven't tried yet the built in DVD/CD/CDR. Will update when I have a chance to since it's not reallyneeded in my kitchen but good to have since it came with it!Note: Another reviewer commented about a bad pixel on the screen.[bad pixel = a tiny square dot on the screen of a different color.]Try lightly rubbing that spot with the ball of your finger (not nail) and it may disappear which worked for me. My TV also came with a bad pixel.Overall happy with this purchase!Thank you SuperSonic for still making smaller size TV's available for us!",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71GxTkPlviL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alan Jones",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 21, 2022",
                "reviewTitle": "TV DVD",
                "reviewText": "Nice unit",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 10, 2021",
                "reviewTitle": "Fast, good quality and great colour",
                "reviewText": "Picture quality is great and easy to install",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Happyshopper",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 4, 2021",
                "reviewTitle": "Perfect",
                "reviewText": "Perfect for my use.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barry G. Allen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 6, 2019",
                "reviewTitle": "Good pick for an RV",
                "reviewText": "I picked this particular TV because it is 12 VDC capable plus it has an included DVD player. It is perfect to install in an RV. Picture quality is as expected. It is a nice unit overall. Of course, the sound quality is terrible but that is par for the course in these TVs. I added a Bluetooth transmitter and a quality Bluetooth speaker -- sound problem solved.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "maggie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2016",
                "reviewTitle": "Five Stars",
                "reviewText": "My daughter loves it !!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$154.90",
                "sellerName": "General King",
                "sellerRating": "5"
            },
            {
                "price": "$154.90",
                "sellerName": "JupiterGear",
                "sellerRating": "5"
            },
            {
                "price": "$154.90",
                "sellerName": "Outlet",
                "sellerRating": "4.5"
            }
        ]
    }
}