{
    "remaining_requests": 26890,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SimpleAir-SC-3200-Deodorizer-Professional-Automotive/dp/B00YUPCIDI",
    "body": {
        "name": "SimpleAir SC-3200 Duct Fresh Spray Air Freshener, Cleaner, Deodorizer Professional HVAC Home & Automotive Odor Remover, 32 Oz, Clear, 32 Fl Oz",
        "price": "$16.54",
        "originalPrice": "$29.99",
        "rawPrice": 16.54,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SimpleAir-SC-3200-Deodorizer-Professional-Automotive/dp/B00YUPCIDI",
        "soldBy": {
            "sellerID": "AUU1KYNERU7US",
            "name": "The Midwestern Shop",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=AUU1KYNERU7US&asin=B00YUPCIDI&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31M1i7nGQpL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31rXIxPeC7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/311EFk-0jdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21bE4 ynvyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31torugDPcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yBGYo8opL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41E5oJ2B9KL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SimpleAir Store",
            "link": "https://www.amazon.com/stores/SimpleAir/page/4444767D-4C78-4131-9DFD-A75B150A7761?ref_=ast_bln"
        },
        "brand": "SimpleAir",
        "merchantInfo": "The Midwestern Shop",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1435,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 12 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Traps and removes unpleasant odors from the air for freshness that lasts all day long",
            "Strong enough to be used in industrial, commercial, automotive and residential applications",
            "Removes odors and noxious smells caused by smoke, mold, mildew, pets, and musty odors for freshness 24/7",
            "Comes in a convenient 32 oz. Easy spray bottle that is great for spot-treating malodor problem areas",
            "Made in the USA",
            "This product does not expire., the listed date is the manufacture date"
        ],
        "description": "Keep your air smelling fresh with the SimpleAir Duct Fresh Spray HVAC Air Freshener. This engineered odor removal solution is designed to provide a “whole house” odor removal by not simply masking odors but removing them. This air freshener is super simple to use - just liberally spray into HVAC ducts, air filter media, or musty closets, basements, RV's or boats for safe and effective odor removal. This professional-strength formula is highly effective, versatile, non-staining, and non-toxic so you can breathe easy knowing your odors are being removed safely. The spray formula allows you to target stubborn odor prone areas – lockers, storage areas, laundry rooms or any spaces that need refreshing. This versatile odor neutralizer is commonly used in homes, offices, nursing homes, and anywhere pesky odors linger. Conquer the toughest odors with the SimpleAir Duct Fresh Spray HVAC Air Freshener! SimpleAir is an innovative line of professional quality products that allow you to quickly and easily handle most repairs and regular home HVAC maintenance yourself.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Air Fresheners",
                "link": "https://www.amazon.com/air-fresheners/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15356121"
            },
            {
                "name": "Spray",
                "link": "https://www.amazon.com/spray/b/ref=dp_bc_aui_C_4?ie=UTF8&node=15356221"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.25 x 3.25 x 11.75 inches; 2.2 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SC-3200"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ June 3, 2015"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ SimpleAir"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00YUPCIDI"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,158 in Industrial & Scientific (See Top 100 in Industrial & Scientific) #31 in Commercial Air Fresheners #208 in Air Freshener Sprays"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,435 ratings"
            },
            {
                "name": "Scent",
                "value": "Fresh"
            },
            {
                "name": "Color",
                "value": "clear"
            },
            {
                "name": "Brand",
                "value": "SimpleAir"
            },
            {
                "name": "Item Form",
                "value": "Spray"
            },
            {
                "name": "Power Source",
                "value": "manual"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Keep your air smelling fresh with the SimpleAir Duct Fresh Spray HVAC Air Freshener. This engineered odor removal solution is designed to provide a “whole house” odor removal by not simply masking odors but removing them. This air freshener is super simple to use - just liberally spray into HVAC ducts, air filter media, or musty closets, basements, RV's or boats for safe and effective odor removal. This professional-strength formula is highly effective, versatile, non-staining, and non-toxic so you can breathe easy knowing your odors are being removed safely. The spray formula allows you to target stubborn odor prone areas – lockers, storage areas, laundry rooms or any spaces that need refreshing. This versatile odor neutralizer is commonly used in homes, offices, nursing homes, and anywhere pesky odors linger. Conquer the toughest odors with the SimpleAir Duct Fresh Spray HVAC Air Freshener!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fac62012-8096-4697-abc8-5740b9eebf7b.__CR0,838,523,523_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5787476-98bd-4fb3-b3a2-0b5343fe6c09.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d4c775a0-a4cd-4940-b403-7d4016cb555b.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c629868c-c0c6-44a7-8ded-bd518d25e7cf.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a8724fe-c5b2-4b10-9965-2133d191d238.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fac62012-8096-4697-abc8-5740b9eebf7b.__CR0,838,523,523_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Betty and Bill Holden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJDRWSXPOHPLCYZR4H5IGBFR7YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C3RGOATSKOK1?ASIN=B00YUPCIDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars IT ELIMINATES DIFFICULT ODORS!",
                "reviewText": "We had a recent rainstorm that causes a mildew smell. This product worked to help eliminate that and also the duct odors. I am pleasantly surprised. The fragrance does not last long but it does work well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFK7JKGQK7E5GQHOGZFIUVUU77A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4GVRP3FXCJ3B?ASIN=B00YUPCIDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Super Odor Eliminator for Vacuum!",
                "reviewText": "Frequent replacement of Febreze vacuum filters is expensive.The knock-offs don't fit as well and their scent last only 1/3 as long as Febreze.I bought SimpleAir's Duct Fresh Spray and put a few squirts into the air hose of my vacuum.Wow and amazing!The air freshening effect is immediate and lasts up to 3 vacuuming sessions.It works better than Febreze and is certainly more cost effective.My family likes the scent. It is more fresh than floral and I like it that way.Hope you find this helpful.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Simon W",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYCF2HTTWLUQYY4CKG4UG2WZV2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VU1PP1AYAFEP?ASIN=B00YUPCIDI",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Definitely has a strong scent on first use",
                "reviewText": "This does have a strong scent - one other reviewer described it as \"like a face full of baby powder\". I don't use baby powder but to me it smells like the scent of the Febreze floor cleaner scent my wife uses. I'm hoping it smells the same way to her because otherwise when she gets home I'm in trouble since now the entire house smells of it and in general she has a low tolerance for scents especially anything floral. For whatever reason the Febreze stuff doesn't seem to bother her so I'm hoping I'm okay. Fingers crossed!That said it does seem extremely effective - we had a persistent \"attic dust\" smell every time we came home and I just had our ducts cleaned which reduced it maybe 90%. I squirted a small amount of this inside the main return duct and on the filter and the whole house smells of the scent. There's definitely no chance I could smell the residual \"attic\" smell. Applying scent to the filter is so effective I think even if I used it every single day I'd have more than a year supply but I somehow doubt that will be necessary. My $20 may have just bought me years of fresh duct smell.My bottle was shipped unsealed - there was tape around the neck of the bottle though - so you will be able to discern the scent without even using it. I suggest you let the most scent sensitive member of your household sniff it before applying and return unused if they find it unacceptable. I see other \"no scent\" odor eliminators but none say they are good for ducts. However I would imagine there's not really anything special about a duct freshener vs. any other. If you mist (as fine as possible) this or any product into the return duct while the A/C is running it's going to be distributed through the system, rinse and repeat. If you have any standalone air purifiers I think the same applies.If my wife does not freak out over the scent when she gets home I will spray it into my other return and report back in a week or so on how the scent and odor situation is. After all the idea is this neutralizes not masks odor. If there is no report back from me please call the authorities because I'm probably still locked up in the basement as punishment for stinking up the house :-)",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trent AR Michaels",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHSSUT3UIP2WMPK6F7PBM7LGKIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32WK6O7IX92IW?ASIN=B00YUPCIDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Works in an old house with multiple pets",
                "reviewText": "My house was built in the 1890's and lends itself to smells from the basement, something that is not helped by my 4 cats. I've been very self conscious having people over because I Feel like the whole house smells like the basement when the AC or heat runs. But I got this spray, sprayed it into the vents in each of the rooms, and now the smell is completely gone. I am honestly extremely shocked. Even rooms where the odor was particularly bad are completely stank-free.One note I have is that when you first spray it, there is a very strong air freshener smell. I was worried it would hang around. It wasn't a bad smell, but I didn't want my house to smell like a car air freshener. Thankfully after a day or two, that smell has dissipated, but the odors have not returned.I HIGHLY recommend this.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Experienced Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN3YBYT47HXQPWMJKWIOHJMB6AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26AYBHT633FY2?ASIN=B00YUPCIDI",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2021",
                "reviewTitle": "3.0 out of 5 stars Smells Like Baby Powder Deodorant",
                "reviewText": "I have issues with a lot of scents and was hoping this would eliminate odors without adding some sort of annoying scent that would bug my sensitive self. I've got chemical sensitivity so I'm really sensitive and this does not smell horrible but smells sort of like baby powder and it gives me the feeling in my mouth like someone just squeezed a bottle of baby powder.It's possible that it's just me and everyone else thinks this smells great. Maybe it will dissipate in a few days and leave the house smelling just cleaner but so far I won't be spraying this in my vents again. We have two systems and I just sprayed it into the intake for the downstairs first because I did not want to get it in the one where I sleep until I knew how I would like it. I think I will pass on doing it in the upstairs based on my experience with the downstairs.Also an aerosol would make better sense rather than a spray bottle if you want this to trully travel through your air vents.I still gave it 3 stars because I realize a big part of my reaction could be my chemical sensitivities. It's too bad they do not make a sample size spray to send out so people could try first before buying a huge bottleThanks for reading my reviewBecky Brooks",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO6JYIJC66JUYP5Q4PBE42ULM2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R131Y2XC43D6WI?ASIN=B00YUPCIDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Works great!",
                "reviewText": "We have an old house and sometimes the a/c vents are smelly. This stuff clears it up quickly and leaves a fresh clean scent.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roshkillia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM4ZULPTO5I7YN3ZDA3A2KQHE6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK4BLCJYGVVG3?ASIN=B00YUPCIDI",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Works each time the air turns on.",
                "reviewText": "I sprayed a few mists into the duct and now every time I turn the air on it smells fresh. It only takes a few squeezes and things will start smelling better. A very powerful fresh linen smell. A week later now and I can still smell this when the system kicks on. I don't smell any odors coming out of the vents.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXV737SSIWW7EYJ6RICIORNCQ6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FIQ0LG3FGNEA?ASIN=B00YUPCIDI",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2023",
                "reviewTitle": "1.0 out of 5 stars Terrible scent",
                "reviewText": "This is an exact smell-a-like for RAID Roach Spray. Powdery, toxic and truly awful. It's 2023, people. Making a decent scent has been figured out a billion times now, no need to steal cheap scent ideas from urinals and bug spray.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$16.82",
                "sellerName": "Off The Map Sales",
                "sellerRating": "5"
            },
            {
                "price": "$18.95",
                "sellerName": "Midwestern Farmer",
                "sellerRating": "4"
            },
            {
                "price": "$19.00",
                "sellerName": "Capital Supply",
                "sellerRating": "5"
            }
        ]
    }
}