{
    "remaining_requests": 18539,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Andy-Pandy-Bamboo-Disposable-Diapers/dp/B08LL82RNQ",
    "body": {
        "name": "Andy Pandy Bamboo Disposable Diapers Small, White, 8-16 lbs, 36 Count (Pack of 1)",
        "price": "$18.90$18.90 ($0.53$0.53 / Count) $17.96$17.96 ($0.50$0.50 / Count)",
        "originalPrice": "",
        "rawPrice": 18.9,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Andy-Pandy-Bamboo-Disposable-Diapers/dp/B08LL82RNQ",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B098WYMWVJ"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Style",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31Wtiz1iDIL._SS36_.jpg"
            },
            {
                "asin": "B08LL82RNQ",
                "variationName": "Style",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/415WC7s2S6S._SS36_.jpg"
            },
            {
                "asin": "B08LL82RNQ",
                "variationName": "UnitCount",
                "variationValue": "36",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "UnitCount",
                "variationValue": "44",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31smwGwbAKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/314pRrq5LkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31WdMZpgEKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31B6UxcjC6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31zzuzDuCxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Kv1sJX2TL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51SSrzdXojL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/68e2e260-fde1-41cc-839a-beac9bb19b54/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Andy Pandy Store",
            "link": "https://www.amazon.com/stores/AndyPandy/page/532C92A5-BB2F-469B-8CB2-EC4E80BAD44B?ref_=ast_bln"
        },
        "brand": "AndyPandy",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 3551,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% Viscose",
            "Manufactured in China",
            "Andy Pandy is the original and trusted 100% bamboo viscose disposable diaper that is better for your baby and the planet.",
            "The breathable front and back sheets of our diapers are viscose made from bamboo, which reduce waste.",
            "Our diapers are free of chlorine, alcohol, preservatives, phthalates, latex, PVC, TBT, and PFAS. They are hypoallergenic, moisture wicking, and thermal regulating. Plus, our deluxe Andy Pandy diapers have an aloe liner to keep your sweet baby’s skin hydrated.",
            "Bamboo viscose is highly absorbent which is perfect for sensitive skin. Our premium diapers are ultra-comfortable and soft to protect your baby's delicate skin.",
            "With your purchase of our Andy Pandy diapers, you can also feel proud knowing that you are also contributing to wonderful causes! At Andy Pandy Kids, we're proud partners and supporters of St. Jude Children’s Research Hospital and Eden Reforestation Project."
        ],
        "description": "Andy Pandy Premium Bamboo Diapers are amazingly soft, highly absorbent and gentle on baby’s skin. l making it very comfortable for babies to wear. The micro-gaps in-between the fibers allow for optimum moisture absorption, you won’t need to constantly get-up at night to check for leakages. It’s that absorbent No need to worry about blowouts either as each diaper is made more durable by the bamboo fibers. Our diaper’s main material, bamboo is naturally hypoallergenic and odor resistant, you can now say goodbye to those pesky diaper rash. Our premium bamboo diapers are trusted and recommended by parents. Andy Pandy diapers are 100% harsh chemical and toxin-free, you can be sure that only the safest materials sourced sustainably from the environment touch your baby’s bum.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Diapering",
                "link": "https://www.amazon.com/baby-diapering-diaper-bag-wipes-liner/b?ie=UTF8&node=166764011"
            },
            {
                "name": "Disposable Diapers",
                "link": "https://www.amazon.com/Disposable-Diapers/b?ie=UTF8&node=166772011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6.9 x 4.4 x 12.2 inches; 2.1 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 2sppandy-sc"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 8, 2013"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ AmazonUs/I7S3C"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B08LL82RNQ"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,370 in Baby (See Top 100 in Baby) #46 in Disposable Diapers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 3,551 ratings"
            },
            {
                "name": "Brand",
                "value": "Andy Pandy"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Incontinence Protector Type",
                "value": "Potty Training Underwear"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09344906-27e9-4e69-9a46-58430d94e27b.__CR0,34,2949,912_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1854a47b-18ba-4bcf-bf32-8b8c1d1bc55e.__CR171,0,4042,2500_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e4d9e039-5bff-45bc-b1c3-d55648fc507a.__CR219,109,4296,2657_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alex Richards",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZBEBMZSQMC3NOWWVO3Y7S2WIWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NYABJX6MOOVT?ASIN=B08LL82RNQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Great diapers!",
                "reviewText": "We have put these diapers to the test and they were great! I switched to a more organic diaper from the traditional brands because we were having a lot of diaper rash issues. I tried 3 different brands (Seventh Generation and Earth and Eden, also) and these were by far the best. Soft, absorbent, no leaks or blow outs. We’ve been switching by from purées to solids and there is so much poop. E&E did not contain things at all and we had a blowout up the back almost every time. We haven’t had a single blow out with Andy Pandy (even without a poop pocket!). Diaper rash problems have decreased significantly as well. Fit runs true to size for us.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Randall R Marquez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2CVSRZXGCMZRSAGFGTUA6E7TLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XXR7P7J8VKPW?ASIN=B08LL82RNQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 28, 2014",
                "reviewTitle": "5.0 out of 5 stars The absolute best diapers for our son!",
                "reviewText": "Me and my wife absolutely love these diapers! We have tried many other brands including Pampers Swaddlers, Huggies Little Snugglers, Earth's Best, Babyganics and Honest Company diapers. Andy Pandy by far are our favorite! Pampers have a plastic feel to them and obviously have A LOT of SAP ( that gel stuff) in them and also have that net-like upper layer. Huggies are a bit softer but just don't fit right around the thighs and leak all the time. Babyganics and Earth's best run a bit small and have a paper feel to them even though they are definitely better for the baby. They just don't stretch. So it seems they are uncomfortable for him. Honest Company diapers are very cute and offer different patterns. They stretch better and are slightly softer than Babyganics and Earth's Best. However, we felt that they still were a bit stiff and paper-like. They also don't have a wetness indicator.Now, the Andy Pandy diapers are perfect. They are so silky soft both on the outside and inside. The company uses bamboo which is why they are so soft. Our son gets diaper rush pretty often from the non-green diapers but never got diaper rush while using Andy Pandy. These diapers are also green and great for the environment because bamboo is a very sustainable source.The Andy Pandy diapers are plain white which we actually like a lot. They look very classy. They have a yellow strip that runs down the middle and turns blue/green when wet.The side tabs and the back panel are very stretchy which allows to get a very snug fit. Our son is 2 months old and the small size fits him well now at 11-12lbs and probably will fit him for the next 2 months as well. It would have been good from probably about 9lbs. The only thing is if you want to use it on a 6-7lb newborn, it may be a bit big. However, it is very soft and stretchy so you may be able to get a snug fit. Regardless, I heard that the company is planning to start making a size extra small that would be perfect for newborns.As far as the dryness and the absorbency, our son sleeps for 6 hours straight at night now and at times he would only wake up for a quick 10 minute breastfeed and goes back to sleep. So one time we left the diaper on for 10 hours because he fell back asleep and we didn't want to wake him up. Well, when we changed the diaper in the morning, my wife touched the inside of the diaper and it felt completely dry and oh very soft. No leaks, no gel coming out of the diaper - just soft and dry.Dear Amazon, please start offering Andy Pandy on subscribe and save. We know they are fairly new but we would not join the Amazon Mom program otherwise. Andy Pandy is the only diaper we would want to subscribe to.",
                "reviewVotes": "464 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQM4LM7JQGYBETRKRKNTUP5CVNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LES0NROVY20H?ASIN=B08LL82RNQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2016",
                "reviewTitle": "5.0 out of 5 stars So far, so good. **update-a GREAT DIAPER**",
                "reviewText": "I have tried bambo nature which I like but are even more pricy, also run very large so can't start using until later on, even in newborn size. Pampers swadddlers give horrible bleeding rashes and are an incredibly fake scented product. Naty babycare diapers are healthy and contain blowouts, but full pee diapers turn outer covering damp and the clothes get wet plus they feel like construction paper and are rough and scratchy exterior, tabs are picky too. Tried these Andy pandy ones and they are unbelievably soft including tabs and stretchy. However, they are still a tad on the big side for my newborn. He is two weeks old and currently just shy of 9 lbs (not scrawny legs but not chunky ones like our first child's were). The thing with these I'm not in love with maybe because of shape of my baby is that the cut is very wide. So even though the diaper is stretchy, there is only so much width you can cross over before leg elastic so start being drawn up too high and get overly tight. So the waist is a bit baggy always and there is a bit of space under the waist band where it crosses over the legs. So a great diaper, but might need to wait until your baby chunks up....definitely not a brand new average newborn stage diaper. My son was 7 lb 12 oz at birth and no way these would have fit then. My first child was 9, 5 and would have comfortably fit these. (Whereas he had to wait even into the high 10 lb range before the bambo nature size 1 started to fit properly....bambo nature is a taller rise diaper as well).UPDATE 02/08/2016 - have been using these Andy pandy diaper in newborn size for maybe a week or two now....LOVE THEM! I still find the cut is too wide in proportion to the height /rise of the diaper. But they are such a silky soft diaper. And contain all poops and pees, outside doesnt get wet. As the baby wears them, they really mold to the baby's body nicely. Though I don't really need the feature, it is awfully nice to have the wet indicator strip in the front. And I didn't realize that the Naty diapers I was using was actually causing my baby to have a generally reddened skin all over his bottom half. When I started using Andy pandy ones, That cleared right up and went to normal, healthy, pink baby skin. I wonder if it is because naty is using corn/and possibly wheat in their diapers? Maybe he is sensitive to that.FYI - not sure how much he weighs now (maybe about 10-10.5 lbs?) but he is gaining fast and filling out. He still doesn't have thunder thighs, but he is a month old now and I have purchased the size small instead of newborn because I need more space in the rise as the poop is getting very very close to the top of the back diaper though the newborn size still holds it in but I'm not going to push my luck.Please, Amazon, bring these into subscribe and save and I will definitely be buying these as my main diapers!! Since they are more than bambo due to subscribe and save discrepancy, I will have to alternate between the two though I believe I prefer Andy pandy at the moment.------update 5/13/2016Yay! These have just been added to subscribe and save!! Thank you!!For anyone coming over from bambo nature, we are now using these in medium. The medium fits larger than bambo size 3 but smaller than size 4 (bambo seems same width but taller in size 4). My son is 26\" and 15.5 lbs, 4 months old. I used bambo for a while then came back to these with subscribe and save. These are markedly softer and thicker quality. The gusset at the back is a really nice feature these have, bambo does not and I live in fear of poop up the back with bambo. It doesn't seem to happen though with bambo but I think it is because I have him in size 4 (the threes are too tight when they get peed in) and they are so tall the diaper is nearly at his ribcage. When I asked my husband which diaper he preferred, he said probably the yellowish one (the Andy pandy are a yellowish color), he said \"they have a better fit\". These really do, they contour perfectly with our baby's bottom. I'm still quite pleased with them.(As a product suggestion, it would be awesome if this company also sold a version of these diapers as disposable diaper inserts for cloth diaper covers for people who use hybrid systems. It is maybe cheaper to manufacture what is essentially a large gusseted maxi pad ? and people who are trying to save a little extra but need the convenience of disposable for outings, trips, travel, plus having healthy non toxic diapers for their baby could go that route and still be an Andy pandy customer.)-last update 05/20/2016So.....my baby is developing a diaper rash from these. Red dots that look like heat rash (but isn't) and keep getting redder snd redder and more and more of them. Skin puffing up. He had been getting that pretty badly a while back, but I couldn't tell what was causing it. I had a break from Andy pandy for a couple weeks and the rushing went pretty much just about away when I started them back up, within 48 hours, it was back. Is it the aloe liner? I am so depressed. I love everything about this diaper. I guess baby decides otherwise. Don't let this discourage you from trying this diaper though. Every baby is different, and my babies have had insanely sensitive skin and always been borderline rashly.*i just got earths best and honest diapers and within a day of wearing them, his rash is like 90 percent better already. I will have to donate the rest of my opened pack.*. Amazon was WONDERFUL about free returning the second pack I bought (unopened) because they were causing my son a rash.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 24, 2020",
                "reviewTitle": "Excelente pañal,",
                "reviewText": "Les ha pasado que muchas veces después de probar muchos pañales terminas con el que te recomendaron o el primer pañal ?, he probado 12 marcas de pañales sy este esta entre los 4 primeros , ecológicos, suave, absorbente y un diseño en blanco puro muy elegante.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christine G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 19, 2017",
                "reviewTitle": "Thrilled with these diapers!",
                "reviewText": "They are amazing! So soft, really absorbant, no leak, no rush! And AFFORDABLE!! I want more of this size and the size up... Will they be bac soon, on prime too?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 22, 2017",
                "reviewTitle": "Amazing diapers!",
                "reviewText": "These are amazing diapers, they are extremely soft, absorbant and I feel much better that they are organic and biodegradable and made out of bamboo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 31, 2017",
                "reviewTitle": "Love, love, love these diapers",
                "reviewText": "I cannot rave enough about these diapers. We were so torn about diapers when we had our daughter because we didn't want to add to the landfills and we are also not the type to deal daily with cloth diapers. They fit well according to their size chart (we've used both newborn and S). No complaints. They are soft and nice for baby's bum too. We will keep buying these. Just need to throw them in the green bin (in Toronto) and less landfill waste!I read in other reviews about dampness and some fluffiness. It does feel a bit damp at times and there has been little fluff maybe a handful of times. I honestly don't care-clothes don't ever get wet (unless a blow-out-which happens in all diapers) and I like that it is made from natural fibers rather than plastic. It goes on baby's bum all day and night.I tell all of our Eco-conscious friends about it too. Also price is great! Not too far off the major disposable brands.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Kaye",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 31, 2017",
                "reviewTitle": "I can't get over these nappies. We tried them ...",
                "reviewText": "I can't get over these nappies. We tried them on the advice of our GP who said to try hypoallergenic nappies (our daughter just couldn't shift what had started as a fungal infection). Within a day it was starting to clear.The nappies are so soft and never leave skin clammy. They're extremely absorbent without getting bulky. I'm never going back to Pampers again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}