{
    "remaining_requests": 18468,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Luvs-Leakguards-Disposable-Diapers-SUPPLY/dp/B07F6G42R9",
    "body": {
        "name": "Luvs (LUVSD) Diapers Size 6, 124 Count - Luvs Ultra Leakguards Disposable Baby Diapers, ONE MONTH SUPPLY (Packaging May Vary)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Luvs-Leakguards-Disposable-Diapers-SUPPLY/dp/B07F6G42R9",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": null,
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51oiRMQCgSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51HHEPsrs9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WcHdIv7uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gU3cwwIuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pflGIC4oL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/513 Gcg9iKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51AfGRvnKHL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bad53a47-69a8-4449-a4d4-b51bd0f0918f/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/61JAwTbeb6S.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/61JAwTbeb6S.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Luvs Store",
            "link": "https://www.amazon.com/stores/Luvs/page/C59D3557-0AF6-4858-BAA2-7F4A963F5684?ref_=ast_bln"
        },
        "brand": "Luvs",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 16606,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Weight Recommendation: 35+ Pounds. Nightlock Technology locks away wetness for upto 12 hours of overnight protection",
            "Super soft on baby's skin for a comfy feel",
            "Wetness Indicator (packaging may vary) turns blue when wet, telling you when your baby needs a change",
            "Designed with larger, refastenable tabs for a secure, snug fit",
            "NOTE: The expiration date is for REWARDS not for the product"
        ],
        "description": "Get Pro Level Leak Protection with Luvs. Designed with Triple Leakguards that help stop leaks before they happen. They also feature a Wetness Indicator that turns blue when wet. When it comes to bedtime, Luvs Nightlock Technology works to lock away wetness so your baby can dream on.",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b?ie=UTF8&node=165796011"
            },
            {
                "name": "Diapering",
                "link": "https://www.amazon.com/baby-diapering-diaper-bag-wipes-liner/b?ie=UTF8&node=166764011"
            },
            {
                "name": "Disposable Diapers",
                "link": "https://www.amazon.com/Disposable-Diapers/b?ie=UTF8&node=166772011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 11.06 x 20 x 11.06 inches; 8.47 Pounds"
            },
            {
                "name": "Manufacturer recommended age ‏",
                "value": "‎ 24 months and up"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SG_B07F6G42R9_US"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ July 12, 2018"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Procter & Gamble"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07F6G42R9"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,333 in Baby (See Top 100 in Baby) #89 in Disposable Diapers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 16,606 ratings"
            },
            {
                "name": "Brand",
                "value": "Luvs"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Blue"
            },
            {
                "name": "Incontinence Protector Type",
                "value": "Infant Diaper"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/aab4f8ed-90f5-4868-99a5-6c048f8929de.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7dff4dce-c1d5-4615-8416-8fbaff127794.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/566b709b-c2c1-42de-8ce5-a2b4881f28d9.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Angela Uncapher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHHMKBNY2FZJMGWUIIJX6OKXVO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13M2Q3U73QRFV?ASIN=B07F6G42R9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2019",
                "reviewTitle": "5.0 out of 5 stars Loving the new luvs",
                "reviewText": "I have to disagree with all the other reviews for the new luvs diapers They are amazing!I been using luvs diapers for the past 3 years on my twins a boy and a girl when i first got a new box i was annoyed they changed them because they were fine before but after using them i was happy they are way better then the old ones i always order diapers online and i recently got 2 boxes of the old design(from Walmart) and its been horrible my kids are in a size 6 and the old are to small for my son they cut into his hips leave indents all over he hates them and my daughter keeps waking up in the middle of the night to be changed cuz she soaked that never happens with the new ones but iv also never had issues with the ild one tell they made the new one so if your kids are in the biggest size they make (6) the new ones are the way to go!My hole family uses luvs i highly recommend them they are the best prices and best quality!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Madeline",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2FOSHWDS5GX7OZWPRXEATXGNUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1XRQUAJID1AE0?ASIN=B07F6G42R9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 10, 2020",
                "reviewTitle": "5.0 out of 5 stars Back to Basics - Luvs is working for me again!",
                "reviewText": "About a year ago, after using Luvs diapers exclusively for my two boys, I had problems with the diapers leaking during naps, the nighttime, and even the day! This happened even when I made size changes and to my friends with toddlers, which was very frustrating. I contacted the company, found out there had been a change to the structure of the diaper (which should have made it stronger) and was reimbursed and given a few coupons for Pampers or Luvs diapers. Although I was unhappy with the diapers, I was impressed with the customer service.After a year of buying more expensive diapers, I needed to make a change to help make our dollars stretch. I decided to try Luvs diapers again and was pleasantly surprised. What makes Luvs even better is the ability to use Subscribe and Save on Amazon and have them delivered directly to my front door. No more having a diaper box fill up my cart at the store or having to take the diaper box from the shelf to the cart to the checkout lane to the cart to my car to my house (if you know, you know). I'm not sure what went on a year again with the design change of Luvs diapers, but I'm happy with them now and back to using them exclusively. I hope this helps!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kelleybelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFM7JURSEAGLCGZM7EG6BGV7OUJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39VSFEETQNATM?ASIN=B07F6G42R9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 17, 2019",
                "reviewTitle": "5.0 out of 5 stars The best (for us at least)",
                "reviewText": "These are the only diapers that have held up with my now 3 year old. We have done cloth (part-time up until she was 2), Pampers, Honest Co, Hello Bello, Huggies, off brands from Walmart and Target (Target ones are the only ones worth buying btw) and she manages to pee or leak through them all somehow. She is a very heavy wetter. Luvs hold up all night for her (12+ hours) and they fit her so nicely. Different brands work better for different babies, but I'm so glad Luvs work best for my girl. They're so affordable too!All the good stuff aside, they do sometimes tear easily at the tabs when putting them on. This doesn't necessarily affect function. I just stick the sticky tab over anyway and throw the broken tab away. If it happens on an overnight diaper I just layer another one on top just in case. It's never leaked and we've always been able to use the top diaper again in the morning.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cousin ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEMATYPVYVZFM2FECP5LW7XWHCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E6IAZ7VW2HCC?ASIN=B07F6G42R9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Valuable",
                "reviewText": "No leaks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "k2k299",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLR7CO5TPUM6VFFYXHXOPB6AUCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2C56SBQBLEAD1?ASIN=B07F6G42R9",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2021",
                "reviewTitle": "5.0 out of 5 stars Best bang for your buck plus EXCELLENT diaper",
                "reviewText": "My 1st used it starting at size 3 bc of major diaper rash from Huggies movers from Costco. Now my 2nd also started using Luvs at size 3 too bc of the same diaper rash at Costco again! Since then we changed to LUVS and no problem! No leaks even after a 14 hour wear! And very cost effective compared to Huggies or Pampers for this size.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika Baez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXK7CPT6AHIK37XI7BVZLVKE47Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IRBAEG3RMG9V?ASIN=B07F6G42R9",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Great diapers for really active toddlers",
                "reviewText": "As a parent of an active toddler, finding the right diaper is essential for my child's comfort and overall well-being. Pampers Pull-On Cruisers have been a game-changer in our diapering routine. These diapers offer convenience, comfort, and reliability, making them a top choice for parents of active toddlers. In this review, I will share my experience with Pampers Pull-On Cruisers and why I believe they are among the best diapers in the market.Ease of Use:One of the standout features of Pampers Pull-On Cruisers is their ease of use. The pull-on design makes diaper changes quick and straightforward, even with a squirmy toddler. I no longer have to struggle with tabs or fasteners; I can simply slide the diaper on and off with ease. This has been a game-changer during diaper changes, especially when my child is on the move.Secure Fit and Flexibility:The elastic waistband on Pampers Pull-On Cruisers ensures a snug and secure fit. The diapers stay in place, even during active play and movement, which means fewer leaks and accidents. I love how the diapers move with my toddler, providing the flexibility and freedom of movement needed for exploration and play.Outstanding Absorbency:Pampers Pull-On Cruisers boast excellent absorbency, even during extended wear. Whether it's during playtime, naps, or overnight, these diapers keep my child feeling dry and comfortable. The 360° coverage and leak protection give me confidence that my little one is well-protected throughout the day and night.No Diaper Rashes:Since switching to Pampers Pull-On Cruisers, my child has not experienced any diaper rashes. The diapers are gentle on my toddler's sensitive skin, and the breathable materials help keep their skin dry and healthy. This is a significant relief for me as a parent, knowing that my child is comfortable and irritation-free.Cute Designs:The adorable designs on Pampers Pull-On Cruisers are an added bonus. My child enjoys seeing their favorite characters and prints on the diapers, which can make diaper changes a bit more fun and enjoyable for them.In conclusion, Pampers Pull-On Cruisers diapers have been a lifesaver for our family. The ease of use, secure fit, outstanding absorbency, and gentle materials have made them the perfect choice for my active toddler. The cute designs and eco-friendly initiatives are icing on the cake. I highly recommend Pampers Pull-On Cruisers to all parents seeking a reliable, comfortable, and convenient diapering solution for their little ones. With Pampers, I feel confident that my child is getting the best care and protection, allowing them to explore and play to their heart's content.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}