{
    "remaining_requests": 18531,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Happy-Little-Camper-Absorbent-Premium/dp/B077YKTJJY",
    "body": {
        "name": "Happy Little Camper Ultra-Absorbent Hypoallergenic Natural Disposable Baby Diapers, Chlorine-Free Protection for Sensitive Skin, Newborn, Size 1, 36 Count",
        "price": "$18.04$18.04 ($0.50$0.50 / Count) $16.14$16.14 ($0.45$0.45 / Count)",
        "originalPrice": "",
        "rawPrice": 18.04,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Happy-Little-Camper-Absorbent-Premium/dp/B077YKTJJY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CT94595G"
        ],
        "asinVariationValues": [
            {
                "asin": "B077YKTJJY",
                "variationName": "Size",
                "variationValue": "Size 1, 36 Count",
                "price": "$18.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C4QKC2WR",
                "variationName": "Size",
                "variationValue": "Size 1, 216 Count",
                "price": "$74.99",
                "variationImageURL": ""
            },
            {
                "asin": "B077YL7H95",
                "variationName": "Size",
                "variationValue": "Size 2, 36 Count",
                "price": "$18.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07JF8BLQL",
                "variationName": "Size",
                "variationValue": "Size 2, 216 Count",
                "price": "$74.26",
                "variationImageURL": ""
            },
            {
                "asin": "B077YLB6GY",
                "variationName": "Size",
                "variationValue": "Size 3, 31 Count",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B088ZW8Y7W",
                "variationName": "Size",
                "variationValue": "Size 5, 25 Count",
                "price": "$18.99",
                "variationImageURL": ""
            },
            {
                "asin": "B099QNTQPC",
                "variationName": "Size",
                "variationValue": "Size 5, 25 Count (Pack of 6)",
                "price": "$69.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C4QC8K3C",
                "variationName": "Size",
                "variationValue": "Size 6, 17 Count",
                "price": "$16.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0C4QB11SL",
                "variationName": "Size",
                "variationValue": "Size 6, 102 Count",
                "price": "$74.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UYWxw2iPL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41XRifa fBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41OJEx-ovUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41td nZdUeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CvzERMw0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415YzCMZUeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91gcFKYg1KL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6a05cbc9-8731-4f57-9a00-5b3241865696/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bcb378d6-f8c3-4037-87a4-5c6a54fba950/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Happy Little Camper Store",
            "link": "https://www.amazon.com/stores/HappyLittleCamper/page/25E630C1-984F-4D81-988B-E1D1FE69D814?ref_=ast_bln"
        },
        "brand": "HappyLittleCamper",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 573,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 3 hrs 30 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 3 hrs 30 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LEAK AND BLOWOUT PROOF - our ultra-absorbent BIO-CORE BLEND and strong + elastic side tabs provide reliable protection against leaks and blowouts.",
            "NO MORE DIAPER RASH - our super soft top and back sheet protect your baby’s sensitive skin and reduce the risk of diaper rash while the absence of added fragrances, harmful dyes, and chlorine, latex, phthalates, parabens make these diapers hypoallergenic.",
            "CHLORINE FREE - Our diapers have no parabens, chlorine, silicone, phthalates, triclosan, sulfates or lead.",
            "NO HARMFUL CHEMICALS - our diapers are made without any harmful chemicals, so no VOC’s or toxic adhesives get introduced to your baby’s system.",
            "ORGANIC AND NATURAL - we use soothing natural ingredients such as Organic Aloe Vera and Vitamin E, while also guaranteeing a latex-free product.",
            "SUSTAINABLE - we source only the purest , sustainably sourced pulp and natural cotton which are all approved by Mother Nature and FSC certified.",
            "BABY-FRIENDLY DESIGN - our lightweight,ultra-thin, superabsorbent and non-bulky materials come together in a contoured fit with TDI-free elastics keep your baby comfortable at all times."
        ],
        "description": "The best natural diapers with ultimate comfort and reliable protection for happy babies. Protect your baby’s delicate skin with gentle and all-natural ingredients. Be worry-free with the ultra-absorbent natural wood pulp bio-core blend to soak up more liquid than other conventional and organic brands. Our breathable materials wick away moisture to keep your baby’s diaper area free from skin irritations, reduce diaper rash and most importantly , won't leak.12-18 LB (5-8 KG)",
        "breadCrumbs": [
            {
                "name": "Baby Products",
                "link": "https://www.amazon.com/baby-car-seats-strollers-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=165796011"
            },
            {
                "name": "Diapering",
                "link": "https://www.amazon.com/baby-diapering-diaper-bag-wipes-liner/b/ref=dp_bc_aui_C_2?ie=UTF8&node=166764011"
            },
            {
                "name": "Disposable Diapers",
                "link": "https://www.amazon.com/Disposable-Diapers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=166772011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 11.4 x 4.5 x 6.6 inches; 1.57 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ HLC1BD36US"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ December 6, 2017"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Naturalena Brands"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B077YKTJJY"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Greece"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,441 in Baby (See Top 100 in Baby) #58 in Disposable Diapers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 573 ratings"
            },
            {
                "name": "Brand",
                "value": "Happy Little Camper"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Color",
                "value": "Size 1"
            },
            {
                "name": "Incontinence Protector Type",
                "value": "Infant Diaper"
            },
            {
                "name": "Age Range (Description)",
                "value": "Baby"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The best natural diapers Highly absorbent, ultra-comfortable diapers with no nasty chemicals. Highly absorbent, ultra-comfortable with no nasty chemicals, our plant-based Happy Little Camper Premium Natural Diapers are better for baby and better for our planet. The best natural diapers with ultimate comfort and reliable support for happy babies. Nurture your baby’s delicate skin with gentle and all-natural, skin-loving ingredients. Our breathable materials wick away moisture to keep your baby’s diaper area free from skin irritations and most importantly, won't leak. DIAPERS THAT FIT RIGHT - Keep little ones dry and comfortable with natural diapers that fit right! Contoured design wraps snuggly around baby's legs and waist for flexible fit and comfortable movement whilst saving from leaks and discomfort.ULTRA-ABSORBENT DIAPERS - The ultra-absorbent natural wood pulp bio-core blend soaks up more liquid than other conventional and organic brands. Our pulp is 100% natural and great at absorbing liquids for dry, healthy-looking bottoms!SUPER SOFT DIAPERS - Soft cloud comfort from lightweight, ultra-thin, super-absorbent and non-bulky materials. Comfortable and no leaks!GENTLE ON BABY'S BOTTOM - Breathable, natural layers reduce the risk of diaper rash. Made with soothing natural ingredients that are gentle on baby's delicate skin.LEAK AND BLOWOUT PROOF DIAPERS - Ultra-absorbent BIO-CORE BLEND and strong elastic side tabs provide reliable defence against leaks and blowouts.DIAPERS FOR SENSITIVE SKIN - Super soft, GMO-Free Cotton Blend top and back sheet are gentle on your baby’s sensitive skin. Our cotton-blend back sheet is GMO-free, breathable, and printed with certified inks without lead or other heavy metals. No fragrances. No bleach. Non-toxic and nothing harmful or irritating to delicate skin.NO HARMFUL CHEMICALS - Chemical-free diapers (free from harmful chemicals) and better for the earth. Our natural diapers are made without any harmful chemicals, so no VOC’s or toxic adhesives get introduced to your baby’s system. Completely free from polyethylene glycols (PEG), ethyl alcohol, parabens, polyethylene terephthalate (PET), silicone, dioxins, VOCs, lotion, latex, TBT, & GMO.CHLORINE FREE DIAPERS - Our natural diapers contain no chlorine. All cotton is cleansed with an oxygen cleansing process, not chlorine-bleached, for a healthier eco-friendlier diaper.UNSCENTED, HYPOALLERGENIC DIAPERS - The absence of added fragrances, harmful dyes, and chlorine, latex, phthalates, parabens make these diapers hypoallergenic.ORGANIC AND NATURAL INGREDIENTS - We use soothing natural ingredients such as Organic Aloe Vera and Vitamin E, while also guaranteeing a latex-free product.BABY-FRIENDLY DESIGN - Our lightweight, ultra-thin, super-absorbent and non-bulky materials come together in a contoured fit with TDI-free elastics keep your little one comfortable at all times.DIAPER SUBSCRIPTION - Save with a diaper subscription or a diapers and wipes subscription. Subscriptions can be easily updated as your baby grows another size or your needs change. Diaper subscriptions are automatically renewed according to your selected delivery interval and your order will be automatically delivered right to your doorstep!NATURAL DISPOSABLE DIAPERS - Take the stress out of washing cloth diapers with Happy Little Camper Natural Disposable Diapers! Plant based natural materials make the diapers breathable and comfortable on baby's skin whilst having a lower environmental impact than conventional diapers. Finally... disposable diapers that aren't full of plastic! Our ultra absorbent, super soft, low environmental impact range of diapers are perfect for planet-loving parents.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1313f8c9-f372-4a5e-8334-8712d720e044.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Super soft, very absorbent and and no leaks! Take the stress out of washing cloth diapers with Happy Little Camper Natural Disposable Diapers! When it comes to the Happy Little Camper in our lives, natural is better, which is why we’ve created baby products that are naturally safe and naturally better for your baby's skin and for the environment.​ This means that not only is your baby comfortable in Happy Little Camper, but also safe and free from harsh chemicals. Knowing the facts, consider making a better choice for your baby’s bottom by making Happy Little Camper your go-to natural baby care brand. SUSTAINABLE DIAPERS - We source only the purest, sustainably sourced pulp and natural cotton which are all approved by Mother Nature. Feel good about using Happy Little Camper with plant-based ingredients! Why don't we include wetness indicator strips on our diapers? You know those little wetness indicator strips on your baby’s diaper? Have you noticed that Happy Little Camper diapers don’t have them? There’s a good reason for that! While the wetness indicator offers the convenience of knowing when baby is wet, the strips are actually made out of harmful chemical dye. One of the Happy Little Camper promises are that our diapers contain NO dye, which is why there are no wetness indicators in our diapers. Moms and Dads, we’re pretty confident that you know when your baby is wet without needing an indicator strip made of harsh dyes to tell you. Did you know that babies urinate up to20 times a day? This means that baby should be checked every 2 to 3 hours. Usually, wet diapers will tend to be heavy, you can either pad the diaper with a hand, squeeze it gently. When squeezing or padding the diaper, it’ll be obvious that the diaper is wet from the moisture soaking the inner diaper layers. Opening up the diaper to double check is also advised and there’s always the good ol’ nose-to-diaper smell test! Happy Little Camper = No Dyes or Harmful Chemicals Happy Little Camper products do not contain harmful chemicals because our diapers +wipes are made with natural, hypoallergenic ingredients. We don’t use indicator strips or any dye that can penetrate baby’s skin and potentially cause harm to their fragile organs. Our products have been dermatologically tested, so you can trust that our diapers + wipes are skin-loving and safe for baby. What is diaper rash? Diaper rash grows in warm and moist places on your baby’s bottom and appears in patches of inflamed red skin. A baby’s skin is extra sensitive and can overreact to exposure to certain environmental factors and chemicals. Naturally, some babies have more sensitive skin than others and tolerate products differently. Common causes of nappy rash include; Diaper is not changed frequently enough, Skin sensitivity to harmful chemicals found in unnatural diapers and/or Change in diet/introduction to new foods Steps to limit the likelihood of nappy rash include; Changing your baby’s diaper more frequently and/or Using natural products free from harsh chemicals. Happy Little Camper is super soft on your baby’s sensitive skin there are no added fragrances, harmful dyes, and chlorine, latex, phthalates, parabens contained in our diapers. Our products are made of the purest, sustainably sourced pulp and natural cotton which are all approved by Mother Nature. What is Eczema and how is it caused? Eczema also known as atopic dermatitis is a very resilient skin condition that makes your skin red and itchy. One in five children develop Eczema with a large majority having an outbreak before the age of five. Eczema is long lasting (chronic) and gets worse the longer it is present making it harder to control. Your genetic background is a strong predictor of eczema. If both of your parents have it, there is an 80% chance that you may develop it as well. Eczema generally flares as a result of environmental factors including change in climate to either cold, dry conditions or hot, humid ones. This is because eczema affects the skins’ ability to provide moisture and defend it from irritants, and allergens. In some cases, food allergies may play a role in causing Eczema, particularly in children. Our diapers are packed full of safe ingredients and nutrients to soothe and hydrate your baby’s’ sensitive skin. Most importantly, they are dermatologically tested and hypoallergenic meaning they are safe and soft on your baby’s bottom!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19a72e81-91d2-4927-8a13-f191a55fde55.__CR0,0,1455,900_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "About Happy Little Camper At Happy Little Camper we began with the basics - nature. We believe using natural baby care products is better for your child's skin, better for their health, and better for our environment. We're committed to sustainably - sourced ingredients, safe manufacturing processes and packaging made from recycled materials. Feel good about using Happy Little Camper with plant-based ingredients! Fragrance free diapers. Natural diapers. Hypoallergenic diapers. Breathable diapers. Sustainable diapers. Chemical free diapers. Plant based diapers. Paraben free diapers. Ultra absorbent diapers. Best diapers for diaper rash. Newborn diapers. Toddler diapers. Infant Diapers. Crawler diapers. Size 1 diapers. Size 2 diapers. Size 3 diapers. Size 4 diapers. Size 5 diapers. Diapers for sensitive skin. Chlorine free diapers. Sustainable diapers. Disposable diapers. Non toxic diapers. Lead free diapers. Leak free diapers. Baby care. Best baby diapers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e66b1cc3-4465-4e99-b03a-4e0375916600.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "GMO-Free Natural Cotton diapers Super soft, GMO-Free Cotton Blend top and back sheet are gentle on your baby’s sensitive skin and reduce the risk of diaper rash. Our cotton-blend back sheet is GMO-free, breathable, and printed with certified inks without lead or other heavy metals. Hypoallergenic diapers The absence of added fragrances, harmful dyes, and chlorine, latex, phthalates, parabens make these diapers hypoallergenic. Soothing Aloe Vera and Vitamin E diapers we use soothing natural ingredients such as Organic Aloe Vera and Vitamin E, while also guaranteeing a latex-free product. Ultra-Absorbent diapers Ultra-absorbent BIO-CORE BLEND and strong elastic side tabs provide reliable defence against leaks and blowouts. Our pulp is 100% natural and great at absorbing liquids!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1aab65c-0f38-49e0-9a19-cc2fb7062643.__CR1,0,1748,1748_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ebdf9d7f-92d9-4f5c-9750-1301ecb4d7be.__CR0,0,1740,1740_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3914848f-c3e1-4b1a-a8e1-b01fd312c8ab.__CR0,0,1739,1739_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ba783dd-ce3b-4a56-ae59-b3f239337020.__CR0,0,1740,1740_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "Plant-Based, Natural Baby Care Products Our natural diapers are made from GMO-free cotton and contain soothing Aloe Vera and Vitamin E, ideal for your baby's sensitive skin. Dermatologically Tested and Proven Hypoallergenic Nurture your baby's delicate skin with gentle and all-natural ingredients. Your happy little camper is safe with our ultra-absorbent natural wood pulp bio-core blend to soak up more liquid than other conventional and organic brands. Natural Baby Care at Affordable Prices We never use any of the nasty chemicals conventional brands use because we wouldn't sell products we wouldn't be confident to use on our own happy little campers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2749dabb-4708-4e00-855e-837f5ab964cc.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96fd9532-9f3c-4beb-93d8-a21f80f99d67.__CR0,0,500,500_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a787680-a78b-40ad-848d-7bb483731645.__CR576,0,3456,3456_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1313f8c9-f372-4a5e-8334-8712d720e044.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/19a72e81-91d2-4927-8a13-f191a55fde55.__CR0,0,1455,900_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e66b1cc3-4465-4e99-b03a-4e0375916600.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c1aab65c-0f38-49e0-9a19-cc2fb7062643.__CR1,0,1748,1748_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ebdf9d7f-92d9-4f5c-9750-1301ecb4d7be.__CR0,0,1740,1740_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3914848f-c3e1-4b1a-a8e1-b01fd312c8ab.__CR0,0,1739,1739_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ba783dd-ce3b-4a56-ae59-b3f239337020.__CR0,0,1740,1740_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2749dabb-4708-4e00-855e-837f5ab964cc.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96fd9532-9f3c-4beb-93d8-a21f80f99d67.__CR0,0,500,500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9a787680-a78b-40ad-848d-7bb483731645.__CR576,0,3456,3456_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Alexis Hatfield",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNNYHYPHB4W6RZFPNASQMDGQ25Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RV41F22HVXQ3?ASIN=B077YKTJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars The only diapers I buy for my kids!",
                "reviewText": "I love Happy Campers. I have 2 under 3 and we go through a LOT of diapers. These are the only organic diapers that I've found that also have good absorption. I recommend them to my new mom friends. I do not particularly enjoy their wipes, they are too dry and rougher cloth. but the diapers I will use forever!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jackie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5ZNKV3M43YPVI5XSWPBZWX6VGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18P64M06S1BU0?ASIN=B077YKTJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Good for a natural diaper",
                "reviewText": "These diapers did not have the chemical strip on them, and they are much thinner than some bigger brands. It was weird to switch since I was used to having other diapers be more absorbent, but they were fine for making it through the night. I also found these were more affordable than some other clean brands . We needed to make the switch because of diaper rash my child kept getting , and these did the trick to help alleviate that.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kori",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6QKKDTJFFA2HVGC6LVSDFZAJPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYPMRODGPU1XT?ASIN=B077YKTJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 17, 2024",
                "reviewTitle": "5.0 out of 5 stars So Much Better than Coterie",
                "reviewText": "I love these diapers so much more than Coterie!I had been using Coterie on my baby for a year since he was about a month old. Then, something changed in their diapers. They had a chemical smell, my baby got a really bad rash, and five boxes of diapers I got from Coterie had stiff chunks of pulp inside the diaper.I did a bunch of research after that and wanted a diaper that was cleaner and actually non toxic; one that was not made with polyester. That's how I found Happy Little Camper.I was hesitant at first as I really wanted to go back to the old Coterie. But I tried it and I was so amazed! I wish we had switched earlier. My baby's rash cleared up, my bank account was happier, and I was amazed at how well the diapers absorbed.I did worry about blow outs or pee through because of how thin the diapers are, but we have been using them for 5 months now and haven't had any issues whatsoever. They hold so much liquid that when my baby sleeps 12hours, he still wakes up feeling dry.I highly recommend these diapers as a disposable option!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The_Acne_NP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6G4M4S3OTX6C6XQEZTNMYI4TLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A0S2CW8YOZ9B?ASIN=B077YKTJJY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "3.0 out of 5 stars Poor fitting, prone to leaking",
                "reviewText": "I like that these diapers are “ clean” but they are very thin , which is somewhat of a good thing, because I feel it’s more comfortable for the baby to move around without a huge diaper, but on the downside, they fill up quickly and leak often. They also do not fit very well. The “Velcro“ does not stick very well to the front of the diaper. My daughter has had lots of leaks when she doesn’t in other brands. I made the mistake of ordering a huge number of these so I will have to work my way through them and change diapers more often to avoid leaks.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamie C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXNWKQUNQJAVINGP7URW4VQX77A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QA5TBXYLOKMF?ASIN=B077YKTJJY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Super soft",
                "reviewText": "These are very decent for the price. Absorbent like the major brands but it does run a little smaller to size than the other brands. So flipping soft tho. Overall 4/5",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TK",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDMU6SXII2PS27S4BV6EZCB4WDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ECEEQPV6HGQZ?ASIN=B077YKTJJY",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "1.0 out of 5 stars Used to be good",
                "reviewText": "These used to be great. Obviously the company changed hands or rebranded or something and when they did they changed everything. These are now thin, cheap, junk, and don’t feel ‘natural’ anymore.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "None Yo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBJJS75CK6VNILH3NYSEEIJUIOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16NM13OP5Q7GI?ASIN=B077YKTJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Exactly the same diaper as the $1.10 a pice Brand.",
                "reviewText": "After trying about 10 different brands to find a diaper with the absolute least amount of poison that will destroy my little dudes endocrine system & ability to produce the correct sex hormones, I swear it's just like mattresses. There are a handful of companies that make all of them & just put more expensive labels & price tags on the same models. Diapers are the same deal. I was buying crazy expensive ones called Attitude because they had a list of \"No\" 's I wanted to see & they are the only diapers I've found that don't leak by morning but they are over $1.10 a piece & we aren't in that income bracket to waste money like that so I kept hunting & tried these. They are exactly the same, same scratchy rough ruffles on the side, same amazing absorbing ability. Same back that goes practically up to their shoulders hahaha. I use these for night time but when I use up all the other lame terrible Honest company diapers I hate I will use these exclusively. Absolute best for the price I have found...yet.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3GEAL2D3RSOPPT4PUQ3MZ3R7EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GG9N9NOMHHAX?ASIN=B077YKTJJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 14, 2019",
                "reviewTitle": "5.0 out of 5 stars Great diapers in size 2!!",
                "reviewText": "These diapers worked great with my daughter. I have been trying a bunch of different diapers (especially more natural ones) I have found on Amazon since my daughter was born. She is 6 months now and so far these are one of my favorite brands of all I have tried and I will be going back to them when I finish up the Earth and Eden box I bought last (these are much better). These absorbed well, we never had a blow out or leak, they are super soft, and they are so adorable to boot!! What's more to love?? The owl design is adorable but I do think it looks a little more on the girly side but it really is meant for either gender. I used these in a size 2 so I'm not sure how well they would work with an older baby but for a younger breastfed baby they were PERFECT!! When I use them again as she grows I will update this review and I will also upload some photos.I rely heavily on reviews when deciding to make purchases on Amazon so I know how important they can be for shoppers. Therefore, if you found this review helpful at all, please mark it as helpful. Thanks and happy shopping!!",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 19, 2023",
                "reviewTitle": "Safe and sturdy diapers",
                "reviewText": "Highly recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 4, 2023",
                "reviewTitle": "Los mejores",
                "reviewText": "Los mejores pañales,de lejos,comparado con varias marcas. Hemos probado muchísimos y estos son los que mejor nos van,aguantan muchísimo,no dejan rojeces, incluso con piel atópica,la noche aguanta muchísimo. Los teníamos para usar de noche y siestas y el resto del día unos \"baratos\"pero no merece la pena, son perfectos para todo el día .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eleonora",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 28, 2020",
                "reviewTitle": "Ottimo prodotto",
                "reviewText": "I migliori pannolini eco mai provati, peccato non si trovino più nelle taglie grandi, ho anche un bimbo di 2 anni per il quale li ho usati finché amazon non li ha più avuti in magazzino. Speriamo vengano riassortiti.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alessandro R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 13, 2019",
                "reviewTitle": "Pannolini",
                "reviewText": "Il mio bebè è soddisfatto 😜",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Flatterzunge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 1, 2019",
                "reviewTitle": "Couches respectueuses de l'environnement et de la peau de mon bébé",
                "reviewText": "Les meilleures couches bio selon moi. Elles sont ultra fines, douces et surtout assurent une nuit sans fuite !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$18.99",
                "sellerName": "Veeda",
                "sellerRating": "4.5"
            },
            {
                "price": "$18.99",
                "sellerName": "NBI Distribution",
                "sellerRating": "0"
            }
        ]
    }
}