{
    "remaining_requests": 30960,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Oceanstar-SR1231-3-Tier-Bamboo-Shoe/dp/B0073NIBW6",
    "body": {
        "name": "Oceanstar 3-Tier Bamboo Shoe Rack, Brown",
        "price": "$49.69",
        "originalPrice": "$59.99",
        "rawPrice": 49.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Oceanstar-SR1231-3-Tier-Bamboo-Shoe/dp/B0073NIBW6",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51VMBiIRFqL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41 vXsvzaCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wpZFsXJYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5104t2ZRemL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Oceanstar Store",
            "link": "https://www.amazon.com/stores/Oceanstar/page/B2A17FAA-BB9B-4024-BCD3-58A811C8D461?ref_=ast_bln"
        },
        "brand": "Oceanstar",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 599,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 16 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Holds approximately 9 to 12 pairs of adult size shoes",
            "Crafted to hold shoes, accessories and bags",
            "Item dimensions: 13 d x 29.5 w x 20 h inches",
            "Easy to clean by using a damp cloth"
        ],
        "description": "Get organized with Oceanstar’s 3 tier bamboo shoe rack today. This 3 tier shoe rack holds shoes on each level and keeps your shoes neat and tidy. This is a perfect accessory for the entryway and for keeping shoes off the floor. Made of carbonized bamboo, a fast-growing material that reduces environmental impact, this shoe rack has a modern look that will never look outdated. Unlike traditional enclosed shoe cabinets, the open slats on each tier here allow air circulation between your shoes. It features rounded corners, slatted shelves, and an adjustable design that allows shoes to rest on a flat or angled surface. The two arches on each side make transportation easy around the house. The 3 tier shoe rack holds approximately 9 to 12 pairs of adult-size shoes. This shoe rack is easy to clean by using a damp cloth. This also comes in a two tier version. Easy assembly required and hardware included. Measure 13 D by 29-1/2 W by 20 H-inch.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Storage & Organization",
                "link": "https://www.amazon.com/storage-organization/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3610841"
            },
            {
                "name": "Clothing & Closet Storage",
                "link": "https://www.amazon.com/Clothing-Closet-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2423187011"
            },
            {
                "name": "Shoe Organizers",
                "link": "https://www.amazon.com/Shoe-Organizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=695481011"
            },
            {
                "name": "Free Standing Shoe Racks",
                "link": "https://www.amazon.com/free-standing-shoe-racks/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11601913011"
            }
        ],
        "productInformation": [
            {
                "name": "Room Type",
                "value": "Entryway"
            },
            {
                "name": "Number of Shelves",
                "value": "3"
            },
            {
                "name": "Special Feature",
                "value": "Adjustable"
            },
            {
                "name": "Product Dimensions",
                "value": "13\"D x 29.5\"W x 20\"H"
            },
            {
                "name": "Style",
                "value": "Modern,Adjustable"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Brand",
                "value": "Oceanstar"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe with Dry Cloth"
            },
            {
                "name": "Size",
                "value": "3-Tier"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Shoes"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Manufacturer",
                "value": "Oceanstar Design Group"
            },
            {
                "name": "Model Name",
                "value": "3-Tier Bamboo Shoe Rack"
            },
            {
                "name": "Item Weight",
                "value": "7 pounds"
            },
            {
                "name": "Furniture Finish",
                "value": "Brown"
            },
            {
                "name": "Installation Type",
                "value": "Freestanding"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "ASIN",
                "value": "B0073NIBW6"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "SR1231"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 599 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#392,164 in Home & Kitchen (See Top 100 in Home & Kitchen) #824 in Free Standing Shoe Racks"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Maximum recommended load",
                "value": "35 Pounds"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Material Bamboo",
                "value": "Shelf Type Tiered Shelf"
            },
            {
                "name": "Shape Rectangular",
                "value": "Assembly Required Yes"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "About Us: Oceanstar Design Group Inc. is a designer and one of the leading manufacturers of home and kitchen storage products, which focus on easy home décor storage and furnishing products. Our vision is to provide home improvement solutions at an affordable price. Visit us to find out more about Oceanstar Design Group Inc. Oceanstar 3-Tier Bamboo Shoe Rack Get organized with Oceanstar’s 3 tier bamboo shoe rack today. This 3 tier shoe rack holds shoes on each level and keeps your shoes neat and tidy. This is a perfect accessory for the entryway and for keeping shoes off the floor. Made of carbonised bamboo, a fast-growing material that is bio-degradable, this shoe rack has a modern look that will never look outdated. Unlike traditional enclosed shoe cabinets, the open slats on each tier here allow air circulation between your shoes. It features rounded corners, slatted shelves, and an adjustable design that allows shoes to rest on a flat or angled surface. The 3 tier shoe rack holds approximately 9 to 12 pairs of adult-size shoes. Holds approximately 9 to 12 pairs of adult size shoes Dimensions: 20 inch H x 13 inch D x 29.5 inch W Product weight: 7 lbs Easy assembly Care and Maintenance: When cleaning your furniture, use a non-toxic and non-abrasive cleaner. Apply to the surface with a soft, dry cloth, dampened in the solution. After cleaning, dry completely with a soft dry cloth",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/913484ea-adb3-4743-8411-052dee1d26c7._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/141c6934-42b7-4362-80e3-5daecfca9f33._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Slatted Tiers Each tier has a slatted design to enhance optimal air circulation and to prevent the buildup of odor. The multiple tiers can be used to hold any collection of your home accessories in addition to your shoe collection. Additionally, this design gives the shoe rack a contemporary look to your home environment.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ca658477-2427-408d-9eed-1cf6f782235e._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Rounded Handles The shoe rack is designed with rounded handles to provide an aesthetically pleasing look. This design also offers greater comfort and easier portability when moving the shoe rack. In addition, these rounded edges prevent the risk of injury during transportation.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/156f7499-f575-41eb-9543-590aaf565742._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Compact Size The shoe rack’s compact size makes it a perfect fit for any space in the home. It can fit in any corner or nook of your house. Moreover, it is lightweight, which enables easier portability throughout the house.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a67e258b-2202-49d7-8476-b25f00c7a64c._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/913484ea-adb3-4743-8411-052dee1d26c7._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/141c6934-42b7-4362-80e3-5daecfca9f33._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ca658477-2427-408d-9eed-1cf6f782235e._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/156f7499-f575-41eb-9543-590aaf565742._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a67e258b-2202-49d7-8476-b25f00c7a64c._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Woodworker1543",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBL6N3A7NBYUC63IGVBH7QMYW6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JKMB6U2DR4E8?ASIN=B0073NIBW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2019",
                "reviewTitle": "5.0 out of 5 stars Functional shoe rack for the price",
                "reviewText": "I like this shoe rack. It is definitely cheaply made but looks better than most other cheaper shoe racks you could buy from amazon.Definitely not meant to hold much weight but does the job for holding shoes and looks minimalistic and cute. I could fit four pairs of ladies size eight shoes on each row.One of the screws did come with the head closed up so it was unusable. Not an issue in the end, just missing a screw.Easy to assemble.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RunSueRun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBS4YXMWKJLU2DUSYJNSLJBIZQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F4EYUQPV8GD7?ASIN=B0073NIBW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2014",
                "reviewTitle": "5.0 out of 5 stars No Bamboozling....this is a good product!",
                "reviewText": "As I was pulling one of nine pairs of running shoes from my new bamboo shoe rack I thought to myself \"I love this shoe rack so much, I should take a minute to write a review!\" And voila...this product \"racked up\" my first five star review. Admittedly, I did not have to assemble this - my 17-year-old niece did it for me. So I can't speak directly on the ease of assembly, but in my \"supervisory role\" it appeared to be a snap. :) And the finished product is great - definitely the best of three shoe racks I own. The height easily accommodates running shoes, which was my biggest concern. The width accommodates three across so nine in total, just about right. And it is actually attractive! I know, how can \"shoe rack\" and \"attractive\" go together?! But it's just a nice quality and much better look than metal or plastic. All in all, a nifty product that I can highly recommend.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2MG2K3AHXTGSJR6T5GBRTDFREQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YFWT4Z0TPGHB?ASIN=B0073NIBW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2016",
                "reviewTitle": "5.0 out of 5 stars Nice shoe rack with tropical look",
                "reviewText": "Am remodeling my front living room with a tropical theme so this bamboo show rack is an early furniture purchase to get all my shoes out of the floor. Went together easy and is sturdy. Looks nice and functions well. Some of the wood pieces are just a bit rough but you have to study it to really notice it. I am a stickler for details so I notice these things but the average person probably won't. Overall, am happy with it and would buy again if I need another.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul Standaert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6JZAGURRQYEWUW3UUMZFV7KQ6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33BVMN9195W6E?ASIN=B0073NIBW6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2015",
                "reviewTitle": "4.0 out of 5 stars Nice feature. I purchased a discounted version of this",
                "reviewText": "Simply built, simple to assemble. It holds 3 pairs of shoes on each level (size 11 shoe here) Boots have to go on the top rack due to clearance restrictions.Also, a feature I didn't see mentioned was that these are stackable. If you buy a 2nd one, the other will stack on top. Nice feature.I purchased a discounted version of this, due to the box being opened once upon a time or something to that effect. As reasonably expected, there were some issues with it, as it was definitely assembled by someone at one time and was broken (the bamboo was split by a long screw, or it was overloaded previously. Two screws were broken, and they did not appear to be defective. Other screws were bent. Since I was half expecting something like this, it was worth the discounted price tag for the few more minutes it took me to drill another adjacent hole (there was plenty of meat for a 2nd hole) and I inserted a smaller diameter screw. One of the broken screws I welded back together Red/Green style and it works wonderfully now. It seems that split bamboo is a common issue with these, but it is easily avoidable with a little mechanical assembly aptitude, along with ownership of a drill and drill bits. If the screws start going in hard, its time for a shorter screw or a bigger pilot hole.As far as craftsmanship, I think that they could easily be a bit more consistent in the drilling of their pilot holes, and this could have been the reason for that one part that I mentioned being broken. If it was not for that, it is a 5-star product. It looks nice, is sized efficiently, fit and finish was good.I recommend it for residential use, as I wouldn't expect it to hold up to heavy duty abuse of, say, your place of employment where people are constantly using something that is not theirs. Don't be using it to sit on while you put your shoes on. Its not made for that kind of duty.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CookieC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLMUVXI7GOX2EJRVM37EMDBPPZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28IZV8MJRVIHP?ASIN=B0073NIBW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 22, 2017",
                "reviewTitle": "5.0 out of 5 stars Well constructed and looks nice",
                "reviewText": "I love this shoe rack. It is easy to put together and is very well made. This is the second one I have purchased. We keep one by the front door (we are a \"no shoe\" household) and I bought another to keep in my closet. The only improvement I would suggest would be to add a small rubber piece to the feet on the bottom, because the wooden pieces made scratches in the hardwood floor. I ended up putting small pieces of felt on the bottom, but I have to switch them out periodically because they attract dust and dirt.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angela Lopez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQWN4IMX6NWVJ7CCRHBCIMRMMUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38ACTNJNKEWEA?ASIN=B0073NIBW6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Easy to stack",
                "reviewText": "I have a lot of shoes. I bought three of these and made a tower. So far, it is very sturdy and it looks way better than that crappy thing I bought in the past with the metal tubes and plastic sides, (which fell apart every time I bumped it) The shoes sit on it nicely and don't fall through like the other kind. It's a bit tricky sometimes to get the last peg in when putting together, and I did shave a bit off the side of the peg that wouldn't go in, but other than that, not at all complicated to put together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KathrynKathryn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGQYAFVSM7G6QGFK66VAM6MFBHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PQVIO35066PQ?ASIN=B0073NIBW6",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2015",
                "reviewTitle": "3.0 out of 5 stars Very attractive fits 10-12 shoes but had to return the first one.",
                "reviewText": "This is a shoe rack, that could have been a lot more than what it. I had to return the first one I ordered as it was broken (see pictures). Amazon very quickly and without fuss sent me a new one (I need to return the broken one otherwise I'm charged for both). The second one I received was still broken but not to the extent the first one was and was still completely useable.It holds approx. 10-12 pairs of shoes depending on how big your shoes are. There is definitely no room on the second or third shelves for anything other than trainers/sandals. Boots/heels will need to go on the top shelf. It is very attractive and looks nice sitting by our back door in the living room. This is definitely ONLY a shoe rack. I've seen some questions asking if it can be sat on...ABSOLUTELY NOT!!! It is strong enough for shoes and that is it. My little boy loves it, he loves playing and rearranging all the shoes on it.The second one I received (see pictures) was assembled really quickly and easily - 6 screws with an allan key - done. the thing that was \"broken\" was some of the shoe supports had not been glued in properly and therefore have slightly bowed (see picture) this is a super easy fix with some glue and not worth returning as it is not noticeable and does not render the rack unusable.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61vZ3YgWryL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71E6m10x17L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71GskBqHRgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71qjSz51riL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71rvJgqQSaL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 18, 2019",
                "reviewTitle": "Pricey but attractive.",
                "reviewText": "I think this shoe rack is a bit pricey however it is attractive and what I wanted for the space I have for it so didn't mind paying the cost. Also, very easy assembly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "miguel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 27, 2018",
                "reviewTitle": "Buena compra",
                "reviewText": "Me gusta como se ve el bambú y en general el rack de zapatos. Muy fácil de armar.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "glen448",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 18, 2014",
                "reviewTitle": "looks so nice",
                "reviewText": "this is the best looking shoe rack. it is sturdy and can fit 9 pairs of shoes. it is a good buy. and very easy to assemble",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marina P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 28, 2014",
                "reviewTitle": "The nicest shoe rack",
                "reviewText": "Decorative and functional, I like it's made from wood, looks really nice. Perfect for a limited spaces - if you buy more than one you can stack them with the holes on the unit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William D. Wood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 12, 2015",
                "reviewTitle": "The Good Stuff - easy to assemble - attractive - good ...",
                "reviewText": "The Good Stuff- easy to assemble- attractive- good delivery timeThe Critical Stuff- screws too long- supplied hex tool correct size, but time consuming to use- bamboo will crack if screws tightened too tightSuggestions to Purchaser- use a proper hex tool with a handle to insert screws- purchase screws ¼ inch shorter- don’t over-tighten else bamboo may crackWas this helpful?",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}