{
    "remaining_requests": 30930,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Whitmor-Tier-Floor-Shoe-Rack/dp/B005KC6DY0",
    "body": {
        "name": "Whitmor 4 Tier 20 Pair Floor Shoe Rack - White",
        "price": "$12.97",
        "originalPrice": "$29.99",
        "rawPrice": 12.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Whitmor-Tier-Floor-Shoe-Rack/dp/B005KC6DY0",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07B8YM23S"
        ],
        "asinVariationValues": [
            {
                "asin": "B01LZNFZTM",
                "variationName": "Size",
                "variationValue": "20-PAIR TOWER",
                "price": "$20.07",
                "variationImageURL": ""
            },
            {
                "asin": "B005KC6DY0",
                "variationName": "Size",
                "variationValue": "20 Pair (4 Tier)",
                "price": "$12.97",
                "variationImageURL": ""
            },
            {
                "asin": "B004FLZH7Q",
                "variationName": "Size",
                "variationValue": "30 Pair (10 Tier)",
                "price": "$16.67",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71OhdQhhyvL._AC_SX466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Whitmor Store",
            "link": "https://www.amazon.com/stores/Whitmor/page/92A2D88B-7356-4E01-880A-F42655531A2E?ref_=ast_bln"
        },
        "brand": "Whitmor",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 8914,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Friday, February 16. Order within 5 hrs 19 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Whitmor's 4 Tier Floor Shoe Rack provides simple organization for up to 20 pairs of shoes",
            "Great for open living spaces, such as an entryway or garage, where shoes tend to pile up",
            "Vertical, compact design fits perfectly in the closet under hanging clothes",
            "Assembled Dimensions: 9\" x 35.75\" x 18.75\" inches Perfect small space solution for apartments and dorm rooms Constructed of durable white resin and epoxy coated steel",
            "Easy assembly, no tools required",
            "SERVICE AND GUARANTEE: Whitmor stands by our products. If you have any problems, contact us for help"
        ],
        "description": "Product description Whitmor Floor shoe stand in white color measuring 9 x 35.8 x 18.8 offers compatibility to hold up to 20 pairs of shoes and is made of resin material for long durability. Whitmor Floor shoe stand can be assembled in minutes and requires no tools. Stand in white color measuring 9 x 35.8 x 18.8 is ideal to hold up to 20 pairs of shoes and can be used in home, office or dorm room. Material: Resin. Holds up to 20 pairs of shoes. Assembly required. Placement: Floor. For home, office or dorm room. Fits under most hanging clothes. Brand Story By",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Storage & Organization",
                "link": "https://www.amazon.com/storage-organization/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3610841"
            },
            {
                "name": "Clothing & Closet Storage",
                "link": "https://www.amazon.com/Clothing-Closet-Storage/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2423187011"
            },
            {
                "name": "Shoe Organizers",
                "link": "https://www.amazon.com/Shoe-Organizers/b/ref=dp_bc_aui_C_4?ie=UTF8&node=695481011"
            },
            {
                "name": "Free Standing Shoe Racks",
                "link": "https://www.amazon.com/free-standing-shoe-racks/b/ref=dp_bc_aui_C_5?ie=UTF8&node=11601913011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Whitmor"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Material",
                "value": "Resin"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Shoes"
            },
            {
                "name": "Product Dimensions",
                "value": "9.02\"D x 35.75\"W x 18.8\"H"
            },
            {
                "name": "Installation Type",
                "value": "Free Standing"
            },
            {
                "name": "Special Feature",
                "value": "Durable"
            },
            {
                "name": "Style",
                "value": "Simple"
            },
            {
                "name": "Finish Type",
                "value": "Steel"
            },
            {
                "name": "Number of Shelves",
                "value": "4"
            },
            {
                "name": "Furniture Finish",
                "value": "Brown"
            },
            {
                "name": "Frame Material",
                "value": "Metal"
            },
            {
                "name": "Assembly Required",
                "value": "Yes"
            },
            {
                "name": "Item Weight",
                "value": "2.35 pounds"
            },
            {
                "name": "Maximum Weight Recommendation",
                "value": "25 Kilograms"
            },
            {
                "name": "Manufacturer",
                "value": "Whitmor"
            },
            {
                "name": "ASIN",
                "value": "B005KC6DY0"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "6780-3139-WHT"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 8,914 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#101,139 in Home & Kitchen (See Top 100 in Home & Kitchen) #294 in Free Standing Shoe Racks"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Specific instructions for use",
                "value": "personal"
            },
            {
                "name": "Finish types",
                "value": "Steel"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "For replacement parts or assembly questions call 1-888-whitmor."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Imported"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ana PaulaAna Paula",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIV43UXFA56626ZNTXZGARYV63A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SGL1VVA7ZDZT?ASIN=B005KC6DY0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2018",
                "reviewTitle": "5.0 out of 5 stars May be cheap, but very sturdy and does the job.",
                "reviewText": "I bought these shoe racks because they were cheap, so I was not expecting much but for them to get the job done for a low price - and they did! I bought two of them because I have a lot of shoes and limited storage in my closet, so I wanted to be able to use a rack that I could get all shoes out of the way at once if I needed to. And these racks have worked greatly for these purposes so far: they store my shoes and can move them out of the way.Each row fits 5 pairs of regular shoes (sandals, flats, flip flops, some heels and ankle boots) or 4 pairs of sneakers. I wear size 9, but I don’t think that makes any difference in fitting more or less shoes. I placed my high heels at the bottom row so that the heels won’t be hanging and decreasing the space on the row below. That was not a problem for me because I do not own a lot of high heels and I was able to fit lots of shoes on the rack.It was incredibly easy to assemble - I did it myself in about 5 minutes and it is sturdy enough that I can lift the rack filled with shoes to move it aside. The material does not seem heavy duty, but it does serve its purpose. I cannot attest for its durability as I’ve only had it for a week or so, but I definitely recommend the product as a cheap solution for shoe organization.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71U+l3G8-EL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71aPIigKdlL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUPOWG2M7NE6A366LSYWBT75FSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20OM3HVXOAJOV?ASIN=B005KC6DY0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2014",
                "reviewTitle": "5.0 out of 5 stars For the price, great product!",
                "reviewText": "If you are looking for a no no nonsense, easy to assemble shoe rack look no further. And for the price I don't think you can find anything that will compare to the functionality that this product offers.When I received the package I was surprised to see all (8) of the posts for the shelves all together and that had to be snapped apart. However, that was easy enough to do and I was able to assemble in less than 5 minutes, and that's with my toddler and the dog competing for my attention at the same time.It's pretty versatile; If you have tall shoes I think you could remove one of the middle shelves if needed. I purchased this rack to go right against the wall where our front door is. It's a temporary fix for when I get my covered porch converted to a half mud room. But it looks great and it's simple, organizes the area and is the perfect width for what I needed.I put all of my toddler's shoes on the bottom since they would fall through anywhere else on the rack. With me and hubby's boots, sneakers, and several of my dress shoes, there is still plenty of room for more. I have 17 pairs of shoes (men, women and child) and we still have room for another 5 or 6 pairs of adult sized shoes. My husband wears a size 11 and I wear a women's 10. Looking at the width, I think the shelves should accommodate smaller sizes fairly well. Of course, I would be inventive and stick some cardboard or something to make the shelf a solid, flat surface. But fortunately I don't need to do that unless my son's shoes soon overtake the rack, which could be possible.All in all, great rack and even better price! Fast shipping too!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "She Buys StuffShe Buys Stuff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFYU46NNWH6FBYAUFC62DJBWOMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W7FGULDS9FBJ?ASIN=B005KC6DY0",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2013",
                "reviewTitle": "4.0 out of 5 stars Sturdy shoe rack, with some drawbacks for women's heels",
                "reviewText": "I own a rather shameful number of nice high heels, to the point that I have begun to overflow the seemingly ample shoe cupboard in my closet. I purchased this product as a temporary holder, to keep my rather pricey shoes from remaining in a heap on the floor until I could sort out the closet situation. That being said, the rack appears very sturdy, and could definitely serve as a permanent solution for those who wished it to be.The set up is extremely easy. There are two plastic side pieces, with little feet on the bottom, and holes down the side to insert the bars. And then 8 individual bars, which arrive in 2 sets of 4 held together with plastic endcaps on both ends. So they really looked like 2 barred shelves when they arrived, causing me a solitary second of confusion, before referring to the 3 step assembly directions, lol. It took 5 minutes total, the majority of which was spent prying those darn endcaps off, so I could get the bars out. Assembly is very much a simple, one-person job. Insert bars into holes on both side pieces, smoosh it all together, done.The rack itself is very sturdy, and while made of plastic sides and metal bars, it really doesn't look frighteningly cheap when assembled. If anything, the cheapness of it makes it somewhat more discreet.As I said, I bought this to exclusively hold women's stilettos - specifically size 8-8.5 - and it does an adequate job of that. There are definitely a few problems, though. I will say that a slanted base is likely better for holding heels. Flat rows like this cause stilettos to lean far back until they catch at the top of the heel. Which creates the major problem with this rack - the heels dangle into the row below, and nest inside the shoes below. I posted a picture of this to the item photos, to better illustrate the point. Now, this is not the end of the world. Essentially, it just means I have to be careful when removing shoes. I usually hold on to the shoe above as I shimmy out the show below, or vice versa. If I don't do this, the back of the shoe will inevitably get caught on the heel above, and everything will tumble. This may not be a problem with shorter heels (most of mine run 3-4 inches), but I'm betting there is still some nesting. The rows are also very closely spaced, so a little shimmy is required even without stilettos on the row above, as the heels have to kind of be worked over the bars. Of course, more space between the rows would have meant a higher shoe rack, and I prefer to keep the size compact. Finally, the bottom row sits less than an inch off the floor, again helpful to keeping the rack compact, but it also means the heels on the bottom row simply go over the bar and sit on the floor. Not a problem for me at all, but I wanted to lay out all the unexpected quirks.I am still pleased with this purchase. It is a GREAT price point, for something that takes up little space (all things considered) and holds a fair number of shoes. I would not hesitate to recommend this product to someone looking for permanent storage for flats, or temporary storage for heels. But if you are seeking permanent storage for primarily heels, I would look for something with a little less heel hassle.(Oh, and final note - I noticed one review mentioned the rack being adjustable - I don't know what they meant, but no, it is not. The two side pieces are solid, immovable pieces. They can't be made shorter or taller to accommodate more or fewer rows. There are 4 rows, period.)UPDATE: This shoe rack has never worked perfectly for my particular needs, but I thought I would update this review, since it is still in use for various sneakers. As stated above, this rack is ideally suited towards flats or low heels. And likely shoes at least a woman's size 8. Beyond that, it has held up perfectly in the 5 years I have had it. No leaning, no bending. I do wonder if some of the people experiencing this problem put it together tightly enough. I literally stood it on it's side and pressed with all my might, to ensure the rods went all the way in. Simple enough. Also, I noticed several reviewers thought the product arrived broken and \"fused\" together. That is the endcap used for shipping! You remove it and throw it away.",
                "reviewVotes": "508 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51Encwq5bZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "MS ADAMS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3L6ZRKPU5AAPMKRAGPFINTLBCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z3KTWWUTHAO6?ASIN=B005KC6DY0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Convenient",
                "reviewText": "These are perfect for small spaces. And holds ALOT of shoes. Actually went back to purchase another one",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Btownreviewer ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLFTSIWIZEOGHWZHMI33S7LKGYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R312J3DXDHDR9M?ASIN=B005KC6DY0",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2023",
                "reviewTitle": "3.0 out of 5 stars Nothing much has changed",
                "reviewText": "This is one of those “golden oldy” products but think it’s time for a change…more modernI found the product, not so sturdy, has fallen apart on me a few times but luckily it’s easy enough to put back together - just annoying!I would be more apt tonpurchase the clear stackable shoe boxes, they are much more neat and modern",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "THE MIG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6I4J5PKXAROJBPRQT3HIATN5JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RQR5LDO8H7CK?ASIN=B005KC6DY0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 27, 2022",
                "reviewTitle": "5.0 out of 5 stars VERY EASY TO ASSEMBLY AND DOES HOLD 30 PAIRS OF SHOES-- AS EXPECTED!",
                "reviewText": "It's very light weight and you don't need tools or directions. It is plastic, not steel and thus it is not going to be considered sturdy. However, Whitmore has improved this rack over the years and it is better than the last one which collapsed on me in the middle of the night. It is secure enough to trust that it will last for some time. The connecting points fit in better than the previous models and I believe it should last for a couple of years.The price is reasonable and delivery was fast and easy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sheryll",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 15, 2022",
                "reviewTitle": "Good value for money",
                "reviewText": "Easy to assemble and sturdy, not space consuming, holds 20 pairs of shoes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 26, 2021",
                "reviewTitle": "ZERO STARS",
                "reviewText": "The worst product I’ve ever purchased! I bought this last August, and since then I have had to reassemble it at least a dozen times. It has zero support, so unless you’re using it for dollar store flip flops, it falls apart. For some reason the vertical supports are cheap plastic, and small pieces, instead of one solid piece. So it wobbles and bends until one of the plastic pieces comes loose and topples the whole thing. Zero stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Selene Osuna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 21, 2020",
                "reviewTitle": "Buen producto",
                "reviewText": "Me gustó, es fácil de montar, no ocupa mucho espacio y para el tamaño de mis zapatos esta perfecto. La resistencia es un poco dudosa, sin embargo se encuentra en perfectas condiciones después de instalarlo y acomodar todos los zapatos. Muy buen precio para el producto, recomendado.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 9, 2021",
                "reviewTitle": "Sturdy and more than enough space",
                "reviewText": "Good sturdy shoe rack with metal bars into plastic supports. Lots of space for shoes and even boots on top rack. Very pleased. Shoes tidy now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sofia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 13, 2019",
                "reviewTitle": "Its not stable",
                "reviewText": "Se cae de la nada no resiste peso",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}