{
    "remaining_requests": 30919,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/SONGMICS-Stackable-Organizers-Storage-Adjustable/dp/B09LS2G5GV",
    "body": {
        "name": "SONGMICS Shoe Rack, 8-Tier Shoe Organizer, Metal Shoe Storage for Garage, Entryway, Set of 2 4-Tier Stackable Shoe Shelf, with Adjustable Flat or Angled Shelves, Holds 32-40 Pairs, Black",
        "price": "$79.99",
        "originalPrice": "$85.99",
        "rawPrice": 79.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/SONGMICS-Stackable-Organizers-Storage-Adjustable/dp/B09LS2G5GV",
        "soldBy": {
            "sellerID": "A2G697YVFPFSPH",
            "name": "SONGMICS HOME US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2G697YVFPFSPH&asin=B09LS2G5GV&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BCFR3Q4D"
        ],
        "asinVariationValues": [
            {
                "asin": "B09LS2G5GV",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$79.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01w0EgxZ7qL._SS36_.jpg"
            },
            {
                "asin": "B07KCTRG5L",
                "variationName": "Color",
                "variationValue": "Bronze",
                "price": "$85.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/014iTEYaLIL._SS36_.jpg"
            },
            {
                "asin": "B07RM3YZYG",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "$79.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01T--uPDRSL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51kZVd7SDgL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51kWOPSIJPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416weZBYYmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vO3-HHODL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51oMvxae4RL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ls60 x-FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/91VvnUvnf7L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SONGMICS Store",
            "link": "https://www.amazon.com/stores/SONGMICS/page/B6760B53-1B7B-46AB-A053-158728E59153?ref_=ast_bln"
        },
        "brand": "SONGMICS",
        "merchantInfo": "Sold by SONGMICS HOME US and Fulfilled by Amazon.",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3387,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Monday, February 19. Order within 15 hrs 33 mins",
            "FREE delivery February 26 - 29",
            "Or fastest delivery February 25 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Metal Steel",
            "[Detachable & Stackable Shoe Rack] SONGMICS 8 tier tall shoe rack organizer can split into 2 complete 4-tier shoe racks for different spaces of the closet, bedroom, entryway and garage. Also, you can choose our same style 2 tier shoe rack or 5 tier shoe rack to stack vertically for a complete 10-tier shoe rack or 2 9-tier shoe rack to realize DIY personalized storage",
            "[Extra Large Capacity Shoe Rack] The size of the large shoe rack storage is 12.1'' x 36.4'' x 64.4'', and holds up to 40 pairs of women's shoes or 32 men's shoes. With 7.9'' between shelves of industrial shoe rack, high heels and high-top sneakers can find a perfect perch here on this shoe shelf, get rid of the cluttered shoe pile, let the home more clean and tidy",
            "[Adjustable Shelf] The inclination of our shoe organizer rack can be adjusted to flat or angle according to your usage habits; Each shelf has a baffle and dense mesh layer design to prevent high heels from falling for easier access to shoes. Metal shoe racks after stacking can disassemble one shelf to provide adequate storage space for taller boots",
            "[High-Quality Materials & Long Lifespan] The sturdy shoe rack is made of thickened metal frame and dense metal mesh shelves, this shoe organizer can hold up to 40 lb per shelf, ensuring your shoes have enough high stability for easy organization and storage. SONGMICS heavy duty shoe rack maintains the nice and versatile while enhancing the service life, great ideal for keeping your hallway, wardrobe, dormitory, patio, mudroom and studio away from mess",
            "[Easy to Assemble] Install your shoes rack in minutes! We are equipped with the corresponding installation instructions, labeled pieces, and come with adjustable feet to keep it stable even on uneven floors. Warm Tip: Our closet shoe organizer shelf has two anti-tip kits that will help you secure the corner shoe rack to the wall for safer use"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Storage & Organization",
                "link": "https://www.amazon.com/storage-organization/b?ie=UTF8&node=3610841"
            },
            {
                "name": "Clothing & Closet Storage",
                "link": "https://www.amazon.com/Clothing-Closet-Storage/b?ie=UTF8&node=2423187011"
            },
            {
                "name": "Shoe Organizers",
                "link": "https://www.amazon.com/Shoe-Organizers/b?ie=UTF8&node=695481011"
            },
            {
                "name": "Free Standing Shoe Racks",
                "link": "https://www.amazon.com/free-standing-shoe-racks/b?ie=UTF8&node=11601913011"
            }
        ],
        "productInformation": [
            {
                "name": "Mounting Type",
                "value": "‎Floor Mount"
            },
            {
                "name": "Room Type",
                "value": "Garage, Closet, Bedroom, Living Room, Hallway"
            },
            {
                "name": "Shelf Type",
                "value": "Adjustable Metal Mesh Shelves"
            },
            {
                "name": "Number of Shelves",
                "value": "8"
            },
            {
                "name": "Special Feature",
                "value": "Waterproof, Weather Resistant, Heavy Duty, Adjustable, Scratch Resistant"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Shoe"
            },
            {
                "name": "Installation Method",
                "value": "Freestanding"
            },
            {
                "name": "Material",
                "value": "Metal Steel"
            },
            {
                "name": "Product Care Instructions",
                "value": "Wipe with Dry Cloth"
            },
            {
                "name": "Furniture Finish",
                "value": "Metal Steel"
            },
            {
                "name": "Product Dimensions",
                "value": "12.1\"D x 36.4\"W x 64.4\"H"
            },
            {
                "name": "Size",
                "value": "12.1 x 36.4 x 64.4 Inches"
            },
            {
                "name": "Item Weight",
                "value": "22.7 Pounds"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 3,387 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,613 in Home & Kitchen (See Top 100 in Home & Kitchen) #82 in Free Standing Shoe Racks"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            },
            {
                "name": "Brand",
                "value": "SONGMICS"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Manufacturer",
                "value": "SONGMICS"
            },
            {
                "name": "Included Components",
                "value": "2 x 4-Tier Shoe Racks, 4 x Plastic Stackable Connectors, 2 x Anti-Tip Kit, 1 x Assembly Instructions"
            },
            {
                "name": "Model Name",
                "value": "ULMR08B"
            },
            {
                "name": "Product Name",
                "value": "storage shelf, shoe rack, shoe storage, shoe shelf, shoe organizer"
            },
            {
                "name": "Model Number",
                "value": "ULMR08B"
            },
            {
                "name": "Shape",
                "value": "Rectangular"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Assembly Required",
                "value": "Yes"
            },
            {
                "name": "Material Metal Steel",
                "value": "Mounting Type ‎Floor Mount"
            },
            {
                "name": "Shelf Type Adjustable Metal Mesh Shelves",
                "value": "Shape Rectangular"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Maximize Your Space: With this SONGMICS 8-tier shoe rack, you can maximize your space while reducing the shoe mess around the house. We want you to have more options, and that’s why you can decide whether this shoe stand is stacked in the closet or separated into two and in different rooms. Your Shoes Deserve It: Don’t let your shoes spend their days on cramped or flimsy racks that waver with every movement in the room. With 7.9” of height between shelves, you can fit even your boots. Each shelf will support up to 40 lb and fit 5 pairs of women’s shoes or 4 pairs of men’s shoes. Angled or Flat, It’s Your Choice: If you prefer to leave your shoes flat or have them at an angle, don’t fret—you can do one, the other, or both. We all have our own preferences—this one is up to you. Specifications: Color: BlackMaterial: SteelProduct Size: 12.1''D x 36.4''W x 64.4''H (30.7 x 92.5 x 163.6 cm)Product Weight: 22.7 lb (10.3 kg)Max. Load Capacity of Each Tier: 40 lb (18 kg) Package Contents: 2 x 4-Tier Shoe Racks4 x Plastic Stackable Connectors2 x Anti-Tip Kit1 x Assembly Instructions SONGMICS Notes: Please fix the product to the wall with the included anti-tipping kit for safety during use.If you don’t stack the shelves, please keep the connectors in an easy-to-remember location for future use.",
                "media_link": []
            },
            {
                "media_text": "Sturdy Shoe Rack -Bronze Expandable Shoe Rack Standing Shoe Rack -Black Adjustable Shoe Rack -Grey Closet Shoe Rack -Wood Printed & Black Narrow Shoe Rack -Bronze Tiers 12 2 4 6 4 8 Material Type Metal Steel (Wire Mesh) Metal Steel, Telescopic Pole Metal Steel (Wire Grid ) Metal Steel (Wire Mesh) Metal Steel & Non-Woven Fabric Metal Steel (Wire Grid ) Color Bronze/Black/Grey Bronze/Black Bronze/Black/Grey Bronze/Grey Ink Black, Dove Gray Bronze Dimension 12.1''D x 36.4''W x 86.6''H Longest: 9\"D x 32.7\"W x 16.5\"H 10.8\"D x 27\"W x 25.6\"H 12.1\"D x 29.1\"W x 49.4\"H 11\"D x 26.7\"W x 27.5\"H (28 x 68 x 70 cm) 12\"D x 17.6\"W x 50.6\"H Capacity (Adult Shoes) 48-60 Pairs 6-15 Pairs 12-16 Pairs 18-24 Pairs 12-16 Pairs 16-24 Pairs Function Separable, Adjustable, Stackable, Expandable, Removable, Slanted Adjustable, Expandable, Slanted Adjustable, Stackable, Expandable, Removable, Slanted Adjustable, Stackable, Expandable, Removable, Slanted Adjustable, Expandable, Removable Separable, Adjustable, Stackable, Expandable, Removable",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4bfa7152-1f73-4311-85d2-c7d2f0248749.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/027da17b-8216-45cc-a157-b6d1642ef1a8.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/242a168e-7d01-4481-a59a-b7902155528b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0728c50b-2506-44ae-a0ba-5e22eaca9bfc.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5f2ad40-2132-43a0-a9a1-625efb572bc4.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/02fdfcbf-f1bd-4d78-a49a-80992c1cec6c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5ba2fea9-fca3-4400-bce3-d4b27ffff233.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c2e7c54b-1a68-45c0-a954-535a2d4e60b4.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGCHK3ZPACRTHGAEIPYLE6LWO2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2D4I5NHHGLWJ4?ASIN=B09LS2G5GV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Great shoe rack",
                "reviewText": "Easy to instal, sturdy and fits full size men’s shoes comfortably",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAK6I4YVW4R63432ILBTE6BGRWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS8GCUEY35AST?ASIN=B09LS2G5GV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2020",
                "reviewTitle": "5.0 out of 5 stars A beacon of hope in an ongoing sea of despair.",
                "reviewText": "So, first, I purchased one of those hollow-metal-tubed-framed, canvas-shelved pieces of trash and the canvas shelves began tearing away from the frame almost immediately. They tore away from their frames as if the manufacturer had intentionally perforated them specifically to do this. After 1.5 years of careful handling, periodic, impromptu mending emergencies, and a quiet, simmering resentment building upon each glance afforded it, the only reasonable course of action was to fly into a frothing rage-tornado during which it was retired, bit by jagged bit, into the trash. Shoes tumbled to the floor and scattered like refugees fleeing a Kaiju.And there they remained.I have a shoe problem which I don’t feel is any of your business. But I have a lot of kicks and they needed a home. So, in the aftermath of the previous disaster, I bought a large, plastic utility shelf—TWO large plastic utility shelves— which turned out to be stupid. I have no idea how an item as simple as a shelf-unit can exude so much awkwardness. And that was all there was to that phase. It was a stupid idea that ended up being a stupid act carried out with the casual bravado of someone with nothing to lose. Which is not the case with me. I definitely have things to lose. I don’t have that much but I do have a shoe condition.With 30+ pairs of shoes languishing in a pile and serving as a perfect monument to my ineptitude and with nary a hint of imminent relief, I proceeded to embark on the quest of a lifetime (if we can agree that by “lifetime” I mean 11 days).So, the ratio of bs, scam, ads for those really cool-looking shoe boxes that have the drawers that slide out and make the front panels pop up to access your shoes and they’re really stackable and you can see your shoes in them because they’re clear and, oh, yeah, some of them light up is 1,000,000,000,000:0.Then I found these. I kind of just looked at them for a few days. I mean, I’d just been burned by two different and avoidable mistakes and I was feeling vulnerable but I did put them in my basket. I’d come back to them fairly regularly and couldn’t stop checking them out. They looked sleek, sturdy and able to accommodate a variety of different shoe styles. During this courting process, I’d toy around with taking a chance on one of those shady ads for the magic boxes I previously mentioned but I was merely delaying the inevitable. Finally, I just took the plunge and ordered these shelves.There’s been a lot of sh_tty things that have happened this year. This shelf set is not one of them. It is perfectly designed, with shelves that can be alternated between flat and angled. If you haven’t been on a seemingly endless search for shoe-racks for the last 7 years, you may not be aware that a lot of shoe-rack-manufacturers sell angled shoe racks. And you would probably also not be aware that every single stupid one of those angled racks is designed to allow any shoes placed on them to just slide right off and onto the floor. They’re like joke shoe racks you would buy for someone you passive-aggressively hate to induce a frustration heart attack. They’re the “dribble cups” of shoe racks. Someone, sometime in the past came up with the reasonable idea of angling shoe racks so that shoes could be easily seen at a glance. Unfortunately, whoever that individual was also lacked both the mental acuity to understand the most basic principles of physics and/or the verbal skills to convey the need in their design for something to “stop” the shoes from falling. Like, a “stopper” or something.In stark contrast is this shoe rack that has been designed by a manufacturer with top developer talent who have the education and experience required to know that when you point an object at the floor and then place it on a smooth slope at a certain angle, it will definitely slide off onto the floor— unless there is some kind of “stopper” at the end to stop it from doing so and this company spared no expense in this area. When angled downward, the shoes gently rest against an upward angled lip. It’s as if they felt the thuds of countless shoes hitting floors around the world and took it upon themselves to make this ongoing travesty right.With this design feature incorporated perfectly into its functionality, this shoe rack was already head and shoulders above anything else I’ve ever encountered. Now, put a pin in that element and remember it when I tell you that, in addition to being designed by (probably) retired NASA scientists, it was also so easy to assemble that I was tempted to disassemble it immediately upon completion and scatter its components around to recreate an environment and blood pressure level more in line with my past experiences. Because, isn't there a law that specifically states that shoe-rack-construction must involve at least 278 bellowed expletives, hate-tears and PTSD? I checked and not only is there no law specifically requiring violence during shoe-rack assembly, there are no laws involving shoe racks at all. In the case of these shelves everything went together not only correctly but easily— as if the manufacturer’s intention was to create something useful and intuitive rather than something that culminates in a welfare check from the police department. It even comes with a little “S”-shaped, allen-wrenchy tool (the only tool you need) which allows it to be deftly manipulated to quickly screw in the associated bolts— all of which are exactly the same! I didn’t even know that this level of simplicity was possible.If you need a shoe rack, do yourself a favor and pull the trigger on this set. If my shoe condition doesn’t improve, I may even need to pick up another set myself.100 Bazillion Stars.",
                "reviewVotes": "150 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JennJenn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRDFGAQTXTPX6JPS2YSF73AITAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XX47JNSKI29Y?ASIN=B09LS2G5GV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Super EASY to assemble!",
                "reviewText": "This thing is awesome! Worth the price. Sturdy and fits a lot.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Ts3MlWcdL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "PEGGY PETERS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKK4GVPROXTEZLNZU26LSZLIIZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQJSQVFXJKTMO?ASIN=B09LS2G5GV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars perfect size",
                "reviewText": "perfect size for compact spaces. easy to assemble. holds lots of shoes. strong and sturdy no wobble. looks like a shoe department in my closet.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFERQCSXWHOL4G4MUY5SYL47GEVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3MDBZ6SNINRNP?ASIN=B09LS2G5GV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Really good shoe rack",
                "reviewText": "Really well designed shoe rack. Quite sturdy. And holds many shoes. The shoe rack was also pack is really well. And installation was not very difficult. I would recommend getting a electrical drill and hex bits. I rarely write a review but this one I really thought deserved an excellent review. I really like the design, in that you can either have two small racks or stack them one on top of the other and have one tall shelf.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VV",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAQQWNDEQKZ5KEX4PCUPEQWDB7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N2DFI9KGBOEM?ASIN=B09LS2G5GV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2023",
                "reviewTitle": "4.0 out of 5 stars Nice and sturdy shoe rack",
                "reviewText": "The shoe rack fits our intended use. It's for shoes in the garage. It seems much more sturdy and reliable than other cheap plastic and aluminum shoe rack. Wishes the shoe rack is a little bit longer. Weare able to fit ~4 pairs of shoes per row but so far so good!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lawrence",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVXLPEHKREYUSTIS555TPYNQAEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REYSF7I1W9SES?ASIN=B09LS2G5GV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Great shoe rack",
                "reviewText": "This was easy to assemble and functions beautifully. I would recommend this product.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nona",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCJRXCLEKYGDKHHZDYHWXY3QDIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19DZAR1GX9YMZ?ASIN=B09LS2G5GV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Finally",
                "reviewText": "I should have searched for heavy duty to begin with. Spent so much money on those cheap shelves that don’t hold up or big enough only for baby shoes. These are great, spacious, enough room for heels, sturdy",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aida ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 8, 2023",
                "reviewTitle": "So worth every penny!",
                "reviewText": "Strong and solid! It was the easiest thing to assemble, and made my life easier does take up to much room. This is one of the best purchases I've ever made. I would definitely recommend and most definitely buy again if needed! Thank you",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 2, 2023",
                "reviewTitle": "Excelente zapatera",
                "reviewText": "Muy fácil de armar, amplia y bien diseñada",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roberto ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 20, 2023",
                "reviewTitle": "Excelente compra",
                "reviewText": "Tengo casi tres años con la zapatera y me ha sido de gran utilidad, ampliamente recomendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeortiz_xo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 29, 2023",
                "reviewTitle": "Sturdy",
                "reviewText": "Although pricey for its purpose, I'm satisfied with this purchase. The frame is sturdy and my teenage son was able to put it together, so it was easy to assemble.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Lim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 29, 2023",
                "reviewTitle": "Best shoe rack",
                "reviewText": "Easy to install and feels very solid. Wife has over 100 pairs of shoes and two of these nearly fit all of them. I wish there was a 10 tier option so I could fit mine on there too. Seems as though they only offer an 8 or 12 tier rack",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}