{
    "remaining_requests": 15134,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Inateck-Crossbody-Adjustable-Water-resistant-Multipurpose/dp/B0CPHS58TJ",
    "body": {
        "name": "Inateck Sling Bag, Stylish Crossbody Bag with Adjustable Shoulder Strap, Water-resistant Shoulder Bag for Men and Women Multipurpose Sling Backpack for Travel, Cycling, Work, Sport, Hiking, Gym, Black",
        "price": "$46.99",
        "originalPrice": "",
        "rawPrice": 46.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Inateck-Crossbody-Adjustable-Water-resistant-Multipurpose/dp/B0CPHS58TJ",
        "soldBy": {
            "sellerID": "A3C6FYH2UWE3LL",
            "name": "TNTonline",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3C6FYH2UWE3LL&asin=B0CPHS58TJ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "Apply 30% coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31p-zAFMT6L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41BmcTqqlEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4106v4WJkCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41nQuMN1ZaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Vn2vE0OnL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pJuXMY7GL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81hjjAWBiEL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b3235029-d0a4-4f49-b9b9-16f89a0a2356/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Inateck Store",
            "link": "https://www.amazon.com/stores/Inateck/page/0DCAA53C-DAB5-466B-AC17-7C1588B88280?ref_=ast_bln"
        },
        "brand": "Inateck",
        "merchantInfo": "TNTonline",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 32,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Saturday, February 17. Order within 4 hrs 39 mins",
            "FREE pickup Tuesday, February 20",
            "Or fastest pickup Saturday, February 17. Order within 4 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Care instructions Wipe with Wet Towel, Spot Clean Only",
            "Origin Imported",
            "Country of Origin China",
            "[Compact Yet Spacious]: Our crossbody bag for men and women measures 34 x 15 x 8 cm (13.8 x 5.9 x 3.1 inch) with 4L capacity. The front section of the main compartment features a zippered pocket and double-layered 2-grid pockets, while the rear section serves as an electronics storage compartment, easily accommodating items such as phones, Switch, or iPad Mini. The divider has four elastic bands for neatly organizing items like data cables.",
            "[Layered Structure&19 Zones]: This compact sling bag adopts a layered structure with 19 functional zones. Both the front and rear have concealed zippered pockets for important items. The front pocket includes small pockets and a webbing key hook. The rear pocket has three card slots for quick access of IDs, credit cards, and more. Additionally, there is an interlayer between the front and rear pockets for storing items like umbrellas and achieving dry and wet separation.",
            "[Water-Resistant and Lightweight]: This compact lightweight sling backpack has a net weight of 360g. The front panel is made of glossy material, while the rear is crafted with 900D polyester, making it water-resistant and wear-resistant. The main compartment and front and rear partitions all feature YKK zippers, ensuring durability and smooth opening and closing.",
            "[Multiple Wearing Options]: The shoulder strap of crossbody bag is equipped with a Duraflex quick-release buckle and a quick-adjustment pressure buckle, allowing you to freely adjust the shoulder strap length (29-48 inch) and easily find the suitable length（The length only includes buckle, not the chest bag）. This sling bag can be worn diagonally across the chest or over the shoulder or back as a crossbody backpack, adapting to different dressing styles and providing you with a personalized wearing experience.",
            "[Fashionable and Versatile]: This shoulder bag is designed in a cool black color with sleek lines. The smooth front cover looks very textured. It is an ideal companion for various occasions such as shopping, traveling, hiking, cycling, fishing, running, walking the dog, attending concerts, and beach outings. Moreover, our crossbody bag also an excellent gift choice for family and friends.",
            "[What You Get] : Black sling bag*1, Exquisite packaging box*1, worry-free 12-month warranty."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9479199011"
            },
            {
                "name": "Waist Packs",
                "link": "https://www.amazon.com/fashion-waste-packs-cross-body-bags/b/ref=dp_bc_aui_C_3?ie=UTF8&node=2477385011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 13.39 x 5.91 x 3.15 inches; 12.7 Ounces"
            },
            {
                "name": "Department ‏",
                "value": "‎ Unisex"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ November 29, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Inateck"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CPHS58TJ"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ China"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,830 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #64 in Fashion Waist Packs"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 32 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Compact EDC Sling Bag There is a horizontal semi-open wet and dry separation pocket in the middle, perfect for storing bottles and small folding umbrellas, and the sides can be tightened to prevent them from falling! Lightweight Sling Bag for Men Crossbody Bag Trendy for Women Fashion Everyday Carry Bag Casual Sling Backpack",
                "media_link": []
            },
            {
                "media_text": "Previous page Multiple compartments and a semi-open design can accommodate more items. Equipped with a Duraflex buckle that makes it easy to put on and take off. Pull the loop string on the adjustment buckle to quickly adjust the length of the shoulder strap. Inateck sling bag It is carefully packaged in a fancy-looking box, suitable for giving as a gift to your friends. Next page 1 Orderly Storage 2 Compact Yet Spacious 3 Duraflex Buckle 4 Quick-Adjust Buckle 5 Fancy-looking Box",
                "media_link": []
            },
            {
                "media_text": "Previous page Separate Umbrella/Water Bottle Compartment Perfect for storing bottles and umbrellas, the sides can be tightened to prevent them from falling! Electronics Storage Compartment For Phone, Switch, or iPad Mini(Fits 8.2 or 8.3-inch iPad Mini). Key Hook Quick access for keys, no need to rummage. Card Slots Easy access for credit cards, ID cards, etc. Carefully Designed-Inateck Inateck sling bag is carefully designed and crafted to make traveling easy. Next page 1 Umbrella Compartment 2 Storage Compartment 3 Key Hook 4 Anti-theft Card Slots 5 Carefully Designed",
                "media_link": []
            },
            {
                "media_text": "YKK Zipper The main compartment and front and rear partitions of the crossbody bag all feature YKK zippers, ensuring durability and smooth opening and closing.The YKK Zippers even have a nice custom look with orange straps to help you identify them quickly by touch. Duraflex Buckle Equipped with a Duraflex buckle that makes the crossbody bag easy to put on and take off, so you don't have to worry about messing up your hair or getting your hat caught when you put it on and take it off.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0d3ec74-be83-4ccf-878e-f8e41cd9cff6.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dfbb5c9a-ebd7-4c71-95ee-f20de9832640.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "Quick-Adjust Shoulder Buckle Pull the loop string on the adjustment buckle to quickly adjust the length of the shoulder strap. It can be easily operated with one hand and can be adjusted to the desired length. Shoulder strap(not include chest bag): longest: 122cm (48 inch); shortest after adjustment: 74cm (29 inch) Reflective Strip Design The front of crossbody bag is designed with reflective strips and is made of reflective material to ensure your safety when traveling at night. Inateck sling bag is suitable for anyone seeking durability, functionality, and style in their everyday carry.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aacf4709-f226-494e-bfd6-a38f9c4cf97d.__CR0,0,650,350_PT0_SX650_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3bc57d16-007c-473e-a4b2-f392e2ac8ab4.__CR0,0,650,350_PT0_SX650_V1___.jpg"
                ]
            },
            {
                "media_text": "Why choose Inateck Sling Bag? Inateck sling bag has been carefully designed with 19 functional partitions. It uses exquisite Duraflex quick-release buckles, quick-adjust buckles, YKK zippers, and umbrella compartments, as shown in the video, allowing you to travel with ease! How long is the shoulder strap of this crossbody bag? The length of the shoulder strap can be quickly adjusted, and the adjustable range is approximately 29-48inch (74-122cm). Please note that this length only includes the length of the webbing and does not include the length of the chest bag. How many compartments does this stylish crossbody bag have? This compact sling bag adopts a layered structure with 19 functional zones. The front has 3 partitions, including 1 independent keychain;the middle has 11 partitions; the back has 4 partitions; there is one umbrella compartment at the bottom. How much does this sling bag weight? What size water bottle does the bottom pocket fit? This compact sling backpack has a net weight of 360g. Lightweight and durable, you can travel easily. The independent pocket at the bottom is suitable for storing water bottles not exceeding 500ml. How is the material of this crossbody bag? This sling bag is equipped with YKK zippers and Duraflex quick-release buckles.The front panel is made of glossy material, while the rear is crafted with 900D polyester, making it water-resistant and wear-resistant.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b6776e1-4faf-46d1-8d27-f1cce2c5019e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/548b9c1e-b821-475d-a5ff-a5b12fd47007.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a614fca-cbcc-4619-bf4d-fc42903961c6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86d7ea80-a3c2-4c4e-8470-aaaa6a0445d8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9bbab06b-e045-46d7-8e2e-a3ddd4a5f522.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8480514c-f3f4-49f5-bf78-fd58d079abb9.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4b8adb1e-43bc-4674-a5a9-73b29eefc79c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/67daae60-6613-441c-8f1a-13f30ae55de7.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/884d320b-7676-41f6-bf30-f4a44947dd76.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e25027cc-f780-49c5-bbfa-a1432da06fe5.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0b575e09-84da-4ce4-b2c2-a1a220c79ce6.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ce77b01-fe7a-4783-99ef-6824a16a93ea.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39fde6a3-9f01-41ae-b5a9-f83ef8481b44.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/f2447cce-f8b4-421e-ad30-73b196b33492.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sc/e00fc971-6a51-4c08-895a-253f0bef6a4b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2dcbdf78-45ba-4d88-b727-82f4882113bc.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0d3ec74-be83-4ccf-878e-f8e41cd9cff6.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dfbb5c9a-ebd7-4c71-95ee-f20de9832640.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aacf4709-f226-494e-bfd6-a38f9c4cf97d.__CR0,0,650,350_PT0_SX650_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3bc57d16-007c-473e-a4b2-f392e2ac8ab4.__CR0,0,650,350_PT0_SX650_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GumbyGumby",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFAKOGTPYILBGAXMABLTZDT5JYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL8G2K5O5D0IK?ASIN=B0CPHS58TJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Stylish and Well-Made Bag With Excellent Strap and Interior Organization - A Great Value",
                "reviewText": "I don't review every product I purchase on Amazon or anywhere else, but I am very impressed with the Inateck sling bag for a variety of reasons. First, the bag is very well made - the outer fabric is truly water resistant while also being lightweight and strong. There are many thoughtful touches added to the bag that did not have to be included, such as ample dividers and sub-pockets in both the main pocket, the rear pocket, and the front pocket. There is a key lanyard attached to the front pocket that ends in a metal key hook. There is a padded electronics pocket in the main pocket that is large enough to hold my Kindle Oasis, as well as a Paperwhite. The main pocket contains several sub-dividers, including a large zippered pocket. The main pocket also includes several elastic bands into which small items may be secured. The rear pocket includes several credit card/business card slots. In all, Inateck did not skimp on including helpful details they could have omitted to save the company money in producing each bag.The strap on this bag is also unique at its price point - it contains a cam-operated buckle that allows you to quickly and easily adjust the length of the strap, unlike other sling bags that require more complex manipulation of buckles and straps to accomplish the same task. The strap and buckles are of excellent quality, also. The zippers on the bag are YKK zippers and are very smooth and easy to operate. The contrasting-color zipper pulls are a nice touch. And I appreciate the choice not to include magnetized parts in the buckles, unlike many other bags of a similar type. Those of us who need to carry magnetized key cards have to avoid bags with magnetized parts.This sling bag is simply a great value at its price point that incorporates good quality materials, excellent construction, and a thoughtful design with unique touches that I didn't find on any similarly-priced bag, or even on bags costing a lot more than this one. It was an outstanding value for me to be able to buy it at an excellent discount with the coupon offered by Inateck. I also give Inateck a lot of credit for another thoughtful addition to the purchase that I did not expect: the product came in box made for the bag by Inateck, and with a plastic wrapper around the bag to further protect the bag from damage before delivery to me. The product box is very unusual for a product sold on Amazon, and a good indication that Inateck values its customers. I highly recommend this bag, and I thank Inateck for providing a wonderful product at an affordable price.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/710oW0e2HJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pksxnYrfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ELACaster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFRAATXYT3PIOZMNMZA2IH7SWTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4O79EK1D552H?ASIN=B0CPHS58TJ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Really good value cross-body sling.",
                "reviewText": "I like this sling over other slings because it has a cam-lock adjustment for the strap making actually wearing and using it everyday easy. The umbrella/water bottle pocket is a little small for an umbrella but works great for slim water bottles. I wish the zips were more water resistant but outside of that the build quality is pretty good. If they made a Steamdeck-sized version of this bag I'd buy it in a heartbeat.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Timothy House",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJVHK2TZYAMJ5OMW3XJ74XBX76Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TL2TCARQUDVJ?ASIN=B0CPHS58TJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect everyday bag",
                "reviewText": "Looks good, has a lot of compartments, very satisfied.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Louis PhungLouis Phung",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJ6USSH4WX5WZP5D2ZRTDR5W2QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDUKCZBP6BRIM?ASIN=B0CPHS58TJ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Simply amazing sling bag!",
                "reviewText": "I really really love this bag. I owned many sling bag but I got to say this is my new favorite sling bag of them all now and I cannot leave the house without it.Pros:- It came very very well packaged, in a fancy-looking box with the company logo all over. I have bought lots of sling bags, even from a popular sling bag-making company, but only this one comes nicely packaged like that. The first impression won me immediately. I thought it's just knock off product from a Chinese company but turn out I was wrong. The high quality of the bag makes me even go back to Amazon to look up the brand. Turning out it is a legit company, founded in Germany and has a branch in Ontario, CA.- The bag design is very stylish and uses YKK zippers, which are super durable.- Very roomy. The main pocket has many small pockets and is divided nicely with padding and mesh elastic straps. I could easily fit a lot of my EDC in there, and when I need a particular item, I would be able to know where it is and get it quicker.- It has one medium-sized zippered pocket in the front for storing quick-access items. Inside, it also has a webbing key hook.- On the back, it has another concealed zippered pocket for important items like a wallet, phone, or passport. Inside, it also has cut-out slots for storing up to 3 credit cards or IDs.- The bag uses a Duraflex quick-release buckle, which is famous for making great buckles. The shoulder strap length is adjustable and has a locking mechanism to prevent the strap from slipping.- There's an extra space between the front and rear pocket where I keep my water bottle. The bag did get a little bit bulkier with the bottle stuffed inside but wearing it doesn't make me feel uncomfortable since the shoulder strap is very soft and decent size.Cons: none. However, just one thing that I don't really like about the glossy material on the front of the bag. It's water-resistant for sure, which is great, but I don't think that smooth surface is scratch-resistant. But who knows, I might be wrong again. I will post an update if any damage happens after using it for a while.Overall, this is a super good sling bag at an amazing price and can serve any purpose or carry anything you would ever need daily. I would strongly recommend it to everybody. Don't spend hundreds of dollars on a brand-name bag, buy this instead and you won't ever need any other bags anymore.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/616wmKwKXLL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61CON3bGbeL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61SZHWLoRcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61adHn8GPAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61iyFO1tp2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711lYxa3+jL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/718MCPz47aL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71NedpuiasL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eeTy7rOFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sea4HZ3WL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81UG-zCTEdL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}