{
    "remaining_requests": 15041,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Backpack-CrossBody-Capacity-External-Earphone/dp/B07C2YXC1F",
    "body": {
        "name": "Small Black Sling Crossbody Backpack Shoulder Bag for Men Women Vintage PU Leather Sling Backpack Cycling",
        "price": "$32.99$29.44$32.99",
        "originalPrice": "$32.99",
        "rawPrice": 32.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vintage-Leather-CrossBody-Capacity-Backpack/dp/B07CBYYHTL",
        "soldBy": {
            "sellerID": "A1YY5QHCA9F674",
            "name": "SDIYABOLO",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A1YY5QHCA9F674&asin=B07C2YXC1F&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07CBYYHTL"
        ],
        "asinVariationValues": [
            {
                "asin": "B07C2YXC1F",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$32.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51CSBzZBsxL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07C2S1SJR",
                "variationName": "Color",
                "variationValue": "Brown",
                "price": "$32.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51q5gt+o-pS._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07H92HBPN",
                "variationName": "Color",
                "variationValue": "Largeblack",
                "price": "$35.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41ClGGrvDaL._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07H92BNJY",
                "variationName": "Color",
                "variationValue": "Largeblue",
                "price": "$32.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51yDnGun7HS._SX38_SY50_CR,0,0,38,50_.jpg"
            },
            {
                "asin": "B07H93BWQW",
                "variationName": "Color",
                "variationValue": "Largebrown",
                "price": "$35.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51xoSQtNpyS._SX38_SY50_CR,0,0,38,50_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51CSBzZBsxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51NVm-x5FQL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/f1b9dd0f-2f60-58b4-972b-8e43b4ba0e88/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SDIYABOLO Store",
            "link": "https://www.amazon.com/stores/sdiyabolo/page/7F0041FA-1DC0-4DB8-A55A-65511D67F1DF?ref_=ast_bln"
        },
        "brand": "sdiyabolo",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 9930,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 4 hrs 27 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 4 hrs 27 mins",
            "FREE pickup Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 16. Order within 4 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Fabric type PU",
            "Care instructions Hand Wash Only",
            "Origin 进口",
            "Country of Origin China",
            "PREMIUM QUALITY LEATHER BAG: This bag is made of contemporary design with a feel Classic sling for modern people on the go. It is made with premium shining quality pu leather with waterproof ability. It is made to be durable over a long period of time. The material comes with ergonomic design to relieving back pressure",
            "PERFECT SIZE FOR YOUR GADGETS: Our leather sling bag is spacious and it is design to perfectly hold can hold a lot of items. . It is designed to take different gadget at a time. Be it laptop, Ipads, tablet, phone, books, credit cards, jotter and many more.",
            "WELL ORGANIZED COMPARTMENTS: Our bag is well compartmentalized. It has multiple pockets inside and outside with a zip around main compartment with a fully lined interior, one slip pocket, and one zippered pocket for organization. An exterior accessory pocket on the front offers added storage for items that you need to access quickly",
            "USB CHARGE AND EARPHONE JACK: This sling bag comes with a charging port you can connect your phone to and easily charge during outdoors and travel. Place your power bank inside the bag and connect your phone to the outer port. You can as well listen to your favorite music by connecting the headphone directly to your backpack",
            "EXTRA QUALITY AND COLOURFUL DESIGN: It is made in a way that mixes creativity with fashion. It is a pu leather bag with adequate durability. The sling is thick and cannot cut or break easily. The inner is well lined with soft material and breathable soft cushion belt"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Clothing, Shoes & Jewelry",
                "link": "https://www.amazon.com/amazon-fashion/b/ref=dp_bc_aui_C_1?ie=UTF8&node=7141123011"
            },
            {
                "name": "Luggage & Travel Gear",
                "link": "https://www.amazon.com/Luggage-Travel-Gear/b/ref=dp_bc_aui_C_2?ie=UTF8&node=9479199011"
            },
            {
                "name": "Backpacks",
                "link": "https://www.amazon.com/backpacks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=360832011"
            },
            {
                "name": "Casual Daypacks",
                "link": "https://www.amazon.com/Casual-Daypacks/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2404179011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8.66 x 5.11 x 12.5 inches"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ SB-122"
            },
            {
                "name": "Department ‏",
                "value": "‎ mens"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 10, 2018"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07CBYYHTL"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#29,934 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry) #58 in Casual Daypack Backpacks"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 9,930 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Protect your valuables when you're on the go with this sling bag. It can store ipad and pocket money, phone, key, etc. it easy to find what is needed and as well prevents the heavy weight of the bag from constantly pulling on the shoulder at different angles. Whether you’re on your daily commute or decompressing on a sandy shore somewhere, go along with your gadgets and fulfill your daily routines.",
                "media_link": []
            },
            {
                "media_text": "DIFFERENT COMPARTMENTS FOR ALL YOUR GADGETS Keep all of your important stuff within arm’s reach, with our sling bag you can comfortably have all of your belongings with you at once. Did you arrive earlier than your hotel or Airbnb check in? No problem, just take your bag around with you for the day—no need to stop by and drop your luggage off. Versatility at its finest.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/ZQqUFXxkQTed._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "CARRY YOUR GADGETS AROUND WITH EASY! NO MORE STRESS!!! Protect your valuables when you're on the go with this sling bag. It can store ipad and pocket money, phone, key, etc. it easy to find what is needed and as well prevents the heavy weight of the bag from constantly pulling on the shoulder at different angles. Whether you’re on your daily commute or decompressing on a sandy shore somewhere, go along with your gadgets and fulfill your daily routines.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/rUy4FELlSgql._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "CHARGE YOUR PHONE ON THE GO! AND LISTEN TO YOUR FAVOURITE MUSIC This sling bag comes with a charging port you can connect your phone to and easily charge during outdoors and travel. Place your power bank inside the bag and connect your phone to the outer port. You can as well listen to your lovely music by connecting the headphone directly to your backpack",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/lWxoRMemQImU._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "LONG STRAP FOR EASY CARRIAGE This bag is detailed with an adjustable strap that can be carried over the shoulder or slung across the body, it includes two large pockets underneath the flap, a rear zipper pocket for added storage, and a top grab handle for easy lifting. Carrying your essentials for the daily commute or occasional business travel inside this rich leather brief bag is your best bet",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/Xwp1KsHiQhyy._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "FEATURES 100% Brand new comfortable feel!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/61rkA4GkQp2Q._UX300_TTW__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/BizyM1SBTLCD._UX180_TTW__.JPG",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/ZQqUFXxkQTed._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/rUy4FELlSgql._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/lWxoRMemQImU._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/Xwp1KsHiQhyy._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A1YY5QHCA9F674/B07CBYYHTL/61rkA4GkQp2Q._UX300_TTW__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "EOLS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7FZZ6FJI3EVGL7HZP36WZS2Z4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4IWCGRAJULRK?ASIN=B07C2YXC1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2018",
                "reviewTitle": "5.0 out of 5 stars Sturdy, Stylish, & Comfy. Great Unisex & Ambidextrous Bag.",
                "reviewText": "I bought the brown backpack (the regular, not the large one). It's lighter colored than it appears in the product's photographs, but that's fine. It may be due to how monitors display colors differently, so keep that in mind while looking at the pictures.This TL;DR review will be broken into sections: A.) Comfort / carry for men and women, B.) Adjustable ability of the straps / how it's good for both left- and right-handed individuals, C.) Security / anti-theft potential, D.) Water / rain / snow resistance, E.) Internal storage capability, F.) My 1 issue with the backpack, G.) The product's bonus gift.A.) - I hate purses, so I wanted to find a small and simple backpack as a replacement. This bag is roughly the same size as my purse, but it holds more, it's much more organized with pockets, and it's easy to carry due to its straps. It doesn't cause me any back or shoulder pain to wear or carry, and (for the women, or endowed men, who might be interested) the cross-strap is padded so it doesn't hurt / chafe / cause soreness where it presses against the breast.B.) - The straps can be adjusted to fit bigger / stockier bodies, and shortened to fit smaller frames. I'm built like a noodle so I usually have a hard time finding straps that will shorten enough for backpacks to fit without sliding / slipping around or hanging loosely, but this worked wonderfully. Depending on the material of the shirt / jacket being worn underneath it can still slide a bit, but not enough to be annoying. Its straps' design makes it easy to maneuver too, so you can slide it around from your back to your side to open it up without having to completely remove the bag to get into it. There are two rings at the bottom on the bag on either side that you can clip the hook onto, making it easy to put it on either shoulder to carry or reach into -- so it's good for both left-handed and right-handed people.C.) - Except for the bottom pouch on the front which has only 1 zipper puller (and thus unable to easily lock), this backpack can be easily made theft-proof. Each zipper has two pullers, and each puller has 2 holes which have enough room to slip a thin [luggage] cable-lock through. So it's easy to lock the two zippers together, and pickpockets can't easily / stealthily open it. And unlike with purses, I don't have to worry about someone snatching my backpack and running off with it either because of how the cross-strap clips on -- making it secure to my body. This doesn't mean it will prevent ALL thefts, but it will deter minor thieves who want quick and easy targets.D.) - While I don't recommend dunking the backpack into water, hurling it into snowbanks, or letting it sit exposed in storms (remember that there are electrical components embedded in the bag!), it's stood up pretty well to precipitation so far. Depending on which way wind or snow is blowing, some could enter the little hole in the top pouch -- but I'm not too concerned about that. If I had electronics in that top pouch while it was heavily snowing / raining, I'd probably just shove a little wad of fabric into the hole to keep wetness out until I was out of the weather.E.) - Y'know the stereotype about women's purses being black holes, carrying an impossible amount of random items? My purse was like that, and this backpack (despite being the same size as the purse) holds MORE. And it has POCKETS! Not an insane amount of pockets (like pockets within pockets like matryoshka dolls), but enough to keep things organized. I can carry my tablet, cell phone, umbrella, lunch, tissues, pills, sanitizer, power bank, books (not textbooks!), cables, writing utensils, lotions, eating utensils, water bottle, earphones, and...well, those are all that I have in it right now but there's still room for more stuff in it. Despite the weight of it all, it hasn't been straining on the straps.F.) - Overall I think this bag is fantastic. The only thing I dislike about it is that the top clip connecting the front of the bag to the shoulder-strap is loose, so every time I tighten it, it just slides like butter to being loose again. That's not a huge issue, as it doesn't prove a hassle -- I just like keeping my backpacks as close to my body as possible so as not to invade other people's spaces, and that loose clip / strap means the top of the bag kind of flops around a bit. When I'm not being lazy I'll probably just sew the clip's strap into place so it doesn't keep sliding loose.G.) The backpack came with a gift: a little leather wallet! It only holds cards, but that's fine. I'd been debating getting something similar to replace my bulky wallet, but now I don't have to because of this present. It's well-made, and even with cards in it, it fits well in my jean's pocket.",
                "reviewVotes": "97 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRABYMTNYGHC334AOKI2RNIN4SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C8EC3I3Z1ZPJ?ASIN=B07C2YXC1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Still going strong!",
                "reviewText": "I have had this bag from about 2019 and wasn't using it for awhile due to the pandemic. When the pandemic passed and I started using the bag again, I realized that there was no crack at all. The bag still looks good as new! It's also very comfortable. I even get compliments.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter L. Tracey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFW4PU33IZSXTZBSFWK36KSC6NTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MB7Z4I529624?ASIN=B07C2YXC1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice-Looking Backpack That Travels Well",
                "reviewText": "This backpack lives up to its positive reviews. In fact, I had to buy a second one. A friend liked the first one so much, I ended up giving it to him as a gift. I would definitely recommend the large size, because it allows for more storage but is still not bulky.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracy K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WHLNZFRJNCTZRWZ3M36C5IC2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAUPPQYMDA0M2?ASIN=B07C2YXC1F",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Looks good and feels good",
                "reviewText": "Love the color and all the pockets. Comfortable and easy to adjust. No issues with quality after months of use. Just with the small and large pocket on the front were swapped. If you fill the large pocket with larger items, it tips over easily, but not enough to deduct a star for.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vaporwave vixen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2O7L6UZB2UWHRWPGUQU5TCFAZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BHIPK1ZJTBX9?ASIN=B07C2YXC1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Awesome",
                "reviewText": "This is my new everyday bag! Stylish, durable AND, comfortable to wear. Great product over all.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Keel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB2EWFYTZ4NPVXOQ67BKAOMOTFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCR3G2MKMLZ57?ASIN=B07C2YXC1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Tough & convenient",
                "reviewText": "This little bag is very convenient and is one tough bag.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "osvaldoosvaldo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZMVQBWRDHVBHAR3MR6GMTY2SHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2M2XZSJJ4YVHD?ASIN=B07C2YXC1F",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 15, 2022",
                "reviewTitle": "3.0 out of 5 stars Looks good, but...",
                "reviewText": "The media could not be loaded. I just recieved this bag, so my first impression is that it looks very good. Size is pretty decent, I'm 6\"2 so I think os good enough. A fair amount of pockets to put your stuff away. 2 outside pockets, one on top and one on the bottom. Top one is the biggest of the two. Inside it has 2 small sleeves and a small pocket. A bigger sleave for a small laptop, I put my 10.1 kindle fire HD, fits perfect and it comes with a velcro tab. The charging cable wasn't properly installed, but it wasn't difficult to installed it and it was working.On the cons, I think isn't big enough on the inside, despite the fact that is a great size, not much room on the inside, it is very narrow. Material for the bag looks flimsy and not great, I don't think the bag will stand every day use. Stitches arroumd the zippers looked glued not actually stitched. The inside lining looks weak and in my opinion is going to be the first thing that breaks.I'm going on a trip next week and I will update this review.UPDATE: SEPTEMBER 27Went to New York from Thursday to Monday, dragged this bag to Manhattan and I got to say it didn't let me down. Felt strong and took heavy use like a champ. But still not enough space in the main compartment, basically holds a Kindle fire 10 HD and the New York times Sunday edition. Otherwise looks strong and good.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712d49WpaPL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Kq-gbE8dL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71MUNf9RmTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nqKMwJ+fL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vKLIsc8hL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81joBC9FxBL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/65d0d548-3651-425c-83b6-5a8ab219c8f0/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Rodney Z",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG47CIFP7NEG3K7K25XQZXDHMZOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUN7GVCCLMWFK?ASIN=B07C2YXC1F",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Love it!",
                "reviewText": "Purchased this bag for my trip to explore Europe and didn't want to carry a large backpack everywhere. This is perfect to hold a few essentials, water or drink, pens, paper, and other things that would otherwise clutter your pockets.Now that I am home, I take it everywhere with me. It's my murse. Lol",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alejandro Pozos Hernández",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 13, 2023",
                "reviewTitle": "Es una mochila amplia con buena capacidad",
                "reviewText": "Es una mochila bastante amplia por dentro, fácilmente puede llevar una laptop y varias cosas más, mi duda está en la calidad de los materiales no se ven muy resistentes pero habrá que darles el beneficio de la duda",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JESUS RAUL",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 17, 2023",
                "reviewTitle": "Buen y util producto",
                "reviewText": "la calidad y su dimensionamiento en concordancia para el uso que le doy; práctico y sin problemas.. grc.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauricio Garduño Perez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 11, 2023",
                "reviewTitle": "Bastante cómoda me permite llevar lo que necesito cuando salgo",
                "reviewText": "Muy práctica y amplio diseño",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Héctor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 19, 2022",
                "reviewTitle": "Muy buen producto....!!!!!",
                "reviewText": "El producto es de muy buena calidad, la echura, costuras y materiales son muy buenos. Cabe mencionar que estamos comprando una mochila sintética.El diseño y funcionalidad es muy buena. Le cabe todo lo que necesito traer cuando estoy de vacaciones...!!!Altamente recomendable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Noé Arturo Sanchez García ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 23, 2023",
                "reviewTitle": "Excelente producto",
                "reviewText": "Excelente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}