{
    "remaining_requests": 19799,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Organyc-Organic-Tampons-Applicator-Sensitive/dp/B004DGFFD4",
    "body": {
        "name": "Organyc 100% Certified Organic Cotton Tampons - Cardboard Applicator, Free from Chlorine, Perfumes, Rayon, and Chemicals - Super, 14 Count",
        "price": "$7.72$7.72 ($0.55$0.55 / Count) $6.91$6.91 ($0.49$0.49 / Count)",
        "originalPrice": "$8.55",
        "rawPrice": 7.72,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Organyc-Organic-Tampons-Applicator-Sensitive/dp/B004DGFFD4",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09BQQPY7J"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Regular",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41KHx-rKR3L._SS36_.jpg"
            },
            {
                "asin": "B004DGFFD4",
                "variationName": "Color",
                "variationValue": "Super",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41FXyVOZxhL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41xhLLIfaRL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41N20CvCMGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QpBYWUHaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41q2A7BX5TL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DvMUDj7cS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KqSdQENoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61h5-LzilkL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5c92898e-41c8-4fde-9983-13ea6c940581/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b4d7f8c-b5a3-42c5-b7fb-09d35287d669/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/71hiLtf7PpL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/71hiLtf7PpL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Organyc Store",
            "link": "https://www.amazon.com/stores/Organyc/page/88A075C0-296F-4D46-A7C7-F676E0B5A2F1?ref_=ast_bln"
        },
        "brand": "Organyc",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1663,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 17 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "100% CERTIFIED ORGANIC COTTON - Organyc tampons are free from synthetic materials and are made with only organic cotton to give you unsurpassed absorbency and leak protection Soft and gentle organic cotton is pure, to respect you and your body",
            "HYPOALLERGENIC - Organyc cotton tampons do not contain chlorine, rayon, perfume, dyes, colors or chemicals of any kind. Organyc tampons are proven to be gentle on your sensitive skin.",
            "ULTRA ABSORBENT - Textured for added absorbency and fiber strength, Organyc cotton tampons are soft but strong and have been tested and shown to absorb just as well as mainstream brands. Organyc tampons offer complete protection and ideal for heavy flow days.",
            "CARDBOARD APPLICATOR - Cardboard applicators are better for the environment and don’t take years to biodegrade. Less plastic helps protect the planet!",
            "RESPECT SENSITIVE SKIN – Mainstream tampons can contain many additives and dyes and can cause rashes and irritation. You can rest easy with organic cotton tampons as they are completely hypoallergenic."
        ],
        "description": "CELEBRATE THE SKIN YOU’RE IN - Protect the skin you’re in. Conventional tampons can contain many fibers outside of cotton, such as rayon or other synthetic fibers. These fibers can cause irritation, discomfort and rashes. Organyc tampons are made with 100% certified organic cotton inside and out, the cotton is naturally breathable and hypoallergenic.SAVE THE DRAMA - Periods don’t have to be so painful. You can make your time of the month more comfortable by using natural, organic tampons. Organyc is the perfect fit if you suffer from sensitive-skin issues or don’t want risk irritation. These tampons are free of any chlorine bleach, latex, parabens, perfumes, plastics or, man-made materialsSAVE THE PLANET - Chemically treated cotton can lead to irritation and discomfort in your most sensitive area. With organic-cotton tampons, the only thing you’re getting is cotton. No chemicals, no fragrances or dyes. Organic-cotton tampons are free from anything synthetic and are sensitive to your sensitive skin. Confidence – go about your day with no worries.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3760941"
            },
            {
                "name": "Feminine Care",
                "link": "https://www.amazon.com/Feminine-Care/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3779501"
            },
            {
                "name": "Tampons",
                "link": "https://www.amazon.com/Tampons/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3779601"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ B003ART1K0"
            },
            {
                "name": "Material Feature ‏",
                "value": "‎ Biodegradable Warning"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 28, 2009"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Corman U.S.A."
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B004DGFFD4"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Spain"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#20,176 in Health & Household (See Top 100 in Health & Household) #56 in Tampons #4,226 in Diet & Sports Nutrition"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,663 ratings"
            },
            {
                "name": "Brand",
                "value": "Organyc"
            },
            {
                "name": "Material",
                "value": "Cotton"
            },
            {
                "name": "Material Feature",
                "value": "Compostable, Biodegradable"
            },
            {
                "name": "Unit Count",
                "value": "14 Count"
            },
            {
                "name": "Model Name",
                "value": "Organic Cotton"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Organyc: Complete Protection, No Compromises. 100% Certified Organic Cotton Organyc brand tampons are made with 100% organic cotton inside and out, to give you unsurpassed absorbency and leak protection. Soft and gentle organic cotton is pure, to respect you and your body. Now you don’t have to settle for feminine products that don’t give you the complete protection you need and deserve. Organyc uses patented technology to create certified organic cotton pads, panty liners and tampons that naturally absorb as well as synthetic materials. (patent #s 0001392179, 8946502, 0001398844, 9398983, 0001423392). With Organyc, you can choose the brand that offers complete protection with no compromises on purity or quality. Organyc Cotton Tampons with a Simple, Comfortable Applicator These tampons are breathable and hypoallergenic, with no chlorine bleach, latex, parabens, perfumes, SAP, plastics or man-made materials. Our organic cotton tampons are made for regular use, to give you the confidence and protection you need to go about your day. Organyc brand tampons have a cardboard applicator with soft, rounded edges for superior comfort. Pure Organyc is Your Answer to Reactions from Ordinary Non-Cotton Products Organyc brand tampons are made with 100% organic cotton and are skin pH balanced for complete comfort. Other feminine care products can have bleach and other chemicals that can be harsh on skin. Our 100% cotton is pure, soft, and absorbent, the way nature made it. Organyc respects you and what your body needs. 100% organic cotton inside & out Unsurpassed absorbency Soft and gentle against your skin pH balanced for sensitive skin with no chlorine bleach, latex, parabens, SAP, or man-made materials",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/caaba216-6167-4513-b559-4a5e9faec710._SL300__.jpg"
                ]
            },
            {
                "media_text": "Certified Organic Cotton for You and the Environment Our organic cotton is grown using methods and materials with the purpose of reducing the impact on the environment. Organyc proudly displays the 100% cotton seal— in fact, even our packaging is made from recycled material. Respect for the healthy lifestyle you want to lead and respect for our environment is something we take seriously. There is no organic standard for feminine care products, but our organic cotton products have been absorbed into the organic textile category. Our 100% organic cotton is certified by Global Organic Textile Standards, the leading organization for organic textiles (GOTS 2007-005 Ed.03C/Rev.00, Version 5.0, 01.03.2019).",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/07a0a409-58ac-46a5-924a-02a290c217e4._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Organyc Brand Certified Organic Cotton Products of All Kinds Organyc is proud to offer a complete range of 100% certified organic products for a range of needs from cotton rounds, to feminine hygiene, to beauty care. In everything we do, we aim to respect you and your body. · Organyc brand tampons for complete protection · Organic cotton tampons with unsurpassed absorbency · pH balanced for sensitive skin · With cardboard applicator for regular daily use · Made with no chlorine bleach, no latex, no parabens, no perfumes, no SAP, and no plastics or man-made materials · 100% certified cotton certified by Global Organic Textile Standards (GOTS 2007-005 Ed.03C/Rev.00, Version 5.0, 01.03.2019) · For women with sensitive skin or reactions to traditional non-cotton feminine care products · Organyc hygiene products are tested and shown to absorb just as well as the traditional brands",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/4867d377-cfb2-4a12-905a-85e3af989aca._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/caaba216-6167-4513-b559-4a5e9faec710._SL300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/07a0a409-58ac-46a5-924a-02a290c217e4._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4867d377-cfb2-4a12-905a-85e3af989aca._CR0,0,300,300_PT0_SX300__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/07855f6e-be02-4249-9f34-0ea1a339ab1c.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sarah Elizabeth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFISDVFW4GXFSI4I7QNAETTSOS6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MXEE37KUQN3L?ASIN=B004DGFFD4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Love having an highly-absorbent, eco-friendly option.",
                "reviewText": "It’s virtually impossible to find super-plus organic tampons locally, especially with cardboard/biodegradable applicators. Please continue to make these available!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GG8",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJMAAP3NCZ5MX5FP7VINWXEPTIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DWM0QMJOK230?ASIN=B004DGFFD4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars I’m in love.",
                "reviewText": "These tampons are great. First of all, I love that I finally don’t need to feel immense guilt throwing one time use plastic applicators into trash, such a stupid at to trash the planet. Paper applicators work just fine. AND: I don’t know what it is about the weave of these tampons, but they are very smooth on the outside. I don’t see any cotton hairs sticking out and I don’t experience this awful friction and dryness like I would with other ones. They slide in and out easily and don’t leave my vagina feeling like I got blisters. Best tampons ever, honestly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Honest Reviewer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH6WQIJXYBCAGAHFNI5Z3VBTW4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZSVY1F0VOI1?ASIN=B004DGFFD4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2016",
                "reviewTitle": "5.0 out of 5 stars I wish I had discovered these YEARS ago!",
                "reviewText": "I wanted to use these for a few menstrual cycles before I wrote my review so I could really give them a good test and using more than just one box for comparison. I had read the reviews about the punch hole in the cardboard applicators being a problem and the tubes being hard to push up once inserted. I am in my late 30's and have used Tampax brand tampons with the cardboard applicator exclusively since I was 16.First, the cardboard tubes are thicker than the Tampax ones which means you can really grip them tightly and not worry about crushing anything. There is, indeed, a punch hole in each tube that goes through both cardboard tubes (the outer one and the inner one that pushes the actual tampon out of the applicator) BUT I listened to a previous reviewer and I pushed the tampon out just enough to get beyond the hole but NOT enough to where the tampon is coming out over the cardboard that opens up and out around the top of the tampon. The top of the cardboard applicator has, for lack of a better description, petals like a flower that come up and over the top of the tampon. If you push the applicator up just a little bit to allow that punch hole to be gotten past the petals do not open up. I have not had any issues with inserting these tampons, the applicator getting stuck, or them hurting.I have noticed a DRASTIC decrease in my cramps since changing to these tampons. I love the peace of mind knowing that these are organic and my body is no longer getting the toxins put it in from the Tampax tampons. How I wish I would have discovered these YEARS ago!I flush the entire tampon, applicator, and wrapper and have had no issues with that.I have not had any leakage issues and the tampons are as easy to remove as the Tampax ones.I highly recommend these tampons to anyone. It is well worth the price and once you realize you can really grab on to the applicator and you get past that little punch in the cardboard you are good to go.",
                "reviewVotes": "45 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miss Z",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFWBBCGQQHSLW76CZHMQTBOGM2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V7TFL9N4DR5A?ASIN=B004DGFFD4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2023",
                "reviewTitle": "4.0 out of 5 stars Eco Friendly",
                "reviewText": "I love that is all natural. But please fix the applicator. Mines do not work. I have to push in manually without it. It feels a lil uncomfortable. Once is in,it is not noticeable and comfy. Only thing is the applicator.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGG2N6ZMIAGQD7EOGDNCJZU2OUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YTR7YVR3UQR3?ASIN=B004DGFFD4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Satisfied",
                "reviewText": "I bought it to remain as natural as possible. It serves its purpose. Only thing is that the applicator doesn’t glide. You have to push it out a bit for easy application.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caitlin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO3QWG3FZISWJOOMOUBMNIHHGNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R343DTHDII5EIX?ASIN=B004DGFFD4",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2023",
                "reviewTitle": "3.0 out of 5 stars Applicator problem",
                "reviewText": "Nice idea for quality and being non-toxic, however the applicator does not push together easily for insertion. The nature ones from Whole Foods work a lot better. I had to gently turn this during insertion in order for the applicator to work.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNSZLD4JS322RHQ63HG47652KYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EXY6UFHS1M4E?ASIN=B004DGFFD4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "5.0 out of 5 stars The best",
                "reviewText": "These are the best feminine product ever they are organic nontoxic, unbleached, as well as no plastic. I will only use these from now on!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ermolko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2V52DZTDESKV32TPKAE6VIB6MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI5NIFDWCDL1W?ASIN=B004DGFFD4",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 25, 2022",
                "reviewTitle": "1.0 out of 5 stars Doesn’t work",
                "reviewText": "The ad claims this product is super absorbent, protects from leaks, the applicator Is comfortable, the tampon is soft on the skin, and it’s organic. There’s so much wrong.The product is not absorbent. I got the super plus and after an hour of use I start leaking onto the pad. It doesn’t even expand much, just sort of opens up where the material was pressed together, the overall thickness doesn’t increase. I tried using two at a time, they were enough for an hour and a half.The applicator is rough where it should be smooth (the tip) and smooth and sleek where it is supposed to be rough (the holding point and the pusher). The tip is scratching my skin, and when I try to push the tampon in, the applicator is too slippery to hold it even with dry hands. The tampon is tight inside the applicator and only starts moving after a significant pressure is applied at which point the applicator starts slipping through fingers.I gave up on the applicator after several attempts and tried to insert the tampon without it, it is super scratchy and not soft at all.I hope that it is at least truly organic and will decompose in the landfill quickly, since that’s where the whole 6 pack is going. I absolutely regret buying this, I wish I could return the unopened packs.Btw I also got their daily pads, they are equally ridiculous. The absorption is poor, the top layer gets detached from the rest of the pad once wet, and also it comes with so much packaging it defies the purpose of buying Earth safe products: the pads are on paper liners stuck to plastic individual wrappers inside a plastic bag inside a box. Quite the trashy onion this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam MacLean",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 17, 2023",
                "reviewTitle": "Awesome!!!!",
                "reviewText": "I'm a guy so I haven't used any. I just like to have some in the house and the first aid kit. I bought these because organic cotton and the cardboard applicator. (I cleaned a beach one time, and it was littered with plastic applicators.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 19, 2021",
                "reviewTitle": "These are great",
                "reviewText": "I'm not really sure what people expect. The complaints about the cardboad applicator getting stuck...that's kind of dumb. You can't have it all. It's already pure Cotten and recyclable. Also push it up a bit then insert and your problem is solved. People complain about every single thing no matter much it's already what they're asking for lol. Get over yourselves. Thank you for creating a healthy product that is made with paper. It's great",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melanie Scheer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on December 7, 2022",
                "reviewTitle": "Überzeugt nicht",
                "reviewText": "Die Applikatoren aus Pappe sind zwar umweltschonend, erweisen sich in der Handhabung aber als sehr unpraktisch. Kaufe ich nicht noch einmal",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ulrike Richter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 8, 2022",
                "reviewTitle": "It checks all the boxes!",
                "reviewText": "Finally I find a tampon made of 100% organic cotton and without chemicals added, with a cardboard applicator and a paper wrapping!! Everything compostable :)The absorption is fantastic and they are comfy and very quick to insert. For those reviews that say the applicator is difficult, use two hands: hold in place by the rings with one hand and push the other end gently with the other hand. It’s very easy and quick. Will buy more! THANK U!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bérénice Pelletier",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on May 6, 2020",
                "reviewTitle": "Achat conforme. Bon produit.",
                "reviewText": "Achat conforme. Bon produit. Efficace.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$8.00",
                "sellerName": "Bentlee Brands",
                "sellerRating": "3.5"
            },
            {
                "price": "$8.79",
                "sellerName": "Organyc Feminine Care",
                "sellerRating": "5"
            },
            {
                "price": "$9.71",
                "sellerName": "SellLogic",
                "sellerRating": "4.5"
            }
        ]
    }
}