{
    "remaining_requests": 19753,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Menstrual-Disposable-Beginner-Friendly-Alternative-Capacity/dp/B07QHS3PL8",
    "body": {
        "name": "Flex Menstrual Discs | Disposable Period Discs | Reduce Cramps & Dryness | Beginner-Friendly Tampon Alternative | Capacity of 5 Super Tampons | Made in Canada | 12 Count",
        "price": "$14.84$14.84 ($1.24$1.24 / Count) $14.02$14.02 ($1.17$1.17 / Count)",
        "originalPrice": "$20.00",
        "rawPrice": 14.84,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Menstrual-Disposable-Beginner-Friendly-Alternative-Capacity/dp/B07QHS3PL8",
        "soldBy": {
            "sellerID": "A21Q8I43Q83NOW",
            "name": "The Flex Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A21Q8I43Q83NOW&asin=B07QHS3PL8&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B6GPQ5KS"
        ],
        "asinVariationValues": [
            {
                "asin": "B0B24FTGKJ",
                "variationName": "Size",
                "variationValue": "1 Count (Pack of 36)",
                "price": "$44.49",
                "variationImageURL": ""
            },
            {
                "asin": "B07QHS3PL8",
                "variationName": "Size",
                "variationValue": "12 Count (Pack of 1)",
                "price": "$16.49",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 20% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/412YFw-kO2L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41nT4OtWvyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31vgQydtfyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41SdvGedYxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41x 1zUw4VL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/410 VuoukCL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the FLEX Store",
            "link": "https://www.amazon.com/stores/Flex/page/9E0052E8-166F-4AFB-A543-A922113FB291?ref_=ast_bln"
        },
        "brand": "Flex",
        "merchantInfo": "The Flex Company",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 14625,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, March 1 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 15 hrs 25 mins",
            "FREE delivery Friday, March 1 on orders shipped by Amazon over $35",
            "FREE delivery Friday, March 1 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 15 hrs 25 mins",
            "FREE delivery Friday, March 1 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HAVE THE MOST COMFORTABLE PERIOD OF YOUR LIFE. Over 64% of surveyed users reported fewer period cramps when using Flex Disc compared to their previous product; 80% reported less dryness and irritation. When inserted correctly, you can’t even feel it.",
            "ENJOY UP TO 12 HOURS OF LEAK PROTECTION. Unlike tampons, Flex Discs provide all-day wear and have not been linked with TSS. Forget running to the bathroom every few hours to change your tampon or pad. Flex Disc holds as much as 5+ super tampons.",
            "BODY-SAFE. Flex Disc is made in Canada with 100% medical-grade polymers that won’t disrupt your vaginal flora. All Flex products are FDA-registered, hypoallergenic, and not made with BPA, phthalates, or natural rubber latex.",
            "EASY TO USE. Flex Disc is beginner-friendly and designed to make insertion, placement, and removal a breeze. The firm rim pinches in half to about the same size as a tampon. To insert, just angle the pinched disc down and back as far as it will go, then tuck the front rim up behind your pubic bone.",
            "DESIGNED FOR AN ACTIVE LIFESTYLE. Experience period freedom. Flex Disc fits into your active lifestyle so you can swim, sleep, squat, summit, and do everything you love to do when you’re not on your period. The disc is great for all flows and designed to fit most bodies.",
            "PERIOD FREEDOM. Tampons are cancelled. Flex Disc is a menstrual disc that collects your period blood (rather than absorbing it) and moves with your body during any activity."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3760941"
            },
            {
                "name": "Feminine Care",
                "link": "https://www.amazon.com/Feminine-Care/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3779501"
            },
            {
                "name": "Menstrual Cups",
                "link": "https://www.amazon.com/Menstrual-Cups/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3779511"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 5.9 x 3.74 x 3.15 inches; 3.84 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ BD12757"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ April 8, 2019"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ The Flex Company"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07QHS3PL8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,931 in Health & Household (See Top 100 in Health & Household) #2 in Menstrual Cups"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 14,625 ratings"
            },
            {
                "name": "Size",
                "value": "12 Count (Pack of 1)"
            },
            {
                "name": "Brand",
                "value": "FLEX"
            },
            {
                "name": "Material",
                "value": "Medical Grade Polymer"
            },
            {
                "name": "Model Name",
                "value": "Menstrual Discs"
            },
            {
                "name": "Material Type Free",
                "value": "BPA Free, Phthalate Free"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "What is Flex Disc? Flex Disc is a disposable period product that provides 12-hour comfort and leak protection. It's ultra-comfy, body-safe, and won't disrupt your vaginal pH. Plus, 64% of surveyed users reported fewer cramps compared to their previous period product! Will Flex Disc work for a heavy period? Yes! Users with heavy periods swear by Flex Disc, thanks to it's high capacity (60 mL = 5+ super tampons) and 12-hour wear. Flex Disc is great for all flows as it collects your flow and won't dry you out. How long can I wear a menstrual disc? Flex Disc can safely be worn up to 12 hours so you can sleep-in, run errands, go to school or work, etc. After 12 hours, dispose of your Flex Disc and insert a new one. If you're looking for a reusable option, check out Flex Reusable Disc! Can I use a menstrual disc with an IUD? Tons of disc users have IUDs as they were designed to be IUD-friendly—they don't rely on suction to stay in place. If you have an IUD, we recommend chatting with your doc first to understand the risks (even if small). Can I swim while wearing a menstrual disc? Yes! Swimming with a menstrual disc means swimming with no strings, no waterlogged tampons, and no worries. You can also shower, take baths, or chill in a hot tub while wearing the disc as it collects your flow (instead of absorbing it like tampons)!",
                "media_link": []
            },
            {
                "media_text": "FIND YOUR MATCH 12-hour wear 60mL Capacity 70mL Works with all flows Won't disrupt pH Helps prevent odor Blood clot-friendly Single-use Convenience Lasts up to 10 years 12-hour wear 60mL Capacity 60mL Works with all flows Won't disrupt pH Helps prevent odor Blood clot-friendly Single-use Convenience Single-use 12-hour wear 60mL Capacity 22-30mL Works with all flows Won't disrupt pH Helps prevent odor Blood clot-friendly Single-use Convenience Lasts up to 10 years 12-hour wear 60mL Capacity 3-12mL Works with all flows Won't disrupt pH Helps prevent odor Blood clot-friendly Single-use Convenience Single-use",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/46dfab72-f879-47eb-9a65-c00cbaf8076d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6439d85a-56f1-48cb-a5d8-91aa51156a18.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c396e587-0298-40e1-a031-b693effe27ee.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df5b4bd6-e041-4888-adac-8ecea908d56b.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bd03d22f-46de-403e-b989-f329938d6092.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8769793d-926c-4fa0-8a40-9669cc371a7d.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d7820c5c-e096-4833-82ba-616a2bf45073.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/93a2ca5b-fdb6-435f-aa39-0b5fcbabc3f2.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2499f461-9fc9-4f09-b893-43ce05fabb4c.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/963101eb-dbb0-49f3-bd2d-9ee0ae6c37d2.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6503e3a-c6d5-4e16-a26a-4e8398f469ef.__CR0,0,1464,600_PT0_SX1464_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dc84aa3e-fa62-4ef4-b6c8-18352359d834.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/231d5986-ba8c-4af2-9066-621ebe09eb11.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cc2e3824-754e-4fcc-b415-6e72f95a1c70.__CR0,0,488,700_PT0_SX488_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08f80ddc-3be5-4fc6-9f22-2b0b0ab5abc5.__CR0,0,488,700_PT0_SX488_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "mm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3L64BOB4ICS4WBXO42LJT6ORCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3S9JVW16I2D1M?ASIN=B07QHS3PL8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "5.0 out of 5 stars CONVERT- Never using tampons again",
                "reviewText": "FYI- this will be a descriptive review and may be TMI for some people...I have been curious about the period cups, but have been too nervous to try them. I've also read that the dyes that make them blue, purple, or pink are artificial and unsafe. The color used in these is from charcoal, so it's safe, and the reusable ones are colorless, if you want to go that route. In addition, I don't want to have to clean period blood out of a cup in a public restroom and boil it at home (yuck).Flex disposable disks are a different story. Take all of the upsides of tampons (versus pads or the ick factors of reusable menstrual cups) and multiply that by 100. To be honest, I have not tried reusable cups or discs, nor do I plan on it. Evidently, one must be aware of how high or low their cervix is, and other factors that I, personally, don't know how to determine. They are pricey and you don't know how they'll fit you, especially the cups, from what I've heard in reviews, such as Period Nirvana reviews on youtube. The suction aspect of cups seems complicated and the upkeep is more than I want to deal with.Enter flex disposable discs! Imagine that you could safely use a tampon for 12 hours at a time, whilst being able to use the bathroom without having to change your tampon. For those who hate the feel of pads or hate using overnight pads and STILL having leaks on undies, clothes, or sheets, I wholeheartedly suggest discs. I hate using pads overnight and have tried using incontinence underwear overnight because I somehow always leaked using extra long overnight pads. So I preferred using tampons, but due to the risk of TSS, I used to set an alarm for 4 am to change my tampon. This cycle, I started using the flex disposable discs and periods couldn't be easier. I HAVE NOT HAD ANY LEAKS and I'm a complete beginner in this kind of thing. As I mentioned, they self empty when you pee, or go #2. From reviews, I heard that if you didn't check your disc after using that bathroom, or even if you sneezed, leaks could happen and could be scary and intense. Since this is my first time using these, I've worn period underwear or pantyliners to be safe, but have not had any messy or gross problems. To be safe, I wash my hands after using the bathroom and use a clean finger (or thumb) to push the rim up behind my public bone to make sure it's in place and I won't leak. Period Nirvana suggests removing your disc in the shower if you're new to this alternative and to mentally prepare for the sight of blood, but I haven't had any problems; in fact, my period seems to be lighter than ever (I don't know if that's related to the disc or not). In terms of cramps, I read some amazing stories about debilitating cramps getting better with discs, and I'm happy to report that in my case, I only had one day of the most minimal cramps ever. Growing up, my school knew that I'd need to be absent at least one day every month because I'd be doubled over in pain. In summation, if you can use tampons (especially tampons with no applicator or the painful cardboard applicators) you can use disposable discs- I really believe you can do it! I've had times with Tampax pearl where the string comes off or the string is in backwards and I've completely panicked, but with a disc, you don't even need to put your entire finger in the find the rim. As for inserting, there's no complicated way of folding (like you do with a menstrual cup). I believe the flex reusable has a notch that needs to go in the front or the back in order to be leak proof, but with the disposable, simply pinch it in half (to make it like a tampon) and slide it in! It may even be smaller than some tampon applicators, but it's more comfortable that the best gliding tampons I've ever used. My favorite part is that before bed, I can put in a disc and not have to worry about Toxic Shock Syndrome. In a 24 hour day where I'd normally use AT LEAST 6 tampons (I use a new one every time I pee or take a shower, and use 2 during the night), I use 3 discs- in my early 30s, my flow can be heavy on day 2 or 3, I've been changing my disc during the day since I'm new to this, but I could probably just use 1 every 12 hours.I literally never thought I'd say this, but I'm never going back to tampons.",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grace Rowe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYPJDY4A2H723S55TT6JDWYZHVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FG5QQVWHL2CF?ASIN=B07QHS3PL8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Disc vs cup: TMI things to know from a long time user!",
                "reviewText": "First off, I’ve been using both cups and menstrual discs for years. They. Are. The. Best. I bought light “period underwear” for small leaks which I only have to use on my heaviest days. More on that later. Both cups and discs are cramp-free. Read that again. No more cramps. I don’t know the magic but if cramps ruin your life this information might just save it. Totally worth the learning curve! You also shouldn’t feel them while you are wearing them. If you do, you should try a different one, since not all discs/cups are created equal! I started my journey with another brand of discs which I could feel and leaked frequently. This one is the best one I’ve personally tried, but know if you’re built differently then perhaps this one might be problematic for you, while another brand works perfectly. Don’t be afraid to experiment.For heavy bleeders: discs are great for those first couple of days or so. They self-empty when you go to the bathroom, which means you don’t have to ever switch out period products ever again in public bathrooms. Truly, you only need take it out at the end of the day and replace it with a new one! Easy peasy. Beginner friendly since they are disposable. No washing or sterilizing like the cup requires. I know that really grosses out some people. Just toss it. Downside is, you will have to buy them monthly just like most other period products. Not so with the cup (there are discs designed to be reused as well but I do not personally have experience with them, and this review is about this disposable one anyway).Let’s talk disc leakage. It should be minor, unless it gets dislodged during a restroom break. This is my biggest frustration with discs. Sometimes it’s good, but it’s recommended to check its placement after using the bathroom since it sometimes gets out of its place. If you don’t catch it, then it won’t do it’s job. Since they are designed to empty out you may find they might leak with, say, a badly timed sneeze or cough even if it’s in properly. Even so, a light back up pad is normally all you need in such circumstances unless it was very full to begin with. If you feel a leak starting, head to the bathroom. Most of the time that means it is overfull. A light liner is usually all you need for these leaks if caught right away.To sum up: discs are not totally leak-free, but that is actually what makes them so amazing for heavy bleeders, since they freely “leak” into the toilet. Unfortunately they can shift during that process so it’s not totally set-and-forget it, either.Oh wait. Period sex? There is DEFINITELY a learning curve with this. Not so much leak-wise (though I wouldn’t try it if it’s full), but the guy can feel it. Keep that in mind and start slow. There was a BIG difference in this area between this brand and the other one I have tried. This one wasn’t as “sharp”, although hubby is still not a fan so I’m not sure I can recommend it.Cups! Cups are virtually leak-free in every sense with the proper fit. They are not nearly as “one-size-fits-all”: shorter, taller, wider, skinnier, firmer, and softer versions means you may have to try multiple brands and styles before you find one that’s perfect for you. With a proper fit, you should not be able to feel it. They do not self-empty, which means you have to take them out, dump them, and reinsert if they get full. However, in my experience by day 2 or 3 you can easily go all day without having to dump it. I’m a heavy bleeder. If you are a light bleeder, you should be able to use the cup from day 1 for a leak-free period. Outside of the initial “cavity blood” making its way out (the stuff that was already there before you put the cup in - quite minor), you could honestly go without a liner and be good all day as long as your bleeding isn’t heavy enough to fill it up. After day 2 or 3, I normally do this myself. I wear regular underwear and not even a liner for back up. That’s how leak-free it is. With a cup, there should be no sign of your period until you dump it out at the end of the day. No cramps, no blood. 5 stars. You do have to wash it, so “dealing with it” is messier in that sense, maybe. They say to boil it on a stove to sterilize it between cycles, but I find throwing it in the dishwasher works great (it’s only after I’ve already washed it, but if that freaks you out then do what makes you comfortable). I recommend owning at least two cups to let them “breathe” between uses: I don’t personally use the same one non-stop for 7 days even with proper washing habits if I can avoid it. To sum up: I hand down prefer cups over discs on lighter days, because I can completely forget about it all day. No “reminders” when I go use the bathroom. On heavy days, I sometime do a cup, sometimes I do discs. A disc and light liner is easy to keep in your car or purse if you’re caught off-guard while you’re out.That’s it! Hope this has been helpful. Always happy to share TMI if I think it will help out. Try these discs out, you will love them!",
                "reviewVotes": "158 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Natalie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXDCUKVUSEQ4JPK4KOQJ7NLAQQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y8RPJNUS4UPU?ASIN=B07QHS3PL8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars My go to period product",
                "reviewText": "I have been using the Flex discs since 2019. I love what Flex stands for and I love the updates the company has made to their discs since I first started using them. One box lasts me a couple months, maybe more, because they can be worn for up to 12 hours unlike tampons or pads. I really am saving money in the end. They are great for all flow levels, all body shapes and sizes. The flex discs do not discriminate!! They sometimes leak a bit so I do wear a panty liner sometimes. If you do get leaks or are afraid to that you will, remember that you might have to readjust the disc after going to the bathroom or you could be wearing it incorrectly, but with time, you’ll get used to it. I recommend these period discs to my friends who haven’t tried them. They are better than cups in my opinion. I hope this helps anyone wanting to try Flex discs for the first time!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shari Walsh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 30, 2023",
                "reviewTitle": "Wonderful!",
                "reviewText": "These are amazing, good for a longer time frame, less mess and comfortable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "richard madge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 18, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "Benn waiting for these to come back in stock, so easy to use, sooo comfortable, I love them",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 27, 2023",
                "reviewTitle": "Besser als Tassen etc.",
                "reviewText": "Hält bei mir viel besser & länger als Tassen, Schwämme, Tampons, etc. Habe sie jetzt 2 Monate ausprobiert und an einem Tag hat es leider nicht ganz so gut gesessen, sodass ein bisschen Blut daneben ging, aber ansonsten hielt sie perfekt! 'Ne Menstruationstasse habe ich auch eine ganz Zeit lang getragen, aber die hielt nie so ganz dicht, sodass ich immer Binden, alte Unterwäsche und/oder Menstruationsunterwäsche tragen musste.Als ich sie das erste Mal getragen habe, hatte ich das Gefühl, sie würde überhaupt nicht fest sitzen, aber es ist nichts daneben gegangen! Ist bei mir grundsätzlich sehr viel leichter einzusetzen, als andere Produkte. Das Herausnehmen ist nur eine blutige Angelegenheit, vielleicht klappt das ja aber mit mehr Übung besser, idk.Nutze 1 bis 2 Discs pro Periode.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MayT.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on July 31, 2023",
                "reviewTitle": "Sono il top per uso occasionale",
                "reviewText": "Il prodotto è un filino costoso. I produttori dicono che usato continuativamente consente di inquinare meno che con i normali assorbenti... Peccato che dovendone cambiare uno ogni 12 ore la spesa sia eccessiva. Sono però fantastici da usare occasionalmente per una giornata in piscina o per tutti gli usi che volete voi in cui il flusso crea disagio. Indossati, non si sentono affatto. Ci vuole solo un po' di confidenza con il proprio corpo, soprattutto per rimuoverli, ma secondo me battono le coppette mestruali su tutti i fronti.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emilie P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 5, 2023",
                "reviewTitle": "Efficace et une bonne alternative aux tampons et à la cup",
                "reviewText": "Je suis tombée sur ces disques un peu par hasard et j'ai voulu tenter car j'avais une journée prévue aux thermes et mes règles risquaient d'arriver. Je n'ai jamais pu porter de tampons, et j'ai essayé plusieurs cups, mais aucune ne reste en place, donc j'étais un peu en panique de ce que je pouvais faire pour ne pas avoir de mésaventures aux thermes. Et bien sûr, mes règles sont arrivées, la veille de ma sortie, donc évidemment, j'ai testé les disques dans les conditions les plus extrêmes, à savoir avec un flux très important, et dans un lieu où je ne pouvais pas porter de serviette en plus. Résultat, aucun souci! Une fuite très, très légère qui a à peine tâché l'intérieur de mon maillot de bain.Seul inconvénient réel, le retrait du disque est très sale et à éviter absolument dans des toilettes publiques. J'ai voulu bien faire en changeant de disque en milieu de journée, et comme c'était la première fois, j'ai dû mal m'y prendre et le contenu a coulé un peu partout... Résultat j'avais du sang non seulement sur ma main (normal vu qu'on doit insérer les doigts pour le retirser), sur mon maillot et sur la planche des WCs. Et comblée pour moi, il n'y avait pas de petits sachets en plastique pour jeter mon disque dans la petite poubelle, et c'est mission impossible de ranger le disque usagé dans l'emballage du nouveau disque.Si on s'y prend bien, il n'y a aucun besoin de changer de cup en journée, même pas le premier jour des règles quand on saigne beaucoup, mais comme c'était ma première fois et que je n'avais pas de protection supplémentaire en cas de fuite, je n'ai pas osé tenter de simplement vider la cup en contractant mon périné. Je l'ai fait par contre plus tard dans la journée chez moi pour tester, et ça fonctionne. Quant au retrait du 2e disque, je l'ai fait à la maison sous la douche, et comme ça, pas de risque de renouveller l'épisode catastrophe du midi.Bref ça demande peut être un peu de pratique, mais c'est super efficace comme protection, et on ne sent pas du tout le disque en journée (testé debout, assise et allongée) malgré la taille qui parait imposante.Je recommande vivement pour toute personne qui comme moi ne peut pas porter de tampon ou cups.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$16.49",
                "sellerName": "The Flex Company",
                "sellerRating": "5"
            }
        ]
    }
}