{
    "remaining_requests": 19730,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Softcup-14-Disposable-Menstrual-Discs/dp/B000X29GY6",
    "body": {
        "name": "Softdisc Menstrual Discs | Disposable Period Discs | Tampon, Pad, and Cup Alternative | Capacity of 5 Super Tampons | HSA or FSA Eligible | 14 Count",
        "price": "$13.29$13.29 ($0.95$0.95 / Count) $12.59$12.59 ($0.90$0.90 / Count)",
        "originalPrice": "",
        "rawPrice": 13.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Softcup-14-Disposable-Menstrual-Discs/dp/B000X29GY6",
        "soldBy": {
            "sellerID": "A21Q8I43Q83NOW",
            "name": "The Flex Company",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A21Q8I43Q83NOW&asin=B000X29GY6&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save an extra 20% on your first Subscribe and Save order.",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41YWQjzUXGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51HyJ27wfIL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fe0ebbf5-a42b-4593-a60d-a69d76ffb4db/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b664495b-7728-459b-929b-a2ebe9f8907d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b896fd90-61d6-410f-ac1e-0d4f08ece045/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e0193d2f-ed69-4321-8e04-49a62c1ad7d6/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d41a3687-396a-41b6-9150-44dcd5a164ee/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/56698a42-71d3-49ab-8005-5983b14036d5/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Softcup Store",
            "link": "https://www.amazon.com/stores/Softdisc/page/5C1296FE-FEFB-4296-ACF8-74D378534D21?ref_=ast_bln"
        },
        "brand": "Softdisc",
        "merchantInfo": "The Flex Company",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 20339,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 17 hrs 7 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "DESIGNED FOR YOUR BODY: Softdisc is the result of 10 years of Research and Development by scientists. It is hypoallergenic, made without BPA, phthalates, or latex. It is also the only internally-worn product that is not linked to TSS.",
            "FOR HEAVY OR LIGHT PERIODS: Use menstrual soft rings instead of tampons, pads, and menstrual cups. Unlike other products, one size fits women of all ages and sizes. Softdisc holds 5 tampons worth of fluid and is the preferred choice for heavy or light periods.",
            "COMFORTABLE: Softdisc is the most comfortable period product on the market. It prevents menstrual odor, irritation, and dryness. Most women cannot feel Softdisc at all once inserted. Softdisc is easy to change, remove and dispose of on the go.",
            "LEAK PREVENTION: Softdisc prevents leaks overnight, during exercise, while swimming, and even during sex during menstruation. Softdisc creates a comfortable seal at the base of the cervix which leaves you worry-free during all of life's activities."
        ],
        "description": "Softcup is an FDA-approved, disposable menstrual disc. Unlike tampons and menstrual cups, which plug the vaginal canal, Softcup fits at the base of the cervix and can’t be felt at all once in place. This is what makes Softcup the most comfortable period product on the market. Softcup is easy to insert and remove and is ideal for busy, active women on the go. Softcup is body-safe, naturally prevents period odor, and does not cause irritation or dryness. Join hundreds of thousands of women who have switched to Softcup.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Health Care",
                "link": "https://www.amazon.com/Health-Care-Products-Personal/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3760941"
            },
            {
                "name": "Feminine Care",
                "link": "https://www.amazon.com/Feminine-Care/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3779501"
            },
            {
                "name": "Menstrual Cups",
                "link": "https://www.amazon.com/Menstrual-Cups/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3779511"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 5.63 x 3 x 3.5 inches; 3.2 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 00160"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ October 11, 2007"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ The Flex Company"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B000X29GY6"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,031 in Health & Household (See Top 100 in Health & Household) #1 in Menstrual Cups"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 20,339 ratings"
            },
            {
                "name": "Size",
                "value": "14 Count (Pack of 1)"
            },
            {
                "name": "Brand",
                "value": "Softcup"
            },
            {
                "name": "Color",
                "value": "Clear"
            },
            {
                "name": "Material",
                "value": "Medical Grade Polymer"
            },
            {
                "name": "Model Name",
                "value": "Menstrual Discs | Disposable Period Discs | Tampon, Pad, and Cup Alternative | Capacity of 5 Super Tampons | HSA or FSA Eligible | 14 Count See more"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Softdisc Menstrual Disc - Softcup",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/b61d040c-7c08-4363-905d-17ae47d5674f.__CR0,23,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Safe To Use The Softdisc menstrual discs are safe to use as it is non- toxic, hypoallergenic, free from BPA and Phthalate free and made without natural rubber latex or silicone. No chemicals or fragrances used however, naturally controls period odor.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/885885ac-511a-4a19-9917-0b603510a1bd.__CR328,0,844,844_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Comfortable to wear for longer hours The menstrual discs are safe to be worn for upto 12 hours as it does not cause irritation, itchiness or dryness hence, doesn’t cause any discomfort.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/96cf8876-a5d3-49e7-a8bc-3cd602add572.__CR185,0,1072,1072_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Nothing should stop your action packed lifestyle, not even periods Ladies, you can now live your life to the fullest even when you are on your periods. Heavy flow or not, the disc collects the fluid at the base of the cervix ensuring zero leak during exercise, swimming and even sex. Additionally, for the heavy flow days, the disc is enough to hold 5 tampons worth of fluid that naturally results in less frequent changes.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/b192cd9d-cdab-42b6-b9f7-db65012a0b1e.__CR0,22,1185,1185_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/b61d040c-7c08-4363-905d-17ae47d5674f.__CR0,23,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/885885ac-511a-4a19-9917-0b603510a1bd.__CR328,0,844,844_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/96cf8876-a5d3-49e7-a8bc-3cd602add572.__CR185,0,1072,1072_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/b192cd9d-cdab-42b6-b9f7-db65012a0b1e.__CR0,22,1185,1185_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGI5OGSMFXKU7TAOJR7CIXFGMJCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GOGHZ7KSP8NA?ASIN=B000X29GY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars VERY effective and comfortable",
                "reviewText": "I have used a variety of products over the years, I have to say this is the BEST! It is easy to insert and place properly (just read instructions). I stay clean all day. I wear a pantyliner too, but it isn’t completely necessary. I don’t end up with a big spill first thing in the mornings.*It is a bit messy to clean/change.*I found I could effectively use for two cycles, but it may have been more leaky on third cycle.*clean with gentle soap and let dry completely before storing, if choosing to use a second cycle.*must be able to clean up/rinse up (May be harder to do in public)* I am a light to med flow. I can’t testify to the effectiveness of a high flow.*yes, I’d wear this to swim, or be active.*likely this can be used to have clean intimacy.*when I’d sit and “go” the disc would empty, I’d just wipe up and no other issue or mess. (never just emptying while sitting around)* I did compare this to a “reusable” one, this was superior. Held better, easier to insert, overall kept me cleaner.*I am in my 40’s and have had three babies pass through there.Wish I’d found this a long time ago. Hardly know it is there or that it is that annoying time!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "productjunkie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJONGP5BRFUGYEA26AYRROWYRXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DV4FBPEVBBIV?ASIN=B000X29GY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2018",
                "reviewTitle": "5.0 out of 5 stars Holy Grail of Period Products!",
                "reviewText": "I can’t beleive I overlooked this product for so many years, but am relieved that as a last resort I finally found it! I have tried EVERYTHING under the sun for my heavy, uncomfortable and temperamental periods. And EVERY one of them had a huge downside for me.The biggest downsides were leaking, pain inserting or taking out, or the worst one, causing a UTI or bladder irritation by the end :( I don’t know if I have a particularly sensitive vagina or an unusual cervix position, but I know that I always have problems no matter how careful I am and it was very depressing.Cups never fit quite right and hurt to take in out no matter what I tried (also pushed my bladder uncomfortablely), then would leak every time even after doing every suggestion I could find. Tampons I could feel and would hurt when hitting my changing cervix, not to mention bulging out at heavy times causing pain on my urethra, and completely dried me out by the end.Disposable pads were sweaty, stinky and no matter how ‘green’ would always cause irritation. I had finally just become dependent on cloth reusable pads, which were great for absorption and were the only thing that didn’t overly irritate...I was about to resign myself to them for life. The only things I didn’t like were the constant cleaning of them, feeling uncomfortable on hot days with a bulge in my underwear, and feeling gushing at times...I mean, I trusted them not to fail me but every woman still feels that twinge of fear that it might just keep going past the pad!I was about to try another brand of reusable cup when I saw these. I read a lot of info on them and liked that they sat more like a diaphragm then something in your canal, so I decided to give it a go. Insertion was a BREEZE compared to anything else and after tucked behind my pubic bone I couldn’t feel a thing, it was amazing!! The real test was how long it could hold up this way.I went to a museum with my family and we were walking everywhere for HOURS. I had a small reusable pad on just in case, this was my heaviest day and the cup was going to be put to the ultimate test. I had less cramping than normal (not sure if this was because of the cup or just my cycle) and I FORGOT I was wearing it! That never happens!! I was reminded finally after about 5-6 hours when I had to go to the bathroom. (I would have had 3 bathroom visits with a tampon in that same time!)There was absolutely NO leaking onto my backup pad, I would have just rinsed and reinserted but being in a public stall I just emptied what I could (the whole disc was filled btw) then changed to a new one. I had packed some medical gloves and just used one for easy cleanup and insertion...that is the best idea possible trust me. It is a little messy taking out but with the glove is no problem. I went the rest of the day without incident and then went to the beach the next day same thing.This is the first period in my life (no exaggeration) where I have felt free. Before, it just felt like something was always wrong and I was miserable just trying to prepare for the next mishap. I didn’t have to worry this period. No pain, no leaking, no irritation...I seriously have found my holy grail! If you have tried everything else with no success I strongly suggest giving these a try. I was at the end of my options and am SO glad I did as this is it!Ps- as others have suggested you can also use your muscles to empty the cup by bearing down while on the toilet then just using a finger to push the rim up behind your pubic bone again, this was so helpful in a public restroom when I didn’t have time one time to do the full change routine! As if it couldn’t be better!",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFL2YYQZVYLC2GEWEBIBUJX3TWIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EWVYW0KT2EUK?ASIN=B000X29GY6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Life changing!",
                "reviewText": "I have been a cup user for about 2 years (I finally figured out how to use it during COVID when I didn't have to go anywhere). I like the cup, but it would catch me off guard with leaks entirely too often. While the cup worked better than pads or tampons, it needed constant emptying and sometimes I didn't know it wasn't inserted or sealed properly until it leaked. Since I was used to using a cup, I figured the switch to a disc would be an easy one...and it was even easier than expected!The box comes with 14 discs, which is exactly enough for a 7-day cycle, using 2 per day. I was a bit hesitant when I saw how much wider the disc was vs the cup and I honestly didn't see how it would be possible to not feel something that large. On the first day of my cycle, I inserted the disc while in the shower. It went in so easily that I was sure I did it incorrectly. It was so comfortable and I really didn't feel it at all, so I was really convinced that I did it wrong. I put on a pair of period panties as a backup since I was so positive that it was in wrong and I kept checking for leaks. To my surprise, it really was in correctly and it didn't leak!I read up on how to auto-empty and that has been an absolute game changer for me! Since my heavy days tend to be very heavy, the ability to auto-empty allows one disc to last throughout an entire work day on any day of my cycle with no concerns. Just 'bear down' to push down the pelvic floor and it allows just enough of the disc to push down from behind the pelvic bone to empty. I use one in the morning when I get up and change it in the evening after my shower, which lasts me through the night.I do agree with some of the other reviews in that you need to be comfortable with 'self-exploration' in order to be OK with using a disc. Current cup users should have no issues but those switching from tampons or pads may feel a bit awkward at first. Also, each time I auto-empty, I always check to make sure the disc remains tucked behind the pelvic bone so I can continue the day leak-free. I love this product so much that I am now going to purchase a reusable disc and will never go back to pads or tampons (which never worked properly for me anyway). If you're considering a disc, definitely try this one!!!P.S. I definitely recommend changing this while in the shower unless your goal is to make the bathroom look like a crime scene. The removal process makes quite a mess!",
                "reviewVotes": "53 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 22, 2022",
                "reviewTitle": "Game changer",
                "reviewText": "About three years I suddenly started getting a random “super period“ Meaning a tampon wouldn’t even last 30 minutes. I discovered these and they really changed my life.Occasionally they can be a little difficult to remove. But you just have to relax your muscles and be patient. Really the only downside is they are messy upon removal. I don’t know if I would want to deal with this in a public bathroom, however these babies have given me the luxury of being able to sleep through the night.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 1, 2024",
                "reviewTitle": "nicht billig und nicht umweltfreundlich, aber es lohnt sich",
                "reviewText": "Dass sie nicht billig und umweltfreundlich sind, ist verständlich, aber sie sind auch eine der besten Lösungen, wenn man nicht zu Hause ist und nicht alle Toiletten die besten hygienischen Bedingungen bieten. Bequem, praktisch und nützlich",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danielle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 4, 2023",
                "reviewTitle": "Can’t believe how amazing these are!",
                "reviewText": "I think this is probably the first review I have ever posted on a product I have brought, but tried these and they are too good to not review.So simple to insert, I actually found it easy than tampons. It was comfortable as soon as it was inserted, never felt it and never leaked.I managed to keep mine in for 7 hours with a heavy flow, and quite a bit of exercise without it leaking. I suppose they are like tampons you eventually learn the length of duration as you go. It leaked a tiny bit after the 7 hours which was obviously a sign to change, but I always wear either a pad or liner anyway:l.Removal was a lot messier than tampons, however nothing major.I’m definitely moving onto these from now on and going to look at a reuse-able one. 100/10!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah K",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on February 9, 2023",
                "reviewTitle": "Love it",
                "reviewText": "Only thing I can wear. To bad it’s so expensive i Sweden 🤷🏻‍♀️Remember to push it in like a record, not up like a tampon. Weird to think like that the first time but it works. 🙃 Just pushing it in like a record, back to you butt, if you understand what I mean. 😅👍",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 7, 2022",
                "reviewTitle": "INSOSTITUIBILI",
                "reviewText": "Ho provato diverse coppette mestruali, ma nessuna riesce a darmi il comfort che ottengo con queste! Sono semplicemente perfette. Finalmente posso andare al mare e dimenticarmi completamente di avere il ciclo. Inoltre le ho provate anche in immersioni subacquee fino a 18 mt e non hanno dato alcun problema. Super consigliate! Spero solo abbassino un pò il prezzo perchè sono diventate troppo care! Orami le uso solo quando so di non avere alternativa.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.98",
                "sellerName": "QnH Tropicals LLC",
                "sellerRating": "4"
            }
        ]
    }
}