{
    "remaining_requests": 27727,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cedar-Broom-Step-Dustpan-PowerCorner/dp/B08Z9ZLLVX",
    "body": {
        "name": "O-Cedar Pet Pro Broom & Step-On Dustpan PowerCorner, Red",
        "price": "$13.97",
        "originalPrice": "$19.99",
        "rawPrice": 13.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cedar-Broom-Step-Dustpan-PowerCorner/dp/B08Z9ZLLVX",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTQSVGV1"
        ],
        "asinVariationValues": [
            {
                "asin": "B001229JC0",
                "variationName": "Style",
                "variationValue": "PowerCorner Angle Broom & Dust Pan",
                "price": "$29.18",
                "variationImageURL": ""
            },
            {
                "asin": "B0C5JVX1WW",
                "variationName": "Style",
                "variationValue": "PowerCorner One Sweep Broom & Dust Pan",
                "price": "$12.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08Z9ZLLVX",
                "variationName": "Style",
                "variationValue": "PowerCorner Pet Pro Broom & Dust Pan",
                "price": "$13.97",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41SdWZiglYL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51BwVN2dOrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TvQfLY81L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41L6fYEEbIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415H4zcxmiL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51wtn yCY1L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71z7p7VxnGL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the O-Cedar Store",
            "link": "https://www.amazon.com/stores/O-Cedar/page/C6E1D10A-404B-46B7-85F0-DFA5FB10273C?ref_=ast_bln"
        },
        "brand": "O-Cedar",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 13895,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 15. Order within 6 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "CLEAN PET HAIR LIKE A PRO: Cleans 99% of dust, dirt, and hair in one sweep with dual bristle technology for better floor contact while the angled broom head makes accessing corners a breeze",
            "UNIQUE DOUBLE BRISTLE DESIGN: Features a unique double bristle design—firm black bristles do the heavy lifting, sweeping up larger debris, while the softer gray bristles snag dust and dirt effectively all while the bristles \"remember\" their shape by snapping back into place and resisting bending",
            "STEP ON DUST PAN, REMOVE 3X HAIR: Our step-on dust pan's integrated cleaning combs allow you to remove three times more hair without using your hands",
            "RELEASE HAIR INTO TRASH WITH TAP: The dust pan is made with antistatic technology allowing debris to release into the trash with a tap",
            "MADE IN THE USA, 80% RECYCLED: The broom head bristles are made from 80% recycled plastic. This broom has a collapsible 3-piece handle that requires minor assembly."
        ],
        "description": "You love your pet but sweeping after their messes is no walk in the park. The new PowerCorner Pet Pro Broom & Step On Dust Pan is specially designed for pet owners and their furry friends. The broom features dual bristle technology that has two times the floor contact as conventional brooms. That means it sweeps up 99% of pet hair in one sweep*. It also features the innovative Step On Dust Pan. Simply step on the handle and the pressure creates a seal between the pan’s rubber lip and the floor. That means more debris gets in the pan instead of under it. And that means less work overall. What’s more, the integrated cleaning combs in the pan remove three times more hair from the broom bristles, so you can clean quickly and more efficiently.",
        "breadCrumbs": [
            {
                "name": "Health & Household",
                "link": "https://www.amazon.com/health-personal-care-nutrition-fitness/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760901"
            },
            {
                "name": "Household Supplies",
                "link": "https://www.amazon.com/Household-Supplies-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=15342811"
            },
            {
                "name": "Cleaning Tools",
                "link": "https://www.amazon.com/cleaning-tools/b/ref=dp_bc_aui_C_3?ie=UTF8&node=15342831"
            },
            {
                "name": "Sweeping",
                "link": "https://www.amazon.com/Household-Brooms-Dustpans-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=2245502011"
            },
            {
                "name": "Brooms",
                "link": "https://www.amazon.com/Household-Brooms/b/ref=dp_bc_aui_C_5?ie=UTF8&node=2245510011"
            },
            {
                "name": "Angle Brooms",
                "link": "https://www.amazon.com/Household-Angle-Brooms/b/ref=dp_bc_aui_C_6?ie=UTF8&node=14253831"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "O-Cedar"
            },
            {
                "name": "Color",
                "value": "Red"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Floor Cleaning"
            },
            {
                "name": "Handle Material",
                "value": "Plastic"
            },
            {
                "name": "Bristle Type",
                "value": "Flagged Bristle"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Lightweight, Compact"
            },
            {
                "name": "Surface Recommendation",
                "value": "Floor"
            },
            {
                "name": "Included Components",
                "value": "1 broom, 1 dust pan"
            },
            {
                "name": "Product Dimensions",
                "value": "14\"W x 4\"H"
            },
            {
                "name": "Model Name",
                "value": "Pet Pro Broom & Step-On Dustpan"
            },
            {
                "name": "Material Feature",
                "value": "Recycled"
            },
            {
                "name": "Material",
                "value": "Polyethylene Terephthalate, Plastic, Rubber"
            },
            {
                "name": "Style",
                "value": "PowerCorner Pet Pro Broom & Dust Pan"
            },
            {
                "name": "Item Weight",
                "value": "2 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Freudenberg Household Products, LP"
            },
            {
                "name": "ASIN",
                "value": "B08Z9ZLLVX"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "168017"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 13,895 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#724 in Health & Household (See Top 100 in Health & Household) #2 in Household Angle Brooms"
            },
            {
                "name": "Number of pieces",
                "value": "2"
            },
            {
                "name": "Batteries required",
                "value": "No"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Sweep up Pet Hair in One Sweep You love your pet but sweeping after their messes is no walk in the park. The new PowerCorner Pet Pro Broom & Step On Dust Pan is specially designed for pet owners and their furry friends. It also features the innovative Step On Dust Pan. Simply step on the handle and the pressure creates a seal between the pan’s rubber lip and the floor. That means more debris gets in the pan instead of under it. And that means less work overall. What’s more, the integrated cleaning combs in the pan remove three times more hair from the broom bristles, so you can clean quickly and more efficiently.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ee07f06-9e0c-449f-9121-b0387a1ed9c5.__CR0,1404,2000,1237_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "PowerCorner Pet Pro Broom & Step On Dust Pan Sweep 99% of Pet Hair in 1 Pass Cleans hair in one sweep with dual bristle technology for better floor contact while the angled broom head makes accessing corners a breeze No Hands! Dust Pan removes 3X Hair Our step-on dust pan's integrated cleaning combs allow you to remove three times more hair without using your hands Drop Hair in Trash with a tap The dust pan is made with antistatic technology allowing debris to release into the trash with a tap",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77aba145-451f-4ce3-be2a-787c4237c626.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9336ef83-750e-466f-9d53-634d6dfe7aef.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/438431be-4163-4e60-b006-1d61749ff442.__CR0,0,2000,2000_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Level up to Pet Pro!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f64e9f66-b906-4b11-96ee-f825caecaefb.__CR16,0,1429,884_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ee07f06-9e0c-449f-9121-b0387a1ed9c5.__CR0,1404,2000,1237_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77aba145-451f-4ce3-be2a-787c4237c626.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9336ef83-750e-466f-9d53-634d6dfe7aef.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/438431be-4163-4e60-b006-1d61749ff442.__CR0,0,2000,2000_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f64e9f66-b906-4b11-96ee-f825caecaefb.__CR16,0,1429,884_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Austin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJVY3F6RZVUK2PM4ZAL2P4CTEJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2V8GDAFVPSD40?ASIN=B08Z9ZLLVX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Great for easy cleaning floors!",
                "reviewText": "The O-Cedar Pet Pro Broom has proven to be a game-changer in managing pet hair and keeping my living space clean. This broom's exceptional design and performance make it a standout choice for pet owners.The first impressive feature is the dual-action bristles. The combination of traditional bristles and rubber bristles works wonders in trapping and collecting pet hair efficiently. This dual-bristle technology is a true game-changer for anyone dealing with the challenge of keeping pet hair under control.The extendable handle is a thoughtful addition. It allows for customizable height adjustments, catering to users of different heights and preferences. This feature is particularly beneficial for preventing back strain during extended cleaning sessions. The sturdy build of the handle adds to the overall durability of the broom.The built-in squeegee edge is a multifunctional element that adds versatility to the Pet Pro Broom. It not only excels at gathering pet hair but also proves effective in handling spills and wet messes. This dual-purpose design makes it an efficient tool for various cleaning tasks around the house.The broom's lightweight construction doesn't compromise its effectiveness. Despite its ease of use and maneuverability, the O-Cedar Pet Pro Broom is surprisingly robust. It handles the rigors of regular use and continues to deliver consistent performance over time.Durability is a key strength of this broom. The quality metal materials used in its construction ensure that it withstands the wear and tear associated with frequent use in a pet-friendly household. The resilient bristles maintain their effectiveness even after prolonged use, offering lasting value.The user-friendly cleaning experience is further enhanced by the easy-to-clean design. Pet hair can be easily removed from the bristles, and the broom is a breeze to maintain. This practicality adds to the overall appeal, ensuring that the O-Cedar Pet Pro Broom remains a hassle-free and efficient cleaning solution.In conclusion, the O-Cedar Pet Pro Broom has become an essential tool in my cleaning arsenal. Its dual-action bristles, extendable handle, squeegee edge, lightweight design, and durability make it an exceptional choice for pet owners. If you're in search of a broom that tackles pet hair with ease and versatility, the O-Cedar Pet Pro Broom is a top-notch solution that brings efficiency and convenience to your cleaning routine.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPRRIDI7LA42GJZ7OKWELQPNOIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F25APPZNCSR7?ASIN=B08Z9ZLLVX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Efficient Cleaning for Every Corner",
                "reviewText": "The O-Cedar PowerCorner Angle Broom with Dustpan is a game-changer for household cleaning, and it has exceeded my expectations with its exceptional performance, innovative design, and convenience. This angle broom is the perfect cleaning tool for reaching every corner of your home with ease and efficiency.The standout feature of the O-Cedar PowerCorner Angle Broom is its unique shape, featuring bristles that are cut to an angle, allowing you to clean deep into corners and tight spaces effortlessly.The broom's bristles are made from high-quality materials, ensuring they effectively pick up dust, dirt, and debris, leaving your floors spotless.The sturdy construction of the broom's handle ensures it can handle rigorous cleaning tasks without bending or breaking, providing long-lasting durability.The included dustpan is perfectly designed to match the broom's angle, making it easy to sweep debris directly into the dustpan without leaving any mess behind.The compact size and lightweight design of the O-Cedar PowerCorner Angle Broom make it easy to maneuver and store, saving valuable space in your cleaning closet.O-Cedar is a trusted brand known for its reliable cleaning products, and the PowerCorner Angle Broom with Dustpan lives up to that reputation, offering a practical and efficient solution for your cleaning needs.In conclusion, the O-Cedar PowerCorner Angle Broom with Dustpan is a must-have for every household seeking a quick and effective cleaning solution. Its innovative design, efficient performance, and durable build make it the ultimate choice for reaching every corner of your home with ease. If you're looking for a top-notch angle broom to simplify your cleaning routine, the O-Cedar PowerCorner Angle Broom with Dustpan is the perfect option. I highly recommend this broom for its outstanding features and its ability to keep your floors sparkling clean in no time!",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTR42Z3SZAMALR26HEBBW3WFAEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1X37GXKD7UECH?ASIN=B08Z9ZLLVX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "5.0 out of 5 stars The best broom out there -- just get this!",
                "reviewText": "After trying a variety of booms and dustpans, even similar-looking brooms and dustpans from this same brand, I came back to buy this Pet Pro set for a second time. It's such a treat to use! It does an amazing job of getting the dust and pet hair off my hardwood floors. This broom and dustpan set is sturdy, easy to use, and most importantly, it works. It is so gratifying to see how much dust and pet hair it can gather -- I want to sweep every day!! Twice a day! The bristles are or various lengths, so they provide a broad range of contact with the floor and quite effective at collecting fine dust and debris. The dustpan is sturdy, wide, and creates an excellent seal with the floor. The dustpan has ridges, so that you can brush the broom through the ridges to get all of the pet hair off the broom and into the dust pan -- much nicer than having to pull out all of the fur by hand. The dust pan snaps securely onto the boom, so the two pieces are easily stored together. I suspect it sounds silly to be so excited about a broom and dustpan -- but these are different -- and superior to -- other brooms and dustpans I have used in the past. The dustpan is really a game changer.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ricafort Caballes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZFWOWUTIJKX7ER5YRLSYST4OYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17HAIDMCNU8DQ?ASIN=B08Z9ZLLVX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Nice and compact. Works nicely on my hardwood floors",
                "reviewText": "I was about to buy a standard broom and dust box until I came across this one. The hand dustpan has the stepon handle allow it to works like a handled dustpan while making it more compact. The dustpan comb is a good feature but idk why it's only wide enough for the grey bristles and not the entire thing.The broom itself is good. The brush is soft enough to bend but still study enough, however, this softness really means that this is an indoor broom and not for rough outside terrian. Overall, a good quality indoor broom without the bulk.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dreaded07",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHZ6ZYZNXI5S37Q72HNMGQNQ3GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G9Y2U2G5AQ2H?ASIN=B08Z9ZLLVX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Simple, yet effective.",
                "reviewText": "Easy to put together. Came in separate pieces but broom was sturdy once assembled. The dust pan can be used while standing and is an underrated feature.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ladymary",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 4, 2024",
                "reviewTitle": "Works Great, Great Quality",
                "reviewText": "I am so happy with this broom it picks up my pet hair so easy, just like it says.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 5, 2024",
                "reviewTitle": "Bueno etcho por polvo",
                "reviewText": "Bien etcho. Bueno por polvo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yuri yuri ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 13, 2023",
                "reviewTitle": "Então é assim que é uma vassoura",
                "reviewText": "Estou apaixonado e hoje vejo que as vassouras do brasil são somente cópias frágeis",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Cc5qkghFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 6, 2023",
                "reviewTitle": "It’s a good one!",
                "reviewText": "Just what I needed and wanted.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "dcs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 31, 2023",
                "reviewTitle": "Excellent",
                "reviewText": "Great broom for the price. Sweeps almost all the dust etc. Great for the stairs; being elderly I unscrewed the broom head and sitting on each step I could sweep the stair 2 rungs up. It does not, however, totally clean as the bristles are coarse and set apart so it can leave a slight residue. All in all though I would recommend this item, especially in partnership with a vacuum!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}