{
    "remaining_requests": 32553,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shark-Navigator-Freestyle-Brushroll-SV1106/dp/B00C351GBC",
    "body": {
        "name": "Shark SV1106 Navigator Freestyle Upright Bagless Cordless Stick Vacuum for Carpet, Hard Floor and Pet with XL Dust Cup and 2-Speed Brushroll, White/Grey",
        "price": "$140.57",
        "originalPrice": "$129.99",
        "rawPrice": 140.57,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shark-Navigator-Freestyle-Brushroll-SV1106/dp/B00C351GBC",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTJYW716"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CP9RL5ZB",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$140.57",
                "variationImageURL": "https://m.media-amazon.com/images/I/21ngEuHQh9L._SS36_.jpg"
            },
            {
                "asin": "B00C351GBC",
                "variationName": "Color",
                "variationValue": "White/Grey",
                "price": "$129.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/21Xqo9KFzhL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/21Xqo9KFzhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Kz6CxUX L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41S8h2v3B8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/618FB q gjL.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Shark Store",
            "link": "https://www.amazon.com/stores/Shark/page/260F9B11-06D9-4F5D-953C-0FCE37C48DA8?ref_=ast_bln"
        },
        "brand": "Shark",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 22178,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 23 hrs 48 mins",
            "FREE delivery Tuesday, February 20. Order within 10 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LIGHTWEIGHT CORDLESS CONVENIENCE: Portable, powerful and versatile, at only 7.5 lbs..Voltage:10.8 volts. Wattage : 125 watts.Noise Level : 80 dB",
            "2-SPEED BRUSHROLL: Optimized for both carpet and hard floors, and provides premium pet hair pickup throughout the home.",
            "XL DUST CUP CAPACITY: Easy-to-empty .64 quart dust cup for extended cleaning without interruption.",
            "PRECISION CHARGING: Charger doubles as storage block, and can charge in 4 hours.",
            "WHAT'S INCLUDED: Shark Freestyle Cordless Vacuum & Precision Charger.",
            "2-speed brushroll, optimized for carpet and bare floors"
        ],
        "description": "Product Description Shark Navigator Freestyle Upright Stick Cordless Bagless Vacuum for Carpet, Hard Floor and Pet with XL Dust Cup and 2-Speed Brush roll (SV1106), White/Grey. Brand Story By Shark",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b?ie=UTF8&node=3743521"
            },
            {
                "name": "Upright Vacuums",
                "link": "https://www.amazon.com/upright-vacuums/b?ie=UTF8&node=510110"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Shark"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Lightweight, Bagless"
            },
            {
                "name": "Filter Type",
                "value": "Foam"
            },
            {
                "name": "Included Components",
                "value": "Shark Navigator Cordless Vacuum, Precision Charging Base"
            },
            {
                "name": "Is Cordless?",
                "value": "Yes"
            },
            {
                "name": "Capacity",
                "value": "0.64 Quarts"
            },
            {
                "name": "Wattage",
                "value": "125 watts"
            },
            {
                "name": "Cable Length",
                "value": "46 Inches"
            },
            {
                "name": "Form Factor",
                "value": "Upright"
            },
            {
                "name": "Color",
                "value": "White/Grey"
            },
            {
                "name": "Model Name",
                "value": "Shark SV1106 Upright Cordless Stick Vacuum"
            },
            {
                "name": "Product Dimensions",
                "value": "10.5\"L x 9.6\"W x 46\"H"
            },
            {
                "name": "Battery Description",
                "value": "10.8V Battery Included"
            },
            {
                "name": "Noise Level",
                "value": "80 dB"
            },
            {
                "name": "Amperage",
                "value": "11.5 Amps"
            },
            {
                "name": "Manufacturer",
                "value": "SharkNinja"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Controller Type",
                "value": "Push Button"
            },
            {
                "name": "Control Method",
                "value": "App"
            },
            {
                "name": "Style",
                "value": "Contemporary"
            },
            {
                "name": "Connectivity Technology",
                "value": "Bluetooth, Infrared"
            },
            {
                "name": "Cleaning Path Width",
                "value": "10 Inches"
            },
            {
                "name": "Portable",
                "value": "Yes"
            },
            {
                "name": "Item Weight",
                "value": "7.5 pounds"
            },
            {
                "name": "Department",
                "value": "Floorcare"
            },
            {
                "name": "ASIN",
                "value": "B00C351GBC"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "SV1106"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required."
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 22,178 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#381 in Industrial & Scientific (See Top 100 in Industrial & Scientific) #10 in Upright Vacuum Cleaners #28 in Commercial Vacuums"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Specific instructions for use",
                "value": "Hard Floor, Carpet"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Warranty Description",
                "value": "Sharkninja one-year (1) limited warranty."
            },
            {
                "name": "Batteries required",
                "value": "Yes"
            },
            {
                "name": "Battery type",
                "value": "10.8V Battery Included"
            },
            {
                "name": "Import",
                "value": "Made in USA"
            },
            {
                "name": "Surface Recommendation Carpet, Hard Floor",
                "value": "Power Source Battery Powered"
            },
            {
                "name": "Voltage 10.8 Volts",
                "value": "Item Weight 7.5 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Shark Navigator Freestyle Premium Cordless Vacuum The Navigator Freestyle Premium Cordless Vacuum provides a quick, convenient clean-up on all types of surfaces, from one room to another. It not only offers superior cleaning on both bare floor and carpet, but it has strong suction power and an extended run time. Armed with advanced swivel steering for excellent control when maneuvering around furniture, the Navigator has a powerful motorized brush that lifts embedded pet hair from carpets, making it ideal for pet owners. The extra-large dust cup holds more dirt and debris so you can empty it less frequently. And the top- and bottom-empty design makes it easy to empty without interacting with the dirt.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/mg/095f6e2e-586d-417d-bb7f-19df9f7bb9ca._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/mg/857297fb-cf0f-4b7d-8855-e57c1e1256c1._SR230,100_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/mg/095f6e2e-586d-417d-bb7f-19df9f7bb9ca._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/mg/857297fb-cf0f-4b7d-8855-e57c1e1256c1._SR230,100_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "K Powe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDBKJ7FVIBPWE2HIWY3VW25CP3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9TIACF5MTLY0?ASIN=B00C351GBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2012",
                "reviewTitle": "5.0 out of 5 stars Great option for everyday use",
                "reviewText": "I bought this vacuum 7 months ago when I moved into a house with 3 floors. I have an excellent upright, but it is heavy and I couldn't imagine lugging it between three stories to clean. I LOVE this vacuum, so much so that I vacuum more often than ever before because it is so effective and easy! While it is not a perfect vacuum it is pretty close:PROS; - Light weight, I can easily carry it up and down stairs, and it's light enough my 13 month old can push it- Great suction, I am always amazed at the amount of dirt is in the canister after a few minutes of use (it picks up all sorts of pet hair I can\"t even see with the naked eye- Wonderful maneuverability, it has a swivel head that allows me to make turns very easily- Two settings, one for carpet with strong brush action, and one for hard floors- Long battery life, I have been able to vacuum my whole house without any decreased suction (1.5+ hours)- Easy recharging, there is a charging stand that the unit pops into and a blue light lights up when it is on the charger correctly- Easy to empty canister, with a press of a button it pops out of the vacuum and with a press of another the bottom swings out, and is designed to pull the dirt out so you don't have to stick your hand in there!- Easy to take apart to clean, my mother cleaned the house and didn't empty the vacuum and it was so full it was completely blocked from sucking. I was able to take apart the whole thing, clean everything out, put it back together and get back to cleaning in 15 minutes- Size, it is very compact and easy to tuck into a corner (I have a TINY kitchen, about 8x8) and it fits easily in there, so it would be great for a small spaceCONS:- Rather small canister - I have to empty it after almost every 2 rooms, but again it is so easy to do and it is getting so much I don't even see I don't mind- On/Off button on top of vacuum head, it makes it difficult to vacuum under some pieces of furniture, so I move the furniture or my upright once a month for that- Not great along walls, it CAN get a lot of things along the wall, but pieces of dog food, little things my kids drops, etc along the wall I often have to brush away from the way for the vacuum to getAll and all I think this is a fabulous product and use it daily. No it is not perfect, but for the size, ease of use and price I think it is a great product and have recommended it to many of my friends and family. This in conjunction with a had vac (I have a Europro Operating SV780 Cordless Handheld ) for those hard to reach places should fulfill most of your usual vacuuming needs.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "N. Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5D5ODCHKOEF4OGPWPDPJ5CBOJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTN19QBFIH9II?ASIN=B00C351GBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars It's awesome, and no cords to fuss with!",
                "reviewText": "I used a friend's at her place, and loved it so much I had to buy one for myself. It picks up as well as my corded shark vacuum, but it fits in smaller spaces due to its size. Lays down flat to clean under furniture, and best of all, no cords to mess with!It is the smaller unit, so of course it has a smaller tank that needs to be emptied more often. I probably would not recommend it for massive carpeted areas.. but that said, I kinda have been using it as such...I saw a review where someone said it wouldn't pick up her small things, I'm thinking she had a defective unit, because I've now used two of them, and I couldn't ask for better performance. I can't stress enough how much I love not having a cord.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pete F",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW5J33IGXMX6II3TUQ3MC7A4ZNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CLPL41ZYHNU3?ASIN=B00C351GBC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 22, 2017",
                "reviewTitle": "4.0 out of 5 stars Good vacuum, just a few issues",
                "reviewText": "The first thing to remember is this not a $600 vacuum and will not have same power as one. This vacuum does a decent job at picking up dust, crumbs, dirt, etc. off of hardwood floors. It also does a decent job on rugs. The charger is very handy, having to only place it in the cradle.One area of improvement is the ON switch. Its nice that it can be operated by one's foot, but the first mode of operation when turned on is for vacuuming carpets/rugs (i.e. fast turning brushes mode). So when the vacuum is first turned on, the brush is turning very fast. Its a little tricky, but I lift the vacuum slightly in the air and try to press the button twice with my foot before letting it touch the floor. It seems a majority of people who buy this vacuum is mainly for their hardwood floors, first, and for their rugs, second. It would make more sense to have the first touch of the button be slow brush mode, then the second touch be fast brush mode for rugs.Another issue I have is the joint between the vacuum head and the vacuum body. This might just be a defect with my vacuum, but it seems very stiff. When I vacuum, I push the vacuum head pushed away from me, then I pull it back towards me, then as I push it away, the vacuum head stays stuck at the 75-90 degree angle it was in and basically looks like its popping a wheelie across the floor as I push it away. I need to vacuum with the vacuum head far enough away to keep it at a low angle or keep putting my foot on it to bring the head down back to the floor. Maybe in time the joint will loosen and I can vacuum like normal. Until then, its a little bit of a pain to use.The battery seems to last a good amount of time. Pretty much what other reviewers have commented. It would be nice if it had a meter to tell you how much battery is left. I tend to vacuum a few spots and leave the vacuum where it is. Then I vacuum some other spots the next day, and so on. So I don't always bother going back to the kitchen and charging it. There have been a few times, I've been vacuuming and the battery dies without warning. Then I need to wait 4-6 hours before I can vacuum again. By then I don't need it because I just bring out the hose on my regular vacuum cleaner and finish the job.I like that its lightweight and cordless, with a good battery and charger. The above mention problems aren't terrible, but definite room for improvement.",
                "reviewVotes": "42 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yarvet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP644AEJYLFGOLVMXS5WWRJWPJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROYOKTP7AJ9OJ?ASIN=B00C351GBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Fantastic!",
                "reviewText": "This vacuum is so good, I just ordered another one! Now we have his and hers.Love the ease of cleaning it, the two speed brush and it's so lightweight for ourdisabled bodies. WE LOVE IT!!! We are 75 and this is the best vacuum we have everhad! So simple to operate and empty!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patty M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXLLE5AUIWSKJUSBV3J72HNJ36A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YWSCWQY37E55?ASIN=B00C351GBC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Very Happy Customer",
                "reviewText": "Ease of cleaning. Ease of use. Lightweight. Easy to clean. Super easy to assemble & charge up. It's nothing fancy but perfect for me. I wish it was slightly cheaper, but it's exactly what I wanted and membership in Amazon Prime eliminates any S&H charges ... so if you're on the fence, I say go for it. I'm 70, I live alone and manage my home myself. This works great for my needs (about 6 rugs/runners, cat hair/cat litter/monster dust bunny control; and surface=premium linoleum throughout). • So I'm a happy girl. Thanks, Sharky. I dig your product. :)",
                "reviewVotes": "48 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "gramma",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 19, 2019",
                "reviewTitle": "Queen of Clean approves!",
                "reviewText": "This is my go-to cleaner for daily “quick ups”. Lightweight and easy to manage. Good suction for this type of machine & I use it daily on hardwood, tile & area rugs. Makes my life so much easier. We have no pets and I clean the dust cup after each use so we’ve had no issues with clogging or diminished suction. Sturdy, holds charge for 20 minutes, charges in about 3 hours. I laughed over the review that repeatedly mentions flashing blue light but mine is charged and stored in utility room where that’s not an issue! I highly recommend this for performance & value.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vicky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 7, 2023",
                "reviewTitle": "Con gran dificultad para conseguir refacciones y tiene pilas de Litio.",
                "reviewText": "Cargas y difíciles de reponer las refacciones.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 9, 2017",
                "reviewTitle": "Superb performance",
                "reviewText": "Totally in love with my Shark. (Yes, should get out more.) Seriously though all the excellent reviews are correct and they decided my purchase. Superb machine. Tested it on arrival on just a portion of shag carpet and could not believe what it picked up. I am too ashamed to show you all the photo. Some reviews say it is not so efficient on hard floors. I have not found that. It is a superb cleaner of carpeted and hard wood floors at a very competitive price. So glad I have it. So glad too that I chose cordless and bagless. Easy to charge it is also a good looking vacuum - if that is what floats your boat - looking more expensive than it is. Very highly recommended without hesitation.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ev",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 8, 2017",
                "reviewTitle": "Light weight and powerful",
                "reviewText": "Works very well on carpet and hard floors. The only issue is that it wouldn't be suitable for areas with lots of carpet. The dirt compartment is very small and needs frequent emptying. Other than that it cleans up good. Very light weight and versatile. I do find that it takes a while to fully charge and I don't like how the light still blinks once it's charged, it's very bright and annoying at night. So I take it off the charger once it's done. Also it doesn't come with any crevice tools, so it's strictly a floor vacuum. Which is fine for me but may not be for everyone.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luisa F Algara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 4, 2016",
                "reviewTitle": "Creo que no la recomendaría fácilmente, sólo explicando bien las desventajas que yo encuentro",
                "reviewText": "No me gustó porque la recarga tarda muchísimoNo me gustó porque la recarga dura poquísimoNo me gustó porque es difícil y complicado el manejo del \"handle\", parece muy frágil y lo hace uno con miedo, siempre pienso que se romperá muy prontoMe gustó el tamaño, fácil de acomodar en lugares reducidos.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}