{
    "remaining_requests": 32449,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-Basics-Upright-Bagless-Lightweight/dp/B0BN5F6MJY",
    "body": {
        "name": "Amazon Basics Upright Bagless Lightweight Vacuum Cleaner, Black and White",
        "price": "$70.98",
        "originalPrice": "",
        "rawPrice": 70.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-Basics-Upright-Bagless-Lightweight/dp/B0BN5F6MJY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41kcM0XmSCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41SaDSSQYuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51blN2wluDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vhTBLFDfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JZG2Si6lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41AiLJ5c-ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/3110E gujRL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Basics Store",
            "link": "https://www.amazon.com/stores/AmazonBasics/page/947C6949-CF8E-4BD3-914A-B411DD3E4433?ref_=ast_bln"
        },
        "brand": "AmazonBasics",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 347,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20",
            "Or fastest delivery Monday, February 19. Order within 18 hrs 45 mins",
            "FREE delivery Tuesday, February 20. Order within 23 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Powerful and easy to use upright vacuum with 12kPa and 70W suction power ideal for vacuuming carpet, area rugs, hardwood and other surfaces.",
            "With only 8.4lbs the Amazon Basics Upright vacuum is lightweight for easy to use with a space saving design that can conveniently be stored.",
            "It comes with On-board attachments including crevice tool and upholstery tool",
            "With a large dust cup that allows you to keep vacuuming uninterruptedly and it is easy to empty with quick release dust cup button",
            "Includes washable filter"
        ],
        "description": "An Amazon Brand",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3743521"
            },
            {
                "name": "Upright Vacuums",
                "link": "https://www.amazon.com/upright-vacuums/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510110"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Amazon Basics"
            },
            {
                "name": "Special Feature",
                "value": "Bagless"
            },
            {
                "name": "Included Components",
                "value": "Crevice Tool and upholstery tool"
            },
            {
                "name": "Form Factor",
                "value": "Upright"
            },
            {
                "name": "Color",
                "value": "Black and White"
            },
            {
                "name": "Manufacturer",
                "value": "Amazon"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Controller Type",
                "value": "Push Button"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Product Dimensions",
                "value": "11.9 x 11.4 x 41.3 inches"
            },
            {
                "name": "Item Weight",
                "value": "8.4 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0BN5F6MJY"
            },
            {
                "name": "Country of Origin",
                "value": "Vietnam"
            },
            {
                "name": "Item model number",
                "value": "PD-KNRMY6AYFK"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 347 ratings 4.2 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,092 in Our Brands (See Top 100 in Our Brands) #35 in Upright Vacuum Cleaners"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Imported"
            },
            {
                "name": "Surface Recommendation Carpet,Hardwood",
                "value": "Power Source Corded Electric"
            },
            {
                "name": "Item Weight 8.4 Pounds",
                "value": "Wattage 70 watts"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marinite",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXIVEZY3KF3UKSYIQVORPVZSZYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R140WUAFOD7GCO?ASIN=B0BN5F6MJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Up and running (and terrorizing the cat) in no time!",
                "reviewText": "After reading most of the reviews, I knew pretty much what to expect from this vacuum, and it doesn't disappoint. It was easy to put together, and I was vacuuming just a few moments after I got it. I bought this vacuum because my much more expensive Miele canister vacuum -- while it's well engineered, handles bare floors beautifully and is super quiet -- can't even pick up lint from my wool area rug. So I was looking for an inexpensive, yet effective and lightweight upright vacuum solely for use on my living room area rug. So glad I came across this option, as I really didn't want to invest a more considerable sum in a vacuum just for use on an area rug. Though it's now three years old, the rug is still releasing a lot of minuscule wool fibers, and due to the wimpy carpet suction power of the Miele canister vacuum, I was sure the rug was harboring a lot of dust as well.So my requirements for a more powerful vacuum were pretty minimal. I just wanted something fairly compact, but powerful enough to get my area rug clean. The short cord isn't an issue for me because my area rug isn't huge, and I don't intend to use it on my hardwood floors. I don't mind that it doesn't have a swivel head because it's easy enough to maneuver. My area rug is just 9x12, but when I let this little vacuum loose on it, I was impressed to see that the dust cup was full almost immediately, no doubt sucking up three years of the dust and wool bits left behind by my Miele. The rug was noticeably brighter after running this vacuum over it. The dirt receptacle is easy to remove and empty, but I'd never do it indoors -- having had a bagless upright vacuum in the past, I quickly realized that no matter how carefully it's done, emptying it indoors releases dust into the air, so I empty it into a bag outdoors. I miss having an upright with a HEPA filter, but I knew this one didn't have one, and wouldn't have expected it at this price. But I'd forgotten what it was like to use a vacuum without a HEPA filter, and was reminded how handy they are because after using this vacuum the first time, I was coughing and the house smelled like dust. But the second time I used it -- no doubt because it did such a good job cleaning the rug the first time -- it wasn't an issue.To sum up, I'm impressed at how effectively this well-priced vacuum cleans. I love the size and light weight, and the simplicity of the design, and it's not as noisy as I expected, after reading other reviews. Having said that, I'll still only use it when I know my neighbor is at work. Again, I don't intend to use it on my hardwood floors (I have to get some kind of ROI from my expensive Miele canister, which does a great job on bare floors), so there's no disappointment in that regard. I'm very happy with this purchase, and I feel so much better knowing that my area rug is now dust free. It will probably still be shedding for months to come, as that's the nature of tufted wool rugs, but at least I now know that I have a much better tool to deal with it. Another plus is that this compact vacuum takes up very little space in the limited storage area in my flat. All in all, I'm very chuffed with this little powerhouse of a vacuum!",
                "reviewVotes": "21 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KatzenBooks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV47FP6TLIS64DPLLVXGUCWUAVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLFJOZVTOB4UY?ASIN=B0BN5F6MJY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 29, 2023",
                "reviewTitle": "5.0 out of 5 stars This is an amazing vacuum. You need it.",
                "reviewText": "Buying a vacuum feels like a luxury, especially when you can easily spend hundreds. My old one was always spitting schmutz around on the hard floor - which is almost all of my home. Extremely frustrating, but didn't really merit replacement. Then the power pedal gave out, and when I spotted this one, something just told me to get it. I'm usually so big on doing research, but the price and reviews were great. Very glad I took that leap.The other reviewers have pretty much said it all. It's lightweight but does not feel flimsy. It's smaller scale - maybe 3/4 scale of a regular upright. The designers did a great job choosing practical features and making it easy to use. What amazed me is what it actually does to the carpet. I don't know how old my rental home's flooring is... seven years at least. I live in a cold climate (on the ground floor so lots of dirt and dust blows in) and my roommate is a very sweet, super fuzzy cat. It's just really difficult to keep the floors clean. The carpet isn't horrendous, but it's getting worn and has definitely seen much better days.You know how even mid-pile standard home carpet kind of wears down and gets flatter over time? I did not think that was fixable, but a few passes with this and it's much more plush. This vacuum didn't just clean the carpet, it basically restored it. I have had a lot of vacuums over the years and have never seen any of them do that. It's also much better on hard floors - the traces of cat litter can ricochet a bit, but I can just detach the handle and get it up that way. Other things like fluff and bits of cat food etc. are no problem.I'm beyond thrilled with this thing, particularly given the very low price. You should get it right this second. Will definitely keep an eye on Amazon branded products in the future too.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "King",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMRMWQT4WX3HNPHKFFQJKJ7IOFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N5MQJLBWEAR4?ASIN=B0BN5F6MJY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Reliable Cleaning Power with a Budget-Friendly Price",
                "reviewText": "*Title: Reliable Cleaning Power with a Budget-Friendly Price**The Amazon Basics Upright Bagless Lightweight Vacuum Cleaner in White is a dependable cleaning tool that offers great value for its affordable price. I've found it to be an efficient and practical solution for regular household cleaning.This vacuum cleaner's lightweight design makes it easy to maneuver around the house without causing strain. The suction power is surprisingly strong, effectively picking up dirt, debris, and pet hair from various surfaces, including both hard floors and carpets.The bagless feature is a definite plus, eliminating the hassle of purchasing and replacing bags. The dust bin is easy to empty and clean, adding to the overall convenience of the machine.Assembly is straightforward, and the intuitive design of the vacuum makes it user-friendly, even for those who might not be technologically inclined.While the build quality is good overall, some plastic components might feel a bit flimsy. However, with proper care and usage, this vacuum cleaner has proven to be durable and reliable.For its price point, the Amazon Basics Upright Bagless Lightweight Vacuum Cleaner delivers impressive cleaning performance, making it a solid choice for anyone seeking an efficient yet budget-friendly cleaning solutions smell like new!",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}