{
    "remaining_requests": 32370,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/POWEART-30Kpa-Cordless-Vacuum-Cleaner/dp/B0CK5ZMW6S",
    "body": {
        "name": "POWEART 30Kpa Cordless Vacuum Cleaner - 8-in-1 Lightweight Stick Vacuum with Rechargeable Battery, 350W Powerful Vacuum Up to 45min Runtime, Self-Standing Vacuum Cleaner for Pet Hair Hard Floor-Purple",
        "price": "$99.99",
        "originalPrice": "$279.98",
        "rawPrice": 99.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/POWEART-30Kpa-Cordless-Vacuum-Cleaner/dp/B0CK5ZMW6S",
        "soldBy": {
            "sellerID": "A3UAD876AEC3L9",
            "name": "POWEART US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3UAD876AEC3L9&asin=B0CK5ZMW6S&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTZCX7K8"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CFF7LCWM",
                "variationName": "Color",
                "variationValue": "Azure",
                "price": "$99.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Qhh154j-L._SS36_.jpg"
            },
            {
                "asin": "B0CK5YHPLJ",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "$99.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cSGb9FGDL._SS36_.jpg"
            },
            {
                "asin": "B0CK5ZMW6S",
                "variationName": "Color",
                "variationValue": "Purple",
                "price": "$99.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41Z46XOBd8L._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Z46XOBd8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51xi-NwKhCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51s4ciMqDyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511yftX6jGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51D uZetfZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bwZ9Tw7PL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KXvnaxg4L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the POWEART Store",
            "link": "https://www.amazon.com/stores/POWEART/page/B0B4F345-01E6-4CD8-99F4-FA47215981A4?ref_=ast_bln"
        },
        "brand": "POWEART",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 185,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19. Order within 17 mins",
            "FREE delivery Monday, February 19. Order within 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【Powerful 350W 30Kpa Suction Capability 】Unleash the power of deep cleaning with this cordless vacuum cleaner! Equipped with a 350W robust brushless motor, it generates up to 30KPa of potent suction with minimal noise. Its dual-mode feature allows this cordless stick vacuum to work wonders on all hard floors, including tile, marble, and wood. It's also suitable for cleaning low-pile carpets, pet hair, and larger debris like cereal, cat litter, and dust on high-speed mode. Its cord-free design ensures unrestricted movement throughout your home.",
            "【Versatile 8-in-1 Cleaning Functions】Enjoy a truly multipurpose cleaning experience with this 8-in-1 lightweight cordless vacuum! This battery-powered stick vacuum comes with a retractable tube, flexible hose, and three practical attachments - the primary floor brush head, 2-in-1 brush, and crevice tool - making it ideal for any cleaning job. It seamlessly transitions between hard floors, low-pile carpets, and tight spaces using its extended tube and main brush. For cleaning stairs, shelves, sofas, and even your car, quickly switch to handheld vacuum mode with the 2-in-1 brush or crevice tool.",
            "【Efficient 5-Stage Filtration System】This rechargeable cordless vacuum cleaner features a 5-stage high-efficiency filtration system, capturing and trapping 99.99% of dust particles as tiny as 0.1 microns to keep your home clean and healthy. The washable strainer and reusable HEPA filter efficiently filter out dust and dirt, safeguarding the motor and maintaining optimal vacuum performance. The high-density HEPA filter, 200% more effective and longer-lasting than traditional filters, ensures top-notch performance. An additional HEPA filter is included for added value and convenience.",
            "【45min Long-lasting Runtime】Boasting an advanced 8-cell lithium battery with a 2200mAh large capacity, this battery-operated vacuum delivers up to 45 minutes of runtime in Standard mode and 20 minutes at High speed. It requires only 4.5 hours for a full charge, and the detachable battery can be charged while in the vacuum or separately, offering 2 charging options. For added convenience and time-saving, you can also prepare a spare battery pack. With its extended runtime and flexible charging choices, you'll have ample time to clean every corner of your home without power concerns.",
            "【Flexible LED Motorized Floor Head】This battery cordless stick vacuum cleaner showcases a flexible motorized floor head with 8 LED lights. The beater roller, featuring a mix of soft and stiff bristles, effectively removes dust and debris without scratching the floor or causing tangles. LED lights illuminate dark and hard-to-reach areas for improved visibility. With a versatile 90° vertical and 150° horizontal rotation, the floor head easily accesses tight spaces and under furniture. The smooth rubber wheels on the flexible floor brush allow for effortless movement on hardwood floors, tiles, marble, and low-pile carpets without leaving marks.",
            "【Convenient Design & Self-standing Storage】Save time and effort with this self-standing rechargeable stick cordless vacuum cleaner. The 1L dustbin holds a considerable amount of debris and can be quickly emptied with a single button press. This lightweight hard floor cordless vacuum includes a wall-mounted storage rack and cleaning tools. Discover more surprises with the POWEART V870 wireless quiet vacuum cleaner, your ideal cleaning companion!",
            "【100% Satisfactory After-Sales】 POWEART V870 stick cordless vacuum cleaner are provided offers 24*7 and 12-Month customer service and accessories replacement service. Contact us if you have any questions about our household vacuum cleaner, and we will get back to you as soon as possible. Nice gift for your friends and families! With POWEART vacuum cleaner, you can revolutionize the way you clean your home！"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3743521"
            },
            {
                "name": "Stick Vacuums & Electric Brooms",
                "link": "https://www.amazon.com/stick-vacuums-electric-brooms/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510112"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "POWEART"
            },
            {
                "name": "Special Feature",
                "value": "🌟30KPa Powerful Suction🌟350W Brushless Motor 🌟Stick Vacuum & Handheld Vacuum 8-in-1🌟Self-standing & Wall-mountable 🌟2 Powerful Suction Mode 🌟5-Stage High-efficiency Filtration🌟Large-capacity Detachable Battery 🌟Flexible Motorized Main Floor Brush🌟8 LED Floor Search Lights🌟Motorized Beater Roller 🌟35-44 inch Adjustable Tube🌟Quick & Easy Empty Dust Cup See more"
            },
            {
                "name": "Filter Type",
                "value": "5 Stage High-Efficiency Filtration System"
            },
            {
                "name": "Included Components",
                "value": "🔸1.Vacuum motor 🔸2.A battery 🔸3.An adapter 🔸4.Extendable tube 🔸5.Motorized floor head 🔸6.2-in-1 brush 🔸7. Crevice tool 🔸8. Cleaning gadget 🔸9. Extra HEPA🔸10.Wall-mount 🔸11.User manual 🔸12.User-guide🔸13. A flexible hose See more"
            },
            {
                "name": "Is Cordless?",
                "value": "Yes"
            },
            {
                "name": "Capacity",
                "value": "1 Liters"
            },
            {
                "name": "Wattage",
                "value": "350 watts"
            },
            {
                "name": "Runtime",
                "value": "45 minutes"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "🎁 A perfect gift for parents, lover, and friends! 🏡 It comes with an array of attachments to cater to various cleaning needs. 🏡 While cleaning, remember to maintain contact between the nozzle and the floor, enabling the vacuum cleaner to efficiently suck up dust and dirt. For different types of flooring, you can adjust the suction to achieve the most effective cleaning outcome. Surprise your loved ones with this versatile and efficient cleaning tool!"
            },
            {
                "name": "Form Factor",
                "value": "Stick, Handheld, Upright, Stick Cordless Vacuum"
            },
            {
                "name": "Color",
                "value": "Purple"
            },
            {
                "name": "Model Name",
                "value": "POWEART Cordless Vacuum Cleaner V870PP"
            },
            {
                "name": "Product Dimensions",
                "value": "17.5\"L x 13.3\"W x 7.7\"H"
            },
            {
                "name": "Noise Level",
                "value": "65 dB"
            },
            {
                "name": "Manufacturer",
                "value": "POWEART"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Controller Type",
                "value": "Cordless Stick Vacuum One-touch Start & Dustbin One-button Empty"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Style",
                "value": "Lightweight"
            },
            {
                "name": "Is Electric",
                "value": "Yes"
            },
            {
                "name": "Number of Wheels",
                "value": "4"
            },
            {
                "name": "Item Weight",
                "value": "3.5 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CK5ZMW6S"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "V870"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 185 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#121,246 in Home & Kitchen (See Top 100 in Home & Kitchen) #233 in Stick Vacuums & Electric Brooms"
            },
            {
                "name": "Specific instructions for use",
                "value": "🍀POWEART Cordless Vacuum Cleaner is Perfect for Getting the Cleaning Done Quickly and Effectively Around the House, Car, or Any Other Place You Need It. Cleaning the Whole House Thoroughly."
            },
            {
                "name": "Specifications",
                "value": "Hard floor, Short-pile Carpet, Dual action"
            },
            {
                "name": "Batteries required",
                "value": "Yes"
            },
            {
                "name": "Surface Recommendation Hard floors, short-pile carpet, tile flooring, marble flooring, wooden flooring See more",
                "value": "Power Source Battery Powered"
            },
            {
                "name": "Voltage 120 Volts",
                "value": "Item Weight 3.5 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Poweart V870 Cordless Stick Vacuum Cleaner - Best Gift for Family or Friends! Poweart Cordless Vacuum Cleaner - it's quick, it's powerful, it's for you! This cordless vacuum features a 350W brushless motor with up to 30000 Pa powerful suction, it can also be used as a handheld vacuum cordless. It is very lightweight, powerful and versatile for household clean-ing. This cordless stick vacuum is not just a hard floor vacuum cleaner, from freshening up curtains to sofas, from all kinds of floors to stairs, from crumbs wedged in the kitchen to particles littering in the study, there are all sorts of ways to use this stick vacuum.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/758d127b-a73f-4f19-9df6-fe49fc0087b4.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Why choose POWEART V870 cordless vacuum cleaner? The flagship advantages of this stick vacuum cleaner - save time, save manual energy, easy to use. It's very quick and easy to assemble thanks to every flexible clip. It's easy to operate because you don't need to keep pressing the switch to make it work, one quick click is all you need. It takes only 4.5 hours for a whole charge, and one full charge will be enough for cleaning a whole room. It's very powerful with a 350W motor which can generate 30000pa suction in maximum. It possesses an efficient filtration system that helps to pick up particles and protect the motor, which also helps improve your indoor air quality. It's versatile for whole-housing cleaning - using three brush heads and a retractable tube can get 6 different combinations.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30b6a0d9-a4c9-49f9-b473-b5ed38fbfdc2.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Special Features of Stick Vacuum Cleaner Cordless V870! Two Suction Mode 2 mode stick vacuum can easily pick up all kinds of debris, such as dust, pet hair, cereal, cat litter, dog food, bean, and so on. Max mode with 30Kpa powerful suction and Standard mode up to 45 mins long runtime. One-click to started, without holding the power button all the time. Easy to Maneuver Vacuum cleaner cordless maneuvered by flexible four rubber wheels, it can move freely on the hardwood floor, tile, marble floor, and low-pile carpet. Protecting the floor surface will not make a scratch. Advance brushless digital motor reduces noise to 65db(A), clean peacefully with less disturbance to your family. LED Flexible Floor Head LED motorized brush head helps vaccumm-cordless track dirt in dark places, make dust no hide; stiff & soft bristle of the stick vacuum trap dust and dirt efficiently. Wireless vacuum swivels 150° sideways and 90° up and down to move freely in all directions, easily go into hard-to-reach places.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de0c8bab-33f4-4e68-a23c-29833d22edce.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/551ea60c-1607-472b-9e16-4ece07af8a46.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c8d5f70-0bd6-426a-b4d6-efd68efc9e05.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Easy to Clean One-click can empty the dust cup of the vacuum cordless without dirt your hand; the metal strainer is detachable and washable, please leave it dry before reinstalling. The brush side can wipe off surface dust on HEPA (recommend replace every 3-6 months); blade side can remove tangled hair on beater roller of the lightweight vacuum cleaner. Easy Storage & Two Charging Ways The cordless stick vacuum is wall-mountable and can self-stand; the 2 holder docks on the mount are for organizing the accessories. Powerful stick vacuum with two charging ways: Charge it separately. Charge it when it is inserted into the main motor. What You Get Extra HEPAVacuum MotorA Flexible HoseCleaning GadgetRetractable TubeOne Battery PackFloor Brush HeadManual & User-guideAdapter & Wall Mount2-in-1 Brush & Crevice Tool",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71a5d04c-48de-452b-886f-1023e8f8068f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c62ae26-af89-4ebc-ac11-5eb32371e545.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9171f804-8654-4c1f-a9e0-065c5d648f43.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Useful tips for using a vacuum cordless - A little care can add years to the vacuum's life. Use matched adapter for charging, otherwise, it might cause not charging. Make sure every component is well-installed; a proper-sealed system ensures the vacuum's decent performance. Empty dust cup and clean filters, doing a general clean-ing help the hardwood floor vacuum work properly. Keeping the filter clean helps improve filtration efficiency. You can rinse a Metal or plastic filter, and can gently knock a paper or fabric one to shake off clinging debris. If the stick vacuum cleaner cordless does not work well, check and clean it if there is any blockage in the tube, brush roll, and filt-ers.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08ea51e8-f225-47d3-a116-7dc5f92bc0bf.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2aaadb99-b79f-4f25-9f7c-21de283c99cb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/758d127b-a73f-4f19-9df6-fe49fc0087b4.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30b6a0d9-a4c9-49f9-b473-b5ed38fbfdc2.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/17526679-db9f-430f-94de-1f090af9b9b1.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/de0c8bab-33f4-4e68-a23c-29833d22edce.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/551ea60c-1607-472b-9e16-4ece07af8a46.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c8d5f70-0bd6-426a-b4d6-efd68efc9e05.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/71a5d04c-48de-452b-886f-1023e8f8068f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c62ae26-af89-4ebc-ac11-5eb32371e545.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9171f804-8654-4c1f-a9e0-065c5d648f43.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/08ea51e8-f225-47d3-a116-7dc5f92bc0bf.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TigerFishTigerFish",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4THZZUNMLHGAQA4O7MKO3DDVQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R122M3RN4AGIH2?ASIN=B0CK5ZMW6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome heavy duty cordless rechargeable and powerful stick vacuum",
                "reviewText": "I am amazed at the high quality and all the features this stick vacuum has. I looked at a lot of vacuums before deciding on this one. I am very satisfied with everything about this vacuum, from the color and looks of it, the 26000Pa strong suction and 350 watt brushless motor, the three stage filtration system and attachments included, and how well it handles and performs. It is actually fun to use and I now I don't need to use a broom and dust pan anymore! The cleaning possibilities are endless with all the included attachments and the cordless freedom! I opted for the kit that also has the hose attachment which I feel gives me so much more flexability when cleaning using the crevace and brush attachments. There are three levels of filtration which include a Hepa filter, a foam particle filter and a stainless steel honycomb filter. I was really surprised at all the dirt and dust this vacuum picks up and is collected in the filter system. I mainly use this vacuum on my hard floors although it seems like it will also clean carpets too. Having a cat there are always litter particles and hair on the floors which this vacuum picks up perfectly. There are two speeds which both seem powerful enough to pick up debris but I splurge and mainly use the higher speed. I also like having the light on the main roller section which really helps me see the dirt and debris on the floor especially if the room light is turned off. The large wheels on the vacuum roller section are heavy duty with great traction on them and the move smoothly. This vacuum is lightweight even though it looks and is heavy duty. I also like the roller section locking in the upward position when needed especially when storing the vacuum or lifting it up and moving it to another area. I have a cheaper stick vacuum that does not have this feature and the base just dangles which I don't like. I can tell there was a lot of research and development that went into designing this vacuum and it really shows in it's features and how well it functions and handles. The charging cord plugs into the battery on the vacuum which I really like instead of it plugging into the storage base like my cheaper one does. When it is charging there are lit flashing blue arrows that show it charging and once it is fully charged all the arrows are lit solid blue. There is even a spare Hepa and foam filter included and a great user manual. As with all electronics I purchase on Amazon I also purchased a three year protection plan with Asurion which I recommend to others. This is an awesome cordless vacuum that I highly recommend to everyone else.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61Z6PYyKafL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+aSPYPRIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711wulOeTiL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/7195kzhvhKL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/719yp9VSJSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71WYjYN5DXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71cGAkCVPuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71obMMi8xgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vt1gorcvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erob",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUNRVFSKLNOVWJWBY637EMNV62Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33TWAHR60CLXM?ASIN=B0CK5ZMW6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Lightweight, no cord, good suction - even for pet hair!",
                "reviewText": "I was skeptical, thinking this vacuum wouldn't be enough power for our pet hair or wouldn't be very functional, but I was wrong. It has been such a quality of life improvement (as strange as that may sound). No more sweeping with a broom and kicking up dust, and no more lugging around a heavy, awkward, corded vacuum and plugging/unplugging it room to room.We have two cats, one of whom sheds tufts of hair constantly, and this vacuum picks it all up - even on the low power setting (I never even need to use it on high, which is good because that's much more of a battery drain).I use the vacuum every day. When it's just quick daily clean up, a battery charge lasts 2 or 3 days/uses. When it's a more thorough weekly cleaning, upstairs and downstairs, then I just barely have enough charge to finish the entire house, which is why some people end up getting a second battery. But for its effective suction, light weight mobility, lack of annoying cord, maneuverability, and ease of emptying, it's more than worth the price of the unit and a second battery (if you need one).I also love that it has multiple filters including a HEPA filter, and the various attachments work great and are really easy to attach/detach. The front light is quite helpful, too.It literally felt like our house smelled and felt cleaner after we started using this vacuum. It's actually fun to use and no hassle...I just turn on a podcast and swivel around the house with it. Definitely recommend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suzy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOXKFYBBLVWZN6KVCY4N6VGXAHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9YZK7F2UZKJB?ASIN=B0CK5ZMW6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2023",
                "reviewTitle": "5.0 out of 5 stars 5 star",
                "reviewText": "First of all, I’m a senior citizen who is on oxygen 24/7 and have a rescue Maine Coon. I love the fact that this is cordless as my old vacuum cord and oxygen cord constantly entwined and I had to stop continually to sort out. The vacuum is extremely light and maneuverability is outstanding. The vacuum is easy to put together with clear instructions/illustrations. I had vacuumed about eight hours earlier with my old vacuum before testing this one and did not expect the results I received. First of all, it’s extremely quiet and I was afraid the suction wasn’t very strong. I was shocked, the dust collector was completely full. This vacuum not only cleaned up cat fur and litter left behind by my old vacuum but completed the task quickly and quietly. Five stars, what a wonderful invention. It’s also easier to store when not in use.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MichaelMichael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFACFIM5474MYK7VNSOKV27WA5CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REI7BQF846SYH?ASIN=B0CK5ZMW6S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 1, 2023",
                "reviewTitle": "4.0 out of 5 stars Bought this to replace an older traditional vacuum cleaner.",
                "reviewText": "Very lightweight, easy to use. Very happy with it. May purchase another for summer home. Impressed with the power and suction.I like the blue color. Easy to assemble, and easy to attach to the wall for easy storage. Well worth the money.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61rKVsorEJL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mel H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ46VYXYXS3XRO6ZBI5VA6KGQTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26MM1V29QPXJZ?ASIN=B0CK5ZMW6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect light weight and powerful!",
                "reviewText": "This vacuum is exactly what I needed and not too expensive. It saves me so much time for those quick kitchen clean-ups when I’m cooking and after meals. I love it! Recommend!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Hollitsch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH227EJZK24C7XIEDKSJV2BB65VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIQDB983A8VHT?ASIN=B0CK5ZMW6S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 4, 2023",
                "reviewTitle": "5.0 out of 5 stars Pleasantly surprised",
                "reviewText": "I have looking and researching for a long time for a light weight cordless vacuum. My friend had a shark cordless vacuum and loved the suction power. Then Poweart cordless vacuum was the deal of the day on Amazon. I took a chance due to the positive reviews. I was pleasantly surprised at the quality and suction powder. The battery lasted about 45 minutes a little less if using the higher power button. Easy to empty and clean dust collection cup. It was easy to detach and have a small hand held and great for cleaning up cat litter and pet hair, which was my main purpose. Couldn't be happier.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}