{
    "remaining_requests": 32351,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Rowenta-Container-technology-Automatic-Detection/dp/B0CMV11W8M",
    "body": {
        "name": "Rowenta X-Force Flex 15.60 Cordless Stick Vacuum 30.4 Ounce XL Dust Container, Flex technology, Automatic Floor Detection, 80 Min Run Time, 3 Hour Charging Time, For Pet, 230 Air Watts Black & Copper",
        "price": "$549.99",
        "originalPrice": "",
        "rawPrice": 549.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Rowenta-Container-technology-Automatic-Detection/dp/B0CMV11W8M",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNRSJXK4"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CMV2BJKN",
                "variationName": "Style",
                "variationValue": "30% more suction, 70 Minutes",
                "price": "$499.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CMV11W8M",
                "variationName": "Style",
                "variationValue": "50% more suction, 80 Minutes",
                "price": "$549.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0CMTZF1XJ",
                "variationName": "Style",
                "variationValue": "Strong suction, 45 Minutes",
                "price": "$399.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418-hw8 nmL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41 zUwUeDhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/411WfMAqHSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41TtNsjygQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51b73EFnklL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51PPk3prV-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WjYU8PoKL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Rowenta Store",
            "link": "https://www.amazon.com/stores/Rowenta/page/38DEDA67-5202-4947-9CD6-8ED09735BCDE?ref_=ast_bln"
        },
        "brand": "Rowenta",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 38,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 23 hrs 13 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Reach the unreachable: Experience hassle-free floor-to-ceiling vacuuming with Rowenta's cordless X-Force 15.60. The Flex technology lets you vacuum everywhere, even under low furniture or in hidden areas, without bending. Once you try it, you'll love it!",
            "Best-in-class cleaning performance: Feel the outstanding suction power up to 230 Air Watts*, witness the best-in-class dust pick-up even in low-light areas with Power LED Vision head. Efficient on all surfaces, X-Force exceeds expectations on hard floors",
            "Longest run time: Clean your entire house with 1hr20min of uninterrupted vacuuming. Your X-Force, powered by Rowenta's strongest battery, may feel heavier during prolonged use, yet its unmatched efficiency makes it perfect for your demanding tasks.",
            "Intelligent cleaning: X-Force automatically detects floor types and adjusts suction power with auto speed. Pull the boost trigger for an extra shot of power. Enjoy optimized cleaning results and battery lifetime at your fingertip!",
            "Home, car, and pet accessories: Use the handheld to tackle pet hair at home or in the car with the Animal LED Turbo brush. Two built-in easy brushes ensure instant and spotless cleaning on any surface. Reach every nook and cranny with the crevice tool."
        ],
        "description": "Delivering outstanding dust pick-up performance with ultimate flexibility, Rowenta X-Force Flex 15.60 offers a modern cleaning X-perience like no other! Reach the unreachable, from floor to ceiling, with the flex technology, letting you vacuum everywhere, even under low furniture or in hidden areas, without bending over. Your X-Force 15.60 features an outstanding suction power up to 230 Air Watts*, a Power LED Vision head for robust dust pick-up even in low-light areas and a 1hr20min** battery run time for uninterrupted vacuuming. It automatically detects floor types and adjusts suction power with the auto speed while presenting a boost trigger for an extra shot of power. With a large kit of accessories, this Animal Care model offers ideal cleaning solutions for pet owners. *using boost mode **when using the handheld in Eco mode",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3743521"
            },
            {
                "name": "Stick Vacuums & Electric Brooms",
                "link": "https://www.amazon.com/stick-vacuums-electric-brooms/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510112"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Rowenta"
            },
            {
                "name": "Special Feature",
                "value": "Automatic Floor Detection, Cordless, LED Headlights, Foldable, Bagless, 2 Built-In Surface Brushes"
            },
            {
                "name": "Filter Type",
                "value": "Foam"
            },
            {
                "name": "Included Components",
                "value": "Cordless Vacuum, Extra Filter, Charging Dock, Animal LED Turbo Brush, Crevice Tool"
            },
            {
                "name": "Is Cordless?",
                "value": "Yes"
            },
            {
                "name": "Capacity",
                "value": "0.9 Liters"
            },
            {
                "name": "Wattage",
                "value": "320 watts"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Indoor"
            },
            {
                "name": "Form Factor",
                "value": "Stick"
            },
            {
                "name": "Color",
                "value": "Black & Copper"
            },
            {
                "name": "Model Name",
                "value": "X-Force Flex"
            },
            {
                "name": "Product Dimensions",
                "value": "14.99\"L x 4.95\"W x 11.57\"H"
            },
            {
                "name": "Manufacturer",
                "value": "Groupe SEB"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Controller Type",
                "value": "Hand Control"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Style",
                "value": "50% more suction, 80 Minutes"
            },
            {
                "name": "Portable",
                "value": "Yes"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Item Weight",
                "value": "7.5 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CMV11W8M"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "RH99F2U1"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 38 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#122,313 in Home & Kitchen (See Top 100 in Home & Kitchen) #238 in Stick Vacuums & Electric Brooms"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Surface Recommendation All floors",
                "value": "Power Source Battery Powered"
            },
            {
                "name": "Voltage 120 Volts",
                "value": "Item Weight 7.5 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "BEST-IN CLASS VACUUMING FROM FLOOR TO SURFACES TO HOME FURNTITURE TO CEILING",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c4e53824-e449-4624-b1ed-40155abecc2a.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/21ad3ec2-b361-4ccd-9f7f-8d182ba4f191.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fbcfd6c3-cd2c-49e7-99e1-42f8714038bb.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/be53b2d7-6e67-423c-ba47-6b67be90d4de.__CR0,0,440,440_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "ULTRA-PRECISE MONITORING CONVENIENT DETACHABLE BATTERY HANDY REMOVABLE ROLLER XL REMOVABLE DUST CONTAINER",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/dcbf6ca0-e1d0-49f8-8dbd-18ea62b4af0a.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a339b0b7-ec9e-40cd-9b9e-dda690ac953d.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1abca765-e51d-47e9-8c9e-d4310f884d36.__CR0,0,440,440_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/8cdb49d9-b9cc-4094-aefa-23332b28a668.__CR0,0,440,440_PT0_SX220_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/26e21a36-9933-4c81-ace2-ff155b694d09.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c4e53824-e449-4624-b1ed-40155abecc2a.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/21ad3ec2-b361-4ccd-9f7f-8d182ba4f191.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fbcfd6c3-cd2c-49e7-99e1-42f8714038bb.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/be53b2d7-6e67-423c-ba47-6b67be90d4de.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dcbf6ca0-e1d0-49f8-8dbd-18ea62b4af0a.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a339b0b7-ec9e-40cd-9b9e-dda690ac953d.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1abca765-e51d-47e9-8c9e-d4310f884d36.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8cdb49d9-b9cc-4094-aefa-23332b28a668.__CR0,0,440,440_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c304552b-738c-47ea-9f18-7a9880f2cf76.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ff101954-1487-412b-974b-03ca596529a2.__CR0,0,1940,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KNDY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHACJP2M7R2B7MYBOYYU2X62E7FQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BO4MIR3HDDOT?ASIN=B0CMV11W8M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars The best stick vacuum I have tested and used! Recommended!",
                "reviewText": "Cordless stick vacuum's, I have to say that while I use them, they were never in the same category as regular vacuums. While they worked great on flat surfaces and short rugs, those with longer fibers, they weren't' that good at all.Well, I have heard all the news about the Rowenta X-Force Flex having one of the strongest suctions for a cordless stick vacuum. So, I figured, let's give the Rowenta X-Force Flex 14.60 Cordless Stick Vacuum a chance because I need something to change my mind about them. That they are good and worth it and are not going to cost over a $500.So, what are the key points of the Rowenta X-Force Flex 14.60 Cordless Stick Vacuum?DesignWell, for one. It's not you're typical stick vacuum as this one bends, so you don't have to bend. I also like the overall aesthetics of black and silver. Very nice!SuctionOK, so the Rowenta claims that it's 200 Air Watts. Again, many stick vacuum companies say how powerful the suction is but yet they can't do suction on carpets that are not flat and have fibers.Having tested the Rowenta X-Force Flex 14.60 Cordless Stick Vacuum, I can easily say that this is the best stick vacuum I have used. The suction is incredible and things that were on my long fiber black rug, this one worked magnificently well!Battery Run TimeWhat I look for is one that can run a long time in the highest vacuum setting and some last 15 min. to 30 min. This one has a 70 min. run time and a 3 hour charging time. Rowenta also offers one that does 50% more suction for 80 minutes for $50 more.But I am impressed so far with this vacuum. It is definitely lasting longer than the others I've tested.AttachmentsYou get a good number of attachments and you also get an extra filter, a charging dock, animal LED turbo brush and a crevice tool. Not as much as other companies but personally, this is all you need.LED LIGHTSThis vacuum has LED headlights! How awesome is that! Very awesome indeed!JUDGMENT CALL:The Rowenta X-Force Flex 14.60 Cordless Stick Vacuum is the best stick vacuum I have used! It's changed my perspective towards them because so many I have tested, they are not that great. But this one exceeded my expectations in terms of suction (magnificent!) and battery charge time.Granted, it is a bit more pricier than other stick vacuums but you get what you pay for and this one, works way better than other stick vacuums I have tried.The addition of LED headlamps, automatic suction power adjustments by floor type and the front portion spins, unlike some others out there. Makes it easier to clean off long hair.The vacuum was easy to use and easy to charge and easy to empty. Some may not like how you need to charge it, as it comes with a charging adapter that is meant to be screwed on your wall but for those who don't want to screw anything, you can just lay it down with the adapter charging it. This is not the kind of stick adapter where the cordless plug goes directly on the vacuum itself.Do know that I am reviewing the 14.60 version, the 15.60 version has even more larger suction and last 80 minutes.The Rowenta X-Force Flex 14.60 Cordless Stick Vacuum is no doubt the best stick vacuum I have tested and used! And I give it five stars!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffrey Van Wagoner",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH72MKMXSR2GECWKXS7F4J6UFCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19ZRNTXTODCZ2?ASIN=B0CMV11W8M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars I love it as much as or more than my Dyson",
                "reviewText": "I am somewhat of a vacuum connoisseur and often receive some type of vacuum for most birthdays and Christmas because I love them so much. I have been using Dyson stick vacuums for years on my entire house and love them, so I was excited to add Rowenta's version to my collection. I love it as much as my Dyson, and possibly more because of some unique features. If I could keep one of my vacuums, it would be this Rowenta. Here is what I love: - The most critical aspect of a vacuum is the suction power; this guy takes the cake. It feels more powerful than my Dyson, as I have to work hard to get it back and forth on the carpet. It also does an excellent job on my hard floors and seems to pick up more and spit out less than my Dyson, especially on the backstroke. - The battery life is excellent. It does wear down quickly when vacuuming on carpet, but I can do my whole upstairs in one go without it dying. - The canister is easy to remove for emptying, and unlike the Dyson, you don't have to remove the stick to remove the canister- less work! - I thought that the bendable post to help vacuum under furniture would be gimmicky, but I actually do use it almost every time I vacuum and it really helps you reach further underneath and bend less. It's a cool feature. - I also thought that having lights on the head of my vacuum was silly, but I was surprised that I also use those when I go into a bathroom or something to do a quick vacuum and am too lazy to turn the lights on. - The vacuum and the post have a built-in brush on the end, so if you remove the post or the vacuum head, you can use the vacuum immediately without getting a brush attachment. - You shouldn't need strong fingers to vacuum, and this guy beat the Dyson out on that, too. The trigger is a squeeze to turn on and a squeeze to turn off, so you don't have to hold it down continuously like the Dyson, eliminating finger fatigue. It has a second trigger that activates the boost, so if you come across a particularly messy spot, you can get a quick boost of extra suction without having to stop and switch modes. - The wall mount for the Rowenta is excellent: low profile, easy to install, and holds the vacuum along with both attachments very securely while also allowing for quick removal. The vacuum comes with a crevice tool and a furniture tool, and along with the built-in brushes, you really don't need anything else. - I often remove the roller on my brush heads for cleaning and to remove hair that gets wound around it, and this vacuum makes it very easy. Unlike the Dyson, which requires searching the house for a quarter to unscrew the roller, the Rowenta has a built-in handle that flips out and allows you to remove the roller in seconds. - The brush head has rubber sides, which can sometimes be annoying because they \"stick\" to the wall occasionally when vacuuming, but it means your kids (or you) won't bash up your walls and furniture when it's their turn to vacuum! After writing this review, I couldn't figure out why I still reach for my Dyson almost as often as I do the Rowenta. Well, the answer is this: the Dyson is lighter. I don't know how much lighter it is ounces-wise, but it feels lighter and easier to push, so I often reach for it for a quick pick-up or when I am having my kids vacuum. It also has a larger canister so I can empty it less often. The extra suction power and battery life of the Rowenta come at the cost of its being slightly heavier, which is not a high price to pay. I love them both, but the Rowenta does have some novel and convenient features that put it a step above. Not to mention, it looks gorgeous with its sleek black form and shiny rose-gold accents.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}