{
    "remaining_requests": 32484,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cordless-Cleaner-Brushless-Detachable-Hardwood/dp/B0CSSTY858",
    "body": {
        "name": "Cordless Vacuum Cleaner, 25Kpa 210W Brushless Motor Stick Vacuum with 35 Mins Long Runtime Detachable Battery, Perfect for Hardwood Floor Pet Hair",
        "price": "$129.99",
        "originalPrice": "",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cordless-Cleaner-Brushless-Detachable-Hardwood/dp/B0CSSTY858",
        "soldBy": {
            "sellerID": "A2GC1XP38HWB6F",
            "name": "Cordless Vacuum Cleaner",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2GC1XP38HWB6F&asin=B0CSSTY858&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CVH4HKJ5"
        ],
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $20 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51kcvIBoygL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/516brhIshPL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51N01BFfXtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61Eaz2silfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/512nWqn31uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61xM1dE-inL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61ZbqY8gdOL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brand: Foppapedretti",
            "link": "https://www.amazon.com/s/ref=bl_dp_s_web_0?ie=UTF8&search-alias=aps&field-keywords=Foppapedretti"
        },
        "brand": "Foppapedretti",
        "merchantInfo": "Cordless Vacuum Cleaner",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 18680,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Friday, February 16. Order within 17 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "【CORDLESS VACUUM CLEANER WITH POWERFUL SUCTION】 Upgraded 210W brushless motor generates a high-speed airflow to provide up to 25Kpa crazy suction in max mode. Two suction speeds can be switched freely to meet your various cleaning needs(debris, dust, crumbs, pet hairs, etc.) on sofas, hardwood, marble floor, fluffy , rugs and tile floor, giving you a quiet and efficient cleaning experience.",
            "【DETACHABLE LARGE CAPACITY BATTERY&35 MINS RUNTIME】The stick vacuum cleaner has 2200mAh large capacity rechargeable and a detachable battery that can run for 35 minutes on standard mode and 15minutes on max mode. A cordless vacuum is not only suction-powerful but also provides longer working time and longer life than other brushed vacuum cleaners, thus ensuring an efficient cleaning of the whole house. The battery can be charged singly or on its main body. Convenient and safe!",
            "【FLEXIBLE MOTORIZED LED FLOOR BRUSH】LED lights help the stick vacuum illuminate all dark areas and track dust and dirt. Swivels 150°sideways and swivels 90°up and down so you can clean your home in all directions. stiff/soft bristles are integrated on a tangle-free roller that rolls up dirt and is perfect for protecting various surfaces.",
            "【HIGH-EFFICIENCY FILTRATION SYSTEM】Household vacuum cleaners with a 4-stage fully sealed cyclone filtration system capture 99.99% of dust particles as small as 0.3micro. With a high-efficiency HEPA filter and high-density mesh filter combined, avoid the motor being blocked by microdust, It can provide ultimate purified air for you families. Just need one button to empty the dustbin, protecting your hands from dirt.",
            "【MULTIFUNCTIONAL VACUUM CLEANER】This handheld vacuum equipped with motorized brush, extension tube, 2 in 1 brush nozzle, which can be assembled into 6 combinations. With a long extension tube, this hand vacuum cleaner can be converted to the handheld mode in seconds. The long stick is suitable for a large area cleaning and the handheld mode is for cleaning the surfaces, sofa, bed, corner and cars, etc. Meet all your daily cleaning needs."
        ],
        "description": "TECHNICAL SPECIFICATIONS: 1.Power: 210W 2.Two Modes: 25KPA/ 18KPA 3.Running Time: 15 Mins high speed, 35 Mins low speed 4.Fast Charging Time: 3.5h 5.Dust Cup: 0.55 L 6.Product Net Weight: 5.5lb PRODUCT FEATURES 2 Speed Suction Power ---Easy to clean dirt and dust particles to different cleaning needs 25000Pa Powerful Suction --Cordless stick vacuum easily Remove the Deep-Seated Dirt Long-Lasting Using Time ---Offer up to 35 minutes working time,One full charge = whole house cleaning 4 Stages Filtration System + Washable Filter System --- Vacuum for pet hairs captures dust and particles to 0.3 microns Motorized Brush with LED Light ---Enable you to glides across all floors and the front LED lights make it easily to see the dust under furniture or in hard-to-reach corner Low Noise and Lightweight Design --Vacuum broom ultra-quiet operation sound avoids annoying noise,weighing only 3.5Lbs easily converts to a handheld Hard & Soft Brush Roller --Vacuum cleaner suitable for Different Ground(Hardwood,Low&mid-Pile Carpet, Tile,Marble) FOR BETTER USE: 1. Please use the original adapter to charge the battery cordless powerful vacuum 2. Please clean the filter and keep dry after each use to keep a good function of the stick vacuum cleaner cordless. 3. Please confirm the brush head, cup and filter are installed correctly before use the portable vacuum cordless. 4. Please don't use the cordless floor cleaner to suction anywhere with water!",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b?ie=UTF8&node=3743521"
            },
            {
                "name": "Stick Vacuums & Electric Brooms",
                "link": "https://www.amazon.com/stick-vacuums-electric-brooms/b?ie=UTF8&node=510112"
            }
        ],
        "productInformation": [
            {
                "name": "Special Feature",
                "value": "Cordless"
            },
            {
                "name": "Filter Type",
                "value": "HEPA Filter"
            },
            {
                "name": "Included Components",
                "value": "Batteries included"
            },
            {
                "name": "Capacity",
                "value": "100 Grams"
            },
            {
                "name": "Runtime",
                "value": "15 minutes"
            },
            {
                "name": "Color",
                "value": "‎2024 New Upgrade 13"
            },
            {
                "name": "Model Name",
                "value": "‎Cleaner 13"
            },
            {
                "name": "Product Dimensions",
                "value": "‎17.5\"L x 13.5\"W x 5.3\"H"
            },
            {
                "name": "Manufacturer",
                "value": "‎Foppapedretti"
            },
            {
                "name": "Controller Type",
                "value": "‎Push Button"
            },
            {
                "name": "Control Method",
                "value": "‎Touch"
            },
            {
                "name": "Item model number",
                "value": "‎Cleaner 13"
            },
            {
                "name": "Item Weight",
                "value": "‎6 pounds"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "‎17.5 x 13.5 x 5.3 inches"
            },
            {
                "name": "ASIN",
                "value": "‎B0CSSTY858"
            },
            {
                "name": "Date First Available",
                "value": "‎January 19, 2024"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 18,680 ratings 4.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#124,856 in Home & Kitchen (See Top 100 in Home & Kitchen) #241 in Stick Vacuums & Electric Brooms"
            },
            {
                "name": "Surface Recommendation Hard Floor",
                "value": "Power Source US PLUG"
            },
            {
                "name": "Voltage 220 Volts",
                "value": "Item Weight 6 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Elizabeth Zigmont",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMNHZQEX2OV6B5W2KES2TAO656A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W0LGSE83EQA5?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Vacuum, beautiful product!",
                "reviewText": "I love this stick vacuum! Thses are the reasons:Very good value for the money.For a small stick Vac it has incredible cleaning power, it truly picked up much of the dirt, dust that is ground into this carpet.Very Light weight unit, easy to use and get into tight or difficult areas where you may not be able to moveheavier furniture by yourself. So it is perfect gift for perhaps older or senior or people with health issues who can not use a heavier vacuum. As well as College Students who are always on the go or committed to their studies and have little time to spare. since it makes cleaning easier and will give students an incentive to NOT neglect their living areas and take 10- 15 mins just to tidy up on a daily basis.Easy clean up and maintenance! The dirt container easily detaches from the mounting clips so you may access the small HEPA filter and dump all the Dirt ad Debris into the garbage.Easy storage with the wall mount. It takes up very little space when you need to store it while not in use!Great Vacuum, beautiful product! Buy it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXUQ4JCX2BAQQUP4IKR77VMGMJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R136YLMH6079U3?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Delightful little thing",
                "reviewText": "I was surprised about how small the box was and how light and tiny this vacuum is! It is also at least half as loud as my full size upright unit. I bought this vacuum specifically for my laminate kitchen floor. I have 2 furry dogs and I wanted to pick up hair, dirt, and leaves that are stuck to their fur that mostly land on my kitchen floor when they come in from the yard. Just tried it out for the first time and it did an awesome job!Easy to take apart/empty and I used the hand held to get dog hair off my couch. I feel like this is a perfect vac for small jobs when you don't want to get the regular vac out.Absolutely prefer this over a broom when I just want to \"\"sweep\"\" up the kitchen floor.I can even now vacuum my bathroom, which is too small for the bulky upright and is not a good fit for my Rumba. I love the robot vac, but it's obnoxiously loud, and it does require neat floors, which is not always the case for me. So, with this new thing, I can quickly do a touch-up, and be done with it!I also own a pricy handheld Dyson, but got too tired of bending down for a more thorough floor coverage, and don't want to pay for expensive attachments.This is definitely one of the best things for home this price can get you these days! Thank you!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kristine blond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVWMSONUNGCHNWUZZJCAJBPUJVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CNM06L7ZV9IO?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars I love this vacuum!",
                "reviewText": "When my boyfriend and I moved into our apartment we realized we needed a better vacuum than the cheapest one sold at Walmart to keep the floors clean. I was looking for a more economical option than a Dyson and I am very pleased with this purchase!We have a cat and the floor was always dirty with cat hair, cat litter, etc. This vacuum is a lifesaver!It’s exactly what we needed, som ething flexible, easy to use, and no annoying cords when your trying to get around corners. I can vacuum daily without it being a hassle and the brush attachment is also great for keeping our couch clean!I have had it for about a month now and it works very well. The battery life is good. I am able to vacuum my entire apartment before the battery dies with juice to spare. The vacuum is easy to clean which is great for homes with women with long hair. It’s also a very beautiful product and easy to use.Overall this vacuum is the perfect fit for someone on a budget who wants to keep their house clean, especially with pets!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "stephanie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAD7LAHSJYXIFK7UMP4XJJHCDPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15NY1IYO6L76C?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect for dust bunnies!!!",
                "reviewText": "I will say out right this little Stick Vac does an excellent job in cleaning and is much more vacuuming pick up power than I had figured on.I live in a 2 bedroom apartment, with a small living room and a kitchen with linoleum floor.The first day I used my Stick Vac it performed very well out of the box, the amount of dust and dirt the Vac picked up was amazing.The motor and housing assembly also contain the detachable canister where the debris is collected, until the receptacle is cleaned out.The unit is light weight, so it is easy to maneuver in tight areas and is perfect for carpeted or hard floor steps.As far as cleaning under couch furniture cushions and around the bed areas where dust and dirt tends to collect around the post or caster feet of the frames or Chest of drawers, the attachmet does a smash up job in quickly cleaning those hard to reach areas.It is a great cleaning tool for the money and an excellent value for the price I paid!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tania Toganidou",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFRAV5SXITHY5JT6LIYFSONO7XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVWJTDWY8P79A?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Life changing vacuum",
                "reviewText": "This vacuum is great and exactly what I was looking for. This has been a welcome change from the clunky vacuums we've had in the past or the compact ones that don't even work.The assembly of the vacuum was pretty easy just pay attention to which button detaches which part or you may accidentally create a dust pile.It's fairly lightweight which makes it easy to m ove around the home as the whole vacuum or just the handheld piece.It’s a very strong vacuum, it has high and low speeds.It also charges up pretty quickly which is a welcome bonus. One charge is enough to clean my whole apartment.It has a convenient light when vacuuming so you can see what exactly is picked up/ still needs to be picked up.Love that it comes with a wall mount as well to give it its own little area.I really enjoy this vacuum and a cheaper alternative to oth er more expensive vacuums. I no longer need to sweep my floors!Overall fantastic product, especially for the price.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Audrey Hodge",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNZDX7CSCPHAINT4P7VQQDN5KWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H8G9GRCG0YVL?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Cordless vacuum",
                "reviewText": "I am updating my review of this product. My original experience with this vacuum stated the suction was poor. The company reached out to me and their attempt to make it right was honorable. They indicated the vac might have been malfunctioned or had an issue with the operation and they sent me an entirely new one. The new vac appears to working fine at this point, so I am now satisfied with the product and would recommend it to others. Thank you Voweek customer service for making this right :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Adelaide",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5VDNE2WT2WW73NN66ZVHUHE3NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G5RSA67797V9?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Very Happy With This",
                "reviewText": "Very lightweight and works very well!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Adelaide",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5VDNE2WT2WW73NN66ZVHUHE3NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VAG8I8MCQT2B?ASIN=B0CSSTY858",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Works very well on my area carpet's",
                "reviewText": "This isn't going to replace our main corded vacuum any time soon, but it's way less of a hassle for small dust and pet fur.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter van Dun",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on February 6, 2024",
                "reviewTitle": "Prima batterijen",
                "reviewText": "Goed nagekomen met een lange levensduur. Dat is wat ik wil! Snelle verzending!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexandre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 25, 2024",
                "reviewTitle": "Calidad Duracell",
                "reviewText": "Las pilas Duracell han sido un referente de calidad y rendimiento en el mundo de las pilas alcalinas durante décadas. Su reputación se ha ganado gracias a la durabilidad y confiabilidad que ofrecen, convirtiéndolas en una opción preferida por muchos consumidores. La marca ha logrado mantenerse a la vanguardia en tecnología de pilas, ofreciendo constantemente innovaciones que mejoran la vida útil y el rendimiento de sus productos.Una de las características más destacadas de las pilas Duracell es su capacidad para mantener una energía constante y fiable durante un período prolongado. Esto es particularmente importante en dispositivos de alto consumo energético, como juguetes electrónicos, controles remotos y dispositivos portátiles. La consistencia en la entrega de energía contribuye a una experiencia sin interrupciones, evitando la frustración de tener que cambiar las pilas con frecuencia.Además de su rendimiento, las pilas Duracell también han demostrado ser una opción respetuosa con el medio ambiente. La marca ha mostrado un compromiso continuo con prácticas sostenibles, incluyendo el desarrollo de pilas recargables y la promoción del reciclaje. Esto no solo beneficia a los consumidores al proporcionar opciones más ecológicas, sino que también contribuye al esfuerzo global por reducir el impacto ambiental de los desechos de pilas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Luna Wortmann",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 18, 2024",
                "reviewTitle": "Duracell geht immer",
                "reviewText": "Die Batterien funktionieren einwandfrei und halten lang",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 15, 2024",
                "reviewTitle": "Good value.",
                "reviewText": "Arrived promptly. Bought as a package with AA & AAA batteries. Seem to last much longer than regular batteries which is the point. We bought these as replacements for outdoor sensors. The AA Batteries in our outside sensors go off quite a lot and they are still working ten months later, so haven’t used the new ones yet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 11, 2024",
                "reviewTitle": "gute Qualität",
                "reviewText": "Ich habe immer wieder verschiedene Batterietypen ausprobiert, aber keiner davon war langlebig genug.Dieser Akku ist langlebig und sehr gut.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}