{
    "remaining_requests": 32535,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Shark-Professional-Lift-Away-Anti-Allergy-NV501/dp/B0091JG0LY",
    "body": {
        "name": "Shark NV501 Rotator Professional Lift-Away Upright Vacuum with HEPA Filter, Swivel Steering, LED Headlights, Wide Upholstery Tool, Dusting Brush & Crevice Tool, White/Red, 12, 18, 14.",
        "price": "$219.99$201.16",
        "originalPrice": "$299.99",
        "rawPrice": 219.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Shark-Professional-Lift-Away-Anti-Allergy-NV501/dp/B0091JG0LY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31Kq1pNTy1L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41l3D68tYfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51MmWdfBJZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51749NYcvpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DxzmDcRzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HzGREFMDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71M8LIo6lgL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Shark Store",
            "link": "https://www.amazon.com/stores/Shark/page/260F9B11-06D9-4F5D-953C-0FCE37C48DA8?ref_=ast_bln"
        },
        "brand": "Shark",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 18325,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19",
            "Or fastest delivery Thursday, February 15. Order within 7 hrs 29 mins",
            "FREE delivery Monday, February 19",
            "Or fastest delivery Saturday, February 17. Order within 15 hrs 14 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LIFT-AWAY FUNCTIONALITY: Detachable pod for cleaning under furniture or detach the nozzle to clean above the floor, on upholstery, furniture, stairs, and more.",
            "ANTI-ALLERGEN COMPLETE SEAL TECHNOLOGY: Works with a HEPA filter to trap dust and allergens inside the vacuum cleaner.",
            "ADVANCED SWIVEL STEERING: Easily maneuver your vacuum to get in and out of tight spaces, in corners, around furniture, and more.",
            "LED HEADLIGHTS: Powerful lights on the nozzle reveal hidden debris and pet hair around your home.",
            "WIDE UPHOLSTERY TOOL: The wide cleaning path helps remove pet hair, dust, and large debris from mattresses, couches, curtains, lampshades, and other delicate upholstered surfaces.",
            "DUSTING BRUSH: Dust and clean delicate surfaces, like fans, blinds, lampshades, and keyboards.",
            "CREVICE TOOL: Great for cleaning tight spaces, between couch cushions, and in hard-to-reach areas.",
            "WHAT’S INCLUDED: Rotator Professional Lift-Away Upright Vacuum, Wide Upholstery Tool, Dusting Brush & Crevice Tool."
        ],
        "description": "A lightweight 2-in-1 Lift-Away upright vacuum with a detachable pod for portable cleaning power. With the push of a button, Lift Away the pod and easily clean in hard-to-reach areas. This vacuum is also equipped with Swivel Steering for excellent control when maneuvering around furniture, and has a completely sealed system with a HEPA filter to trap dust and allergens.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3743521"
            },
            {
                "name": "Upright Vacuums",
                "link": "https://www.amazon.com/upright-vacuums/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510110"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Shark"
            },
            {
                "name": "Special Feature",
                "value": "Portable, Lighweight, HEPA Filter, Headlight"
            },
            {
                "name": "Filter Type",
                "value": "Foam"
            },
            {
                "name": "Included Components",
                "value": "Dusting Brush, 12\" Crevice Tool, Shark Rotator Upright Vacuum, Wide Upholstery Tool"
            },
            {
                "name": "Is Cordless?",
                "value": "No"
            },
            {
                "name": "Capacity",
                "value": "0.88 Quarts"
            },
            {
                "name": "Wattage",
                "value": "1200 watts"
            },
            {
                "name": "Hose Length",
                "value": "8.4 Feet"
            },
            {
                "name": "Form Factor",
                "value": "Upright"
            },
            {
                "name": "Color",
                "value": "White, Red"
            },
            {
                "name": "Model Name",
                "value": "Shark NV501"
            },
            {
                "name": "Product Dimensions",
                "value": "45.7\"L x 12.1\"W x 12.2\"H"
            },
            {
                "name": "Noise Level",
                "value": "80 dB"
            },
            {
                "name": "Amperage",
                "value": "10 Amps"
            },
            {
                "name": "Manufacturer",
                "value": "SharkNinja"
            },
            {
                "name": "Number of Items",
                "value": "2"
            },
            {
                "name": "Controller Type",
                "value": "Hand Control"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Style",
                "value": "Shark Rotator Professional Lift-Away (NV501)"
            },
            {
                "name": "Cleaning Path Width",
                "value": "9.5 Inches"
            },
            {
                "name": "Portable",
                "value": "Yes"
            },
            {
                "name": "Item Weight",
                "value": "15.5 pounds"
            },
            {
                "name": "Department",
                "value": "Floorcare"
            },
            {
                "name": "ASIN",
                "value": "B0091JG0LY"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "NV501"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 18,325 ratings 4.6 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,537 in Home & Kitchen (See Top 100 in Home & Kitchen) #7 in Upright Vacuum Cleaners"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Specific instructions for use",
                "value": "Above Floor Areas, Stairs, Carpet"
            },
            {
                "name": "Assembly required",
                "value": "Yes"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "Sharkninja five-year (5) limited warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Import",
                "value": "Made in USA or Imported"
            },
            {
                "name": "Surface Recommendation Hard Floor, Upholstery",
                "value": "Power Source Corded Electric"
            },
            {
                "name": "Voltage 110120 Volts",
                "value": "Item Weight 15.5 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/59ad7197-a267-46ef-a213-0099edef6877.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1a8e2692-8d82-408a-b78f-1f078db5751d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8eab76ce-2cba-414d-9c34-4312d72b5fc0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a6c89218-a360-43f8-9c86-2166dfb63c73.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/511eec9a-33e3-4d26-a9de-59ff83c45254.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/14b6184c-2051-4586-b48e-df620f86836c.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e10c7a20-c861-4050-bd48-1bda64482e1d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d6f2056d-63ff-42d7-976d-efcbabcb9640.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Steve C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBIOZN4TIUKAACRBXW4ZUUYZZWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26QON77IP9K29?ASIN=B0091JG0LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Even with a couple issues, still the only vacuum I’d buy",
                "reviewText": "This is the second time I’ve bought this model, the last one lasted almost 11 years. It’s not heavy, easy to clean, great suction, great for dog hair, the extendable hose reaches plenty far, I like that it swivels now, and the attachments are easy to use. Great on both carpet and floors. First issue: this model no longer comes with that power brush attachment (but it looks like the Shark website may offer one for $25-$30 bucks). For a “professional” model that should handle just about anything, it’s very disappointing to see that attachment no longer included. Second issue: not great on stairs. Parents and pet owners can attest to how much the stairs can take a beating sometimes. None of the attachments are ideal for the stairs, particularly for pet hair, but are ok. I’m actually using my old power brush attachment (didn’t fit perfectly on the new model but a little duct tape on the end of the attachment worked like a charm). Overall I would still highly recommend. We’ve had Dysons before and this Shark does just as well, for half the price.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jasmine rhodes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYXU5Y7T5PKA26FRTN2NGVMBO3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18N8TSDPVECMI?ASIN=B0091JG0LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Best vaccum",
                "reviewText": "This is my second one of this vaccum (had old one for almost 8yrs before replacing). I have a family of four and multiple pets and this is by far the best vaccum. I have owned many different brands and this one is my favorite. Its cleans great, it's pretty light weight and has multiple attachments. I also love how long the cord is. It makes life so much more simple to be able to vaccum my whole main living area carpet and tile without having to keep unplugging and plugging back in. I also love how well it works on all types of flooring. I will be devistated if they ever stop making this model lol",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "wordsmith246",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3TEON5POB6F6G6OWTNPFHV5XHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PAREBVFJXR75?ASIN=B0091JG0LY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2012",
                "reviewTitle": "5.0 out of 5 stars Wow!!!",
                "reviewText": "A little background. I live with two cats. I have both hardwood floors and carpet. My furniture is velour with soft cushions. I use Tidy Cats clumping litter for two litter boxes. Tidy Cats is a round pellet type litter and it gets everywhere. The cats, while short haired, shed quite a lot and I've only just been keeping up with the shed fur with regular vacuuming, grooming and sticky rolls. In short I desperately needed a new vacuum, but which one? I could take out a thirty year mortgage and buy a Dyson, but everything I've read says that there are several very good alternatives available to this. Ok, so once again, which one? After reading Micheal Flux's(thanks Michael!) review and the fact that it's almost less than half the Dyson DC41 Animal Complete I decided to purchase the Shark.This is going to be in initial review of the machine, I'm hoping to update it as I use it more and more.First of all, I was surprised at how easy it was to put together. The unpacking took more time than the actual assembly. Second, the tools it came with are not only functional, but easy to maintain. The pet tool for example has an access hatch that allows you to clean or free anything caught on the brush. Lastly, it's lighter than I expected. I know that this may seem like a small thing, but after using it to clean my entire apartment I was glad for the lighter poundage.Ok, so now it's set up and we're ready to clean. It's very quiet as compared to my other vacuum. The swivel feature takes a little getting used to, but once you do this machine is just fantastic on floors. Cleaning up errant cat litter on hard surfaces or carpet and in between every little nook and cranny this vacuum took it all up and left nothing behind. Now it's not a miracle machine. I did have to go over some of the carpet areas more than once. Next I used the flexible brush wand to \"dust\" a bit. Window sills, curtains and ceiling corners were all left behind clean. I was impressed. But how well will it perform on my furniture. I eased into using the pet tool by vacuuming my recliner. It's a smoother cloth and the pet tool did remarkably well. No hair left behind. Ok, onto the couch and loveseat. Both collect a ton of pet hair. I put the pet tool to work and got the seat cushions and the arms of the couch. The tool is a bit large and can be tough to negotiate, but the learning curve isn't steep and I was soon cleaning everything well. On the softer back cushions it took several passes, but I expected that seeing as how the cushions are soft like pillows. I very much doubt that even the Dyson could have picked up every hair in one pass. It took a bit of time for me to finish both and as I later looked at them there was still a bit of hair on the back cushions, but I believe that to be my fault and not the vacuums.I only emptied the canister once and while it was nearly full the vacuum never hinted that it was running out of suction. It was easy to dump and then seal back up.Ok, now for the super final test. I pulled off my shoes and socks to see if I had missed anything and to see how well my new vacuum had performed. I walked everywhere I vacuumed and didn't step on one loose piece of litter. Wow!! Ok, now I'm impressed. I figured the carpeted areas would be ok, but hard floors can be difficult. I had to use a swiffer dry just to get all of the litter out of the corners when using my old vacuum. I was really impressed with the job it did on my floors.So, if you're in the market for a powerful versatile vacuum, take a serious look at the Shark.December 16, 2012 ******UPDATE!!******So after a few weeks with the Navigator I wanted to give an update. I used it a few times during the week and it gets easier to use and cleans better each time I use it. I thought that the pet brush was going to require a learning curve to use and while it does it's definitely a short one. I have been able to clean my couch, loveseat and recliner in two or three passes at this point. Now I want to give it a real workout. I let the vacuuming go for two weeks. I would dust pan up the loose litter from my cats, but no vacuuming. It was definitely a trial for all of us. At the end of two weeks I had enough shed cat hair on my couch to have made another cat and there was practically no corner of the apartment where there wasn't litter. Ok, this is a definite work out for any vacuum. I figured that there was no way that I was going to get all the cat hair up and have the floors pass my barefoot test. So I set the navigator to the task. I did have to make extra passes on the floor to get up all the litter, but it did get every piece up and the floors did pass my barefoot test. Next onto the furniture. Again extra passes were required to get at all of the cat hair and since I did let it go I had to give them an extra cleaning, but lo and behold everything is once again fur free. I am impressed. At this point I would have to wonder how much better Dyson or Miele would have to clean in order to beat the results I've been getting with the Navigator.",
                "reviewVotes": "563 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mla",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNK4B4RFOIF7TDCIZVOQYYCLNXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTPAEHWMNJ0PX?ASIN=B0091JG0LY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2019",
                "reviewTitle": "4.0 out of 5 stars Great little sucker!",
                "reviewText": "My last vacuum, a brand well-known since probably before I was born, started to literally fall apart (with pieces breaking off) and then stopped working completely after less than 2 years. So, after hours of research, I decided to give Shark a try, based on its excellent reviews.Wow - - this is a great vacuum!- The suction is incredible and easily controlled on the wand to accommodate any type of floor, from plain wood to thick carpet.- The swivel feature lets me get into smaller spaces and farther under my bird cages than any upright vacuum I've had before.- The push of a button releases the wand so you can get edges and baseboards immediately.- The first time I used it, I had to empty the canister 3 times in just 2 rooms, because that's how much hair and dog fur my old vacuum had failed to pick up only a few days before!- It's not annoyingly noisy, but it is loud enough to make my macaw run through his English repertoire, in addition to some of his own Macaw-ese!- it's incredibly easy to empty the canister and to remove and wash the filters.- Switching from upright to canister mode is quick and simple. You push a button, squeeze a hose, and slip on your attachment, if you want one.- My last vacuum was a \"xxxx Pro Pet.\" I found out the reason for the name after the 3rd use - - it made each room I vacuumed smell like \"Pet,\" no matter how many times I cleaned all of the filters. My Shark gives off no odor whatsoever, as should be expected.There are a few things that make it a bit less then 5 stars, in my opinion:- First and foremost, so much hair winds around the brush/roller that I have to unwind/pick it off after every time I use it. I don't know if there's a solution to this that's absent from the design, but I've never had this problem so bad in any other vacuum.- I have to keep watching the canister to make sure the dirt is blowing around inside it, because if it stops, it means there is a clog somewhere.- The location of the power switch is a bit inconvenient for me, as I have to bend down several inches to reach it and I have a bad back. Someone shorter than 5'9\" shouldn't have a problem, though.- A retractable cord would've been nice, although the item description did warn me of this ahead of time.All in all, I love my Shark and I highly recommend it (if you don't mind the whole \"hair around the roller\" thing). It's a great product and well worth the price!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "oscar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 25, 2022",
                "reviewTitle": "Excelente aspiradora",
                "reviewText": "Tengo 2 años con el y no he tenido ningun problema con el funcionamento. Lo que si es que hay que darle el mantenimiento de limpieza a las esponjas para que no el motor no se apague. Es un producto bastante bueno!!!! Vale la pena pagarlo!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kerry Ward",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2021",
                "reviewTitle": "Cleans well, hand tools have good suction",
                "reviewText": "So far I've been happy with it. It picks up cat litter with a lot less scattering than my old vaccuum and is pretty good at getting stuff at the edges of walls and in corners. The hand tools have good suction unlike my old vaccuum. The lift away canister feature is handy. I do find it feels a bit heavier to use than my old vaccuum because the full weight tilts forward onto the handle when vaccuming instead of the canister balancing on the base, but it does a good job.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carmen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2022",
                "reviewTitle": "Good but heavy",
                "reviewText": "The vacuum works well and has good suction, and I like the canister removal. I bought this as a replacement for my powerhead on my built in, thinking it would be easier to move around but it isn’t. It’s quite heavy and a pain on the stairs, and I find the cord a nuisance after being used to the built-in hose. Due to the size of my house I also have to move to different plug-ins in order to reach everywhere. If I hadn’t had experience with the built-in I probably would like this more, as it really does seem to suck up a lot of dirt. The other downside is that with the canister, you can’t reach underneath things like coffee tables like a can with the built-in powerhead. It’s easy enough to use the lift away feature to reach underneath things and do the stairs, but it’s just one more step in the vacuuming chore that is not my favourite!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 29, 2019",
                "reviewTitle": "Excelente",
                "reviewText": "Excelente producto, tengo dos perros y levanta perfectamente los pelitos. Mi casa se aspira todos los días y es ligera para traerla por toda la casa, incluyendo escaleras.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marlene Dezotto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 11, 2022",
                "reviewTitle": "Easy to use. Does the job",
                "reviewText": "Very good vacuum cleaner. Very pleased",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}