{
    "remaining_requests": 32263,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Greenworks-Brushless-Lightweight-Anti-Allergen-Filtration/dp/B0CK54QYSD",
    "body": {
        "name": "Greenworks 24V Brushless Stick Vacuum, Lightweight, Handheld, Pet, Anti-Allergen HEPA Filtration, Hard Floor, Carpet, Car, 4Ah Battery, Compact Charger",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Greenworks-Brushless-Lightweight-Anti-Allergen-Filtration/dp/B0CK54QYSD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CTFNSRXD"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CK54QYSD",
                "variationName": "Color",
                "variationValue": "450 Watt Motor-green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31qlATdZkyL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "500 Watt Motor-green",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31zqbBYqLXL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "500 Watt Motor-white",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31XRP9rr-UL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "HEPA Filter",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31UJpM5r-JL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31qlATdZkyL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41DK5ULLk3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PLHlRtVyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EYNcDg8cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vWt0wtsrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41B66EQOTjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81ngR3zUL4L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Greenworks Store",
            "link": "https://www.amazon.com/stores/Greenworks/page/5C80765D-E7F2-4A46-8619-88447C2DFF60?ref_=ast_bln"
        },
        "brand": "Greenworks",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 655,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "CORDLESS STICK VACUUM - 450W Brushless Motor with 3 power modes boasting up to 170 air watts of suction power.​",
            "LED DIGITAL SCREEN - Easily view run time, power modes and other messages on the LED touch screen.​",
            "24V POWERALL 4.0Ah BATTERY - HIGH POWER 4.0Ah Battery provides up to 45 minutes of run time when fully charged.​",
            "HEPA 13 GRADE FILTER - H13 medical grade air-tight sealing filter, traps 99.7% of dust, particles, allergens and viruses.​",
            "PACKAGE INCLUDING - (1) 24V Stick Vacuum, (1) 24V 4Ah Battery, (1) 24V Charger, (1) 2-in-1 Dusting Brush, (1) Crevice Tool, (1) HEPA Filter​"
        ],
        "description": "Greenworks 24V Lithium-Ion battery: Provides 20% more power and 35% more run-time, and delivers fade-free power with no memory loss after charging.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1/000-0000000-8675309?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2/000-0000000-8675309?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b/ref=dp_bc_aui_C_3/000-0000000-8675309?ie=UTF8&node=3743521"
            },
            {
                "name": "Stick Vacuums & Electric Brooms",
                "link": "https://www.amazon.com/stick-vacuums-electric-brooms/b/ref=dp_bc_aui_C_4/000-0000000-8675309?ie=UTF8&node=510112"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Greenworks"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Cordless, Headlight, Washable Filter, Bagless, HEPA"
            },
            {
                "name": "Filter Type",
                "value": "HEPA Filter"
            },
            {
                "name": "Included Components",
                "value": "Dusting Brush, Charging Dock, Crevice Tool"
            },
            {
                "name": "Is Cordless?",
                "value": "Yes"
            },
            {
                "name": "Capacity",
                "value": "0.5 Liters"
            },
            {
                "name": "Runtime",
                "value": "45 minutes"
            },
            {
                "name": "Form Factor",
                "value": "Stick"
            },
            {
                "name": "Color",
                "value": "450 Watt Motor-green"
            },
            {
                "name": "Model Name",
                "value": "SVG24L410"
            },
            {
                "name": "Product Dimensions",
                "value": "39.4\"L x 12\"W x 11.8\"H"
            },
            {
                "name": "Noise Level",
                "value": "75 dB"
            },
            {
                "name": "Manufacturer",
                "value": "Sunrise Global Marketing, LLC"
            },
            {
                "name": "Number of Items",
                "value": "1"
            },
            {
                "name": "Controller Type",
                "value": "Push Button"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Portable",
                "value": "Yes"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Item Weight",
                "value": "12.27 pounds"
            },
            {
                "name": "ASIN",
                "value": "B0CK54QYSD"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "SVG24L410"
            },
            {
                "name": "Batteries",
                "value": "1 Lithium Ion batteries required. (included)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 655 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#168,123 in Home & Kitchen (See Top 100 in Home & Kitchen) #551 in Stick Vacuums & Electric Brooms"
            },
            {
                "name": "Batteries required",
                "value": "Yes"
            },
            {
                "name": "Surface Recommendation All floors",
                "value": "Power Source Battery Powered"
            },
            {
                "name": "Voltage 24 Volts",
                "value": "Wattage 450 watts"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 THE NEW DEEP CLEAN 2 LED TOUCH SCREEN",
                "media_link": []
            },
            {
                "media_text": "Previous page Next page 1 2-IN-1 DUSTING BRUSH 2 CREVICE TOOL",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/544e6436-4b9b-4f3f-8995-9cfd55ce0583.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4e2ce5a7-4296-424e-b269-ed846e93be89.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b63f14bb-e847-4959-a891-c24a73afff24.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52065b0f-db88-418d-82db-5f5c92da71d8.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7c5e8c0f-f5f8-430e-979a-ef2df7b6ca88.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2ecd9d2a-9129-49f6-af1a-784e31fe1c6b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d82127b5-2341-4eb5-89ad-32d167f2bc46.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c4c0507-a666-4ea5-8aa9-1f1ad0a01e17.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "College-Grad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDQE2AFE4NJ5YS76QIDLAGJJBCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20B162KNDO60V?ASIN=B0CK54QYSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Should not buy GreenWorks stick vac only because it uses 24v batteries..",
                "reviewText": "I purchased the Green works Stick Vac because I have amassed quite a supply of Green works 24v batteries. I am extremely happy with all of my Green works products, and the Stick vac is no exception. The vacuum is extremely well built and well designed, quirk and compact. I originally gave a rating of four but have increased it to a five based on the filter, and will explain later on. I had assumed that the 24v battery provided would last a fairly reasonable time, and I would then use my arsenal of batteries to finish the vacuum job. The 24v battery that is provided is the Rolls Royce of batteries (as other reviewers have mentioned). It has a built in digital charge meter that show how much it has charged on the charger, and how much power is left on the Vac. The Vac has a digital readout that tells you how many minutes you have left to use the vacuum before you run out of power. I was able to vacuum my entire three story house, that has six bedrooms, basement, stairs that has linoleum, carpet and hardwood floors, all on a single battery in over 45 min. I can’t imagine anyone ordering the two battery bundle Green works sell on their website for $80 more. Although I was am extremely impressed with the battery life, you soon realize that it is also what makes up the majority of the cost of this vacuum cleaner. I see that Hoover has a “One Power” that allows you to switch their proprietary battery from stick vacuum to their portable hand held carper cleaner. So given that you probably will not be needing to use your extra Green Works 24v batteries, it would make more sense to buy a corded or cordless stick vacuum based on its cleaning abilities. Overall it kept a strong suction until the canister started to get full. Then I noticed anytime I turned off the vacuum small pieces would fall out of the vacuum and onto the floor, and I would then disconnect the 2 foot hose and attach one of the attachment tools and pick it up. This was again only after the canister became full. I liked that you could take the two tools that you carry on the vac and easily remove the 2 foot hose and put any of the cleaning tools on the end of the hand vac and use it just as a hand vacuum. The rotating sweeper head has a great turning range so it gets into really tight spots. It comes with a charging station that you are supposed to mount to a wall near an outlet where you can hang the vac and charge it when your not using it. The station also holds your two other tools, the smaller rotating sweeper head and a bigger bush attachment. I think anyone buying this vac already has a 24v GW charger somewhere that they charge their other batteries on, and so would just store the vacuum in a closet. Unfortunately the hanging charger is the only charger that comes with the vac, so I just am using one of my extra Green works 24v chargers to charge the vacuum battery and place it back on the vacuum when fully charged.Regarding the filter unit. Thankfully I read another review whereby the person said that although they cleared the debris out of the canister, she continued to get warnings on her vac that it was overheating, and realized she had to also clean the silver cylinder inside rhe canister. Because this is a Hepa filter, it wraps a micro mesh around a paper filter to trap the dust from going back into the air. Initially I thought the micro mesh was part of disposable filter and thought how impossible it would be to clean. But Amazon sells two replacement filters for $25 and is a good price, but show the filters without the silver micro mesh. Once you remove the filter, you then can remove the paper filter from the silver cylinder by just twisting it. Once the paper filter is removed I bought the AirTec Ultra Electric Air Duster Blower model 3 for $29 off Amazon to clean the vac. I was previously using my 6 galleon compressor to clean the filter. The little duster is corded and is as powerful as my air compressor d the size of a gatorade bottle , and it easily gets rid of all the fine dust or you can wash the filter in the sink using your spray nozzle to get out the remaking dirt and air dry.Although I like the Green works stick vacuum, a stick vacuum the vacuum itself it is for specific tasks, and a cordless vac would be for even more specialized tasks. Although this vacuum works well for the occasional quick cleanups before company comes over, but should not be used as the primary vacuum in a large house do to the small size of its dust catcher (as I found out) , and a regular size vac used for heavy cleaning would be the better choice for deep cleaning, and use of the stick vac would be better for the occasional quick pickup in a large home. It would also be great in an RV, fifth wheel, apartment or dorm room. Because its small size limits its use in a larger to that of the old dust buster, that is a lot of money to spend on a vacuum that will only get occasional use, and again given the price do you absolutely need a cordless vacuum.After using the Green Works 24v cordless vacuum, i realized that I was only buying the Green Works vacuum because I had a lot of extra 24v batteries and was trying to justify buying Green works tools that I could use my extra GW batteries with. And that brings up the point that It would be finically feasible if Green Works sold the vacuum without any batteries or charger (Tool Only) at a substantially discounted price as they do with their other tools. The other issue is if you compare the price of Green works cordless vacuum, to that of a similarly priced corded stick vacuum, you would see the quality and features greatly increases to that of a Dyson Vac, for about the same price point. You then have to ask yourself if you really need a cordless vacuum vs a corded vac since there are so few places where you would actually need a cordless vac.Although a cordless stick vac would be handy for a quick clean up, and why dust busters were so popular. But does the savings of the three seconds it takes to plug a vacuum cord into a wall socket or the $10 savings for a 15 foot extension cord to vacuum stairs justify the cost of a cordless vacuum? Although it truly is a nice vacuum, and I do intend to keep mine because I purchased it discounted off Amazon; but ii had paid full price I would probably send it back and buy a top of the line stick Vac that has a conventional cord. The only redeeming quality that the Green Works cordless vac has over other cordless vacuums like the Hoover “Power One” is that their battery is proprietary, and when the battery dies (as all batteries eventually do) anyone who bought the Hoover cordless will not buy a replacement battery, since it out of warranty and motor could burn out, so they will trash the Hoover and buy a new vacuum. Whereas the Green works has the standard battery that will run the vacuum fine for many more years. That is also why Green works should consider selling the vacuum at a substantially discounted price without the battery, so anyone who has Green works tools will want to pick just the vacuum because they already have a couple 24v Green works batteries that will work as well as the one long lasting battery that substantially raises the cost of the vacuum",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glenn Riley Jordan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHQXKGK6HYTNGJ6XZCGNA5QFPZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WP5Z5M7JZK3G?ASIN=B0CK54QYSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2023",
                "reviewTitle": "5.0 out of 5 stars This is one of the greatest purchases I have ever made.",
                "reviewText": "I found myself asking, “how many vacuums is too many vacuums?” I having a corded vacuum and a robot vacuum. The corded vacuum works phenomenally but is a pain to get out and lug around. The robot vacuum does just okay, but often misses large areas of heavily trafficked rooms. I needed something that I could easily use throughout the week to help cut down on the dirt brought in by my dogs. This vacuum does that AND more. It is so lightweight and easy to use it makes cleaning a variety of messes a breeze! The upholstery attachment works better than my Dyson on dog hair, and the dusting attachment has been a GAME CHANGER in cleaning baseboards. The suction is so fantastic you can literally see and feel it pull rug up!There are only a couple downsides and that is the battery and the regular floor attachment. The battery on the highest setting lasts less than ten minutes, but on the medium setting lasts about 20. If you use the eco mode it lasts a lot longer, but the power doesn’t work as well on heavier trafficked areas. The regular floor attachment feels kind of cheap while using, like the gliding and maneuvering power is toy like.However, this vacuum is fan freaking tastic and a great buy",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angelinrags",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGLVPOQJJAKPQZ2DP5YGC4HXZVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R331VWNLQS5ZC8?ASIN=B0CK54QYSD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2023",
                "reviewTitle": "4.0 out of 5 stars WORKS GREAT BUT CLOGS EASILY",
                "reviewText": "I love this cordless vac. It's easy to maneuver and is light weight. Problem is that it clogs up all the time. Not only inside the filter, but in the long stick portion of the vacuum cleaner. We have to use a wire hanger to push the clog out. We vacuum up a lot of hair and fir needles, which seem to be the main things that cause it to clog. Needless to say, we are constantly taking it apart to clear out clogs. The suction is great, even on low I can get things clean. I wish the battery lasted longer on the higher speeds. You have to empty the filter every time you use it and even several times if you are picking up a lot of dirt and hair. The roller is easy to detach and clean any hair that is wound around it. I love this vacuum, but it could use some improvement.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF63PHTQF2T326AZUAMEZEW6XMHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E92TXKG7JE9Y?ASIN=B0CK54QYSD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Great performance, design and service",
                "reviewText": "Things I like:- Works great on all my floor types; carpet, rugs, hardwood, and vinyl.- Single charge on 4Ah battery is plenty to cover my whole place (about 1200 sqft) on medium power, which is powerful enough for most tasks.- High power is usually overkill but nice to have if needed.- LED lights help illuminate dust and crumbs that I might miss otherwise.- Charges fast.- You don't have to hold the trigger continuously to run the vac like some other brands, just pull once and off you go.- Much quieter than my old corded vac.- It can get almost completely flat so you can vac under beds and couches pretty easily.- The powered pet-brush accessory is awesome and gets pet hair off of bedding and furniture super fast. Works well in the car too.- Emptying the dust bun is quite fast and easy to do. Don't forget to clean the inner help filter frequently as well or you will lose power.Things I don't like so much:- The dust bin is small enough that it pretty much needs to be emptied after every use.- The handle design is a little small and odd. Once you pull the trigger you have to keep your index finger away from it to keep running, but there's really no place to put your finger!- I had an issue with the motor after about 9 months BUT customer service was great and they took care of me under warranty with very little hassle, so I consider the experience a plus!I have a couple other Greenworks power tools that have worked great for the year or two I've owned them.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Böhme",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 13, 2022",
                "reviewTitle": "Originalteil mit guter Qualität",
                "reviewText": "Ich hatte mir den Greenworks Sauger bestellt und bin mit diesem recht zufrieden. Da bisher HEPA-Ersatzfilter nur beim Hersteller in den Staaten zu bekommen sind hab ich mir diese als Ersatz über Amazon US bestellt. Diese waren weit vorm veranschlagten Termin da und erfüllen meine Erwartungen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}