{
    "remaining_requests": 32343,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dyson-Upright-Vacuum-Certified-Refurbished/dp/B00KO8685Y",
    "body": {
        "name": "Dyson DC41 Upright Ball Vacuum (Certified Refurbished)",
        "price": "$499.00",
        "originalPrice": "",
        "rawPrice": 499.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dyson-Upright-Vacuum-Certified-Refurbished/dp/B00KO8685Y",
        "soldBy": {
            "sellerID": "A3JS2199GQLB8L",
            "name": "Cardinal Pro Electronics",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3JS2199GQLB8L&asin=B00KO8685Y&ref_=dp_merchant_link"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "25",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31WC rMpt-L.jpg",
        "images": [],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Renewed Store",
            "link": "https://www.amazon.com/Amazon-Renewed/b/ref=bl_dp_s_web_12653393011?ie=UTF8&node=12653393011&field-lbr_brands_browse-bin=Amazon+Renewed"
        },
        "brand": "Amazon Renewed",
        "merchantInfo": "Cardinal Pro Electronics",
        "customerReview": "3.7 out of 5 stars",
        "customerReviewCount": 70,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 22 - 26.",
            "Or fastest delivery Friday, February 16. Order within 11 hrs 12 mins."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "This Certified Refurbished product is manufacturer refurbished, shows limited or no wear, and includes all original accessories plus a 6-month warranty",
            "Suction power: 235 Air Watts",
            "Movement type: Ball technology",
            "Filter: Lifetime washable post filter",
            "Cleaner head: Motorized brushbar"
        ],
        "description": "This certified refurbished Dyson DC41 Upright Ball Vacuum is engineered for outstanding cleaning performance and ease of use. It has the strongest suction at the cleaner head, which automatically self-adjusts for different carpet lengths and hard floors. The DC41 features Dyson’s latest Radial Root Cyclone technology, Ball technology for smooth steering, and a large 0.55-gallon bin. Ball technology for upright vacuums Dyson Ball upright vacuums ride on a ball, which pivots on the spot so you can steer with a turn of the wrist. The ball also houses core technology, including the motor and ducting. There’s less clutter, so it’s easier to clean in awkward places, along edges, and around furniture. Strongest suction at the cleaner head Many upright vacuums use fixed settings, and their cleaner heads don’t self-adjust to different floor types. The bigger the gap between cleaner head and floor, the more suction power is wasted. With the DC41, an active base plate creates the optimal cleaner head contact for every floor type, reducing air leaks and retaining more suction power. It’s designed for outstanding performance across all floors--not just carpets. Powerful and durable The DC41 is constructed from materials selected for strength, flexibility, and tolerance. Many parts are made from polypropylene reinforced with 20 percent glass fibers and high-impact PC-ABS. Using these materials means greater strength from less plastic, so the machine is lightweight. Motorized brush bar Stiff nylon bristles spin at up to 90 times per second to agitate carpet pile and dislodge ground-in dirt and pet hair, and the brush bar can be turned off to protect delicate rugs and hard floors. Captures allergens and expels cleaner air Unlike ordinary vacuums that can’t always retain all the dust they remove, venting some of it back into your room in the air they expel, the DC41 captures and contains microscopic particles such as pollen, mold and bacteria.Hygienic and quick to emptyEmptying the bin on a Dyson vacuum is quick and hygienic. The bin is clear, so you can see when it needs emptying and how much dust, dirt, and pet hair the machine has captured. Just press the release button to empty the bin.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Vacuums & Floor Care",
                "link": "https://www.amazon.com/vacuums-floor-care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=510106"
            },
            {
                "name": "Vacuums",
                "link": "https://www.amazon.com/vacuums/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3743521"
            },
            {
                "name": "Upright Vacuums",
                "link": "https://www.amazon.com/upright-vacuums/b/ref=dp_bc_aui_C_4?ie=UTF8&node=510110"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "Dyson"
            },
            {
                "name": "Filter Type",
                "value": "Foam"
            },
            {
                "name": "Included Components",
                "value": "Brush"
            },
            {
                "name": "Capacity",
                "value": "0.55 Gallons"
            },
            {
                "name": "Color",
                "value": "Purple"
            },
            {
                "name": "Noise Level",
                "value": "82 dB"
            },
            {
                "name": "Manufacturer",
                "value": "Dyson"
            },
            {
                "name": "Controller Type",
                "value": "Push Button"
            },
            {
                "name": "Control Method",
                "value": "Touch"
            },
            {
                "name": "Style",
                "value": "Modern"
            },
            {
                "name": "Package Dimensions",
                "value": "36.4 x 11.4 x 11.2 inches"
            },
            {
                "name": "Item Weight",
                "value": "22.8 pounds"
            },
            {
                "name": "ASIN",
                "value": "B00KO8685Y"
            },
            {
                "name": "Item model number",
                "value": "DC33"
            },
            {
                "name": "Customer Reviews",
                "value": "3.7 3.7 out of 5 stars 70 ratings 3.7 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#22,171 in Amazon Renewed (See Top 100 in Amazon Renewed) #688 in Upright Vacuum Cleaners #1,429 in Renewed Home & Kitchen"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Warranty Description",
                "value": "6 month dyson."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Surface Recommendation Carpet",
                "value": "Power Source Corded Electric"
            },
            {
                "name": "Voltage 235 Volts",
                "value": "Form Factor Upright"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Spencer R",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAOH5O3KKBHGMOI3VNCI2TPZMOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ47X4QYQ1YQ0?ASIN=B00KO8685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2014",
                "reviewTitle": "5.0 out of 5 stars Great Product!",
                "reviewText": "As one would expect, the Dyson Vacuum is everything they are expected to be. I was hesitant at first about the factory reconditioned aspect of this, but the Prime DOTD was too good an offer to not try out. I have had the vacuum for months and it has not let me down yet. Very powerful, but quiet. The filters do need cleaned every three months or so. The cord is very long, one plug covers my entire apartment and it even works great on my tiled floor area. A great vacuum at a great price.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Curtiss",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS4B47TRBHJEXIT2UYMZZRJPGKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NN2LVJQDFE89?ASIN=B00KO8685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2014",
                "reviewTitle": "5.0 out of 5 stars Very good machine it looks like new runs like new and ...",
                "reviewText": "Very good machine it looks like new runs like new and when I got it I tried it it works like new A day or so before I had va OPS the machine was very quiet easy to push the assembly when I got the machine was very easy only took me probably 20 minutes to figure out how to put together very good very good cuumed with my old vacuum and thought everything looks clean but it was far from that the Dyson 41 picked up a whole canister of stuff in the living room dog care and whatnot and I was thoroughly blown away I would highly recommend this machine",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ithelpme dot com",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEEJOUMO53YRMORCXSL7X42X7VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX7SDN3HVUXGT?ASIN=B00KO8685Y",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2015",
                "reviewTitle": "2.0 out of 5 stars Weak vacuum.",
                "reviewText": "The media could not be loaded. Did a simple test between this Dyson DC 41 against my 15 year old Dirt Devil Breeze. Dyson lost. It did not pick up all the sand from carpet",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0b745d4f-d6b8-4b83-9667-5847949691c8/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "John Stracke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEESQLZPU5W7QVZLCD2GFENE6ZKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RF0YC1M8SPXKU?ASIN=B00KO8685Y",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2015",
                "reviewTitle": "1.0 out of 5 stars Worst Dyson ever.",
                "reviewText": "I have had 2 other dyson vacuums and have been very pleased. The ball vacuum is just a complete pain to use. It is made of cheaper and less sturdy plastic. When using the hose attachment, the unit Always tips over. Every time. The cord tangles constantly and the suction is not as strong as my previous dysons.There is no way I will ever buy a ball vacuum again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dave",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH42YQUJV4OWH7IBINW5OR33XVRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IR7DT74JTCD9?ASIN=B00KO8685Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2016",
                "reviewTitle": "4.0 out of 5 stars Worth It",
                "reviewText": "This vacuum takes some getting used to in that it is heavier than others, but it works so well! I never thought I would invest so heavily in a vacuum, but I got a deal and it really is good. I like not having to deal with filters. The cord is heavy duty which can be cumbersome, but also means it will probably last longer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ronald P. Duncan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSZMYRLHUHO2FLFRDDMGVP6JURA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28GDHNF6QKRNJ?ASIN=B00KO8685Y",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 18, 2014",
                "reviewTitle": "3.0 out of 5 stars DOING A DYSON",
                "reviewText": "NEEDED TO UNSTOP IT,(CARDBOARD PEACE \"JUST THE RIGHT SIZE IN CONNECTING HOSE.} PHILLIPS SCREW HOLDING DOWN CONNECTING HOSE BRACKET IS (WAS) WAY SMALL (BELONGS ON A WRIST WATCH!!)..LITTLE SCREW \"FLEW OFF\" SO I PUT A \"REAL\" SCREW IN IT'S PLACE,WORKS FINE. (SCREW THE WARRANTY). IT SUCKS NOW: R95",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN4KWHKYQXW2AKEIPV4FDHSKO6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8LO0G07W8CYM?ASIN=B00KO8685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2015",
                "reviewTitle": "5.0 out of 5 stars Yes! Great Purchase Price, Even Better Vac!",
                "reviewText": "I haven't bought a refurbished appliance or electronic device before. I've always bought new, fearing that the item would lack the look and quality I want. However, I read that this Dyson vac was certified by the company, so given the price and need for a new one, I took a chance. This is my first Dyson vac, and I was eager to see if it indeed lived up to the hype. I've been disappointed with my last couple of vacs that didn't perform well for very long. Being a clean freak with two cats and a dog, my vacs get used a LOT. I could have bought a Dyson with the two others I've ditched in the last couple of years.The Dyson arrived in beautiful condition, looking like new out of the box. It was easy to assemble and I had to test it out immediately. Look! Cat hair! First impression: this is one quiet vac! The decible level was well below the jet-engine hum of its predecessor. Then I noticed I didn't so much have to pull and push. This ingeniously designed appliance only required gentle guidance. Nice. So nice that I did the entire house in the first test. It was almost (almost) pleasurable. But the real test is how did it handle the animal fur in that little wind tunnel? Like the champ it is!!! I'm a Dyson convert and when and if this baby gives out, I'll buy another one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ciberpuppi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMMF5GYFSUZKJ64FEFP3DIVBTRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P71R970KDPMD?ASIN=B00KO8685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 13, 2015",
                "reviewTitle": "5.0 out of 5 stars Best Purchase I Made All Year",
                "reviewText": "I had been trying to decide between a Dyson and the much-advertised Shark version. Boy, am I glad I decided to spring for the Dyson!I managed to snap this re-manufactured unit up from Amazon/Woot and it may be the best deal I got all year! True, I had to spring for the optional tangle-free upholstery head (WELL worth the money, btw), but this thing is amazing!I keep dogs in the house and the only room with carpet is the den. So before the Dyson arrived, I made sure that I cleaned the house and vacuumed everything the day before. As soon as I put the Dyson together, I immediately re-vacuumed the den. To my amazement, the Dyson picked up enough hair to nearly fill the bin!The power is so strong that it actually dwarfs the power of my 4.5 hp Shop Vac! And when you live with multiple dogs, it's nice to have a unit that's powerful enough to pick up every strand of hair on hardwood floors, even if the head is several inches away! For carpets, it's the best unit I've ever seen and I love not having to manually adjust the head every time I switch from carpet to hardwood.While I'd like to have attachments easily available on the unit itself (Shark seems to have this advantage), I'm pretty sure I can leave without that feature.Oh - and did I fail to mention that the power cord is long enough to where I can plug it into the main hall and not have to move it while I vacuum the whole house? Another time-saver!",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}