{
    "remaining_requests": 9219,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Video-Doorbell-Pro/dp/B08M125RNW",
    "body": {
        "name": "Ring Wired Doorbell Plus (Video Doorbell Pro) – Upgraded, with added security features and a sleek design (existing doorbell wiring required)",
        "price": "$149.99",
        "originalPrice": "$169.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Video-Doorbell-Pro/dp/B08M125RNW",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07G5ZG3Q4"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41rQX18sS4L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21SXi8rdx3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41vWwwTWSSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511PGBIW3zL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41a3CqxjVYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VTDDwq1cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PnbTfRt6S.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 47071,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Upgraded, 1080p HD wired video doorbell with Two-Way Talk and Quick Replies, Advanced Motion Detection, built-in Alexa Greetings (an exclusive Ring Protect Plan subscription feature), enhanced dual-band wifi, and customizable privacy settings",
            "Get motion-activated alerts on your phone, tablet or PC and check in at home anytime with Live View all in the Ring app",
            "Speak to visitors when you can’t get to the door with built-in Alexa Greetings, an exclusive Ring Protect Plan subscription feature",
            "Enjoy a more reliable connection with dual-band (2.4 or 5.0 GHz) wifi connectivity",
            "Hardwire Wired Doorbell Plus (Video Doorbell Pro) to your existing doorbell wiring and doorbell chime inside using the included tool kit for around-the-clock power and peace of mind",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "For added peace of mind, pair with Alexa to help you keep an eye on your home. Connect with Alexa to hear alerts on your compatible Echo device or see a Live View with an Echo Show, Fire TV, or Fire Tablet. Talk to visitors by saying, “Alexa, talk to the front door.” With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring Video Doorbell detects a person."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ethan C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKIWVMIFZBGCDWCD3NZJKVOB6IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A5V2PXUDAGBV?ASIN=B08M125RNW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 2, 2017",
                "reviewTitle": "5.0 out of 5 stars 6/5/18 Update up to 5 stars from First impression 4 out of 5 stars and here is why...",
                "reviewText": "Update on Original 4 out of 5 stars to a straight 5 star rating and here is why: My original post is located below the original post line, this review is coming 1 year and 1 month after the original post.My wife and I recently noticed that the ring app would freeze up when trying to use the microphone. After self troubleshooting and research online I finally made the dreaded call to customer technical support which is something that everyone dreads. Dialing the support number I braced myself for the never ending conversation with someone that is hard to understand and even harder to get to understand the issue so Imagine my surprise when the person I was directed to was not that at all. I am not sure if I should share his name so I will just call him Mr. K., Mr. K. slowly walked through the issue with me and indulged my interruptions of what I believed the issue could be and what my trouble shooting methodology was (I'm an IT by trade so I kinda nuked it, <--- Military people will get the reference lol). I gave him temporary access to my ring device as we slowly walked through the troubleshooting process one inch at a time. I will spare you the painful details (which to be honest I think he went as far as he did troubleshooting just to indulge me and my compulsion to over analyze everything to the smallest degree) before dropping the big bomb, my ring unit would have to be replaced and it was out of warranty. Of course my first thought was, of course it is and now I have to pay another $200+ dollars because this is what all these companies do, sell you something that is going to fail right after the warranty expires! So containing all my rage and indignation I asked how much it will cost hoping he would have a less costlier solution. His reply was simple, We appreciate our customers and would like to show our appreciation to you for being so patient during the T/S'ing process as well as being a loyal customer that we are going to replace your device at no cost to you. Immediately I found myself deflated and embarrassed for my unexpressed anger, but still still that feeling of suspicion hung over me so I politely asked if this would be a refurbished or new replacement, his answer was honest and straight forward. It depends on what is in stock. Sometimes refurbs are sent after going through the re certification process if they are in stock, and if not, then they will send out a new one. They do not have a set policy of replacing with either or as a priority. Well now I really felt like a jerk because I have finally come across that rare gem in customer service, the person that is there to actually help, takes pride in the company they work for and the products they sell. This interaction in itself (not the free replacement) was what made this company and product 5 out of 5 stars for me, even with the original issues still in play. I can be happy with this product even without the things I noted knowing that when I need help with the product, I can get it, and the person on the other side of the phone is patient, helpful, knowledgeable and willing to help. So to summarize, Ring is in my experience, one of the few companies willing to continue to provide great customer service by not farming it out to cheaper alternatives and having what in my case was a very knowledgeable and patient CS rep as well as a superior product (I am referring to the ring door bell since it is the only product that I have been able to purchase). Did it have an issue?... yes... was it a non functioning product?... No ... Most importantly, was I able to get the issue rectified at no cost... absolutely... Thank you Mr. K. and thank you ring for your exemplary Customer Service.________________________________________Original Post_____________________________________________________________I just received my Ring video doorbell pro and the installation was very simple and straight forward. The first thing I noticed was that the it took a little while after the installation was complete for the bell to start working. I am not sure if that is normal but if you do the install and the door bell does not work immediately you may want to wait 10 or 15 minutes before trouble shooting. I set up the motion senser zone and it worked as advertised, so far no false triggers but it has only been installed a few hours. The video is clean and very clear, the voice function works well unlike other users, the lag from sensor being triggered to app notification was about a second or two. The live view works and is a very convenient function. The IOS app works well and was very simple to use, the windows 10 app... no so much. The reason it gets a 4 star and not 5 is because of the following.1. Windows 10 app is buggy, when I try to set up the detection zone distance it gives me the following error \"Arg_InvalidCastException\"2. Only six partners and none of them are smart home technologies I use. (this is of course my personal pet peeve and they may expand the partner list in the future)3. The lens they use gives the live view and video a fish eye lens effect. I don't understand why they did not use a field flattener to get rid of the distortion.4. Live View has a time limit. This is very confusing to me, I am not sure why I can not open the live view viewer and just let it stream the video to my computer when I am sitting in my office. One of the reasons I got this particular model was because of the live view, I thought I would be able to live stream to my computer when I am sitting in my home office so that I can watch for packages being delivered. USPS has a habit of dropping off packages and leaving without ringing the door bell, this has led to many packages being stolen from peoples porches and doorways.Lastly, if you are like me and have multiple smart home products that you would like to tie in to your ring video doorbell (I have hue lights and wanted to set it up so that my porch light would come on when the motion sensor on the ring video doorbell sensed motion, this can only be done through IFTTT, needless to say, that is not a good solution since it takes 10 to 15 minutes before IFTTT polls for new action requests which means that if someone walks up to the door my light will probably not go on till they have either entered my home or left.) you will need to have wink products so if you are using Wi-Fi, ZigBee, or Z-Wave you are out of luck. If it is compatible with a hub such as smart things, wink, insteon or any of the others is a mystery to me and I have not been able to find anything online. All and all it seems to work well, with a few tweaks I think this thing can easily be a 5 out of 5. I will post a follow up after it has been installed for a while.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elliott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCAVQVPVKJX37ZOQ3XAKSB33WSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VSD6NE9F3784?ASIN=B08M125RNW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Nice doorbell but poor outgoing audio quality until Ring worked with me for a resolution",
                "reviewText": "This review is on the Video Doorbell Pro, the initial version, let's call it version 1. That is what I purchased and what many reading this review may have as well. My original review that follows pointed out one annoying negative and gave the product 3 stars. Apparently Ring monitors their reviews (since they are owned by Amazon) and as a result I was contacted by a Ring specialist, who was knowledgeable about their products and worked closely with me for a resolution. That experience was very positive. As a result, I have upped my review to 5 stars as the doorbell now meets all my needs and her willingness to work with me was exceptional. The product I am giving 5 stars to is the Video Doorbell Pro 2 which is different than the product I purchased which was the Video Doorbell Pro.Following is the review of the Pro. After that is the review of the Pro 2.I purchased Ring since they are an industry leader, generally get good reviews, and were helpful with my questions prior to purchase. The install went fairly well. The couple of questions I had they quickly and efficiently addressed with my calls to their help line. The only tricky part was due to my door’s construction and the need to mount the Ring somewhat higher on the frame then normally is done for conventional doorbells. I had to fish my doorbell wire up behind the trim to the Ring. But it all went well.The one problem, and the one that is still not resolved, is the audio quality of the signal broadcast by the Ring speaker for talking to the person at the door. The audio quality I hear inside is great; it is just the audio quality going out that is bad. I did a bunch of reading about this. I suggest you go to the Ring community forum at community-dot-ring-dot-com. Search for poor audio quality and read the post titled “Ring Pro very poor audio quality - garbled badly at doorbell - but fine if reviewing recording.” That series of posts covers the problem in detail. I also found similar complaints in Amazon reviews. I called their help line hoping to raise the complaint up the food chain and get it resolved. It seemed to me like a product problem. After over 3 hours invested and talking to 4 different support agents of increasing authority, I was told by the last one “I am the top of the line,” I still got no resolution. She insisted the issue was my Wi-Fi even though all the tests conducted by the Ring doorbell indicated the Wi-Fi was fine and even though the incoming video and audio was high quality with no distortion.They also sent me one replacement and then another, the last one supposedly from the newest “version 3” batch. They all worked the same. I do have to say they tried, but with the info I provided and the info in the Ring Community posts, it does sound like a design flaw. I can’t say for sure, but I have given up. I don’t really believe my last contact was the “top of the line,” nor that she ever spoke to actual product engineers. It is annoying how companies “protect” their engineers from their customers.I decided to keep the doorbell since it does everything else well, and I have modified my door jamb to accept it. I don’t often have to talk to a visitor using the doorbell and the one time I needed it I was able to, even though the audio sounds like I am talking through a Kazoo.The Ring website is easy to use and it is nice to have a video doorbell.UPDATE for the Pro 2.As I said a Ring specialist saw my Amazon review and contacted me to see if she could better resolve my problem. She was more expert that the 4 prior persons I had spoken to and also apparently had direct access to engineers familiar with the product. She asked if she could send me another (my 4th doorbell). I said “yes let’s give it a try,” thinking this was another update on the Pro. Actually it turned out to be a different more-expensive product, the Pro 2, but I didn’t realize this till later.The long and the short of it is, the Pro 2 works fine. It has even better video than the Pro, similar incoming audio, and a much-improved outgoing audio. It is now reasonable to have 2-way conversation through the doorbell. She also assured me that the prior Ring advice was incorrect and that my Wi-Fi was fine as was the way I had interfaced the doorbell to my system.I asked my contact if the Pro still had the same audio problems as I had identified, and she assured me that the latest version of the Pro and the Pro 2 had “the same audio capabilities.” I cannot confirm this but she seems to know her stuff. So, if outgoing audio is important to you, the current version of the Pro may suffice, but your best option may be to spend the extra for a Pro 2.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}