{
    "remaining_requests": 9212,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Chime-Pro/dp/B07WML2XTD",
    "body": {
        "name": "Ring Chime Pro",
        "price": "$59.99",
        "originalPrice": "",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Chime-Pro/dp/B07WML2XTD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Pg1vEf1 L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31CtgGH6laL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412dExUn1yL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41qkhY-PxVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31KLTE5ghJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PZmrpHR3L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 48750,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Sunday, February 18. Order within 14 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Bring flexibility, convenience, and peace of mind to your home with Chime Pro, a three-in-one solution that includes a wifi extender for your Ring cameras and doorbells, a nightlight, and a chime box to hear notifications for your Ring cameras and doorbells.",
            "Extend your wifi signal up to 2000 sq. ft to boost the network for all your Ring doorbells and cameras.",
            "Hear real-time notifications when your connected cameras and doorbells detect motion, or when someone rings your doorbell.",
            "Easily set up by plugging into a standard outlet and connecting via wifi.",
            "Includes a built-in nightlight that automatically turns on for added peace of mind.",
            "Choose from a variety of chime tones, adjust the volume to your ideal setting, and temporarily snooze alerts all from the Ring app.",
            "Connectivity: 802.11 b/g/n wifi connection 2.4 or 5.0 GHz."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Christopher Stockton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN3QT5UAPZS3ZXYQ3UCETSTAZHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30GEIVPK8JZ83?ASIN=B07WML2XTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Great addition to my ring system",
                "reviewText": "As a consumer, I have had a positive experience with the Ring Chime Pro. It has greatly improved the functionality of my Ring Doorbell and security system.One of the biggest advantages of the Chime Pro is its Wi-Fi extender feature. I have a large house, and previously, I had issues with weak Wi-Fi signals in certain areas, which affected the performance of my Ring devices. However, since I installed the Chime Pro, I have noticed a significant improvement in the Wi-Fi range and signal strength. Now, I can easily see who is at my door or monitor my home's security from any corner of my house without any connectivity issues.Setting up the Chime Pro was a breeze. The Ring app provided clear and straightforward instructions, and I was able to get it up and running within minutes. I appreciated the customization options available for the chime alerts, allowing me to choose the volume and tone that suited my preferences.The design of the Chime Pro is sleek and unobtrusive. It easily blends into my home decor, and its compact size allows me to place it anywhere without it being an eyesore. The LED light indicator is a nice touch, as it provides a visual cue for events like motion detection or doorbell rings. This is especially helpful for those with hearing impairments or in situations where the chime might not be heard.Overall, I am satisfied with my purchase of the Ring Chime Pro. It has significantly improved the functionality of my Ring Doorbell and security system by extending the Wi-Fi range and providing customizable chime alerts. If you have a Ring device and want to enhance your experience, I would recommend considering the Chime Pro.",
                "reviewVotes": "105 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CP",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ3SMJ3LEIR3IPOFGBEWDUHYECQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q1O2HF7XNOCU?ASIN=B07WML2XTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent! Fixed my range problem with outdoor cam",
                "reviewText": "This all-in-one product ended up replacing three products that were plugged in: a nightlight at the bottom of my stairs, Ring Gen-1 chime and a Ring Gen-1 range extender. (I’m keeping a Gen-2 extender for my front yard outdoor camera).I had trouble getting a strong enough signal to my backyard cam since it was far away from my router. Despite adding several Ring extenders (Gen 1 and Gen 2) the signal was always very weak and rarely would record or show me a Live view.The Chime Pro works great! I easily connected my cam directly to the Chime Pro device network and it improved it enough to record and get Live views now with no problem.So happy I bought this!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AFMerc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP746GUJX6PRFKSRMCLLWJU7T2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DB7FOV2FHTU4?ASIN=B07WML2XTD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A Game-Changer for Ring Users!",
                "reviewText": "I recently purchased the Ring Chime Pro, and it has truly transformed my home security experience. The three-in-one functionality of this device is a game-changer, providing me with flexibility, convenience, and an added layer of peace of mind.Firstly, the wifi extender feature significantly boosted the network for all my Ring doorbells and cameras, covering up to 2000 sq. ft. Now, I have seamless connectivity throughout my home, ensuring that I never miss a moment. The setup was a breeze – just plug it into a standard outlet, connect via wifi, and voila!The real-time notifications are a game-changer. Whether it's detecting motion or someone ringing the doorbell, I am instantly alerted, keeping me informed about any activity around my home. The customizable chime tones and adjustable volume add a personal touch, allowing me to tailor the notifications to my liking. The built-in nightlight is a thoughtful addition, automatically providing a sense of security.In conclusion, the Ring Chime Pro is a must-have for Ring users. It seamlessly combines wifi extension, real-time notifications, and a nightlight into one sleek device, enhancing the overall home security experience. I highly recommend it to anyone looking to elevate their Ring setup!",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doug B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2YL7VHUTF6T3YVMO42O5XVQP4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25ZJZMNB3OUBC?ASIN=B07WML2XTD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 4, 2023",
                "reviewTitle": "4.0 out of 5 stars Wifi bridge gives my Ring Security Cam a much better signal. Reasonably priced.",
                "reviewText": "I've had a Ring Doorbell for quite a while now and recently installed a Ring Floodlight Cam over my garage for extra security and monitoring. I live in an older house with thick walls and unfortunately there are several internal walls and two exterior walls between my wifi router and the Ring Floodlight Cam and the wifi signal is very weak and constantly dropping out. I have several old routers laying around I could set up as a wifi bridge, but rather than go through all the hassle, for 60 bucks I thought I would try the Ring Chime Pro as an easier off the shelf solution first.Configuration was super easy and I had it up and working in less than five minutes. When my contractor first installed my Ring Doorbell, he hooked it up to my old mechanical doorbell so I could hear when somebody is at the door like before. However, after several months that stopped working. It is nice to now have an audible sound when somebody is at the door again, especially if I have guests and leave the house with my phone. It would be nice if there were more than 16 ring sounds to choose from, but it is adequate.I put the Ring Chime Pro in the front room of my house with less walls between it and the Ring Floodlight Cam but unfortunately, the wifi extender feature was still too weak to reliably connect to it. I finally ended up putting the Ring Chime Pro in the kitchen on the wall at the very front of the house and that was finally the magic spot for the wifi extender to give a solid signal. The Ring Floodlight Cam is now super fast and the most responsive I have experienced. The house has an open floor plan so the doorbell chime is still easily audible through out the house as well where it is currently installed.There are a few negatives. The Ring Chime Pro does not run hot but it does run pretty warm. The spot in the kitchen where I have it installed is near the oven but luckily the oven throws off very little heat so I think it will be ok. Also, the Ring Chime Pro has a light sensor which is supposed to automatically turn on and off the nightlight when it is dark. Even though my kitchen is pretty well lit, especially in the daytime, the nightlight is always on 24/7. The Ring Doorbell and Ring Floodlight Cam software lets you schedule when to alert or not alert. Hopefully someday the software will also let you schedule when the nightlight feature should be active, but for now I just disabled it.The doorbell chime and wifi extender features are great. The nightlight feature needs a configurable schedule, but might work ok for some people. The unit does run on the warm side which might be an issue over time if installed in an area that has high temperatures. Overall for the price, I would recommend the Ring Chime Pro.",
                "reviewVotes": "150 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}