{
    "remaining_requests": 8928,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Wall-Light-Solar-Black/dp/B08KSJCV8B",
    "body": {
        "name": "Ring Smart Lighting – Wall Light Solar, Black (Bridge required)",
        "price": "$59.99",
        "originalPrice": "",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Wall-Light-Solar-Black/dp/B08KSJCV8B",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08SKDFFP7"
        ],
        "asinVariationValues": [
            {
                "asin": "B08KSJCV8B",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/11QnwvKqxpL._SS36_.jpg"
            },
            {
                "asin": "B08KSHJ9YD",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/217E2SRtu+L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Hc6jea3QL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31favljgknL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DTPpOTlwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Jcy4FA1BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51M1VWL7aML.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 983,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 3 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Solar-powered wall light that shines 800 lumens of white light to illuminate garages, fence lines, and outdoor areas when motion is detected.",
            "Ring Bridge, Ring Alarm Pro, Echo (4th Gen) or Echo Show 10 (3rd Gen) required to enable smart features, such as mobile notifications and customizable settings.",
            "Connect Wall Light Solar to Echo (4th Gen), Echo Show 10 (3rd Gen), or Ring Bridge to enable customizable smart controls in the Ring app and sync with other select Ring Smart Lights, Ring doorbells, cameras, and select Alexa-enabled devices.",
            "Dimensions: 12 in. x 4 in. x 2.6 in. (304.8mm x 101.6mm x 66.2mm)",
            "Lighting: Up to 800 lumens (adjustable), 3500K color temperature",
            "Operating conditions: -4°F to 122°F (-20°C to 50°C), Weather Resistant IP66 (IP64 in-use)"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Dimensions",
                "value": "12 in. x 4 in. x 2.6 in. (304.8mm x 101.6mm x 66.2mm)"
            },
            {
                "name": "Available colors",
                "value": "White, Black"
            },
            {
                "name": "Lighting",
                "value": "Up to 800 lumens (adjustable), 3500K color temperature. Schedulable dusk to dawn glow (Ring Bridge required)."
            },
            {
                "name": "Motion detection",
                "value": "Motion Detected Lighting (adjustable). Ring Bridge required. Up to 140° field of view (detection angle dependent on distance from units), adjustable 30ft range"
            },
            {
                "name": "Power",
                "value": "Solar and rechargeable battery"
            },
            {
                "name": "Battery",
                "value": "18650 lithium-ion rechargeable battery (2). Can recharge via micro USB."
            },
            {
                "name": "Connectivity",
                "value": "Wireless connection to Ring Bridge"
            },
            {
                "name": "Operating conditions",
                "value": "-4°F to 122°F (-20°C to 50°C), Weather Resistant IP66 (IP64 in-use)"
            },
            {
                "name": "Setup requirements",
                "value": "Mount to most surfaces with included screws (screwdriver not included). Ring Bridge required for use with other Ring products. One Ring Bridge per household, supports approximately 50 Ring Smart Lighting devices."
            },
            {
                "name": "Box includes",
                "value": "Ring Smart Lighting Wall Light Solar (1), 18650 lithium-ion rechargeable batteries (2), micro USB charging cable (1), installation hardware (1pkt)."
            },
            {
                "name": "Warranty",
                "value": "1-year limited warranty"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Chris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5KLFBWLQJF6YGTLSBBLXVMRCKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PA1PECCJOXPA?ASIN=B08KSJCV8B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2021",
                "reviewTitle": "5.0 out of 5 stars UPDATED: GREAT PRODUCT! Poor Charging Capabilities and Battery Life",
                "reviewText": "My initial experience with this product was poor, as editorialized below. However, within a day of posting this review I received an email from Ring customer support. The service representative, Ryan (great guy!) walked me through some steps to see if we could get these lights to reboot and do what they were supposed to do, but after doing everything we could, the lights just didn't want to cooperate.Ryan then sent me two brand new lights, and they both work BEAUTIFULLY! They have been holding their charge for over a week now, recharging via solar during the day. They are very bright at night and do a great job of illuminating the area where I placed them. Best of all is the customer service I received from Ring. As I said, Ryan was absolutely great and did everything he could to resolve my issue. Add to that, I received another email from Alexis to follow up while Ryan was out. Great tag team work there!Products will fail from time to time and that's to be expected. I never expect a failure in customer service, though, and Ring did not disappoint. Top notch customer service and complaint resolution! Thank you, Ring!I love the brightness of this light and how easy it is to install, plus the fact that you can add an additional solar panel to it if you want more charging capabilities. However, you have to have the light in full sun during the day to completely recharge the batteries. If you have it set up in even partially shaded area the batteries will not fully recharge. In order to address this I purchased an additional solar panel, which IS in full sun for the entire day, but I still don't get a full charge on the batteries by nightfall.In addition to that, the battery life is horrible. I do not have the light on all night. It is set up to light up when it detects motion and to turn off after 3 minutes. The motion isn't activated that often, so there's really no reason for the battery to be drained in the morning. I'm also perplexed as to why they chose to go with these wimpy batteries when the batteries for the spotlight cams have such great battery life and can be pulled and replaced with a freshly charged battery. If I want to recharge the battery quickly I have to pull the whole assembly from the fence to recharge inside.I regret this purchase completely and I'm very disappointed in Ring. This is the first thumbs down review I've given on any of their products.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEED7UK2BRCDWVPRX6OJPCKGUDPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R76063Y76GZHZ?ASIN=B08KSJCV8B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 21, 2021",
                "reviewTitle": "5.0 out of 5 stars Good Product Especially if you are already a Ring user.",
                "reviewText": "If you are already a Ring Bridge user for lighting control this product is a no brainer. I have it on the back of my house to light up a small lawn. Works great. I wanted something to provide light on the lawn but nothing too bright such as a RIng Spotlight or Floodlight cam. It is just this light and a couple Ring Pathway lights and it is a good amount of light for my lawn to walk around. I didn't even bother to precharge it with a USB. I just installed it, batteries started with about 45%. It gains about 15-20% charge a day with the built in solar panel with 3-4 hours of direct sun, after 2 days it is already near 80% charge so I don't think I will ever need to take it down and usb charge it. I have it on motion control and it uses about 1-5% in the evening depending on how much motion it detects. Like other Ring lights the motion detection on this can be used to supplement motion detection on Ring cameras. Install is a simple bracket with 2 screws and the light then just slides onto the bracket. It's too new to speak on durability but so far it is a perfect solution for what I needed at a reasonable price.",
                "reviewVotes": "29 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lusealdog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE436H6NG3GGTYV4WS3ORZTSE77Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMF8T8JIDWO0?ASIN=B08KSJCV8B",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2022",
                "reviewTitle": "4.0 out of 5 stars Relatively useful after all",
                "reviewText": "EDIT: Ring reached out to me after I wrote the review below and after some very extensive trouble shooting including a factory reset and a forced firmware update, we were able to get the device working properly and it now does what I need - it detects my dogs in the yard and stays lit. It’s quite bright. My only minor issue now is that the solar panel is having trouble keeping it charged, probably because I live in Pittsburgh which is not known for its sunny weather. I don’t mind bringing it in and charging it every once in a while and I imagine it will do fine when the days are longer come summer.Original review:I bought this so I could see my dogs when they go outside after dark. It simply doesn’t work - it detects motion but won’t turn on unless paired with my ring doorbell. When I paired it with the doorbell, it won’t turn on for longer than a minute after the doorbell detects motion no matter how many times I adjust the settings to try and keep it on for for longer. Even if I manually turn it on with the 15 minute setting, it still turns off after one minute. My dogs aren’t such overachievers as to reliably do their business in 60 seconds or less, so I’ll be looking for other options to light their potty zone.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tmoz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4IZN6V5LU2BEH2EVVR3M5WQL2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4IRIESF4HKPT?ASIN=B08KSJCV8B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2022",
                "reviewTitle": "5.0 out of 5 stars Works well, longevity TBD...",
                "reviewText": "I have this mounted on the SE side of my house where it gets probably half a day's worth of sunlight. I have it set to stay on for 30 seconds when motion is detected at 3rd lowest brightness setting and all other settings are default.*solar charges really well, even noticed on a completely overcast day it went up about 4% in charge (desert environment, late Fall at time of writing this review)*easy to install*wireless bridge connection range is good*granular configuration/controls available (specifically very good range for desired brightness levels)*overall easy to set up like any other Ring productI need like 10 more of these things! Hope it holds up over time in general.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWGKJCJS6FRBVYSR5MQLUNW3R5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G70EFA174TGL?ASIN=B08KSJCV8B",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "3.0 out of 5 stars Bright light, bad battery",
                "reviewText": "The light was bright and easy to install. I have two on above my garage door, and they both light up the whole driveway.On other good thing is the price isn’t to bad.The only bad thing is the battery when it doesn’t have full sun.They were both getting charged when I first put them up a few months ago, but when fall came along, and West facing garage with two big trees, they do not get a lot of sun to stay charged.With in the past week or so I noticed the battery’s getting lower.I wish Ring had some sort of a water proof solution to charge them.There is a port on the back for some sort of charger, but it’s really hard to find a charger on Amazon.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Webster",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIKROORTB2ZOKUXFZRLNCVFSP6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D57IYDA84ZF?ASIN=B08KSJCV8B",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars Love it. Highly recommend",
                "reviewText": "I use this for a light near my garbage containers outside. Been almost a year. Haven't replaced batteries once. The area I have it placed gets moderate sunlight",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}