{
    "remaining_requests": 9205,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Elite-Video-Doorbell/dp/B071DZYTKY",
    "body": {
        "name": "Ring Video Doorbell Elite",
        "price": "$349.99",
        "originalPrice": "",
        "rawPrice": 349.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Elite-Video-Doorbell/dp/B071DZYTKY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09XQ3S88X"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/311EYCTyAkL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/318CNxn3g6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4102WG8bAtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ME0Az6y-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CVJbiKl5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ul -fj9JL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 477,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Connect your Ring doorbell with Alexa to hear announcements on your compatible Echo device when your doorbell is pressed and see a live view of your camera if you have an Echo device with a screen. Talk to visitors by saying “Alexa, talk to the front door”",
            "Lets you see, hear and speak to visitors from your phone, tablet and PC",
            "Sends alerts as soon as motion is detected or when visitors press the Doorbell",
            "Connects to ethernet cables for power and internet connection",
            "Monitors your home in 1080HD video with infrared night vision",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "Includes privacy features, such as customizable privacy zones and audio privacy, to focus only on what's relevant to you."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Average Install Time",
                "value": "Professional installation required"
            },
            {
                "name": "Video",
                "value": "1080p HD Video, Live View, Night Vision"
            },
            {
                "name": "Field of view",
                "value": "160° horizontal, 90° vertical"
            },
            {
                "name": "Motion Detection",
                "value": "Advanced Motion Detection"
            },
            {
                "name": "Audio",
                "value": "Two-way audio with noise cancellation"
            },
            {
                "name": "Power",
                "value": "Power over Ethernet"
            },
            {
                "name": "Internet requirements",
                "value": "Requires a minimum upload speed of 1Mbps, but 2 Mbps is recommended for optimal performance."
            },
            {
                "name": "Setup Requirements",
                "value": "Professional installation required. Ethernet wiring run from internet modem to door. Hole in wall for low-voltage bracket."
            },
            {
                "name": "Connectivity",
                "value": "802.11 b/g/n Wi-Fi connection @ 2.4GHz or 5.0GHz, Ethernet"
            },
            {
                "name": "Operating conditions",
                "value": "-5°F to 120°F (-20.5°C to 48.5°C), Weather Resistant"
            },
            {
                "name": "Available colors",
                "value": "Satin Nickel, Pearl, Venetian, Black"
            },
            {
                "name": "Dimensions",
                "value": "4.80 in x 2.75 in x 2.17 in (11.94 cm x 6.98 cm x 5.51 cm)"
            },
            {
                "name": "Box includes",
                "value": "Video Doorbell Elite, Satin Nickel, Pearl, Venetian, and Black Faceplates, Low-Voltage Bracket, 50-ft. (9.14-m.) & 3-ft (1-m) Ethernet Cables, Elite Power Kit, Mounting Hardware, Screwdriver, User Manual, Security Sticker"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Video Doorbell is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Video Doorbell support page."
            },
            {
                "name": "Disclaimers",
                "value": "1Ring Alarm and all Ring Alarm accessories require a subscription for in-app features and digital notifications, including but not limited to: digital arming / disarming and integration with other Ring, Echo, Alexa, and third party products. Subscription sold separately. View Ring Protect Plans for pricing and details. Customer reviews may reference features that require a subscription."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Juan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5TYYGP7YAK4SIVHJTZZCKRJTNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6SUB7W4A500E?ASIN=B071DZYTKY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesom product",
                "reviewText": "I have like 2 years with this product and it still working pretty well, the installation was very smooth",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGECA5JYDDJFWZITXFBTF7RJSD7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OHF4H5ZUD61J?ASIN=B071DZYTKY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 3, 2017",
                "reviewTitle": "5.0 out of 5 stars Review updated - Now it works flawless",
                "reviewText": "I am updating my review from below because its not longer valid. I noticed my Ring Elite was updated to firmware version 1.8.21. Now I'm getting full high def video. It now works exactly as advertised. I'll leave the old review just for edification. But as of 8/10/2017, the device works flawless.Old reviewI will start this by saying that I am a Network Engineer. In fact my specialty is Voice/Video over IP. My house has a very elaborate network inside of it that is of better quality than the average business network. I am providing an absolutely ideal network for this device to function within.A previous person complained about the ethernet jack being at the bottom and it being difficult to place this inside the junction box. I personally did notice the same when I installed mine. But I was able to get it in very easily. I certainly wouldnt knock any stars off for that. So why did I only give it two stars? Great question. Well most important is this thing is no where near 1080p. Maybe, just maybe the camera itself has a CCD that can do 1080p, but the stream coming off this unit is of exceptionally poor quality. When reviewed on my computer (or handheld) the video is very washed out and grainy. Being that I work with loads of video over ip products, I would compare this to a Cisco 9971 which runs at 320k using h.264 30fps.Second complaint is that it only rings the indoor chime about 50% of the time. I'm sure someone from Ring would love to say that its my wireless signal thats the problem. Negative. I have a Meraki MR32 sitting about 15 feet away from the chime. My Meraki portal says the signal strength is 28db. Thats more than adequate. I also hadnt mentioned this, but my Ring Elite is hard wired to my Cisco 3750G POE switch. So that is also not a wireless problem.Third complaint is they are not doing anything about firmware updates. I'm currently sitting at 1.7.22. I've seen a 1.8 and a 1.9 firmware come out. I asked tech support and was told that both of these firmwares had problems and had gotten pulled out of production. I'm glad they didnt break my device. But c'mon. When are you going to write a new firmware. I'd like to think that my complaints would be resolved with a new version.I'm giving it two stars because I wouldnt return the device. It rounds out my smart home design, and I dont know of a comparable product that is flush mount and poe. Its no where near worth the $500 price point. I personally think its worth maybe half that. (maybe). I also think the poe injector that is included should be an option buy as to lower the price of the unit. Why did you include a $100 injector if I dont need one. I would have appreciated paying $100 less.If Ring would like to reach out to me, please feel free. Considering I have the perfect test network I'd love to help you resolve your issues. I can offer pcaps and firewall logs to help isolate whatever is wrong. I originally attached a video to my review so you could see the video quality. But Amazon rejected my review.",
                "reviewVotes": "432 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "earwax",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7GZWIZOJMG2BAL4TTSCG3IJU5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFYI0BRSFZLI7?ASIN=B071DZYTKY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2017",
                "reviewTitle": "5.0 out of 5 stars Elite over Pro",
                "reviewText": "The media could not be loaded. I had a lot of trouble with the Pro, simply because I needed outside power. That was with the transformer and resistor. Ultimately, with repeated tries, I left the digital doorbell on before another attempt at installation; and apparently fried the Pro.I bit the bullet and got the Elite. I'm somewhat of a geek, but the instructions were easy to follow. I ran the cable to the DSL WiFi router Ethernet outlet, with the power model plugged into the supplied Cat 5 cable. All worked just fine with a great picture, Ethernet connection and no WiFi to fool with. The digital doorbell was always close to the WiFi router, and linked to the Elite easily. Well worth the extra cost to me. Simple to install, and great video, etc. to see! The video is 160 degrees from the front door to street covering about 6 house lots.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e89beec6-2c2d-435b-b50a-438e04fa3b95/default.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "TangoZulu",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2WVALM3RW4VAS4XTZAA4ZZ7Z3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4GD7YVGHZX0N?ASIN=B071DZYTKY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2020",
                "reviewTitle": "4.0 out of 5 stars So Far, Very Good",
                "reviewText": "I am a systems/web programmer, and I am always cautious about devices that are complex and have potential security implications. We have many \"smart\" devices in our home, but we are careful about what we install, and try to avoid anything important that relies on WiFi, with the associated reliability and security issues. For that reason, we have avoided video doorbells until now. We have a new house, which was not set up for a doorbell, except for a CAT-6 cable to the front door, so it was clear what was intended. I decided on the Ring elite because of the Ethernet connection, which improves both reliability and security. The build quality is very good, the device is attractive, and the installation proceeded exactly as described with no issues. Make sure you have sufficient room behind the electrical box; a shallow box will not do! If you have to install in a concrete wall, you will need to have a deep recess (I spent hours \"chipping\" concrete before we could install it). Motion sensing seems to work well, but we turned it off because of wildlife on the property. The first night, it woke us up three times; two with a frog crawling over the lens, and once with the deer! We did have one app crash on the second day, and had to delete and re-install the app, but we have not had any problems since. Access \"sharing\" with others was a little problematic, and appeared to be related to the app crash, so we gave the account number to the rest of the members of the family, and that has worked fine. The doorbell signal seems reliable. We installed the Ring Chime unit, so that we did not have to have the phone to know the doorbell had been rung. The chime installed and worked without issue. It is unfortunate that Ring does not provide a chime with Ethernet connectivity (the device only works with WiFi). There is only a slight delay (1-2 seconds) between the button press and the ring on the phone and chime. Voice communication is loud enough, clear enough, and has a short enough delay to be reasonable and useful. A big plus for us is that the Ring app apparently will support multiple devices, so if we continue to have good reliability, we will consider installing additional units at the gates, which are a considerable distance from the house (fortunately, we also have CAT-6 to the gates, so we will not have to rely on WiFi there either). My advice is to make sure you have very good bandwidth, at least on your local network. Video devices in general tend to become very cranky and troublesome if they do not have sufficient bandwidth; they generally do not degrade gracefully, and I suspect the Ring is no exception. The \"smarter\" they are, the more likely you are to have trouble, and the Ring is pretty smart. The ring app has functions to control other kinds of devices, but we will not do that; I deleted all those shortcuts. I am convinced (from extensive programming experience) that the more \"stuff\" you add to an app the more likely you are to have conflicts, bugs, and problems. The device does have artificial intelligence functions, such as recognition of people (as opposed to deer) but we have not yet tested that. My overall assessment remains that if you want the highest reliability, use a standard wired doorbell. If you need video, or want remote access, the Ring Elite is \"not perfect, but much better than expected so far.\" Personally, I would still stay away from video doorbells that rely on WiFi, and I certainly would not integrate them with door locks or anything with security implications.",
                "reviewVotes": "41 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}