{
    "remaining_requests": 9209,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Floodlight-Cam-Wired-Plus/dp/B08F6DWKQP",
    "body": {
        "name": "Ring Floodlight Cam Wired Plus with motion-activated 1080p HD video, Black (2021 release)",
        "price": "$199.99$199.99",
        "originalPrice": "",
        "rawPrice": 199.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Floodlight-Cam-Wired-Plus/dp/B08F6DWKQP",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BW543RH8"
        ],
        "asinVariationValues": [
            {
                "asin": "B08F6DWKQP",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01knkd266mL._SS36_.jpg"
            },
            {
                "asin": "B08F6GPQQ7",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/21jiXVT2ZUL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41mDa4PNNZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/318MjQiIR S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41VVshO 2-S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51iUFZ2oXWS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41cM4DD F-S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41ekpCYUYFS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rcXPG-X5S.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 33561,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 7 hrs 3 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Tomorrow, February 17. Order within 15 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1080p HD security camera with motion-activated LED floodlights, 105dB security siren, Two-Way Talk, and customizable motion zones.",
            "Get motion-activated notifications on your phone, tablet or PC and check in at home anytime with Live View all in the Ring app.",
            "Customize motion zones in the Ring app to fine-tune which areas you want to focus on.",
            "Eliminate blindspots or dark areas with built-in Color Night Vision and two LED floodlights.",
            "Easily hardwire to the outside of your home and connect to wifi for around-the-clock power and peace of mind.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "For added peace of mind, pair with Alexa to help you keep an eye on your home. Connect with Alexa to hear motion alerts on your compatible Echo device or see a Live View with an Echo Show, Fire TV, or Fire Tablet. Talk to visitors by saying, “Alexa, talk to the front door.” With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring Floodlight Camera detects a person."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Average install time",
                "value": "15-25 minutes"
            },
            {
                "name": "Video",
                "value": "1080p HD, Live View, Color Night Vision"
            },
            {
                "name": "Field of view",
                "value": "140° horizontal, 80° vertical"
            },
            {
                "name": "Motion detection",
                "value": "Advanced Motion Detection with Customizable Motion Zones"
            },
            {
                "name": "Audio",
                "value": "Two-way audio with noise cancellation"
            },
            {
                "name": "Siren",
                "value": "Remote-activated 105db siren (level measured at 4 inch/10cm distance)"
            },
            {
                "name": "Lights",
                "value": "Two 3000° Kelvin with 2000 Lumen floodlights"
            },
            {
                "name": "Power",
                "value": "Hardwired (110-240V)"
            },
            {
                "name": "Internet requirements",
                "value": "Requires a minimum upload speed of 2 Mbps for optimal performance"
            },
            {
                "name": "Connectivity",
                "value": "802.11 b/g/n Wi-Fi connection @2.4GHz 902-928 Mhz Radio"
            },
            {
                "name": "Operating conditions",
                "value": "-4°F to 122°F (-20°C to 50°C), Weather Resistant"
            },
            {
                "name": "Available colors",
                "value": "White, Black"
            },
            {
                "name": "Mounting base",
                "value": "Integrated mounting base with adjustable light and cameras angles. Mounts on 4 inch round weatherproof electrical box (not included)"
            },
            {
                "name": "Dimensions",
                "value": "11.7in x 7.03in x 9.67in (29.9cm x 24.6cm x 17.9cm)"
            },
            {
                "name": "Box includes",
                "value": "Floodlight Cam Mounting Bracket Installation Tools and Screws User Manual Security Sticker"
            },
            {
                "name": "Setup requirements",
                "value": "4 inch round weatherproof electrical box with AC power wiring"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Security Cameras is subject to the terms found here. License information can be found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Security Cameras support page. Click here to learn more information about Linked Devices."
            },
            {
                "name": "Generation",
                "value": "Ring Floodlight Cam Wired Plus - 2021 release"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Ring device, visit Software Security Updates in Ring Control Center for information specific to your device."
            },
            {
                "name": "Disclaimers",
                "value": "1Ring Alarm and all Ring Alarm accessories require a subscription for in-app features and digital notifications, including but not limited to: digital arming / disarming and integration with other Ring, Echo, Alexa, and third party products. Subscription sold separately. View Ring Protect Plans for pricing and details. Customer reviews may reference features that require a subscription."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Chard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQHGX6ZOAMSPGRMTGXEQEXE6ABQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Q1Z83WCE7O32?ASIN=B08F6DWKQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Couldn't ask for better",
                "reviewText": "Easy to install and works well. Very versatile in changing the settings and detects very well. Picture quality during the day and at night is very good.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amaz_Shopping",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3EAJHEEIE32LHNLGKJPCM3DRMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RURN0DRYN9U0V?ASIN=B08F6DWKQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Ring Floodlight Cam Wired Plus: A Top-Tier Security Solution",
                "reviewText": "I've had the Ring doorbell for quite some time now, and I recently integrated the Ring Floodlight Cam into my setup. Its robust and weather-resistant design and adjustable dual LED floodlights not only ensure durability but also add an extra layer of security to the surroundings. The video quality is great, delivering sharp and detailed footage both day and night. The motion-activated sensors are highly responsive, minimizing false alarms, and the customizable motion zones provide a tailored security experience. The two-way audio feature, facilitated by a built-in microphone and speakers, allows for seamless communication. Installation was a breeze, with clear instructions and inclusive tools. The Ring Floodlight Cam offers reliability, clarity, and user-friendly features that make it a valuable addition to any smart home.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kraig L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWSZQULXPKT27WLGK5SAZMP3DWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26XIDQSMH8J1B?ASIN=B08F6DWKQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars This is the best camera - lighting security you will find",
                "reviewText": "I liked how simple it was to install. I watched a YouTube video while following the instructions. The only thing I had to purchase extra was a ground wire to go from my old fixture to the ring. It was very straightforward to install. My video is crystal clear. Wide viewing area. Spot lights are blinding bright perfect for my back deck. The motion sensor works great and the time for the lights to shut back off I have set for 30 seconds if no motion detected. Love this purchase. I access the ring app from work to check on my home and the alerts come on my phone to easily view. This I would definitely recommend.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Johnny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2DWARQ4HR6MBA6UOTMPB6MVZ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7CTW66RU3E5T?ASIN=B08F6DWKQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "5.0 out of 5 stars The Ultimate Security Upgrade - Outstanding Performance in Black!",
                "reviewText": "The Ring Floodlight Cam Wired Plus in sleek black is nothing short of a home security marvel. This motion-activated 1080p HD video camera, paired with powerful floodlights, has taken my home security to a whole new level, and I couldn't be more impressed.First and foremost, the installation process was surprisingly easy. The detailed instructions and included hardware made mounting this security powerhouse a breeze. The ability to replace an existing floodlight fixture with this all-in-one security solution is a genius design choice.The video quality is outstanding. The 1080p HD video is crystal clear, day or night. The camera's infrared night vision ensures that I can monitor my property around the clock, with no compromise on clarity. The wide field of view captures everything I need to see, whether it's my front yard, driveway, or the entrance to my home.The motion-activated feature is incredibly responsive and customizable. I can easily adjust the motion sensitivity and zone settings, ensuring I receive relevant alerts without unnecessary notifications. It's also great to have the option to set schedules for the lights and camera based on my preferences.The floodlights themselves are exceptionally bright, providing an added layer of security and peace of mind. I appreciate that they can be activated remotely through the Ring app or when motion is detected. This is not only a deterrent for potential intruders but also a convenience for me and my guests.The Ring app is user-friendly and feature-rich. It allows me to access the live video feed, receive alerts, and even communicate with visitors or potential intruders using the built-in two-way talk feature. It's like having a virtual security system in the palm of my hand.One of the standout features is the integration with other Ring products and the ability to connect with third-party smart home devices. This enhances the overall security network and makes the Ring Floodlight Cam Wired Plus a central component of my smart home ecosystem.In conclusion, the Ring Floodlight Cam Wired Plus in black is a remarkable home security investment. It offers exceptional video quality, powerful floodlights, and seamless integration with the Ring ecosystem. It has not only enhanced the safety of my home but also my peace of mind. I highly recommend this product to anyone seeking top-tier home security with a touch of style. It's a five-star performer that truly delivers on its promises!",
                "reviewVotes": "76 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edskilove",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMLA2G22AFXDM5R26TDJVUTL6YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28DUF4ILBTXKH?ASIN=B08F6DWKQP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "5.0 out of 5 stars I have 10 of these Ring Cams around my house... I love them",
                "reviewText": "Ring is a good company and their cameras are effective. These Ring Camera Floodlights are great. The light is bright, the Alexa connectivity works great, and the motion sensing works well. I have them all around my house and garage, and I cover every inch around the perimeter of my home. Ring support is great. I've had problems with my cameras and Ring support did a great job troubleshooting and eventually replacing a few of my cameras when they went bad with their extended support that comes with being a paid subscription Ring customer. The quality of the picture is great and I was able to install all of the camera's myself. I consider myself a very capable DIY'er and these were no problem to wire and install. Highly recommended. One unintended benefit are the nature videos that the Ring cameras provide. I live near a park in the middle of a major city, and very often my Ring cameras will catch foxes, rabbits, raccoons, opossums, and other animals as they traverse my yard during the overnight hours. I never suspected that the animals were as active as they are. I also was able to help my local police department when there was a break-in in my neighborhood and one of my cameras captured a suspicious individual as he passed by my home. But you have to remember, these cameras are deterrents and don't always stop crime from occurring. Someone stole the catalytic converter from my car as it was parked in my driveway right under a Ring camera at 3am. The only thing that the camera did was record the 3 minutes that it took the thief to steal my catalytic converter and when the motion lights came on, it made it easier for him to see. At one point he looked dead into the camera, but since he was wearing a ski mask, the police were still not able to identify him... But at least I had the evidence. Oh well. Just know the camera's limits and don't expect them to stop most thieves if they're properly motivated.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "susan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB6A2F37OCPD2OTF5P3ZKKKJLOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LBQR0G1MOXET?ASIN=B08F6DWKQP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Good quality. Decent install instructions",
                "reviewText": "Works well and does exactly what you want it too. Couldn't ask for a better quality flood light/cam. The only complaint is the the base plate that attaches to the house was too thin and didn't exactly fit my previous set up.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}