{
    "remaining_requests": 8903,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Introducing-Ring-Solar-Pathlight-Motion-Sensor/dp/B07YPB8TBS",
    "body": {
        "name": "Ring Solar Pathlight - Outdoor Motion-Sensor Security Light, Black (Bridge required)",
        "price": null,
        "originalPrice": "",
        "rawPrice": null,
        "currency": null,
        "canonicalUrl": "https://www.amazon.com/Introducing-Ring-Solar-Pathlight-Motion-Sensor/dp/B07YPB8TBS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B083N36MNZ"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "30",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31lUZDgFnZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21sgWMZ0VpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qjRPwYKCL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41wiyB4X1FL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jOXJT1o2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51-pA0JlDsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41W428OEg5L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3644,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Perfect for walkways and pathways – a solar-powered pathlight that shines 80 lumens of light when motion is detected.",
            "Ring Bridge, Ring Alarm Pro, Echo (4th Gen) or Echo Show 10 (3rd Gen) required to enable smart features, such as mobile notifications and customizable settings.",
            "Smart features – when connected to a Ring Bridge or compatible Echo Device,, get mobile notifications, set schedules, turn the lights on and off, customize settings, and connect to other Ring devices – all from the Ring app.",
            "Easy setup – connect to the Ring Bridge or compatible Echo Device, customize your settings via the Ring app, and place in your ideal location.",
            "Powered by the sun – place your Ring Smart Light in direct sunlight to recharge and store power.",
            "Works with Alexa – pair with select Alexa-enabled devices via the Ring Bridge to turn lights on and off at the sound of your voice.",
            "Ring of Security – group your Ring Smart Lights together and connect to your other compatible Ring devices through the Ring app to always know what’s happening around your home."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Lights on anytime, anywhere Add Ring Smart Lighting to any area of your home and control them from the Ring app. Turn lights on or off while you’re away, set schedules, and even link your lights to your compatible Ring video doorbells and cameras to see what happens when your lights detect motion.",
                "value": "A smarter way to connect your home security Create a connected network with the Ring Bridge. Group your Ring Smart Lights together to turn lights on and off in designated areas around your home and pair with Ring doorbells and cameras to always see what’s happening when motion is detected. Only one Ring Bridge required per household. Required for smart controls in the Ring app. One ring Bridge supports approximately 50 Ring Smart Lighting devices, including Motion Sensors."
            },
            {
                "name": "Complete control from the Ring app Expand your Ring of Security by grouping your Ring Smart Lights together and connecting your compatible Ring devices through the Ring app. When one light detects motion, it can tell the other lights in the group to turn on and tell your Ring doorbells and cameras to start recording.¹",
                "value": "Works with Alexa The Ring Bridge connects to your Ring Smart Lights with select Alexa-enabled devices to activate lighting and adjust settings at the sound of your voice."
            },
            {
                "name": "Approximate install time",
                "value": "5 minutes"
            },
            {
                "name": "Power type",
                "value": "Solar Power or Rechargeable via Micro USB cord. 3.7V 18650 Lithium Ion Cell"
            },
            {
                "name": "Lighting",
                "value": "Up to 80 lumens (adjustable), 3500K Color Temperature"
            },
            {
                "name": "Motion detection",
                "value": "Adjustable motion detection. Up to 120° field of view, detection angle dependent on distance from unit. 15’ detection range."
            },
            {
                "name": "Auto shut-off time",
                "value": "Adjustable (30s to 2m) via Ring app"
            },
            {
                "name": "Operating conditions",
                "value": "-4°F to 120°F (-20°C to 50°C). Weather Resistant (IP66 Rating)."
            },
            {
                "name": "Available colors",
                "value": "Black"
            },
            {
                "name": "Dimensions",
                "value": "16.8 in x 4.33 in x 4.33 in (426.4mm x 110mm x 110mm)"
            },
            {
                "name": "Box includes",
                "value": "Ring Smart Lighting Solar Pathlight, Mounting Stake, 18650 Lithium-Ion Rechargeable Battery, Micro SUB Charging Cable, User Manual, Security Sticker"
            },
            {
                "name": "Setup requirement",
                "value": "Insert into soil or gravel. Ring Bridge required for smart controls on the Ring app and to connect with other Ring products"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty. Use of Ring Smart Lighting is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Ring Smart Lighting support page."
            },
            {
                "name": "Disclaimers",
                "value": "1Ring Alarm and all Ring Alarm accessories require a subscription for in-app features and digital notifications, including but not limited to: digital arming / disarming and integration with other Ring, Echo, Alexa, and third party products. Subscription sold separately. View Ring Protect Plans for pricing and details. Customer reviews may reference features that require a subscription."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Brian M Tillotson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMFRJST4T3HY4KZSTYLXFNMHYCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHCRX1CB0C4KH?ASIN=B07YPB8TBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 27, 2022",
                "reviewTitle": "5.0 out of 5 stars ***UPDATED***Didn't last 2 years",
                "reviewText": "****UPDATE****After writing my review below, A representative from Ring reached out. We did some troubleshooting and discovered it was the batteries. They tried to send me some batteries for free. Unfortunately, they were back ordered. Instead they replaced all the lights. This resolved my issue. This was customer service at their finest. I figured I was out of luck due to being out of warranty. But, they made it right. I now recommend this product.Original Post:I bought 8 of these in November 2020. They worked great until July 2022. The solar panels are no longer charging the battery on half of them. Which is a bummer. They are out of warranty. They currently cost $34+ to replace a piece. Other than that, they worked great and provided enough light for our stairs going to the house.",
                "reviewVotes": "22 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kasual K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIKZ76BUDWL3TDLIFL3IXVL4LTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHNZKZY2J7EBV?ASIN=B07YPB8TBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Battery issues need to be addressed",
                "reviewText": "Purchased a total of 8 Ring solar path lights w/ bridge in August 2021. When I contacted Ring a year later, in August 2022, about my solar path light issues, tech support was very helpful and worked through troubleshooting my problem. It came down to drained batteries that would not recharge sufficiently to power their devices. I was informed that batteries are not covered under their warranty and they no longer provide replacements.I purchased the replacement lithium ion batteries that they recommended . The path lights started functioning again; however within 2 weeks all my batteries had discharged and were not recharging even though solar path lights are and have always been in full Arizona sun. Plugged in cable charger and now batteries only charge to 85% & will only light up while on the charging cable while inside the house. Not useful!A year of great solar lighting out of the original set of Ring rechargeable solar batteries is a fair expectation here in AZ. Why don't you sell the same Ring batteries as replacements? While I am a big Ring fan, I am extremely disappointed with this particular Ring product. The battery is the weak link here. Ring, you need to step up your game here and sell the proper replacement batteries! You also need to be upfront with the customer and market the path light as needing solar batteries replaced after some number of charges.",
                "reviewVotes": "50 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mulvena714",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUTINNWZTXCHX2IOJMDHUFQH4CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RL5I0ZJZDT4J8?ASIN=B07YPB8TBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Ring Solar Pathlight - Illuminating Security with Elegance and Efficiency!",
                "reviewText": "The Ring Solar Pathlight 4-pack Starter Kit has exceeded my expectations, combining outdoor lighting with advanced motion-sensor security in a sleek and stylish design. This set of solar-powered pathlights is a game-changer, adding both aesthetic appeal and enhanced security to my outdoor spaces.The solar-powered feature is a standout, harnessing the power of the sun to keep my pathway illuminated without the need for constant battery changes. The motion-sensor technology adds a layer of security, lighting up the path whenever motion is detected, providing both visibility and a deterrent to potential intruders.The black finish of the pathlights is not only elegant but also discreet, seamlessly blending with the outdoor environment. The 4-pack starter kit offers comprehensive coverage, allowing me to illuminate key areas around my property.The installation process was straightforward, and the connectivity to the Ring app provides convenient control over the lights and motion settings. Whether it's enhancing the safety of my walkway or adding a touch of sophistication to my outdoor landscape, the Ring Solar Pathlight has become an integral part of my home.It's a 5-star product that delivers on efficiency, style, and advanced security features. Highly recommended for anyone seeking a reliable and visually appealing outdoor lighting solution!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Becker",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQNOYKMLOTJLQE763L75HTKLCOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS1HC2ROC13Y4?ASIN=B07YPB8TBS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 24, 2023",
                "reviewTitle": "4.0 out of 5 stars I use to love Ring products, but not anymore",
                "reviewText": "The solar pathway light are garbage!!!! I got about one good year out of them, then they stopped working. Cannot find any information on getting replacement batteries, so I guess I’m out of luck. I have several different Ring products and and they work fine, but these solar pathway lights are a waste of money. I’d love someone from Ring to let me know where to get replacement batteries.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SB",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWOMI425QIZY557RJMPZVFUHRAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q68QSL753V06?ASIN=B07YPB8TBS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Love the solar power!",
                "reviewText": "I love the fact that these lights are solar powered! The look nice and work great, not having to replace the batteries is an added bonus!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}