{
    "remaining_requests": 9220,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Video-Doorbell-Pro-2/dp/B086Q54K53",
    "body": {
        "name": "Ring Wired Doorbell Pro (Video Doorbell Pro 2) – Best-in-class with cutting-edge features (existing doorbell wiring required)",
        "price": "$229.99$183.52",
        "originalPrice": "$249.99",
        "rawPrice": 229.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Video-Doorbell-Pro-2/dp/B086Q54K53",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08WR5HPGX"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41fd70FiGGL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21SXi8rdx3L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31Nc U2DcqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZyP4y nUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41iWna-698L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51EJf9jTSxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KeKr6QtlL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 8180,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 49 mins",
            "FREE delivery Thursday, February 22. Order within 14 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Premium wired video doorbell with Head-to-Toe HD+ Video, Two-Way Talk with Audio+, 3D Motion Detection, built-in Alexa Greetings (an exclusive Ring Protect Plan subscription feature), and customizable privacy settings.",
            "See more of who stops by and check in on package deliveries down low with improved 1536p Head-to-Toe HD+ Video.",
            "Know when someone’s in your front yard with advanced motion settings and get more accurate real-time alerts in the Ring app.",
            "Pinpoint motion and distance with 3D Motion Detection and Bird’s Eye View, an aerial view to track motion around your home plus map out your detection to only get alerts about specific areas with Bird’s Eye Zones.",
            "Speak to visitors when you can’t get to the door with built-in Alexa Greetings, an exclusive feature with a Ring Protect Plan subscription.",
            "Hardwire Wired Doorbell Pro (Video Doorbell Pro 2) to your existing doorbell wiring and doorbell chime inside using the included tool kit for around-the-clock power and peace of mind.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Bo's Dad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQSXYOW62CFXQKKD4UMLEKLJR7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PNTM4USHT27K?ASIN=B086Q54K53",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2022",
                "reviewTitle": "5.0 out of 5 stars Love it! Upgraded from the Ring 2. Huge improvements!",
                "reviewText": "I had the Ring 2 before this and it would not connect to the Router WiFi in another room, I had to use a wifi extender and for what ever reason the Ring 2 would go off line every so many days. I would have to unplug the wifi extender to reset it to get the Ring 2 to reconnect. The view range on the Ring 2 I did not like as I could not see the floor of the porch like I now can with the Ring 2 Pro. Now that I have the Ring 2 Pro, the video picture is much better, but what I love the most is that the thing has yet to go off line. It is reliable such that it catches everything as it never goes off line (at least not yet and it has been a week or so now).I also like that it loads faster in the app than the Ring 2. I have it set to take a photo every 30 seconds, which is nice and already saved me on a delivery in which the delivery app said that the driver made the delivery, but there was no motion that put the camera on at that time, but since I had the photo taken every 30 seconds I was able to provide the photos to the delivery app to prove that there was no delivery car or driver on the driveway or my porch showing photos taken every 30 seconds. Had I not had this new Ring Pro 2 that stays online and takes those photos, I would have been out $40 for that delivery. So this new door bell already has saved me $40.The motion detection range is also nice that I can have it cover the lawn and drive way, but clearly not the side walk so when people walk their dog it does not go off. But, if someone is in my lawn it will go off. I also love that this has the recording live all the time, so when it detects motion it has many seconds before the motion was detected so that I have the person coming on the drive up to the porch and can see the the entire time later. The Ring 2 I had before, at times did not have the motion detected right away and the video would come on when a delivery person was near the front door dropping the box off. This at times made it hard to see the face of the person, the video did not get them from far away.Now that I have this new Ring Pro 2, I can see the people coming from far away and since they normally do not see the ring door bell until they get close people are not looking away. This provides much better video to show police if ever needed, to see who the person that came to the door was. Huge benefit of the Ring 2 Pro.I am thinking of getting a Ring Spotlight or Ring Floodlight next with the video, but if they do not have this level of video I may get other Ring Pro 2 devices and install as this video quality and reliability is really good.The installation I had problems with at first, because the old transformer was not getting enough power to the door bell. The Ring Pro 2 takes more power than the Ring 2 did, or the battery in the Ring 2 was enough power to make up for it.The issue I had with my old transformer on the door bell power line, was that when I put the Ring 2 Pro on it, the inside door chime bell that is a old mechanical style would not ring. It did for the old Ring 2, but not for the Ring Pro 2. The Ring Pro 2 requires a power adapter be put on the mechanical chime inside or the inside Chime would make a loud buzzing noise when the door bell was rang and it would not stop for minutes, and then the chime inside kept going off every so many seconds. When I put the inside Chime power adapter back on the inside chime, it would not make the buzz sound, but it also would not ring. The app said there was low voltage, at 15v.We took off the old transformer in the basement for the doorbell, it was hooked up to a light blub socket in the basement. Very odd place to put it, and was hard to find it. Once we changed that old transformer to one for the Ring Door Bell Pro 2, it fixed the problems. The door bell rang inside on the chime correctly.The error message on the device health in the app for the voltage transformer did not go away, it still says in the app there is only 15V to the Ring Pro 2, but the direct feed from the new transformer to the Ring Door Bell 2 is direct and all the functions work perfect. No idea why the error message is still on the device health in the app, it has been many days now, it is still there, but everything works fine.The night mode, color night vision, and HDR, etc. I had to change the settings to get the best picture at night as I have a light by it that is always on and a white wall by it, so I could not get the ideal picture, but got it to work best after trying many variations of the settings.The door bell chime inside, for the mechanical bell, was also wired odd to my settings, we tried many different changes to it, but turns out that had we just changed the transformer from the start it would all worked.I would say just buy the new transformer and plan to install it with the Ring Pro 2, now having this work perfect and never going off line, and all the functions work perfect. I did not get the transformer at first and wanted to save a few bucks, but trying to do it that way caused huge frustration. If I had it all to do over again, I would replace the transformer if it is old, and or if you did not get a new one that you know for sure has the power needed to the Ring Pro 2. That way you know the power feed is correct and chances are it will save you half a day of trouble shooting as well as issues down the road if it goes off line or has trouble with the night vision video.Also, finding the old transformer may be tricky, mine was in the basement on a old light socked, but at first I was looking in the wall by the inside chime bell, it was not there. All in all this is really great new product and I do not see ever needing to change it. The old Ring 2, I had problems with from near the start. I wish I had this new Ring Pro 2 from the start.",
                "reviewVotes": "274 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AFMerc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFP746GUJX6PRFKSRMCLLWJU7T2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYYLXVINGE4Y1?ASIN=B086Q54K53",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars The Future of Doorbell Security Unveiled!",
                "reviewText": "I recently upgraded to the Ring Video Doorbell Pro 2, and I'm absolutely thrilled with its performance. This is undoubtedly the best-in-class video doorbell on the market. The Head-to-Toe HD+ Video is a game-changer, offering a crystal-clear view of everything happening at my doorstep. The improved 1536p resolution ensures that I can see more details than ever before, making it easy to identify visitors and monitor package deliveries with precision.The advanced features like 3D Motion Detection and Bird’s Eye View provide an unparalleled level of control over motion settings. I can now customize alerts for specific areas around my home, minimizing unnecessary notifications. The built-in Alexa Greetings feature is a fantastic touch, allowing me to communicate with visitors even when I'm unable to answer the door. The seamless integration with Alexa-enabled devices enhances the overall experience, providing convenient in-home monitoring and instant announcements.Installation was a breeze, thanks to the included tool kit and the option to hardwire it to existing doorbell wiring. With the Ring Protect Plan subscription, I can review recorded videos for up to 180 days, ensuring I never miss a moment. The peace of mind and security this device offers are truly unmatched. If you're looking for a top-notch video doorbell with cutting-edge features, the Ring Video Doorbell Pro 2 is the way to go. It's a smart investment that brings your home security into the future.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vahid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUDJTFJYC65H3NGXJOO2FJEAN6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JYAV3GHBYV3I?ASIN=B086Q54K53",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Great video Door Bell Supports 5GHZ Wifi",
                "reviewText": "I have 2 Ring doorbells, a Doorbell 3 and a Pro 2. The version 3 was installed four years ago in Florida. After the first year, all of a sudden Doorbell 3 stopped working in the middle of summer - we were up north. I checked the device health and the battery had discharged to less than 5%. It did not work until the fall when we went back to Florida.I have an electrical engineering degree - so I know a little about electricity. The doorbell had been connected to the previous mechanical bell transformer which was 20 years old. So, I called Ring and fortunately they send me a replacement because the device was still under warranty. So, I replaced the old one with the new one. During the following summer months, same story - the battery discharged and never charged back.When we went back to Florida, I decided the replace the 20 year old transformer. Home Depot sells them for $20 bucks and they are Ring certified. It has been 2 years since and I have not had any issue with the battery discharging. However, the battery is now 4 years old and I will probably replace it - it costs $32.For the new Pro2 which I just installed in our house up-north, I actually ordered a new Ring transformer for $23 since the existing one is 30 years old. I installed the new transformer and the power-pack. We have a mechanical doorbell. I have not had any issues with the doorbell and everything works just fine. I like the Pro 2 much better than the 3 because it does not have any batteries. The Pro2 version has many nice features including a birds-eye view which shows the front door landing space in case someone drops a package. It also has a separate \"package alert\" which detects someone delivering a package from 30 feet away. Yesterday, I had a package delivery and sure thing, it sent me a text alert when the guy was 20 feet away.The installation and setup was easy and Pro 2 offers the usual features of a Version 3 and more. An important feature is that it supports 5GHZ wifi channel which obviously is a lot faster than 2.4GHZ for streaming videos. It also comes with Welcome message feature which warns people that they are being recorded when they approach the door and trigger motion detection. You can turn it on or off. During the setup, it asks if you want the Birds-Eye view feature and then shows an aerial Google map of your house and asks that you pin-point the exact location where the doorbell is installed. This is a great feature since it allows you to edit the motion detection zone aerially and have a very focused zone which does not necessarily have to be square.The one negative thing about Ring company is that they force you to purchase a separate \"Basic Protection\" plan at a cost ~ $45 a year for each camera if they are not installed in the same location. This is really bad business practice and Amazon/Ring should reconsider it. Lastly, I have had three encounters over the years with the Ring tech support and they have been excellent.",
                "reviewVotes": "110 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}