{
    "remaining_requests": 9216,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Introducing-Ring-Video-Doorbell-Wired/dp/B08JN8FBWD",
    "body": {
        "name": "Certified Refurbished Ring Video Doorbell Wired – Convenient, essential features in a compact design (existing doorbell wiring required) - 2021 release",
        "price": "$44.99",
        "originalPrice": "$54.99",
        "rawPrice": 44.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Introducing-Ring-Video-Doorbell-Wired/dp/B08JN8FBWD",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41l1kR6Ii9L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/311oI0uykvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51smVdjucgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518tDut3NpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gXXgdbmtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41meqv90j4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zS1id5HJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5222,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A Certified Refurbished Ring Video Doorbell Wired is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device. Certified Refurbished Amazon devices may be packaged in generic Amazon-branded boxes.",
            "1080p HD wired video doorbell with two-way talk, advanced motion detection, standard 2.4 GHz connectivity and customizable privacy settings",
            "Get real-time notifications sent straight to your phone. To hear audio notifications in your home, pair with a Ring Chime, compatible Alexa device, or select the Video Doorbell Wired + Chime bundle. Note: the doorbell will not sound your existing chime.",
            "Advanced motion detection helps you know when someone’s at your front door before they ring your doorbell",
            "Night vision with sharp contrast ensures you’ll never miss a detail – even in the dark",
            "Hardwire Video Doorbell Wired using your existing doorbell wiring and the included tool kit for around-the-clock power and peace of mind",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 60 days, and share videos and photos",
            "Connect with Alexa to hear alerts on your compatible Echo device or see a Live View with an Echo device with screen. Talk to visitors by saying, “Alexa, talk to the front door.”"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "James M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHF4A2XWNBKTIIKFDWYUEG7UBZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CK4I70C23JMA?ASIN=B08JN8FBWD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2022",
                "reviewTitle": "5.0 out of 5 stars Buy refurbished & save 40% or more",
                "reviewText": "The ring classic video doorbell is by far the best value out there. It performs better than any of the ring doorbells with a battery and with a subscription gives you all the desires you really need. The very few features it doesn’t have are not possibly worth paying 5x more the cost. Every feature you need this doorbell has with a subscription. If your looking to skip the $100/year subscription then Ring isn’t the right product for you. All of their products depend on a subscription for any real use. For example no ring doorbell has the ability to store video or photos other than live calls. So if you want to see what has happened after the fact you are out of luck with all Ring products. To record and recall video you are required to pay for a subscription. However for only 3.99/mo per camera you get recordings. Better deal is 100/year for unlimited cameras which is a pretty great deal. So decide if you want to install cameras to cover your home and pay the 100/ year fee and this is a great system. This doorbell I think is the best value. The battery ones don’t work all that great bc they are asleep and by the time they begin to record your just going to catch the back of someone’s head. Since this doorbell requires a power line it can pre-record and is essentially constantly recoding but only sends events where motion is detected. The huge deal I discovered is the battery cameras can’t pre-record. In other words once it sense motion 5 seconds before the motion was sensed is saved as an event that you can quickly scroll through. Without this feature these cameras are pretty worthless. We had a battery powered unit and even ran power to it and it constantly Missed anyone who passed by the door. The battery units even missed people entering then house. So if you want Ring be sure you can run a power line and get one of the powered models. If you look carefully this is the best version to purchase. The other versions have a few feature but at the end of the day all you need is this version. Get a refurbished one which looks like new and has all the parts and save almost 50%. So for less than $60 you can have video survelanxe if your front door (plus the membership fee.)Ring is the only camera that offers true integration with Alexia where when someone rings your doorbell it is announced on Alexia and with a quick routine added when someone rings your doorbell the image automatically is shown on your Alexia. No other camera system to my knowledge can do this with Alexia. So if you have an Alexia with a screen get this doorbell and with just 3.99/mo you have the start of a decent security system for your front door. Since these only cost about $50 each you can easily afford to cover your back door.Quick tip if you want to arm and disarm cameras you will need to get the ring alarm base kit. Which integrates with the 100/ year camera recording. For only $200 year you get real live home monitoring like ADT for a price that no other alarm company can come close to. 200|year for full home monitoring and unlimited cameras is the best deal you can find anywhere.Again if you need a battery powered recorder and don’t want to pay month fees other cameras allow local recoding without any fees. So if you need a battery model that can pre-record or don’t want to pay subsription fees Ring is NOT the right system for you.For anyone who wants video recoding to the cloud which is the only way to record that the their can’t erases then this is the system for you. Additional cameras are not expensive and for just 100/ year you can have you house covered with cameras.If you want to add the alarm look on eBay and you will find the security system add on that starts off at 199 for as little as $50. This will allow you to arm/disarm the system. There are some cameras you don’t want constantly giving motion alerts and recoding you when your home. So the ring alarm panel is the best way to toggle modes on/off.Overall this is the least expensive camera doorbell and offers all the features you need. Avoid the battery doorbell at all costs. Even if you run power they miss events. This one doesn’t miss anything.Hope this helps. I’ve tied 4 alarm systems and 3 versions of the ring doorbell. By far this is the best version. Hands down. Don’t think of using the battery ones. They miss events and are pretty much worthless.Hope this helps.",
                "reviewVotes": "149 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MacAmazon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXT7SZBRDZODYYBUJG7WFJEGI5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R215RD381ODGNT?ASIN=B08JN8FBWD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Works like new",
                "reviewText": "My husband had no trouble installing this camera. And I set it up quickly. Only problem I had was not with the camera. The wind was howling and blew the little screw out of my hand. But there was a spare included in the package. I’m glad I got it. It works great.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth King",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVE4OP4HZZLXRVTMODI5D6A3HBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R161L7WSBEBPNU?ASIN=B08JN8FBWD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Love my ring",
                "reviewText": "Picture is clear, sound is great and I love the different functions this offers, it’s easy to use and set up and I also like the notifications helps to let me know what’s going on in my area/neighborhood, I know when a delivery is made, has motion detection and let’s if someone is at my door, this is a great system",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCSJMKX35SPKAKSKZBRNQCJOYEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CFTTAJAF8YAE?ASIN=B08JN8FBWD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Double think these.",
                "reviewText": "The unit I purchased is the hard wired unit. The cons:1- the way they have you wire this unit does not allow for your existing doorbell to function at all at this location, forcing you to buy either their doorbell or the echo units which will now provide the chime. Which2- the night vision distance from the unit only goes out to about maybe 6-8 feet at most if you’re lucky.3- the setup was a pain in the butt, I had to remove it from the door frame after we had installed the unit to gain access to the QR code on the unit because the QR code “tag” provided in the box was NFG and did not function as directions had explained.4- be prepared to purchase a subscription to save any pictures or video.5- the picture refresh rate is very slow and video jogs ie not seamless video action, you can actually miss someone at your door.Pro’s:1- daytime view is excellent. Nice wide view.2- they do work but just enough to get by.3- The sound works just ok. microphone to hear someone speak at your door sometimes gives unwanted feedback sound.Nice concept but not well executed. In summation: there are more cons than pros in my opinion.",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rob N.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMJ7OQDX4CHMTXMYQP6UH53UC5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/REXPZUN12Y422?ASIN=B08JN8FBWD",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "1.0 out of 5 stars Certifies Refurbished",
                "reviewText": "Do not buy a certified refurbished Ring video doorbell from Amazon. I purchased one, and I was not able to activate it even after contacting directly Ring customer representative. The issue is Amazon’s refurbished doorbells lack proper registration information, causing the inability to add the device to the Ring application. This problem led the Ring customer service representative to advise (after consulting with his manager) to deal with Amazon directly to return the product and get a refund. I lost a few hours of my life dealing with Ring, Amazon, and the UPS store to rerun this defective product. I do not recommend purchasing a certified refurbished Ring product from Amazon.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jesus and Cyndi",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOA2ZSAHGAMX6A7A3TE3QJN5CXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DJPP7OMDV4SJ?ASIN=B08JN8FBWD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Really good video",
                "reviewText": "I searched around for the best Ring and blink doorbells that I specifically wanted to hardwire. Every ring doorbell was over $60. I found this refurbished wired ring for $29. Everything was included and there was protective film on the lens, it looked brand new. Installation was easy. My doorbell doesn't face straight out the front door and I thought this would be an issue. However, the field of view from the camera is unbelievably good! It integrated amazingly with my ring app no problems. I possibly would have spent $150+ on the newer battery ones but no need to. This has motion detection, clear as day video and recording capability through a subscription. Awesome purchase, very happy.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pax Wengerd",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY7FZLXTHULJ3QF3F7MIE5JSCNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RABG61DMSK59E?ASIN=B08JN8FBWD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Works as if it was brand new",
                "reviewText": "Great quality and it came with no scratches or signs of wear. Works perfectly for my family. Had very good sound quality, and good image quality with the upgraded plans.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Samuel Newman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFPQIIK75DKUOVNKAHGPZMAGWPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1STTSCX33UX5J?ASIN=B08JN8FBWD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 25, 2023",
                "reviewTitle": "5.0 out of 5 stars it works great!",
                "reviewText": "This was my 2nd ring wired doorbell. I was a little hesitant to get a refurbished one since I know sometimes they can be a pain to get activated since they may have been registered to someone else. My only issue was, the QR code on the book was invalid. I had peeled the QR code off the side of the doorbell thinking I had the one on the book and had waded it up and threw in the trash. I tried for 2 hours with the qr code in the book and had actually started a return, until I found the sticker in the trash that i pulled off the side of the doorbell. Once I scanned that code, I was able to activate it.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}