{
    "remaining_requests": 9211,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Certified-Refurbished-Video-Doorbell-Pro/dp/B07GG3XXNX",
    "body": {
        "name": "Certified Refurbished Ring Video Doorbell Pro, with HD Video, Motion Activated Alerts, Easy Installation (existing doorbell wiring required)",
        "price": "$139.99",
        "originalPrice": "",
        "rawPrice": 139.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Certified-Refurbished-Video-Doorbell-Pro/dp/B07GG3XXNX",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B087CRZSP3"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/317oOvRlttL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41Rk8bpicoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 ATIsofBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qxut5rXpL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 18837,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 16 hrs 48 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Tomorrow, February 17. Order within 16 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A Certified Refurbished Video Doorbell Pro is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device.",
            "1080p HD video doorbell that lets you see, hear and speak to people from your phone, tablet, or select Echo device. Includes privacy features, such as customizable privacy zones and audio privacy, to focus only on what's relevant to you.",
            "Get notifications whenever motion is detected by customizing your motion zones.",
            "With Live View, you can check in on your home any time through the Ring app.",
            "Easily setup your Ring Video Doorbell Pro by connecting to wifi via the Ring app and mounting in your desired location.",
            "Connects to existing doorbell wiring for constant power. Requires a transformer (not included): 16-24VAC, 40VA max, 50/60Hz. No halogen or garden lighting transformers; no DC transformer/power supply.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 60 days, and share videos and photos.",
            "Connect your Ring doorbell with Alexa to hear announcements on your compatible Echo device when your doorbell is pressed and see a live view of your camera if you have an Echo device with a screen. Talk to visitors by saying “Alexa, talk to the front door.”"
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Drew LankfordDrew Lankford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6E5Q77BOF4P47UEKRTCCMZ65NQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NJF7GQAJVGR0?ASIN=B07GG3XXNX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 11, 2019",
                "reviewTitle": "5.0 out of 5 stars Works great and great piece of mind with a couple of caveats before you buy",
                "reviewText": "Cliff notes*************It's great assuming your doorbell transformer meets Ring's voltage recommendations, your wifi signal strength is adequate, you properly configure motion detection settings/alerts and your internet connection speed is decent. Video quality is adequate but not great. It's good enough to see what is happening at your door.*************We have a couple security cameras already but they are wired to an NVR recording box and the notifications are so slow or don't even send that I can't really rely on it for real-time notifications.For a while I've resisted the notion of paying for surveillance when I can just get a cam with built in SD storage and a nice app like the Wyze cams (which I have inside and love) but having motion and video alerts and footage that can't be stolen or storage get corrupted and a well made phone app is worth $3 a month. I also like that if I decide to add more Ring cameras I can add as many as I want with the 10 dollar plan. Take notes here Nest.As for the doorbell itself, install was straight forward. I did have to upgrade my transformer for this. I installed the Endurance pro 24v unit. It was only a few bucks more than the 14v devices which apparently are the bare minimum Ring recommend. I figured that the extra voltage gives me some headroom to add a smart thermostat if I decide to do that in the future and after discovering how much of a pain it was to access my doorbell transformer in the attic, I'm glad I only had to do this once. Make sure you locate yours before deciding on this model doorbell or the Ring 2 which would have been at least an hour or two shaved off the install time.Once I setup the motion detection zone, basically all false positive alerts are gone. I have the motion detection setting in the middle of the 5 settings. Lowering it doesn't detect the postman at the mailbox despite it being in the motion zone.Notification on my phone is instantaneous. I tested while walking up to the door and it had notified me and I had pulled up the app before I even got to the door both when connected to my home wifi and when on LTE. The remote chime installed without any issues as well.Speaking of home wifi, this seems to be a big sticking point for some owners. I used an android phone app to measure signal strength at my door and it was around -60db (the closer to 0, the stronger the signal). As a network engineer who has implemented numerous small business and commercial wifi installations, for reliable video streaming, I would say if your signal strength at the door is -65 or closer to zero, you're good. If it's higher than -65 like -70 or -75~80, I would strongly recommend investing in upgrading your home wifi with a decent mesh setup like google's wifi, Orbi or EERO mesh. This will allow you to have a wifi access point closer to your door offering a much stronger signal for the doorbell to connect to. Wifi range extenders are hit or miss. They're less expensive than upgrading to a mesh setup but those have to piggyback off your existing wireless instead of just being a part of it and is generally more trouble than it's worth for the average user to setup.The final piece of this working well is your internet speed both upload and download. If you are in a rural area with less than a 10 Mbps connection down and less than 2 Mbps upload, you will probably not have the best experience as this thing is both having to upload/stream video data to Ring's servers and your phone is having to stream/download it from their servers. Ring's video is not that high of bitrate (quality) but still needs to stream that data to their servers before you can even download/see it.If your ISP is metered, you need to be aware that the doorbell is constantly sending video footage. Mine has uploaded 600 megabytes of data in 4 days. At that rate, it will transfer about 4.5 gigs of data in a month. If your data is capped, be sure that you have the headroom to allow the doorbell to stream video footage. FYI it needs to stream this because if something is triggered, that portion of the stream is probably flagged as something you should see and it snips the motion detection part of the stream and sends it back to you. This is why you see your activity video and at first nothing happens and then you see whatever it is that triggered the motion alert. It was recording before it actually saw something move.The only real gripe I have is that sometimes when you open the app to view an event that just got recorded, the app will say that it's processing and not available to play yet.",
                "reviewVotes": "897 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71KD+aSgPCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71L741XEzCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71O8cEcRtZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71cf1MQBmlL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Parikh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3SMTEGA4K7XSK2RPWEJR2RDLTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25TZ03UNPEJJB?ASIN=B07GG3XXNX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 19, 2022",
                "reviewTitle": "5.0 out of 5 stars New update: Ring replaced the faulty device and it works great!",
                "reviewText": "Latest update - Based on my review below, Ring team immediately reached out to me and offered replacement product that arrived in no time. Brett (service person) was amazing in listening to my concern, admitting the faulty device and immediately sent me the replacement. Thank you Ring team - this is exactly an experience expected out of the Amazon brand. The device works flawless and we are very pleased.Old review - Pathetic product and shocked to see Amazon building something like this. We bought this and spent $200 for the electrical wiring. It worked initially with very poor connectivity, had to do setup couple of time as it would reset on its own. Finally, stopped working in couple of weeks. Quite disappointed!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CarlCarl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGF664KVH34JOLFQNTNN6X4XJ7OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZDGU1YKSF6DM?ASIN=B07GG3XXNX",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2021",
                "reviewTitle": "5.0 out of 5 stars Refurbished? Why not!",
                "reviewText": "I've been slowly adding smarthome devices, and adding a video doorbell has been on my list for a while. With a family of 5 that sees frequent visitors, this was a must for us. Installation was easy and so far the experience has been worth it! For $100 during the holidays, this is a steal! Refurbished products are sometimes just returned, open-box items that go through testing. They may even get a new outer shell replacement and look like new again. The package I received was sealed and I couldn't tell a difference! Worked as expected, but here are some thoughts about the product itself...Before installation, you need to verify you have a transformer that's outputting a strong enough voltage. For the Ring Pro, the company recommends at least 16v, and you can use any cheap multimeter/voltmeter to measure (if you can't find the voltage labeled on your transformer). For me, I simply had to lift the cover off of my wall-mounted door chime to see the transformer. I measured it there, but another easy way to measure is at the doorbell itself. Remove the screws and tilt so you can access the back side. You'll have two wires going into leads. Doesn't matter which one you select as positive and negative when measuring. Fortunately, mine was outputting 19v.Once verified, the rest of the process is pretty straight forward. A nice step-by-step guide comes packaged with the device, but Amazon also has an online tutorial. There are also countless YouTube videos if you need visual guidance.For me, the most frustrating part was connecting to Wi-Fi. It will work with a 5GHz signal, but your 5GHz Wi-Fi network must allow 802.11n (Wireless N) connectivity. I only have that available on my 2.4GHz band, so at first I couldn't get it to connect until I figured that out. Generally, 2.4 GHz is better for penetrating walls and other obstacles, but 2.4 GHz tends to also be saturated with more congestion from other smarthome devices that typically rely on that band (and you may have interference from neighbors that live really close to you). Your mileage may vary. There is a signal strength reading referred to as RSSI, and you can see this in the Ring app after you get everything working. On the 2.4 GHz band, I'm usually getting -55 for the reading, and Ring recommends a minimum of -60 (higher is better, so -55 is better than -60). Optimally, you want this number in the -40s or better. Living on the edge of acceptable has led to an occasional choppy video or two out of every 10 videos, so it's not hateful.If you want to keep recorded videos so you can play them back later, you'll need to pay for a subscription plan to store them in the cloud. One Ring can use a \"Basic\" subscription for $40/year, but you'll need to upgrade to \"Plus\" for $100/year if you add more. My biggest gripe here is that Amazon should find a way to merge both Ring and Blink (both owned by Amazon) into one subscription plan. Currently both brands require separate subscriptions. Don't do what I did and buy Blink cameras to go with your Ring doorbell!As for other features, I love the fact that the Pro version gives you the option to customize your motion zone, and even add multiple zones with different sensitivities. Very helpful in reducing the number of alerts you receive. Ring also records audio and video at both ends, meaning I can hear what I'm saying as well as the visitor when I play back an \"answered ring\". Not every competitor does this, though more and more products on the market are beginning to add this feature. I also like the 1080p resolution, and the night vision is decent. An added bonus in the box is that you also get faceplates in multiple colors, allowing you to better match your door trim, if you so choose.-----------------------Conclusion:This is a must have! After a lot of research (in late 2020), reading/watching comparisons online, it seems the Ring Pro is still leading the pack, even if only by a hair. In a future version of the Ring Pro, I would like to see an option to schedule live recording. Say I want to record uninterrupted between 11pm - 5am, I should be able to. It would also be nice if Ring offered more mounting accessories, like an extension bracket that would allow my Ring to get past the brick that's partially blocking my view (as shown in my pic). Nothing being offered by 3rd-party suppliers solves that little issue.In the end, don't hesitate to choose Ring over the competition, and refurbished is a good way to save some money!---Update: 12/6/2023---I have since upgraded the Wi-Fi in the home, actually in late 2022, and choppy video is completely a thing of the past. I can't remember the last time I had an issue with a recording! If you still have an old Wi-Fi router, it may be time to try to get it replaced from your ISP. They will usually do it for free, or consider changing ISPs.",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81DvKGs7ZnL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chevygrrl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCMBHI4CSTRHIJHHZTTVABFTROA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4KUC4JVPBMF2?ASIN=B07GG3XXNX",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars This Is for Wired Ring only.",
                "reviewText": "I liked it but was unable to use it bc I live in an apartment. No pre wired doorbell to attach it too.I didn’t realize it stated wired doorbell use only.Returned item with all materials in condition received.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}