{
    "remaining_requests": 9150,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/No-Drill-Mount-Ring-Video-Doorbell/dp/B086F27DQF",
    "body": {
        "name": "No-Drill Mount for Ring Video Doorbell (2020 release)",
        "price": "$17.99",
        "originalPrice": "",
        "rawPrice": 17.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/No-Drill-Mount-Ring-Video-Doorbell/dp/B086F27DQF",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08DLTB25K"
        ],
        "asinVariationValues": [
            {
                "asin": "B086F24DK9",
                "variationName": "Style",
                "variationValue": "For Ring Video Doorbell 3, 3 Plus, and 4",
                "price": "$19.99",
                "variationImageURL": ""
            },
            {
                "asin": "B086F27DQF",
                "variationName": "Style",
                "variationValue": "for Ring Video Doorbell (2020 release)",
                "price": "$17.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OQdNCnBML.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41jrwKw4pML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41NydTj0Y0L.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 8773,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 15 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "No-drill mount that lets you attach Ring Video Doorbell (2020 release) to your home without drilling",
            "Weather-proof, durable mount that uses strong, non-damaging adhesive to keep your doorbell securely attached to the wall",
            "Easily setup by adhering No-Drill Mount to your wall, and then attaching your Ring Video Doorbell (2020 release) to the No-Drill Mount",
            "Easily remove the mount by detaching your Ring Video Doorbell (2020 release) from the mount and pulling up on the adhesive strips",
            "Only works with Ring Video Doorbell (2020 release)",
            "Dimensions: 6.207cm x 1.337cm x 12.662cm / Operating Conditions: -20°C - 70°C at 35% Humidity, Weather resistant",
            "No-Drill Mount will be most effective on even and smooth surfaces. It may be difficult to adhere to brick, shingles, and rough stucco surfaces. It should not be mounted on glass. In all cases, the wall should be wiped clean before attaching the No-Drill Mount."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Val ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMPE4TH6IOX6Y5COZDY25Q6YWLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DM7X5VD32L0O?ASIN=B086F27DQF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Secure Your Ring Video Doorbell Without Drilling: A Guy's Review of the No-Drill Mount",
                "reviewText": "As a guy who loves technology but doesn't want to damage my home's walls, I was excited to try out the No-Drill Mount for my Ring Video Doorbell. I have to say, I'm really impressed with this product!The No-Drill Mount is weather-proof, durable, and uses strong non-damaging adhesive to keep my Ring Video Doorbell 3 securely attached to the wall. The setup was incredibly easy – all I had to do was adhere the No-Drill Mount to the wall and then attach my Ring Video Doorbell 3 to the mount. I didn't need any special tools or experience, which was great.Another thing I love about the No-Drill Mount is that it's easy to remove. If I need to take down my Ring Video Doorbell 3 for any reason, I can simply detach it from the mount and pull down on the adhesive strips. There's no need to worry about damaging my walls or leaving behind any residue.The No-Drill Mount is also very versatile. It's designed to work with the Ring Video Doorbell 3, Ring Video Doorbell 3 Plus, and Ring Video Doorbell 4, and it's weather-resistant, which is great for someone like me who lives in an area with extreme weather conditions.Overall, I highly recommend the No-Drill Mount for anyone who wants a secure and easy-to-install solution for mounting their Ring Video Doorbell without drilling into their walls. It's durable, weather-resistant, and easy to remove, making it a great investment for anyone who wants to protect their home without damaging it. Just keep in mind that it works best on even and smooth surfaces, and it may be difficult to adhere to certain surfaces like brick or rough stucco.",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sharon O.Sharon O.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7JNIF66YYJC6EOABJR6P333MQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27C5DDUGQ64MJ?ASIN=B086F27DQF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Hung securely",
                "reviewText": "I had ordered two no drill mounts for my ring. After reading the reviews about the actual ring no drill mount I decided to keep the ring no drill mount. I did have concern some of the reviews indicated that the mount didn’t stay up. Some reviews said that after they put gorilla tape on the mount they had no more problems with the no drill mount falling down. My no drill mount with ring attached has been up now for a few weeks I’ve had no problem with it falling off my door. I did use gorilla tape also to ensure that It wouldn’t fall off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61cjr-0dpfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary says it truthfully",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCOUC4CNAVUYYZ2VZ6HX5HXQAPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22J2SSSBNRJT6?ASIN=B086F27DQF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Even Hulk couldn’t rip this thing off!",
                "reviewText": "Love this doorbell holder! After purchasing a wireless Ring doorbell, the thought of drilling into my house gave me more anxiety than I needed (because I am so talented with a drill that if I tried to drill my whole house would come down 🤣), so I decided to look for alternatives. This product didn’t disappoint! I did worry about the adhesive not sticking enough and someone being able to come pull it right off, but I’m fairly certain even Hulk couldn’t rip this thing off my house (which causes a bit of concern when it comes to the paint on the house but oh well - you can’t have it all and at the end of the day I’d rather know if I’m being robbed than have paint on my bricks). It was very easy to install (and I’m not the brightest bulb in the bunch when it comes to putting things together - I am the person who just has to look at a manual and is instantly and completely lost), very reasonably priced, and has held up well so far. If you like your Ring doorbell but don’t want to lose your house in the process, definitely try this product - You won’t regret it!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Unspoken Yum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JCQEWME2H6ZGCDIRIQWUKHSRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34I1SXQ97QXTV?ASIN=B086F27DQF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars The Peacekeeper Between Your Doorbell and Your Doorframe",
                "reviewText": "The Ring No-Drill Mount for the Ring Video Doorbell series is like a diplomatic envoy in the world of home security – it ensures your doorbell and your beloved doorframe can coexist in harmony without any drilling drama. This gadget is the answer to the prayers of renters, the tool-averse, and anyone who breaks into a cold sweat at the thought of drilling holes in their pristine doorframe.First off, the installation is so easy, it almost feels like you're cheating. With this no-drill mount, you can have your Ring Video Doorbell up and spying on your postman in less time than it takes to make a cup of tea. It's like LEGO for adults; snap it on, and voilà – you're now part of the modern world of home security, with zero damage to your door.The design deserves a hat tip. Sleek, unobtrusive, and as sturdy as a steadfast guard, it blends with your doorbell seamlessly. It's like Ring's designers looked at the doorbell and the mount and said, \"Now, kiss.\" The result? A match made in home security heaven.But let's not forget the real MVP here – the adhesive. This isn't just any sticky stuff; it's like the superglue of the mounting world. It clings to your doorframe with the determination of a toddler clutching a favorite toy. Rain or shine, your Ring doorbell isn't going anywhere – unless you decide it's time to move it.The compatibility is spot on, too. It fits the Ring Video Doorbell 3, 3 Plus, and the Video Doorbell 4 like a glove. It's the kind of precision that makes you wonder if the mount and the doorbell were soulmates in a past life.TL;DR: The Ring No-Drill Mount is the perfect solution for anyone wanting home security without the commitment of drilling holes. Easy to install, sturdy, and as reliable as your favorite pair of jeans, it's a must-have for renters and drill-phobes alike. Your doorbell will thank you, and so will your doorframe.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "O.P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRMIWXP2CEUMRMIVLH7UODA5VNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R260I6X5YFACM5?ASIN=B086F27DQF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Works great! Does NOT work on brick",
                "reviewText": "I live in a rental and wanted something I could use that would require no drilling. I figured it would just work out of the box, but unfortunately it fell off after I tried holding it on for a few minutes. I ended up replacing the adhesive with the spare they give you and then adding gorilla adhesive tape. It then worked how it is described!Four stars because for the price of $20, it should at least do what it says it will do on common hours exterior like brick. Good product otherwise.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yannie ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2024",
                "reviewTitle": "Ring Mount",
                "reviewText": "This ring mount is easy to install and doesn’t damage the exterior of your home. Highly recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Markus Leitner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 14, 2024",
                "reviewTitle": "Passt.",
                "reviewText": "Montage ist simpel, hält sehr gut, macht was es soll.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tich",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 22, 2023",
                "reviewTitle": "Holds well",
                "reviewText": "This has been great and it has saved me from screwing into the PVC door surround. The sticky pads have held well and there is no sign that they will fail. Very easy to instal.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "No1",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on June 20, 2023",
                "reviewTitle": "Parfait",
                "reviewText": "Collé sur une porte vitrée",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hugo Miguel Ferreira Cardoso",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 10, 2023",
                "reviewTitle": "Qualidade",
                "reviewText": "Boa",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}