{
    "remaining_requests": 9215,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Chime/dp/B09L45VFCN",
    "body": {
        "name": "Ring Chime",
        "price": "$34.99",
        "originalPrice": "",
        "rawPrice": 34.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Chime/dp/B09L45VFCN",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B09Q5CKF72"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/419eNCbsIoL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31dsIozaXlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fFxbmO2uL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41x79nJtG9L.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 32207,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 17. Order within 3 hrs 48 mins",
            "FREE pickup Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 17. Order within 13 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Chime box to hear notifications for your Ring cameras and doorbells.",
            "Hear real-time notifications when your connected cameras and doorbells detect motion, or when someone rings your doorbell.",
            "Easily set up by plugging into a standard outlet and connecting via wifi.",
            "Choose from a variety of chime tones, adjust the volume to your ideal setting, and temporarily snooze alerts all from the Ring app.",
            "Connectivity: 802.11 b/g/n wifi connection 2.4 GHz."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amil Gehrke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEMPUDMRZXVDK7CEUQ7U2P7HRZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB6XD8SRJ7WTN?ASIN=B09L45VFCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Ring Chime: Small Device, Big Impact!",
                "reviewText": "cannot express how much I love my Ring Chime! This little device has made a significant difference in my home security setup. It's small yet powerful, delivering loud and clear notifications whenever activity is detected by my Ring cameras or someone rings the doorbell.One of the best features is the ability to turn off the light, which is perfect for nighttime when I don't want any additional illumination. The customization options are fantastic; I can choose from a variety of chime tones and adjust the volume to my liking, ensuring that I never miss an important alert.Setting up the Ring Chime was a breeze. I simply plugged it into a standard outlet and connected it via wifi using the Ring app. The app also allows me to temporarily snooze alerts if needed, giving me control over when I receive notifications.The connectivity is reliable, thanks to its 802.11 b/g/n wifi connection at 2.4 GHz. I've never experienced any issues with connectivity or performance.Overall, I highly recommend the Ring Chime to anyone looking to enhance their home security system. It's a game-changer in terms of convenience, functionality, and peace of mind.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7OO3VDJD62JG3TAKQ2LO2FN5FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4DZSXBS8ND30?ASIN=B09L45VFCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars This doorbell chime works well with my Ring doorbell",
                "reviewText": "The Ring video doorbell does not work with my regular chime. This product plugs into an Ac outlet and works on wifi to notify us whenever the Ring doorbell activates. It was easy to set up and is easy to hear throughout the house.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James A Bausano",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE24WJ54YCVTPPFVXOTK7HA5VJ6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z9LMB715BXAE?ASIN=B09L45VFCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars It works as advertised",
                "reviewText": "Easy to Insall. Works great. Installed indoor ring, little pricey but works great. When ever there is motion within 6feet of door it rings very loud in the house warning me someone is at the door. I need to ware hearing aids and this really helps.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWORQEZEAUHHW55CAOB2MJP6K5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PKRVB66EP3FL?ASIN=B09L45VFCN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "4.0 out of 5 stars Works great",
                "reviewText": "I wish I would’ve known about it sooner and got it sooner. It works that well, and the chimes are all very nice.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Unspoken Yum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JCQEWME2H6ZGCDIRIQWUKHSRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHAMNW3LROY6G?ASIN=B09L45VFCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars The Melodious Messenger of Your Front Door",
                "reviewText": "The Ring Chime is not just an accessory; it's the harmonious herald of your home's comings and goings. This device pairs with your Ring doorbell to serenade you with notifications, ensuring you're always in the loop, whether you're cozied up in the living room or lost in your backyard garden.First off, the sound quality is like a choir of angels compared to the harsh buzzes and beeps of traditional chimes. It's clear, crisp, and has enough volume to be heard, but not so loud as to startle your cat into next week.The setup is a breeze – so user-friendly that even your technologically challenged aunt could do it without calling you for help. Just plug it into any outlet, sync it with your Ring doorbell, and voilà, you've got yourself a digital doorkeeper.What's really delightful is the customization. The Ring Chime offers an array of chime tones, so whether you're a fan of classical ditties or prefer something more modern, there's a sound to suit your style. It's like having a personal DJ for your doorbell.And let's not forget its discreet design. The Ring Chime is sleek and compact, blending seamlessly into your home without screaming, \"Look at me, I'm a high-tech gadget!\"TL;DR: The Ring Chime is a must-have for Ring doorbell users. It's a simple, elegant solution to never missing a visitor again, offering customizable tones and ease of use that make it a standout in the smart home symphony.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "keytracke",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFD4APDKLIVPLFQXTFXJ5ZIETZPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VQFHATJA8ZX5?ASIN=B09L45VFCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Chime helped to amplify Ring doorbell",
                "reviewText": "I was was not hearing the Ring doorbell ring when I was in various other rooms in my house. The Ring signal was not as strong as it once was. The Chime helps to amplify and further support the Ring doorbell. I have not missed a doorbell Ring since I got the Chime",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HoneyCorn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNV55TNCC4QPZZFVHFSVVS4E6SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JJN6YJ8XC30W?ASIN=B09L45VFCN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Your Doorbell's Perfect Companion for Enhanced Home Security",
                "reviewText": "The Ring Chime has become an indispensable addition to my home security setup, and I can't recommend it enough. This sleek and compact device has transformed the way I stay connected with my doorbell and ensures that I never miss a visitor or an important package delivery. The Ring Chime is a game-changer for anyone looking to enhance their home security system.First and foremost, the setup process was a breeze. With just a few simple steps, I had the Ring Chime up and running in no time. It seamlessly connected to my existing Ring doorbell, and I was instantly able to receive audible alerts whenever someone rang the doorbell or triggered the motion sensors. The convenience it offers is unmatched.The Ring Chime's design is both stylish and unobtrusive, allowing it to blend seamlessly into any home decor. Its compact size means it can be placed anywhere in the house, ensuring that I can hear the doorbell no matter where I am. The adjustable volume settings allow me to customize the chime to suit my preferences, whether I'm in a quiet room or playing music at a higher volume.One of the standout features of the Ring Chime is its versatility. Not only does it provide audible alerts for the doorbell, but it also extends the range of the Ring doorbell's Wi-Fi signal. This means that I can receive notifications on my smartphone or tablet even if I'm far away from the doorbell itself. It's a fantastic solution for larger homes or situations where the doorbell might not be within earshot.Additionally, the Ring Chime's compatibility with other Ring devices is a major advantage. I have a Ring security camera installed, and the Chime seamlessly integrates with it. This allows me to receive alerts for both the doorbell and camera events, ensuring that I never miss any activity around my home. It's a comprehensive security solution all in one.Another impressive aspect is the Ring Chime's reliability. I haven't experienced any connectivity issues or false alerts since I started using it. The device consistently delivers timely notifications, giving me peace of mind knowing that I'm always aware of who is at my doorstep.In conclusion, the Ring Chime is a must-have accessory for anyone with a Ring doorbell or a Ring security system. Its easy setup, stylish design, and versatile functionality make it a valuable addition to any home. With the Ring Chime, you'll never miss a visitor or an important package delivery again. Enhance your home security and stay connected with this fantastic device.",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}