{
    "remaining_requests": 9214,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Peephole-Cam-doorbell-installation/dp/B0BLXZ6HLT",
    "body": {
        "name": "Ring Peephole Cam - Smart video doorbell, HD video, 2-way talk, easy installation",
        "price": "$129.99",
        "originalPrice": "",
        "rawPrice": 129.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Peephole-Cam-doorbell-installation/dp/B0BLXZ6HLT",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B081498PMW"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41eOzaJUG6L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/315Fg5lYiAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41DsdHt6FLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eZsqDvFJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VSwNx2iWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jFeo-Q5aL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/611FzveRUbL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/a485bbfe-4639-5225-bd9b-19f7bf3f4e79/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c38c2a26-7f07-4ac7-9eb8-f32ce45e36c8/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/3705830a-8b91-4d40-b90b-9d3a7dcba80b/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c83cfd3a-b5b3-4800-8724-249d449914ba/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b20c9107-3398-43b8-a1ea-0f12196304bc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41733212-3fe6-4cfd-8954-16acc1aca25b/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 17403,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 2 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Upgrade your door’s peephole with a 1080p HD video doorbell that enables you to see, hear, and speak to visitors from anywhere.",
            "Get alerts on your phone, tablet, and PC when anyone knocks on your door, presses the doorbell button, or triggers the motion sensors.",
            "Peephole Cam is easy to install and comes with all the tools you need to replace your peephole in under 5 minutes; no wiring or drilling required.",
            "Connect your Ring doorbell with Alexa to hear announcements on your compatible Echo device when your doorbell is pressed and see a live view of your camera if you have an Echo device with a screen. Talk to visitors by saying “Alexa, talk to the front door.”",
            "Advanced Motion Detection lets you easily adjust the built-in motion sensors to focus on and detect what’s important to you.",
            "Always know when you have a delivery and tell the courier to place your packages in an ideal location.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Average Install Time",
                "value": "5 minutes"
            },
            {
                "name": "Video",
                "value": "1080p HD, Live View, Night Vision"
            },
            {
                "name": "Field of view",
                "value": "155° horizontal, 90° vertical"
            },
            {
                "name": "Motion detection",
                "value": "Advanced Motion Detection with customizable motion zones"
            },
            {
                "name": "Audio",
                "value": "Two-way talk with noise cancellation"
            },
            {
                "name": "Power",
                "value": "Powered by removable battery pack"
            },
            {
                "name": "Connectivity",
                "value": "802.11 b/g/n Wi-Fi connection @ 2.4 GHz"
            },
            {
                "name": "Operating conditions",
                "value": "Indoors: 32°F to 104°F (0°C to 40°C) Outdoors: -5°F to 120°F (-20.5°C to 48.5°), Weather Resistant"
            },
            {
                "name": "Available colors",
                "value": "Satin Nickel"
            },
            {
                "name": "Dimensions",
                "value": "1.81 in. x 1.81 in. x 2.95 in. (46 mm x 46 mm x 75 mm)"
            },
            {
                "name": "Box includes",
                "value": "Ring Peephole Cam (including one rechargeable Battery Pack), Installation tools and hardware, User manual, Security sticker, USB charging cable"
            },
            {
                "name": "Door compatibility",
                "value": "Compatible with standard peephole sizes: 12mm (~1/2”) to 14mm (~9/16”) Standard Door Thickness Compatibility: 34mm (~1.3”) to 55mm (~2.2”)"
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Security Cameras is subject to the terms found here. License information can be found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Security Cameras support page."
            },
            {
                "name": "Generation",
                "value": "Ring Peephole Cam"
            },
            {
                "name": "Software security update",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more here. If you already own a Ring device, visit Software Security Updates in Ring Control Center for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "William A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA2OOC6J2TPA5GBESZBY3YKHR4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZFZ62DOIFRYA?ASIN=B0BLXZ6HLT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "I purchased the Ring peephole to replace my old optical peephole and to add a bit of security. The hole from the optical peephole was a bit big but the Ring was easy to install and the 2 pieces (3 counting the back cover) fit easily and covered the door hole on both sides of the door completely.The battery that came with the Ring needed to be charged which took a few hours but it came with a usb cable so it did not need a proprietary exotic charger, any usb wall charger will do.The removal of the original peephole was easy, just a pair of channel locks did the trick. The Ring came with a small simple tool to help with removing/install, but since my original peephole did not have \"notches\" on the eyepiece where the Ring tool would fit, channel locks were needed and worked great.Mounting the Ring was easy but be aware you will need both hands to hold the camera on the outside of the door and the mounting plate on the inside of the door and to screw on the mounting nut, this too was easy and the Ring tool worked great to tighten the mounting nut.Ensure your camera cable is pulled fully through the Ring peephole support tube (which also acts as a optical peephole) and is not twisted or kinked. Once the camera and back plate are orientated how you want them, fully tighten down the mounting nut and insert the fully charged battery.Setup is also fairly easy, and typical for new device setups. The Ring peephole connects via wifi and only takes a few minutes, if it appears to take a delayed period of time to connect to your wifi, there's a small orange reset button on the left side of the back mounting plate (I had to use the reset button myself) which restarts the wifi connect process and should connect just fine as mine did.You will have to log the Ring to your wifi account complete with your password and create a Ring account, once this is done you are ready to set your Ring options. Overall, it took me only around 20 minutes from removal of old peephole to having a fully functioning Ring. The options you will have to experiment with to achieve your desired settings.Linking my Android phone, my wife's iphone and both of our ipads to the Ring was also easy, just needed to download the Ring app to all the devices, log on to my newly created Ring account...doneThe camera quality is very good, especially for daytime, a nice clear picture with a fisheye view. The Ring peephole comes equipped with a door bell and speaker/microphone for communication with out opening the door. The door bell feature is great and sends alerts to your device when pushed, again you will need to adjust your Ring settings for each device for what alerts/notifications you want for them.Night view is also good though my porch light is directly above my Ring so there is a small bit of washing however, the Ring does a pretty good job of adjusting itself to give me a better than average viewing, with my porch light off, my viewing quality increases. If your porch light is placed to the side of the front door, your results may be better than mine but I am pleased with the quality I receive.I do suggest purchasing an extra battery (I did) and keep it charged to prevent any downtime when replacement is needed.NOTE: There is NO continuous live viewing!! Live view will timeout after about 3 to 5 minutes, then will ask you to reconnect for live viewing. This is something that Ring is aware of and future software updates may be in the works but for now no. Just don't buy this if you think you can use as an overnight video monitoring device for baby's room or property security..it can and does (depending on your settings) activate with movement/activity but not full on video monitoring. You have live viewing at will, just not for long durations.The \"non continuous\" viewing is the ONLY reason I didn't give this product a 5 star rating..it was easy to install, easy to setup, very good camera quality especially during the day (good night time) and lots of settings to adjust for your needs.I do highly recommend this product and will buy again",
                "reviewVotes": "30 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "#WearetheSmiths",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENYZJ3PSODESWRBTNXXZXPUN3DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RARAREM50ICC2?ASIN=B0BLXZ6HLT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 27, 2020",
                "reviewTitle": "5.0 out of 5 stars I didn't think I would, but I'm glad I did",
                "reviewText": "The Ring Peephole cam is an easy to install, effective and cost efficient home security device. With a price tag of $129, at time of purchase, you can start with this or add to an existing Ring system. They have Doorbell cams, Spotlight cams, everywhere you can cam.I was surprised how quickly and easily I was able to remove the old peephole and install the cam. The kit provides everything you'll need. A fancy key tool. That key tool is also the only tool you'll need for this install. I don't know your previous experience with peephole removal or installation, for me it was my first, but I was impressed how simple it was to do both with that fancy key tool.The kit provides you with stupid simple step by step instructions. They'll walk you through the removal of paint from the old peephole, to the connecting of the battery and placing of the back cover once you are all done. Simple and easy. It took a total of ten minutes to install and connect. I had a little issue connecting to my Wifi, but that was easily remedied.You will need to download the Ring app, found in your favorite app store, to complete the installation. There is a QR code you'll be scanning before you put on the back cover, just so you know. The app is how you control your new cam. Where you see who is at your front door, when you aren't home. There are a few neat features you can play with to fine tune what is picked up and what isn't.You can also look for the Ring Skill in the Alexa app so you can ask any of your Show devices to display your front door. Even your Fire TV cube will display a live feed. The video quality is pretty good, no matter how you are viewing. It's a fun thing to watch when you're bored of Netflix or YouTube.I've had to tinker with the motion sensitivity to find where I'll get the things I want and those I don't won't trip it. It's taken a few days but it works pretty well for the amount of traffic in my neighborhood. It's been a fun project to play with since we're all staying indoors these days.We likely add a couple more cams around from the line of Ring products available on Amazon. If not for the home security side of things, at least to see the outside while we're stuck inside. Windows only allow you so much. That's my review and my thoughts on the Ring Peephole cam. Enjoy",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}