{
    "remaining_requests": 9198,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Certified-Refurbished-Blink-Doorbell-Two-way/dp/B09G4CTT4G",
    "body": {
        "name": "Certified Refurbished Blink Video Doorbell | Two-way audio, HD video, motion and chime app alerts and Alexa enabled — wired or wire-free (Black)",
        "price": "$32.99",
        "originalPrice": "$44.99",
        "rawPrice": 32.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Certified-Refurbished-Blink-Doorbell-Two-way/dp/B09G4CTT4G",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C2YNM941"
        ],
        "asinVariationValues": [
            {
                "asin": "B09G4CTT4G",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$32.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/01JRptgu8MS._SS36_.jpg"
            },
            {
                "asin": "B09G4M76R8",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$44.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/010X8eDtC0L._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41TZnzSGh0L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21-6fE2hx7L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51yZxAzMnGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41IGHB6fWqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NfGPOqDwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41i2Bo-EutL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 2712,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 13 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "A Certified Refurbished Blink Video Doorbell is refurbished, tested, and certified to look and work like new and comes with the same limited warranty as a new device. Certified Refurbished Amazon devices may be packaged in generic Amazon-branded boxes.",
            "Answer your door no matter where you are from your smartphone with 1080p HD day and infrared night video and two-way audio.",
            "Experience long-lasting battery life, custom alerts, privacy settings, and more.",
            "Get alerts when motion is detected or someone presses Video Doorbell. Connect to existing doorbell wiring or pair with a Sync Module (sold separately) to engage live view and two-way audio on demand.",
            "Choose to save and share clips in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 and USB drive (each sold separately).",
            "Designed for every home, go wire-free or connect to doorbell wiring to also sound your existing in-home chime. Without wiring, you can use your Blink Mini camera (sold separately) as an indoor plug-in chime.",
            "Set up yourself in minutes with the two included AA lithium batteries then connect to wifi in the app.",
            "Works with Alexa — receive alerts and answer with two-way audio. When wired or paired with a Sync Module, just ask Alexa to answer the front door.",
            "Includes one Video Doorbell, 2 AA 1.5V Lithium Batteries, 4 Screws, 1 Case Opening Tool. Does not include Sync Module 2 which can be found in all “Systems” above (recommended for optimal use while on battery)."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jeremy Jones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXRJGFS3U7WRNWT77LNVSXUP7UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4Q8J7CNYZGCT?ASIN=B09G4CTT4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "5.0 out of 5 stars Overall good doorbell camera and excellent value",
                "reviewText": "I bought this because it was refurbished and was less money. I would be willing to pay the full price for a new model. But I really couldn't tell that this was touched at all, so it was totally worth the lower price. Setup was super simple. I connected it to a wired doorbell. It operates the existing chime perfectly. We get alerts when people get near the camera. The picture quality is probably not as good as some other options, but this was a good option for us. It integrates with the Blink Sync module, which works for us.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Saul Carrillo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE66V3DMY5I77N5473TE4JJNWGIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2URD9UBN2I90D?ASIN=B09G4CTT4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Good value",
                "reviewText": "Easy install..cheap plan..very useful and helpful...helps stave off porch pirates",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TeAira MatthewsTeAira Matthews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSR3NPSZIGMTEBBAD7F7ZXRHQ6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LA128NQUQ60P?ASIN=B09G4CTT4G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Very easy to set up",
                "reviewText": "I love it the camera is like a second behind on video but it works pretty well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711Dr1XcMzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQDDDBXFNS5CXEBCIOM4CPBES7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QNBUBIUB8FQA?ASIN=B09G4CTT4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 30, 2023",
                "reviewTitle": "5.0 out of 5 stars DO NOT BUY THIS BRAND - Not made for security",
                "reviewText": "5 stars so my review gets noticed.The camera quality is just okay. Microphones are pretty good.Camera always misses the actual movement that set it off and starts recording about 4 seconds later. Looks like people appear out of thin air on the camera. Camera will sense movement as people approach the door but only begins recording after they have left, or will appear as though they just materialized out of thin air on the top step.If somebody vandalizes your door or steals a package from you, you will not see it on the camera. It will only start recording after the event has happened that the person is gone, leaving you with dozens of videos of an empty stoop.THIS IS NOT A FREE SERVICE. IF YOU DON'T PAY A SUBSCRIPTION, YOUR CAMERA WILL STOP WORKING. All of their ads say that you can use basic features without a subscription plan- this is not true. Your camera will stop taking videos after 2 months. The subscription is $10/month.Might be a cute camera system to watch your dog on, or chat with your friendly neighbor when you aren't home. However, if you are purchasing this for security reasons: pay the extra dime for a better brand.It is not worth the subscription costs to capture dozens of videos of an empty porch AFTER somebody has swiped your packages and walked away.",
                "reviewVotes": "84 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "justareview",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE23T3TNETAGHAWIDPRQGRMVLSRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N7KH01UJW3IC?ASIN=B09G4CTT4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Love the blink system",
                "reviewText": "I got this doorbell to replace a camera on my back deck. I already replaced my other cameras with the wired blink floodlight cameras and since I pay for unlimited blink and it comes with a warranty for all my blink cameras as long as I am a subscriber it just made sense to replace my back camera also. I figured my front porch blink doorbell does a good job so why not go the cheap route. Unfortunately I didn't realize I needed to get another transformer to power it on my doorbell system until I tried hooking it up to my existing one so until I pick one up tomorrow it's stuck in some mode which gives me limited functions and it's terrible however I already ran all the wire and have everything ready so it will only take 10min to pop new transformer in. These definitely need to be hardwired otherwise they're worthless. That being said so far I'm happy. It covers the area I wanted and has good quality videos.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PDT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXBZYENVVLENXMKDDETKEKOYSHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2REI4MYRFA4J9?ASIN=B09G4CTT4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Good replacement - but different mounting bracket compared to older camera",
                "reviewText": "I bought this to replace a Blink doorbell camera that had stopped detecting movement.I was initially confused with this new camera, as the mounting bracket is significantly different from my older Blink doorbell camera, but otherwise looked identical. At first I could find no way to connect this to my existing mount. However, in the box, under the camera, is a box containing a new mounting bracket. Once I replaced the old mounting bracket with the new one, it installed perfectly.This new camera has a battery compartment door, which significantly increases the protection for the batteries from the elements. Also, the mounting bracket is better designed, and less likely to break - no more thin plastic tabs to break and render your camera useless if you try to remove the camera to replace the batteries.The other thing that changed is the wiring for the doorbell/permanent power. The older mount you connected directly to screw terminals on the mounting bracket. This new version has a connector and wiring nuts to connect to the doorbell wiring - probably more in-line with building or electrical code.Since installing this camera is has worked flawlessly. You have to run through a procedure in the app to have it use permanent power, but once done it is nice not to have to replace expensive lithium AA batteries every couple months.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AltriceAnderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELYGKA3XUTA7K4MSVOEELK62NNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYCZVRXPOFSI4?ASIN=B09G4CTT4G",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "3.0 out of 5 stars Mediocre Performance, Mixed Feelings",
                "reviewText": "y experience with the certified refurbished Blink Video Doorbell has been somewhat mixed, warranting a 3-star rating. While the two-way audio and HD video features are satisfactory, the motion and chime app alerts have proven inconsistent.The option to use it wired or wire-free is convenient, but the overall performance leaves room for improvement. Additionally, the Alexa integration is a nice touch, yet it doesn't fully compensate for the device's shortcomings.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXNICEZM5KHJTGY7QAHRF6SFLXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFRJMD7ZVMUJ2?ASIN=B09G4CTT4G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Works well",
                "reviewText": "Once I got this doorbell up and running, I am completely satisfied. However I came very close to returning during the setup. I wanted this to ring my current indoor chimes in addition to ringing on my phone. I think I followed all the directions but no-go. I assumed that my transformer was the incorrect size and tried a different one with the same results. I was disappointed and decided to return it. Before returning it I decided to experiment with it a bit and ended up discovering that even when using it attached to the doorbell wiring, THE BATTERIES MUST BE INSTALLED. Once the batteries were installed and hooked up to the doorbell wire, it worked great.Additionally, I needed it to be turned toward the center of my porch, so instead of purchasing the wedge, I cut one from wood and made my own. works well.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}