{
    "remaining_requests": 9221,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-new-Ring-Battery-Doorbell-detection/dp/B09WZBPX7K",
    "body": {
        "name": "Ring Battery Doorbell Plus | Enhance your front door security with expanded Head-to-Toe HD+ Video & Color Night Vision for peace of mind",
        "price": "$149.99$131.99",
        "originalPrice": "$179.99",
        "rawPrice": 149.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/All-new-Ring-Battery-Doorbell-detection/dp/B09WZBPX7K",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BWZNY88N"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41EZLQCY rL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/21DXN9ORm2L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 MUqD0ATL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UxK1Bf1NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41X PcsID5L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EzCF2xGZL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 4256,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 49 mins",
            "FREE delivery Thursday, February 22. Order within 14 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": true,
            "details": "Reducing CO2 products reduce their carbon footprint year after year. Certified by the Carbon Trust."
        },
        "features": [
            "See more of who’s there – Battery Doorbell Plus with Head-to-Toe HD+ Video gives you an expanded field of view so you can see more of who’s at your door.",
            "Stay in the know even at night – Enjoy motion detection, privacy zones and see who stops by at night with Color Night Vision.",
            "Get important alerts – Know when a package is delivered with Package Alerts, an exclusive Ring Protect subscription feature (sold separately) that notifies you when your package is detected within a specified zone.",
            "Convenient power – Powered by a Quick Release Battery Pack for quick and easy recharging.",
            "Easy install – Easily setup by connecting your Battery Doorbell Plus to wifi through the Ring app and mounting with the included tools.",
            "Additional protection – With a Ring Protect Plan (subscription sold separately), record all your videos, review stored videos for up to 180 days (photos for 7 days), and share videos.",
            "Connect with Alexa – Pair with select Alexa-enabled devices to enable pre-recorded announcements and Two-Way Talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make custom voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Dimensions",
                "value": "5.1 in x 2.4 in x 1.1 in (128mm x 62mm x 28mm)"
            },
            {
                "name": "Color",
                "value": "Satin Nickel"
            },
            {
                "name": "Video",
                "value": "1536 HD+ Video, Live View, Color Night Vision"
            },
            {
                "name": "Motion Detection",
                "value": "Advanced Motion Detection with Customizable Motion Zones"
            },
            {
                "name": "Field of View",
                "value": "150° horizontal, 150° vertical"
            },
            {
                "name": "Audio",
                "value": "Two-way audio with noise cancellation"
            },
            {
                "name": "Power",
                "value": "Runs on a removable, rechargeable, Quick-Release Battery Pack (included). Can be hardwired to an existing doorbell system or transformer for trickle charging (8-24 VAC, 40VA max, 50/60Hz), or can be connected to a Ring plug-in adapter. No halogen or garden-lighting transformers; no 3rd party DC transformer/power supply. Solar Charger and Plug-in adaptor accessories available."
            },
            {
                "name": "Internet Requirements",
                "value": "802.11 b/g/n wifi connection @ 2.4 GHz"
            },
            {
                "name": "Connectivity",
                "value": "Requires a minimum upload speed of 1 Mbps, but 2.5 Mbps is recommended for optimal performance"
            },
            {
                "name": "Estimated Install Time",
                "value": "~5 minutes"
            },
            {
                "name": "Operating Conditions",
                "value": "-5°F to 122°F (-20.5°C to 50°C)"
            },
            {
                "name": "Setup Requirement",
                "value": "Only if wiring in: Standard doorbell system with 8-24 VAC, 40VA max, 50/60Hz doorbell transformer"
            },
            {
                "name": "Box Includes",
                "value": "Ring Battery Doorbell Plus Rechargeable, Quick-Release Battery Pack Satin Nickel Faceplate Corner Kit USB Charging Cable Installation Tools Setup Guide Warranty and Safety Information Security Sticker"
            },
            {
                "name": "Warranty",
                "value": "One-year limited warranty."
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Ring device, visit Software Security Updates in Ring Control Center for information specific to your device."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Unspoken Yum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2JCQEWME2H6ZGCDIRIQWUKHSRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R203K21BGPPACP?ASIN=B09WZBPX7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars The Digital Doorman",
                "reviewText": "Ring's Battery Doorbell Plus stands at the threshold of home security and convenience, like a digital doorman who's always on duty. This isn't just a doorbell; it's a vigilant eye, a friendly greeter, and a guard against porch pirates, all wrapped up in a sleek, wireless package. With its seamless performance and ease of use, it's no wonder this gadget is ringing in a full five-star review.The first thing to note is its wireless nature. Free from the shackles of wires, this doorbell is as versatile as a Swiss Army knife. You can place it anywhere your WiFi signal reaches, a freedom that wired doorbells can only dream of. It's like a nomad of home security, roaming freely in the realm of your front porch.Then comes the video quality. The Battery Doorbell Plus offers a crystal-clear view of your doorstep, turning every visitor, welcome or otherwise, into a star of your personal doorstep cinema. The video is so sharp, you could probably count the whiskers on your mailman's chin.But it's not just about seeing; it's about interacting. The two-way talk feature turns your doorbell into a communication hub, letting you chat with visitors from anywhere in the world. It's like having a teleportation device, minus the sci-fi complications.Battery life is another triumph. This doorbell sips power like a fine wine, ensuring you're not constantly worried about recharging. It's the endurance athlete of the doorbell world, ready and alert for the long haul.And let's not forget the ease of installation. Setting up the Ring Battery Doorbell Plus is so straightforward, it's almost anticlimactic. No wrestling with wires or drilling into the abyss of your home's façade. It's a DIY dream, turning the daunting into the doable.TL;DR: Ring's Battery Doorbell Plus is a standout in the world of smart doorbells, offering wireless convenience, superb video quality, easy interaction, and long battery life. It's a five-star addition to any home, enhancing security and convenience with modern flair.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Harry ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELUZ4IIDBETBOOHUO6IOFX7EXTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IA6TGI3YBK7O?ASIN=B09WZBPX7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Great security",
                "reviewText": "The Ring Battery Doorbell Plus has taken my front door security to the next level. The expanded Head-to-Toe HD+ video provides a comprehensive view, ensuring I can see everything I need to with clarity. The color night vision is a game-changer, offering peace of mind even in low-light conditions. The battery-operated design provides flexibility in placement, and the setup was surprisingly straightforward. The overall build quality is impressive, and the Ring app's integration adds convenience to monitoring. If you're serious about enhancing your home security with advanced features, the Ring Battery Doorbell Plus is a reliable and effective choice.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LaurenLauren",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY3OZ5ALBWF35LAK3TPBCRG3UWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36UMTHCNJYXNA?ASIN=B09WZBPX7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Quality",
                "reviewText": "I have used ring for years. They seem to get better and better. The view is so clear. I can see my entire porch and part of my driveway. The motion detection works great. It is easy to install and set up. Some say the battery doesn’t last long. I think it depends on your settings and motion zones. I have the sensitivity in the middle and frequency in the middle. I also set my zones so it won’t pick up cars driving by or walkers/bikers on the sidewalk. Doing this my battery would usually last 1-2 months. I have an extra battery I keep charged and it takes just a couple minutes to swap out. I only have two complaints 1. It no longer comes with the drill bit 2. It only came with the wedge plate-I would have preferred the flat plate that it used to come with but it worked.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ATJs-0sQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bianca SuazoBianca Suazo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMRQYD7D7QHY7Q5ACWDC2FCRQHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3G1V9C33FNJKX?ASIN=B09WZBPX7K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product totally recommend it!",
                "reviewText": "I purchased this ring doorbell to replace my Blink Video doorbell for two reasons having to replace batteries is a pain in the butt and the module always gets disconnected and that is so annoying. I got my Ring doorbell because it was on sale for the holidays so I took advantage of the deal also the batteries are rechargeable and it includes the cable to recharge the batteries no more hassle of buying batteries when your battery dies finally! And another plus no module is required they work completely on their own and I get notifications through my echo show 8 and I can see who is walking up towards my house I get my package alerts which is great I have to pay a monthly subscription but it’s not expensive so I’m not complaining overall super satisfied I’m glad I was able to get it before the sale ended also it was so easy to install and setup a 12 year old could help it wasn’t complicated at all I definitely recommend for anyone who is looking for an affordable video doorbell I remember seeing these a couple of years ago and they were pretty expensive now the price is pretty decent.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nN1-E2gZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrea V.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 15, 2024",
                "reviewTitle": "Great product, easy to install",
                "reviewText": "Excellent viewing of motion and alerts. Great safety tool for home.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darren R",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 27, 2023",
                "reviewTitle": "Clear video and wide coverage area",
                "reviewText": "The only thing I dislike is that it's difficult to get anything into the doorbell frame to mark a place to drill holes to attach it. A standard pencil is too thick. I put a post it note on the back of the unit and poked holes where the doorbell screw holes are and used the post it note as a template. I put the post it note where I wanted the doorbell and simply marked spots on the wall where I had pushed the holes through. I haven't had the bell for long but I'm happy with the resolution and night vision is very clear. The notifications work well and I can see whose been at the front door on the phone app. I have had a package delivered and the bell captured it. The battery takes a few hours to charge initially. I haven't had the bell long enough to make a call on battery life but I will update this post when I've had a few months using the bell.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abdulgadir Abubaker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 14, 2023",
                "reviewTitle": "Very clear video",
                "reviewText": "This Ring doorbell is really good and easy to install and use. Very clear videos.I recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mit’s",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 11, 2023",
                "reviewTitle": "Awesome product",
                "reviewText": "This product and resolution quality is awesome, but need subscription in order to enjoy all features.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 30, 2024",
                "reviewTitle": "Arrived on time and works very well",
                "reviewText": "Works very well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}