{
    "remaining_requests": 8950,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Doorbell-Bundle-Bluetooth-Enabled-Companion/dp/B0BJGK97VN",
    "body": {
        "name": "Wyze Lock & Video Doorbell w/Chime Bundle, Wi-Fi & Bluetooth Enabled Smart Lock w/Companion Wired IP65 Video Doorbell, 3:4 Head-to-Toe 1080p HD, Wireless & Keyless Unlock, 2-Way Audio, Night Vision",
        "price": "$129.98",
        "originalPrice": "",
        "rawPrice": 129.98,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bluetooth-Enabled-Wireless-Compatible-Assistant/dp/B0BRRPSM69",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BRRPSM69"
        ],
        "asinVariationValues": [
            {
                "asin": "B085R7J5V4",
                "variationName": "Style",
                "variationValue": "Lock",
                "price": "$123.99",
                "variationImageURL": ""
            },
            {
                "asin": "B0BJGK97VN",
                "variationName": "Style",
                "variationValue": "Lock & Doorbell",
                "price": "$129.98",
                "variationImageURL": ""
            },
            {
                "asin": "B0C8JM355B",
                "variationName": "Style",
                "variationValue": "Lock + Camera + Keypad",
                "price": "$185.25",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/310Xq3hidCL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51PgkiLF1NL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/417  -YC- L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Btm74HQvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41R8A81xXhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/416WU0MX-OL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51TstxNLrcL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the WYZE Store",
            "link": "https://www.amazon.com/stores/WYZE/page/2E088799-B509-4053-A944-167ABF7A236E?ref_=ast_bln"
        },
        "brand": "WYZE",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5477,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 3 hrs 33 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Tomorrow, February 17. Order within 13 hrs 3 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "See who’s there and unlock (or lock) the door remotely. Get instant notifications whenever Wyze Video Doorbell is pressed, access the livestream and two-way audio, remotely unlock Wyze Lock from anywhere on earth, right there in the livestream.",
            "Smart lock functionality from secure to convenient—Let a neighbor in directly from the livestream. Remember to lock the door fifty miles into your road trip. Scheduling a nightly 9pm auto lock. Or keyless-unlock anytime you approach your door.",
            "A lock and a door sensor in one—Wyze Lock not only reports the lock status, it uses a built-in gyroscope to report if the door is open. Plus motion detection, smart alerts, and video recording through Video Doorbell. No need for additional sensors or cameras.",
            "Head-to-toe viewing—People are more tall than wide. So is our live stream. Record and livestream video in 1080p Full HD with a 3:4 aspect ratio. You’ll see every visitor head to toe, and packages on the ground beneath your doorbell.",
            "Chime Included—Hear your doorbell ring, chirp, or bark from any room. Pair any number of Wyze Chimes with your doorbell so every room in your house is ready to alert you when someone’s at the door. One chime is included with each bundle."
        ],
        "description": "The key to lock leisure and front-porch peace-of-mind! (Except not really, because you’ll never need your key again.) Wyze Lock and Wyze Video Doorbell are the made-for-each-other, ultimate patio pair. Take the convenience of a1080p, head-to-toe smart video doorbell and add the rugged strength and smart lock functionality of a Wyze Lock: remote lock/unlock, keyless entry, lock scheduling and automation, and easy access sharing for family and friends. Wyze Video Doorbell also sports an IP65 weather rating and a motion-activated LED light whenever visitors approach. Both are easy to install. And when paired together, Wyze Lock unlocks a special “unlock” button right in the Video Doorbell livestream, so you can remotely unlock the door for someone while talking to them.",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Electrical",
                "link": "https://www.amazon.com/Electrical-Equipment-and-Light-Bulbs/b/ref=dp_bc_aui_C_2?ie=UTF8&node=495266"
            },
            {
                "name": "Door Chimes & Bells",
                "link": "https://www.amazon.com/Doorbells/b/ref=dp_bc_aui_C_3?ie=UTF8&node=495320"
            },
            {
                "name": "Kits",
                "link": "https://www.amazon.com/Door-Bell-Kits/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6291370011"
            }
        ],
        "productInformation": [
            {
                "name": "Brand",
                "value": "WYZE"
            },
            {
                "name": "Special Feature",
                "value": "Keyless, Night Vision, Motion Sensor"
            },
            {
                "name": "Item Dimensions LxWxH",
                "value": "2.5 x 2 x 4.9 inches"
            },
            {
                "name": "Material",
                "value": "Metal"
            },
            {
                "name": "Style",
                "value": "Lock & Doorbell"
            },
            {
                "name": "Color",
                "value": "‎Silver"
            },
            {
                "name": "Number of Pieces",
                "value": "‎2"
            },
            {
                "name": "Included Components",
                "value": "‎Wyze Lock, Wyze Lock Gateway, AA Batteries, Wyze Video Doorbell, Wyze Chime"
            },
            {
                "name": "Controller Type",
                "value": "‎Ring"
            },
            {
                "name": "Shape",
                "value": "‎Rectangular"
            },
            {
                "name": "Control Method",
                "value": "‎Remote"
            },
            {
                "name": "Connectivity Protocol",
                "value": "‎Bluetooth, Wi-Fi"
            },
            {
                "name": "Manufacturer",
                "value": "‎Wyze"
            },
            {
                "name": "Part Number",
                "value": "‎WLKVDB1"
            },
            {
                "name": "Item Weight",
                "value": "‎1.94 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "‎2.5 x 2 x 4.9 inches"
            },
            {
                "name": "Country of Origin",
                "value": "‎China"
            },
            {
                "name": "Item model number",
                "value": "‎WLKVDB1"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Special Features",
                "value": "‎Keyless, Night Vision, Motion Sensor"
            },
            {
                "name": "Batteries Included?",
                "value": "‎Yes"
            },
            {
                "name": "Batteries Required?",
                "value": "‎Yes"
            },
            {
                "name": "Battery Cell Type",
                "value": "‎Alkaline"
            },
            {
                "name": "ASIN",
                "value": "B0BJGK97VN"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 5,477 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#19,272 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #212 in Door Bell Kits"
            },
            {
                "name": "Date First Available",
                "value": "October 17, 2022"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Control together quickly and easily Control Wyze Lock directly from the livestream of Wyze Video Doorbell.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f98b91fc-3201-4535-af51-161dfff881c7.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "See who’s coming and going See the full history of the Lock including how it was locked/unlocked, who did it, and when.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c6f194d-e9aa-47e7-b16a-818ec0b85a0d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Unlocks as you approach. Locks when you leave. Hands full? Wyze Lock knows when you arrive home and automatically unlocks as you approach. Then locks behind you.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e8841c1d-eb19-476f-bdb1-817010b15b0a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "3:4 aspect ratio & 1080p full HD video See packages and visitors from head to toe.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c9ea2214-cb43-4bde-8442-e7b195ead99d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "IP65 weather resistant Built to endure the elements",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11fe5673-5337-4eed-81fe-201842c2a2f3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            },
            {
                "media_text": "Hear your doorbell ring, chirp, or bark from any room With Wyze Chime, any outlet becomes a speaker for your doorbell",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7c25ec0-c184-4e51-afd6-1e035f04792b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f98b91fc-3201-4535-af51-161dfff881c7.__CR0,0,3051,1250_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6c6f194d-e9aa-47e7-b16a-818ec0b85a0d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e8841c1d-eb19-476f-bdb1-817010b15b0a.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c9ea2214-cb43-4bde-8442-e7b195ead99d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/11fe5673-5337-4eed-81fe-201842c2a2f3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c7c25ec0-c184-4e51-afd6-1e035f04792b.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "KarlD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXUAC5X7UVMHJ56362U2KCZWKDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MTNVGKANMVO2?ASIN=B0BJGK97VN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect Front Porch Security System",
                "reviewText": "Wyze Lock & Video Doorbell Bundle: Ditch the Keys and Embrace Smart SecurityI'm ditching the keys for good, and thanks to the Wyze Lock & Video Doorbell Bundle, my home security has never been smarter or more convenient. This fantastic duo has replaced my traditional lock and doorbell, giving me complete control and peace of mind from anywhere in the world.Keyless Convenience at Your FingertipsGone are the days of fumbling for keys or worrying about losing them. With the Wyze Lock, I can unlock my door using my smartphone, Apple Watch, or even voice commands through Alexa or Google Assistant. It's the ultimate keyless convenience, especially when my hands are full of groceries or I'm approaching the house at night. As well, since the lock is on the inside, it does not interfere with the original look for your door outside.Automatic Locking for Peace of MindNever again will I worry about whether I remembered to lock the door. The Wyze Lock automatically locks itself after a predetermined time or when I'm a certain distance away, thanks to its built-in geofencing feature. This added layer of security gives me peace of mind whether I'm running errands or on vacation.Crystal-Clear Video, Day or NightThe Wyze Video Doorbell isn't just a fancy doorbell; it's a home security game-changer. The 1080p HD video provides a crisp, clear view of whoever's at my door, day or night, thanks to its impressive night vision capabilities. No more squinting to see who's there!Instant Notifications, Always in the KnowI'm always in the loop with the Wyze app's instant notifications. Whenever someone rings the doorbell or triggers the motion sensor, I get a real-time alert on my phone, even if I'm miles away. This allows me to answer the door virtually, greet visitors, or deter potential intruders, all from the comfort of my couch.Affordable Security That Doesn't Break the BankThe Wyze Lock & Video Doorbell Bundle is surprisingly affordable, making it a fantastic value for the money. Compared to other smart home security options, Wyze offers top-notch features at a fraction of the price.In ConclusionIf you're looking for a convenient, reliable, and affordable way to upgrade your home security, the Wyze Lock & Video Doorbell Bundle is a fantastic option. It's given me peace of mind, keyless convenience, and crystal-clear video monitoring, all at an unbeatable price. Ditch the keys and embrace smart security with Wyze!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "APKAFD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPVQL2NVJETGZRHP2IY4LYYWXFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R204ATY3CDRT6Z?ASIN=B0BJGK97VN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2021",
                "reviewTitle": "5.0 out of 5 stars The best smart lock I have ever owned!",
                "reviewText": "So let me start this off by saying I have gone through 5 other smart lock door locks starting back from the August 2nd gen, Schlage Homekit lock, all the way to the regular keypad lock and the Wyze door lock tops them all!Installation was a breeze! If you have installed a deadbolt before you can install this, if not wyze has a video that breaks everything down and everything you need is inside the box besides the screwdriver. Now if you are like me that came from a already smart lock like the Schlage Homekit lock then you will need to buy a new deadbolt lock kit as the wyze lock needs a regular deadbolt lock to work. (You can find a good deadbolt lock for less than $20)Once the wyze lock is installed you plug in the little wifi dongle into an outlet. Make sure this dongle is plugged in close to the lock buy also has good wifi connection as this dongle is what's going to control the lock via a remote connection and tell it when to auto unlock when you get home. I would say most problems people have with this lock is either due to poor wifi where the dongle is located or the dongle is located to far away from the lock itself. (keep it within 10 ft of the lock if you can)Now once you get all that installed now you can set the lock up, the wyze app has you scan a QR code inside the lock and after that the app takes over, it asks you to open and close the door a few times to calibrate the lock. One thing to note since the instructions sucked, when it asks you to open the door make sure you open it ALL the way, I was not doing this and the calibration kept failing. It took me an hour to realize I had to open the door all the way then hit the button in the app and then close the door before the door could calibrate.Now once you get the door lock calibrate your done. Now everytime you close the door it will auto lock itself which is AMAZING! Just make sure you have your phone on you because you can lock yourself out. It does have a garbage mode on it which allows you to shut the door without the door auto locking and locking you out. With this I will HIGHLY recommend the wireless keypad which does cost an extra $20 but it is so worth it and will save your bacon if you accidentally lock yourself out and you don't have your phone, trust me I know =)So with all that said how do I like the lock? I love it! The app works great on my Android and iPhones. Auto unlock is a dream! It uses your phones GPS to know when you get home and basically wakes the lock up for it to be ready to unlock, as soon as you get to the door it will auto unlock for you. Now you must be in close range for the door to unlock, if you just drive by your house etc the door will NOT unlock.Side note: if you are having issues with the auto unlock feature and on Android make sure your phone is NOT putting the app to sleep, this can be done the the phones battery management settings and as soon as you fix that auto unlock should work!You can issue temp keys to people so if you want to give a contractor a 1 time key then once he uses it the door will not unlock for him again, or if you want to give a dog walker a pass to get in only certain times a week you can also do that as well. You can also remotely access the lock and lock and unlock the door with your phone anywhere in the world which is what I do if I need to let someone in.Do you need the keypad? I HIGHLY recommend it! If you forget your phone and close the door yea you just locked yourself out trust me I know lol. The keypad is great! If for any reason you dont have your phone or your phones dead you will need the keypad to get into the house. The keypad instantly connects to the lock and as soon as you type in your code it auto locks, you do NOT have to wait for the keypad to pair to the lock like August does. You can also lock your door from the keypad as well if for some reason the auto lock did not work. Now the coolest thing with this keypad is you can punch in random numbers into the keypad as long as your code is in that sequence the door will unlock! I LOVE this feature! So if someone is with you and you dont want them knowing your code you can type in a bunch of numbers and then the code and hit unlock and magically it unlocks. Ex: lets say your code is \"1234\" in the keypad I will type 593853\"1234\"5563 then hit unlock since I typed my code inside the sequence the door unlocks for me and the person with me will never know what my real code is!Overall I love this lock, it has worked every single time for me so far, granted I have only had it for 2 months but every other smart lock I have owned has given me at least 1 hiccup and the Wyze has yet to fail me. I will highly recommend the Wyze lock as its easy to install, secure and it just works.",
                "reviewVotes": "74 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matt",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 1, 2024",
                "reviewTitle": "Easy to install, great value for price",
                "reviewText": "I loved this item. It took me 15 minutes from unboxing to fully installing. It works perfectly for when I work from the office and I need to let the dog walker into my apartment. Ideal for units where the landlord doesn't allow you to change your lock.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linley Maddick",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 24, 2023",
                "reviewTitle": "Great product.",
                "reviewText": "This product meets and exceeds all of my expectations. It does everything simply and intelligently.My greatest beef was that that gateway controller came with an American pin and was not suitable for Australian power outlets which meant shopping for an appropriate converter was needed.If products like this are going to be offered on an Australian based website they need to be capable of being used immediately in Australia.It can't be that hard surely? The frustration upon opening was huge!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ben",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on September 24, 2020",
                "reviewTitle": "Possible to the doorbell with camera n outdoor camera",
                "reviewText": "Good product plse bring in outdoor camera n door bell too",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tareq Abu-kaud",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 13, 2022",
                "reviewTitle": "Easily secure your home with peace of mind. Easy to install and looks aesthetic.",
                "reviewText": "I was sceptical at first but after installing and using it for over a week now I am impressed and wish I got this earlier.The most impressive feature about this lock is that it locks the deadbolt as soon as it senses the door is closed and yes it is smart enough to recognise when the door is open or closed and if the door is left open it will prompt an alarm to notify you.I also ordered the keypad to unlock and it made it really easy for the family to access the house without waiting for someone to open the door for them.The app is very user-friendly and easy to change passwords or even lock or unlock while away.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul S",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 7, 2021",
                "reviewTitle": "Should Come With The Keypad",
                "reviewText": "Installation couldn't have been easier and like the other Wyze products I own, set-up was a breeze. It is a solid little unit and the magnetic cover is slick.My fault for not doing the research but I was under the assumption by having my phone with me it would automatically lock and unlock but that's not the case. If you have it programmed to lock immediately when the door closes, which is the default setting, you will be locked out when you step outside. So you would always need to have your key or phone with you. I changed the delay to 30 minutes so that doesn't happen.I found it doesn't make sense not to have the keypad and one should be included with the lock. So when I leave for a long period of time now, I press the keypad to lock the door rather than have to wait 30 minutes for the lock to do it or having to use the phone (which can take a while) or the key.If that doesn't make sense, it will once you install the lock. Do yourself a favor and get the keyapd.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}