{
    "remaining_requests": 9222,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Video-Doorbell-Wired/dp/B08CKHPP52",
    "body": {
        "name": "Ring Video Doorbell Wired | Use Two-Way Talk, advanced motion detection, HD camera and real-time alerts to monitor your front door (wiring required)",
        "price": "$49.99",
        "originalPrice": "$64.99",
        "rawPrice": 49.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Video-Doorbell-Wired/dp/B08CKHPP52",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08T4FH9Y8"
        ],
        "asinVariationValues": [
            {
                "asin": "B09NLDYGHQ",
                "variationName": "Configuration",
                "variationValue": "Doorbell + Ring Chime",
                "price": "$69.99",
                "variationImageURL": ""
            },
            {
                "asin": "B08CKHPP52",
                "variationName": "Configuration",
                "variationValue": "Doorbell Only",
                "price": "$49.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415ZLFmyX5L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/311oI0uykvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51smVdjucgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/518tDut3NpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gXXgdbmtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41PJSWHbwIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51zS1id5HJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 75100,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tomorrow, February 17. Order within 4 hrs 4 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 13 hrs 49 mins",
            "FREE pickup Wednesday, February 21",
            "Or fastest pickup Tomorrow, February 17. Order within 13 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1080p HD wired video doorbell with two-way talk, advanced motion detection, standard 2.4 GHz connectivity and customizable privacy settings.",
            "Get real-time notifications sent straight to your phone. To hear audio notifications in your home, pair with a Ring Chime, compatible Alexa device, or select the Video Doorbell Wired + Chime bundle. Note: the doorbell will not sound your existing chime.",
            "Advanced motion detection helps you know when someone’s at your front door before they ring your doorbell.",
            "Night vision with sharp contrast ensures you’ll never miss a detail – even in the dark.",
            "Hardwire Video Doorbell Wired using your existing doorbell wiring and the included tool kit for around-the-clock power and peace of mind.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "For added peace of mind, pair with Alexa to help you keep an eye on your home. Connect with Alexa to hear motion alerts on your compatible Echo device or see a Live View with an Echo Show, Fire TV, or Fire Tablet. Talk to visitors by saying, “Alexa, talk to the front door.” With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring Video Doorbell detects a person."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "VladVlad",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC5MFTGAM4N2SK3QGBSMPC6ICQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D0FOGV14YG3I?ASIN=B08CKHPP52",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2021",
                "reviewTitle": "5.0 out of 5 stars Well executed. Minimal lag. Some connectivity issues early on but no issues after moving repeater.",
                "reviewText": "This is my review for:Ring Video Doorbell WiredI tried to keep my review short but there was a lot of information here so I added headers for easier reading.Background:When the first Ring doorbell came out, I really wanted one, but it was a bit too expensive for my taste, so I went with a cheap knock-off. I have been using that knock-off since then and I hate it. The image quality wasn’t awful, but it had a lot of bugs and it didn’t play well with “Alexa”. I kept automating my home adding echo’s, lights, switches, cameras, you name it and every time I circled back to the doorbell I would think: “I already have a video doorbell and the Ring doorbell is still pricey; maybe I should buy some other automation toys”. Well, this new Ring came out, and it was less than 100$ thus I said, let’s try it…Appearance:Dimensions wise, this one is pretty small (5.1”x2.4”x 1.1”). The button is very noticeably a button; to me this is important as with my old knock off doorbell, people would constantly push the camera lenses thinking that they rang the doorbell.Differences between this Ring Doorbell and Previous versions:I did some internet research prior to deciding for it, and I could only find a few things: (1) it supports only 2.4 GHz networks instead of being dual band, (2) it only works as a fully wired setup (3) it has a single faceplate and (4)it is way cheaper than previous models.To me, it wasn’t a big deal the doorbell not being dual band, I planned on using the 2.4 GHz band anyway as I have been with my knockoff brand doorbell. There are several obstructions along the way (two thick walls and some furniture between the door and my repeater, and my router is in the basement), and the 2.4 GHz network is usually better for that albeit a bit slower.This doorbell requires to have an existing wired doorbell setup, unlike previous iterations that you could have fully battery powered doorbell. Yet the setup is only needed for power. You will be bypassing the existing doorbell chime, thus, you will either need to purchase the model that include the Ring Chime (+20$), purchase a separate Ring Chime (30-50$) or use a compatible Alexa device as the speaker(s). I am using a few of my echoes and I like the setup a whole bunch.The Ring Video Doorbell has a single face plate (black) vs 4 different color ones for the Pro. I did search online for other faceplates and I found a pearl white one going for about 15$ but I am sticking with the black one.The newer model is about 70% cheaper. About 60$ vs the 200$ MSRP for the Pro.Issues so far:I haven’t had a lot of issues, but I already had one. I had some connectivity issues right of the bat. The fact that this doorbell bypasses the hardwired chime exacerbates this. No connectivity means no doorbell whether you have power or not. A few resets, I moved my repeater closer and it appear the problem was corrected. However, I point it out because when compared to my old 2.4 GHz knock-off video doorbell, I never had an issue. I am considering this as a one off but I will update my review if this issue persists.Bottom lineWhat I liked:Compatibility with Alexa. When Amazon acquired Ring a while back, I just knew that integration with Echo devices would probably only improve but even knowing that, I was impressed. You can define specific devices you want them to work with. It allows for tons of customization including ringtones.I currently have two echo dots and an echo spot serving as my alerts and this setup works great. The video playback on the Echo Spot is smooth as silk with minimal Lag. I will be linking it up to my new Echo Show when it gets here, next week. I don’t envision any issues linking it up, but I will update my review if needed.It features an advanced motion detection system that allows for customizable alert motion zones. It is extremely intuitive to setup. Thumbs up, all the way.It was very easy to installIt looks elegant yet sleek.It is cheaper than any previous Ring Model.What I dislike so far.It supports only 2.4 GHz networks. This is not a major negative as 2.4 GHz networks usually allow for a better range, especially if there are obstructions along the way. Still, it is worth mentioning.I have a hardwired doorbell chime that is useless now. If my WIFI fails at any point, my doorbell is dead in the water.I already had connectivity issues. They might have been a one off so I am not necessarily overreacting to them but I will update my review if needed.The first two negatives were design choices that allowed lowering the price point and they were something I knew coming in. However, they are still significant enough that I called them out.Overall, for the price, this is actually a very good device. If you already have a Ring doorbell, this item is not for you. If you don’t, and you are ok with a fully WIFI driven, hard wired power doorbell camera, I strongly recommend it.",
                "reviewVotes": "1,235 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/710-zgxTzIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71XKU2IGpTL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71fr0oKmYUL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81BcLyKIWdL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81Nfsfkz06L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91k8ePTsRfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Siramid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFIH3PQCLOR3ILXJR7J4ITHWA2TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21XMU0M2FZJDT?ASIN=B08CKHPP52",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 4, 2023",
                "reviewTitle": "1.0 out of 5 stars “Don’t know what the big deal about Ring” update **Hate it",
                "reviewText": "The device was very easy to installed. Video and picture is good, motion detector is good and the functions, however very disappointed I needed a pay subscription to see the history saved. I have other brand cameras and the history is saved at no charge at all. Update…I hate it. Can’t control the volume on the outside of the doorbell, it makes our internet sooooo slow I had to snooze it so that I can work on my computer. I hate it, hate it. Now looking for other brands.",
                "reviewVotes": "69 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon R.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJTAH4HYSISVXKUXKGK4L2Q4ANA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LUCCF1KYSCXT?ASIN=B08CKHPP52",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "1.0 out of 5 stars Paywall hides most features",
                "reviewText": "When I installed my ring doorbell it worked just fine; I got zero false alarms from the motion alerts on my phone. After the 30-Day trial of Amazon's monthly \"video recording\" ended I decided I didn't need those features and did not sign up. That day and every day after the doorbell gave several motion false alarms. Once I started paying the monthly fee, the alerts started working properly again. Buyer Beware!!! This thing only works right IF you pay the monthly fee. Had I realized this upfront I would have chosen another brand.",
                "reviewVotes": "104 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scalpel1885",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXEKWH3L3J6XQ7XHNFSGPEXIMKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FM8MPISUPS40?ASIN=B08CKHPP52",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 22, 2021",
                "reviewTitle": "5.0 out of 5 stars Great Doorbell and value!",
                "reviewText": "1st time buying a doorbell camera. Package is small and simple. Comes with the doorbell, manual, screws, jumper, torx tool and stickers. The doorbell is nice. barely 2\" wide and 4\" long. Fits perfect on my door trim. I wasn't sure if my transformer was minimum voltage to handle the doorbell, so I bought one at homedepot. Good thing I did. My old one didn't meet the voltage spec. Installing the transformer and jumper took all of 5min and the doorbell about the same time. I turned on the power breaker and the door starting to light up and stated it's ready for setup. I'm one of those people who ACTUALLY reads Q&A and it specifically stated it works only with 2.4ghz wifi and chime will NOT work. That's fine, I hated my mechanical chime. I bought the ring chime as well, so it didn't bother me that the mechanical chime will no longer work. The jumper disables mechanical chime, so down the road if you sell the house and new people don't want a doorbell camera, just remove the jumper and put a new doorbell. Pretty simple. The longest part of the install is actually setting up app, create login, adding the device, etc... I actually have my wifi setup as 2.4ghz and 5ghz mesh separately. example: myhome24 and myhome5. Most \"smart\" home product use 2.4ghz , since they \"penetrate\" walls better than 5ghz, unless you have a mesh system, but most people don't use mesh. I also have a more solid connection when I separate my 2.4ghz and 5ghz. Also users who have their wifi name with symbols and spaces \"might\" have issues with connections. I also bought smart light bulb with bridge and sync'd everything up. I absolutely love the motion detection sync'd with my light because I tend to come home late and tired of using my phone light to fumble through the keys to get in the house. Now I walk up to my door and light turns on automatically. For the price of the ring doorbell wired, it comes with some great feature. HDR 1080 wide viewing. Night Vision (Works awesome!) and motion detection. ok, so I'm impressed with the hardware? Yes! what about the app? This is a little mixed feeling. App is nice, It's def robust in features and video tutorials, but can be confusing for non tech users. Ring App and Alexa works great, but they don't have the same features. So what you see on ring app doesn't necessarily correspond on Alexa app (Even though Amazon owns Ring). It's also weird with the chime sounds. it's different on Alexa, Ring App chime and ring tone for your phone/tablet (which is also in the ring app). Example: All three will have default ring chime, but alexa will have for example \"honkey tonk,\" but the ring app chime or phone/tablet doesn't? Or two would have a chime and one doesn't? I would think we should see available chimes on ALL apps/platform so when the doorbell rings, you're not getting three different chimes or two of the three. Another annoyance is you can't change the ring tone on the doorbell itself. Wish you could do that, but oh well. I initially setup doorbell chime and motion alert chime, but that got annoying real fast since you're getting beep boop bop with different chimes every where. I disable motion on chime and just have it announce \"someone is at door\" on alexa and my phone. Overall, even though I've had it few days, I haven't had issues with the app. No connection issue with live view and all my ring app devices I've added has been solid online. For the price, it's worth it.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}