{
    "remaining_requests": 9190,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Video-Doorbell-3/dp/B0849J7W5X",
    "body": {
        "name": "Ring Video Doorbell 3 – enhanced wifi, improved motion detection, easy installation",
        "price": "$67.60",
        "originalPrice": "",
        "rawPrice": 67.6,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Video-Doorbell-3/dp/B0849J7W5X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon Warehouse",
            "link": "https://www.amazon.com/b?node=10158976011"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B085884FTD"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41-3KQaIblL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31 rAxRhZmL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DImY92HwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41QY-4KTM4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41YdAmD1QSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51LIdDOOTNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61H0F69lRfL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bdcd0990-b784-48da-bc65-be871a816822/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/73c58917-8376-4120-b05f-0b4abfff908c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c71eb5ee-6533-42f2-a00f-d9049d34d20f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/927c90f8-bb36-45e7-8abb-7f71b62cd44f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e2bc6fc7-a652-4417-94d9-1d789aec6ee9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/569a5553-c499-43a5-b59c-02ad94ea96e3/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "Amazon Warehouse",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 45474,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.",
            "An upgrade from the original Ring Video Doorbell 2, enjoy improved motion detection, privacy zones and audio privacy, and dual-band (2.4 or 5.0 GHz) wifi connectivity.",
            "Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.",
            "Powered by the rechargeable battery pack or connects to doorbell wires for constant power.",
            "Easily setup by connecting your Ring Video Doorbell 3 to wifi through the Ring app and mounting with the included tools.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "Connect your Ring doorbell with Alexa to hear announcements on your compatible Echo device when your doorbell is pressed and see a live view of your camera if you have an Echo device with a screen. Talk to visitors by saying “Alexa, talk to the front door.” With a Ring Protect Plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring Video Doorbell 3 Plus detects a person."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Average Install Time",
                "value": "5 minutes"
            },
            {
                "name": "Video",
                "value": "1080p HD, Live View, Night Vision"
            },
            {
                "name": "Field of view",
                "value": "160° horizontal, 84° vertical"
            },
            {
                "name": "Motion Detection",
                "value": "Advanced Motion Detection with customizable motion zones"
            },
            {
                "name": "Audio",
                "value": "Two-way audio with noise cancellation"
            },
            {
                "name": "Power",
                "value": "Can be hardwired to an existing doorbell system or transformer for continuous charging (8-24 VAC, 40 VA max, 50/60 Hz)."
            },
            {
                "name": "Internet requirements",
                "value": "High-speed internet"
            },
            {
                "name": "Setup Requirements",
                "value": "Only if wiring in: Standard doorbell system with 8-24 VAC, 40 VA max, 50/60 Hz doorbell transformer"
            },
            {
                "name": "Connectivity",
                "value": "802.11 b/g/n Wi-Fi connection @ 2.4GHz/5GHz"
            },
            {
                "name": "Operating conditions",
                "value": "-5°F to 120°F (-20.5°C to 48.5°C), Weather Resistant"
            },
            {
                "name": "Mounting base",
                "value": "Integrated mounting base with adjustable angle. Can sit freestanding or mount to a wall or ceiling"
            },
            {
                "name": "Dimensions",
                "value": "5.1 in. x 2.4 in. x 1.1 in. (128 mm x 62 mm x 28 mm)"
            },
            {
                "name": "Box includes",
                "value": "Ring Video Doorbell 3, rechargeable battery pack, corner mount, USB charging cable, mounting bracket, installation tools and hardware, user manual, and security sticker. Ships with a Satin Nickel faceplate. After device set up, you will receive a digital coupon for one free additional faceplate. Select colors apply."
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty and service included. Use of Ring Video Doorbell 3 is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Ring Video Doorbell 3 support page."
            },
            {
                "name": "Generation",
                "value": "Ring Video Doorbell 3"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Ring device, visit Software Security Updates in Ring Control Center for information specific to your device."
            },
            {
                "name": "Disclaimers",
                "value": "1Ring Alarm and all Ring Alarm accessories require a subscription for in-app features and digital notifications, including but not limited to: digital arming / disarming and integration with other Ring, Echo, Alexa, and third party products. Subscription sold separately. View Ring Protect Plans for pricing and details. Customer reviews may reference features that require a subscription."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Fadi Shamaan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2UZ52SQ4HSIYYUEBYBY6R76JEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CJ36ZJ0DA139?ASIN=B0849J7W5X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 18, 2023",
                "reviewTitle": "5.0 out of 5 stars A Game-Changing Doorbell Experience",
                "reviewText": "Have you ever wished for a doorbell that could magically capture the most bizarre and unexpected moments of your life? Look no further than the Ring Video Doorbell 3! As an owner of this fantastic device, I can confidently say it's been a game-changer with its enhanced WiFi, improved motion detection, and easy installation.First things first, let's talk about the installation process. I've always been a bit technologically challenged, but setting up the Ring Video Doorbell 3 was a breeze! The instructions were clear and straightforward, and within minutes, I had it up and running. I was already feeling accomplished, but little did I know that the real fun was yet to come.The enhanced WiFi connectivity of this doorbell is remarkable. Unlike my previous doorbell, which would often struggle to connect to my phone, the Ring Video Doorbell 3 has been flawless. I receive instant notifications and crystal-clear video footage whenever someone approaches my door. Trust me, the look on my face when I saw my pizza delivery guy dancing while waiting for me to answer the door was priceless!But wait, there's more! The improved motion detection is where this doorbell truly shines. Not only does it detect any motion near my door, but it also has a knack for capturing the most hilariously random moments. One evening, I received a notification, and to my surprise, it was my neighbor's cat, Mr. Whiskers, attempting to ring my doorbell with his adorable paw! I couldn't stop laughing, and I immediately shared the video with my friends and family.In addition to the sheer entertainment value, the Ring Video Doorbell 3 provides an enhanced sense of security. Whether it's a friendly neighbor dropping by or an unexpected visitor, I can see and communicate with them through the two-way audio feature, even when I'm away from home. It's like having a personal assistant who never sleeps.And that's not all! The Ring Video Doorbell 3 also comes with a host of additional features that further enhance its functionality. One of my favorites is the customizable motion zones. I can easily define specific areas around my doorstep where I want the motion detection to be more sensitive. This means no more false alarms from passing cars or rustling leaves. It's all about precision.Another great feature is the cloud storage option. With a Ring Protect subscription, I can store and review all the recorded videos from my doorbell. This is incredibly useful, especially when I want to relive those hilarious moments or provide evidence in case of any incidents. Plus, the subscription also includes extended warranties and exclusive discounts, making it a worthy investment.I must also commend Ring's customer support. On one occasion, I had a minor issue with the device, so I reached out to their support team. Their response was prompt, and they guided me through the troubleshooting process with patience and expertise. They went above and beyond to ensure my satisfaction, which speaks volumes about Ring's commitment to their customers.In terms of design, the Ring Video Doorbell 3 is sleek and modern. It seamlessly blends with the aesthetics of my home, and its durable construction gives me confidence that it can withstand various weather conditions. Rain or shine, this doorbell keeps on delivering both in functionality and style.And let me share with you a couple more personal anecdotes that truly showcase the Ring Video Doorbell 3's ability to bring laughter and amusement to everyday life.One evening, as I was engrossed in a movie marathon, I received a motion detection alert from my Ring Video Doorbell 3. Expecting a package delivery, I opened the app to see what was happening. To my surprise, it was my mischievous dog, Buster, who had somehow managed to jump up and press the doorbell with his paw! I couldn't contain my laughter as I watched him wag his tail, completely unaware of the chaos he had caused in the living room with his impromptu performance. It was a moment I captured and shared with friends and family, generating endless laughter and comments about Buster's hidden talents.Another time, I was away on vacation and wanted to keep an eye on my home. Thanks to the Ring Video Doorbell 3's live view feature, I could check in on my doorstep anytime, anywhere. Little did I expect that this would lead to an unexpected encounter with a friendly squirrel. As I tuned into the live view, I found the curious creature staring right into the camera lens, seemingly fascinated by its reflection. The squirrel's comical expressions and playful antics had me in stitches, and I couldn't resist capturing the footage to share with fellow animal lovers.Beyond the entertainment factor, the Ring Video Doorbell 3 has also proven its worth in terms of security. On one occasion, I received a notification indicating that someone was lingering around my front porch. Thanks to the clear video quality, I could identify an unfamiliar face and immediately used the two-way audio to ask if I could help them. Startled by my voice, the person quickly realized they were being monitored and left without any further trouble. The incident highlighted the doorbell's effectiveness as a deterrent and provided me with a sense of reassurance knowing that I have an extra layer of protection for my home.To wrap it up, the Ring Video Doorbell 3 has exceeded all my expectations. Its easy installation, improved WiFi connectivity, and hilarious motion detection have made my daily routine much more enjoyable. This device has brought unexpected laughter into my life and provided peace of mind when it comes to home security. If you're looking for a doorbell that goes beyond the ordinary, the Ring Video Doorbell 3 is the one for you. Trust me, you won't be disappointed!",
                "reviewVotes": "118 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3B2G2DTIRD7B2JYRKTWCCQ5RNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KYQRK8YV6D5O?ASIN=B0849J7W5X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent product",
                "reviewText": "Bought this unit for front door installation where the doorbell wires were not accessible. The unit works well. Wi-Fi signal is always good. Easy to install, hook up and connect. Avoid placing where continuous motion will be detected such as wind blowing bushes, etc. A large field of vision where it picks up constant activity such as moving vehicles will greatly reduce the battery life. One of the best features is where you can define the area you want to monitor (eliminating unwanted motion greatly increases battery life). Pairing with Echo is an excellent option.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morgen Hatton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEF2ABE7BFXGKNMB4SHIMQPWA7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R169LT1HJVIUE9?ASIN=B0849J7W5X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2023",
                "reviewTitle": "5.0 out of 5 stars Ring Video Doorbell 3 - A Game-Changer for Home Security and Convenience!",
                "reviewText": "The Ring Video Doorbell 3 is a fantastic addition to my home, and I couldn't be happier with its performance and features. This smart doorbell has truly revolutionized the way I approach home security and interact with visitors at my front door.The enhanced Wi-Fi capabilities of the Ring Video Doorbell 3 are a significant improvement over previous models. I have experienced a stable and reliable connection, which ensures that I receive real-time notifications and can view live video streams seamlessly. Whether I'm at home or away, I can always keep an eye on my front door with confidence.The improved motion detection is a game-changer for me. The customizable settings allow me to fine-tune the sensitivity and zone coverage, preventing unnecessary alerts while still capturing important events. I now receive accurate notifications for relevant activities, like package deliveries or visitors approaching the door, without being inundated with false alarms.One of the standout features of the Ring Video Doorbell 3 is its easy installation process. I am not tech-savvy, but the setup was a breeze with the provided instructions and the user-friendly app. The included mounting hardware and tools made the process straightforward, and I had the doorbell up and running in no time.The video quality is exceptional, offering crisp and clear images, even during nighttime thanks to the built-in infrared night vision. The two-way audio communication feature is also impressive, allowing me to speak to visitors, delivery personnel, or even potential intruders from my smartphone. It provides an added layer of security and convenience, making it a valuable tool for anyone concerned about home safety.I also appreciate the Ring app, which is user-friendly and intuitive. It allows me to review past recordings, customize motion settings, and interact with other Ring devices if I have them integrated into my home security system.The Ring Video Doorbell 3 has become an essential part of my home security setup, and I feel much more confident and at ease knowing I have this reliable and advanced doorbell watching over my front entrance.In conclusion, I highly recommend the Ring Video Doorbell 3 to anyone looking to upgrade their home security and convenience. With enhanced Wi-Fi, improved motion detection, and easy installation, it's a top-notch product that delivers on its promises. Investing in this smart doorbell has been a wise decision, and I'm delighted with its performance and the peace of mind it brings.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}