{
    "remaining_requests": 9218,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Blink-Video-Doorbell/dp/B08SG2MS3V",
    "body": {
        "name": "Blink Video Doorbell | Two-way audio, HD video, motion and chime app alerts and Alexa enabled — wired or wire-free (Black)",
        "price": "$34.99",
        "originalPrice": "$59.99",
        "rawPrice": 34.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Blink-Video-Doorbell/dp/B08SG2MS3V",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BM2YG2K7"
        ],
        "asinVariationValues": [
            {
                "asin": "B08SG2MS3V",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01JRptgu8MS._SS36_.jpg"
            },
            {
                "asin": "B08SGKLDRV",
                "variationName": "Color",
                "variationValue": "White",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/01ZPeCD+gxS._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wp3p o-eL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/216G5eCaEyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JoiLhjinL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51GFirlykWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51JOoS-4kjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HxfkMPIWL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Blink Store",
            "link": "https://www.amazon.com/stores/Blink/page/C5DECBBE-4F56-4C36-B933-E62144578691?ref_=ast_bln"
        },
        "brand": "Blink",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 131395,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 17. Order within 34 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Answer your door no matter where you are from your smartphone with 1080p HD day and infrared night video and two-way audio.",
            "Experience long-lasting battery life, custom alerts, privacy settings, and more.",
            "Get alerts when motion is detected or someone presses Video Doorbell. Connect to existing doorbell wiring or pair with a Sync Module (sold separately) to engage live view and two-way audio on demand.",
            "Choose to save and share clips in the cloud with a free 30-day trial of the Blink Subscription Plan or locally with the Sync Module 2 and USB drive (each sold separately).",
            "Designed for every home, go wire-free or connect to doorbell wiring to also sound your existing in-home chime. Without wiring, you can use your Blink Mini camera (sold separately) as an indoor plug-in chime.",
            "Set up yourself in minutes with the two included AA lithium batteries then connect to wifi in the app.",
            "Works with Alexa — receive alerts and answer with two-way audio. When wired or paired with a Sync Module, just ask Alexa to answer the front door.",
            "Includes one Video Doorbell, 2 AA 1.5V Lithium Batteries, 4 Screws, 1 Case Opening Tool. Does not include Sync Module 2 which can be found in all “Systems” above (recommended for optimal use while on battery)."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": "",
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "coach316dc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4F2UKNIP4JDJCOH5N4XTWIQJPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCUB5S8R0X2Z?ASIN=B08SG2MS3V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 31, 2023",
                "reviewTitle": "5.0 out of 5 stars This checked all my boxes for home monitoring system",
                "reviewText": "I was initially looking at another brand because they had a wireless video doorbell that came with its own chime. My home was built in 1897 and I don't have existing doorbell wiring or chime in the house. So wireless doorbell that came with a chime was the way I wanted to go. Only problem, this other brand didn't offer all the options and/or configurations I was hoping for.Then I was introduced to Blink. It had all the options I needed. Granted it doesn't have its own chime, BUT....you can use the mini or Alexa as your indoor chime. Perfect! Had the corner mount so I could point the video doorbell camera towards the entrance to the porch. Again, old home on a corner with a wrap around porch where the entrance to the porch was on the corner and the door was at the end of one side. Does me no good to have the camera pointing straight ahead into the front yard. You can mix and match all of the devices to get the optimum setup for your needs, and they all connect seamlessly.Then I started doing my research on Blink. Reading the reviews from customers really made me question if I should buy. Too difficult to install. Too difficult to set up. Can't connect to Alexa. Battery life a fraction of what they claim. Cameras always disconnecting. I'm glad I ignored the reviews, chalking up the technology issues to people just not being tech savvy. I was right.Installation was extremely simple. Not a fan of the online instructions instead of a booklet, but I managed.Sync Module, video doorbell, 3 outdoor cameras and 1 mini indoor camera connected to the Blink system with no issues.Connecting to Alexa was equally as flawless. Set up the Blink skill in Alexa and \"she\" immediately found all the Blink devices. Our Echo in the living room, Echo Dot in the bedroom and the indoor mini will all serve as chimes wherever we are in the house. The Echo devices will also announce any motion detection. We can arm and disarm the system by voice command with Alexa. Disarm does require a voice pin code which you have to set up in the Alexa app.Setting up and managing the devices in the blink app is fairly intuitive and straight forward. You can adjust the motion sensitivity, set up privacy and no detection zones. After setting up the doorbell out of the box, we would get random motion detection notifications. After checking the clips, it had to be either vehicles passing in the street facing the door, or a flag flapping in the wind at the end of the porch where the steps are. I shut off motion detection in the street, lowered the sensitivity slightly, but left the flag area on, and no more false detection's. So it was definitely not the flag tripping it. Camera still picks up people as they come to the top of the steps and alerts us.Video quality is pretty decent. I'm please so far. Haven't been able to test what the night video looks like, or the two way voice at the doorbell yet. Once I am able to and if there are any real issues, I will edit my review.As far as battery life, it's too early to tell. All the documentation I have read indicates that with the sync module and turning off settings or features you don't really need will extend the battery life to the 2 years claimed. Time will tell.If I had a complaint so far, it's the fact that the time it takes from notification until a live view of the camera finally comes up in the app, the person tripping the motion detection has dropped off the package and left. That timing needs reduced greatly.",
                "reviewVotes": "87 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRTVNBLNKSVDABOYSBOB5VAYKEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BXW9MFME857G?ASIN=B08SG2MS3V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Super bang for small bucks--slow but steady",
                "reviewText": "ALL of the Blink stuff I have ordered is getting this same review. After doing an insane amount of research for a home security camera system I settled on Blink for ease of set up and cost. In both of those areas there really isn't a close second. As far as reliability, I'll check in again in a year or two--but other reviews indicate reliability is good. So, good news: easy set-up, great prices, video quality is as good as any, motion sensors and other software adjustable stuff is easy to understand and do.Bad news: The system is crazy slow. I knew that going in, so it might be a bigger deal to you. I'm willing to live with it mostly--down the road I plan to put in a much faster, wired, real time system with only one or two cameras, and Blink has a new \"Sync Module\" that is supposed to have greater range--and maybe speed things up a bit. The slow is annoying...but not a deal breaker.It has notified me of low batteries a few times--so now I just let it go and they seem to recover on their own. I've also had one or two go offline and I had to reinstall them. I think there are two factors causing this, and again for the price I am willing to live with it. For one thing I have the wireless range maxed out even with an extender for my WiFi network. The other factor is it is currently the dead of Winter and cold beyond all reason. 9 degrees last night, high is 31 today. Lots of snow and wind, too. I'm harder to get along with in this weather myself, so I'll put up with some additional problems with electronics that live outside.Bottom line? After three months I'm happy with it and I recommend any and all of the parts of the system I've bought. It works as advertised and it's way cheap--including the annual subscription if you want cloud storage. I will be buying a couple more pieces soon. It is fully functional as long as you don't need a lot of speed. I'm talking about minutes when I’m antsy and want seconds.",
                "reviewVotes": "81 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adam Pierce",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOCBUQSZ4IMD7H3NRWIX2UT34KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25OO327PTQ61B?ASIN=B08SG2MS3V",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Doesn't work after FREE period even with a PREMIUM subscription",
                "reviewText": "Updated review from 1 star to 4. Be sure to check your Amazon purchases with this doorbell... it was on there 3 times. I deleted all of them (they charged for zero - by the way), and then resubscribed. It worked right away. I would still recommend adding a power supply so that you can get realtime feeds over the WiFi whenever you want (not just when someone pushes the button).First, it's a good doorbell when it works. I had the free 1 month of premium features, and when someone pushed the button I got a notification on my phone. Then when the free stuff was about to expire, it took me to Amazon to get a subscription if I wanted any of the services any longer.... of course I did, that's what I got it for. So, I set up the best service it has, and guess what, everything stopped working as soon as the free period stopped and they started taking money. Maybe there's a quick fix to this? Maybe not. Until the service resumes, it stays at 1 star, as it is useless now. See top - FIXED. Now 4 stars, only because needs full time power to get instant doorbell check without someone pushing the button.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}