{
    "remaining_requests": 9223,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ring-Video-Doorbell-Venetian-Bronze-2020-Release/dp/B08N5NQ69J",
    "body": {
        "name": "Ring Video Doorbell – 1080p HD video, improved motion detection, easy installation – Venetian Bronze",
        "price": "$59.99",
        "originalPrice": "$99.99",
        "rawPrice": 59.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ring-Video-Doorbell-Venetian-Bronze-2020-Release/dp/B08N5NQ69J",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0864SF4GC"
        ],
        "asinVariationValues": [
            {
                "asin": "B08N5NQ869",
                "variationName": "Color",
                "variationValue": "Satin Nickel",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/319zXPhPRDL._SS36_.jpg"
            },
            {
                "asin": "B08N5NQ69J",
                "variationName": "Color",
                "variationValue": "Venetian Bronze",
                "price": "$59.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41GRBID2OzL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51AiX aNYZL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31GnlOQGwEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510PB0PoExL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 bFsnOvvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41l7Ce8ezWL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51HJQ5h k6L.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Ring Store",
            "link": "https://www.amazon.com/stores/Ring/page/77B53039-540E-4816-BABB-49AA21285FCF?ref_=ast_bln"
        },
        "brand": "Ring",
        "merchantInfo": "Sold by Amazon Warehouse and Fulfilled by Amazon.",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 190485,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 49 mins",
            "FREE delivery Friday, February 23"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "1080p HD video doorbell with enhanced features that let you see, hear, and speak to anyone from your phone, tablet, or PC.",
            "An update from the original Ring Video Doorbell, enjoy improved motion detection, privacy zones and audio privacy, and crisper night vision.",
            "Receive mobile notifications when anyone presses your doorbell or triggers your built-in motion sensors.",
            "Powered by the built-in rechargeable battery or connects to existing doorbell wires for constant power.",
            "Easily setup by connecting your Ring Video Doorbell to wifi through the Ring app and mounting with the included tools.",
            "With a Ring Protect Plan (subscription sold separately), record all your videos, review what you missed for up to 180 days, and share videos and photos.",
            "Pair with select Alexa-enabled devices to enable announcements and two-way talk for convenient in-home monitoring. With a Ring Protect plan (subscription sold separately), Alexa can also make voice announcements and automatically show live video feed on an Echo Show, Fire TV, or Fire Tablet when your Ring doorbell detects a person or package."
        ],
        "description": "",
        "breadCrumbs": [],
        "productInformation": [
            {
                "name": "Average install time",
                "value": "5 minutes"
            },
            {
                "name": "Video",
                "value": "1080p HD Video, Live View, Night Vision"
            },
            {
                "name": "Field of view",
                "value": "155° horizontal, 90° vertical"
            },
            {
                "name": "Motion detection",
                "value": "Advanced Motion Detection with adjustable motion zones"
            },
            {
                "name": "Audio",
                "value": "Two-way audio with noise cancellation"
            },
            {
                "name": "Power",
                "value": "Runs on a built-in rechargeable battery. Can be hardwired to an existing doorbell system or transformer for continuous charging (8-24 VAC, 40VA max, 50/60Hz). No halogen or garden-lighting transformers; no DC transformer/power supply."
            },
            {
                "name": "Internet requirements",
                "value": "High-speed internet"
            },
            {
                "name": "Connectivity",
                "value": "802.11 b/g/n wifi connection @ 2.4 GHz"
            },
            {
                "name": "Operating conditions",
                "value": "-5°F to 120°F (-20°C to 48°C), water resistant"
            },
            {
                "name": "Available colors",
                "value": "Satin Nickel, Venetian Bronze"
            },
            {
                "name": "Dimensions",
                "value": "4.98 in. x 2.44 in. x 1.10 in. (126.5mm x 62mm x 28mm)"
            },
            {
                "name": "Box includes",
                "value": "Ring Video Doorbell (2nd Generation), micro USB charging cable, mounting bracket (only compatible with Ring Video Doorbell (2nd Generation), user manual, security sticker, and installation tools and hardware"
            },
            {
                "name": "Setup requirements",
                "value": "Only if wiring in: Standard doorbell system with 8-24 VAC, 40 VA max, 50/60Hz doorbell transformer Ring Video Doorbell (2nd Generation) comes with a new mounting bracket in the box. Ring Video Doorbell (2nd Generation) is not compatible with other Ring mounting brackets."
            },
            {
                "name": "Warranty and service",
                "value": "1-year limited warranty. Use of Ring Video Doorbell 4 is subject to the terms found here."
            },
            {
                "name": "Support",
                "value": "Click here to view more information on the Ring Video Doorbell support page"
            },
            {
                "name": "Generation",
                "value": "Ring Video Doorbell (2nd Generation - 2020 Release)"
            },
            {
                "name": "Software Security Updates",
                "value": "This device receives guaranteed software security updates until at least four years after the device is last available for purchase as a new unit on our websites. Learn more about these software security updates. If you already own a Ring device, visit Software Security Updates in Ring Control Center for information specific to your device."
            },
            {
                "name": "Disclaimers",
                "value": "1Ring Alarm and all Ring Alarm accessories require a subscription for in-app features and digital notifications, including but not limited to: digital arming / disarming and integration with other Ring, Echo, Alexa, and third party products. Subscription sold separately. View Ring Protect Plans for pricing and details. Customer reviews may reference features that require a subscription."
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Delfino EspinosaDelfino Espinosa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6SJC6CJO366QA2S7322PAJTCEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R320KN555SV86B?ASIN=B08N5NQ69J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Upgrade Your Home Security with the Stylish Ring Video Doorbell in Venetian Bronze",
                "reviewText": "Alright, folks, let's chat about the Ring Video Doorbell in Venetian Bronze. First off, can we just talk about how sleek and stylish this thing looks? The venetian bronze finish adds a touch of elegance to any doorway, seriously elevating your home's curb appeal. But it's not just about looks – this doorbell means serious business when it comes to home security. The setup was a breeze, even for a tech newbie like me. Within minutes, I had it installed and synced up to my smartphone 📱. And let me tell you, the video quality is top-notch. I can see crystal clear footage of anyone who approaches my door, day or night. The motion detection feature is a game-changer too – I get instant alerts whenever someone steps foot on my porch. Plus, the two-way audio lets me communicate with visitors even when I'm not home. Oh, and did I mention the convenience of being able to check on my doorstep from anywhere? Whether I'm at work or on vacation, I can keep tabs on what's happening at home with just a tap of my finger. Talk about peace of mind Plus, the Ring app is super user-friendly and packed with handy features. And let's not forget about the community aspect – being able to share and view neighborhood alerts adds an extra layer of security. Overall, I couldn't be happier with my Ring Video Doorbell in Venetian Bronze. It's stylish, it's smart, and it's seriously stepped up my home security game. Worth every penny and then some!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61rgMdUv3PL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Johnny Beans",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBCLR5TVM2KJ7B7SEJG3EEW6VCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RCIRF2I0SLPC?ASIN=B08N5NQ69J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Good unit with wide view",
                "reviewText": "I’ve got a couple of ring outdoor cameras so I got this to go with. Battery powered. Install is slightly tricky because of two torx screws that secure the unit to the wall so it can’t get swiped. They give you the screwdriver. You’ll need it to take the battery out for charging, although it lasts pretty long. You get a wide view with this—wider than the ring cameras. You can zoom in on the recording to focus on something but the picture isn’t real great.This is mostly good for seeing what’s going on by the front door. Attached to Wi-Fi works great. Pretty easy to set up. If you’re on a trip and stuff arrived unexpectedly, you can see it and ask someone to get it for you. It also rings a chime if someone is at the door. Good for pretending you’re not at home if you don’t want to deal with it.I think that most porch pirates will avoid places with cameras, but who knows. Brains aren’t the hallmark of that occupation. If I were starting over with security cameras, I’d get this first and maybe supplement later.I went with the ring because the sale price was better than others. They go on sale regularly. I don’t know if it works better, but I’m satisfied.",
                "reviewVotes": "102 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ryan Dubbs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUDER4YU23PODC6UVAHFHLTKMZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UHGE3UKLUQHB?ASIN=B08N5NQ69J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2023",
                "reviewTitle": "5.0 out of 5 stars These things just work!!",
                "reviewText": "I have good number of cameras, doorbells, and alexa devices all configured and paired together. I bought this doorbell to upgrade my back door. Its definitely came a long way since the first gen. Not to keen on the built in battery but we'll see how that works!!These have a lot of great options and features that really give you good control over your devices with a few major cons that really are hard to overlook and should cost a few stars.Pros. Great alerts, great video quality for just 1080p, range, and night vision. I can have it setup so if my front door gets motion alert, all the flood lights and cameras that can see that area light up and record. You can share with family members and determine what cameras they can see and which they cannot. I.E. we have a bedroom cam for our rottweiler puppy that has a large crate we can see right into during these early training months. I'd rather not having my teenage kids seeing into my bedroom but them getting motion alerts for the doors is awesome.Cons. Local storage is blocked behind a paywall. I literally bought a 512gb microsd card and found out when I couldn't find where to enable that you have to not just pay more than what I was before with one camera, but you have to move up to their most expensive 20 dollar a month plan!!! What... The...heck Ring!??! I'm reading also that even after you do this, you can't use both cloud AND local storage.. This is double dumb and downright either HORRENDOUS design by the developers or just intentional extortion via nickel and diming of their already paying customers.I'm a 25+ year IT professional. In EVERY camera system or data suite you care about, local and cloud storage together IS the bee's knees. It should be available on cloud no matter what in case of fire/ring alarm theft and local storage used for faster replaying of recent events up to the amount of data your SD card can hold.Rather than giving in and paying, I returned the SD card and said screw it. I previously was paying about 3.99 a month for my single ring camera. I got tired of maintaining my local IP camera setup and needing a vm (virtual machine) running to record and eating up storage on my NAS to save it all. I was stoked when I saw the local storage. I dropped over 500 bucks on doorbell cams for back and side doors, flood light cams, and interior cameras to ensure our pets left home are fine and being checked on when we go on longer trips. I was OK moving up to 10 dollars a month for all that I get. Adding another 10 on top for something that costs RING NOTHING for me to use. is unacceptable. This is just a money-grabbing paywall and it needs to stop.Lastly, the biggest operational con besides this is the poor integration with Alexa for scheduling camera functions. I.E. I do like getting driveway alerts via the alexa when motion is detected because its a blind spot inside my house. One window on the back side of the house can see the driveway due to garage location. I set a schedule or snooze it to not give motion alerts if I'm having people over and it completely ignores this schedule and gives endless motion alerts via the alexa devices. Stupid annoying and it seems people have been complaining about this on the forum since 2018.",
                "reviewVotes": "488 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tula",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGGHDTEATEYBMGXSIGGLPFBW4XQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R293PQRI1E8P2O?ASIN=B08N5NQ69J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Great! LOVE IT!",
                "reviewText": "So I know this is a doorbell camera but that's not what I'm using it for lol. I am using inside our food truck to watch our employees. It works great too! We have had some money missing issues and because of this camera it had a wide enough angle to see everything and also when they tried hiding I was able to zoom in really close and get clear picture to see what was going on which was great! They have even used the door bell button to get my attention and ask me things and I am able to respond back which is nice. The motion detection works great as well and at night I can see things clearly as well. Overall great camera, easy to use and all the functions and features work great for our buisness. I have it connected to mobile hotspot instead of wired internet and it still works amazing like if it was on wired internet.",
                "reviewVotes": "34 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bipin R.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on March 12, 2022",
                "reviewTitle": "Nice, Simple to install and use and effective!",
                "reviewText": "Works well. Bell rings in our phones and now all can see who’s at the door from anywhere in the world and not just at home",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ganesh Shenoy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 27, 2023",
                "reviewTitle": "Enhance Your Home Security with the Ring Video Doorbell (2nd Generation)",
                "reviewText": "The Ring Video Doorbell (2nd Generation) in Satin is a game-changer for home security, and it has quickly become an indispensable part of my daily life.Easy Installation:Setting up the Ring Video Doorbell was a breeze. The package includes everything you need for a quick and hassle-free installation, and the step-by-step instructions are clear and easy to follow. Even for someone like me, who is not particularly tech-savvy, the process was straightforward.Sleek Design:The satin finish of the doorbell adds a touch of modern sophistication to my front entryway. It seamlessly blends with the aesthetics of my home, proving that security doesn't have to compromise style.1080p HD Video Quality:The clarity of the 1080p HD video is impressive. I can see every detail, whether it's a package being delivered, a neighbor stopping by, or simply checking in on the surroundings. The wide-angle lens ensures that I have a comprehensive view of my doorstep.Improved Motion Detection:The upgraded motion detection on the 2nd generation Ring Doorbell is a notable improvement. It accurately detects motion and sends timely alerts to my phone, providing an extra layer of security and peace of mind. The adjustable sensitivity settings allow for customization to suit specific needs.Two-Way Talk Feature:The two-way talk feature is a fantastic addition. Whether I'm at home or away, I can communicate with visitors in real-time through the built-in speaker and microphone. It's not just a security tool but also a convenient way to interact with delivery personnel or guests.Ring App:The user-friendly Ring app is the command center for managing the doorbell. It allows me to customize settings, review recorded footage, and receive instant notifications, all from the convenience of my smartphone.Community Sharing:The Ring community feature is a valuable bonus. Being able to share and receive real-time updates from neighbors adds an extra layer of security and helps create a sense of community vigilance.Conclusion:In conclusion, the Ring Video Doorbell (2nd Generation) in Satin is a stellar investment for anyone looking to enhance their home security. The combination of easy installation, sleek design, high-quality video, improved motion detection, and user-friendly features makes it a top-tier choice in the market.Pros:Easy installationSleek satin finishImpressive 1080p HD video qualityImproved motion detection with adjustable settingsTwo-way talk feature for real-time communicationUser-friendly Ring appCommunity sharing for added securityCons:NoneI highly recommend the Ring Video Doorbell (2nd Generation) to anyone prioritizing home security without compromising on style and convenience. It's a reliable and effective solution that brings peace of mind to your doorstep.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcus Reiger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 9, 2024",
                "reviewTitle": "Works great",
                "reviewText": "Arrived fast. Set easy…does the job and connects to echo dot easy for doorbell",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R.V.NIJAAHNANDH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 4, 2022",
                "reviewTitle": "It's a good product but as of now alexa skill is not available in India that's what a sad news.",
                "reviewText": "I hope alexa skill is enabled in India asap.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa Graham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 25, 2024",
                "reviewTitle": "I am very Impressed",
                "reviewText": "decided to get myself this doorbell for security as I got 1 before & it was very hard to install BUT THIS ONE OMFG so easy to install you just follow the Prompts as you just download the Ring app to your phone was done within 10 min & I am also impressed with how clear the pic are & sounds is AMAZING highly recommend this Ring door bell Camera",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}