{
    "remaining_requests": 20545,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Taylor-Old-Bond-Street-Sandalwood/dp/B0007MW2ZW",
    "body": {
        "name": "Taylor of Old Bond Street Sandalwood Shaving Cream Bowl, 5.3-Ounce",
        "price": "$13.25",
        "originalPrice": "",
        "rawPrice": 13.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Taylor-Old-Bond-Street-Sandalwood/dp/B0007MW2ZW",
        "soldBy": {
            "sellerID": "A37R47XKD4OJ63",
            "name": "Berry and Brown",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A37R47XKD4OJ63&asin=B0007MW2ZW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CB5T12KR"
        ],
        "asinVariationValues": [
            {
                "asin": "B008YDXM28",
                "variationName": "Size",
                "variationValue": "5.3 Fl Oz (Pack of 1)",
                "price": "$14.10",
                "variationImageURL": ""
            },
            {
                "asin": "B0007MW2ZW",
                "variationName": "Size",
                "variationValue": "5.3 Ounce (Pack of 1)",
                "price": "$13.25",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51JX8dNm9uL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41XUSAlqNwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31FLfpq2LlL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31aGtFwRo-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31A2Skb3PnL.jpg"
        ],
        "imagesCount": 5,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Taylor of Old Bond Street Store",
            "link": "https://www.amazon.com/stores/TaylorofOldBondStreet/page/5E31F0ED-EDBC-4F9A-B1ED-9F87815168F8?ref_=ast_bln"
        },
        "brand": "TaylorofOldBondStreet",
        "merchantInfo": "Berry and Brown",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 20917,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "FREE Shipping",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 28 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Cream helps prepare your beard for shaving and moisturizes your face",
            "A classic fragrance with top notes of geranium, lavender, rosemary and liquid amber supported by a heart of carnation, fern and orange blossom resting on a sumptuous base of patchouli, sandalwood, powdery musk and rock rose",
            "Cream is contain a plastic bowl making lathering easy, Sandalwood shaving cream bowl",
            "Product normal consistency is that of a cream and is recommended to be stored at room temperature, 59 degrees Fahrenheit to 77 degrees Fahrenheit The cream may re position during shipping as the manufacturer has left space between cream and top of container",
            "Manufacturer recommend using within 12 months after opening",
            "English Classic"
        ],
        "description": "Taylor of Old Bond Street shaving cream comes in a resealable bowl. Works best with a brush. Taylor's shaving cream has been justly famous since 1854 for its remarkably silky lather and delicate fragrances.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b?ie=UTF8&node=13271079011"
            },
            {
                "name": "Shaving Creams, Lotions & Gels",
                "link": "https://www.amazon.com/Mens-Shaving-Creams-Lotions-Gels/b?ie=UTF8&node=13271103011"
            },
            {
                "name": "Shaving Creams",
                "link": "https://www.amazon.com/Mens-Shaving-Creams/b?ie=UTF8&node=13271105011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8 x 8 x 6 inches; 8.82 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ AD1564"
            },
            {
                "name": "Department ‏",
                "value": "‎ mens"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 799559139636 024291143635 799632645030 721865440069 879488268734 794437381800 793379215488 801927924161 737003238207 785923310251 696770010013 885108008796"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Taylor of Old Bond Street"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0007MW2ZW"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,265 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #7 in Men's Shaving Creams"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 20,917 ratings"
            },
            {
                "name": "Brand",
                "value": "Taylor of Old Bond Street"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Scent",
                "value": "Rosemary,Lavender,Rose"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Taylor of Old Bond Street Sandalwood Shaving Cream Bowl Taylor of Old Bond Street classic; luxurious and masculine Sandalwood Shaving Cream which creates a uniquely smooth and creamy lather. A classic fougere fragrance with top notes of geranium, lavender, rosemary and liquid amber supported by a heart of carnation, fern and orange blossom resting on a sumptuous base of patchouli, sandalwood, vetivert, powdery musk and rock rose.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/8267bee2-6bd7-4c43-b8b2-7f28446718b3._CR0,0,300,300_PT0_SX300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/8267bee2-6bd7-4c43-b8b2-7f28446718b3._CR0,0,300,300_PT0_SX300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Michael Robinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHN2LEONEHJGFP3MN556RNS2QYBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EE22ZVZVQLC5?ASIN=B0007MW2ZW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 27, 2017",
                "reviewTitle": "5.0 out of 5 stars This soap feels and smells AWESOME!",
                "reviewText": "I decided to upgrade my morning routine and give myself something to look forward to when I'm feeling lazy and thinking about sleeping in. I also felt like it was time to stop using an electric razor since it was leaving me with a very amateur-looking shave (lots of stray hairs that I couldn't get no matter how much I tried). I wanted to get the most out of the safety razor experience, so I did a lot of research into which products are needed and how to use them. I made all of the purchases together on Amazon and tried them out as a set. After using an electric for the past 10 years, I was pretty worried that I would get some serious razor burn, but to my surprise I had none whatsoever! I was pretty careful to not get too aggressive with the shaving, so I went WITH the grain and only made one or two passes on each area. The result was a shave that was 100X closer than an electric with no discomfort, nicks, cuts, or razor burn!Here's what I bought and why:Safety Razor: Parker 96R – Long Handle Butterfly Safety Razorhttps://www.amazon.com/dp/B002IFFSOS/ref=cm_cr_ryp_prd_ttl_sol_2This safety razor has a great weight to it, a long handle for a comfortable grip, and a black and chrome coloring that looks great with the other items on the list. The butterfly razors seem to be the easiest to open and close for changing blades.Razor Blades: Astra Superior Premium Platinum bladeshttps://www.amazon.com/dp/B00EXPTR0W/ref=cm_cr_ryp_prd_ttl_sol_4One of the great things about safety razors is that the blades are SUPER cheap. These Astra blades are some of the most popular and highest quality blades I could find. At $0.10 each, you can clearly see the cost advantage to regular razors. I have been told that one blade should last about a week. That means that 100 is nearly 2 years’ worth! Do yourself a favor and buy the best blades you can get. There’s no reason to save a few cents to get blades that dull quickly and give you razorburn.Brush: Perfecto 100% Badger Shaving Brush - Blackhttps://www.amazon.com/dp/B00VF1NI5M/ref=cm_cr_ryp_prd_ttl_sol_40This brush is a fraction of the cost of the higher end brushes and it felt GREAT and worked up a nice, foamy lather very quickly. I don’t see any reason to buy a more expensive brush, especially if you are just starting out and want to see if you enjoy this process before you commit to a high-dollar brush. Personally, I still wouldn’t get anything more expensive.Bowl: Schöne Stainless Steel Shaving Bowl with Lidhttps://www.amazon.com/dp/B00OQDEL8Y/ref=cm_cr_ryp_prd_ttl_sol_37I think this is a matter of preference and taste in aesthetics. This bowl matches the other items that I bought and has a lid, which I am hoping will allow me to make my soap last longer. It seems to be well made and is a great size for working up a lather with the brush and is shaped well for holding it in your hand while you apply the lather. I think there are a lot of options for you to choose from, so pick something that matches your style if this one isn’t for you.Razor and Brush Stand: SimplyBeautiful Deluxe Razor and Brush Standhttps://www.amazon.com/dp/B00AG92BXY/ref=cm_cr_ryp_prd_ttl_sol_35This stand looks great and is balanced well so that it holds my brush and razor without falling over. I chose black for two reasons. One: It matches the other things that I bought (razor and brush). Two: It should resist rusting better since it is coated.Pre-shave Oil: The Art of Shaving Pre-Shave Oil, Sandalwoodhttps://www.amazon.com/dp/B000FGTTTM/ref=cm_cr_ryp_prd_ttl_sol_3The Art of Shaving makes some great products, but some of them have changes in recent years, so you can’t rely on the ratings alone. I read through them and found that the pre-shave oil is still a very popular product and from my experience, it definitely helps prep your beard and skin for the shave. Applying the oil is step 1 in safety razor shaving.Shaving Soap: Taylor of Old Bond Street Sandalwood Shavinghttps://www.amazon.com/dp/B0007MW2ZW/ref=cm_cr_ryp_prd_ttl_sol_1TOBS shaving soaps are the highest quality soaps I could find based off of smell, quality of lather, and consistency of the product quality. This soap is more like a cream. I scooped out some with my fingers, put it in the bowl, added some hot water, and then worked up a lather. It felt and smelled amazing! In reality, I didn’t want to wash it off because it just felt so good!After-shave Balm: Truefitt & Hill Sandalwood Aftershave Balmhttps://www.amazon.com/dp/B004OWPW0I/ref=cm_cr_ryp_prd_ttl_sol_29This was my biggest splurge of the whole set-up and I did so for several reasons: First, using after-shave balm is said to be gentler on your skin than alcohol-based after-shaves. As I mentioned before, I switched from an electric to a safety razor with no skin irritation at all. This cream soothes the skin and makes it soft. It was the perfect way to finish my shave. Second, this stuff is rated as the absolutely best smelling after-shave balm out there and I can attest to that. It smells so great that I stopped using my cologne. Based on the small amount that is needed, this bottle should easily last for a year or more. Three, there are other “luxury” brand shaving balms that have been bought out by big brand companies and their formulas have changed significantly as a result. That means that some of the products out there have great ratings, but only because of the number ratings BEFORE they recently changed. If you look into other luxury shaving brands, then you will see what I mean.Razor Disposal Case: Feather Styling Razor Disposal Casehttps://www.amazon.com/dp/B00DWGEY1K/ref=cm_cr_ryp_prd_ttl_sol_36Even used razors are sharp, so I bought this little case to keep stray razors off of the counter, or better yet, off of the floor. Just drop in the used razor when it’s too dull for shaving. It holds over a hundred, so you can go without emptying it for a few years. It’s pretty cheap, so maybe you can just throw it away when it’s full? Your choice.That’s my whole set up. If you want to get into safety razor shaving, then I highly recommend the products on this list. All-in-all, you will spend about the same on this list than you would on a TAOS starter kit that only has the oil, brush, soap, and balm. I’m a morning shaver, so the sandalwood scent works great for me, but evening shavers may consider the same products in lavender scent if you want a relaxing experience to help you sleep.",
                "reviewVotes": "56 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Matthew GoldsteinMatthew Goldstein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGQ5AVW3ACCCF4FMP3PX47UIFKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IHKLJ4ADJSCC?ASIN=B0007MW2ZW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars High quality",
                "reviewText": "The TOBS Sandalwood Shaving Cream works superbly. The Cream lathers up well, with little effort in a shaving mug required for a simple lather. It creates a sufficiently protective surface for shaving in its lather form. The Cream's scent is pleasant, subtle but distinct, and also pretty long lasting. The scent stays on the skin for many hours and also wafts off of the shaving equipment that has touched it for even longer periods of time.My one complaint concerns the packaging, not the Cream. The container came sealed with a tape that used a particularly sticky adhesive that when removed left a sticky residue on the container in several places. Scrubbing the sticky residue with vegetable oil failed to remove it, whereas common adhesives would have been scrubbed off with that method.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51ikH8mu8mL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doug Briggman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN5BB6MEQ6I2CQFIAURAB4LAGMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVZ4WK0SQ3JPR?ASIN=B0007MW2ZW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Fabulous Product",
                "reviewText": "This product is extremely good. The smell is fabulous the you don’t need a lot of the product to make a heavy lather on the face and it lasts if you wanna do a second or third pass without renewing. It smells good it makes the skin feel so soft I took a recommendation from Jonathan Farley on TikTok to, he shows how to tie ties in various configurations. He’s a fantastic demonstrator and very friendly and personable man I bought it because of his recommendation and I am sold by the product.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Nardo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESFU7UKZXEEO2OKI7WI4MTE2MNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z7A3629LHNNZ?ASIN=B0007MW2ZW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Scent and shave is amazing",
                "reviewText": "The best, this is my second purchase of Sandalwood, their aftershave lotion is amazing as well. Scent is so good as well as the shave. Lathers beautifully and allows for a close shave with an amazing feel afterwards. I will always have a container of this on hand. Their Royal Forest very good as well as the Tobacco leaf. COuld not be more pleased with TOBS. Do not hesistate, give it a try, best used with a badger brush for application.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffrey Andrews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNZAUPJ6D6EUX47CK3RZZSTZ33Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VYH4HWY59SC?ASIN=B0007MW2ZW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "4.0 out of 5 stars Very soft.",
                "reviewText": "Very soft shaving soap. Smells great but since it is so soft it goes quickly.Word of warning, \"Be careful in the shower it makes the shower slippery!\"I like shaving in the shower, I found out the hard way that shaving soap is very slippery in the shower.I didn't know I could dance so well in the shower. lol",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerome L. MonsonJerome L. Monson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK3FBL3TIDGMLZBKARIPT7RS3YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MSB5J14GDORK?ASIN=B0007MW2ZW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars DE Shaving Dream!",
                "reviewText": "This cream exceeded all of my expectations. Outstanding lather. Outstanding scent. A little goes a long way. I use a badger brush and put a small amount into a large cup. (See photo). I use a pre shave oil, but have used it w/out the oil and it worked very well. I also use Cremo original shave cream. I like this much more. Well worth the money, because of how little you need to get a serious lather. 3 pass shave as well as my head.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61bTh4yBHcL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61mrR27yA4L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "TomahawkTomahawk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM2LWNA2GN6PYLBXYS2NOL4CRUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LKK97UVPZ3UG?ASIN=B0007MW2ZW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars OMG!",
                "reviewText": "I never give anything 5 stars till now! This is the best shaving soap I've ever used! Not only does it smell great, but I used my usual amount and got enough lather to shave 3 times. Never going back to anything else.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81Gvw0pVnZL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. J",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7TW4AAR7QRI45AIBOCYCREYMRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11SZ019D9NGLZ?ASIN=B0007MW2ZW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars I'm very impressed!",
                "reviewText": "I'm used to using regular shave soap this is my first time using this product this product combined with my double razor gave me one of my closest shave in The Last 5 Years I am a new believer and sometimes letting go of old traditions and embracing new products!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Farealz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 18, 2024",
                "reviewTitle": "Best smelling shaving puddy",
                "reviewText": "Reminds me of that barber shop scent. So nostalgic. Creates great lather/foam. Worth the price!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norma Huacuja",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 12, 2023",
                "reviewTitle": "Buen producto",
                "reviewText": "Muy buena crema para rasurar, su calidad y suavidad tb muy buenas",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "effeotto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 12, 2024",
                "reviewTitle": "Per una schiuma da barba confortevole e profumata",
                "reviewText": "TOBS è una sicurezza. Trovata in offerta e presa senza pensarci. La schiuma la monto direttamente sul viso in un attimo, è molto profumata e alla fine della rasatura lascia la pelle setosa e leggermente profumata. Questa fragranza a mio avviso è una delle migliori di TOBS, la reputo una buona fragranza \"invernale\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashish",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 27, 2024",
                "reviewTitle": "Very good shaving cream and fast delivery",
                "reviewText": "I really liked the faster delivery. Shaving cream is superb, rich lather and smooth and silky shave. I can rate it better than proreso.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katarzyna ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on December 4, 2023",
                "reviewTitle": "Förpackning saknar någon extra skydd(folie) som finns i t.ex ansiktskrämer",
                "reviewText": "Fick den idag tyvärr pga själva förpackningen saknar någon slags skydd folie. Lite mängd var ute på forpackningen. Ser nästan ut som storre mängd saknas. Ska vara present till min far men det ser lite tråkigt ut. Speciellt att fick vänta på leverans länge. Lukaten väldigt fint trotts",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.25",
                "sellerName": "eSource",
                "sellerRating": "5"
            },
            {
                "price": "$13.25",
                "sellerName": "soho",
                "sellerRating": "4.5"
            },
            {
                "price": "$15.45",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}