{
    "remaining_requests": 20311,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Remover-Veet-Removal-Sensitive-Packaging/dp/B001KYPZ4G",
    "body": {
        "name": "Hair Remover, Veet Gel Hair Removal Cream Sensitive, 13.5 Ounce, Sensitive formula with Aloe Vera and Vitamin E (pack of 1)",
        "price": "$9.00$9.00 ($0.67$0.67 / Fl Oz) $8.05$8.05 ($0.60$0.60 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 9.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Remover-Veet-Removal-Sensitive-Packaging/dp/B001KYPZ4G",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BQ87711X"
        ],
        "asinVariationValues": [
            {
                "asin": "B001KYPZ4G",
                "variationName": "Size",
                "variationValue": "13.5 Fl Oz (Pack of 1)",
                "price": "$9.47",
                "variationImageURL": ""
            },
            {
                "asin": "B08ZYYKDWB",
                "variationName": "Size",
                "variationValue": "13.5 Fl Oz (Pack of 2)",
                "price": "$19.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415Zk2A2KXL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/512IOsKqYGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/511GfDzATgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/510AfxzhWSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51btWtr-tgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51fs9UZhVqL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/71UmpLpqKBL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ecb66bae-f7de-48bd-b8d9-bf1533a0f3c4/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/359cfe98-a5cb-43ff-aede-629d81203ec0/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f7c0149e-a554-4efa-a507-1a2659ab5ca9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8079c065-c43d-42c6-98fa-95cf5c51f22c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/714f40fb-d0ac-46bf-aa7d-198adf39f673/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e4d48d5f-122e-4fee-a305-7480b858c2dc/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/51f85013-fb72-46cd-9c4e-7b47801aeb38/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6b6bacb6-6a67-4ac1-8da7-7523b8ad4972/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/734213c2-8e05-4224-8404-534b44f183d2/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/88015433-baa7-4bb0-a3fb-98c0b2e17c5e/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 10,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Veet Store",
            "link": "https://www.amazon.com/stores/Veet/page/3507281B-3D09-481F-8DD0-D4636293BFE2?ref_=ast_bln"
        },
        "brand": "Veet",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 71796,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 7 hrs 30 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🦵🏼HAIR REMOVER FOR WOMEN: Veet Sensitive Gel Cream for legs & body is the fast and effective way to gently remove body hair with lasting silky smooth results. This product was thoughtfully designed for women, but don't worry our line of depilatory products includes a hair removal cream for men too!",
            "🧴HAIR REMOVAL CREAM: Say goodbye to unwanted hair with Veet's gel cream for women. Ideal hair removal for your bikini line, legs, arms, and underarms to achieve that flawless beach-ready look",
            "🚫PAINLESS HAIR REMOVAL: Veet Sensitive Hair Removal Cream’s gentle formula can be applied easily, removing hair quickly & painlessly without the risks of nicks or cuts from razors, while hydrating your skin and leaving it with a lasting, smooth finish",
            "🙋🏽‍♀️SENSITIVE SKIN FORMULA: Veet's gel cream is dermatologist tested and formulated to be gentle on sensitive skin. Our sensitive skin formula contains 35% less chemical ingredients than our previous formula so apply it confidently",
            "🏆QUICK AND EASY: Veet's gel cream is easy to apply, starts working in as little as 5 minutes, and is even easier to remove with our included hair removal spatula.",
            "🗓️LONG-LASTING RESULTS: Quick and easy application is only half the story. Veet gel cream hydrates your skin for up to 24 hours so your skin can stay smooth and hair free for days"
        ],
        "description": "Experience silky smooth skin with Veet Sensitive Hair Removal Gel Cream. Our sensitive skin formula is designed to painlessly and effectively remove unwanted hair, leaving your skin hair-free and touchably smooth. It's suitable for use on sensitive areas, such as the bikini line and underarms. Say goodbye to painful waxing and tedious shaving routines and enjoy long-lasting smoothness with Veet. Our dermatologically tested formula is safe and effective with 35% less chemical ingredients than our previous formula. Veet gel cream is enriched with moisturizers to hydrate your skin for up to 24 hours, leaving it soft and supple after each use. Discover the convenience of Veet Sensitive Hair Removal Gel Cream. With our easy-to-use formula, you can achieve salon-like results in the comfort of your own home. Embrace the freedom of hair-free skin and experience the confidence that comes with it. Choose Veet for gentle, effective, long-lasting hair removal from the #1 Depilatory Brand Worldwide*. Please follow the instructions provided on the packaging for safe and optimal use of the product. *Based on NielsenIQ RMS data for the depilatories segment for the Female Hair Removal Category for the 12-month period ending 31 MAY 2022 (Copyright © 2022, Nielsen IQ)",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Women's",
                "link": "https://www.amazon.com/Womens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13269990011"
            },
            {
                "name": "Depilatories",
                "link": "https://www.amazon.com/Face-Body-Hair-Depilatories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3779081"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.24 x 3.58 x 7.36 inches; 1.04 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ IU7"
            },
            {
                "name": "Batteries ‏",
                "value": "‎ 1 9V batteries required."
            },
            {
                "name": "UPC ‏",
                "value": "‎ 062200809951"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Reckitt Benckiser"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B001KYPZ4G"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ France"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#460 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #1 in Face & Body Hair Depilatories"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 71,796 ratings"
            },
            {
                "name": "Item Form",
                "value": "Gel Cream"
            },
            {
                "name": "Recommended Uses For Product",
                "value": "Body"
            },
            {
                "name": "Material Feature",
                "value": "Dermatologist Tested"
            },
            {
                "name": "Material Type Free",
                "value": "Alcohol Free"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Explore Our Entire Line Of Hair Removal Products Veet Sensitive Gel Cream Add to Cart Veet Professional 2 Min Add to Cart Veet Sensitive Spray On Add to Cart Veet Wax Strips Add to Cart Veet Men Sensitive Cream Add to Cart Customer Reviews 4.2 out of 5 stars 71,796 4.2 out of 5 stars 2,788 4.3 out of 5 stars 1,489 3.9 out of 5 stars 7,129 4.1 out of 5 stars 4,826 Price $9.47$9.47 $9.59$9.59 $8.49$8.49 $9.47$9.47 $9.49$9.49 Setup Time 5-10 Minutes 2-6 Minutes 5-10 Minutes - 5-10 Minutes Where To Use Bikini Line, Arms, Legs, Pits FULL Bikini Area, Legs, Arms Bikini Line, Arms, Legs, Pits Bikini Line, Arms, Legs, Pits Chest, Back, Arms, Legs Smooth Skin For Up To 7 Days Up To 7 Days Up To 7 Days Up To 28 Days Up To 7 Days Suitable For Sensitive Skin ✔ ✔ ✔ ✔ ✔ Safe & Effective ✔ ✔ ✔ ✔ ✔",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1fd6a18f-c539-4e69-af52-672a49024771.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/435d991f-b626-446f-8187-11f80c51149f.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7a783bd-0b49-48b8-b062-9688fa671535.__CR0,0,2928,1200_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3f13ce2e-234d-4afe-9122-88a48136f942.__CR0,0,400,450_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/94105086-e55c-47e5-97cd-95b3cedf708b.__CR0,0,400,450_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/edc1e7a5-32c6-40b4-924b-9fd79a56118e.__CR0,0,400,450_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/31d72e06-a4a0-4fa1-a26e-3f03676306f8.__CR0,0,400,450_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b3fed49-997e-494a-bd05-d905f9e3fb91.__CR0,0,400,450_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Irish",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJXT5APEXTGHENJSDILFFXGVRBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RS4V3I123BAS8?ASIN=B001KYPZ4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 26, 2022",
                "reviewTitle": "5.0 out of 5 stars I did it one piece at a time, and it didn't cost me but 10 bucks",
                "reviewText": "**Update** I've been using this for a few months now, and it is still as awesome as the first use. The biggest change is that I now use a latex glove to apply the goop to my skin and wash it off, mainly because my nails are brittle and I don't know if this was making it worse or it was a coincidence. It's still awesome, but I've given up using it on anything but my legs. The face isn't a problem anymore, and the downstairs is just too annoying to use more than for special occasions because I need help to be as smooth as I get from shaving, and it doesn't last long enough to make it worth the effort.**Original review**If you're reading this, you're skeptical. Over 50k reviews on one product, and most people give it 5 stars, so you want to know what's the catch. There's no way something this magical can come out of a silly pink bottle, and the hair removal Venn diagram overlap between easy, fast, and cheap is a unicorn that takes you to Hogwarts to meet Aragorn and save the Black Pearl.Let me tell you, Aragorn is taller than I expected.I originally bought this for my older (teenage) daughter. She has horribly sensitive skin, and gets the worst razor burn from shaving her legs. But we live on the face of the sun, so shorts are required to not die for the 11.5 months of summer, and life can get rough. I did a bunch of research on options for her, and everything I read online had this product at the top of the list. I had a run in with Nair long ago and still have a scar from the chemical burn during the patch test on my leg, so was extremely hesitant, but I decided to give in to her begging and let her give it a try after reading so many positive reviews.She looked like a naked mole rat, but the happiest one ever because after slathering the cream on and waiting 8 minutes, her legs were completely smooth and no razor burn! It was amazing! A happy teenager does exist!Her results got me thinking, and I decided to give it a shot myself. My test patch was MUCH smaller than the swath of leg the daughter used, but 10 minutes later, no more and no less, the hair came off. Mostly. But my hair is much more thick and dark from years of shaving, though my lower legs are usually epilated so the hair doesn't grow quick as thick. I figured it was at least a good jump on epilating, so went ahead and did as the Johnny Cash song states, doing one part at a time. I was paranoid about getting burned, so did my lower legs one at a time, then each upper leg. By then, I was feeling bullet proof. Two (mostly) smooth legs, no burns, and no issues? Bring on the bikini area. But I had read the reviews, and I wanted to be smooth aallll over, so to hell with it, I did it all. ALL.It didn't work quite as well in the netherworld as on my legs, but the hair is also much thicker. I then jumped in the shower to wash the magical fairy snot of the gods from my skin, and lo, angels began singing as I started scrubbing. I have an exfoliating mitt that I keep my bar of soap in, and as I lathered on the soap, the remaining hair on my legs vanished. It was still patchy down below, but nothing a quick swipe with a razor couldn't fix.Now dried, I looked in the mirror. Bulletproof? Nay, I was Achilles, and nothing could harm me, including a smear of miracle goo on a few problem areas on my face. However, I am a careful Greek hero, so I only set the timer for 4 minutes. That was all it took for my face to be perfectly smooth and the fine but dark and obvious hairs to be gone. To top it off, my dry and flaky self was neither dry nor flaky! I used only a tiny bit of coconut oil, rather than the copious amounts my skin usually absorbs to be soft and touchable.We both smeared on a good amount of the cream where we wanted the hair to be gone, using our hands and washing them immediately. And by good amount, I mean you don't want to see hair stubble. It's $10, so don't be stingy. Then wait your time, using a timer, and scrape it off with the plastic thing, going against the hair. Be careful with areas that have folds or creases, because letting them touch will mess up the layer of goop and give you bad results. I'm 100% sure my less than stellar outcome below was due to not being careful to keep creases and folds from creasing and folding, so I plan to give it another shot in a few days. My husband likes how my skin feels after using Veet, so maybe I can get a helping hand next time....bow chicka wow wow...",
                "reviewVotes": "1,100 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KatKel.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUFOLCX3GRPBXEAAWEUSXTMWHCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S6ACU6IJH3TN?ASIN=B001KYPZ4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing!",
                "reviewText": "Not sure how I made it to 34 before using a hair removal cream but wow this stuff works well!! Only used on legs as that’s the area most in need right now. I leave on for 8-10mn then use the scraper to remove and follow with water, soap and I use a towel to rub dry since some of the hairs don’t break off with the scraper tool. Lotion at the end and I have dolphin-smooth legs!!! Happy customer!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AndreaAndrea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYZJCPSDQ4WH3NA2FQDN4CXLVFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGB9LVT0T2TBL?ASIN=B001KYPZ4G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars interesting",
                "reviewText": "i decided to buy this bc i can’t wax anymore. i knew i shouldn’t have put the product on my face but i was tempted to do it. Well it did work but i would NOT recommend to do it. It did burn and it left a red mark. On the other hand, i also used it for my underarms and it did work and felt smoother than shaving. After a couple of times i was able to remove all the hair. i still expected the product to smell better or at least different bc of the way they advertised it on the bottle (if that makes sense). it’s an okay alternative",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71n5alet5PL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7AFFUJC2ZXLQOGNTLKLHXH65YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAIYK5O5LTOBU?ASIN=B001KYPZ4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing results",
                "reviewText": "I had seen this product in a YouTube video and was skeptical at first, but it really worked like advertised. all you need to do is spread it evenly on your leg (for example) without rubbing it in (as per the directions) wait 5 mins and use the scrapper tool provided to remove the hair. it's really simple and works amazing! it smells good too! you can use a towel to remove the product/hair, but the scrapper does a much better job of getting it all in a few tries. i found using a towel took double the amount of time. I have used this product twice now and i love it. quick and easy 11/10 recommend!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diannie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLXEG3SEBDTAWRZCAOK3CATPV4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CS1FHXLUYURM?ASIN=B001KYPZ4G",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "3.0 out of 5 stars It works",
                "reviewText": "OK firstly, I must let you know that my hair is very thick. OK I’m not even joking. I’m kind of like a gorilla, 🦍 so if you’re like me, take notes. Firstly, I might say that it smells really good.It works, but still leaves the strawberry legs like with those little dots, it takes away all the hair, though.It brings up like a little spatula, made to apply and take away the product.I’ve used it in my armpits, and I would give it a rate of 7 out of 10 because it actually works very good on there.I hope this is helpful for you and that it works out🫶🏻",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Molly R. ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTSWPRV3ZUX2T4NMI3AM5OU77CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KX06U3K2KNJK?ASIN=B001KYPZ4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars This is the stuff.",
                "reviewText": "This really does it. I ONLY use it for my “downstairs” ugh whatever you want to call it.It does not irritate my skin, AND there are NO ingrown hairs! NO razor burn! It’s literally magic.I will say, once you sit with it on and it’s time to take off, you have to use the scraper it comes with to literally “scrape” the hair off of yourself. it won’t just brush off. That’s where it gets a little hard on my skin, but the actual formula is great.Make sure you don’t keep it on too long! 8 minutes is perfect for stubborn and thick hair!!!If you keep it on too long you will get red spots. You’ve been warned!!! Now buy this and never shave again!!!!!",
                "reviewVotes": "31 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "marita vanderhoof",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI3YF2GBGMIM3JW4AYHC5VZ6GVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RINBRBDC2BGIL?ASIN=B001KYPZ4G",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Ritatheridacular",
                "reviewText": "This stuff is great@! It takes off all the hair doesn't burn. Just ten minutes like it says. I tryed alot ,this is the only one that doesn't give me rashes or burns.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHLX4YQNUODLXV6MBKZWX3CXKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H6HH7H94F03D?ASIN=B001KYPZ4G",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Works ok",
                "reviewText": "I found that if you use a washcloth in the shower to remove the lotion, it works a lot better at getting all of the hair. Also, I leave it in for the full 10 minutes rather than the five suggested.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caitlyn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 27, 2024",
                "reviewTitle": "Quite impressed",
                "reviewText": "Made a very good first impression. Very easy to use except it says to try for 5 minutes and I found that did nothing so I left it for the 10 minutes Nd it made a big difference!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 21, 2024",
                "reviewTitle": "La mejor",
                "reviewText": "He probado muchas cremas para depilar y me irritan demasiado, está en cambio, no irrita nada, te deja la piel suave e incluso noto que tarda un poco más en crecer el bello, sin duda la seguiré comprando.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LENISE QUEIROZ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 9, 2023",
                "reviewTitle": "Produto maravilhoso",
                "reviewText": "Produto maravilhoso, pena que teve um aumento de valor absurdo!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Will Pallett",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 15, 2023",
                "reviewTitle": "Works well",
                "reviewText": "Works well and with low smell to it. Just don’t accidentally get anywhere you shouldn’t as you will end up without eyebrows",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on May 10, 2023",
                "reviewTitle": "Worth it",
                "reviewText": "I love the product. Works very well for hair removal.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}