{
    "remaining_requests": 20415,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Razorless-Shaving-SoftSheen-Carson-Maintenance-Depilatory/dp/B000TG63XS",
    "body": {
        "name": "SoftSheen-Carson Magic Razorless Shaving Cream for Men, Hair Removal Cream, for Bald Head Maintenance, No Razor Needed, Depilatory Cream Works in 4 Minutes for Coarse Curly Hair, 6 oz",
        "price": "$5.60$5.60 ($0.93$0.93 / Ounce) $5.01$5.01 ($0.84$0.84 / Ounce)",
        "originalPrice": "$7.49",
        "rawPrice": 5.6,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Razorless-Shaving-SoftSheen-Carson-Maintenance-Depilatory/dp/B000TG63XS",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CGHT6CVH"
        ],
        "asinVariationValues": [
            {
                "asin": "B000TG63XS",
                "variationName": "Size",
                "variationValue": "6 Ounce (Pack of 1)",
                "price": "$5.89",
                "variationImageURL": ""
            },
            {
                "asin": "B079Q9PLS8",
                "variationName": "Size",
                "variationValue": "6 Ounce (Pack of 2)",
                "price": "$17.10",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41H bUZ1xNL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41YIKg4GPZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41B2EhEMzUL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41CgAerSzIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51D1M0v27QL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KL6V17tEL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51UPCDmbhZL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e8d3b91c-960f-4205-8305-f78a4ba5616f/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d76e1a27-62da-450f-8dfb-ead35bfe705e/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the SoftSheen-Carson Store",
            "link": "https://www.amazon.com/stores/SoftSheen-Carson/page/950902AA-BCCB-4F20-9EB4-2C655F358381?ref_=ast_bln"
        },
        "brand": "SoftSheen-Carson",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 6623,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 8 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Razorless Cream Shave for Bald Heads: The best way to get rid of razor bumps is to get rid of the razor! Our depilatory cream features a light fresh scent, works in 4 minutes and lasts for 4 days.",
            "For All Beard Types: Magic Razorless Cream Shave comes in 4 formulations: Regular Strength, Extra Strength, and Bald Head Maintenance, plus our classic powder formulation. No shaving with a razor!",
            "Shaving Products: We make an array of products for all beard types and shaved heads, including razorless depilatory creams and powders to prevent razor bumps, plus exfoliating cleansers and moisturizers.",
            "For Mens' Grooming Needs: From shaving to hair color, pomade and hair moisturizer, find the products specifically formulated for black men that suit your grooming routine.",
            "Softsheen-Carson: For over 110 years we have provided beauty to all consumers of African descent with our innovative, tailor-made, superior products and services specially designed for their needs."
        ],
        "description": "Razorless cream shave formulated to help stop razor bumps and give a closer shave than a razor. With a light fresh scent. Works in 4 minutes and lasts for 4 days. For smooth head maintenance. Reformulated with a light, fresh scent. The more you use Magic Shave the better it works. Lasts up to 4 days. We believe in beauty without compromise Before using Magic Cream Shave for the first time, the following test must be performed. Wait at least 36 hours after using a razor or depilatory product before doing this test. Apply cream to a quarter size area of the beard Wait 4 minutes before removing. Do not scrape. Rinse area thoroughly. After 24 hours, if there is no sign of irritation or redness follow directions on product. IMPORTANT: Contains Thioglycolate. If skin is inflamed or has abrasions, sores or pustules, consult a dermatologist before use. Conduct sensitivity test before use. Wait 36 hours after using any razor or shaving powder. Do not use with any after shave product containing alcohol. Only for use on the head. This is a safety summary. Read all product labeling and instructions completely.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Shaving Creams, Lotions & Gels",
                "link": "https://www.amazon.com/Mens-Shaving-Creams-Lotions-Gels/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271103011"
            },
            {
                "name": "Shaving Creams",
                "link": "https://www.amazon.com/Mens-Shaving-Creams/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13271105011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.07 x 2.05 x 6.54 inches; 0.01 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 0072790000218"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 007279000021 794628154008 685428002968 741655753322 072790000218"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Magic Shave"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B000TG63XS"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,611 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #27 in Men's Shaving Creams"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 6,623 ratings"
            },
            {
                "name": "Brand",
                "value": "SoftSheen-Carson"
            },
            {
                "name": "Scent",
                "value": "Fresh"
            },
            {
                "name": "Material Type Free",
                "value": "Toxic Free"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Magic Shave since 1901 The best way to get rid of razor bumps is to get rid of the razor. With Magic Shave, the grooming expert for African American Men (since 1901). No shaving with a razor. Magic Shave is not a shave cream but a razor-less shaving system.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e1ea1c0e-ac24-4585-9743-6926207181c1._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Magic Shave Creams The New and Improved Magic Shave with Light Fresh Scent available in Extra Strength, Regular Strength and Bald Head. Works in 4 minutes and Lasts for 4 Days. No shaving with a razor. No water necessary just apply.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fbc3681f-879e-4854-8fc0-6fdcaa8d041f._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Magic Shave Powders The original Magic Shave powder available in Extra Strength, Regular Strength, Fragrant and Skin Conditioning formulated for black men . No shaving with a razor. Just mix with water and apply.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a48e7c4b-edb6-4c4f-b51c-7c00577d06d9._SR300,300_.jpg"
                ]
            },
            {
                "media_text": "Bald Head Extra Strength Regular Strength Cream Type Bald Head Extra Strength Regular Strength Usage For Smooth Head maintenance For coarse Beards For Normal Beards No Razor Needed ✓ ✓ ✓ Works in 4 Minutes ✓ ✓ ✓",
                "media_link": []
            },
            {
                "media_text": "Extra Strength Regular Strength Fragrant Skin Conditioning Powder Type Extra Strength Regular Strength Fragrant Skin Conditioning Usage For Coarse Beards For Normal Beards For Normal Beards With Aloe & Vitamin E for Conditioning No Razor Needed ✓ ✓ ✓ ✓ Works in 4 Minutes ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/e1ea1c0e-ac24-4585-9743-6926207181c1._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fbc3681f-879e-4854-8fc0-6fdcaa8d041f._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a48e7c4b-edb6-4c4f-b51c-7c00577d06d9._SR300,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/8e43f6c9-6802-455b-89a5-cfafa5da8e12._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e229dd4-700d-44b1-9dc9-b993b3ddca55._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/4e5fa88d-96f3-4974-9060-746df5555100._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/59c9306a-76e6-48da-b990-649d7ea6e942._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a598cefc-f0f5-422d-b863-5a09e664e77e._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/021f3a21-8307-4127-8a53-d461c2f0d0ba._SR150,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/535c0aab-5da5-4fe5-930a-3978337a0498._SR150,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AJay_89AJay_89",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEZ7BX4TUUHN6UP3UIZZZ6UOF6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VSAR0GMV9MPN?ASIN=B000TG63XS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Works Wonders!",
                "reviewText": "I have a lot of scarring on the back of my head that makes shaving with razors and clippers very difficult. I tried with the clippers anyway and it looked a hot mess. Even though the warning says not to use it on freshly shaven heads, I tried it anyway because I had to go to work the next day and couldn't wait.I tested the product on a spot for the suggested 4mins, and no hair was removed. I applied to my whole head and waited 5-7mins...when I say my head was SMOOTH. No hair at all remained.Did it burn? Not really. It was starting to get a little warm, and that's when I washed it off. My head stayed the same amount of warmth for about 30-45mins and then I started feeling the coldness from not having hair for the 1st time.The smell wasn't bad. It was like a deluded Nair. If you've smelled the normal Magic Shave and are hesitant, do not be afraid to try this. It doesn't smell like that at all.My head stayed smooth for about 2 days before it started growing back, which was longer than I expected because my hair grows FAST (well, where hair still grows at least...).Would I try this again? Absolutely. It worked so well. It didn't hurt. It didn't stink to high heck. It was no work at all. I wish they had an industrial sized bottle of this.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61R7UsDS+jL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFYQYDCMZ7AE7OBCHCRSAMAHQDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25WE621AZ91Z?ASIN=B000TG63XS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2020",
                "reviewTitle": "5.0 out of 5 stars Works Well..",
                "reviewText": "I have found the \"works in 4 minutes\" it states may be true for some. I tried the 4 minutes, but being a black man, it doesn't work in 4 minutes, but!! .... it does works better/great at 15 to 20 minutes (for me). I tried both the razor and this cream... I just both 6 more Magic Shave Creams! Guys, if you're loosing your have, let it go... get this cream, (you'll look better & younger without hair)!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEL4YIX55JFWDTCUIFM4C54PTAQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26FTFUKD04B7J?ASIN=B000TG63XS",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 6, 2023",
                "reviewTitle": "1.0 out of 5 stars Dreadfully Ineffective and Utterly Disappointing",
                "reviewText": "Where's the magic in Softsheen Carson Magic Razorless Shaving Cream? From my experience, the only magic here is how it managed not to remove hair as advertised, rendering it a spectacular failure in terms of performance.I purchased this product based on many positive reviews promising a razorless, hassle-free shaving experience. With hopeful anticipation, I meticulously followed the instructions. To test its efficacy, I first applied it to a small patch on my scalp in an area shaved down to stubble, leaving it for the suggested time of 4 minutes. Nothing budged.Undeterred and hoping for a better outcome, I extended the application time to 7 minutes in a separate area. While this resulted in some hair removal, it was minimal at best, almost laughably so.The product does not appear to be expired; I can't imagine what went wrong. Could it have been a bad batch? While I'm tempted to try it, this initial disappointment has tarnished my trust in the product's claims.To anyone considering Softsheen Carson Magic Razorless Shaving Cream, tempering your expectations or considering other, more reliable alternatives. In my experience, the magic promised by this product is more illusion than reality.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jas1983jas1983",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW757S7MORCFOEFWOJSVNDI7CQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33NVHENV0QNVB?ASIN=B000TG63XS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Head Hair Remover that Works MOSTLY Well",
                "reviewText": "I was looking for a razorless alternative to using razors to keep my head smooth other than razors. I did a Google search and many websites pointed to this product. Razorless Cream Shave for Bald Head by SoftSheen Carson was recommended on many websites so I decided to give it a shot.After prepping my head and following instructions, I dabled a thing layer on a small area to see how would my scalp react to it. After leaving it for the recommended 4 minutes and wiping it off, it was able to remove most of the hairs where I applied the cream and only left me with a small itching sensation.Be aware that many people will react differently from no reaction to burns so DON'T skip this step.I then began to apply it on the rest of my head, but I left it a bit longer to about 8-10 minutes. After time passed, I grabbed a small towel and filled the bathroom sink with some warm to hot water (not boiling) to help me remove the cream.After wiping the solution off, I noticed that it was able to remove most of of the hairs on my head and without any other problems, at least most of my head. In a small area in the front of my head, it left a reddish area that was burning a bit but it went away after several minutes.There were a few small areas where hair stubble remained and added a bit of cream again and repeated the process as above. It removed most of that remaining hair from my head.There are my overall opinions on it:Pro: It works in removing most of the head hair leaving it with a smooth look and feel that even the sharpest of razors cannot do. The cream is easy to apply and to remove.Cons: It does have a smell like most hair removal solutions, but it is not very overpowering. It doesn't remove all the hair 100% so you may need to apply a bit more or just use a sharp razor. Depending on your skin, might leave you with an unpleasant itching or even burning areas so please don't skip the testing step.Overall I liked this hair removal product and I will but it another time when I run out. I will continue to use it carefully.Remember, results will vary depending on the person so please do a little test and read all the instructions.If I could I would give it 3.5-3.8 stars out of 5 stars.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61XECkfctSL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Lak1aFB3L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71XsQHAcibL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Williams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4FLNHZOUQQWUWLJCRFDS3Y6EQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OHRB053GCOZR?ASIN=B000TG63XS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2023",
                "reviewTitle": "5.0 out of 5 stars ACTUALLY WORKS",
                "reviewText": "Product is amazing... I leave it on a little longer than instructed (I guess time varies by hair types) but it works... Only thing I disagree with is how long it last but again that could vary with the person... I have to use it every two days.. But left feeling CLEAN!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B Money",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGV6XUWDXEGGZXM7YCCYBLGNPGCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1K79A4K6H1PO0?ASIN=B000TG63XS",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2023",
                "reviewTitle": "3.0 out of 5 stars White man, didn't work.",
                "reviewText": "I'm a 45 yr old white man with stage 7 baldness pattern. I have been shaving my head for 12 years and always wanted to try a dipiliatory aftwr seeing how it worked for my black friend. My mistake, I think, is assuming hair is hair. I know this says it's formulated for black hair, but I figured at less than 1/8 of an inch, hair is hair.I put it on as directed, tested a spot after 4 minutes, and then at 6 minutes I removed it with a wash cloth. Nothing. The hair was untouched. So, I shaved in the shower as usual and felt a slow burn after. However, this is the closest feeling shave I've ever had, and it looks great.The product felt cooling while it was on my head, and the scent was nice compared to Nair and Veet (others I use on my body). So, 3 stars for the product, but only 3 because it didn't remove my hair.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jules",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 19, 2023",
                "reviewTitle": "Good alternative for shaving",
                "reviewText": "Wanted to try this out on my legs instead and it works really well, but it did take a lot of product in order to get the whole surface. Did sting a little bit (no cuts). But did last for at least a week so its worth it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 30, 2021",
                "reviewTitle": "Arrived! Exactly as described!",
                "reviewText": "Awesome!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark Johnson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 27, 2023",
                "reviewTitle": "Magic shaving cream",
                "reviewText": "Great product",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 3, 2023",
                "reviewTitle": "Great priced product",
                "reviewText": "Did exactly as instructed outcome was effective",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francesco",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 6, 2021",
                "reviewTitle": "Pessima",
                "reviewText": "Non fa assolutamente il suo lavoro, da non comperare assolutamente",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}