{
    "remaining_requests": 20338,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/IntiMD-Intimate-Rash-Free-MOISTURIZING-Squeeze/dp/B01C4ZAPGM",
    "body": {
        "name": "IntiMD COOCHY PLUS Intimate Shave Cream Gel Rash-Free With MOISTURIZING+ 8oz Squeeze Bottle",
        "price": "$12.21$12.21 ($1.53$1.53 / Fl Oz) $11.57$11.57 ($1.45$1.45 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 12.21,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/IntiMD-Intimate-Rash-Free-MOISTURIZING-Squeeze/dp/B01C4ZAPGM",
        "soldBy": {
            "sellerID": "A3FTZHTD80EGOV",
            "name": "Oui Lab",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3FTZHTD80EGOV&asin=B01C4ZAPGM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31XGk3bMMIL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/417O7EtOm4S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rCLMjGk5L.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the IntiMD Store",
            "link": "https://www.amazon.com/stores/IntiMD/page/3BBAA533-AFD1-49A2-9142-94088E17E0FB?ref_=ast_bln"
        },
        "brand": "IntiMD",
        "merchantInfo": "Oui Lab",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 1778,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 18 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MOISTURIZING+ FORMULA – Formulated with 5 powerful moisturizing, and vitamins-rich agents that dramatically improves your intimate shaving experience; Jojoba Oil / Avocado Oil / Aloe Vera / Shea Butter / Maca Root.",
            "IMPROVED COOCHY SHAVING CREAM – With the strengths of MOISTURIZING+ agents, COOCHY PLUS Intimate Shave Cream is developed based on the most-trusted intimate shave cream formula. Safe for all skin types. Made in USA.",
            "INTIMATE & UNIVERSAL – Because COOCHY PLUS is formulated for the most intimate areas of the body, it can also be safely used on any other parts of the body. Helps soften even the most coarse body hair, such as pubic hair or underarm hair.",
            "INTIMATE GUARD – To prevent razor bumps, in-grown hairs, razor burn, or rash caused by other shaving products, MOITURIZING+ agents softens the hair, and forms an invisible shield on your skin to deliver close shaves that do not leave marks or damage your intimate skin."
        ],
        "description": "MOISTURIZING+ FORMULA â\u0080\u0093 Formulated with 5 powerful moisturizing, anti-inflammatory, and vitamins-rich agents that dramatically improves your intimate shaving experience; Jojoba Oil / Avocado Oil / Aloe Vera / Shea Butter / Maca Root. IMPROVED COOCHY SHAVING CREAM â\u0080\u0093 With the strengths of MOISTURIZING+ agents, COOCHY PLUS Intimate Shave Cream is developed based on the most-trusted intimate shave cream formula. Safe for all skin types. Made in USA. INTIMATE & UNIVERSAL â\u0080\u0093 Because COOCHY PLUS is formulated for the most intimate areas of the body, it can also be safely used on any other parts of the body. Helps soften even the most coarse body hair, such as pubic hair or underarm hair. INTIMATE GUARD â\u0080\u0093 To prevent razor bumps, in-grown hairs, razor burn, or rash caused by other shaving products, MOITURIZING+ agents softens the hair, and forms an invisible shield on your skin to deliver close shaves that do not leave marks or damage your intimate skin. Like most women, you have probably run into your fair share of snags, cuts, and bumps while shaving. These can lead to discomfort and tend to leave behind unsightly marks. IntiMD COOCHY PLUS Intimate Shave Cream aims to eliminate the discomforts associated with shaving of sensitive and intimate areas by developing extra-strength MOISTURIZING+ agents to effectively improve the intimate shaving experience. The powerful moisturizers help soften the skin and hair, requiring less pressure from the razor, while also reducing irritation and the occurrence of snags. Along with extremely effective moisturizing and softening properties of Jojoba Seed Oil, Avocado Oil, Shea Butter and Aloe Vera, IntiMD utilizes the Maca Root to provide extra benefits specific to the needs of a woman. This trait also helps the body correctly distribute nutrients, relieving many menstrual symptoms. A great added bonus of this amazing root is its potent aphrodisiacal qualities, known to increase libido as well as alleviate stress-related sexual dysfunction.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Women's",
                "link": "https://www.amazon.com/Womens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13269990011"
            },
            {
                "name": "Shaving Creams, Lotions & Gels",
                "link": "https://www.amazon.com/Womens-Shaving-Creams-Lotions-Gels/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13270001011"
            },
            {
                "name": "Shaving Creams",
                "link": "https://www.amazon.com/Womens-Shaving-Creams/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13270003011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 3.94 x 3.94 x 3.94 inches; 8 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ INT-CP0008"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ February 24, 2016"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ IntiMD"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B01C4ZAPGM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#47,608 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #29 in Women's Shaving Creams"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 1,778 ratings"
            },
            {
                "name": "Brand",
                "value": "IntiMD"
            },
            {
                "name": "Item Form",
                "value": "Oil"
            },
            {
                "name": "Scent",
                "value": "Avocado, Aloe Vera"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "FC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEEISVDJ4LHEUUYEJGOU7WS77V6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21GMHI2QZ7Y4K?ASIN=B01C4ZAPGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 28, 2016",
                "reviewTitle": "5.0 out of 5 stars Finally found something that works.",
                "reviewText": "I am a full-time model (this is my fiance's account, so don't mind the name) that works with swimsuit and underwear brands. So in addition to healthy diet, working out, and never-ending casting appointments, I need to keep my body hair in check. My colleagues and I have probably gone through hundreds of different shaving cream out there. While there have been a few that we liked (EOS Ultra - $10 / bottle, Kiss My Face - $7 / bottle to name a couple) , but a lot of times, we continue to deal with razor bumps, itching and nicks.Bought the Coochy Plus because it was recommended by our traveling masseuse (if you are reading this, thank you Keya!!). Did a little digging and I think Coochy Plus is a second generation of the shaving cream called Coochy. Anyways, there has been a lot of good reviews for the Coochy, but not a lot on the Coochy Plus. So here we go.First, the name. My fiance was laughing hysterically when I first showed him the shave cream, until I realized the play on word of the name, Coochy. So you may or may not want to leave it out in the open. The shave cream comes in a subtle and classy tube. Make sure you remove the top cap, to break the double seal. As soon as you break the seal, you can smell it. If the fragrance of the shave cream matters to you, all I can say is it smells gentle, light sweetness and playful. Definitely not overwhelming. (My fiance said it kind of turns him on)I have a very sensitive pubic skin, so I choose my shaving cream very carefully as well as keeping a very strict shaving routine. First, always exfoliate the area first. Do this with baby oil and rub the area for 2-5 minutes (this also helps soften the skin and pubic hair). Always use a razor that has more than 4 blades. I am currently using Rite Aid Renewal Razor that has 5 blades. A lot of websites tells you to take a hot shower/bath before, but I don't. Apply enough to cover the entire area and a bit more. You can never be too careful. Then shave, but DO NOT put too much pressure. After you are done, simply rinse off with warm water.To say I am in love with the Coochy Plus is an understatement. I absolutely adore this. No razor bumps, nicks or itching. Smooth as a baby's bottom. Usually, my pubic skin may have some light itch the day after the shave, but I barely noticed any itch after using the Coochy Plus. Will definitely continue to use this throughout the year to see how well it works in different weather. Needless to say, if you are constantly shaving your intimate areas, I highly recommend Coochy Plus.Now the price. $11.85 for a 8oz shaving cream makes this one of the most expensive shaving cream I have ever tried. But based on the result, and the fact that it gives me more confidence at my work, it is a godsend.",
                "reviewVotes": "251 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cadie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AET4TBDU7AKNTA7TNUKNLYMVCLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15N0GJ8MHYPMG?ASIN=B01C4ZAPGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Works great",
                "reviewText": "The best! Would buy again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nika",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPPYLA6HIIEML227RR2NSW55D7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KU71GM3WYWGU?ASIN=B01C4ZAPGM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2022",
                "reviewTitle": "4.0 out of 5 stars smooth 👍🏾",
                "reviewText": "probably one of the smoothest shaves ever. smells good, feels good 👍🏾",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mackenzie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNAEOKB5RUYJ7Y6C3FMFIPH3W7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDH8L22RN3PRQ?ASIN=B01C4ZAPGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2023",
                "reviewTitle": "5.0 out of 5 stars LOVEEE THIS PRODUCT",
                "reviewText": "Finally found something that smells absolutely amazing a does an amazing job! I was a little skeptical at first when ordering this product but I am so happy that I did! Will definitely be ordering more when I run out. The bottle is also HUGE and should last a long time!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ms. P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7L5PLNBDPUNDEBJYSS5EWPEVAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34VPX0QZP8VR6?ASIN=B01C4ZAPGM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 12, 2017",
                "reviewTitle": "5.0 out of 5 stars 5 stars after JUST 1 USE",
                "reviewText": "I could write poems all day about how much I love IntiMD Plus, and I've In my used it once so far.I've used regular shave cream and gel, bikini area-specific shave gel, and ALWAYS used bikini zone aftershave cream, and no matter what I did, I always got several razor bumps and unsightly redness.I've only used this product once, but from application through 2 days after use, I can confidently say I'm in love.Even as you're applying it, it feels different and smells different so you immediately have confidence this may be a better experience. After the first razor pass, my skin felt different at first touch. It felt like a more comfortable shave but also, it got SIGNIFICANTLY closer to the skin than anything I've used prior, which I've never thought I'd find those two attributes in one product (feels counter intuitive, closer shave that feels better? Pretty sure it's wizardry).I didn't change my blade or anything else before I used it so I can confidently say with absolutely certainty that this life changing result was purely due to this product.I'm in love forever, I can't wait to try more products in this line, and I can promise you, it's worth it's weight in gold, so definitely worth the higher price (also, it's a large bottle). You'll look and feel different, better. I've even already gotten a compliment from a long term partner who didn't know I changed my product (;Love. Love. Love. I only wish I could have a lifetime supply! (:",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "buyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQ3G4FZB34UPFSOA33RYGG2BFWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UBJ5EJ1KFR77?ASIN=B01C4ZAPGM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 4, 2019",
                "reviewTitle": "3.0 out of 5 stars smells good, leaves skin smooth",
                "reviewText": "I have been using Coochy shave lotion for YEARS, loved it, but recently it seems to be just not enough and slightly burns the inner areas of the lady parts. I have been wanting something natural that results in a smooth shave without any nicks or burning and without all the chemicals. I saw this and it had ingredients that I thought would help with smoothness and possibly no burning on the very sensitive areas. It's better, but not as big of a container, but do like the fact it's a cream, but seems to take more. I tried an experiment.... After the area gets warm in the shower, dried it off and rubbed coconut oil on the area then the Coochy cream. This did help, but noticed the oil dissolved the thing on the razor that helps with it's slickness/roughness. Sounds like a lot of trouble to have a clean shaven, smooth, nice smelling coochy with no nicks or burning involved! Since I was out I purchased one from Walmart by Gillett called Pure, not bad, but has menthol in it so probably will try Coochy Plus again. There were 2 other brands in Walmart in the mean time I might try and they are much more cost effective so I don't feel so bad if I don't use it all up.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$12.85",
                "sellerName": "Oui Lab",
                "sellerRating": "5"
            }
        ]
    }
}