{
    "remaining_requests": 20319,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/VIKINGS-Swedish-Obsidian-Acrylic-Stallion/dp/B01GDZJ4BQ",
    "body": {
        "name": "Luxury Shaving Brush for Men by VIKINGS BLADE, Ultra Heavy Acrylic & 316L Steel Handle, Super Strong Knot Backbone, Minimal Shedding, Fast Lather, Extremely Smooth & Plush on Skin (Dark Stallion)",
        "price": "$28.97 ($28.97 / Count)",
        "originalPrice": "$35.00",
        "rawPrice": 28.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/VIKINGS-Swedish-Obsidian-Acrylic-Stallion/dp/B01GDZJ4BQ",
        "soldBy": {
            "sellerID": "A2CUK23MPGBGEZ",
            "name": "VB Official",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2CUK23MPGBGEZ&asin=B01GDZJ4BQ&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0B9L7FBJM"
        ],
        "asinVariationValues": [
            {
                "asin": "B01GDZJ4BQ",
                "variationName": "Color",
                "variationValue": "1.Dark Stallion",
                "price": "$28.97",
                "variationImageURL": "https://m.media-amazon.com/images/I/51JXpsttFzL._SS36_.jpg"
            },
            {
                "asin": "B01M61RI75",
                "variationName": "Color",
                "variationValue": "2.white Knight",
                "price": "$28.97",
                "variationImageURL": "https://m.media-amazon.com/images/I/419ebcmFQaL._SS36_.jpg"
            },
            {
                "asin": "B0C6PNKT88",
                "variationName": "Color",
                "variationValue": "5.Rustic Walnut",
                "price": "$19.97",
                "variationImageURL": "https://m.media-amazon.com/images/I/51tjloHzrKL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51JXpsttFzL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/513T74MdaSL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41JoiYiIYgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aCmg7kGTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/515XHFEU4ZL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41-s9Z9YRzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41WFiij8GuL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Vikings Blade Store",
            "link": "https://www.amazon.com/stores/VikingsBlade/page/8503EFD5-9F76-4B6E-9445-7D410FDF4705?ref_=ast_bln"
        },
        "brand": "VikingsBlade",
        "merchantInfo": "VB Official",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3851,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 5 hrs 16 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "PERFECT Compliment for any shaving soap, cream and any double edge safety razor, straight razor, shaving razor or cartridge razor",
            "SMOOTH, PLUSH & Long Lasting: a unique man made badger style hair rivaling top-of-the range Silvertip badger hair. Particularly, this knot has a strong backbone, feels ultra smooth & plush on your skin, minimal shedding and does not crumble like most standard badger brushes",
            "HEFTY, HEAVY Steel Base: Heaviest brush on Amazon. Most other shave brushes are made from lightweight black-painted pinewood, whereas this handle is made from ultra heavy and durable acrylic and premium 316L Stainless Steel to create that ultra substantial & luxury feel in your palm",
            "STIMULATES and Exfoliates your skin just the right amount to simulate that luxury hotel barbershop experience",
            "FAST & RICH Lather: Engineered specifically to quickly work up a Thick, Rich and Foamy Lather",
            "PERFECT Gift for that special person on all occasions: Christmas, Valentine's Day, Father's Day, Mother's Day etc"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Shaving Accessories",
                "link": "https://www.amazon.com/Mens-Shaving-Accessories/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271115011"
            },
            {
                "name": "Shaving Brushes",
                "link": "https://www.amazon.com/Shaving-Brushes/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7655037011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 5.39 x 2.28 x 1.61 inches; 5.6 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ VB-SB1"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 641361983283"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Vikings Blade"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B01GDZJ4BQ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,710 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #7 in Shaving Brushes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 3,851 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2fc35885-071f-4f82-b856-875c68ea5d7e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/66aaa2ff-20f3-4c06-8c36-dbac04dbab09.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cb21ef03-ec86-4937-8c2c-fe9f59229902.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f5b48775-94af-4689-b2b2-a505e6a69c8e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/121877c4-b3de-4483-9f12-3f12bae8e60d.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Joseph P. Darmon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2AJIB6RSXEEPY2EHVUMQHFL4CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R133P1ATEEROEN?ASIN=B01GDZJ4BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 13, 2020",
                "reviewTitle": "5.0 out of 5 stars Great Brush, and Cruelty Free!",
                "reviewText": "I used to have some AOS brushes, but they never quite sat right. Overly soft, didn't lather as well as I would like, to be fair it was their lowest tier badger. When I discovered the practices of Chinese made brushes (the badger is killed) and I couldn't reliably trace the origin of most my brushes, I decided I wanted something that was Synthetic, Cruelty Free, From the US or an Ally, and lastly one that performs well. I took a gamble on this brush, and it worked out well. The brush is synthetic (nylon) and cruelty free, made in Australia, and the one thing I couldn't research, performance. It is as soft as a typical silver tip badger, looks just like one, and performs better in my opinion. The water retention is better than badger as the water retention is very consistent. The brush loads well, lathers well, and applies well. The brush isn't the cheapest out there, but its also a fraction of the cost of silver tipped badger, and in my opinion of equal quality.The handle has some real weight to it. I was shocked at how heavy. Its not cumbersome in any way, but there is no doubt as to how substantial this thing is. The white knight is faux Ivory, so it looks nice, but is also cruelty free. The handle is proudly stamped as Australian made. Ivory trimmed with a chrome like finish. Fits in my brush stand, so thats a plus.A note on travel, the brush does come in a tube (and may be stamped made in china, but thats just the tube). The tube while it CAN be used for travel, it does not appear to be the original intent. So you may need to carefully add your own holes for ventilation and drainage. I have heard some of the tubes could be a heavy cardboard, mine was a lovely acryllic.I intend to buy the capsule style for travel when needed as it is a travel brush.FYI, The Dark Stallion is Badger, the white knight, dark raven and fire mare to my knowledge are all cruelty free. I can verify matter of factually the white knight is a synthetic brush, and quite a good one at that.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AdmiralAdmiral",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZFQAOM6RLHAIQ2XEJ2MZZOTTFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPO0J65G6JCIY?ASIN=B01GDZJ4BQ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2017",
                "reviewTitle": "5.0 out of 5 stars Love at first sight but looks can be deceiving. - Updated Review",
                "reviewText": "REVIEW UPDATE 3/12/17I was contacted by Julian from Vikings Blade. Apparently there was a very small chance I received a brush from the old stock. These brushes have been upgraded and a new and improved batch came out Nov 2016. I was explained the old batch was removed and replaced by the new version but somehow I might have ended up with one of the old ones.My purchase came with a 30 day warranty so I was offered a free replacement but I was told that if I was looking for the \"silvertip soft feel\", the \"White Knight\" premium synthetic brush was the better choice. Julian explained how great these brushes are, made of quality synthetic fibers that absorb and retain water better than real badger plus they have firm bristles and the tips are soft, better, much better than the badger version. I was a little hesitant to take a synthetic. I have a few brushes in badger, boar and horse but I am not really into fake bristles. I was assured I was going to love it so I went for the synthetic version.The brush arrived the next day and man! what was I missing! Not only is this brush in ivory color gorgeous but the fibers look great with the white tip and they feel softer than real silvertip IMO. I used the brush that same day with Arko soap and face lathering for my shave, this brush worked like a champ. The knot has backbone and the tips soft and gentle. The brush lathered very fast, it hold enough lather for my 3 passes. At the end, the brush was easy to clean, dried quickly and retained its new shape.I used it again few days later but this time I wanted to know how good it will perform bowl lathering with hard soap. Well, it did great and just as my natural badgers, got the lather pretty quick with minimal effort and holding enough lather for 3 or more passes.If you are like me and have never tried a synthetic, give it a try because you are missing out. This is a great brush, It will perform very good and it will add a distinctive look to your bathroom. I am including pictures of my bowl lathering before, during and after the shave. Hope you find this long review informative and helps you decide.- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -I was thinking in rating it 4 stars but I had to be more honest in my review as this will help other buyers and even Vikings Blade by taking things into consideration.The good: The handle is just gorgeous! Black obsidian acrylic with the alloy base combination make this handle look and feel luxurious. The handle is heavy and comfortable to hold, you can feel quality that sets this brush handle aside for the others. The logo in the alloy is fantastic and adds an extra touch of quality. Made in Australia.The Bad: The badger knot is not up to this handle quality level. This badger hair is short and feels cheap and scratchy. My new quality horse brush by Vie-Long and premium boar brush by Semogue feels softer and provide better lathering! Badger is supposed to be a class above horse and boar but this badger is just inferior to my other brushes. This knot has no backbone, it’s hard to lather because there is minimal to no backbone. The brush also splits/opens on your face for the same reason.I will recommend Vikings Blade to go a step above and change these knots with quality badger hair knots (finest badger or super badger) but if they want to keep the \"best badger\" line and current price then to change these knot suppliers. Another great option for these good-looking handles is to change them to SUPER quality boar and horse knots but only if they can get the best, if they put cheap ones then will have the same result. Viking Blade is going in the right direction with quality shaving products at a good price but just need some improvement.",
                "reviewVotes": "110 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61QkPikaP2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/7118aaIUiuL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/7131n7-ip0L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco Castillo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 26, 2023",
                "reviewTitle": "La recomiendo",
                "reviewText": "Buena calidad, me gustó mucho",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anand S.Anand S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 8, 2019",
                "reviewTitle": "Worth it",
                "reviewText": "This is an instrument of men.The brush is just the right weight to produce a foamy lather.Don’t think twice.Showed my teenager son how to shave.He is definitely hooked on the experience.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61uTO735OyL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "JDD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on December 21, 2020",
                "reviewTitle": "Good brush",
                "reviewText": "Nice brush that has performed very well since I bought it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Radek M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on May 28, 2020",
                "reviewTitle": "Most luxurious shaving brush I have owned",
                "reviewText": "I have used a number of synthetic brushes over the years - this one works the best of them all! It creates heaps of thick lather very quickly. Let's hope it lasts a long time.A warning - my brush arrived in a packaging that said \"traditional badger brush\", very different to what the listing shows. However, Vikings Blade answered my email within minutes and explained that this was just a printing error and that this model has always been synthetic.Another thing is that the metal base of the brush is very heavy. This feels nice, but also means that if you are used to leave your brush in the bowl while shaving between passes, you will not be able to do so without tipping the bowl. Try putting the brush down on its base instead. Not a big thing, but may take some getting used to!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CARLOS EDUARDO CRUZ MALDONADOCARLOS EDUARDO CRUZ MALDONADO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 6, 2021",
                "reviewTitle": "Excelente llego antes de tiempo ñ",
                "reviewText": "Justo lo que esperaba llego muy rapido",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1axXcYaTFS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1Ev6+c17QS.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/B1EeCJetG1S.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$28.99",
                "sellerName": "VB Official",
                "sellerRating": "5"
            }
        ]
    }
}