{
    "remaining_requests": 20452,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Proraso-Shaving-Cream-Moisturizing-Nourishing/dp/B0084GVSWG",
    "body": {
        "name": "Proraso Nourishing Shaving Cream for Men",
        "price": "$9.50$9.50 ($1.83$1.83 / Ounce) $8.50$8.50 ($1.63$1.63 / Ounce)",
        "originalPrice": "",
        "rawPrice": 9.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Proraso-Shaving-Cream-Moisturizing-Nourishing/dp/B0084GVSWG",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C6N17XNZ"
        ],
        "asinVariationValues": [
            {
                "asin": "B09MFYH6WK",
                "variationName": "Style",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/411SLz9I+RL._SS36_.jpg"
            },
            {
                "asin": "B0B1XHDD7D",
                "variationName": "Style",
                "variationValue": "",
                "price": "$23.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41lzlhshQKL._SS36_.jpg"
            },
            {
                "asin": "B0084GVSWG",
                "variationName": "Style",
                "variationValue": "",
                "price": "$10.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41qR69M0SfL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Only 17 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41qR69M0SfL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31fTfnxAViL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ALo7dqsGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41khhRJgOAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51rKf2lt0IL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41rkqBnGFxL.jpg",
            "https://m.media-amazon.com/images/I/51xLnslzBLL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6d90c4c1-8ed0-47bb-8803-dce9b5c8a3c6/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/76ceef14-6bed-4fab-a6e2-65b09084828e/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/184f56c5-7ef1-4678-b1d7-893ea2f266b1/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4b37c9ca-2b02-436a-b5f6-a95cd8df63ec/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 4,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Proraso",
            "link": "https://www.amazon.com/stores/Proraso/page/934C9CDF-7206-44BD-8E50-BD91CE92A14C?ref_=dp_csx_lgbl_n_luxury-beauty"
        },
        "brand": "Proraso",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 3878,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 3 hrs 15 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Proraso Shaving Cream, Moisturizing and Nourishing Proraso Shaving Cream, Moisturizing and Nourishing formula, is enriched with Sandalwood Oil and Shea Butter to soften even the thickest and toughest beards. The blade glides easily and the beard, softened by the synergic action of the Pre-shaving Emollient Cream and Emollient Soap, is easier to shave. The traditional vegetable stearin-based formula is enriched with nourishing botanical extracts and natural oils to protect the skin before, during and after shaving, and helps the blade glide smoothly, reducing razor burn. Proraso Shaving Cream in a Tube is still made today in accordance with a rigorous \"hot soap\"-making process, during which it's left to mature for 3 days, resulting in an ultra-rich soap that, especially with the aid of a brush, produces an incomparably thick, creamy, soft lather. Barber's choice since 1948 No parabens, no silicones No mineral oil, no SLS No artificial colors No ingredients of animal origin Over 95% natural Made in Italy",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Shaving Creams, Lotions & Gels",
                "link": "https://www.amazon.com/Mens-Shaving-Creams-Lotions-Gels/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271103011"
            },
            {
                "name": "Shaving Creams",
                "link": "https://www.amazon.com/Mens-Shaving-Creams/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13271105011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8 x 2.5 x 8 inches; 6.35 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 8004395001095"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Proraso"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0084GVSWG"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Italy"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,625 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #37 in Men's Shaving Creams"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 3,878 ratings"
            },
            {
                "name": "Brand",
                "value": "Proraso"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Scent",
                "value": "Sandalwood"
            },
            {
                "name": "Material Type Free",
                "value": "Paraben Free"
            },
            {
                "name": "Skin Type",
                "value": "Dry"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Proraso Brand Story Founded in 1908 by Ludovico Martelli, Proraso has been innovating professional highest-quality products in the shaving world for generations, and has evolved to become a staple of Italian culture. From the first Pre-Shave cream in 1948, to now, the Martelli family principles hold true: to create professional, quality products that deliver a pleasurable and impeccable shave, in the barbershop and at home. Proraso Shaving Cream, Moisturizing and Nourishing Proraso Shaving Cream, Moisturizing and Nourishing formula, is enriched with Sandalwood Oil and Shea Butter to soften even the thickest and toughest beards. The blade glides easily and the beard, softened by the synergic action of the Pre-shaving Emollient Cream and Emollient Soap, is easier to shave. The traditional vegetable stearin-based formula is enriched with nourishing botanical extracts and natural oils to protect the skin before, during and after shaving, and helps the blade glide smoothly, reducing razor burn. Proraso Shaving Cream in a Tube is still made today in accordance with a rigorous \"hot soap\"-making process, during which it's left to mature for 3 days, resulting in an ultra-rich soap that, especially with the aid of a brush, produces an incomparably thick, creamy, soft lather. Barber's choice since 1948 No parabens, no silicones No mineral oil, no SLS No artificial colors No ingredients of animal origin Over 95% natural Made in Italy",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/1eca15d0-91f1-40a5-abe3-8d4f34d3e784._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/2b3bf2b5-ca2f-4bb8-b638-0edf81aa4a65._SR230,100_.png"
                ]
            },
            {
                "media_text": "For the ultimate shave experience, see the 10 Tips for the Perfect Shave below Short on time? With a brush: Apply your favorite Proraso Pre-Shave Cream to your damp face (for optimal results). Run your shaving brush under hot running water for about 30 seconds, if you don't have time to soak it. (The brush will absorb a good amount of water - just not as much as if soaked.) Squeeze about 2cm of theShaving Cream onto your brush. Dampen face with warm water, and work the brush into your scruff/stubble. You should be able to achieve a decent lather in fewer than 90 seconds. This method also works well if you’re shaving in the shower. Shave and rinse, following with your favorite Proraso After Shave Balm or Lotion. Using your hands: After applying your favorite Proraso Pre-Shave cream (for optimal results), squeeze about 2cm of the Shaving Cream into the palm of your hand, then add a small amount of water (less than a tsp). Work cream and water together until suds begin to form. Apply mixture into your scruff/stubble using your fingers, massaging in circular movements until a lather forms. If necessary, add a little more water to the face as you continue working the lather. Once a lather has formed, shave and rinse thoroughly, following with your favorite Proraso After Shave Balm or Lotion.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/e87fc18a-5f4d-42b6-84c8-6038ce00a458._SR300,300_.png"
                ]
            },
            {
                "media_text": "10 Tips for the Perfect Shave Morning is the best time to shave Your skin is at its softest and most relaxed just after you wake up, so the razor glides easier. Always use a Proraso Pre-Shave Cream It softens and straightens the hairs, making it easier to apply the shaving cream to your beard and pre-conditions the skin. Wrap your face in a warm, wet towel Just like traditional barbers do. Otherwise, shave after your morning shower when the skin is soft and hydrated from the warm water. The best lather comes from a brush and shaving cream or soap Applying shaving cream or soap with a brush increases the volume of your beard hair and allows for a closer shave. To build up a rich lather, wet your shaving brush and apply the cream in fast, repeated circular motions to coat the brush bristles well.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/c6b84898-6f26-4519-b849-cfda50a6df1f._SL220__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/da992ba6-83b4-43a8-bb38-d45e4885ddec._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fa56e1ac-cd8b-4f09-a044-11a3155138bf._SL220__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ed85beaf-7959-4782-8c01-9b762e129b1e._SL220__.jpg"
                ]
            },
            {
                "media_text": "While shaving, use a delicate, but firm stroke Don't put too much pressure on the razor and follow the lines of your face, always keeping the skin pulled tight. Keep your razor clean Rinse the blade with hot water at least once every two swipes of the razor. Residue from past shaves can reduce the blades' effectiveness and increase the risk of damaging your skin. Also, remember to change your razor often. For the perfect shave, one pass just doesn't cut it Lather your face a second time and repeat the shave. Don't neglect your post-shave routine Rinse your face well and repeatedly to remove any residue.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/eef2b760-0dd5-4fa1-a035-b154c301e0a0._SL220__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/fde552c6-853f-40f9-85b3-092a5dad53be._SL220__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a6165992-5653-467b-876e-2c63aefdeff0._SL220__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/de8684a4-6304-4629-a55b-5c59b4e3a5d3._SL220__.png"
                ]
            },
            {
                "media_text": "Always use Proraso After Shave Balm or Lotion Even if you've shaved to perfection, your skin may still feel stressed and will need to be disinfected, restored and softened. Take care of your skin Especially if you don't shave every day, or have problems with ingrown hair, apply a face cream daily. Have a question? Which Proraso formula is best for me? What's the trick to making the best lather? Post your question in the Customer Questions section below and one of our pros will answer!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/a7c6894e-56b1-4961-9bfa-ce507ac493ad._SL220__.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/ec0e5854-c90e-4757-90a9-a7269d3d2eb2._SL220__.png",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d7292da2-8ab1-4273-a776-faa473dc3af2._SL220__.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/1eca15d0-91f1-40a5-abe3-8d4f34d3e784._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2b3bf2b5-ca2f-4bb8-b638-0edf81aa4a65._SR230,100_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e87fc18a-5f4d-42b6-84c8-6038ce00a458._SR300,300_.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c6b84898-6f26-4519-b849-cfda50a6df1f._SL220__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/da992ba6-83b4-43a8-bb38-d45e4885ddec._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fa56e1ac-cd8b-4f09-a044-11a3155138bf._SL220__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ed85beaf-7959-4782-8c01-9b762e129b1e._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eef2b760-0dd5-4fa1-a035-b154c301e0a0._SL220__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/fde552c6-853f-40f9-85b3-092a5dad53be._SL220__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a6165992-5653-467b-876e-2c63aefdeff0._SL220__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/de8684a4-6304-4629-a55b-5c59b4e3a5d3._SL220__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a7c6894e-56b1-4961-9bfa-ce507ac493ad._SL220__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ec0e5854-c90e-4757-90a9-a7269d3d2eb2._SL220__.png",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d7292da2-8ab1-4273-a776-faa473dc3af2._SL220__.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GG48GG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQW35CIG3RAM6FHA3TW7YOQVWZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FHUUWAHB2C6L?ASIN=B0084GVSWG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2014",
                "reviewTitle": "5.0 out of 5 stars Best of the premium shaving creams I have tried",
                "reviewText": "Best of the premium shaving creams I have tried.I have tried the following brands of Shaving Cream in the following order:Taylor of Old Bond Street Lavender Shaving Cream BowlTaylor of Old Bond Street Lemon + Lime Shaving CreamPaula's Choice PC4Men ShaveProraso Shaving Cream, SandalwoodMusgo Real Shave CreamProraso Shaving Cream, Aloe and Vitamin EFirst, a little about me and how I shave, so you have some perspective when reading my review...I am a bald man and shave my face as well as head. I am fair skinned and would say that my beard is medium-coarse and my skin is semi-sensitive. I prefer using a Gillete Fusion cartridge blade, although I have tried many other types. I shave in a hot shower and apply shave cream to my face using a Vulfix \"Super Badger\" hair brush, and apply it to the brush with my hand. I don't use a bowl, due to being in the shower, and since my hand works just fine to mix/apply the cream to my brush.In a shave cream product, I look for a product that creates good lather, reduces friction and irritation, has a comfortable shave, is moisturizing, doesn't make me break out, and either unscented or a pleasant smell.My first foray into premium shave creams started with the brand, Taylor of Old Bond Street. I really liked their lavender shave cream bowl. I happily used it for a couple of years. It has a nice smell and a thick lather which lasts on the brush for as many as 5 passes on my head and face with only re-applying to the brush once. It was a very comfortable shave and left my face and head soft, smooth, and moisturized. The smell was a little strong, but I love the smell of lavender and enjoyed it despite the strength of the fragrance. I never had any problems with breakouts or irritation, and always had a good shave. I also tried the lemon-lime scent, but didn't find it as pleasing as the lavender variety, although the shave quality was the same as the lavender scented cream. The lemon-lime scent is not nearly as strong as the lavender, and I would recommend these two Taylor products to anyone; they're awesome.The problem with the Taylor stuff for me was that, in the shower, I would have to unscrew the top of the bowl container, set it aside, then use my fingers to collect some cream, and then replace the cap. A few times I ended up spilling some or getting water in the bowl, thereby wasting product. By the end of the usable life of the bowl of shave cream, I had a watered down cream. So, I decided to look for shave cream in a tube form, for easier use in the shower. I'm not sure why I never tried the tubes that Taylor sells. Perhaps it was the cost, or maybe they weren't available at the time. I can't remember.First, I tried the brand, \"Paulas Choice\", since my wife and I use her skin products like sun screen, exfoliants, anti-oxidant creams, moisturizers, cleansers, etc. She makes great stuff and it is much more affordable than other premium brands. I highly recommend her stuff. Where her stuff is lacking, though, is in men's shave products. I tried her \"PC4MEN Shave\" gel and found it to be extremely thin, no lather, and not as pleasing to shave with. Admittedly, it is not meant to be a lathering cream, and is an entirely different type of product, which some people may actually prefer. The shave was not as comfortable or pleasing as any of the creams I've used, but did seem to provide decent lubrication. I had to apply it several times during a shave and use a lot of semi-expensive product. I just didn't like it. If Paula ever comes out with an actual shave cream, I will rush to try it, because of the extremely high quality of everything else she sells.Next, I ordered myself a tube each of the Musgo Real and the Proraso Snadalwood creams from Amazon.I decided to try the Proraso first. It had a nice, very light smell. It lathered up thick and creamy, and felt great going on my skin with my Vulfix badger brush that I've used for years. I had a slightly better shave than the Taylor stuff I used to use, with less irritation; I wasecstatic. I was getting a better shave, without the hassle of the bowl packaging. It was also easier to pack and travel with than the bowl. Admittedly, I miss the Taylor's lavender smell a little. I'm not super-crazy about the sandalwood smell, but it is pleasant and very light. My skin feels smooth, moisturized, and without irritation when shaving with the Proraso Sandalwood. It is my favorite shave cream product I've tried.Next I tried the Musgo Real. I really liked it. The smell was different than the Proraso Sandalwood, and I preferred it over the Proraso. The Musgo Real has a thicker feel. It probably has less water in it than the Proraso stuff. It also has, what seems to be, fibrous strands of something mixed in. It feels really nice! When applying it with my brush, it felt super thick and hearty. It required a little more work to generate the same lather as the Proraso, and Oh!, what torture it is needing to massage my face more with my badger hair brush! Just kidding, of course. More time with the brush is actually a pleasure, except if you're in a big hurry. I got an excellent shave with the Musgo Real and really liked it. Very little irritation, and it is right up there with the Proraso Sandalwood for comfort and a very pleasant shave. It takes a very close second place to the Proraso Sandalwood, mainly because of my preference for Proraso's easier lathering. I feel like the Musgo Real did last a little longer on the brush for more applications, but only very slightly longer.Next, I was running out of my supply, so I decided to order some more Proraso. I decided that since I wasn't in love with the Sandalwood scent, I would try Proraso's Viramin E and Aloe formula. On my first shave with it, I didn't like it very much. The scent reminded me of Johnson and Johnson's body powder. Not horrible, but not my preference. It's a very light scent and not over powering, just like the sandalwood, but, regardless, the scent was more bothersome to me than pleasant. It went on a little thinner than the Proraso Sandalwood, and I needed to use significantly more to get a decent lather. Even when applying a good amount, the lather was not as rich as with the Proraso Sandalwood's or Musgo Real's. The Proraso Vitamin E and Aloe also has a slight bit of menthol in it, which I absolutely hate. It is barely noticeable until the end of a long shave, after you've had it on your skin for a while. Then comes that menthol tingle that I absolutely despise. I ended up going through the tube as fast as I could, just to use it up.I then ordered another tube of Proraso Sandalwood and am going to stick with it. I am very happy with it and do not plan to switch any time soon. I hope this helps those of you deciding on what shave product to try next. Since you know so much about how I like to shave, feel free to recommend a new product to me that you like, or comment on my review.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jonathan Golubiewski",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBAVYHTTLUAESZG52U4374CB3OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVAZ5R13FIZ5K?ASIN=B0084GVSWG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Oh, the LATHER!!! Get a close shave leaving your skin SMOOTH! Simply Unbeatable!",
                "reviewText": "I honestly haven't found ANYTHING that lathers as nicely and smoothly as Proraso! I originally ordered it with my straight razor and have been using it for years. Nothing can touch the silky smoothness of the lather this creates. I've tried soaps, creams, foams, etc.Side note: Get yourself a badger hair shaving brush to apply this shaving cream. You can find them as cheap as $1, but you'd probably get a genuine one for $15? or more. I've had mine for 20 yrs, so they are an investment like the straight razor. A badger hair brush absorbs the water and allows for a beautiful lather to form. When you apply the foam to your skin, it further lathers, spreads the shave cream, and exfoliates your skin. Shave soaps seem to lather, but surprisingly they don't lubricate, nor does the lather last any significant time. By the tine you later your face and pick up your razor, the lather from the shave soaps is gone! Proraso lathers into a smooth, longer lasting, lubricating foam.Proraso Shaving Cream makes a very nice lubricated surface for your razer whether it's a straight razor or multi-blade. Warm your skin to open your pours, stretch your skin out (you can use a wash cloth to \"grip\" your skin), and shave. You'll get an incredible shave without nicking, razor burn, or bumps! It washes away nicely leaving your skin feeling smooth and clean. The Sandalwood & Shea Butter is very nice on your beard. It's also available in: \"Eucalyptus oil & Menthol\" - which has a very nice smell as well. You won't believe how close of a shave you can get! And you'll NEVER use that goopy foam-in-a-can again!!!Give this stuff a try - you won't regret it!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lobot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBDRBU2RWU5DYZCZTLNDOMQ3I6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IA3EV7DNWOZD?ASIN=B0084GVSWG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Finally, a cream that does it all",
                "reviewText": "I have had a badger shaving brush for years but stopped using it because shaving soaps for it weren’t great. This brand comes in several nice scents and types. All of them leave your face smooth and soft, not to mention leaving an understated masculine smell all day. A brush, a little dab of water and penny sized dropped of this shaving paste is all you need for the best shave of your life. The tubes last a long time so it is a good value. The item always arrives much sooner than Amazon predicts. You’ll love this stuff and so will your partner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MICHAEL E HESS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXY2U6EA5P4UY3JP25CZNYVRZCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32L0NADYXOD2S?ASIN=B0084GVSWG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Great Scent and easy to lather.",
                "reviewText": "I wish this came in a canister rather than a tube but can't complain. It has a great sandalwood scent and lathers very well.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jim Tomlinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVJZYDPTGGFZHLETV7O5QR2WZXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15CX4D0PLI7UA?ASIN=B0084GVSWG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Rich and Creamy",
                "reviewText": "It took me a while to find the perfect shaving cream and this is it. The sandalwood fragrance reminds you of a trip to the barbershop. I wish they made it in a travel size.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Just Mad .. madly crazy ..",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETPYCF5RFZKREWIAK4OUTW4ATYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3810WZFL77LEC?ASIN=B0084GVSWG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great stuff",
                "reviewText": "Good value, lasts about 3 months.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECDZLTIQOHDIDHDG476JQSQDMLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12ALY9I8HGEBP?ASIN=B0084GVSWG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Straight razor shave cream",
                "reviewText": "Great shave soap. The best option for my skin. I will continue to purchase this item.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GoldFinger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM3FFRIY35UAWO5FX5RK4UWAHOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12XHMD8CQZRZT?ASIN=B0084GVSWG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice Scent",
                "reviewText": "This item is superb like other Proraso cream and aftershave. The Box that it came in was super strong and nicely packaged making it the perfect gift candidate.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "george max",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2024",
                "reviewTitle": "amazon.ca",
                "reviewText": "excellent product, highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richy-JP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on December 4, 2023",
                "reviewTitle": "Sandalwood Symphony: PRORASO",
                "reviewText": "PRORASO's Shaving Cream with Sandalwood for Sensitive Skin is really much better than I expected. Typically an Old Bond Street kind of shaver, I was skeptical at first but I'm pretty convinced now.Straight off the bat, let's talk about the consistency. This isn't your run-of-the-mill, air-filled foam. It's a rich cream that provides a decent barrier between your skin and the blade. For those with sensitive skin, this is a godsend. The irritation often associated with shaving (which I often experienced) becomes a thing of the past, replaced by a smooth, almost therapeutic experience.The scent is another highlight. It's sandalwood – but not creepy sandalwood. This isn't an overpowering, in-your-face fragrance. It's subtle, refined, and, frankly, pretty sophisticated.In terms of performance, it's top-notch. The blade glides effortlessly, and the end result is a close, comfortable shave. No nicks, no cuts, just a clean, sharp finish.To sum it up, Proraso's Sandalwood Shaving Cream is a cut above. It's a little luxury in the mundane ritual of shaving, turning an everyday chore into a more pleasurable experience. For those who value quality and comfort in their grooming routine, this is a no-brainer. Five stars, easily earned.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ott",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 2, 2024",
                "reviewTitle": "Smells awesome",
                "reviewText": "I would love to buy it again but unfortunately they seem to be out of stock for some time now",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "天存",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on September 22, 2023",
                "reviewTitle": "良い香り",
                "reviewText": "他のクリームを使ったことがないので比較出来ませんが、良い香りだと思います。妻も「このいい匂い何？」って言ってました。思ったより大きいチューブで驚きましたが他の製品より割安でお得感があります。リピ買いしようと思います。",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 7, 2023",
                "reviewTitle": "Good value, excellent shave cream.",
                "reviewText": "I've used many different shave creams over the years but I always come back to Proraso. I prefer a light or no scent cream and this one has a nice minimal scent, nothing overwhelming. It lathers well, gives and comfortable shave and the cream lasts me for 2-3 months.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}