{
    "remaining_requests": 20499,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Gillette-Fusion5-Hydra-Ultra-Sensitive/dp/B001E5E24K",
    "body": {
        "name": "Gillette Fusion5 Ultra Sensitive Shave Gel, 7oz (Pack of 6)",
        "price": "$29.80",
        "originalPrice": "",
        "rawPrice": 29.8,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Gillette-Fusion5-Hydra-Ultra-Sensitive/dp/B001E5E24K",
        "soldBy": {
            "sellerID": "A2LYX7FKX6AP16",
            "name": "Wiki Deals",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2LYX7FKX6AP16&asin=B001E5E24K&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CPJNG4QP"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CTPXVH8K",
                "variationName": "Style",
                "variationValue": "",
                "price": "$11.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41gyBoJnh+L._SS36_.jpg"
            },
            {
                "asin": "B001E5E24K",
                "variationName": "Style",
                "variationValue": "",
                "price": "$29.80",
                "variationImageURL": "https://m.media-amazon.com/images/I/51kG83uCo8L._SS36_.jpg"
            },
            {
                "asin": "B07DZYGDS3",
                "variationName": "Style",
                "variationValue": "",
                "price": "$20.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/51HeLYdyZwL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "18",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51kG83uCo8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41QhWCtTW-L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51s8lpEjyoL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51plkCJIaQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aqIX4MJTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41uMcUKxnVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41z0mFiI9vL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Gillette Store",
            "link": "https://www.amazon.com/stores/Gillette/page/36BF4E36-EF06-4253-A19B-71868BCD4A4F?ref_=ast_bln"
        },
        "brand": "Gillette",
        "merchantInfo": "Wiki Deals",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 34963,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35. Order within 18 hrs 36 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "High levels of glide ingredients to deliver an incredibly smooth shave",
            "Contains menthol, to cool and help soothe irritation",
            "Cooling formula helps keep skin feeling refreshed through your entire shave",
            "Clean. Close. Comfortable"
        ],
        "description": "Product Description Gillette Fusion5 Ultra Sensitive Shave Gel features our Ultra Comfort Complex, which cools to soothe and helps protect skin during the shave to leave it feeling clean and comfortable. This shave gel is suitable for sensitive skin and provides incredible skin comfort. Use with a Fusion5 razor for comfort before, during and after the shave From the Manufacturer Shaving can be tough on sensitive skin unless you have the comforting, soothing protection of Gillette Fusion Ultra Sensitive HydraGel shave gel. Its deep, rich formula of hydrating emollients and lubricants, like Glycerine and Lubrajel Oil, helps to soften facial hair for a comfortable shave. Designed to partner with the Gillette Fusion shaving systems. Product InformationAccessoriesProduct FAQsHow does Ultra Sensitive Fusion HydraGel work?Shaving is a man’s job, so you need the right tools to get it done. That’s why Gillettedeveloped Ultra Sensitive. The unique formulation, with aloe and vitamin E, creates aprotective blanket that helps lock in moisture and soften facial hair. The result?A smoother razor glide and less tugging of the hair. Why should I use Shave Gel on my skin?In life, the best offense is a good defense. That’s why you need to take care of yourskin. Start by using a good shave gel. It will help lock moisture into your skin andsoften your facial hair, so your razor will have a smooth glide. And a smooth glidemeans less shaving irritation.Why are there different varieties of Gillette Fusion HydraGel and howdo they differ?Because your skin is as individual as you are, Gillette has developed seven differenttypes of Fusion HydraGel. They are Pure and Sensitive, Cooling, Tough Beard, Cleanand Fresh, Clear Skin, Ultra Sensitive, and Moisturizing. Check out our completelineup and then pick the one that best suits your needs.Ultra Sensitive – With aloe and Vitamin E, it meets the needs of yoursensitive skin. Moisturizing – This formula, with aloe and cocoa butter, provides an incrediblycomfortable shave. Pure and Sensitive – Proven performance on sensitive skin. Dye andfragrance-free. Tough Beard – This formula, with Glycerin and beard-hydrating ingredients,helps to provide an incredibly comfortable shaving experience. Clean and Fresh – Aloe and citrus extracts provide a fresh and clean scent. Clear Skin – Effective cleansing ingredients help remove impurities such as dirtand oil. How long before shaving do I apply gel on my face?To ensure maximum effectiveness, apply one minute before shaving. This will softenyour facial hair and allow for less tug and pull when shaving. Be sure to apply Gilletteshave gel in slow circular motions, covering all areas to get the most comfortableshave possible.Which product should I use on my sensitive skin?For those with sensitive skin, we recommend either Ultra Sensitive, containing aloeand vitamin E, or Pure and Sensitive, which is free from fragrance and dyes. However,all Gillette Shave Gels cover your skin with a triple protection anti-friction layer toreduce the risk of irritation. So you can get a comfortable shave no matter whichyou use.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b?ie=UTF8&node=13271079011"
            },
            {
                "name": "Shaving Creams, Lotions & Gels",
                "link": "https://www.amazon.com/Mens-Shaving-Creams-Lotions-Gels/b?ie=UTF8&node=13271103011"
            },
            {
                "name": "Shaving Gels",
                "link": "https://www.amazon.com/Mens-Shaving-Gels/b?ie=UTF8&node=13271109011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.08 x 2.08 x 7.75 inches; 10.05 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 2.5oz"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 047400159068 047400506794 047400159082 047400159075 047400159051"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Procter & Gamble - HABA Hub"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B001E5E24K"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#431 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #34 in Men's Shaving Gels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 34,963 ratings"
            },
            {
                "name": "Brand",
                "value": "Gillette"
            },
            {
                "name": "Item Form",
                "value": "Gel"
            },
            {
                "name": "Scent",
                "value": "Aloe Vera"
            },
            {
                "name": "Material Type Free",
                "value": "Dye Free"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/937e2e0e-c6ca-40dc-b5c2-4c1e7e3ff656.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f953a544-5854-464c-907e-1bd148a57376.__CR0,15,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/06feb422-1ca6-44d0-870e-12f32505d99e.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/410d813c-354f-4692-ba33-774b8b3d788a.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e849d205-0200-48b7-98ad-3aeb93cc9455.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1f2a6def-b046-415d-9424-b2cd21f00f67.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shawny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF4P5YCM3LB3NO2OAVC7X4LZCHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2T0DVUXD398K5?ASIN=B001E5E24K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 4, 2023",
                "reviewTitle": "5.0 out of 5 stars My Fave Disposable (Reusable!) Razor -- More Environmentally Friendly Than Brand-X",
                "reviewText": "Short of just growing a full-on beard, and other than using a straight razor (O brave one!) these are the most environmentally-friendly disposable razors you can get.I've been using Fusion5 razors for quite a number of years -- basically since they came out in 2006-ish, so that's nearly 18 years -- and here's why:These are VERY long-lasting disposable razors. I suppose if you have very coarse, hefty facial hair, you won't get the same results as mine, but in all honesty, I can use the same razor for months, not just one month, but several -- probably 3. My shaving habits have changed around over the years. Some years I was completely shaved-face each and every day. Then I went with a goatee, then a full beard, only trimming my neck and doing general trimming on cheeks. Then back to naked face, then around and around we go. But I've always stuck with what's worked for me. Sure they're more expensive but that's because they're BETTER than all of the others. I mean the Mach3 is rather good, but not as good IMHO as Fusion5.This little kit is nice because you get the ergonomic, hefty, balanced handle, and 4 blade refills. I've had to laugh at the numerous reviews that complain that there's only 4 refills when the package actually SAYS it's got 4 refills ... they complain about the image on the packaging as having a refill in it, but what do they expect ... an image of the handle with no blade cartridge? My oh my. The complaint is that it's \"false advertisement\" and \"not the value expressed\", and that sort of thing. But no matter even if there was a secret extra refill in the package, it's still a better bargain than the cheapo brands.For those of you saying \"They're too expensive\" -- Let's just do some math:I just found one cheapo brand that has a 144-count box of twin-blade razors, with cheap, hollow, plastic non-balanced handles, that cost $26.49. No one in his right mind is gonna use these razors more than once, am I right? So that's 144, divided by 30 days is 4.8 months. So nearly 5 months of meh-to-okay shaving, with at least a nick or two each session. Am I wrong here? You know I'm not.The Fusion5 razors, with the very conservative 1 month of use, balanced handle, 5 blades for a super close and smooth shave, with virtually zero nicks (unless you're being unreasonably rushed and sloppy, or if you've lost the smoothness of locomotion and for this I feel for you, brother) is just behind with a solid 4 months of shaves vs the 4.8 months with the cheapos. But the next time you don't even need to purchase the handle, and you can get 8 more refills (that's at least 8 months of shaves!) for $30. So add that to the $20 for the starter kit of 4-and-a-handle and you've spent $50 on a full year's worth of fine shaving. With me so far?For the cheapo razors, at 4.8 months, you must purchase 2.5 cartons of 144 to get the same number of shaves. Only you can't purchase half cartons, and you therefore must purchase 3 at $26.49 each. That's a grand total of $79.47 vs $50 for the Fusion5.It's a no-brainer! .... Anyway ...These are also great for shaving your private parts. I did that for a few months, and it really feels good, but it's a lot of maintenance, and I'm a fairly low-maintenance guy. But while I did, I can remember only nicking myself \"down there\" once using the Fushion5. And it wasn't a big deal at all.Take care of your face (and your private place). It's the only one you've got. Use Fusion5, dude.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Javion J. Saunders",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUGC6DFCK5SQDB372UXAGFW4FLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KUE70Q7ACS4B?ASIN=B001E5E24K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Gillette Fusion5 Razors - Exceptional Shaving Precision and Comfort",
                "reviewText": "I recently tried the Gillette Fusion5 Razors for Men, and it has undoubtedly earned its place as a staple in my grooming routine. Here’s why I’m impressed:Firstly, the packaging includes not just one but four blade refills, offering long-lasting value. The 5-blade design is a game-changer, providing an incredibly close shave that leaves my skin feeling smooth and refreshed. The precision of these blades is unparalleled, effortlessly gliding over facial contours for a consistently even shave.The Lubrastrip feature is a thoughtful addition, enhancing the comfort of each shave. I noticed a significant reduction in irritation, thanks to the lubricating strip that provides a smooth glide, especially in areas prone to sensitivity.The ergonomic design of the handle ensures a comfortable grip, making the shaving process both efficient and enjoyable. The razor’s flexibility allows it to adapt to the curves of my face, ensuring no spot is missed during the shaving process.One notable aspect is the longevity of each blade. I found that the blades maintain their sharpness over multiple uses, providing reliable performance and value for the cost.Whether you’re maintaining a clean-shaven look or prefer a well-groomed beard, the Gillette Fusion5 Razors cater to a range of grooming preferences. The quality of the blades, combined with the Lubrastrip feature, sets these razors apart in terms of both performance and comfort.In conclusion, the Gillette Fusion5 Razors for Men deliver on their promise of a more comfortable shave without compromising precision. For those seeking a reliable and effective shaving solution, these razors are a standout choice. Highly recommended for a consistently smooth and irritation-free shaving experience.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "George K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4X46SNISSXBTZSYFR7B5DICRDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24BQSKET0V6JH?ASIN=B001E5E24K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Very pleased, good shave",
                "reviewText": "It’s probably been at least a decade since I’ve purchased a new razor. I’ve been very pleased with this product. I get a smooth, easy shave with not remaining stubble. I’ll keep buying the replacement blades for this one for the next decade, or until they no longer make blades for it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Cantrell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFG4G7DXVVFMAVRCZI7KXH66TUJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TPXQ4F54UCL4?ASIN=B001E5E24K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars good set but dulls quickly",
                "reviewText": "blades dont last long",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabe Adames",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6IAYSCQRESPGROZN2S7DSOA2YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17IXIX105PPH1?ASIN=B001E5E24K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Buy",
                "reviewText": "Great purchase. I’ve used 1 razor to shave my head and face about 14 times. Getting ready to use the second razor now. I shave my head twice a week. It works great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William Harrell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4FEPXJO2QO76FDM2CORVXG5LIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRXAN5BDR65RB?ASIN=B001E5E24K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars The right price point",
                "reviewText": "The is at the right price point for a good product. I shave every day and the heads provided should last a few months. It's a close shave without nicking or cuts and has a nice hand feel. It's worth it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Curtis Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSK7W4UB4MRL673HJHPF4QSFIDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SMFEH3UPJR30?ASIN=B001E5E24K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars It's a must have",
                "reviewText": "I can go on an on about this product smooth an clean shave is to say the least I have been using this razor for over 20yrs an I'll probably never go to another.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBCPHY74Y7YNUVKK7IE4LXR3JYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GW7T0D0IBWJW?ASIN=B001E5E24K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Recommend",
                "reviewText": "I didn’t realize how amazing these were. They are nice material and are durable. Love how it comes with 3 extra blades.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Israel Sanchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 3, 2024",
                "reviewTitle": "Excelente producto",
                "reviewText": "Es un excelente producto, práctico y de calidad",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "alejandro vargas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 2, 2023",
                "reviewTitle": "Producto de Calidad",
                "reviewText": "La calidad del articulo es excelente, ya lo probé y el rasurado es muy bueno con menos pasadas y no me irrito la piel",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tameka P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 29, 2020",
                "reviewTitle": "Does the job it’s meant to",
                "reviewText": "Works well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on March 16, 2023",
                "reviewTitle": "Rasuradora muy buena",
                "reviewText": "Muy buen producto, tiene un gran filo y rasura de buena manera. En lo personal suelo tener acné y este rastrillo funciona de maravilla para evitar cortaduras",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge N",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 23, 2022",
                "reviewTitle": "Cumplió con mis expectativas",
                "reviewText": "Las cuchillas de afeitar bastante buenas y duran mucho.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$29.82",
                "sellerName": "Amazon.com",
                "sellerRating": ""
            }
        ]
    }
}