{
    "remaining_requests": 20539,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Proraso-Shaving-Cream-Refreshing-Toning/dp/B00837ZOI0",
    "body": {
        "name": "Proraso Refreshing Shaving Cream for Men",
        "price": "$9.50$9.50 ($9.50$9.50 / Count) $8.50$8.50 ($8.50$8.50 / Count)",
        "originalPrice": "",
        "rawPrice": 9.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Proraso-Shaving-Cream-Refreshing-Toning/dp/B00837ZOI0",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C6N2T962"
        ],
        "asinVariationValues": [
            {
                "asin": "B09NQ9BGNH",
                "variationName": "Style",
                "variationValue": "",
                "price": "$22.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41F-xpwBJ4L._SS36_.jpg"
            },
            {
                "asin": "B09BVSDJ8S",
                "variationName": "Style",
                "variationValue": "",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41FW4NO6QgL._SS36_.jpg"
            },
            {
                "asin": "B0B1XDJ927",
                "variationName": "Style",
                "variationValue": "",
                "price": "$23.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/41eZmX+Mu6L._SS36_.jpg"
            },
            {
                "asin": "B00837ZOI0",
                "variationName": "Style",
                "variationValue": "",
                "price": "$10.00",
                "variationImageURL": "https://m.media-amazon.com/images/I/418EM3Ne+gL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/418EM3Ne gL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31NGONMXKaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51qwU0qt34L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Tey-FdJgL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Ok3amSJYL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41pq8kMk1aL.jpg",
            "https://m.media-amazon.com/images/I/51MANsGkdcL._SX35_SY46.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4849e2c4-beef-40fc-9d40-7eca7d1f4675/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/2b239313-d2c6-4be4-83bb-3df24eaf6950/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e493e8d7-c286-4dab-b88d-9b7d3b811f80/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/66568da4-2ccd-4c84-9386-066b9e4d4136/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b5900b44-650b-4be6-bcf4-6adc20954e2d/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/02085daa-d54f-4bbe-a430-9a29c5112da5/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Proraso",
            "link": "https://www.amazon.com/stores/Proraso/page/934C9CDF-7206-44BD-8E50-BD91CE92A14C?ref_=dp_csx_lgbl_n_luxury-beauty"
        },
        "brand": "Proraso",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 10811,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 14 hrs 42 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 14 hrs 42 mins",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Shaving Creams, Lotions & Gels",
                "link": "https://www.amazon.com/Mens-Shaving-Creams-Lotions-Gels/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271103011"
            },
            {
                "name": "Shaving Creams",
                "link": "https://www.amazon.com/Mens-Shaving-Creams/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13271105011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 8 x 2.25 x 8 inches; 5.29 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 8004395001118"
            },
            {
                "name": "Department ‏",
                "value": "‎ Men"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 793379169583"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Proraso"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00837ZOI0"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Italy"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,773 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #9 in Men's Shaving Creams"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 10,811 ratings"
            },
            {
                "name": "Brand",
                "value": "Proraso"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Scent",
                "value": "Menthol"
            },
            {
                "name": "Material Type Free",
                "value": "Paraben Free"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "t-dubt-dub",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGELBKMA7DTPSKRNGLJXAUNK2LEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9RJHQMX2EVUU?ASIN=B00837ZOI0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Proraso- The Ultimate Shave, period!",
                "reviewText": "Long story short, I'm 58 years old and have never had a better shave in my life, ever, than with Proraso shaving products. I recently stumbled across Proraso when the shaving soap I normally use was sold out on Amazon and boy am I glad I did. It is an amazing experience to use such high quality shaving soap and products. From the pre-shave cream, to the tubed shaving creme, to the after shave lotion, never before have I enjoyed such a close and comfortable shave. The pre-shave cream is amazing and sets the stage for a perfect shave. It gives an initial \"freeze\" of menthol and eucalyptus that invigorates and provides a base lubricity that really helps your razer glide. The tubed shaving cream is absolutely opulent in texture. So smooth and velvety, a pleasure to use, and a real luxury. The after shave lotion not only smells great but leaves my skin feeling soft and smooth. I like the fact that the scent doesn't linger as I have cologne that I use if I wish to \"wear\" a scent. I use the \"Refreshing\" blend and love the menthol and eucalyptus properties of these products as they make shaving a pleasure and leave my skin in excellent condition, feeling great. I am definitely a Proraso customer for life!",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71ML0aiUFIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71a0UsI11fL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71sO8hkgsbL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYULLGVNU7N6PVQ72ZBED4D4NYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYRM545WKQF3A?ASIN=B00837ZOI0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars The best shaving cream",
                "reviewText": "I was turned onto this product by my Barber for the aftershave. Aftershave beat the traditional balm/lotion I would use. This actually smelt and felt great. Then I found the shaving cream also. Once you rub it in real good, it produces a great lather and really conditions your face for the shave. Hands down you won’t be dissatisfied!! Made in Italy,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "clev12",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7KILDUUTED2PJKIZFIW6E4JOIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHK920516EMOD?ASIN=B00837ZOI0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2012",
                "reviewTitle": "5.0 out of 5 stars Great product! Not to be used as toothpaste in a drunken stupor.",
                "reviewText": "This stuff is awesome! Is it the ONLY cream I use? No. But I keep it steady in rotation.I used to break out horribly after shaving using the mass marketed stuff with rash and irritation. I then discovered wet shaving with a dual edge safety blade and WOW what a difference. If you are able to use the Mach-50 or whatever they call them these days more power to you.Back when I first started shaving I could've shaved with the same Mach-3 cartdridge for an entire school year...rust deposits and all. Sadly those days are gone and my beard would now give a cheese grater a run for its money. With that said . . . canned shaving cream also seemed to make the whole shaving thing a royal pain in the patella as it was drying and irritating to my skin. Again . . . if you can get away with the canned stuff count yourself very fortunate. In my teens a can of shaving cream would last me 2 years. Go figure.To each his own as far as his methods are concerned. Lets talk about this cream now. It comes in a huge tube and does look like it's something out of my grandfather's era. I consider the tube to be a generous supply for the price. It smells slightly medicinal but in a good clean way. I especially enjoy using this stuff during the hot summer months or while on vacation. The tingle and smell is therapeutic and not overwhelming. It does not smell like you slopped a jar of Vicks vaporub on your face. It's more pleasant, yet some people just aren't fans of Eucalyptus.The cream provides a great lather when paired with a decent shave bowl and brush. A little goes a long way. Squeeze a bead the size of nickel or dime in the bowl depending on how much lather you like. Wet your brush with warm water. Mix the cream in the bowl. You may add a few more drops of water to get the consistency you desire. Remember that the lather is on your brush and not in your bowl. Apply lather, shave, and rinse.I usually apply the lather for a minimum of 2 passes. More often 3. When I have a date with the little lady I go the extra mile with a 4th pass. Back to front. Front to back. Top to bottom. Bottom to top. If you enjoy the smell of your cream apply a little behind your ears and rub it in.Follow up with a toner based bump preventer if you're prone to razor bumps and then after shave. Lastly apply a shaving lotion.If you stick with a routine your skin will be clear, your face soft, and the woman happy. Using products like this make shaving a little more enjoyable. I think I'll go shave right now!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wanderer977",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDJABTMOU2NIVTZDFD4EUETTUXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R107AFGATPAB08?ASIN=B00837ZOI0",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 18, 2013",
                "reviewTitle": "5.0 out of 5 stars This is a great cream. Little Stinky.",
                "reviewText": "A while back, frustrated by razor burn and ingrown hairs, I took to the internet to find a solution. I had a heavy beard, with skin that was dry and sensitive. I hated shaving, my face was read, burning and bleeding when I was done shaving, and I couldn't use an expensive blade for more than a week. One thing I was introduced to was wetshaving. Wetshaving can best be described as \"old time\" shaving. Wetshaving is far superior to the shaving technique that most men use today, and has greatly improved my shaving experience, and I don't dread shaving like I used to.Wetshaving soon became the search for the perfect shave. Trying to get a balance between a smooth well groomed face, and no irritation. In fact, as many can attest, it soon became an obsession. Over the last few years I have tried dozens of different razors, shaving creams, pre-shave oils,shaving bowls, badger brushes, aftershave balms and lotions, to find the perfect shave. I have bought everything from the highest end shaving creams at thirty or forty dollars a jar, to five dollar shave soaps. Having said all of that, Proraso is my favorite cream of all. It is an Italian produced cream that is very well respected by those who are \"shaving gourmets.\"The one thing that you must know about Proraso is it has menthol, and eucalyptus, and lots of it. It has been described as having a cooling or even bracing sensation, so much so that some guys don't like to use it in the winter. It also has a very strong and unique smell. Some say it smells medicinal, I think it smells like an Italian sewer to be honest. So why do I think it is the best cream? Well, 1st it is a great value for the money. While it may look expensive, when using a brush, you only need an almond sized amount in your bowl for a clean shave. So a tube will last you 3 months easy. It is essentially no more expensive than the dried out gunk they sell in aerosol cans at your local drugstore and yet it performs as well as something 3x's the price. Second, it produces a rich lather that has a slickness to it, which I believe is one of the most important parts of a good shave. A slick shaving cream means less drag from the razor. Third, it is great for guys like me who have thick beards. Some prefer a lighter lather, but I have found that with a thick beard you need all the protection you can get. Fourth, it comes in a tube, which I prefer to a shaving soap (soaps dry out my face) and to tubs. I travel a lot and I find it easier to travel with a tube then with a tub, just fits in my Dop bag better for some reason. Also, I have found that creams you get in a tube (and Proraso especially) can still give you a good shave without a brush.Some other brands say they will give you a good shave with or without a brush, but not true in my experience. I don't take my brush with me when I travel, and the fact that I can still get a good lather while traveling is a big plus. Fifth, I like the cooling (bracing effect) that I described earlier. If you are like me and ingrown hairs and razor burn are your main worries, washing off your face with cold water after you shave is nice, kind of like putting an ice pack on an inflamed knee, it dulls the irritation. Finally, it works great with the other products in the line. I have never liked pre-shave oils because, while they do protect the face, they make it harder to apply shaving cream and gunk up your razor. However, with the Proraso preshave it is different. It is not an oil, but a paste, so it seems to come off easier (however, take it easy with the preshave, put on too much and it will actually produce a burning sensation from all the menthol). Also, I really like the Proraso aftershave, not too thick not too thin.Put them all together and you can get a very good shave. If you don't want to spend the money on the Proraso aftershave, the Nivea Sensitive Balm is great too and half the price and available at most drug stores.One thing that I must mention is that Proraso is sold in America as Bigelow Shaving Cream. When I bought a bottle from here I was disapointed that when it arrived from the seller (LCI) it was damaged and unusable.I use amazon for the convenience, I don't have time to box stuff up and ship it back. So I went to the store that carries this product, and found that they had a buy 2 get 1 free sale. So I tossed this one, and just got 3 of the Bigelow creams (exact same ingredients) for 20 bucks plus tax. Now I am set for the next few months.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jarry0121",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 28, 2023",
                "reviewTitle": "La mejor crema espuma para afeitar",
                "reviewText": "Gran calidad, aunque su presentación parecería que es para durar poco la verdad es que dura bastante esta crema y es muy fresca.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "paolo b.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on February 13, 2024",
                "reviewTitle": "Ottimo prodotto",
                "reviewText": "Ottimo prodotto, molto meglio di quello solido, morbido e stendibile in un'attimo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HENRIQUE PACHECOHENRIQUE PACHECO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 10, 2024",
                "reviewTitle": "Produto de excelente qualidade",
                "reviewText": "Adorei este produto, aconselho vivamente o produto e a qualidade desta marca.Tem um cheiro muito suave, deixa a pele em excelente condições, super suave e sem irritação, deixado a cara muito suave e com uma sensação de frescura. Muitos parabéns pela vossa qualidade.Produto top.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51zkvuf-Y2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51DhfSZk3vL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/514o9gtAoIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61QQtux5iAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61W4bH5NwOL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marion Schubert",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 3, 2024",
                "reviewTitle": "Erfrischend",
                "reviewText": "Benutze ich seit Jahren, angenehm auf der Haut.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 27, 2024",
                "reviewTitle": "Dryg",
                "reviewText": "Helt klart en favorit",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}