{
    "remaining_requests": 20249,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Taconic-Shave-EUCALYPTUS-Shaving-Luxurious/dp/B00563JQBU",
    "body": {
        "name": "Taconic Shave, All Natural Shave Cream – Highly-Concentrated, Shaving Cream for Men and Women – 4 oz. Moisturizing Shaving Cream Tub with Skin Soothing Ingredients – Cooling Eucalyptus & Mint",
        "price": "$15.99$15.99 ($4.00$4.00 / Fl Oz) $15.19$15.19 ($3.80$3.80 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 15.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Taconic-Shave-EUCALYPTUS-Shaving-Luxurious/dp/B00563JQBU",
        "soldBy": {
            "sellerID": "A262S395NXGG8Z",
            "name": "Super Safety Razors",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A262S395NXGG8Z&asin=B00563JQBU&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B092CSPDKS"
        ],
        "asinVariationValues": [
            {
                "asin": "B00563GB9K",
                "variationName": "Scent",
                "variationValue": "",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/41BUK2A3P2L._SS36_.jpg"
            },
            {
                "asin": "B00563JQBU",
                "variationName": "Scent",
                "variationValue": "",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51H3KsZ0ItL._SS36_.jpg"
            },
            {
                "asin": "B00969UTN4",
                "variationName": "Scent",
                "variationValue": "",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51Q2wXK1GUL._SS36_.jpg"
            },
            {
                "asin": "B01MDP4IGQ",
                "variationName": "Scent",
                "variationValue": "",
                "price": "$15.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51IVlTNlDhL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "16",
        "stockDetail": "Only 16 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51H3KsZ0ItL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/5146OCxy28L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VOiDYLitL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41KFjTxb4cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Yd1YgHo8L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51E6RZYUCrL.jpg"
        ],
        "imagesCount": 6,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fdbf0cd0-ff0e-490e-8dd2-c233dfd580e8/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 1,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Taconic Shave Store",
            "link": "https://www.amazon.com/stores/TaconicShave/page/2934EFA6-1224-460B-9B13-493FCD8BC747?ref_=ast_bln"
        },
        "brand": "TaconicShave",
        "merchantInfo": "Super Safety Razors",
        "customerReview": "3.4 out of 5 stars",
        "customerReviewCount": 485,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 17 hrs 5 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "SUPER CONCENTRATED: Slick and thick, this natural shave cream creates a rich, luxurious lather that softens your beard and skin, offering you superior razor glide to deliver a barbershop close shave. It aids in the prevention of razor bumps, burns, micro-cuts, and skin irritation associated with shaving.",
            "SKIN NOURISHING: Handcrafted in the USA, this high lather shave cream nourishes and moisturizes your skin. Suitable for brush as well as brushless use, Taconic’s Shave Cream is full of skin-soothing ingredients which result in a refreshed feeling after each shave.",
            "ALL-NATURAL INGREDIENTS: This super concentrated, ultra lather shaving cream is handcrafted with premium natural ingredients. Our proprietary formulation was specifically developed with natural essential oils and skin soothing ingredients to help prevent rashes and shaving irritation.",
            "SATISFYING FRAGRANCE: Made in the USA by our artisan soap and shave cream makers in small batches, this all-natural soothing shave cream will quickly become your favorite. It is available in Urban Woods, Tequila Lime, Eucalyptus Mint, and Bay Rum scents.",
            "FOR ALL SKIN TYPES: Perfect for sensitive, normal, and dry skin types, this Taconic Shave cream is an extremely rich and luxurious formula that is designed for men and women. Formulated with all-natural ingredients, it promises a luxurious shaving experience!"
        ],
        "description": "Taconic Shave Shaving Cream – A Handcrafted Shaving Essential! Taconic Shave’s Shaving Cream is handcrafted in the USA with a highly concentrated consistency using organic components. One tub will last for many months while offering a much smoother and luxurious shaving experience than canned chemical shave creams. Loved by customers, our 4-oz shave cream tub is the highest quality shave cream available. Crafted in small batches by the Taconic Shave artisans, our shaving cream creates a thick and luxurious lather that softens the beard so the razor glides more smoothly. The rich, creamy lather minimizes the razor’s irritation, bumps and cuts. Taconic’s shaving cream won’t dry out your skin and will leave it hydrated, moisturized, and refreshed.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Shave & Hair Removal",
                "link": "https://www.amazon.com/Shaving-Hair-Removal-Personal-Care/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3778591"
            },
            {
                "name": "Men's",
                "link": "https://www.amazon.com/Mens-Shaving-Hair-Removal-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=13271079011"
            },
            {
                "name": "Shaving Creams, Lotions & Gels",
                "link": "https://www.amazon.com/Mens-Shaving-Creams-Lotions-Gels/b/ref=dp_bc_aui_C_4?ie=UTF8&node=13271103011"
            },
            {
                "name": "Shaving Creams",
                "link": "https://www.amazon.com/Mens-Shaving-Creams/b/ref=dp_bc_aui_C_5?ie=UTF8&node=13271105011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 2.8 x 2.7 x 2.3 inches; 4 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ TSEMSC"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Taconic Shave"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00563JQBU"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#151,954 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #248 in Men's Shaving Creams"
            },
            {
                "name": "Customer Reviews",
                "value": "3.4 3.4 out of 5 stars 485 ratings"
            },
            {
                "name": "Brand",
                "value": "Taconic Shave"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Scent",
                "value": "Eucalyptus Mint"
            },
            {
                "name": "Skin Type",
                "value": "Dry,All Skin Types"
            },
            {
                "name": "Age Range (Description)",
                "value": "Adult"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Treat yourself to Taconic Shave's premium men's grooming products made from the purest ingredients - all proudly artisan-made in the USA. Create an unparalleled shaving and grooming experience right in the comfort of your own home. The rich collection of shaving creams from Taconic Shave leaves your skin nourished, moisturized, and calm. Taconic Shave’s Shaving Cream makes every shave a luxurious experience.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b938fe0-2087-4490-8d3d-750fb7d6c7d7.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "Taconic Shave Shaving Cream – A Handcrafted Shaving Essential! Taconic Shave’s Shaving Cream is handcrafted in the USA with a highly concentrated consistency using organic components. One tub will last for many months while offering a much smoother and luxurious shaving experience than canned chemical shave creams. Loved by customers, our 4-oz shave cream tub is the highest quality shave cream available. Crafted in small batches by the Taconic Shave artisans, our shaving cream creates a thick and luxurious lather that softens the beard so the razor glides more smoothly. The rich, creamy lather minimizes the razor’s irritation, bumps and cuts. Taconic’s shaving cream won’t dry out your skin and will leave it hydrated, moisturized, and refreshed. Includes: 1 x 4 oz. Taconic Shave’s Shaving Cream Tub",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7631f4ca-3456-4024-85a6-3d4e599ef0bb.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Fragrances – So many to Love! Urban Woods – Great for the urbanite or country gent, the scent of Urban Woods is one of our customer favorites. Blending warming tobacco blossom, cedar & bergamot, you will enjoy a long-lasting effect with a crisp refreshing scent. Tequila Lime– Tequila Lime is a great choice for those who admire this classic scent reminiscent of the famous tequila lime cocktail. With its mild bright lime scent and unique blend of essential oils, its fragrance is especially at home in the tropics and in warm weather. Eucalyptus Mint– Creating a cooling sensation with a refreshing splash of mint, this scent will give you that lift you need in the morning with natural skin benefits. A classic favorite of many because of the infusion of Eucalyptus essential oils. Bay Rum – A favorite of the quintessential gentleman, enjoy the warm & spicy scent of Bay Rum. This shaving cream is a timeless classic, crafted with our own essential oil blend with hints of cinnamon, bay leaf, and sweet citrus.",
                "media_link": []
            },
            {
                "media_text": "Fresh, Lingering Scents Taconic Shave understands the need for variety and offers satisfying lathering shaving creams in refreshing scents. Perfect for everyday use, this shaving cream is offered in Urban Woods, Tequila Lime, Eucalyptus Mint, and Bay Rum scents. Apply with or without a Shave Brush This versatile shaving cream offers both brush and brushless applications. Allow the brush to soak or run under hot water. Shake out excess water and apply a small amount of cream onto the brush tips and massage into your face in a circular motion (or lather in a shave bowl first). You can also apply this cream using wet fingertips for brushless application. Personal Shave, Professional Look This concentrated, soothing shave cream will give you a clean, smooth, and refreshing shave every time! Order the tub for yourself or gift one to someone special who wants a luxurious shave experience in their own home.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/827d4b5a-c522-434a-8ffa-cd18fd63d783.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/824d4b89-6adb-4545-b3d7-754be8857184.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8364e416-0e29-4246-adae-0f3b60da5ae3.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6b938fe0-2087-4490-8d3d-750fb7d6c7d7.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7631f4ca-3456-4024-85a6-3d4e599ef0bb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/827d4b5a-c522-434a-8ffa-cd18fd63d783.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/824d4b89-6adb-4545-b3d7-754be8857184.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8364e416-0e29-4246-adae-0f3b60da5ae3.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Coffee Luvr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRROLUGN527SCHY6OGFZGPT5Z3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P4J561RN3BGJ?ASIN=B00563JQBU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2013",
                "reviewTitle": "5.0 out of 5 stars Superior Performance Shave Cream!",
                "reviewText": "(I originally posted this review on Badger & Blade, an outstanding website devoted to old-school shaving) Taconic Shave LIME Shaving Cream with Organic Oils - 4 oz. - MADE IN THE USA While looking for a quality shaving cream or soap for summer use, I discovered Taconic Shave Tequila Lime Shaving Cream with Organic Oils. I'll call it Taconic Lime from here on out. The reviews on Amazon.com and other sites were extremely positive, though the number of reviews was small. I love lime, the ingredients are organic, and the price was reasonable, so I pulled the trigger.The scent is natural and refreshing -- mostly lime, but with a hint of Tequila. The \"cream\" itself is so hard that is should not be called a cream. It is not hard like a soap, however; it is truly a paste. There was a tiny amount of separation of the ingredients, with a small amount of liquid resting on a crust of firm paste. I just broke the moist crust with my index finger and stirred the mixture, leaving everything mixed and smooth. The cream worked beautifully for me, so it was a non-issue. Other reviewers had a problem with this, so I decided to include it.Then, I went through my normal shower and face preparation, wet my badger brush with hot water, squeezed it out, and twirled it around the surface of the Taconic Lime Shave Cream until a little of the cream stuck the tip.It does not take very much -- at all -- to whip up an excellent lather with Taconic Shave Lime. It took a few strokes more than with Proraso or Art of Shaving, but the lather is moist, rich, thick, and slick. It is closest in consistency to Mitchell's Wool Fat, but slicker -- and more moisturizing.The lather felt so protective that I made one more pass than usual, ending in a Baby-Butt-Smooth shave! I left no nicks or abrasions behind. The lime scent is pleasantly strong during the shave itself, but lingers barely above the surface when the shave is done.Taconic Shave Lime rinsed easily in warm water. After a quick pass of alum and application of Art of Shaving aftershave balm, my face felt excellent. Refreshed, moisturized, but not greasy.I will use the shaving creams & soaps I've used before as points of comparison during this review: D.R. Harris Marlborough, Mitchell's Wool Fat (under the Kent label), Art of Shaving Sandalwood, Proraso original, Proraso Sandalwood, and Spencer & Devon Sagebrush.D.R. Harris Marlborough provides rich, thick lather and an extremely close shave, but leaves my skin feeling slightly dry. Taconic Lime gives an equally close shave, but with a richer, thicker lather and a far more moisturized face.Art of Shaving and Proraso products give a similar lather -- and nearly as much moisturization. However, they require more product than Taconic Lime does. To be clear, though, Taconic Lime provides the best moisturization of any shaving cream I have ever used. It is quite remarkable.Taconic Lime lather is also similar in consistency and performance to Spencer & Devon Shaving Cream (which will be the subject of a review in the near future). Both yield outstanding results, and both moisturized my face better than I could have hoped. The Taconic Lime made slightly thicker lather -- and had slightly more lubrication. To be fair, though, I have only used the Spencer & Devon cream a few times, and I have not yet perfected my lathering technique with it. That part of the review may change once I dial in my technique with the Spencer & Devon.Quibbles:There is only one aspect of the product that could use improvement. The opening of the plastic jar is quite small -- smaller than the diameter of my medium-sized badger brush. Though I can presently twirl the top of my brush in the cream, once I use some up, I'll have to scoop a small amount out with my finger and transfer it to the brush. I'd like to see a jar similar to that made by Art of Shaving, which uses a larger container with a smaller scooped-out part inside so that all of the product is easily accessible to the brush. A minor quibble, to be sure, but a fair one.All-in-all, Taconic Shave Tequila Lime Shave Cream is a superior product in all ways. It provides a shave on par with the best products I have used -- and at an excellent price. In addition, I require less product per use than products of similar quality, and Taconic Shave Lime provides the best moisturization of any shaving product I have used.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Albion Ray Moore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUJMHGGXPU4BS6IRIHOV2T35HNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YZZP7ZFQFQE7?ASIN=B00563JQBU",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "1.0 out of 5 stars Not a good choice",
                "reviewText": "I am very disappointed in this product. The \"cream\" is so hard that I had to add water to the container and stir it with a wood stick -several times- and I still have to scoop the cream out with my finger and put it on my shave brush. It never makes a rich lather in any way and leaves the brush stiff and gummy feeling. The only positive thing is it smells pretty good. I am ordering the Art of Shaving brand of cream asap and throwing this in the trash as soon as it arrives. I have used that brand several times, it's more expensive, but it only takes tiny dab on the tip of the brush to work up a thick, rich lather.I gave it very one star because I can't give it a zero rating.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Voodoo556",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHBX4JOZN7GMGQ5FDIT24C6YGQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BEE29EE2YQ3B?ASIN=B00563JQBU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 6, 2015",
                "reviewTitle": "4.0 out of 5 stars The Bay Rum Diaries",
                "reviewText": "I've been on the look for a new shave regiment, and this was part of the three-piece set I picked out (for the other two parts, see my reviews on the Clubman Pinaud Bay Rum Aftershave and Dreadnought Preshave Oil). I was very interested in the bay rum scent, as I've heard a lot of people give the scent such rave reviews.The scent for this shave cream is very subtle, but is a nice, sweet smell. It is not overpowering in the least, and depending on your aftershave, you probably won't even know it was there when you're done. I wouldn't describe it as a 'tropical' note, much more of a spiced scent. It makes me think of Christmas more than the Caribbean. That is not to say I couldn't see this as an all-year scent, but some people may find it to be a Fall-Winter scent, and trade off for something lighter in the rest of the year. Living in NY, I have a long rotation for Fall-Winter, anyway.I did pick up a bay rum-scented aftershave just for the purpose of reinforcing the scent when I was done.As for the cream itself, it's a nice, dense cream that lathers equally well in the hand as I'm sure it does with Taconic's recommended method of a shave brush. The number one question probably most people are going to have is 'how long does it last?' I ordered mine on January 10th of this year, I shave on average 3-5 times a week, and I'm not even halfway done with the jar. At the current rate I'm going, it would probably last easily 4 months. I also lather twice, in that I go with the grain the first time, re-lather, and go against for a cleaner shave, so if you're a brush user, you'd get even longer out of this product. Even just lathering by hand, I'm only using enough later to cover about a finger pad, add a little water, and rub in circular motions on the face.The cream is a coconut oil base, with natural ingredients and glycerin added for scent and foaming action. There is a bit of glycol in the list, but it's near the end, however it still can't be called 'alcohol free,' but most higher-end shave creams have some form of alcohol in them.The only issue I have with the cream is that it does dry out very quickly; usually after 2 days of non-use, there's a less-moist layer on top. It doesn't dry out completely, but if I use what's on top, I get decidedly less lather. It's an easy fix; I just dampen a finger and stir it up a bit. This is very common with creams that come in a tub like this, but it doesn't usually happen so fast.The Taconic cream is a great value, and beats out a lot of the competition that are selling their stuff for almost double what I paid here on Amazon (14$ at time of order). I think it's equal to, if not better than, Art of Shaving shave cream. I haven't tried Jack Black for comparison, and I doubt I will unless they stop making this cream, because I am absolutely hooked.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 14, 2024",
                "reviewTitle": "Taconic Shave Cream",
                "reviewText": "Very slick shaving cream love the scent of the lime very pleased how the shaving preformes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Domenic Lombardo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 22, 2023",
                "reviewTitle": "Ok",
                "reviewText": "Ok but not a thick lather",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steven",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 31, 2021",
                "reviewTitle": "Taconic Shave EUCALYPTUS & MINT Shaving Cream",
                "reviewText": "The Taconic Shave Cream is one of the best post-shaves I have ever had! The sent is weak-(almost none), The lather is okay -(Not super rich and luxurious), the shave is alright -(Some residual slickness), but the post shave is fantastic! -( I was still feeling my face several hours afterwards) It's certified Organic too! Great product! Will buy again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "asp",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 4, 2019",
                "reviewTitle": "Guter Rasierschaum, wenig Bay Rum",
                "reviewText": "Der Rasierschaum kommt in einer soliden Kunststoff-Schraubdose daher. Er ist von der Konsistenz her relativ fest und daher extrem ergiebig.Die Creme lässt sich gut aufschäumen und erzeugt einen angenehmen, dichten und für die Rasur sehr guten Rasierschaum mit guten Gleiteigenschaften - auch trocknet er nicht so schnell aus. Von den Rasiereigenschaften daher ausgezeichnet.Abzüge gibt es für den Duft, dieser ist bei meinem Exemplar eher medizinisch/neutral (dabei nicht unangenehm !), von Bay Rum aber weit und breit keine Spur - das ist schade, da ich diesen Duft liebe und gerade deswegen diese Creme bestellt habe.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "thibault de villé",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 8, 2022",
                "reviewTitle": "Savon pas une crème",
                "reviewText": "Ceci n'est pas une crème mais bien du savon de rasage et la quantité est très petite pour le prix",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}