{
    "remaining_requests": 33496,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Costa-Farms-Pachira-Premium-16-Inches/dp/B07G853D6N",
    "body": {
        "name": "Costa Farms Money Tree, Easy Care Indoor Plant, Live Houseplant in Ceramic Planter Pot, Bonsai Potted in Potting Soil, Home Décor, Birthday Gift, New Home Gift, Outdoor Garden Gift, 16-Inches Tall",
        "price": "$33.78",
        "originalPrice": "",
        "rawPrice": 33.78,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Costa-Farms-Pachira-Premium-16-Inches/dp/B07G853D6N",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0BX9332VY"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Indoor Garden Plant Pot",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41cFlU4KiHL._SS36_.jpg"
            },
            {
                "asin": "B07G853D6N",
                "variationName": "Color",
                "variationValue": "Indoor Plant Pot",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41bB+QagWBL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Nursery Grower Pot",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41+3IBa4n9L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Premium Décor Planter",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41nBp4FhNQL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bB QagWBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/416BFYcU33L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41lTzJtEGvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KN-uxi0lL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/61DcBBBrNAL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jZWSJUJdL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51FnaP7-ftL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/A1yYt2frOmL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/818mZtp50yL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Costa Farms Store",
            "link": "https://www.amazon.com/stores/CostaFarms/page/6C7EEB51-8F48-46C1-97FA-E8F5C570CC8C?ref_=ast_bln"
        },
        "brand": "CostaFarms",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 12813,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$11.99 delivery Friday, February 16. Order within 1 hr 9 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LIVE INDOOR PLANT: Bring home a beautiful Money Tree for a tropical feel. Pachira houseplants are lush and green, ready to liven up your room decor. Money Tree is gorgeous on any tabletop, shelf, plant stand, or in any living room, office, and bedroom",
            "GORGEOUS HOME DECOR: Money Tree is a decorative houseplant that has the ability to improve the look and feel of your home decor with a touch of green. Carefully potted in a modern decor planter and ready to be enjoyed and admired instantly after unboxing",
            "ELEVATE MOOD & WELLBEING: Plants make us happy. They give us life, fresh air and a sense of calm - all of which have the ability to lift your mood and improve your wellbeing. NASA studies show having plants improves mood, creativity and reduces stress",
            "READY TO GROW: Your new live indoor plant arrives well-packed with care instructions. Keep it happy, healthy, and growing by placing it in medium, indirect sunlight and giving it 2-3 cups of water about once a week. Adjust as needed for your environment",
            "PLANTS MAKE GREAT GIFTS: Plants can be delivered to your loved ones for any occasion, including birthdays, anniversary, and housewarming. Enjoy peace of mind that every plant is well packaged, farm fresh, and ready to impress with your gift message",
            "FRESH FROM FARM: Every plant is packed with care and arrives direct from our farm to your home. Money Tree height is approximately 16-inches tall, measured from the bottom of the pot to the top of the plant. Potted in a 5-inch diameter modern decor pot"
        ],
        "description": "Money Tree features clusters of large, bright green leaves that look great and adds life to a brightly lit room at home, a lightly shaded porch, or in the office. It grows best near a sunny window. Provide the plant with as much light as possible, without placing it directly in sunlight. Water when the top couple inches of the soil are dry (about once a week) and be sure all excess water drains away. If the container does not have holes, use approximately one cup of water, adjust as needed for your environment. The height at dispatch is approximately 16 inches tall, measured from the bottom of the pot to the top of the plant. Money Tree is potted in a 6-inch diameter planter pot. Money Tree is a moderate grower depending on its environment and is hardy in USDA Zone 10. Give it a boost during the warm months of Spring and Summer with a general-purpose fertilizer that is formulated for house plants. Follow the instructions on the fertilizer package for the best use. When the plant out grows the current container, it is time to repot. To repot Pachira, gently remove it from its current container and place it into a slightly larger container. Fill in any empty spaces with new and fresh soil and water thoroughly. Be aware of third-party sellers; other companies try to imitate our quality. There are no other authorized Costa Farms sellers. Plants are living things; each one is slightly different, so the plant you receive may vary from the photo. Our growers hand-pick the healthiest and highest-quality plants. We package our plants with great care so they'll arrive at your home ready to be displayed. Arrives fresh from our farm to you, Costa Farms plants are not intended for human or animal consumption. Keep out of reach of children and pets. We're unable to deliver this item to: AK, AZ, CA, GU, HI.",
        "breadCrumbs": [
            {
                "name": "Grocery & Gourmet Food",
                "link": "https://www.amazon.com/grocery-breakfast-foods-snacks-organic/b/ref=dp_bc_aui_C_1?ie=UTF8&node=16310101"
            },
            {
                "name": "Fresh Flowers & Live Indoor Plants",
                "link": "https://www.amazon.com/flowers-bouquets-indoor-plants/b/ref=dp_bc_aui_C_2?ie=UTF8&node=3745171"
            },
            {
                "name": "Live Indoor Plants",
                "link": "https://www.amazon.com/Indoor-Plants-Fresh-Flowers/b/ref=dp_bc_aui_C_3?ie=UTF8&node=3744981"
            },
            {
                "name": "Bonsai",
                "link": "https://www.amazon.com/Indoor-Bonsai/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10825941"
            }
        ],
        "productInformation": [
            {
                "name": "Plant or Animal Product Type",
                "value": "Pachira"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Brand",
                "value": "Costa Farms"
            },
            {
                "name": "Material Feature",
                "value": "Flower Pot"
            },
            {
                "name": "Color",
                "value": "Indoor Plant Pot"
            },
            {
                "name": "Expected Blooming Period",
                "value": "Spring, Summer"
            },
            {
                "name": "Item Weight",
                "value": "2.1 Pounds"
            },
            {
                "name": "Sunlight Exposure",
                "value": "Partial Sun"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Expected Planting Period",
                "value": "Spring"
            },
            {
                "name": "Product Care Instructions",
                "value": "Bright, Indirect Light, Water Weekly"
            },
            {
                "name": "USDA Hardiness Zone",
                "value": "10"
            },
            {
                "name": "Expected Plant Height",
                "value": "6 Feet"
            },
            {
                "name": "Soil Type",
                "value": "Peat Soil"
            },
            {
                "name": "Moisture Needs",
                "value": "Moderate Watering"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "11 x 11 x 16 inches"
            },
            {
                "name": "Manufacturer",
                "value": "Costa Farms"
            },
            {
                "name": "ASIN",
                "value": "B07G853D6N"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "CO.PAC5GEN.13.SCH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 12,813 ratings 4.3 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#74 in Patio, Lawn & Garden (See Top 100 in Patio, Lawn & Garden) #1 in Tree Plants & Seeds #1 in Indoor Bonsai"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Money tree’s leafy topknot of foliage makes this little tree a favorite Reputed to bring good luck, money tree is used in applications of Feng Shui Money tree (aka Pachira) is a popular indoor plant that features several trunks braided together; it looks very lush and tropical. The large compound, hand-shaped leaves offer a topknot of bright green color and a lovely lush appearance. This treelike plant looks beautiful as a floor plant for your home or office. Outdoors, money tree can grow more than 50 feet tall, but stays much smaller indoors. Money tree can grow more than 10 feet tall over time. Money tree is related to hibiscus and cocoa and comes from the swampy areas of Central and South America. It likes warm, humid conditions, and does well in average household conditions. Reputed to bring good luck, this little tree is a favorite plant for applications of Feng Shui. Money tree is frequently used as a specimen for bonsai, as well, and can develop a fat, dense trunk. Money Tree plants are: Great gifts Symbol of prosperity & good luck Pet friendly Live indoor houseplants Delivered fresh from farm",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2878f57d-5589-4c26-b4cf-ab2a306a8928.__CR0,0,300,300_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "From its braided trunk to big foliage, money tree is a gorgeous focal point Live decor -- small to tall Lush, live plants offer freshness in home decor. This multi-leafed mini tree is sold in various sizes, but won’t grow more than 10 feet tall. You can pinch off the tips of each stem as your money tree grows if you want to keep it full and from getting too tall. A lucky plant Reputed to bring good luck, money plant is beneficial in other ways. Many studies have shown that raising indoor plants is part of a healthy lifestyle, both physically and mentally. Sharing your living and working spaces with living houseplants have been proven to be part of a healthy lifestyle. Plants are nurturing, improve production, decrease anxiety, and help cleanse the air of toxins. Great for gifting Money plant is a popular housewarming gift because of its association with good luck. Houseplants in general are excellent gifts. If you're looking for the one-size-fits-all gift, think plants. Pet Friendly If your indoor pets have the tendency to nibble on houseplant leaves, money plant may offer a solution – leaves out of reach. The topknot of foliage on leafless stems keeps leaves up and away from pets. It’s also considered nontoxic by the ASPCA Animal Poison Control Center.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/600585e2-04e9-49a5-a3ab-a02bfa85ea46.__CR0,0,220,220_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d38fdcec-bf14-4701-9e1d-a6c8099de82c.__CR0,0,220,220_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/388acad2-edbf-4cfb-be92-2e25e50fc99a.__CR0,0,221,221_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5539eafb-6119-4c68-b622-862f0983778a.__CR0,0,220,220_PT0_SX220_V1___.png"
                ]
            },
            {
                "media_text": "Money Tree, 10-Inches Tall Money Tree, 16-Inches Tall Money Tree, 3-4 Feet Tall Tabletop size? ✓ ✓ Floor size? ✓ Great gift idea? ✓ ✓ ✓ Air purifying? ✓ ✓ ✓ Fresh from farm? ✓ ✓ ✓ Decor pot size 4-inch diameter 5-inch diameter 10-inch diameter",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/39c5a17f-63f4-448e-87c6-78f0e0c9052c.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2878f57d-5589-4c26-b4cf-ab2a306a8928.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/600585e2-04e9-49a5-a3ab-a02bfa85ea46.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d38fdcec-bf14-4701-9e1d-a6c8099de82c.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/388acad2-edbf-4cfb-be92-2e25e50fc99a.__CR0,0,221,221_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5539eafb-6119-4c68-b622-862f0983778a.__CR0,0,220,220_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f68a6df2-15be-4967-947a-793a7c684ec5.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac2a6fd7-0166-4068-b604-be40ed3c466a.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6ffd0ff0-301a-4879-a63b-5454edb5fd70.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MichaelMichael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQZFVDEPM3ARDOOWVM6AMJ5UMAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16K9GNQ5HAM4N?ASIN=B07G853D6N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 25, 2019",
                "reviewTitle": "5.0 out of 5 stars Extremely happy and surprised by this experience.",
                "reviewText": "I tried canceling the order when I realized it would not be coming on the expected date since I would be working all day and didn't want it sitting on the front porch in a box for 8 hours. I wasn't able to cancel, it did sit on the front porch for 8 hours, and when I opened it, it was so nicely packaged and looked absolutely amazing coming out of the box.There were some bugs on it but I'm assuming it's from sitting outside all day. There were two large handle holes, also used for air, on the sides, which had me relieved. I've never ordered a plant online until recently and wasn't sure what to expect. I did do my due diligence on researching what plant to order from Amazon from all the reviews and found this one to be the best and I wasn't disappointed.There are some brown spots and white spots on the tree but I'm hoping they'll go away over time. As long as it doesn't die. It's my first plant in many, many years for a reason. I simply couldn't make them last. I'm hoping to turn that around with this one as I'm a strong advocate for the environment and want to do my part in helping it. I'm also hoping this is a start to large garden one day.Regardless, point being, it's an incredible plant as you can tell from the pictures. The packaging was extremely well done and the plant arrived in great condition. The only complaint I have is the pot that it came in. Sure it's nice looking but it has no drainage holes. The pot itself also is much smaller than what I feel is described. I bought another pot online, an 8\" self-watering pot for $14, and it looks great in it. I wanted to buy a slightly larger pot anyway to put the plant in to give it more room to grow. From what I've read these plants can grow pretty large, given the space to, and the time, many years for sure.Also, while I was repotting the plant, first time doing that also, they were all connected at the bottoms by a rubberband that I decided to cut off to better get the old soil off to replace with the new one and also I just feel like that would potentially hold it's growth back.It definitely looks healthier than it's first few days. Now that it's been out of its box a bit longer and given fresh air and sunlight. However, today's the first day that I repotted it and I'm hoping I didn't mess anything up. I have a small room, with some roommates, and I'm going to make sure my room has enough air circulation by keeping a window fan in the windowsill blowing all throughout the day with my door open. Room can get a bit stuffy at times. When winter hits I may need to get a humidifier for my room also.For $32, I can't say that it's not worth it, especially for someone who doesn't own a car (all about that environment-friendly life, to the best that I can). The packaging is surprisingly exceptional, the plant itself is beautiful, it arrived a day or two later but that's not a big deal for a really nice plant. I would just like to see them ship plants in a pot with drainage holes, especially self-watering ones. It may cost a bit more, or a bit less, who knows, it would just be really nice, or at least being given the option to.5/5. Great plant, great company, and again, I really cannot say enough how great the packaging and delivery were, along with how beautiful the plant is. If it dies, it'll definitely be from my end but I'm definitely going to do everything that I can to make sure that doesn't happen. It's also actually five of them intertwined, which seems pretty obvious when you think about it but I didn't, and didn't notice it until I was repotting it. Love this plant. Buy it. Just buy it now and support this company.",
                "reviewVotes": "166 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/6119XPwBGXL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/61PTGJUyPGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "AidenAiden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGC2QAVYZGT4HMW5UETR5KXONCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HMZ6PQGURCUJ?ASIN=B07G853D6N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Packaged perfectly.",
                "reviewText": "Have nothing negative to say. The plant was very healthy. Tall exactly like the description said. I purchased the one that had only the Growing pot and transferred into a store-bought 12 inch pot. The roots are very healthy. Looks beautiful. And only had one underdeveloped dropped leave. Everything else was perfectly intact. Very easy to open the box also.As a matter of fact, I like that so much I ended up following the vendor and purchasing a separate fig tree.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71vrTVb+D7L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sycope",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZG7RIOMEWG7JOGUKLIHYQ7TJTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24BZSJ6VK0PQL?ASIN=B07G853D6N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Healthy and beautiful",
                "reviewText": "Ordered two of these as gifts. They arrived packaged very carefully. They lost some leaves that were damaged when they were shipped across the country but they quickly began showing new growth and looked very healthy within a few weeks",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brandon LBrandon L",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBHATGN7KLHTML2XSN3DNNAC6KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB2SQOXO0SL6F?ASIN=B07G853D6N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars The Must have indoor plant!",
                "reviewText": "My husband ordered this money tree for my birthday. And I got to say I love it! The money tree was well packaged and delivered earlier than expected. Unfortunately we had inclement weather, and the tree leaves had frost bite. I called Costa Farms customer service and they were able to answer and assist me with all my questions and concerns.I love how healthy and beautiful this money tree is compared to the ones at the grocery store. Worth every penny.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71n8asukswL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "ladyofrohanladyofrohan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEV2F4I25ZGM56IYSWONS5LOB2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3P7CQFLAQYGK8?ASIN=B07G853D6N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Planter is pretty, tree was very beat up",
                "reviewText": "While the base of the tree was well packaged, I was disappointed to see most of the top leaves either crushed, withered, or broken. It looked like it had had a rough journey. Not sure if it's going to recover its beauty or not. Trunk seems stable so I've taken off all that pieces that snapped and hopefully it will make it.Two months later tree seems to have totally recovered so I'm bumping my review from 3 to 4 stars.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71PQoC5fBZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71eBgOoPOlL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71jsowlr7wL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81lIFBu+9rL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dot Moore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPACJLWFMGCDL2TSP7D45SV23RQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CX6T7A01A1NO?ASIN=B07G853D6N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Lovely and Healthy Plant",
                "reviewText": "This is such a lovely plant. It arrived in perfect condition. The plant pot is really nice.Love Costa Farms. Have shopped with them before and hope to continue to do so.It was packaged great, healthy plant, instructions, and even had a warmer, fast shipping.So pleased. I love it and hope I can keep it going to many years to come.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beth",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AED6LO6SENX4TQDQVTQYYLATYGSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KP5I3YBPHWP8?ASIN=B07G853D6N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible Product",
                "reviewText": "I would give this more stars if I could. I ordered several varieties of plants from Costa. They all arrived in perfect condition. Very healthy looking as well. The packaging was incredible. Will use them again in the future.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJTJJR3ZYZK2MHTIDYEMELPEG3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RB12MEP6T71B?ASIN=B07G853D6N",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "3.0 out of 5 stars Pot is beautiful, Plant is very beat up",
                "reviewText": "I was really looking forward to my money tree. Sadly, the plant received is in very poor condition. There were many wilted leaves and most of the other leaves are browned and frail. The box also came very beat up. Unless some sort of resolution can be reached this is probably the first and last time I will be purchasing plants online.I will give them some stars for the beautiful pot, I just wish the plant had been handled with more care or at least that a quality product was sent.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HannaH",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 17, 2023",
                "reviewTitle": "Much smaller than the photo",
                "reviewText": "The are very few leaves on the plant, and smaller than the picture , not worth it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ms. Buyer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 22, 2022",
                "reviewTitle": "Nice plant but",
                "reviewText": "Certainly not worth $80. It is not anywhere near 16\" tall. I feel totall ripped off. It is a healthy looking plant though. I've had this plant for 1 wk and it is dying!!!!! $80 for a plant that lasts 1 wk. DO NOT WASTE YOUR MONEY",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RoyaRoya",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 7, 2022",
                "reviewTitle": "Defective plants with lots of dried leaves",
                "reviewText": "I recieved the plant. The packaging was nice and secure, however, the plant looks like it has some kind of disease already. There are spots on the leaves, and many leaves are dried with yellow tips. Some branches were broken (maybe during the delivery). I was so disappointed as the plant does not worth the money I spent ($106)!! I contacted the seller and he simply said this is what it is and just cut off the damaged/dried leaves. I saw many good reviews about this order thats why I trusted it but when I saw my plant, I was very unhappy and regretful. I'm not even sure if the plan can make it with this condition and I have to throw it out after some time... unpleasant experience.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ojcJpFuCL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51otRr+tesL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61a6YT84s2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61ebXFgiBYL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61UCkSQArpL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}