{
    "remaining_requests": 33353,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Costa-Farms-Sansevieria-Growers-12-Inches/dp/B07TVK6DC2",
    "body": {
        "name": "Costa Farms Live Snake Plant, Easy Care Houseplant in Indoor Garden Plant Pot, Grower's Choice House Plant in Potting Soil Mix, Succulent Plant Gift for Housewarming, Office, Home Decor, 1-2 Feet Tall",
        "price": "$24.20",
        "originalPrice": "$27.99",
        "rawPrice": 24.2,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Costa-Farms-Sansevieria-Growers-12-Inches/dp/B07TVK6DC2",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C47LBSYW"
        ],
        "asinVariationValues": [
            {
                "asin": "B07G7X7394",
                "variationName": "Color",
                "variationValue": "Décor Plant Pot w/ Plant Stand",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31xDL6Qvy-L._SS36_.jpg"
            },
            {
                "asin": "B07TVK6DC2",
                "variationName": "Color",
                "variationValue": "Indoor Garden Plant Pot",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/415VmOkCy8L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Indoor Plant Pot",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41SeEMWscyL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Modern Décor Planter",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/412FQJC-UPL._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Modern Décor Pot",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41NWdsAv9eL._SS36_.jpg"
            },
            {
                "asin": "B07TXR46S5",
                "variationName": "Color",
                "variationValue": "Nursery Pot",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/31ybsHSxT+L._SS36_.jpg"
            },
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Nursery Pot (4-Pack)",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/51Ok2CpilkL._SS36_.jpg"
            },
            {
                "asin": "B07G7HH9Z6",
                "variationName": "Color",
                "variationValue": "Premium Décor Planter",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41JQ3abKDJL._SS36_.jpg"
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/415VmOkCy8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41oy2ysxLKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51POTsVdvLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/4151v3xBLXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/5106wx1AM4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51cYlwNDbKL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B1v7vH3lVRL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Costa Farms Store",
            "link": "https://www.amazon.com/stores/CostaFarms/page/6C7EEB51-8F48-46C1-97FA-E8F5C570CC8C?ref_=ast_bln"
        },
        "brand": "CostaFarms",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 13708,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "$9.99 delivery Wednesday, February 21. Order within 7 hrs 33 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "LIVE INDOOR PLANT: Bring home a beautiful Snake Plant for a tropical feel. Minimal care Sansevieria houseplants are ready to liven up any space with their sword-like leaves. Snake Plant brings a focal point to any living room, office, and bedroom decor",
            "GORGEOUS HOME DECOR: Snake Plant is a striking way to decorate your home. This plant comes potted in a modern decor planter, ready to be enjoyed and admired instantly after unboxing. The air purifying Snake Plant looks good in any space",
            "ELEVATE MOOD & WELLBEING: Plants make us happy. They give us life, fresh air and a sense of calm - all of which have the ability to lift your mood and improve your wellbeing. NASA studies show having plants improves mood, creativity and reduces stress",
            "HAPPY & HEALTHY PLANT: Your new live indoor plant arrives well-packed with care instructions. Keep Snake Plant happy, healthy, and growing by placing it in bright, indirect sunlight. Water with 1 cup of water about once a week. Adjust as needed",
            "PLANTS MAKE GREAT GIFTS: Plants can be delivered to your loved ones for any occasion, including birthdays, anniversary, and housewarming. Enjoy peace of mind that every plant is well packaged, farm fresh, and ready to impress with your gift message"
        ],
        "description": "Snake Plant features variegated, green foliage. The Snake Plant is great for tabletops. It does well in spaces that have bright, indirect sunlight. Place Snake Plant in a spot that receives bright light (5 or more hours of sunlight). Water your plant about once a week with approximately 1 cup and be sure all excess water drains away. Adjust as needed for your environment. Do not let the Snake Plant sit in water or overly soggy soil. The height at dispatch is approximately 14-inches tall, measured from the bottom of the pot to the top of the plant. The Snake Plant arrives in a 6-inch décor pot. To avoid water spillage, this container does not have holes. The Snake Plant is a moderate grower. Exact growth rate depends on the care provided and its environment. Give it a boost during the warm months of Spring and Summer with a general-purpose fertilizer that is formulated for potted plants. Follow the instructions on the fertilizer package for the best use. When the plant out grows the current container, it is time to repot. To repot the Snake Plant, gently remove it from its current container and place it into a slightly larger container. Fill in any empty spaces with new and fresh soil and water thoroughly. This plant is considered hardy in USDA Zone 9-11. Be aware of third-party sellers; other companies try to imitate our quality. There are no other authorized Costa Farms sellers. Plants are living things; each one is slightly different, so the plant you receive may vary from the photo. Our growers hand-pick the healthiest and highest-quality plants. We package our plants for delivery with great care so they'll arrive at your home ready to be displayed. Delivered fresh from our farm to you, Costa Farms is passionate about delivering happy, healthy, beautiful plants. Costa Farms plants are not intended for human or animal consumption. Keep out of reach of children and pets.",
        "breadCrumbs": [
            {
                "name": "Patio, Lawn & Garden",
                "link": "https://www.amazon.com/Patio-Lawn-Garden/b?ie=UTF8&node=2972638011"
            },
            {
                "name": "Gardening & Lawn Care",
                "link": "https://www.amazon.com/Plants-Seeds-Flowers-Outdoor-Living/b?ie=UTF8&node=3610851"
            },
            {
                "name": "Plants, Seeds & Bulbs",
                "link": "https://www.amazon.com/plant-seeds-bulbs/b?ie=UTF8&node=3480662011"
            },
            {
                "name": "Cacti & Succulents",
                "link": "https://www.amazon.com/b?ie=UTF8&node=3745941"
            }
        ],
        "productInformation": [
            {
                "name": "Plant or Animal Product Type",
                "value": "Sansevieria"
            },
            {
                "name": "Indoor/Outdoor Usage",
                "value": "Indoor"
            },
            {
                "name": "Brand",
                "value": "Costa Farms"
            },
            {
                "name": "Material Feature",
                "value": "Natural"
            },
            {
                "name": "Color",
                "value": "Indoor Garden Plant Pot"
            },
            {
                "name": "Special Feature",
                "value": "Air Purification"
            },
            {
                "name": "Expected Blooming Period",
                "value": "summer, fall"
            },
            {
                "name": "Item Weight",
                "value": "3 Pounds"
            },
            {
                "name": "Sunlight Exposure",
                "value": "Partial Shade"
            },
            {
                "name": "Unit Count",
                "value": "1.0 Count"
            },
            {
                "name": "Expected Planting Period",
                "value": "Year-Round"
            },
            {
                "name": "Product Care Instructions",
                "value": "Bright, Indirect Sunlight; Water 1 cup once a week"
            },
            {
                "name": "USDA Hardiness Zone",
                "value": "9-11"
            },
            {
                "name": "Soil Type",
                "value": "pot soil"
            },
            {
                "name": "Moisture Needs",
                "value": "Regular Watering"
            },
            {
                "name": "Number of Pieces",
                "value": "1"
            },
            {
                "name": "Product Dimensions",
                "value": "6 x 7 x 14 inches"
            },
            {
                "name": "Manufacturer",
                "value": "Costa Farms"
            },
            {
                "name": "ASIN",
                "value": "B07TVK6DC2"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "CO.SZ07.13.BMOD"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 13,708 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#128 in Patio, Lawn & Garden (See Top 100 in Patio, Lawn & Garden) #2 in Tree Plants & Seeds #2 in Cacti & Succulent Plants #2 in Live Indoor House Plants"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Snake Plant's vertical foliage easily adds beauty to home decor Gorgeous Snake Plant (also called Sansevieria) adds instant fresh decor to any room. Prized for its striking vertical foliage, this live indoor houseplant adds beauty and architectural interest to any home. Because of their tall form, they seem like big plants, yet they can fit into a small spot. Even if you’ve never raised a live plant before, you’ll find this plant to be so easy to care for – and so easy to be successful with. Snake Plant tolerates a wide range of light conditions, so it will thrive almost anywhere you place it. It requires an occasional drink to keep it in top form. Snake Plants are grown at our farm and securely packaged and shipped directly to your door. Just take them out of their box and set them anywhere. Because they come in their own decorator pot, they add instant decor to any room. Snake Plants also add a healthy, fresh vibe to any space. These houseplants are an amazing value because they last for years. Key Points: Super easy care houseplants Ideal for small places Thrives in a variety of light types Snake Plants last for decades Expertly packaged and safely shipped",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72d62461-29f2-42c0-badb-893443f81b79.__CR0,0,301,301_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "Snake Plant is a beautiful live indoor plant ready to add life to any space So Easy Care An easy plant for a beginner, Snake Plant is among the most forgiving houseplants. It doesn’t require much water and it tolerates a wide range of light conditions. This plants needs no pruning. With proper care, it lasts for decades. Securely packaged and shipped to your home Tall and lovely Snake Plant adds instant life to any room. Ready to impress out of the box, room decorators love it for its striking vertical foliage that fits into a small narrow spots. Grown by Experts Snake Plants are grown at our family-run farm, safely packed and shipped directly to your home. Just take this plant/pot combination out of the box and enjoy it in any room. Decorate with Flair Snake Plants are an ideal accent for any decor style – from farmhouse to traditional to modern. The textural, narrow leaves have a sculptural feel.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dd45cc9f-1696-4653-8d9f-5466e3af9e6e.__CR0,0,221,221_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/364c9f75-9c18-4458-9034-578f1c7af5fc.__CR0,0,221,221_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1947de8d-a832-4cc6-b7ec-31db054170ab.__CR0,0,221,221_PT0_SX220_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/beb90c24-7acb-4978-a8a1-0a697bcd3f8e.__CR0,0,221,221_PT0_SX220_V1___.png"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2a3d6079-b23c-47e8-b5c6-44696dbb1f99.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/72d62461-29f2-42c0-badb-893443f81b79.__CR0,0,301,301_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dd45cc9f-1696-4653-8d9f-5466e3af9e6e.__CR0,0,221,221_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/364c9f75-9c18-4458-9034-578f1c7af5fc.__CR0,0,221,221_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1947de8d-a832-4cc6-b7ec-31db054170ab.__CR0,0,221,221_PT0_SX220_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/beb90c24-7acb-4978-a8a1-0a697bcd3f8e.__CR0,0,221,221_PT0_SX220_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ella Belle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQLMIHUAWAC5TQGPJR2P7XDNIYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CNJXMJ255QWA?ASIN=B07TVK6DC2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2021",
                "reviewTitle": "5.0 out of 5 stars Totally Lovin' My New, Very Large, Attractive, Snake Plant!",
                "reviewText": "I just bought the Costa Farms Premium Sansevieria, Live Indoor Snake Plant, Ships in Decor Planter, 2-Feet Tall.I am so totally happy with my attractive new Snake Plant! I received one of the ones that has the variegated, gold edged leaves.My plant is tall! It actually measures 33 inches tall from the bottom of it's décor pot to the tip of the tallest leaf.The Plant arrived quicker than I had expected, and it was packaged quite well.The shipping box did sustain a bit of damage by UPS, but the Plant, and it's nice looking container inside, arrived with just a few tips bent on the Plant. The décor container did get a bit misshaped, but it went back into shape after a few hours out of that box in a warmer room.The Snake Plant was packaged very well, with plastic wrap pulled snug around the base of the Plant to about half way down the inner black pot, to keep most of the soil from spilling out. Then, the Plant and the black pot it is growing in, were put into a big, thick paper cone, which was then put into the décor pot.There was a long, sturdy bamboo stake in the black growing pot, right beside the Plant, to help keep the top of the box from being crushed into the Plant. That stake did appear to work very well because the box was damaged at the top and the stake was cracked, but the Plant did not get crushed and was pretty much fine except for a few bent tips.This Plant was also shipped with a decent sized disposable warmer, somewhat like one of those disposable pocket hand warmers.I live at the far north end of the Idaho Panhandle. Yesterday, when my Snake Plant arrived, it was snowing and around 31 degrees outside. I met the UPS guy at my door, so the Plant did not sit out on my porch at all. The box did feel quite cold, as the UPS trucks up here are not heated. But I believe that the heating pack that was shipped in with the Plant was warm enough, and lasted long enough, for the Plant to not be injured by the cold. The pack was still warm when I unboxed the Plant. The thick paper cone also helped to insulate the Plant too.So far my attractive new Snake plant looks to be in great condition! The soil was still fairly damp when I received it, so I did not water it yet.After letting this Plant sit in my kitchen sink for about 8 hours to slowly get back up to a decent temp, and for me to check for any hitch-hiking spiders, frogs or mice, the Snake Plant is now residing in my 64 degree bedroom, hopefully giving off some wonderful oxygen in there, which is why I bought the Snake Plant in the 1st place.Time will tell, but so far I am extremely happy with this Snake Plant and it appears that it was not damaged by it's cold winter ride to my home!I will certainly be buying more Plants from this Costa Farms!UPDATE 12/11/2021:After getting this 1st 2 Ft. Snake plant, I decided to order a 2nd one for my bedroom for extra oxygen. It also arrived safety last week, in the middle of a light snow storm here in North Idaho. It also had the heat packs and arrived undamaged and healthy. It's about as tall as the 1st one and it is just as beautiful. I am so happy with these pretty Snake Plants. These Plants sure do not remind me of Snakes. They actually remind me of underwater Kelp.UPDATE 03/15/2022:Both of my 2 foot tall Snake Plants in their décor pots are doing very well. One is in my bedroom, giving me oxygen at night and beauty during the day. The other one was supposed to also go in my bedroom, but it looks so nice in the living-room that I have just kept it there. So, now I am back to buy a 3'd large Snake Plant. I am super happy with these plants.UPDATE 08/10/2023:Both of my 2 foot tall Snake Plants are still doing fantastic! They have even grown another 1.5 inches tall and have had young shoots pop up to fill the pots more.I did buy another of these 2 foot tall snake plants, but it got quite abused during transit with UPS and arrived in less that desirable condition with half the plant missing and loose soil all in the box! It looks like the plant had come out of it's box, and was yanked out of it's pot! Someone roughly stuffed it back in its pot and lost a large portion of it. And then they repackaged the plant upside down in it's box, so it traveled upside down the rest of the way to my home.I contacted Costa farms and they sent out a replacement, but that one also got abused. I think UPS delivery persons may dislike delivering plants in winter. Anyway, it and the one it replaced are still alive, but they had a lot of damage and are not near as nice looking as my 1st 2 Snake plants.I think from now on I will buy smaller Snake Plants as those seem to survive shipping better that these tall ones. Anyway, I am still extremely happy with ALL may Snake Plants and I have been enjoying the wonderful oxygen they produce for me in my bedroom. And yes, I do have a decent LED Grow light in there for them and it all works very well for me.",
                "reviewVotes": "139 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEI3MIAAIFDU2PSYGNUAG6OFGSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33S75S8GVEMLL?ASIN=B07TVK6DC2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautifully Packaged and Healthy Arrival",
                "reviewText": "I just wanted to share that it's been really cold and these plants were delivered to our stoop and sat outside for a bit. They were absolutely fine, well packaged with warmers at the base and no cracks or issues with the pots. The plants are healthy and vibrant - we can't wait to see how big they grow!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KyMom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELGFPLLW52FOXS5LIORAFB5I5MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZCF2A3OSOALG?ASIN=B07TVK6DC2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Beautiful and Healthy",
                "reviewText": "I’ve bought 2 plants from this company and I’m very pleased with the purchases. Plants are healthy. Great packaging. Love they come with the soil, stylish pot, and an info card on each variety of plant. Price is great, too.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabe VillamizarGabe Villamizar",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFF2JZKUMYQ2A5JNVMWXTAAUGJGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UYF0MZJK6YRA?ASIN=B07TVK6DC2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Great snake plants!",
                "reviewText": "I’m updating my bad review! I have now received 4 snake plants from this company. Three of these look really good and are flourishing. It was a great deal and came with a decorative plastic pot. Snake plants are so low maintenance and great at purifying the air! There was one plant that did not look good (it was ripped and some of the leaves were cut in half). I contacted customer service and at first heard no response, which is why I gave them a poor review. It took a few weeks, but I eventually did get a replacement plant that was in great shape. So 3 out of 4 great plants were great! And they fixed the problem and sent a replacement for the one that looked bad. Highly recommend!",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71s63AUb8bL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "RyanRyan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMEYFWU6CTSQAI3PKSUIJO7KLQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QZI928QSMYSU?ASIN=B07TVK6DC2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Amazing plant! But it's crushed",
                "reviewText": "This is a one week review. The plant is absolutely amazing. I ordered 2 and one of them is amazing. The other one is quite smashed up and I'm actually afraid it won't recover. The plants came frozen the weather was cold when delivered. Once opened and thawed the first plant is doing great. The second plant in the pictures is smashed up, soft, bent and I'm thinking it eill not recover and firm up.The leaves are completely bent and soft, not rigid like the first plant. I just hope it recovers and will thrive.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Jbdy4WFJL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71XDp6vpOgL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "P. Mac",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAWEBWTHGTLGL7K7DAEGQGEB3QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYILXPJMTBM2J?ASIN=B07TVK6DC2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Arrived in perfect condition",
                "reviewText": "These plants are even nicer than the picture. Very healthy and shipped with care. They are a very attractive addition to my plant stand. Love the easy care of these plants.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RileyCS",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIF3ERVULUSBUK53DUWTNJQE6EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J0JNFXHBJH8G?ASIN=B07TVK6DC2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Well packaged, beautiful!",
                "reviewText": "This is the first plant I’ve ordered online but it definitely will not be my last. Plant arrived well packaged, fresh/healthy, in tact. It was already watered and still moist. Purchases for our kitchen. Perfect! I will order more plants for our home and as gifts for sure!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Morris Bitzer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESAASPPBCSE6ARVBAA2D4I6M2EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGIZS7US6WEJS?ASIN=B07TVK6DC2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars Pretty Plant",
                "reviewText": "Arrived in very sturdy package and well protected from weather. Plant is beautiful in color and appears very healthy. Arrived in pretty pot. Costa Farms has quality plants and reasonable price. Highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}