{
    "remaining_requests": 38433,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dopamine-Decor-Decoration-Serotonin-Agonist/dp/B0CFZN46XB",
    "body": {
        "name": "Dopamine Decor: How To Make Your Home Decoration a Serotonin And Dopamine Agonist and Detox Your Body And Mind: - The Happy Home Decoration Book -",
        "price": "$19.99$19.99",
        "originalPrice": "",
        "rawPrice": 19.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dopamine-Decor-Decoration-Serotonin-Agonist/dp/B0CFZN46XB",
        "soldBy": {
            "sellerID": "A2RPH4W6DZLZG6",
            "name": "JavaHouseBooks LLC",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2RPH4W6DZLZG6&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41P6 W9gB L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/61JCKjG9jgL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sofia Meri",
            "link": "https://www.amazon.com/Sofia-Meri/e/B0CGSR7S2J/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "JavaHouseBooks LLC",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 59,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review ⭐⭐⭐⭐⭐ - Awesome book to uplift the mindI very much enjoyed this book because it's an easy read and also very informative. Highly recommendedBiaou Samon - Author of Firedome ⭐⭐⭐⭐⭐ - Fascinating Read This book explains how intentional design boosts happiness. The science behind feeling joyful in certain spaces is truly fascinating!Anyone who wants a home promoting happiness should read this book, highly recommend!Danielle ⭐⭐⭐⭐⭐ - Must-read for anyone looking to create a home environment that looks good and also feels good.\"Dopamine Decor\" is not just a book; it's a journey into transforming your living space into a sanctuary of joy and well-being. Ruskin Bond ⭐⭐⭐⭐⭐ - Good intro to this topic, lots of great ideas throughoutThis book gave me a good framework or lens to work from - I especially liked the color psychology section, ideas to add texture to spaces E. Sander From the Author Following a profound bout of depression, I, as a renowned interior designer, underwent a transformative healing experience, a significant part of which I attribute to the meticulous and intentional redesign of my own bedroom. The walls, now bathed in the optimistic hue of sunshine yellow, became more than just a backdrop; they became a canvas of hope and renewal. Interspersed with cherished family photos, memories of happier times came alive. The room was also adorned with luxuriously cozy textiles, offering tactile solace, and treasured keepsakes that narrated tales of my past. This wasn't just about aesthetic appeal; it was a therapeutic cocoon of warmth, comfort, and inspiration built from the knowledge of my profession. Each morning, the space I had thoughtfully curated reflected back my resilience, identity, and the enduring beauty of life. The positive symbiosis between my psyche and my surroundings became undeniably palpable. Each corner of my room seemed to emanate a vibrant energy, uplifting my spirits and reinforcing a brighter outlook on life. With a heart brimming with gratitude and recognizing the power of intentionally designed spaces, I channeled my professional expertise and personal revelations into 'Dopamine Decor.' This book is not just a testament to my journey but an invitation to others to explore the therapeutic potential of their environments. My aspiration is for it to guide others in crafting sanctuaries of joy and solace, showcasing that, even amidst life's tumults, our surroundings can be a balm to our souls. As an acclaimed figure in the world of interior design, my goal is to now fuse emotional well-being with design, sharing this unique blend of joy with the world."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 5 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Do you want to surround yourself with uplifting décor that sparks inspiration, nostalgia, and joy? click Buy NowYou will get 🎁 complimentaryaccess to my online visuals guide with amazing design Moodboards and Interior design examples for each room of your houseIn Dopamine Decor, you'll discover:✨ The science behind dopamine decorating✨ Choosing mood-boosting color palettes✨ Displaying nostalgic photos and keepsakes✨ Incorporating natural textures that delight✨ Curating cohesive rooms full of cherished items✨ Crafting joyful sanctuaries reflecting your unique essenceBonuses included:Bonus 1 - Dopamine Nation: Analysis and Key Learning for everyday.Bonus 2 - Dopamine Detox: Everything you need to know about taking a break from overstimulation.Bonus 3 - Dopamine Agonists: An illustrated guide to the elements that mimic and boost dopamine.Have you been yearning to craft a personalized home that lifts your spirit? This is the perfect place to start!Join interior design expert Sofia Meri on a journey to creating cheerful spaces using purposeful color, meaningful memorabilia, and cozy textures.This book provides encouragement and tips for decorating your home distinctly and unapologetically according to what makes your soul sing.Turn your dwelling into an uplifting oasis radiating with your one-of-a-kind light. This Interior Design Book makes it possibleClick “Buy Now” to start surrounding yourself with feel-good décor and inspiration!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Crafts, Hobbies & Home",
                "link": "https://www.amazon.com/Home-Garden-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=48"
            },
            {
                "name": "Home Improvement & Design",
                "link": "https://www.amazon.com/Home-Improvement-Design-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=6158312011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CFZN46XB"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Independently published (August 20, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 116 pages"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 979-8858211228"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.27 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,007,306 in Books (See Top 100 in Books) #271 in Interior Decorating #1,096 in Decorative Arts #2,094 in Home Decorating (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 59 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Access to Sofia Meri Interior Design Visual Guid You will get access to my online visuals guide with amazing design Moodboards and Interior design examples for each room of your house",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/dde798d1-cd87-4b16-afa1-97055fc0d9d1.__CR10,0,1940,1200_PT0_SX970_V1___.png"
                ]
            },
            {
                "media_text": "My Story As an Interior Designer recovering from deep depression, I found myself uplifted by my thoughtful interior decor - sunshine walls, family photos, cozy textiles, and beloved keepsakes.I realized the deliberate curation of my home brought my spirit back while lifting my mood.Fueled by gratitude, I poured years of my life into the Dopamine Decor book, hoping to inspire others to create joyful sanctuaries.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/b7259afa-a311-42be-9dd7-8ec3075c2d3d.__CR0,0,2362,2362_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/7191263c-64f0-4191-8bee-04372f655826.__CR0,0,4850,1500_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/dde798d1-cd87-4b16-afa1-97055fc0d9d1.__CR10,0,1940,1200_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/b7259afa-a311-42be-9dd7-8ec3075c2d3d.__CR0,0,2362,2362_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/ce0571bb-fd10-438f-81ca-81ec38427dde.__CR1,0,3030,937_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/eb637b31-1081-4c9f-a57b-4da1bf6dab2c.__CR0,596,1500,464_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Carol",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECF2HTJRUQARXPZJZFGWTCWQCPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVZ6J1PT6KBEY?ASIN=B0CFZN46XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Delightful Dopamine",
                "reviewText": "Great wealth of knowledge in this book. Helped me organize my rabbit mind better and provides guidelines for making your home and surroundings happier places.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eric P",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENGLGBBTQL42LEMF2XLGK6RCROA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BHCRZD0C55EG?ASIN=B0CFZN46XB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars creating cheerful spaces",
                "reviewText": "In addition to its captivating images and interior designs, the book goes beyond expectations by incorporating scientific insights. These insights explore the significant influence that intentional décor choices can have on our well-being and happiness. By helping readers define their personal style, the book empowers them to make informed decisions about color schemes, textures, and meaningful objects in their home decoration.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joshua D White",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCAPVTSW6GA6QHLRNS7FH6FDK5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RD6RMMOGCKUUE?ASIN=B0CFZN46XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars I appreciate the philosophy this teaches",
                "reviewText": "While the writing style itself did not resonate with me, I found the home décor philosophy this teaches refreshing and helpful. Breaking free from convention, trends, and styles that *other* people like — in order to do what is authentic and truly delightful to *you* — is a much needed antidote to the “peer pressure” of tv show-driven home trends these days.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cascade",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFFQXUOJ6B7S5EN75VIQOTCVEMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A7461AD5YDTL?ASIN=B0CFZN46XB",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "3.0 out of 5 stars No pictures",
                "reviewText": "There are no pictures in this book. If I knew that I wouldn’t have bought it, would have just read the e-book.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ruskin Bond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFQ2EBLS2JNPE3MEKMCD4MRNECA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AKXJA8LGTRL?ASIN=B0CFZN46XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "5.0 out of 5 stars Must-read for anyone looking to create a home environment that looks good and also feels good.",
                "reviewText": "\"Dopamine Decor\" is not just a book; it's a journey into transforming your living space into a sanctuary of joy and well-being. As a reader who's always been fascinated by the impact of our surroundings on our mood, I found this book to be both enlightening and immensely practical.The unique aspect of this book is its combination of visually appealing interior designs with science-based explanations of how these designs can boost happiness and mental health. The visual guide is not only pleasing to the eye but also incredibly informative, making the concept of dopamine decor easily understandable and relatable.One of the most memorable parts of the book for me was the author's excerpt about choosing colors. The emphasis on personal significance and mood enhancement in color selection resonated with me. It encouraged me to think more deeply about the colors in my own home and how they affect my mood and well-being.This book is a delightful blend of science, art, and practicality, offering readers the tools to transform their homes into spaces of joy and tranquility.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andy White",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZEYLDDT7MRLM354MZEGWK3ZMHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3M3ELWIMPNEPG?ASIN=B0CFZN46XB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 7, 2023",
                "reviewTitle": "4.0 out of 5 stars A Delightful Guide to Creating a Happy Home",
                "reviewText": "The best part about this book is that it goes beyond just aesthetics. It delves into the science behind dopamine decorating, showing how certain colors, textures, and even nostalgic photos can boost our mood and bring us joy. I never realized the impact that simple design choices could have on my overall well-being until I read this book.One aspect I particularly enjoyed was the author's emphasis on curating rooms full of cherished items. It reminded me to surround myself with things that truly bring me happiness rather than just following trends or trying to impress others. The bonus sections, \"\"Dopamine Nation\"\" and \"\"Dopamine Detox,\"\" were also insightful and provided valuable insights into maintaining a balanced lifestyle.Take note: No pictures or images attached.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan2624",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6VG6ZTJCV23AYOE33RDBUUSRFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34LCOF3N7ZB1D?ASIN=B0CFZN46XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Fascinating Read",
                "reviewText": "This book explains how intentional design boosts happiness. The science behind feeling joyful in certain spaces is truly fascinating! I really enjoyed this book, though I wish there was photos. Anyone who wants a home promoting happiness should read this book, highly recommend!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miguel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXWBMIZRSG5HQ22T5CEH5LJMKNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DGC42J2BZUE0?ASIN=B0CFZN46XB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Good book",
                "reviewText": "I highly recommend this book! It is truly a gem. The book not only provides an amazing visual guide with stunning pictures and internal home designs, but it also goes the extra mile by offering science-based explanations. These explanations delve into how intentional décor choices can have a profound impact on our happiness and overall wellbeing. It's truly fascinating to learn about the connections between our surroundings and our emotional state. This book is a must-read for anyone who wants to create a space that promotes joy and contentment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book was very small and thin for the price. Not what I expected compared to the many  Home Decor books I have purchased. Disappointing that there are no photos either. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 26, 2023",
                "reviewTitle": "Dopamine Decor",
                "reviewText": "Content ok but overall book size and format not worth the price. Looks cheap.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}