{
    "remaining_requests": 38455,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Upcycling-Furniture-Home-Decor-Dummies/dp/1394150024",
    "body": {
        "name": "Upcycling Furniture & Home Decor For Dummies",
        "price": "$24.99$24.99",
        "originalPrice": "",
        "rawPrice": 24.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Upcycling-Furniture-Home-Decor-Dummies/dp/1394150024",
        "soldBy": {
            "sellerID": "A1C3QU77DDT2KW",
            "name": "indoobestsellers",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1C3QU77DDT2KW"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "Only 7 left in stock (more on the way).",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81Tm5qTrMbL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Judy Rom",
            "link": "https://www.amazon.com/Judy-Rom/e/B0C2JLVDK8/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "indoobestsellers",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 7,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews From the Back Cover Turn trash into treasure with upcyclingIn a world experiencing a garbage crisis, upcycling is a part of the solution! Learn how to rescue and reimagine items that were headed for the landfill. Upcycling Furniture & Home Decor for Dummies is creative, eco-conscious, and downright fun. This easy-to-follow guide shows you the A–Z process of upcycling and how to flip furniture for a profit. Upcycling is an environmentally savvy hobby that can earn you cash! Inside… Find out how to tap into inspirationExperience the thrill of sourcing materialsLearn simple and effective techniquesDiscover breathtaking techniques for paintingGet a handle on upholstery, glass-cutting, and basic woodworkingStyle, stage, and photograph your pieceCreate promotions to sell effectively About the Author Judy Rom runs Upcycle That, a website dedicated to everything upcycling. Judy aims to inspire readers to reuse items to enable a more beautiful, sustainable, and rich lifestyle."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Monday, February 19 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 10 hrs 44 mins",
            "$3.99 delivery February 22 - 29."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Breathe new life into old furniture and thrift store findsUpcycling Furniture For Dummies shows you how to revitalize old furniture, with just a little effort and imagination, and maybe a few coats of fresh paint. Upcycling furniture is affordable, good for the environment, and a whole lot of fun! This easy, step-by-step guide shows you how to get creative and put your own unique flair on your designs. You'll gain the knowledge and confidence you need to select items that are worth transforming or restoring and learn specific techniques to give old pieces a new lease on life. Learn the process of upcycling dressers, tables, chairs, and other furnitureEnjoy the fun of sourcing items and increasing their value with your creativity!Update your décor with gorgeous, upcycled furnitureExpress yourself and find out how to flip your creations for a profit!This Dummies reference is great for anyone with an interest in turning trash into treasure. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Crafts, Hobbies & Home",
                "link": "https://www.amazon.com/Home-Garden-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=48"
            },
            {
                "name": "Antiques & Collectibles",
                "link": "https://www.amazon.com/Antiques-Collectibles-Home-Garden-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5066"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ For Dummies; 1st edition (April 25, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 304 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1394150024"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1394150021"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.2 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.3 x 0.8 x 9.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#299,039 in Books (See Top 100 in Books) #30 in Antique & Collectible Furniture (Books) #244 in Gift Decorating #753 in Home Decorating (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 7 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "1. What are some basic facts about upcycling that you wish consumers were more aware of? Anyone can be an upcycler! You don’t need special tools or skills. It’s about the desire to transform something unused into something functional and beautiful. Most people have already upcycled something before and just didn’t know that it was called upcycling! 2. What tips can you offer people just starting out with upcycling, who may not feel handy with tools and a paintbrush? The beauty of upcycling is that you can start small. For instance, it’s easy to turn almost anything into a planter! One of our most popular upcycles ever is the featured wine cork planters tutorial on the cover of the book. Those are easy to do and a great first project. No complicated tools are required, you just need a small kitchen knife and a hot glue gun! The beauty of upcycling is that you can start small. For instance, it’s easy to turn almost anything into a planter! One of our most popular upcycles ever is the featured wine cork planters tutorial on the cover of the book. Those are easy to do and a great first project. No complicated tools are required, you just need a small kitchen knife and a hot glue gun! It’s also really simple to make your own soy-wax teacup candles. There are also a lot of fun projects that just involve glue. Like the gorgeous three-tiered tray. 3. What is the biggest benefit you’ve experienced since you started upcycling? When you begin upcycling you start to look at the world around you differently. You begin to see value where you once saw trash. It’s a really fun creative outlet! 4. While sourcing items for upcycling projects, what has been your best find? I once found a single dresser drawer in my alley and turned it into a coffee table with a piece of glass on top and some hairpin legs. It was inlaid with velvet and it was great for housing a collection. 5. Do you have a favorite upcycling project thus far? We’d love to see photos! It’s super fun to make upcycled lighting. This can be super simple like this fire truck lamp on page 202, or you can learn to cut wine bottles and transform them! I love the Mondrian glass pendant light made from wine bottles on page 210. This tutorial in the book also teaches you how to do this faux stained-glass technique.",
                "media_link": []
            },
            {
                "media_text": "About the Author Judy Rom turns trash to treasure, and so can you! On Earth Day 2012, Judy co-founded the upcycling website, Upcycle That (upcyclethat.com). Her mission was to galvanize a global movement, encouraging as many people as possible to upcycle! Upcycling is alchemy. You take something that’s considered waste, and turn it into something functional, valuable and beautiful! Over the past 10 years, Judy has created upcycling projects in the United States, Canada, South Africa, United Kingdom, Europe and Asia, and inspired over 3 million people to upcycle. Judy currently runs Upcycle That from Vancouver, Canada; but her favourite thing about upcycling is how universal it is. No matter where you live, or how much money you have, you too can be an upcycler! Judy authored Upcycling Furniture and Home Decor for Dummies in order to make upcycling accessible and fun. Get ready to reimagine the world, one furniture piece at time!",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dfd30580-71cf-484c-8f92-c9f06a93dffe.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1c3546bd-46f6-43df-be32-780d812da48c.__CR0,0,1500,464_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b3a6c297-ea4f-43c5-97a7-268c8be867a8.__CR0,0,750,750_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/780adfbe-2221-4374-bffb-2b71ef64a96b.__CR0,0,750,750_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ebe6f5d9-06b3-41ef-abf7-cc28ef95ad1a.__CR0,0,750,750_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d926dc00-ff81-4b64-ae37-86a16bd58829.__CR0,0,750,750_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a7dd75bc-07e3-4e8a-b8b2-4fb3490726b4.__CR0,0,750,750_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52d50424-c852-47d4-a4b4-50ea777e289c.__CR0,0,750,750_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dfd30580-71cf-484c-8f92-c9f06a93dffe.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Geoffrey DrukerGeoffrey Druker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 5, 2023",
                "reviewTitle": "Best book for our times",
                "reviewText": "I purchased the book for my daughter. She loves building things, growing things, being creative. I'm giving this book Five Stars because it covers the upcycling process from A to Z and then some.It has so many photos to clearify, illustrate and inspire. I found it surprising to see what items can be resued and in what way.The aurhor really is creative, writes clearly and obviously loves the topic. The book is well designed with clearly marked chapters and a useful index.It covers huge range - including for example furniture, antiques, upholstery, glass, planters and glass jars.Learn how to price, present and promote. Learn how to scavenger through your local thrift store for items to upcycle.Wish to have fun, create useful and nice things, while saving the planet? This book is a must.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712gi79GHjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71tzQtp3pKL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$18.20",
                "sellerName": "indoobestsellers",
                "sellerRating": "4.5"
            },
            {
                "price": "$18.21",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            }
        ]
    }
}