{
    "remaining_requests": 38438,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/DOWILLDO-Projector-Control-Million-Ceiling/dp/B0CJJ4G64V",
    "body": {
        "name": "DOWILLDO Smart Star Galaxy Projector, Nebula Night Light with Smart APP & Voice &Button Control, DIY 16 Million Colors and Timer Mode for Kids Room, Party Night Ceiling Decor.",
        "price": "$39.99",
        "originalPrice": "",
        "rawPrice": 39.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/DOWILLDO-Projector-Control-Million-Ceiling/dp/B0CJJ4G64V",
        "soldBy": {
            "sellerID": "A2A9I1RPN74VJL",
            "name": "EFGHONG",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A2A9I1RPN74VJL&asin=B0CJJ4G64V&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CR164LKM"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CJJ4G64V",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51XJPwTMxtL._SS36_.jpg"
            },
            {
                "asin": "B0CJJ54CQG",
                "variationName": "Color",
                "variationValue": "White",
                "price": "$39.99",
                "variationImageURL": "https://m.media-amazon.com/images/I/51Ea7pXQSQL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51XJPwTMxtL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/511-mM9ucfL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41st-MsXNyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/412GVx0EOhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oPZh 64BL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KtKP8JToL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51jvSidOiYL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the DOWILLDO Store",
            "link": "https://www.amazon.com/stores/DOWILLDO/page/B4E2ED76-8BEC-4B60-8D61-7432F020BF76?ref_=ast_bln"
        },
        "brand": "DOWILLDO",
        "merchantInfo": "EFGHONG",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 98,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18",
            "Or fastest delivery Tomorrow, February 14. Order within 5 hrs 48 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "🎁【 High Definition Star Projector 】: Project real HD images of galactic nebulae on the ceiling, the projection range is up to 200㎡, the longer the distance, the larger the projection area, when placed in the center of the room, the starlight projector covers the entire ceiling of the room, creating a beautiful atmosphere.",
            "🎁【Timing Function &Brightness Colour Adjustment 】： You can set this star projector on a timer to turn on and off automatically at any time. There are 7 colours in nebula mode and 16 million colours to DIY your favourite light effects, the brightness of each colour can be adjusted from 1% to 100%, and it can be set on the device.",
            "🎁【4 Adjustable Projection Directions】：The Galaxy Projector offers four different angles of projection (0°/ 30°/ 45°/ 60°). You can play the projection on the ceiling, floor, wall or in any direction. Choose the most suitable angle to create your favourite cosy scene, and the different colours of the lighting effects bring you different visual experiences!",
            "🎁【Button & Voice & Smart APP Control】：Use the round button on the side of the body for basic control, the Galaxy Night Light also works with Amazon Alexa/Google Home/Smart Life App in WIFI mode, and you can easily adjust the light color, brightness, speed and set the timer via the APP and your voice",
            "🎁【Nice Gift for Family and Friends】：Night Light Projector is a great home decoration for your bedroom, game room, night party, and home theatre. It's a great choice for family, kids or friends. Perfect for birthdays, anniversaries, Christmas gifts and Valentine's Day."
        ],
        "description": "Smart Star Galaxy Projector",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Lighting & Ceiling Fans",
                "link": "https://www.amazon.com/Lighting-and-Ceiling-Fans/b/ref=dp_bc_aui_C_2?ie=UTF8&node=495224"
            },
            {
                "name": "Wall Lights",
                "link": "https://www.amazon.com/wall-lights/b/ref=dp_bc_aui_C_3?ie=UTF8&node=5486429011"
            },
            {
                "name": "Night Lights",
                "link": "https://www.amazon.com/night-light/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3736651"
            }
        ],
        "productInformation": [
            {
                "name": "Color",
                "value": "Black"
            },
            {
                "name": "Light Source Type",
                "value": "LED"
            },
            {
                "name": "Power Source",
                "value": "Corded Electric"
            },
            {
                "name": "Brand",
                "value": "DOWILLDO"
            },
            {
                "name": "Item Weight",
                "value": "1.61 Pounds"
            },
            {
                "name": "Style",
                "value": "‎Modern"
            },
            {
                "name": "Mounting Type",
                "value": "‎Tabletop Mount"
            },
            {
                "name": "Are Batteries Included",
                "value": "‎No"
            },
            {
                "name": "Product Dimensions",
                "value": "‎6.4\"L x 6.4\"W x 6.4\"H"
            },
            {
                "name": "Manufacturer",
                "value": "‎DOWILLDO"
            },
            {
                "name": "Item model number",
                "value": "‎NX-SK20"
            },
            {
                "name": "Special Features",
                "value": "‎Corded"
            },
            {
                "name": "Shade Color",
                "value": "‎Multicolor"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "ASIN",
                "value": "B0CJJ4G64V"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 98 ratings"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#274,748 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #3,153 in Night-Lights"
            },
            {
                "name": "Date First Available",
                "value": "September 21, 2023"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 5 x 6 x 7 inches; 1.61 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ NX-SK20"
            },
            {
                "name": "Date First Available ‏",
                "value": "‎ September 21, 2023"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ DOWILLDO"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0CJJ4G64V"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Emilia luczakEmilia luczak",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZ46CDEFKIEO64IKIVAONSBLBAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30EU8PPYRDD06?ASIN=B0CJJ4G64V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Such a great effect!",
                "reviewText": "The media could not be loaded. Apparently, you can connect it to an app, but after my first attempt, I couldn’t be bothered to finish, especially since you can control it with a button on the side. I ended up purchasing one for a friend as a gift after she saw how it looks like.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71yewDV53uL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/affd7b34-bc7a-443e-b0ab-8f5c8a318c65/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "The Squirrel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFS4OEUFHURVQKANE4CONGPOGMXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGVO18NSOS94F?ASIN=B0CJJ4G64V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Ground control to...my bedroom ceiling...",
                "reviewText": "I chose this to compare and contrast between the astronaut projector and this projector. They both are wonderful, each in its own way. I prefer this projector because it projects an actual nebula, and the astronaut does not. The combination of the smart app, voice control, and buttons makes operating this projector fairly simple. It's truly fun to lie down in a dark room and play with the settings. Also, you can set it and forget it! The timer mode lets you customize the projection duration, making it perfect for bedtime or setting the vibe for a party. It's not just for kids. This projector isn't just a night light; it's a relaxing experience. The controls are intuitive, the colors are mesmerizing, and the timer function is a great touch. I highly recommend this projector. Just bypass the astronaut all together. You'll be happy you did.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ray",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHPDOOLQVU7ALA2UXTXIGB4CCMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32RWPDUSRO06R?ASIN=B0CJJ4G64V",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 3, 2023",
                "reviewTitle": "4.0 out of 5 stars A Little Bit Scary for a Child's Room",
                "reviewText": "This is a review of the DOWILLDO Smart Star Galaxy Projector. It may be a bit too much for a child.The good stuff: This is a terrific nightlight, with a nice selection of light effects, colors and the rest of the galaxy at our fingertips.The not-so-good stuff: The device, which is shaped like a wheel on it's side, has a limited number of adjustments as to aim the light show. A bigger possible problem is that the light coming out of the device can be very strong. I was concerned that my grandkids might stare into the light by mistake.The other issues that drop the rating: it needs to be plugged into a computer (USB) port for power. Obviously, you can use an adaptor to plug it into a wall outlet, but the device does not come with one.But the biggest headache I got was the app required. Now, you can manually turn on the nightlight and select what effects you like, but there are some bells and whistles that require you use the downloaded app. First, I had all sorts of issues getting the device to pair up with my phone (I already have the Smart Life app loaded on my phone; I use it for a home security camera I installed a few months ago). Secondly, I have no intention of getting my grandkids a cell phone just so they can modify the settings of the device with the app. The use of an app for something that is likely to be used in a child's room is overkill. Stick with a remote control.Any, my verdict: 4 stars. As a mood-setting nightlight, it's a winner. But dump the technology... hey, it's just a nightlight.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TheSkyHive",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2G6BRZHG2AMMKOFF63ANQJHP4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MPZGP73WZXKS?ASIN=B0CJJ4G64V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars A Stellar Experience for ages 1-111!",
                "reviewText": "Please allow me to gush a bit, this rad projector projects the most stunning and realistic galactic nebulae onto the ceiling, transforming any room into an interstellar haven. The coverage is incredible, spanning the entire ceiling with ease, creating a mesmerizing atmosphere that will fit in a nursery or even your own personal trip cave!Being able to schedule it to turn on and off automatically is super convenient for times when you want to vibe out before bed or a quick nappie-poo.I'm particularly fond of the 4 adjustable projection directions. It's super kewl how you can direct the projection to the ceiling, floor, wall, or any direction you please!The round button on the side offers basic control, but the real magic happens with its compatibility with Amazon Alexa/Google Home and the Smart Life App in WIFI mode. It's incredibly user-friendly, and adjusting settings via voice commands or the app.The only hiccup was the initial setup with my Android device, requiring location services to be turned on - something not mentioned in the manual. But once past that, it's been smooth sailing.I do think the developers should include a small remote because many people won't take the time to pair it with a mobile device, overall, I am thrilled with this THING!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B WellonsB Wellons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFWRZXJJGABO32BPBGUABOBHQTGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U9IHK6EL6MDM?ASIN=B0CJJ4G64V",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Great colors and the stars move!",
                "reviewText": "The media could not be loaded. I am really impressed by the quality and features of this star and nebula projector. I had another projector that worked similarly, but this one is better for a few reasons. My other projector, which is formed into an astronaut figure, was not “smart” in the essence that it had Wi-Fi or Alexa capabilities and just Bluetooth, and also the stars were stagnant and did not move. This projector however has equipped with both Wi-Fi, Bluetooth, and smart home functions so that I can control it via voice commands from my Echo devices! Also, the stars on this one move slowly, which is great because the stars on my last projector and many others on the market do not move, rather are just stationary.I also like the futuristic and modern design of this projector, as most others on the market are geared more towards children and such have a shape and style designed best for a kid’s room. I myself on the other hand am an adult that is a kid at heart, but don’t want childish items in my bedroom. This takes care of that problem, as is circular shape and design blend much better with mature décor and simply fits in better. The only thing that concerned me was the FDA logo on everything, so I began thinking how does this product have anything to do with the Food and Drug administration? But I did a little research and it turns out the FDA does seem to deal with laser emitting devices, so I am left to believe that refers to the laser being used for the star portion of the projector.I am overall very happy with this star projector, and it really produces some colorful and vivid nebulas. I also appreciate that it has so many adjustable settings, making it easier to make it fit the room in the most customizable way possible. I also and thankful the cord was a decent length, so that it can reach the power outlet. The app works great, is responsive, and better to have at your disposal than a traditional remote, which only adds clutter, needs batteries, and easily gets lost. I also like there are laser warnings in several places so you are reminded of possible dangers, and it comes with a very nice 70 page manual. I think it is a fantastic star and nebulas projector and I enjoy it, and would easily recommend it to others.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31vRc19FyWL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/414+IIiZzDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41LeL5rjzxL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51I7M9KycML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51WWOd1mhsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51Yd6ccgQHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51aPD6uMrNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51eb1MTMzkL.jpg"
                    ],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/41c74c7b-90e4-477d-90dd-0a992282c7f9/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Eileen Casey GonzalezEileen Casey Gonzalez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "Out of the box beautiful!",
                "reviewText": "Just got this and so pleased that I am reviewing it immediately. Returned another type of device like this as it was not working correctly. Sometimes it seems things are meant to be as I could not be more pleased when I got this projector operating. Honestly I was totally surprised at how easy the lamp was to set up in the app and then absolutely stunned at its beauty it displayed on my ceiling. The amount of adjustments you can make to change colors of the projection and the speed of the Stars and clouds is wonderful plus, the amount of coverage the lamp gives simply by placing it in different positions is great. This is something I know will provide my house with a lot of enjoyment and I hope yours as well.UpdateThis lamp still impresses myself and everyone who sees it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/613uF78zgQL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mélanie CarlisleMélanie Carlisle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2024",
                "reviewTitle": "Worth it!",
                "reviewText": "Bought this for our child's bedroom. We love it! Easy set up. The only suggestion I would recommend is for the laser to also have the ability to change colors. I would have preferred white stars to make it appear more realistic.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/612MIaKqb6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iohn Born",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2023",
                "reviewTitle": "Mesmerizing nebulas and sharp stars. Works well with Google Assistant. Missing some features.",
                "reviewText": "This is one of the largest star projectors I've tried so far but it also has one of the larger projector lenses I've seen. Its design is minimalist and classy and, unlike most of the other ones that cater to children with cute but childish forms, this one would not be out of place in a contemporary living room décor.You can use it out-of-the-box, by simply plugging it in and using the side button to cycle through a few pre-set colour modes but you will get the most out of it by using the app. Note that if you already use the Gosund app for your smart devices, it will be fully compatible with this projector so you won't have to download Smart Life as recommended by the manual. The app gives you the option of adjusting the brightness of the stars and the multicolour nebula, the rotation speed of the latter and best of all the freedom to pick any colour you like for the nebula through a colour wheel. You can also set a timer.The projection is truly beautiful. The stars (which are green as with most star projectors) are sharp and of various sizes, covering almost my entire living room ceiling. The nebula (the multicolour background) is sharper, more complex and more detailed and contains more colours than in other star projectors I've tried mostly thanks to its larger projector. Gazing at the projections is both mesmerizing and soothing and goes particularly well with music -- which brings us to some of the negative aspects of this projection.Unlike other star projectors I've tried, this one does not feature any speaker Bluetooth or otherwise so if you'd like to play some music you will need to do so separately. There is also no way to make the stars pulse (also a common feature among the competition).On a more positive note, the projector is compatible with Google Home and once it's linked, you can use Google Assistant to turn it on or off. I've renamed the device \"Stars\" just so now I can say \"Hey Google, turn on Stars\" and voilà! my ceiling is full of stars.Overall, this is a great star projector that will please adults just as much as kids thanks to its minimalist design, its truly superb projections and its compatibility with Google Home. At around $40, I think it is fairly priced although it does not get a perfect rating because of its lack of features that other projectors in the same price range or even lower do have.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kc H",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 15, 2024",
                "reviewTitle": "Best galaxy projector hands down.",
                "reviewText": "I’ve bought four different types of galaxy projectors over the years as they kept breaking or stopped working. This one is by far the best of them all. You can customize it in every possible way and it works with Alexa. Very cool. U won’t be disappointed. Buy it now. 100% worth it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 26, 2023",
                "reviewTitle": "Features extremely limited if Smart Life app won't add device",
                "reviewText": "So this device can only be connected to the app through a 2.4 GHz connection, and though I have a dual band router with both 2.4 and 5, like many newer routers it automatically connects to the stronger network, so I was not able to add the device, and therefore have no access to all the extra controls and customizations that can be done with it.I have been doing some research into trying to force a 2.4 GHz connection and trying to play around with various settings in both my router and my phone, and so far no luck though I'm going to keep trying. The point is that this is a big headache to have to go through this trouble trying to make it work, even if I do end up successful eventually.There is a manual button that allows you to choose from a handful of settings, but considering that about 90% of the product listing is boasting about all the options available in the app, it's incredibly disappointing not being able to access all these additional features. The manual settings are quite impressive and I like them a lot. If the projector had only ever been meant to have those I'd be very happy with it (other than thinking it maybe a big over-priced for something so simple) but again, a big part of the appeal had been all the customization that's supposed to be available in the app.Another big drawback for me is that there is no power adapter, just a USB cord. This is becomingly incredibly common with electronic devices and I think it's terrible, expecting the consumer to provide their own power adapter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}