{
    "remaining_requests": 38452,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Classic-Outlet-Required-Certified-HS105/dp/B01K1JVZOE",
    "body": {
        "name": "Kasa Smart Plug Classic 15A, Smart Home Wi-Fi Outlet Works with Alexa & Google Home, No Hub Required, UL Certified, 2.4G WiFi Only, 1-Pack(HS105) , White",
        "price": "$10.99",
        "originalPrice": "",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Classic-Outlet-Required-Certified-HS105/dp/B01K1JVZOE",
        "soldBy": {
            "sellerID": "A2EY5WP9K29AC7",
            "name": "Quality Photo",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A2EY5WP9K29AC7&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41tQ9dniedL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31FBQH1HXHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31- vSdGmNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31 UDqw5hcL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51i3ppzpm0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51M8A1sqewL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41Yph-b ASL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the TP-Link Store",
            "link": "https://www.amazon.com/stores/TP-Link/page/A8C9009F-3398-4DE2-96E5-DAF7BBD28401?ref_=ast_bln"
        },
        "brand": "TP-Link",
        "merchantInfo": "Quality Photo",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 13606,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Sunday, February 18 on orders shipped by Amazon over $35",
            "Or fastest delivery Thursday, February 15. Order within 15 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Control From Anywhere: Turn electronics on or off from anywhere with your smartphone using the Kasa app (Compatible w/ Android & iOS)",
            "Voice Control: Works with Amazon Alexa, Google Assistant and MicroSoft Cortana supported devices for a hands free experience",
            "Compact Design: Won't block the other wall outlet allowing two Smart Plugs to be installed side by side",
            "Kasa scenes & schedules: Schedule the Smart plug to automatically switch on and off when away or set a scene for controlling many devices with a single button",
            "Note: Requires a secured 2.4 GigaHertz Wi Fi network connection"
        ],
        "description": "Control lighting and other appliances from anywhere with the Kasa Smart Wi-Fi Plug mini. Schedule connected devices turn on when you get home, then power down when you go to sleep. Control each outlet individually or as one, set schedules or scenes, even use voice commands with Amazon Alexa, Google Assistant, or Microsoft Cortana. Frequency Range: 2.4GHz; Protocols Supported: IEEE 802.11b/g/n. Operating Temperature: 0 ºC~ 40 ºC ( 32°F ~ 104°F ).",
        "breadCrumbs": [
            {
                "name": "Tools & Home Improvement",
                "link": "https://www.amazon.com/Tools-and-Home-Improvement/b/ref=dp_bc_aui_C_1?ie=UTF8&node=228013"
            },
            {
                "name": "Electrical",
                "link": "https://www.amazon.com/Electrical-Equipment-and-Light-Bulbs/b/ref=dp_bc_aui_C_2?ie=UTF8&node=495266"
            },
            {
                "name": "Outlets & Accessories",
                "link": "https://www.amazon.com/Electric-Outlets-Accessories/b/ref=dp_bc_aui_C_3?ie=UTF8&node=495334"
            },
            {
                "name": "Outlet Switches",
                "link": "https://www.amazon.com/Electrical-Outlet-Switches/b/ref=dp_bc_aui_C_4?ie=UTF8&node=6291368011"
            }
        ],
        "productInformation": [
            {
                "name": "Manufacturer",
                "value": "‎TP-Link"
            },
            {
                "name": "Part Number",
                "value": "‎HS105"
            },
            {
                "name": "Item Weight",
                "value": "‎3.52 ounces"
            },
            {
                "name": "Product Dimensions",
                "value": "‎1.5 x 1.6 x 2.6 inches"
            },
            {
                "name": "Item model number",
                "value": "‎HS105"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Size",
                "value": "‎1-Pack"
            },
            {
                "name": "Color",
                "value": "‎white"
            },
            {
                "name": "Style",
                "value": "‎1-Pack"
            },
            {
                "name": "Material",
                "value": "‎Plastic"
            },
            {
                "name": "Voltage",
                "value": "‎120 Volts"
            },
            {
                "name": "Item Package Quantity",
                "value": "‎1"
            },
            {
                "name": "Mounting Type",
                "value": "‎Plug-In Mount"
            },
            {
                "name": "Switch Style",
                "value": "‎Temperature Switch"
            },
            {
                "name": "Certification",
                "value": "‎UL approved"
            },
            {
                "name": "Included Components",
                "value": "‎Smart Wi-Fi Plug Mini HS105, Quick Start Guide"
            },
            {
                "name": "Batteries Included?",
                "value": "‎No"
            },
            {
                "name": "Batteries Required?",
                "value": "‎No"
            },
            {
                "name": "Warranty Description",
                "value": "‎2 Years"
            },
            {
                "name": "ASIN",
                "value": "B01K1JVZOE"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 13,606 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#128,048 in Tools & Home Improvement (See Top 100 in Tools & Home Improvement) #309 in Electrical Outlet Switches"
            },
            {
                "name": "Date First Available",
                "value": "August 9, 2016"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Previous page Next page 1 Control from Anywhere 2 No Hub Required 3 Voice Control 4 Set Schedules 5 Compact Design",
                "media_link": []
            },
            {
                "media_text": "Your Home. One App. Control all your Kasa light strips, bulbs, plugs, switches, and cameras using the friendly Kasa Smart app, eliminating the need for multiple apps to control your smart home.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/dc0dfe94-eb69-46dd-8eed-445b9b311052.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/70d057b9-10e6-48e9-b3de-49d23e9d3b7d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/831711e0-0c13-4ba2-889c-5c3622ec071d.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/eba2dd3f-e0af-44dd-a4ab-847039806a0e.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3417b9c8-b9d5-43db-a369-c5e25d55d341.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/08917b8f-606b-43d7-a0a6-7b89cedb6b14.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1d3996dc-0ca3-46f6-95e5-36f2c83c44b0.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/dc0dfe94-eb69-46dd-8eed-445b9b311052.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Poohead",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIRHKAZCGJOI6DSMQNHOQDIFLNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3A3TDY2DTNC2L?ASIN=B01K1JVZOE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2019",
                "reviewTitle": "5.0 out of 5 stars Easy to install, Zero connecting issue, Zero connection lost.",
                "reviewText": "This review will include all the stuff that I installed since Dec. Will come back later for a long-term update.All of them installed on a managed network.10 TP link Kasa Switches Single Pole2 TP Link Kasa Smart Plug Mini Outlet10 TP Link Kasa LB 110 (2700K)3 TP Link Kasa LB 120 (2500-9000k)1 TP Link Kasa LB 130 (Color)6 LIFX Mini White 800L (2700K)3 LIFX A19 (Color)Initial Installation:I have zero trouble on installation, zero connecting issue or losing connection issue. I guess most of the complains are from older review and the new firmware fixed the problem. Both brands have a very simple straight forward installation. First you down load the app, next you install the bulb, then you click ADD device and follow the screen instruction then voila. Bear in mind that at first the device is trying to connect to your phone/tablet DIRECTLY to initiate the process, so stay close to it and make sure both device on the same network 2.4ghz. After you enter the Wi-Fi info on screen, they will switch back to connect to the Wi-Fi instead of each other, so give it some time to do that. From that point everything should be smooth sail and you and proceed to update the firmware and finish the installation.Performance:Both TP Link and LIFX performs really well on the white bulb, both are nice and bright and providing about the same amount of light but the LIFX has a way better dimming performance. The TP link dim at 1% is not really 1%, is at least 20% I would say, where the LIFX dim is really at 1%. If dim to 1% is important for you, I will forget about TP link, it can't go below 20% IRL even it is showing at 1%. If dimming to 1% is not that important to you then I will say both are good and it will be depending on the price point. I got both at $14.99, no complains there.On the color bulb, the LIFX A19 will blow the TP Link LB130 away. LIFX A19 is rated at 85W and the LB130 is only at 60W, the brightness on the LIFX A19 is just pure awesome especially in color mode. Overall the LB130 is just weak, not bright at all on color and the one I have is kind of limping and became very dim on 3rd day so I end up returned it.On the switch and the plug. They are awesome, zero hick up at all and very responsive to command, is like instant on and off no delay there, very solid product and the price is good too. I am glad that they are one of the cheapest but performing very good.If you are putting 2 switches together, this is a perfect fit cover to usehttps://www.amazon.com/gp/product/B01D0Q81YW/ref=ppx_yo_dt_b_asin_title_o05__o00_s00?ie=UTF8&psc=1If your recess base is too small for the bulb base to go through, this is a good adapter to use but beware of the depth of your recess, it might stick out.DiCUNO E26 to E26 Socket Extender, E26/E27 to E26/E27 Lamp Bulb Socket Extension, Lamp Holder Adapter (10-Pack)I wasn't going to do that before because the price was crazy. $40 regular bulb? You are kidding me.But at $14.99 a white bulb, I think is more doable now and I pulled the trigger, that's pretty much the same price when GE first came out the led bulb to replace filament decades ago.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jorge JuarezJorge Juarez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEW42PDR3JOWZUSZZSH42TRLNB7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R216Z5U0LJ0IVE?ASIN=B01K1JVZOE",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 1, 2017",
                "reviewTitle": "5.0 out of 5 stars Instructional Review: Tiny and magnificent. You'll LOVE IT!!!",
                "reviewText": "After researching automated light switches and outlets to control my lights, I picked TP-Link because they do not require a separate hub to work. Out of the box, install or plug-in, load the Kasa app and create an account, discover using the Kasa app (connect the device to your WiFi at home) and you're ready to go.I absolutely LOVE the light switches and the outlet plugs. The online TP-LINK installation videos are awesome; short and concise with clear instructions. These Smart devices work perfectly every time using the Kasa app, Alexa and now the Google Assistant. When the power went out once, the devices automatically reconnected and worked flawlessly. BEST PURCHASE EVER!!!I bought the Amazon Echo Dot - 4 times - and controlled my lights from anywhere in the house simply by speaking to Alexa.Then, as of 3/25/17, Google Assistant got in the action. So now I can also tell my phone \"Ok Goggle, turn on the Basement\" and the two Smart Plugs (one mini and one original-sized) turn on together since I made a \"basement\" group to include them both.If you're buying these Smart Plugs or Smart Switches for the first time, the below info will be helpful to know to avoid asking yourself \"why is it not working for me the way people say they do?\"1. You need to install the Kasa app and create a user account to operate your devices using your phone/tablet. The Smart devices must be able to connect via the WiFi in your house to be operated remotely (by you not manually touching the device). Although you can still operate the devices manually, you bought these to operate them remotely. The Kasa app let's you name each Smart device (IMPORTANT: NAME EACH DEVICE AND GROUP AS YOU WANT TO CALL IT OUT USING ALEXA OR GOOGLE ASSISTANT) and create \"Scenes\" to group multiple Smart devices to turn on/off at the same time. Tapping on the device name in the Kasa app opens the options to set schedules, timers and more.2. Got an Amazon Echo? Install the Alexa app on your phone/tablet, add the Kasa Skill, link the Kasa Skill to your Kasa account (from point #1 above), discover devices, then create Groups - similar to the Scenes in Kasa - and select which devices to include in the group for Alexa to know what you meant to turn on/off at the same time. If you DON'T create groups in the Alexa Skill: A) Simply ask Alexa to turn on/off the individual Smart device name, and... B) Alexa will NOT know which multiple Smart devices to turn on/off at the same time - even though you created a Scene (group) in the Kasa app, key phrase here... \"in the Kasa app\". After you create a group name and include Smart devices in the Alexa Skill, you'll feel like one of The Jetsons, a Star Trek crew member or a millionaire, with the power to command lights on and off using you voice: \"Alexa, turn on the Living Room\".3. Got an Android smartphone/tablet with Android version 6.0 or higher? Google began sending upgrades to those devices to install the Android Assistant - the same Artificial Intelligence (AI) used with the Google Home device (the device that competes with Amazon Echo). Here's the deal, similar to the Alexa Skill, you NEED to enable and setup the Android Assistant using the similar steps I described in topic #2 above: Link it to your Kasa account, create Group names and add Smart devices to the group, etc. To set up your Android Assistant to operate your TP-LINK Smart devices, start by saying \"Ok Google, turn on my LIGHTS\" - the AI is smart and will prompt you with a bubble for you to setup Google Home interfaces. It's da bomb!Hopefully this will help you enjoy your TP-LINK Smart devices as much as I do.If you're thinking \"I'm still not sure if I should get these or another brand...\" GET THESE!!! You will not regret it. They work great! Also, when I had questions, their customer support was very responsive. The love is definitely there.My goal is to get my entire house upgraded to use only TP-LINK light switches. In time, as the budget allows, it will happen.",
                "reviewVotes": "403 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71o2HHdAa6L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "GP",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 12, 2024",
                "reviewTitle": "Great for timed interior lighting, and many other uses!",
                "reviewText": "I've been using this for two years now to control my living room lamp. The iPhone app is easy to use, and with it you can set the on and off times either to specific hours of the day or based on sunrise and sunset -- a great feature! Integration with Amazon Alexa is superb, allowing me to tell Alexa to turn it on or off by name -- and I get to pick the name. Wi-Fi connection was a breeze. Installation involves just plugging it into the wall outlet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ritish s.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 27, 2017",
                "reviewTitle": "Excellent product if coupled with good continues wfi",
                "reviewText": "Good product for electrical appliances that require less ampere current,high speed continuous broadband Internet.To add 2 prong flat pin plug socket is a necessity for use in India",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francisco S.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 23, 2020",
                "reviewTitle": "Un obligado navideño",
                "reviewText": "La relación de calidad y precio son excelentes. Es una muy buena opción para automatizar tus electrodomésticos e incluso tus adornos de temporada. Ésta versión maneja muy buen amperaje y sin problemas puedes manejar la iluminación navideña.Es muy rápido para instalar y desde que lo abres hasta que lo puedes usar no te deberá demorar más de 5 minutos, considerando que tienes que descargar la aplicación a tu celular y dar de alta una cuenta para poder agregar el enchufe eléctrico.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NT",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 28, 2018",
                "reviewTitle": "Wide range of uses",
                "reviewText": "Don't like to deal with timers and the complicated ways of setting them up? Don't like the bulk of traditional timers? Well look no further than this smart mini plug. I've been using these for quite some time now and have a couple of the older plugs (larger in size).The fact that these can be controlled through your app from anywhere you are is a great convenience. I primarily use these for light decorations inside and outside of the house. I have them all set to go on at the same times and off at the same times. They have performed flawlessly and the app makes it a breeze to setup. They don't take up much space at all and you can still use the second outlet in your wall plug. These are designed well and if you need to use both receptacles, they plug in without issues.You can also use these for your existing floor lamps, table lamps, etc. Almost anything you want to put a timer on, this product will do it. You don't need to use the timer if you don't want to so if you want to keep your lights off until you are ready to head home you can remotely turn on your lights. I have also used this to control my crock pot. I use it to delay turn on and auto shut off my crock pot at certain times depending on recipe.I also have the Tp-link smart switches and a dimmer. Good eco-system and the app is always updating. These plugs are just a good addition to the ecosystem of smart switches. I would definitely recommend these without hesitation.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PaperclipPaperclip",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 5, 2018",
                "reviewTitle": "Is just a high tech timer *updated*",
                "reviewText": "Update April 2019They have a new software update and they now support control this smart plug anywhere outside your house. Last review is they just control locally inside your home. But now they just updated. So I give one more star for them. If they care about the last star they need to lower the price. Because I find out an other brand brought it from local Walmart is half of the price.I brought this because I can control them through home WiFi network wherever I'm in the house. The Kasa App is also easy to use and connect them very simple. Enough function that you can use to control your plug.Pros: Easy to set up Compact design without blocking other outlet Have \"Schedule\" \"Away\" and \"Timer\" function You can read how many hours your \"lights on\" or whatever device on everydayCon: Plug control only local wifi network The \"Schedule\" and \"Away\" function don't see the different. I'm confuse.Overall this wifi plug is just a high tech timer upgrade from the mechanical one. Yes you can use Amazon Echo Voice Control but if you not using Echo. Only control locally you can't control away from home. I suggest save the money to buy the HS100 or HS110 is more useful.",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61hZUYWbfNL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61erj8+7k1L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/619NlS5Em-L.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}