{
    "remaining_requests": 21535,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Glycolic-Acid-Exfoliating-Cleanser-Anti-Aging/dp/B013PU1RQM",
    "body": {
        "name": "Body Merry Glycolic Acid Exfoliating Facial Cleanser – Anti-Aging Face Wash with Jojoba Beads – Cruelty Free Skin Brightening Pore Scrub for Men and Women, 6 fl oz",
        "price": "$19.67$19.67 ($3.28$3.28 / Fl Oz) $18.63$18.63 ($3.11$3.11 / Fl Oz)",
        "originalPrice": "",
        "rawPrice": 19.67,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Glycolic-Acid-Exfoliating-Cleanser-Anti-Aging/dp/B013PU1RQM",
        "soldBy": {
            "sellerID": "A37TSFORZAW7YY",
            "name": "Body Merry",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A37TSFORZAW7YY&asin=B013PU1RQM&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07621K8ZB"
        ],
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "3",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41UzUuEplKL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51EtutrngpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51DG0X0vxyL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51 WgJrOOtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51h15q9uQRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eDGsPDXpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/B1xshuvc9KS.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/v2/d3b0a537-f814-5810-884c-7073f9309b41/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8d5e7219-2ebf-4726-a350-11a6d5d0b264/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Body Merry Store",
            "link": "https://www.amazon.com/stores/BodyMerry/page/710EF8D9-938C-4F68-8756-32F564799005?ref_=ast_bln"
        },
        "brand": "BodyMerry",
        "merchantInfo": "Body Merry",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4795,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Saturday, February 17. Order within 20 hrs 24 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "EXFOLIATING CLEANSER: Deep clean pores and keep blackheads and blemishes at bay! This cleansing facial wash combines exfoliating Glycolic Acid with Willow Bark and Jojoba Wax Beads to renew skin",
            "NATURALLY NOURISHING: As well as sloughing away dead cells and alleviating clogged pores, the hydrating treatment moisturizes dry, dull and aging skin leaving it looking youthful and radiant",
            "FROTHY FOAM: Cleanse away the stress of the day with a luxurious lather – this foaming face wash gently removes dirt and impurities, leaving skin feeling soft and clean, without being stripped of natural oils",
            "PACKED WITH LOVE: Our Leaping Bunny Certified cruelty free skincare is made in the USA using natural and organic plant based ingredients including Aloe, Jojoba Oil, MSM, Tea Tree Oil and Vitamin E",
            "90 DAY HAPPINESS GUARANTEE: We want you to Get Happy About Your Skin! If you don't love our face scrub, we'll refund your purchase, no questions asked (no need to return the bottle)"
        ],
        "description": "GLYCOLIC ACID EXFOLIATING FACIAL CLEANSER: Wash away dullness and face the day with a brighter, more radiant and youthful looking complexion. Our exfoliating cleanser combines powerful Glycolic Acid with Willow Bark and Jojoba Beads (wax, not plastic!) to slough away dead skin cells along with dirt and oil buildup that can leave your face looking less than glowing. Unclogging pores helps to reduce blackheads and blemish breakouts, and the exfoliating face wash has an anti-aging effect by renewing and rejuvenating the skin’s surface – it evens removes makeup. The cruelty free anti-aging facial cleanser doesn’t strip or dry skin, instead nourishing and moisturizing with natural Olive, Rosehip and Tea Tree Oils, along with Organic Aloe, Jojoba Oil, MSM and Vitamin E. The translucent, fragrance free face wash produces a foamy lather, and is an invigorating and refreshing start or end to the day! For best results, gently massage a small amount of the vegan cleanser to moistened skin on your face and neck, carefully avoiding the eye area. Rinse thoroughly with lukewarm water and gently pat dry. Follow with our Age Defense Pro-A Serum and Retinol Surge Moisturizer as part of your daily regimen. For oily or acne prone skin, use 4-5 times a week. For normal, dry or sensitive skin, use 2-3 times a week. Adjust usage to what works best for your skin. Body Merry: Get Happy About Your Skin!",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Facial-Cleansing-Products/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060901"
            },
            {
                "name": "Washes",
                "link": "https://www.amazon.com/Facial-Cleansing-Washes/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7730193011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 7.13 x 1.73 x 1.54 inches; 6 Ounces"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 636225496573"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Body Merry"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B013PU1RQM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#26,478 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #412 in Facial Cleansing Washes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,795 ratings"
            },
            {
                "name": "Brand",
                "value": "Body Merry"
            },
            {
                "name": "Item Form",
                "value": "Gel"
            },
            {
                "name": "Skin Type",
                "value": "Acne Prone,Oily,Dry,Sensitive,All Skin Types"
            },
            {
                "name": "Product Benefits",
                "value": "Cleansing"
            },
            {
                "name": "Active Ingredients",
                "value": "vitamin_e, glycolic_acid"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "sagean",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESOZ3T7D7EOTAL6EABYBEJAEO4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PP317JO4I8BU?ASIN=B013PU1RQM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2018",
                "reviewTitle": "5.0 out of 5 stars If this product is making your skin worse, by all means",
                "reviewText": "For everyone who are writing reviews after only a week to a month, DO SOME RESEARCH! Acne, hyper pigmentation, and everything else that comes with breakouts can take UP TO 6 MONTHS until you see drastic changes. You must have a solid skincare regimen, as well as a proper diet (with LOTS of water), and also REDUCE YOUR STRESS. If this product is making your skin worse, by all means, stop using it. But if you have only been using this product for a month or 2, don't expect your acne to disappear. I know how it feels to want a miracle to occur overnight with skin improvement, but the sad reality is that it won't happen that way. The good news is that this product lasts a very long time is used properly, so you have plenty of time to give it a chance ;).In 2016, I had the worst acne breakout of my life. I was left with hyper-pigmentation that I did not think was ever going to go away. I spent weeks researching products that contained ingredients (ingredients that I also spent a long time researching) that I felt would help my skin. I think my breakout was largely due to stress, but for reference, I have both dry and oily skin. It goes back and forth, probably due to many factors (weather, environment, water intake, stress). I ultimately chose to try this product because it was a much less expensive alternative with many similar ingredients to the face wash a skin care professional suggested.-A little really does go a long way. In the past year and a half, I've only gone through 3 bottles.-Since changing my entire skincare regimen (and life factors), my skin has improved dramatically. I can not say that it is only due to this product, as I used all new products, but I continue to keep this one in my routine, as well as Body Merry's Super C-22 Moisturizer. So far, I really like this company. I haven't tried any of their other products, but I sometimes browse their site to see what other products they have.*If you are suffering from hyper-pigmentation and/or acne, it's important to remember that it can take 6 months to a year for it to fully go away. It's a hard pill to swallow, but you have to accept that and be patient. Don't blame the product if your skin doesn't magically get better over night (or in a month or two).*When researching ingredients in products, also remember to keep in mind that just because a product has a certain ingredient, it still may not have the right amount. Many companies only include a small amount of specific ingredients just to be able to include it in the ingredient list.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liberty",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENINUJXJQJ26ZMA3SFYMOEQNS7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AI5J75SM6645?ASIN=B013PU1RQM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Best cleanser I’ve ever used, please make it forever!",
                "reviewText": "I was using a Vitamin C cleanser for a while but it didn’t give me the exfoliation I wanted (pores weren’t clear) AND it burned like hell on wheels when it invariably got in my eyes. No bueno. I was drawn to this one because glycolic acid is a chemical exfoliant but also because it’s FULL of botanicals. I love the little beads in it and feel like the cleanser as a whole really wakes me up in the morning and makes me feel squeaky clean at night when I use it to remove my makeup. Bonus, my monthly hormonal breakouts (always along the jawline) have all but ceased and my skin has never been so consistently clear. A+ and will possibly never buy another cleanser again!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Brower",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUKQYYCGOGCUPBBTYL57NKQ7MVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IVDH7ZVL2GZS?ASIN=B013PU1RQM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2018",
                "reviewTitle": "4.0 out of 5 stars Different strokes for different folks...",
                "reviewText": "Before I say anything, know that everyone's skin is different and so there are many variables for skin care. I have mild/moderate acne, lots of scars from 20+ years of acne and picking. Besides that, I have very large pores and dull, dull skin. I break out heavily about a week prior to my period, and other than that, it's manageable wih some makeup. So before you read everyone else's review, know that they may be in a bad part of their cycle, or just have different skin care needs for their type of skin.I've been using this in the \"non-breakout\" part of my cycle (only had this product for a week). It is just the right amount of glycolic acid for MY skin (it may be too much/too little for yours). I've been using daily, and follow with a moisturizer that is good for oily skin (we acne folk CANNOT skip on the moisturizer no matter how oily). La roche-posay's effaclar mat moisturizer is the best I've found for a follow up after using this wash.So far, it has noticeably reduced my pore size and my skin feels much smoother. I've also noticed my skin being brighter. But, it is not doing much for my acne. Maybe helping a bit, but I'm sure when I get to the \"break-out\" part of my cycle it won't be a cure all, which is ok.I'm still giving this 4 stars because it has helped my complexion in other ways besides acne. In my opinion, much cheaper than getting heavy duty glycolic acid peels at a spa for about the same results.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anna R. Pena",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4UCGIBJ43Z5MA4V3PKI5O5GFEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QMHAO605GKNT?ASIN=B013PU1RQM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Love the product but the pump is not working",
                "reviewText": "Have ordered a couple of this face wash and it is excellent. Highly recommend. I use 3xs per week and it has helped my skin look more radiant. However the last bottle I purchased, the pump is not working.May I have a new pump mailed to me? It is a specific type used for this product.Thank you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "name",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 21, 2018",
                "reviewTitle": "works fine",
                "reviewText": "ive been using this once a week for around 4 weeks and this really does help. i use it at night and the morning after my skin looks a lot more even and it doesnt irritate my skin. i only use it once a week though, so i dont know how drying it would be to use up to 5 times a week (as said on directions). id only use it up to 3 times a week, even for oily skin like mineproducts i use with this at night: tamanu oil and neutrogena hydro boost gel creamproducts i use with this in the morning: st ives collagel facial moisturizer and neutrogena clear face sunscreen",
                "reviewVotes": "83 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Haley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 12, 2022",
                "reviewTitle": "I like",
                "reviewText": "I like it, it seems great. I just didn't realize it has those annoying micro-beads in it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aqsa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 30, 2019",
                "reviewTitle": "Dry Cleanse with this!!!!!!",
                "reviewText": "This product is pretty amazing. It doesnt work well when you wet your face first--so I put it directly on dry skin and gently cleansed for several minutes, then add some water and make it foam slightly and wash off. It helped get rid of all this cheek and chin acne I had for several months now. It also works great as a spot like treatment and pretty much dries out the spot when you wake up in morning. Great for the value. Been using it for 3 months and only half the bottle was used.",
                "reviewVotes": "82 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JennyD",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 2, 2023",
                "reviewTitle": "Price more than doubled 😡",
                "reviewText": "I found this cleanser a couple years ago for $18 and LOVED it! After falling in love and going to buy it again, I was frustrated and disappointed to see that it was over double the cost. I have not bought it again because of the cost.So...product 5 starsCompany 1 star.Therfore rated 3 stars.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gail",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 8, 2018",
                "reviewTitle": "Smoother looking skin!",
                "reviewText": "The product was received in good time. My skin is sensitive, oily and I have large pores. I have noticed with a few weeks of use that my pores appear smaller and my skin looks smoother. The product is very gentle and my skin doesn't react but I use it only every second day. I would recommend it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}