{
    "remaining_requests": 21669,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Neutrogena-Polyhydroxy-Moisturizing-Paraben-Free-Sulfate-Free/dp/B088S1685Y",
    "body": {
        "name": "Neutrogena Skin Balancing Milky Cleanser with 2% Polyhydroxy Acid (PHA), Soothing & Moisturizing Face Wash for Dry & Sensitive Skin, Paraben-Free, Soap-Free, Sulfate-Free, 6.3 oz",
        "price": "$8.75$8.75 ($1.39$1.39 / Fl Oz) $7.83$7.83 ($1.24$1.24 / Fl Oz)",
        "originalPrice": "$12.29",
        "rawPrice": 8.75,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Neutrogena-Polyhydroxy-Moisturizing-Paraben-Free-Sulfate-Free/dp/B088S1685Y",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Save 5%",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/310l8Je7mSL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41XjItzBJhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41W2EEBSyRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51QWgee76JL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/318p-1toNOL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31ZQPjpaICL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31VtDbyLUvL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Neutrogena Store",
            "link": "https://www.amazon.com/stores/Neutrogena/page/3BC8CF14-3F35-41A4-9BF3-705A7FB2B6B6?ref_=ast_bln"
        },
        "brand": "Neutrogena",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 2006,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 4 hrs 57 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Melt away dirt & impurities with Neutrogena Skin Balancing Milky Cleanser with 2% PHA for dry & sensitive skin",
            "Soothing & silky face wash contains dermatologist-grade 2% polyhydroxy acid (PHA), a powerful liquid exfoliant and moisturizing humectant in one. It decongests down to the pores while conditioning skin",
            "This PHA formula was developed with dermatologists, is hypoallergenic, and respects skin's natural pH and moisture barrier. Suitable for dry & sensitive skin, the cleanser is also effective for cleansing before & after wearing your mask",
            "From a dermatologist recommended skincare brand, Neutrogena Skin Balancing face wash effectively targets 100% of pore-clogging dirt while respecting skin's natural moisture barrier, leaving your skin soft & perfectly balanced",
            "Moisturizing milky cleanser is formulated to be paraben-free, soap-free, sulfate-free, phthalate-free, alcohol-free, and dye-free. Recyclable bottle is made with 30% postconsumer recycled plastic"
        ],
        "description": "Gently cleanse, smooth, and balance your skin with Neutrogena Skin Balancing Milky Cleanser. Designed for dry and sensitive skin, this milky cleanser melts away dirt and impurities while moisturizing and soothing skin. Specially designed with dermatologists, this hypoallergenic formula respects skin's natural pH and moisture barrier. This soothing face wash for dry & sensitive skin effectively targets 100% of pore-clogging dirt while respecting skin's natural moisture barrier, leaving your skin clean, soft, and perfectly balanced. This skin balancing formula contains dermatologist-grade 2% polyhydroxy acid (PHA), a powerful liquid exfoliant & moisturizing humectant in one, that decongests down to the pores while conditioning skin. From Neutrogena, a dermatologist recommended skincare brand, this cleanser is free of parabens, soap, sulfates, phthalates, alcohol, and dyes. To use, apply to wet or dry face, massage gently, and wipe off with a tissue or rinse with water. This daily face wash is effective for cleansing before & after wearing your mask.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Facial-Cleansing-Products/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060901"
            },
            {
                "name": "Washes",
                "link": "https://www.amazon.com/Facial-Cleansing-Washes/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7730193011"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 1.85 x 2 x 7.32 inches; 8.32 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ cleanser"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 070501112625"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Johnson & Johnson"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B088S1685Y"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Canada"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#23,330 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #356 in Facial Cleansing Washes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 2,006 ratings"
            },
            {
                "name": "Item Form",
                "value": "liquid"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            },
            {
                "name": "Brand",
                "value": "Neutrogena"
            },
            {
                "name": "Material Feature",
                "value": "Paraben-free"
            },
            {
                "name": "Material Type Free",
                "value": "Paraben Free"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Skin Balancing Milky Cleanser For Dry Skin The one that moisturizes + soothes. Meet the perfect match for dry, sensitive skin! This milky cleanser with gentle PHA exfoliates and conditions skin while respecting its natural pH. It melts away dirt and impurities while protecting skin’s moisture barrier. Sound like the one for you?",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/159e9d1a-8c86-4a22-81f3-87778cfe9b7d.__CR0,0,1500,1500_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/159e9d1a-8c86-4a22-81f3-87778cfe9b7d.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/6ac6547f-f329-430d-afe3-e53001c56906.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/bcd729bb-32f4-4832-9205-bfa8d8680e01.__CR0,0,1500,1500_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/4317ac7d-5b2e-4cf5-ab4a-db5c61fe11fb.__CR0,0,1500,1500_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ed.Doc99",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7TNYCGNMKFO36RX6CZKQFE2ITA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X6VH6GYEY7JZ?ASIN=B088S1685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Soft and Supple!",
                "reviewText": "This product seems unscented to me, which I LOVE, as I’m very sensitive to fragrances. I admit that I also really LOVE the bottle and labeling. That shouldn’t matter, but I guess it does.I really like that you can use it without water and you can just wipe it off with tissue instead of having to rinse your face. That’s more convenient when traveling or really tired.The first time I used it, it did seem to be a bit trying to my skin. However, I’ve been using this now for several weeks, and it no longer feels drying at all. It definitely exfoliates my skin.Before I used this, my skin felt rough to my touch. My partner never mentioned anything, but it made me feel old! Plus, I wondered how well my other few skin products, like sunscreen, were getting absorbed into my rough, scaly skin.Originally, when I switched from using just regular soap to using this, later in the day, I would be a little oily in certain places on my face. Maybe the T-zone. I’m not sure, because after a few weeks of using this, that has gone away.My skin now feels balanced and soft, not rough or scaly anymore. In fact, I like to use this on other parts of my body, such as where I shave, to try to prevent ingrown hairs. I’m not sure how effective it is for that, though. I think I need something stronger for that.I’m 52, and I guess I have to face the fact that I’m in menopause, and that has changed my skin. I’m no longer oily, so that’s a huge plus of getting older, ha ha! But it’s been confusing for me to figure this out!Since I was 14 and for about 30 years afterward, I have had varying degrees of oily, acne-prone skin ranging from severe (I took Accutane for two rounds in high school) to eventually getting less and less oily over the years.My point is that I still tend to think of myself as having oily skin, but I’m not sure that’s true anymore, due to menopause. I rarely get whitehead pimples anymore, but I do still have some blackheads and some large pores on and near my nose and some scattered blackheads in other areas of my face.I didn’t wear sunscreen from age 20-50, so I have sun-damaged skin on my face and especially on my neck. (Now, I wish I had put up with the oiliness of the sunscreens of those days!) So, I don’t really know which skin products are best for me.Given that, plus realizing that no at-home product is going to fix 30 years of sun damage, I didn’t know which cleanser to choose. I’ve been trying to find a good one for a few years, but I feel I can never quite reach Nirvana with anything, especially since I’m unwilling to do more than 1-2 steps in the morning and 0-1 at night!I used this for the first time on my face without any water for cleansing. I rinsed it off using water, though. It felt really good going on, using it, and rinsing it off. After gently wiping my face dry (not patting as I’ve heard we’re supposed to do; I’m too lazy to take that kind of time!), I noticed pretty quickly that my face felt a little dry.I almost never use moisturizer, and the slight dryness this caused on my face did not make me go running for the moisturizer like some other cleaners have done. It was a little bit bothersome, but it must’ve gone away fairly quickly because I never ended up using the moisturizing sunscreen that I bought to go with it.My only concern was wondering if using it means I need to be more careful in the sun. I’ve been pretty good about wearing sunscreen lately, plus, it’s been Winter; I haven’t had too much sun exposure, so I am not sure whether this makes one more prone to sunburn, but I’d imagine at least a little bit since it’s exfoliating.Update: It’s been about 7 hours since I used it for the first time, and my cheeks, nose, and sides of my forehead are somewhat oily now. I didn’t expect that, and that is very disappointing.Updated update: As mentioned above, this oiliness went away with a few weeks of use. Now, my skin feels soft, supple, and, dare I say, dewey, but not oily! And the original amount of oiliness was not ever a big problem anyway.In fact, I’ve now got this product on subscription, and I’m going to try out other products in this line by Neutrogena.After using this product and liking it, I also ordered their blue bottle of exfoliating liquid, and I use that on the areas I shave to try to prevent ingrown hairs. It works **really well** to smooth my skin, but I don’t think it’s preventing ingrown hairs yet. I guess I should use it on my face and neck, too ha ha!!Bottom line: if you don’t have overly oily skin, and you want gentle exfoliation that doesn’t make you super prone to sunburn and doesn’t cause peeling, give this a try! If you’re still too oily after using this fir a few weeks, return it and try the blue or green bottle.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katherine Serafin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFR4MJTPE4QU5RKTJ6YXTAOLTWPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14QNRI1JLB6AP?ASIN=B088S1685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Creamy and moisturizing",
                "reviewText": "This feels like conditioner for your skin. Leaves it feeling baby soft and lightly moisturized - NO dryness or tight feeling. Smells a little old ladyish but the scent doesn't linger once it's rinsed off. If you have dry, combination, or mature skin, I recommend you give this a try.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tim C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETZO7PJLIQBYUO6ZJ6T6ETR7JSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WVDTC6KDBLYQ?ASIN=B088S1685Y",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Improve the smell PLEEEEASE!!!",
                "reviewText": "Love how gentle this is but I really wish the smell was better. It’s almost a RANCID smell.It works so well that I tolerate it. But cleansing my face would be such a better and more relaxing experience if the smell was better (but not strong).",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catherine Greenfield",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX26OMCI472SAN2I53IOCAKPHYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ITC1XYST60Y8?ASIN=B088S1685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Helping with my KP!!!!",
                "reviewText": "I have forehead bumps from KP, and using this regularly with a lil silicone scrubby has MADE SUCH A HUGE DIFFERENCE! I also get dry patches from being chronically dehydrated, and this has HELPED SOLVE THAT TO SOME EXTENT, TOO. This product has a very light scent, for those of us with scentsitivities (eyyy!), and is suuuper milky and creamy and smooth. It sometimes feels like it hasn't washed completely off, but don't worry, it's just moisturizing you. To me, a li'l silicone scrubby is key, or else it kinda feels like it's just sitting on top, but honestly my face and neck have never been more clear than after starting to use this. For some reason, I can't reliably find it in shops, so Amazon it is. Def give it a go if you have dry, bumpy skin!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESSCSUREWMSJK2H2BKP2LKP377A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R23Y5KXQHFKOS3?ASIN=B088S1685Y",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2023",
                "reviewTitle": "3.0 out of 5 stars Contains oil",
                "reviewText": "I gave it a 3 because I was under the impression this was comedogenic. It's not. There is oil listed in the ingredients. That could have been my fault for not reading the description enough or Amazon's crappy search function (because my search was for comedogenic face wash. That aside, I also wasn't a fan of the smell or the fact my face didn't feel clean after using it. Made me feel greasy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chloe Chamberlain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPTLTRZOVUPN7DFNILDUBQMDW2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HQK1M410DJ4D?ASIN=B088S1685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 30, 2023",
                "reviewTitle": "5.0 out of 5 stars I absolutely love love love this cleanser!",
                "reviewText": "I love this cleanser so much! It leaves my face feeling clean, but also smooth and nice. It moisturize my skin too, While cleaning it at the same time! I struggled with dry skin for a while. I began using this cleanser about a year ago. I don’t think I’ll ever go to another cleanser. It’s good for sensitive skin and it’s very moisturizing. It doesn’t dry me out like all the other cleansers I’ve tried. It’s got a nice texture to it and it makes my skin feel nice afterwards. It’s great quality without breaking the bank!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Hoppe ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSW5MFTYN3SZRLIIFU65LNMBK5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTQ45SI9IMBZE?ASIN=B088S1685Y",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2021",
                "reviewTitle": "5.0 out of 5 stars A must have! What are you waiting for, just buy it!",
                "reviewText": "I have rosacea and my skin is all uneven and red. It makes me look older. I can’t even cover it with makeup since I have extremely dry skin. Since I started using this which is about a month my skin is softer, more moisturized, also the red is fading. My skin tone is much more even and while shopping someone said to me that I have a beautiful face, my skin looked great and like peaches and cream! I couldn’t believe it, I also couldn’t believe it worked that fast!I prefer to use it on dry skin then wipe off with tissue paper and finally rinse with water. It rinses off easy to rinse and I don’t know how good it’s remove makeup since I don’t wear. I’ll only use a primer and eye makeup at the max but I love this stuff. First thing to ever work this good and I used to use Christian Dior before I hurt my back and can’t afford. You’ll only be hurting yourself if you don’t dry it. This is now my #1 facial product!!!!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ROSE",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKMKYU54SC2UR4YQYIJOBPTOPHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DL7MSTOV2KUF?ASIN=B088S1685Y",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "1.0 out of 5 stars Nasty scent",
                "reviewText": "The scent is almost rancid. Unable to use, this is the only Neutrogena product that I realized came out of Canada?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$3.04",
                "sellerName": "NORTHCOAST COLLECTABLES",
                "sellerRating": "4.5"
            },
            {
                "price": "$8.99",
                "sellerName": "I.O.T.",
                "sellerRating": "4.5"
            },
            {
                "price": "$9.00",
                "sellerName": "Golden Gates Store",
                "sellerRating": "0"
            }
        ]
    }
}