{
    "remaining_requests": 21867,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Neutrogena-Lightweight-Hyaluronic-Hypoallergenic-Paraben-Free/dp/B0B3ZCG2NH",
    "body": {
        "name": "Neutrogena Hydro Boost Lightweight Hydrating Facial Gel Cleanser, Gentle Face Wash & Makeup Remover with Hyaluronic Acid, Hypoallergenic & Paraben-Free, 7.8 fl. oz",
        "price": "$8.72$8.72 ($1.12$1.12 / Fl Oz) $7.80$7.80 ($1.00$1.00 / Fl Oz)",
        "originalPrice": "$15.39",
        "rawPrice": 8.72,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Neutrogena-Lightweight-Hyaluronic-Hypoallergenic-Paraben-Free/dp/B0B3ZCG2NH",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CVNDGRR8"
        ],
        "asinVariationValues": [
            {
                "asin": "B01LETURZI",
                "variationName": "Size",
                "variationValue": "6 Fl Oz (Pack of 1)",
                "price": "$8.88",
                "variationImageURL": ""
            },
            {
                "asin": "B0B3ZCG2NH",
                "variationName": "Size",
                "variationValue": "7.8 Fl Oz",
                "price": "$9.18",
                "variationImageURL": ""
            },
            {
                "asin": "B0B2KQHTLD",
                "variationName": "Size",
                "variationValue": "16 Fl Oz",
                "price": "$12.50",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/31OqPg FwbL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51Z2Mmb 7XL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51tuJvN6gzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41m8OzX4qXL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nTQp n8SL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41 r6XUyjRL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ybAraZqsL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Neutrogena Store",
            "link": "https://www.amazon.com/stores/Neutrogena/page/3BC8CF14-3F35-41A4-9BF3-705A7FB2B6B6?ref_=ast_bln"
        },
        "brand": "Neutrogena",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 24543,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 11 hrs 22 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "7.8-fluid ounce bottle of Neutrogena Hydro Boost Daily Hydrating Facial Gel Cleanser to boost skin's hydration for soft, supple skin",
            "This hydrating gel formula contains hyaluronic acid and is proven to increase skin's hydration and lock it in, leaving skin feeling refreshingly clean and touchably supple, every time you cleanse",
            "Lightweight cleanser is easy to apply. The gel transforms into a silky lather that effectively washes away dirt, oil and bacteria and lifts away make-up without stripping your skin for a refreshing and hydrating at-home self-care experience",
            "This hydrating cleanser & make-up remover is soap-free, oil-free, and paraben-free. From a dermatologist recommended brand, it is gentle and hypoallergenic",
            "Neutrogena Hydro Boost facial cleansing gel is effective for cleansing before & after wearing your mask. The Neutrogena Hydro Boost Collection also includes hydrating Hand Cream, Body Gel Cream, Facial Moisturizers and Cleansers with hyaluronic acid"
        ],
        "description": "Boost skin's hydration for soft, supple skin with Neutrogena Hydro Boost Hydrating Facial Gel Cleanser. This easy to apply, lightweight facial cleansing gel transforms into a silky lather that washes away dirt, oil, and bacteria and effectively lifts away makeup without stripping your skin. The lightweight formula leaves skin refreshingly clean and touchably supple. With hyaluronic acid, a hydrator found naturally in the skin that attracts moisture and locks it in. The formula of this gentle face wash is hypoallergenic & not tested on animals. Free of soaps, oil, and parabens, this daily hydrating cleanser is clinically proven to increase skin's hydration level and lock it in. This cleanser can be used daily for a refreshing and hydrating at-home self-care experience and is effective for cleansing before and after wearing your mask. Neutrogena Hydro Boost Collection includes hydrating Hand Cream, Body Gel Cream, Facial Moisturizers and Cleansers.",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Facial-Cleansing-Products/b?ie=UTF8&node=11060901"
            },
            {
                "name": "Gels",
                "link": "https://www.amazon.com/Facial-Cleansing-Gels/b?ie=UTF8&node=11061001"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 7.4 x 1.89 x 1.81 inches; 9.91 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 06424"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 070501064245"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Johnson & Johnson"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B0B3ZCG2NH"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ Canada"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,575 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #5 in Facial Cleansing Gels"
            },
            {
                "name": "Customer Reviews",
                "value": "4.7 4.7 out of 5 stars 24,543 ratings"
            },
            {
                "name": "Item Form",
                "value": "Gel"
            },
            {
                "name": "Skin Type",
                "value": "All"
            },
            {
                "name": "Brand",
                "value": "Neutrogena"
            },
            {
                "name": "Scent",
                "value": "Unscented"
            },
            {
                "name": "Material Feature",
                "value": "Fragrance Free"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Step 1: Wet face and hands with lukewarm water Step 2: Pump cleanser into hands and work into a lather. Use 1 or 2 pumps Step 3: Massage lather onto skin with a gentle, circular motion Step 4: Rinse with lukewarm water and pat dry with a soft towel",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8bcc042c-77af-49ff-b3b9-c2252b2917c7.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6444f4d7-a9b7-4268-85cf-ff15f3563cac.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/322f4edb-db45-471b-a9e6-a6882275b9cf.__CR0,0,300,225_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7461d2a4-8c3d-4884-aa32-5d709b6c9de2.__CR0,0,300,225_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "Discover the Cleanser That's Right For You Gel Cleanser Add to Cart Gel Cleanser Refill Add to Cart Exfoliating Cleanser Add to Cart Ultra Gentle Cleanser See Details Original Daily Cleanser See Details Customer Reviews 4.7 out of 5 stars 24,543 4.7 out of 5 stars 24,543 4.7 out of 5 stars 1,874 4.7 out of 5 stars 922 4.7 out of 5 stars 144 Price $9.18$9.18 $12.50$12.50 $29.91$29.91 — — Description Hydrating gel cleanser Hydrating gel cleanser Exfoliating Cleanser Ultra-gentle facial cleanser Facial cleansing bar soap Key Ingredients Hyaluronic Acid Hyaluronic Acid Hyaluronic Acid Glycerin Glycerin Benefits Gently cleanses and hydrates Gently cleanses and hydrates Gently cleanses and exfoliates Gently & effectively cleanses Effectively cleanses Formulated Without Soap, parabens Soap, parabens Oil, soap, parabens Oil, Soap Dyes, hardeners Size 7.8 Fl Oz 16 Fl Oz 5 Fl Oz 12 Fl Oz 3.5 Oz",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e115c87-4879-47ce-9179-c9dd2876f4a3.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d2e75880-c574-4c98-b692-610444dec447.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8bcc042c-77af-49ff-b3b9-c2252b2917c7.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6444f4d7-a9b7-4268-85cf-ff15f3563cac.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/322f4edb-db45-471b-a9e6-a6882275b9cf.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7461d2a4-8c3d-4884-aa32-5d709b6c9de2.__CR0,0,300,225_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0667c495-6c94-4e7a-8dfa-6c9063889c0d.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9610917a-73e9-465b-9a64-f678bffc3647.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3cc0ac49-813c-4402-a2e2-7273398ca390.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/68467a36-b195-4fa3-8769-bbb10ed9d8e3.__CR0,0,200,225_PT0_SX200_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c1b4dfe-34c4-46ae-b23c-adc42bac24e9.__CR0,0,200,225_PT0_SX200_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mel83",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYG4PB7CRUCPLPAZVKGOECY66WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39KRUWNSUWSKX?ASIN=B0B3ZCG2NH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 30, 2022",
                "reviewTitle": "5.0 out of 5 stars Best cleanser I've ever used!",
                "reviewText": "To be honest, I was always the type of person who didn't put any thought into \"skincare\" during my younger years (even though I have had a lifelong addiction to cosmetics). In my mid-30s I finally started developing a skincare routine with various serums, moisturizers, masks, etc but still didn't think too much of cleansers...in my mind, something that just sat on top of wet skin for a few seconds only to be washed off again just didn't seem like it was an important part of my skincare routine because the cleanser isn't kept on the skin for very long. I basically lived on makeup removal wipes for my entire 20s and 30s, which I now know aren't so great for skin. Hindsight is 20/20.About 6 months ago, shortly before I turned 39, my lifelong \"very oily\" skin suddenly turned dry. Like, almost overnight. I have always had a \"grease pit\" for a face, with large pores and very oily t-zone as well as horrendously oily cheeks - I never used a moisturizer previously because my skin was so oily all the time. Now, my skin suddenly was parched and tight feeling and had flakey patches that just wouldn't go away, it looked horribly embarrassing and made my foundation look gross. Looking back, I think I may have used too many facial masks or treatments (in an attempt to fade some dark spots and even out my skintone) and damaged my skin barrier and turned my skin \"sensitive\". I began to realize that the makeup removal wipes probably were drying my skin up even worse, and started to use actual cleansers instead of wipes.I have an Ipsy subscription so I had a few brand new sample/travel sized cleansers sitting around under my bathroom cabinets. A few of them dried my skin up even worse, but 2 of them seemed to actually hydrate my skin after use...so at that point I realized that cleansers really DO make a difference in a skincare routine. The travel sized cleansers didn't last too long before running out and the full sized versions of those cleansers were pretty expensive and I'm on a tight budget, so I ventured out to find a less expensive hydrating (and sensitive skin friendly) cleanser. I have used several Hydro Boost products in the past and had a good experience - and I'm a sucker for the particular color of blue used for the Hydro Boost line - so I chose the hydrating cleanser to try. To my surprise, it hydrated my skin even better than the 2 more expensive brands I had previously used in travel size!After using the Hydro Boost cleanser, my skin does not feel \"tight\" and dry (which is a problem I've had with many other cleansers). I still moisturize almost immediately but I do appreciate my skin not feeling uncomfortable between cleansing and moisturizing. After adding this cleanser to my new routine (which includes a few other skincare items from more expensive brands) my skin feels almost as good as new, my flakes have all vanished. The other new skincare items were starting to repair my skin, but it wasn't until I added the Hydro Boost cleanser to the routine that my skin fully seemed to be fully repaired. I skipped the Hydro Boost cleanser for a few days to see if it really made a difference and my skin became slightly dry again with a few flakes, so I knew at that point that this cleanser was really making a difference - it takes the tightness away, hydrates, and also seems to make my skin more smooth. I also love the scent!The fragrance is a little strong so if you are very sensitive to such things you should probably get the fragrance free version of Hydro Boost, but I just love the scent personally, although it does seem to disappear immediately after the cleanser is washed off. I am going to stock up on this cleanser, and I really hope it is never discontinued.",
                "reviewVotes": "76 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQJM4TTCTH6MTHXAUQHIZ4JZZHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LP7YQJ96G4F3?ASIN=B0B3ZCG2NH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2020",
                "reviewTitle": "5.0 out of 5 stars This has ended my headlong dash for the bottle of moisturizer right after I clean my face.",
                "reviewText": "I've been a \"Neutrogena girl\" for decades. I've raised 3 \"Neutrogena girls\", as a result. I was blessed with great skin, and as often happens to those who have been blessed with something, I took it for granted. The only thing I ever did FOR my skin was wash it. And it has always been just the regular bottle of Neutrogena. I'm now in my late 40's and am trying to undo years of sun damage and neglect. That's a whole different set of reviews.....my God, the amount of crap that's out there for aging women is mind-boggling and just freakin' scary. But this, I saw this when I was getting ready to order my tried & true Neutrogena. Figured I'd give it a try. I definitely need hydration where ever I can get it!! But it's soap, so I didn't expect some big change. And it wasn't big. But it was noticeable. Through my WHOLE life, especially in winter, right after I was done washing my face it always felt dry and tight. It's literally all I can do not to reach for something cooling and soothing to stop the itchy, tight feeling. For the first time EVER I didn't have that feeling after washing my face. AND it's winter. So, yeah definitely something I noticed......and loved. Other details - it has a great, light clean scent. And that's the only way I can define it. It just smells fresh and clean. It doesn't take much, the lather is moderate, and it washes COMPLETELY away with water. No residue left behind, and obviously no \"dry, itchy\" feeling either. It's my new facial cleanser and it doesn't COST a fortune. Which is nice, cause A LOT of this other skin care crap does. So still a \"Neutrogena girl\", just with an upgrade??",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "stormy Daze",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEH5T6MBIZ3A7GJG3YDPXGBMTJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LM9MR1TX2MU5?ASIN=B0B3ZCG2NH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars The best face wash ever!!!",
                "reviewText": "Very sudsy a little goes a very long way. Very moisturizing, no drying effect. I'm 73 and have taken great care of my skin since I was 20. This is the best face wash I have ever used trust me I have used a lot including many NAME store brands like Estee Lauder, Clinique, Elizabeth Arden etc. .",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Danielle Maldonado",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVELTPK2PL2ODNC6HMVPMQBCFNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAX0KO9F6GCHJ?ASIN=B0B3ZCG2NH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2023",
                "reviewTitle": "4.0 out of 5 stars Great for sensitive skin",
                "reviewText": "I have a very hard time finding face wash that doesn't cost me an arm and a leg and doesn't irritate my sensitive skin so I was so happy when I found this face wash. My skin actually feels softer and more hydrated when I get out of the shower instead of tight and dry.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "laura",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 11, 2023",
                "reviewTitle": "Super",
                "reviewText": "Si cumple con su función",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shelly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 5, 2023",
                "reviewTitle": "Great product",
                "reviewText": "I have been using this product for 10yrs +. It has very little fragrance and my skin feels great .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sobha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on September 13, 2022",
                "reviewTitle": "Worst packing",
                "reviewText": "I like the product very much but the package was very disappointing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V Caird",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 1, 2022",
                "reviewTitle": "This is a good cleanser",
                "reviewText": "Cleans off makeup easily with no residue. Face feels really clean but not dry. I was sceptical but no need, this is good.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "oyoe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Singapore on August 29, 2020",
                "reviewTitle": "worth to buy",
                "reviewText": "Packed well and cheaper than retail price.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}