{
    "remaining_requests": 21786,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Original-Himalaya-Purifying-Neem-Wash/dp/B07FSF8KF3",
    "body": {
        "name": "Himalaya Purifying Neem Face Wash, Normal to Oily Skin with Turmeric, Vegan, Soap Free, Paraben Free, Dermatologically Tested, SLS/SLES Free, 5.07 Fl Oz., 150 mL, 2 Pack",
        "price": "$11.39$11.39 ($1.12$1.12 / Fl Oz) $10.79$10.79 ($1.06$1.06 / Fl Oz)",
        "originalPrice": "$13.98",
        "rawPrice": 11.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Original-Himalaya-Purifying-Neem-Wash/dp/B07FSF8KF3",
        "soldBy": {
            "sellerID": "A3J7TTF21GY2Q",
            "name": "Himalaya.",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A3J7TTF21GY2Q&asin=B07FSF8KF3&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CP31D9Q2"
        ],
        "asinVariationValues": [
            {
                "asin": "B010Z0LH8I",
                "variationName": "Size",
                "variationValue": "5.07 Fl Oz (Pack of 1)",
                "price": "$6.99",
                "variationImageURL": ""
            },
            {
                "asin": "B07FSF8KF3",
                "variationName": "Size",
                "variationValue": "5.07 Fl Oz (Pack of 2)",
                "price": "$11.99",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "5",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51gA16m8KIS.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41GEcvyfLRS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51RjkLENrbS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/516xek IdXS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51vny4pI3ES.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41jg6KGNb8S.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41D9CVTE4AL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8b1f1b03-a925-4bee-bc6f-60220ae2e748/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c4a6433e-4cf1-48f2-9f7f-f24a1902f920/default.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 2,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Himalaya Store",
            "link": "https://www.amazon.com/stores/Himalaya/page/F9952BDE-42D9-4561-BBD1-88B7F32A56A3?ref_=ast_bln"
        },
        "brand": "Himalaya",
        "merchantInfo": "Himalaya.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 10355,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Wednesday, February 21 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 8 hrs 56 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Purifying Face Wash: Himalaya Purifying Neem Face Wash is a purifying daily cleanser that deeply cleans your skin without stripping it of essential moisture. Perfect for normal to oily skin types.",
            "Botanical Ingredients: With Neem, traditionally used to deeply cleanse, to cleanse and purify oily skin types. Turmeric to support clear, healthy-looking skin. With its rich, soap free later, this herbal combo is ideal for waking you up in the morning or helping you wash away the day at night.",
            "Non-Drying Formula: Deeply cleanse skin for a fresh feeling without leaving it dry and tight. Removes impurities, dead skin and excess oil.",
            "Made with Goodness : No parabens, SLS/SLES, phthalates, artificial colors or artificial fragrances. Soap-free cleanser. Dermatologically tested. From a family-owned company, trusted since 1930.",
            "Cruelty Free Skincare: Himalaya Purifying Neem Face Wash is 100% cruelty free. Our mission is to create happiness in every home and wellness in every heart, and that means animals too!"
        ],
        "description": "\"Wash away the day and start with a clean, fresh slate. Himalaya Purifying Neem Face Wash is a gentle balancing daily face wash for normal to oily skin types. Deeply cleanse your skin of impurities like makeup, dirt and pollution without stripping skin of its essential moisture. Neem, a tropical plant long prized for its cleaning properties, cleanses and purifies skin. Turmeric supports clearer, smoother skin. This normal to oily skin daily face wash is cruelty free with no parabens, phthalates, artificial colors or artificial fragrances and no SLS/SLES. In 1930, our founder became fascinated with the healing wisdom of herbs and set out on a quest to bring traditional Ayurvedic science to the world in contemporary form. Himalaya’s mission is to create happiness in every home and wellness in every heart by providing knowledge, advice and products that exemplify the best of the traditional Indian science of Ayurveda, which dates back over 3,000 years. Himalaya products are made with the utmost quality to live up to your high standards. From herbal supplements to botanical toothpastes to body and skin care, you’ll find products that enhance your daily life and make you feel your best.\"",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Facial-Cleansing-Products/b?ie=UTF8&node=11060901"
            },
            {
                "name": "Washes",
                "link": "https://www.amazon.com/Facial-Cleansing-Washes/b?ie=UTF8&node=7730193011"
            }
        ],
        "productInformation": [
            {
                "name": "Package Dimensions ‏",
                "value": "‎ 7.05 x 3.03 x 2.24 inches; 11.99 Ounces"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ FJFIEJFOK2041"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B07FSF8KF3"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#10,459 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #164 in Facial Cleansing Washes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 10,355 ratings"
            },
            {
                "name": "Item Form",
                "value": "Gel"
            },
            {
                "name": "Skin Type",
                "value": "Normal Skin, Oily Skin"
            },
            {
                "name": "Brand",
                "value": "Himalaya"
            },
            {
                "name": "Scent",
                "value": "Turmeric"
            },
            {
                "name": "Material Feature",
                "value": "Hypoallergenic"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jan K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFSGMETIM2NQ2HFYKFV52EFHWQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E9PVNUJXAMPD?ASIN=B07FSF8KF3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2018",
                "reviewTitle": "5.0 out of 5 stars High quality natural face wash that will change your life!",
                "reviewText": "I stumbled upon this product in my seemingly endless search for a more natural face wash for my acne prone skin, I simply wanted to share my opinion on this product as it has been a life-saver and a must-have in my skin care routine (I am not being compensated in any way to leave this review, just a happy customer).This product has a thick-gel consistency but is very smooth (non-exfoliating) and has a light, pleasant, and very clean smell. I absolutely LOVE this face wash because it leaves my skin feeling fantastically clean (removes makeup fairly well when I am too lazy to remove it first before cleansing) without leaving my skin feeling tight, dry or stripped. I have found it very difficult to find a gentle/natural cleanser that really cleans my pores without it being chemically or mechanically exfoliating, so this is a huge plus!This product works very well as a cleaner after rinsing the skin with warm water and gently massaging for a few minutes before rinsing clean. However one of my favorite ways to use this product is with my Mia 2 Clarisonic, it works perfectly with this device to get a deep clean feel and leaves my skin looking incredibly bright and even, I don't even use foundation anymore!In terms of acne, I will say that when I use this product consistently (once in the morning and once at night) I do see a HUGE improvement in my skin tone and texture, and a definite decrease in the amount of breakouts I get. When I am having a bad skin day/week I will cleanse with this product, dry my skin, and then apply a thin layer to my problem areas and leave on overnight as a mask (this will dry out the skin a little and leave it feeling a little tight) but usually wake up with my problem areas healing much faster than they would on their own.Definitely one of the best face washes I've ever used and will continue to purchase, extremely HIGH-QUALITY product and amazingly cheap. This has become a staple in my skin care routine and I always make sure to have it on-hand.",
                "reviewVotes": "17 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jasmine CalhounJasmine Calhoun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWCBC4TKTN7LUADJOMOHLDCTREQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8MNZDT5VSX14?ASIN=B07FSF8KF3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "5.0 out of 5 stars So far, so good",
                "reviewText": "I use this brands toothpaste and love it, never knew they also made face wash. The price was great as I needed a 2 pack for my teenage son when he visits his dad on weekends. The smell is natural, almost reminds me of aloe Vera But it’s light and smells refreshing. One review I read before purchasing said it doesn’t lather like soap, but it does. Another said their package came leaky, thankfully mine didn’t. Grateful I used my own judgement more than I took others. And posting MY experience for others can do the same bc our experiences won’t always be alike nor are they meant to so if the things you care about most are covered, give it try. Although the bottles could have been a bit fuller as mentioned in another review, it’s not a huge deal bc you really only need like a pea size amount and the price is great, if it stays that way of course, currently $11.99. It left my skin feeling clean AND soft asf. And I’ve been known to have sensitive skin but no adverse reactions with it. So No complaints so far.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/712INQsnv2L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81BNDZb1EIL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tiffany",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXFDWTQY3KCA4ILU7OS7IIPRFRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IE6VQB0WRW2D?ASIN=B07FSF8KF3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Absolutely love",
                "reviewText": "I have been using this product for 2-3 years now and I love it.My skin is “normal” and in the past when I have used other products, it has dried my skin out or made my skin oily. This product works for my skin and has worked for my boyfriend who has a more dryer skin than me.It does not leave weird residue on my skin, does not dry my skin out, and does not make my skin oily.It makes my skin look and feel more hydrated and my skin looks “refreshed”.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valued Customer ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX4EOTDY4IUCFWY7AG3NIND37VQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L2QTSQDZC2BH?ASIN=B07FSF8KF3",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Smells so good and leaves your face feeling refreshed",
                "reviewText": "The media could not be loaded. I ordered the two pack for myself and son who's going thru puberty. I was using the topo clear soap but it has harsh chemicals and found this researching, they came plastic wrapped and was easy to open. The face wash is a gel consistency and does not foam like soap but gives a clean feel unlike anything I've ever used. I love the way our skin looks and feel after using this product. I will review the next time I order about the longevity of using this product.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/15cc9b1a-d84b-4bff-8ab2-55dde3bc4b94/default.vertical.jobtemplate.mp4.480.mp4"
                }
            },
            {
                "reviewerName": "Kavan Patel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESWSK67BSY6XULYCZ7DRK2IOLEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36NW3E6NAKL0U?ASIN=B07FSF8KF3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Soft and skin friendly",
                "reviewText": "Loved it, Use it everyday for face wash.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5IG7OCFAYHAPZNWWTUHSOSCQRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HZZO1FJL5QOM?ASIN=B07FSF8KF3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2023",
                "reviewTitle": "5.0 out of 5 stars Highly recommend.",
                "reviewText": "I wanted to wait a couple weeks before I did a review to make sure I was seeing results. But it’s only been 3 days! & I already see/feel a big difference. I have combination skin. Oily & dry. I’ve been trying many diff kinds that usually feel like its just cleaning the top layer. Never my pores & always something left. Some products left my face feeling too dry to move or slathered in oil/lotion, but never CLEAN like I wanted. I feel like this product get rid of all of that. My face feels fresh & smooth! Looks like I did a whole mask.. compared to the “clean” I was getting before. My face is a little brighter. I’ve noticed some of the stubborn blackheads already getting lighter & less noticeable. After just 3 days! Gives a deep clean w/a gentle feel. Doesn’t smell too bad either. Just like a regular “non scented” soap. Haha. HIGHLY RECOMMEND if you’re looking for a deep but gentle clean. Or are struggling to match your combination skin. If you have dry skin already do be careful, I understand why some reviews said their faces felt dry afterward (wasn’t my case), but just to keep in mind! [:",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amanda",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEF3CGRFD3ANICT6CPNGZCX4EFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MHD1X44TM5H?ASIN=B07FSF8KF3",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 29, 2023",
                "reviewTitle": "3.0 out of 5 stars face irritation",
                "reviewText": "I used this for months. I liked it. I felt clean, refreshed. I even ordered a 2nd time but one night, I felt my face burning after washing my face. I didn't think too much of it until it happened again the next night. Not sure if it was a bad bottle/batch but decided not to continue using it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Great product, go for it without any doubt ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGV5S6GMMLLOEEB7ID2N3NUHPZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EOA2FCQIJ6LY?ASIN=B07FSF8KF3",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Great product",
                "reviewText": "Great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deidre",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 29, 2022",
                "reviewTitle": "Affordable and effective",
                "reviewText": "This is my second purchase. I love this cleanser. It’s effective and a great price. I still get cystic acne breakouts on my chin and jawline. I’m in my forties and don’t appreciate anything too drying. This wash hasn’t caused me to breakout and helps keep my acne at bay. I still get cystic acne but the amount, size and frequency is reduced. I alternate this wash and a glycolic wash as well as a salicylic acid spot treatment. So far I am very happy with this product.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sahil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 13, 2023",
                "reviewTitle": "Product",
                "reviewText": "Nice product at a very good price. Its my 5th time I am shopping this product from Amazon. Yes it's good 👍🏽😊",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JGJ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on May 6, 2021",
                "reviewTitle": "Excelente producto",
                "reviewText": "Muy bueno",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on April 22, 2023",
                "reviewTitle": "Satisfait",
                "reviewText": "Nettoyant visage doux et efficace",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GUIDO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 19, 2022",
                "reviewTitle": "buon prodotto",
                "reviewText": "arrivato completamente sigillato ed entro i termini di spedizione indicati al momento dell'ordine",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}