{
    "remaining_requests": 21791,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Desert-Essence-Thoroughly-Face-Wash/dp/B00R1S8H7M",
    "body": {
        "name": "Desert Essence Thoroughly Clean Face Wash for Oily Skin, 8.5 fl oz (2 Pack) Gluten Free, Vegan, Non-GMO Gentle Daily Cleanser - Tea Tree Oil, Organic Lavender & Chamomile to Remove Dirt, Oil & Makeup",
        "price": "$19.09$19.09 ($1.12$1.12 / Fl Oz) $18.14$18.14 ($1.07$1.07 / Fl Oz)",
        "originalPrice": "$21.38",
        "rawPrice": 19.09,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Desert-Essence-Thoroughly-Face-Wash/dp/B00R1S8H7M",
        "soldBy": {
            "sellerID": "A5W198TSQJIXA",
            "name": "SportingDoc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A5W198TSQJIXA&asin=B00R1S8H7M&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CB4RQRJX"
        ],
        "asinVariationValues": [
            {
                "asin": "B00C0TI114",
                "variationName": "Size",
                "variationValue": "8.5 Fl Oz (Pack of 1)",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00R1S8H7M",
                "variationName": "Size",
                "variationValue": "8.5 Fl Oz (Pack of 2)",
                "price": "$19.09",
                "variationImageURL": ""
            }
        ],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "17",
        "stockDetail": "Only 17 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GLS0TKVgL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41V831jjqtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415cV-Yh8cL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31lwcQVDpaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZryPoqhVL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aUc24No0L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/617PBHojfCL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/6e87962a-e130-4cc6-ac58-588912cef234/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8fe97f76-061d-4a30-8572-5cfd5c3eb83c/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f362a3e2-e95c-418c-98eb-940a642f0cf9/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1e1e2c7b-1597-4cbe-86ab-a85e7278b72f/default.vertical.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/beec9a86-6b69-432f-8357-6e423c32e962/default.jobtemplate.mp4.480.mp4",
            "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f85aec8-177a-434b-bd77-c928e23810f4/default.vertical.jobtemplate.mp4.480.mp4"
        ],
        "videosCount": 6,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Desert Essence Store",
            "link": "https://www.amazon.com/stores/DesertEssence/page/9A09AD80-7729-4619-BC78-C9FF930EBB80?ref_=ast_bln"
        },
        "brand": "DesertEssence",
        "merchantInfo": "SportingDoc",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 2870,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 20 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Australian Eco-Harvest Tea Tree Oil, known for its antiseptic qualities, is steam-distilled from Tea Tree plants indigenous to Australia and provides pure, plant-powered cleansing",
            "Cleanses skin leaving face feeling clean without stripping natural oils",
            "A perfect face wash gentle enough for every day use and all skin types",
            "Convenient pump Non-GMO NSF Verified, Gluten Free, Vegan, Cruelty Free"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Facial-Cleansing-Products/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060901"
            },
            {
                "name": "Washes",
                "link": "https://www.amazon.com/Facial-Cleansing-Washes/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7730193011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 2.5 x 2 x 7.5 inches; 1.16 Pounds"
            },
            {
                "name": "Item model number ‏",
                "value": "‎ 3255NDE-2"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 760488366356"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Desert Essence"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B00R1S8H7M"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,887 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #237 in Facial Cleansing Washes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 2,870 ratings"
            },
            {
                "name": "Item Form",
                "value": "facewash"
            },
            {
                "name": "Skin Type",
                "value": "Oily"
            },
            {
                "name": "Brand",
                "value": "Desert Essence"
            },
            {
                "name": "Scent",
                "value": "Tea Tree,Original"
            },
            {
                "name": "Material Feature",
                "value": "Organic, Natural"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/419d445a-565f-453e-a786-507c2605334a.__CR0,0,1200,360_PT0_SX600_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/457bb558-aa2f-4bca-8f7d-c1091d7c6338.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/251b4478-dccc-4c6f-b410-45e79bc1b56f.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/515112de-1466-44dc-85ee-9f846eeb3e27.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/61b274da-a986-4b0b-b621-81cf4746cc82.__CR0,0,1940,1200_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62ef1abb-2182-4b87-91ec-2f39d2c237b9.__CR0,0,1940,1200_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "MN Reviews",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUIXZ5DCEQQ6ZZYGTJYZI3OPSPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P9KMVI27V7MS?ASIN=B00R1S8H7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2018",
                "reviewTitle": "5.0 out of 5 stars The key to getting good skin (using only products available on Amazon Prime)!!!",
                "reviewText": "Okay, so I rarely if ever write long reviews and want to write out the first skincare system that I’ve found that actually works for me (using all products available on Amazon)—b/c I’m stoked (and blowing off work)! I’m 27 and have combination skin. I think my breakouts tend to be hormonal, with zits popping up in the middle of my forehead and chin, on/around my jaw, and on the sides of my face by my eyebrows. Also, my nose was a landmine of blackheads and huge pores, and I get really bad dark circles around my eyes.Product List:- Face Brush: Silicone Cleanser Waterproof Multifunctional Electric Facial Cleansing Brush (sold by Ailaiya), cost: $10First of all, if you don’t have one of these vibrating silicon face brushes, stop what you’re doing and get one. There are super expensive ones at Sephora, but I risked getting a knock-off one off Amazon from Ailaiya for $10 dollars, and I love it. It’s held up really well, and it can break/I can rebuy it literally 20 times before it’s the same cost as the Foreo Luna 2, which for some reason is $200 (HOW!!).I never used a silicon face brush before (I had a hair one for like 2 weeks and then it started to mold, so never again), but it’s awesome. My $10 dude is gets the job done and has literally all the features I can imagine a vibrating silicon face brush could need: bumpy (with different thicknesses), made of silicon, vibrates, comes with a cord for recharging (just make sure you close the charging hole in the back with the silicon plug when you’re washing your face so you don’t get water in it).Also, outside of exfoliating (the first time I used it, I could literally see where it had unplugged pores on my nose), it’s great b/c it’s fun to use. I wash my face way more thoroughly/regularly than I ever have in my life, and that in and of itself is a miracle, because I am a lazy person.Generally, I wet my face with water, then throw a dime-sized drop of cleanser on it, and go to town, making sure to try to get the cleanser to lather and getting in all the nooks and crannies around my nose and along the underside of my chin. I wash my face with this little guy for around a minute probably.Note: My mom taught me that when washing your face/applying any lotions, you should always try to go in an upward motion to fight against gravity. Idk if this is scientifically a thing (sounds like it’s not…), but my mom looks way younger than she is so I’m just trusting her on this one.——————————Step 1) Daily Cleanser: Desert Essence Thoroughly Face Wash (sold by SportingDoc). COST: $9This face wash is amazing. It’s 100% natural and allegedly organic (though to be honest, that’s just a plus b/c I’m sure I’ve put so many weird chemicals on my face in the past trying out different cleansers). It combines soap with a bunch of different oils—tea tree, coconut, olive, lavender, and peppermint—and extracts—Chamomile, Goldenseal, Awapuhi, Bladderwrack. It smells really good and kind of earthy.The tea tree in it is great, b/c it naturally is antimicrobial/fungal and anti-inflammatory, which basically treats what acne is: inflamed, bacteria-filled pores. I got this at the same time as the silicon brush, but I can say that this is the first time that my face has ever literally be *squeaky clean* after washing it. Also, I just literally don’t have breakouts anymore. Like no pimples. And my blackheads pretty much just disappeared off my nose, and my pores got clean and tight. Some cleansers when you switch to them, they make you break out, but I did not find that this was the case with this cleanser.Throw a dime-sized drop of cleanser on your lil electric brush. This soap doesn’t really lather as much as other cleansers I’ve used (maybe it’s b/c I’m using the electronic brush?). When I’m washing, it generally lathers up after like 15 seconds, and then as I keep washing, any bubbles that did come up disappear after like 45 seconds. After though, my skin feels *so* clean and fresh.Word of caution: DO NOT GET THIS IN YOUR EYES. It will suck. It will burn. However, because we are mostly adults here with fairly strong motor function skills, this is easy enough to avoid.—————————————Step 2) Face Serum: Vitamin C Serum with Hyaluronic Acid for Face & Eyes (sold by NaturalBeautyIc): COST: $20After I thoroughly rinse my face with warm water and pat it dry, I move on to the serum. I’m sure there are YouTube videos that tell you how to properly apply serums, but I honestly have no clue. I just take a drop or two (you do not need a lot, and a little goes along way), put it in my palm, then dab it around my face. Then, I rub the serum in with an *upward* motion (fighting against gravity) until my whole face is covered. I let it sit on my face for about a minute to absorb into my skin (normally, I brush my teeth in the morning during this time b/c #efficiency).Vitamin C is great for your skin b/c it’s necessary in creating collagen and can potentially prevent/treat UV damage. This serum also has Hyaluronic acid (helps bind moisture to the skin keeping it dewy and hydrated), vitamin E (helps reduce the appearance of acne scars/discoloration), aloe, and other goodies.I’ve found that this has significantly reduced the darkness of some of my longstanding acne scars, which is crazy b/c I’ve literally had them for years. Overall, it’s also just really improved my skin. My pores are WAY smaller, my skin is super moisturized, and I’ve also seen redness around my jaw minimize.—————————————(Optional) Eye Serum: Vitamin C Eye Gel For One Eye Bags Treatment (sold by SunBlessed Botanicals): COST: $23So I use this, but it’s kind of pricier. If you’re already using the Vitamin C Serum above, you’re already getting the benefits of Vitamin C and Hyaluronic acid (though this has Amino Acids and Licorice and some other things). However, I’ve found that this eye gel specifically has helped with dark circles/puffiness/wrinkles under my eyes and feels more targeted.I saw immediate improvement in the tightness of the skin under my eyes. My under-eye area was less puffy and spots where I could see wrinkles develop filled out. I’m fairly young so I don’t have that many wrinkles under my eyes yet, but it seems to have stopped them from getting deeper.For dark circles, this is product is more of a consistent improvement thing. I’m sure I’m always going to have some darkness under my eyes, b/c I am a human, and a human that gets very little sleep. For the dark circles, it steadily helps, but it’s not going to be like you put it on once and they’re gone. Also, while it’ll lighten the darkness all over, I found that the lightening was at first the most noticeable toward the outside/center of my eye, and slowly kept lightening overtime the skin under my eye closer toward my nose (where dark circles are the darkest).Once I let my face serum set (or if I’m impatient, toward the end of the time I’m giving it to set), I take a super small amount of this stuff and dab it under my eye. The box says you probably shouldn’t rub it in, so I try to avoid doing that, but I still do sometimes, b/c I’m also a human of habit.—————————————Day Moisturizer: L'Oreal Paris Futur-e Moisturizer Facial Day Lotion SPF 15, Normal to Dry Skin, 4.0 Ounce (sold by Amazon.com Services, Inc.), COST: $9I’ve been looking for a good day moisturizer for a while now. This stuff is great b/c it has SPF, which is really the main thing I want in a moisturizer, plus it has the added benefit of Vitamin E. It’s really lightweight and not greasy at all, so it doesn’t clog pores at all or feel heavy/thick on your face (I hate it when you put on a moisturizer and you can feel it on you for the rest of the day). It’s also wonderful because it gives my face almost a matte finish and minimizes, rather than adds to, shininess after the serums and stuff. It also makes my skin like baby soft. Like, my face is the softest and most supple it’s ever been.I generally just squirt a pump and apply after I’ve put on the face serum and the eye serum. A lot of times, I’m impatient so I’ll put it on when the eye serum is still setting, but that’s okay. Also, again, I make sure to rub in my moisturizer upward, rather than down, to fight against gravity.—————————————Night Moisturizer: Tree Of Life Retinol Cream Anti-Wrinkle Moisturizer with Hyaluronic Acid (sold by Flawless. Younger. Perfect), COST: $13Retinol is one of those buzzy face care terms right now, so I figured I’d try this out. This has Retinol and hyaluronic acid, plus jojoba, green tea, B5, and shea. It’s definitely heavier (though not greasy!) than the L’Oreal Futur-e moisturizer (though that moisturizer is just so lightweight that probably most moisturizers will be heavier than it), but that’s okay b/c I only use this Retinol cream at night.After you put it on, it’s crazy b/c you can actually feel it working. To be honest, sometimes it’s irritated my skin or kinda subtly burned after the fact, but not to the point where my face was visibly irritated in the morning. It feels like it tightens my skin and my pores and just makes my skin look and feel firmer (for example, I used to be able to see lil wrinkles across the bridge of my nose but they’re not really there anymore)—————————————TOTAL: $51 for the cleanser, serum, and day and nighttime moisturizer, plus the facial brush. The prices are really fair, and you get a good amount of product in each, which would take me at least 4 months to go through, if not longer. That’s like $15 dollars a month for four amazing skin care products, or 42 cents a day. Plus, throw in $10 for the vibrating silicon brush—which again, YOU MUST GET B/C IT IS A GAME CHANGER—and it’s $61 dollars, which I’m very down to pay and honestly a lot cheaper/better than the products I used to pick up from Clinique or grab from the drugstore, which never worked as well as this system does.Anyway, I’ve literally blown off an entire afternoon of work writing this, so I hope it helps. Also, I didn't receive a cent from any of these companies or free products, like some reviewers do. I'm just a happy customer with the best skin of her life! Cheers!",
                "reviewVotes": "217 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paulina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDBRSJH5SGDQMYQUFBPSUD6HJ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21OGMRMDCQ976?ASIN=B00R1S8H7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2020",
                "reviewTitle": "5.0 out of 5 stars Amazing vegan alternative to Cerave",
                "reviewText": "When I went vegan a year ago I did a lot of research trying to find an alternative to my non-vegan products, my (previous) holy grain face wash Cerave for normal to oily skin being the first thing. I have sensitive combination skin that leans more towards oily and finding the best face wash routine for me took years. I was scared and I felt hopeless because I didn't think I'd find my vegan holy grail face wash. This face wash proved me wrong and I honestly love it 10 times more than I did Cerave. I have been using it for a year now and a little goes a long way. I've only had to buy this twice, one bottle last a VERY long time. After I ran out of my first bottle I bought the two pack and I'm not even halfway done with the first bottle of the two pack.It cleans your skin without drying it out. If you have a small pimple it dries it out in a single DAY. I get intermittent pimples before my period (hormonal as I am on non-hormonal bc) and this just eradicates them. I don't wear a single drop of makeup in my daily life and my skin honestly looks great. There's no blemishes to cover up. I owe this all to Desert Essence and its' incredible power. I can't say that I've had the misfortune to get this in my eyes because I'm an adult that knows how to wash their face. I've also not gotten in my mouth so I can't attest to it making your tongue numb.This is also probably completely off-kilter but I use this face wash on my nether regions after I've shaved. Yes it stings but honestly maybe for about half a second. Tea tree oil is a natural astringent and its honestly kept me razor bump and ingrown hair free. As I wash my face in the shower applying this after I shave my nethers is just as easy as washing my face.Also in case you are interested my \"routine\" is really only this face wash, a charcoal sop bar, and a charcoal konjac sponge. I use the konjac sponge every night for gentle exfoliation but the charcoal sop bar and face wash twice a day (when I wake up and before I go to sleep).Stock. Up.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "EmmaR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFV3E2IIWARB4G6Z3DMNHE25BMXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVJO757JTOHIZ?ASIN=B00R1S8H7M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 5, 2023",
                "reviewTitle": "5.0 out of 5 stars The Best Face Wash",
                "reviewText": "I used this a long time ago but stopped for whatever reason. I have went back to it and it is by far the best face and body wash ever. I would recommend it for sensitive skin and oily skin as well. The scent is amazing and so is how it leaves your skin feeling and looking. Great ingredients, even better results",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJDLBUWVSBS7SP36WKTHS4M6CKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R199CIKCNCSSC1?ASIN=B00R1S8H7M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2021",
                "reviewTitle": "4.0 out of 5 stars Do not get this stuffs in your eyes!",
                "reviewText": "Well, it definitely smells like tea tree oil, & stings the eyes real bad just like tea tree oil too! It’s a good face wash & I’ve been using for years, but seems like they recently changed the formula or maybe my skin just isn’t responding the way it used too. Still good for sensitive oily skin, but doesn’t clear up my breakouts as well. Also, they really should change to a foam pump mechanism so the soap doesn’t come shooting out so fast - it’s very fluid, & way too easy to get it splashed in the eyes which hurts soooooo bad - would be much safer as a foam & shouldn’t have to change the formula, just the pump, but, I’ve actually told them that a few times over the years, & they never responded or changed it yet, so..... bottom line is that it’s a good face wash if y’all like tea tree oil - just be careful & keep out of reach from any kiddos 😉",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carraro danieleCarraro daniele",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 30, 2022",
                "reviewTitle": "Prodotto danneggiato",
                "reviewText": "Ho chiesto il rimborso appena ho aperto il pacco Amazon. Il dispenser ha disperso il prodotto nel suo sacchetto.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61qfywPXvhL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/614WE9BsbDL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61xcUpBb18L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pauline",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on April 7, 2021",
                "reviewTitle": "Très bon produit nettoie bien et non irritant.",
                "reviewText": "Usage quotidien pour nettoyer le visage deux fois par jour. Je me suis rendue compte qu’il démaquille aussi même le maquillage waterproof. J’en suis très contente et j’ai la peau moins grasse je en saurais dire si je le dois à ce seul produit ou à la combinaison avec le reste de ma routine mais je le rachèterai. J’ai testé un échantillon de nettoyant doux d’une grande marque de produits bio ou sélectionnés en soins de visage, bien plus cher et j’avais de légers picotements de la peau. Celui ci est bien meilleur.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MEGANO01 ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on July 19, 2020",
                "reviewTitle": "Limpieza profunda",
                "reviewText": "Es perfecto para pieles muy grasas o que necesitan una buena limpieza profunda. Cuidado con los ojos pues si entra pica bastante. Cunde mucho",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Kunde",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 5, 2020",
                "reviewTitle": "Waschgel für's Gesicht",
                "reviewText": "Das Produkt ist sehr angenehm auf der Haut benutze es erst ein paar Tage daher kann ich noch nicht genaueres sagen, für fettige unreine Haut geeignet.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "R. Smith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on July 16, 2023",
                "reviewTitle": "Great product",
                "reviewText": "Product is good, but the bottle is bad. It takes so much pressure to pump that it practically sprays the soap out.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$19.10",
                "sellerName": "LuxProdX",
                "sellerRating": "5"
            },
            {
                "price": "$19.10",
                "sellerName": "E-Health & Beauty",
                "sellerRating": "4.5"
            },
            {
                "price": "$20.25",
                "sellerName": "zard",
                "sellerRating": "5"
            }
        ]
    }
}