{
    "remaining_requests": 21522,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Body-Merry-Vitamin-Exfoliating-Cleanser/dp/B017OFVUKW",
    "body": {
        "name": "Body Merry Vitamin C Exfoliating Cleanser – Anti-Aging Face Wash with Jojoba Beads and Aloe –Brightening and Hydrating Facial Soap – Suitable for Sensitive Skin, 6 fl oz",
        "price": "$17.78$17.78 ($2.96$2.96 / FL Oz) $16.79$16.79 ($2.80$2.80 / FL Oz)",
        "originalPrice": "",
        "rawPrice": 17.78,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Body-Merry-Vitamin-Exfoliating-Cleanser/dp/B017OFVUKW",
        "soldBy": {
            "sellerID": "A37TSFORZAW7YY",
            "name": "Body Merry",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A37TSFORZAW7YY&asin=B017OFVUKW&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51vjEhKmt7L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/513Dk0NyfHL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41FfY3HQ97L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51ZRT rId4L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41EVvwcpvNL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51eDGsPDXpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41oJKj8xTaL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Body Merry Store",
            "link": "https://www.amazon.com/stores/BodyMerry/page/710EF8D9-938C-4F68-8756-32F564799005?ref_=ast_bln"
        },
        "brand": "BodyMerry",
        "merchantInfo": "Body Merry",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 935,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 8 hrs 7 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 16. Order within 8 hrs 7 mins",
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "10% VITAMIN C CLEANSER: Brighten skin and banish blackheads and blemishes with this cleansing face wash; 10% Vitamin C combines with exfoliating Jojoba Wax Beads to renew skin and deep clean pores",
            "NOURISH & HYDRATE: Start your morning with a refreshing citrus burst; this facial soap is ideal for teens through to aging skin, sloughing away dead cells and deeply moisturizing for natural radiance",
            "FOAMY LATHER: The translucent face wash transforms into a soft lather to cleanse away the day – this foaming facial wash gently removes dirt and impurities, leaving skin feeling clean and looking vibrant",
            "PACKED WITH LOVE: Our Leaping Bunny Certified cruelty free skincare is made in the USA using natural and organic plant based ingredients including Aloe, Jojoba Oil, Rose Hip Oil, MSM and Tea Tree Oil",
            "90 DAY HAPPINESS GUARANTEE: We want you to Get Happy About Your Skin! If you don't love our face scrub, we'll refund your purchase, no questions asked (no need to return the bottle)"
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b/ref=dp_bc_aui_C_1?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b/ref=dp_bc_aui_C_2?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b/ref=dp_bc_aui_C_3?ie=UTF8&node=11060711"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Facial-Cleansing-Products/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11060901"
            },
            {
                "name": "Washes",
                "link": "https://www.amazon.com/Facial-Cleansing-Washes/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7730193011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6 x 2 x 2 inches; 7.83 Ounces"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 650415394968 636225496610"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Body Merry"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B017OFVUKW"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#58,062 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #789 in Facial Cleansing Washes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 935 ratings"
            },
            {
                "name": "Item Form",
                "value": "Oil"
            },
            {
                "name": "Skin Type",
                "value": "Acne Prone,Oily,Sensitive"
            },
            {
                "name": "Brand",
                "value": "Body Merry"
            },
            {
                "name": "Scent",
                "value": "Tea Tree"
            },
            {
                "name": "Material Feature",
                "value": "Natural, Cruelty Free, Plant Based"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Body Merry Vitamin C Exfoliating Cleanser - With Jojoba Beads to Remove Dirt & Dead Skin and Nourishing Oils to Moisturize Deep Into Skin",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A37TSFORZAW7YY/B017OFVUKW/UqkTTVWyTZWC._UX970_TTW__.jpg"
                ]
            },
            {
                "media_text": "What It Is Gentle and natural Jojoba wax beads work to unclog pores by removing excess dirt and dead skin. Vitamins C, E and natural oils penetrate deep into skin delivering nutrients that keep skin looking vibrant, healthy and hydrated. With Natural and Organic Ingredients Like: Jojoba Wax Beads Organic Aloe Organic Olive Oil Clementine Essential Oil Tea Tree Essential Oil Organic Rosemary Extract Organic Red Clover Extract",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A37TSFORZAW7YY/B017OFVUKW/UkTjLRFNQKG._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "Who It's For Body Merry Vitamin C Exfoliating Cleanser is ideal for most skin types. It's perfect for anyone looking to address acne, blackheads, dry skin, and other common skin concerns. It's also the perfect daily facial cleanser to prevent many common skin maladies and keep your skin healthy and happy. Works Great For: Removing Excess Dirt and Grime Acne and Breakouts Clooged Pores Dry Skin",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A37TSFORZAW7YY/B017OFVUKW/1Yplv2YmSCaA._UX300_TTW__.jpg"
                ]
            },
            {
                "media_text": "Enhance Your Shopping Journey: Discover More Options with Our Comprehensive Product Comparison Chart",
                "media_link": []
            },
            {
                "media_text": "Enhance Your Shopping Journey: Discover More Options with Our Comprehensive Product Comparison Chart",
                "media_link": []
            },
            {
                "media_text": "Super C-22 Toner Super 6 Serum Super C-22 Moisturizer What is it? An alcohol-free and pH-balancing toner jam-packed with Vitamin C and Antioxidants that cleanses, protects, and hydrates all skin types. A super concentrated anti-aging serum that blends together six powerhouse active ingredients and minimizes the number of products needed to improve skin's appearance. A lightweight moisturizer loaded with 22% Vitamin C that nourishes and brightens dull, tired skin. Skin Concern Excess Dirt, Grime, & Makeup, Enlarged Pores, Dullness, Dryness, Unbalanced Skin. Preventative Anti-Aging, Fine Line and Wrinkles, Age or Sun Spots, Hyperpigmentation, Uneven Skin Tone and Texture, Breakouts. Dullness, Redness & Inflammation, Hyperpigmentation, Sun Damage, Fine Lines. Key Ingredients Vitamin C, MSM, Colloidal SIlver, Witch Hazel, Enzymes, Organic Plant Extracts and Oils. 22% Vitamin C, 2.5% Retinol, Niacinamide, CoQ10, Hyaluronic Acid, Astaxanthin, Centella Asiatica, Organic Green Tea. Vitamin C, CoQ10, Niacinamide, Botanical Hyaluronic Acid, Green Tea, Organic Aloe. Usage For All Skin Types - Use up to 2x Daily after cleansing to enhance serum and moisturizer application. It can also be used to refresh skin and remove excess shine. For Most Skin Types - Apply 2-4 drops 1x Daily. Build up usage to 2x Daily. Highly recommended to use in conjunction with an SPF to protect newly produced skin cells. Makes a great, non-greasy day cream for All Skin Types. It can also be used at night for Combination, Blemish Prone, or Oily Skin Types.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A37TSFORZAW7YY/B017OFVUKW/UqkTTVWyTZWC._UX970_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A37TSFORZAW7YY/B017OFVUKW/UkTjLRFNQKG._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-seller-content-images-us-east-1/ATVPDKIKX0DER/A37TSFORZAW7YY/B017OFVUKW/1Yplv2YmSCaA._UX300_TTW__.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/36f24318-254d-47e1-a01e-c98ef512bf54.__CR148,0,304,608_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/59e245ed-b284-4323-a3b0-f577f4c3b928.__CR0,3,203,406_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7569a9bb-29c8-4a18-9386-5154a072deb5.__CR44,0,275,550_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "DJ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3MLJD7UOMM4JBSURUQU7NRJ7OA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F6AUXOQ08HF3?ASIN=B017OFVUKW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 19, 2016",
                "reviewTitle": "5.0 out of 5 stars Review for 10% Vitamin C Cleanser, Super C-22 Toner, Super C-22 Moisturizer, and Neck Firming Cream",
                "reviewText": "While I enjoy being 55 years old, I will fight the “signs” of aging until my dying breath, LOL! In my quest to maintain an appearance more in line with my personality rather than my biological years, I have tried just about everything – and I mean everything – from some of the more expensive products on the market (expensive to me, anyway, including Elizabeth Arden’s Prevage and Ceramide, and Estee Lauder’s Advanced Night Repair) to some relatively inexpensive products (such as Olay’s Regenerist).I recently read an article touting the benefits of topical Vitamin C, so I bought a bottle of Vitamin C serum to add to my daily skincare regimen; first applying the Vitamin C serum, then adding whatever moisturizer I happened to be enthralled with at the moment (using the Vitamin C serum without a follow-up moisturizer left my skin feeling a little tight.) No matter what moisturizer I was using, the addition of Vitamin C seemed to make an improvement in my skin tone. I began looking for a one-step method to get the benefits of both Vitamin C and moisturizer; and lo and behold, I discovered Body Merry!The first product I tried was the Super C-22 Moisturizer. I absolutely LOVE this product! It is so lightweight and absorbs effortlessly, and my skin is softer and smoother than ever before. To be effective, topical Vitamin C has to have a concentration of at least 20% (or so I’ve read); Body Merry has a concentration of 22% In addition, it contains hyaluronic acid, which helps your skin retain moisture; and green tea, which helps repair skin. Plus, it smells pretty terrific!Next, I tried the Neck Firming Cream. I’d tried Revision Nectifirm in the past (I told ya I’ve tried just about everything!), so I had some idea of what I was looking for in the Body Merry Neck Firming Cream: This was just as good, or even better! The ingredients include Vitamin C (although not as highly concentrated as in the moisturizer) and hyaluronic acid, but has the additional benefits of Royal Jelly (which caught my attention!) and other natural ingredients. I don’t think the fragrance is particularly pleasant – not nearly as pleasant as the moisturizer – but it’s not bad, and it quickly dissipates. The cream is also a little thicker than the moisturizer, but still absorbs completely into my skin.Body Merry claims you can use the Neck Firming Cream as an allover facial moisturizer – so my new beauty regime is to use the Super C-22 Moisturizer in the morning and the Neck Firming Cream (on my face, neck and chest) in the evenings. I am one of those dumb-dumbs who, in her teens, worshipped the sun religiously; I can tell you honestly that I’ve seen a real improvement in the texture and tone of my décolleté.After the success of those two products, I decided to try the 10% Vitamin C Cleanser. I generally use mild, non-soap cleansers such as Neutrogena and Cetaphil, and I’m generally happy with them. But I was surprised at how much MORE I liked the Body Merry 10% Vitamin C Cleanser. The first thing I noticed was the wonderfully aromatic fragrance, then I was pleased at how well it lathered. The cleanser contains GENTLE jojoba beads, which provide a GENTLE exfoliating action; so gentle in fact that I was not afraid to use it near my eyes (which I would NEVER do with exfoliating cleansers that use things like finely-ground walnut shells). Lastly, it rinsed away thoroughly, with no phantom residue, leaving my face feeling very clean, refreshed, and not at all “tight.”The last product I tried was the Super C-22 Toner. I am normally not a “toner” person (except when I’m feeling super-lazy and use a toner to clear my skin instead of washing my face like I should!), but I loved everything else I tried so far, so I definitely wanted to give this a try. I was not disappointed! After showering in the morning (I did not use any of the Body Merry products during my morning shower; hmmm, I’ll have to check out their OTHER products, LOL!), I used the Super C-22 Toner on my face. LOVED it! My face felt completely clean and refreshed, with no tightness whatsoever. So now I use it in my evening regime, as well.This former “beauty product junkie” is now totally committed to using the complete line of Body Merry products! The only little “bug-a-boo” I have is their packaging. While it has NOTHING WHATSOEVER to do with the actual product, I think the older packing is much more professional looking; the newer packaging has newer, “hipper” lettering that looks as if it’s trying to appeal to a younger crowd – but maybe I’m just “old fashioned!”",
                "reviewVotes": "132 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nidus Productions",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGDM6HPU7AVBSA7YDV6VD4MHZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SOPKIAANH82U?ASIN=B017OFVUKW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2016",
                "reviewTitle": "5.0 out of 5 stars AWESOME CLEANSER... ALSO HELPS WITH ECZEMA!",
                "reviewText": "I found this stuff when my previous cleanser became unavailable. It was no big deal, because I knew I needed something better anyway. When the soap I was previously using on my body, which was fine initially, started becoming a bit too harsh for me, I decided to give washing my body with this stuff a try... and I'm so very glad I did. It really does get rid of impurities, and makes your skin very clean. Here is my shower routine if anyone with eczema wants to try it.1) Scrub with the facial soap (Body Merry Vitamin C) and a soft shower brush. Rinse thoroughly.2) Wash skin again with a paste of baking soda and water to remove any residue from cleanser, and rinse thoroughly.3) Follow your shower with Yuskin I (ユースキンアイ), a Japanese moisturizing cream for itchy skin. The lotion works well, too. I like to add a couple drops of essential Tea Tree oil to the cream before I apply.This routine has kept my skin free of rashes since I started it, for the most part. The moisturizer is also available on Amazon. I have also switched to a whole food vegan diet in recent weeks, and I think that is also a contributing factor in helping to completely clear my skin up. Just FYI. I hope my sharing my product trials helps someone else to find relief.Erin H. for Nidus ProductionsP.S. I know it's a bit pricey to wash with a facial soap, but when you're desperate enough for relief, you'll try just about anything. What you can do to save a bit of cash is wash with the Neutrogena Transparent Facial Bar (Fragrance Free) in place of the Body Merry Vitamin C Cleanser most days of the week, and only use the Body Merry one, on your body, 2 to 3 times per week. I still scrub with the Vitamin C cleanser on my face every day, but alternate on my body with the cheaper one. Oh, how I wish the Vitamin C cleanser came in a bigger size! FYI, the Neutrogena Transparent Fragrance Free bar is also available on Amazon, is less than $5, and will last for a while if you keep it out of the water when not in use... it melts. Anyway, I can't recommend the Vitamin C Cleanser and the Yuskin I (ユースキンアイ) cream more highly. Happy Cleansing! Xoxo",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jan Jan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJ5UB6ENYBPP3PSJU7RR76ZOF6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38X4ZNIL25YDN?ASIN=B017OFVUKW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 22, 2017",
                "reviewTitle": "5.0 out of 5 stars Second Time",
                "reviewText": "I normally don't write a second review on a product. I find that if I don't initially like a product but give it a second chance, the results are still the same. Likewise, if I re-purchase a product that I did like, it didn't disappoint. However, rarely do I use a product again and it impresses me even more. That is the case with this face wash.After purchasing this product, when I went to re-order, it was either out of stock or it would have taken too long to obtain. This product, in conjunction with a cleansing routine I created, really made a difference to my skin. Therefore, I felt the amazing results were a product of the routine as a whole and not due to one particular facet. I am pretty confident I was wrong with that assessment.When I was not able to obtain the cleanser in a timely fashion (based on my time table), I tried a similar product (making sure it had the Vitamin C component). That product was pretty good, but I noticed my face wasn't quite as vibrant or had that luminosity. I did not think it could be the cleanser that was really making the difference because the other products are top notch. Still, when I saw that it was back in stock, I re-ordered. After only two uses, the vibrancy, smoothness and clarity was back, and that was with only utilizing 2 of my 4 step cleansing process. I kid you not. The 180 to how my face looked really surprised me.Considering this is not an overly expensive cleanser (but even if it was) I would HIGHLY recommend this cleanser.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}