{
    "remaining_requests": 21823,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Neutrogena-Power-Cream-Salicylic-Treatment-Acne-Prone/dp/B001410OG4",
    "body": {
        "name": "Neutrogena Oil-Free Acne Stress Control Power-Cream Face Wash with 2% Salicylic Acid Acne Treatment Medication, Soothing Daily Acne Facial Cleanser for Acne-Prone Skin Care, 6 fl. oz",
        "price": "$27.84$27.84 ($1.55$1.55 / Fl Oz) $24.91$24.91 ($1.38$1.38 / Fl Oz)",
        "originalPrice": "$36.27",
        "rawPrice": 27.84,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Neutrogena-Power-Cream-Salicylic-Treatment-Acne-Prone/dp/B001410OG4",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "27",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51IWihWdJdL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41UuFfIar6L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31aEdqk0uML.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41eFvrrtqeL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31eV3n5wb9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31OPKVVBnrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31 ewN8cxiL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Neutrogena Store",
            "link": "https://www.amazon.com/stores/Neutrogena/page/3BC8CF14-3F35-41A4-9BF3-705A7FB2B6B6?ref_=ast_bln"
        },
        "brand": "Neutrogena",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 974,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Tuesday, February 20 on orders shipped by Amazon over $35. Order within 21 hrs 31 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "4.2-fluid ounce tube of Neutrogena Oil-Free Acne Stress Control Power-Cream Face Wash with salicylic acid acne medicine, for healthier looking skin",
            "Daily oil-free face wash gently cleanses and fights breakouts. Salicylic acid acne medicine helps to unclog congested pores and help get rid of pimples, even before breakouts emerge",
            "Facial cleanser formulated with salicylic acid acne medicine, a proven acne-fighting ingredient to help clear acne and MicroClear Technology, a technology shown to boost delivery of acne treatment to the source of breakouts",
            "Creamy face wash formula with skin-soothers, including cucumber and green tea, to help soothe redness and irritation caused by acne, leaving skin soft and smooth",
            "For best use, wet face & apply cream wash by massaging face, gentle enough for daily use. Formulated by a Dermatologist Recommended Brand and designed for sensitive and acne-prone skin"
        ],
        "description": "Product Description Fight breakouts with Neutrogena Oil-Free Acne Stress Control Power-Cream Face Wash. Designed for daily use, this creamy face wash helps clear oil instantly, fight breakouts, and reduce redness and irritation caused by acne. This advanced, dermatologist-tested formula even helps treat acne before it emerges. It contains maximum strength salicylic acid acne medicine and Micro-Clear technology, a powerful technology scientifically shown to boost delivery of salicylic acid to unclog congested pores and speed treatment deep to the source of breakouts. This cream facial cleanser is also formulated with specially selected skin-soothers, including green tea and cucumber. This powerful facial cleanser works hard every day to make acne one less stress in your life. Amazon.com Power-Cream WashAt a Glance:Treats acne even before it emergesMicroClear technologyWith cucumber and green-tea extractClick to learn more.Helps Stop Acne Before It EmergesSee amazingly clear skin with Oil-Free Acne Stress Control Power-Cream Wash, a silky, creamy cleanser that clears surface oil instantly, fights breakouts, and reduces breakout redness and irritation for exceptionally soft, clearer skin.Make Acne One Less StressNeutrogena Oil-Free Acne Stress Control Power-Cream Wash is so advanced it treats acne even before it emerges with the use of MicroClear, a powerful technology clinically proven to boost the delivery of acne medicine to unclog congested pores and speed treatment deep to the source. Help break the cycle of acne stress with this simple, easy-to-use creamy face wash that works hard every day to give you the clear skin you've been looking for.Neutrogena Oil-Free Acne Stress Control products are designed to help you fight acne where it starts, while actively reducing the irritation and redness associated with breakouts. Acne Stress Control is so advanced, it treats acne even before it emerges.Breakout Less, Stress LessWhile treating acne at the source is the key to long-term prevention, addressing the visible signs of irritation can be just as important in getting the great-looking skin you want. Using naturally-derived skin-soothers specially selected for acne-prone skin, including cucumber and green tea extracts, Oil-Free Acne Stress Control products leave skin feeling soft while actively reducing breakout redness and irritation. MicroClear TechnologyHelp outsmart acne with MicroClear, an exclusive technology that is clinically proven to boost the delivery of acne medicine to help unclog congested pores. With powerful dissolving agents, MicroClear breaks though oil and dirt and helps clear the way for acne medicine to get to the source of your breakouts, even before they appear.How to UseWet face and apply by massaging face gently, avoiding contact with the delicate eye area. Rinse thoroughly.What's in the BoxNeutrogena Acne Stress Control Power-Cream Wash, Pack of Three. Explore the Oil-Free Acne Stress Control Line of Products:Power-Clear Scrub Clears, softens, and gently exfoliates to leave skin smooth. Soothing, calming ingredients help reduce breakout irritation and prevent over-drying.Power-Cream Wash A silky, creamy cleanser that clears surface oil instantly, fights breakouts, and reduces breakout redness and irritation for exceptionally soft, clearer skin.Triple-Action Toner Helps stop acne before it even emerges with a refreshing, multi-tasking toner that works in three ways for clearer, shine-free skin.Power-Foam Wash Advanced wash that treats acne even before it emerges. It cleans deep into pores, clears surface oil instantly, and fights breakouts while reducing breakout redness and irritation.Night Cleansing Pads Treats acne even before it emerges. These easy-to-use pads conveniently sweep away pore-clogging oil and makeup and can be used in place of a regular rinse-off cleanser at bedside or whenever you can't get to a sink.3-in-1 Hydrating Acne Treatment Utilizing powerful MicroClear technology, this treatment works three ways for clearer, ultra-soft skin: treats acne even before it emerges, hydrates and softens skin, and reduces redness and irritation caused by breakouts.Power-Gel Cleanser This powerful gel cleanser is so effective, it helps stop emerging acne in just one day. Unique formula with green tea and cucumber reduces redness and irritation caused by breakouts.Trademark Information:Neutrogena®Oil-Free Acne Stress Control®MicroClear®",
        "breadCrumbs": [
            {
                "name": "Beauty & Personal Care",
                "link": "https://www.amazon.com/Beauty-Makeup-Skin-Hair-Products/b?ie=UTF8&node=3760911"
            },
            {
                "name": "Skin Care",
                "link": "https://www.amazon.com/Skin-Body-Face-Products/b?ie=UTF8&node=11060451"
            },
            {
                "name": "Face",
                "link": "https://www.amazon.com/Face-Skin-Care-Lotion-Products/b?ie=UTF8&node=11060711"
            },
            {
                "name": "Cleansers",
                "link": "https://www.amazon.com/Facial-Cleansing-Products/b?ie=UTF8&node=11060901"
            },
            {
                "name": "Washes",
                "link": "https://www.amazon.com/Facial-Cleansing-Washes/b?ie=UTF8&node=7730193011"
            }
        ],
        "productInformation": [
            {
                "name": "Is Discontinued By Manufacturer ‏",
                "value": "‎ No"
            },
            {
                "name": "Product Dimensions ‏",
                "value": "‎ 6.6 x 2.1 x 1.8 inches; 1.17 Pounds"
            },
            {
                "name": "UPC ‏",
                "value": "‎ 701119101977 070501053409"
            },
            {
                "name": "Manufacturer ‏",
                "value": "‎ Johnson & Johnson"
            },
            {
                "name": "ASIN ‏",
                "value": "‎ B001410OG4"
            },
            {
                "name": "Country of Origin ‏",
                "value": "‎ USA"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#26,401 in Beauty & Personal Care (See Top 100 in Beauty & Personal Care) #409 in Facial Cleansing Washes"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 974 ratings"
            },
            {
                "name": "Item Form",
                "value": "Cream"
            },
            {
                "name": "Skin Type",
                "value": "Sensitive"
            },
            {
                "name": "Brand",
                "value": "Neutrogena"
            },
            {
                "name": "Scent",
                "value": "Cucumber"
            },
            {
                "name": "Material Feature",
                "value": "Gluten Free"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "At a Glance: Creamy formula with Salicylic Acid Microclear Technology Helps reduce redness and irritation Oil-free face wash Neutrogena Oil-Free Acne Stress Control Power-Cream Face Wash See amazingly clear skin with Neutrogena Oil-Free Acne Stress Control Power-Cream Face Wash, a silky, creamy cleanser that clears oil instantly, fights breakouts, and reduces redness for a soft, clearer skin. Neutrogena Oil-Free Acne Stress Control Power-Cream Face Wash is so advanced, it treats acne even before it emerges. It’s formulated with Microclear, a powerful technology which is scientifically shown to dissolve oil and help boost delivery of salicylic acid to the source of breakouts.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/d7079430-2b02-4b53-8a1b-93bbf8e51bb2._SR285,285_.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/810041a2-71a1-4040-9e33-b312594d4499._SR230,100_.jpg"
                ]
            },
            {
                "media_text": "Make acne one less stress Neutrogena Oil-Free Acne Stress Control is designed to help you fight acne where it starts, while actively reducing the irritation and redness associated with breakouts. Neutrogena Oil-Free Acne Stress Control is so advanced, it treats acne even before it emerges. Breakout less, stress less While treating acne at the source is the key to long-term prevention, addressing the visible signs of irritation can be just as important in getting the great looking skin you want. Neutrogena Oil-Free Acne Stress Control products, with skin-soothers specially selected for acne-prone skin, including cucumber and green tea extracts, leave skin feeling soft while addressing irritation.",
                "media_link": []
            },
            {
                "media_text": "Make acne one less stress Neutrogena Oil-Free Acne Stress Control is designed to help you fight acne where it starts, while actively reducing the irritation and redness associated with breakouts. Neutrogena Oil-Free Acne Stress Control is so advanced, it treats acne even before it emerges. Breakout less, stress less While treating acne at the source is the key to long-term prevention, addressing the visible signs of irritation can be just as important in getting the great looking skin you want. Neutrogena Oil-Free Acne Stress Control products, with skin-soothers specially selected for acne-prone skin, including cucumber and green tea extracts, leave skin feeling soft while addressing irritation.",
                "media_link": []
            },
            {
                "media_text": "Directions 1. Clean face twice a day 2. Wet face and squeeze cleanser into hand 3. Apply to face and massage gently, avoiding contact with the delicate eye area 4. Rinse thoroughly",
                "media_link": []
            },
            {
                "media_text": "About Neutrogena Brand Neutrogena is a brand of the Johnson & Johnson Consumer Inc. The dermatologist recommended skincare brand, Neutrogena offers some of the world's most loved beauty and skin care lines, and manufactures and markets products in over 70 countries.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/250b8a78-354a-4db7-aa25-c96443d9845d._SL300__.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/d7079430-2b02-4b53-8a1b-93bbf8e51bb2._SR285,285_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/810041a2-71a1-4040-9e33-b312594d4499._SR230,100_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/250b8a78-354a-4db7-aa25-c96443d9845d._SL300__.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shefele",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKCUNW2E7ZB7I33TKVS43NZVWOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ROZ788R5ZILC?ASIN=B001410OG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2022",
                "reviewTitle": "5.0 out of 5 stars Tried many different ones and this was the only one that didn't irritate my rosacea",
                "reviewText": "I once randomly saw this suggested by a youtuber who raved about it so I decided to give it a try. Every other face wash I tried irritated my rosacea and dried out my skin. I was thrilled with this from the first time I tried it. It's gentle, smells nice and doesn't irritate or dry out my skin at all. I haven't used any other face wash since I started using it roughly 12 years ago, and since my kids have been old enough to use face wash, they've also used only this. It's a keeper!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Catherine O'Neil",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBI4AGMBBQW2N2UCKL7YIGKX6WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A744XJ8MO930?ASIN=B001410OG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2021",
                "reviewTitle": "5.0 out of 5 stars Affordable and actually works!",
                "reviewText": "My daughter and swear by this product line. We were so happy to find a face cleanser that is affordable and actually works on acne! Our faces cleared right up from the “maskne”. We tried so many expensive products at Sephora that did not work as well as this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Loulou",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSFP4DY22TOXSDWTJ6QFTAZD4YQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10ARBET09G5LC?ASIN=B001410OG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 25, 2023",
                "reviewTitle": "5.0 out of 5 stars My face wash",
                "reviewText": "I have used to his face wash for years and I plan to o use it for many more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jojo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWWHQCX7GFET6DSRWHE6BIQ6R7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G684TJJF9P3Q?ASIN=B001410OG4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Short expiry",
                "reviewText": "I like the product. However, they were supplied with a short expiry of about four months, which I think is not fair given the quantity purchased.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kayla reilly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH723WRLZDBHAZOR56EUO6BEMPOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP26DI9PQL08Z?ASIN=B001410OG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2023",
                "reviewTitle": "5.0 out of 5 stars My holy grail",
                "reviewText": "This has been my holy grail for years. Once I run out I immediately start breaking out. Game changer for stress or hormonal acne.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AECDLUROXNALNOHU5PYYFWYX4UUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIHI3G3CUZUWP?ASIN=B001410OG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 21, 2018",
                "reviewTitle": "5.0 out of 5 stars A life changing product",
                "reviewText": "I have been battling acne since my teen years. I've tried all sorts of cleansers and acne treatments but none worked well.This is the only product that works well for me and I have been using it for the past 10+ years. Other Acne Stress Control products are also great!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wesley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN6P536QOSICO6DZ75CRS2YE74Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JBRQEXW0HG93?ASIN=B001410OG4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2021",
                "reviewTitle": "5.0 out of 5 stars Replacement for the 3 in 1?",
                "reviewText": "I have been using the Neutrogena 3 in 1 for most of my life but unfortunately it looks like it got discontinued. This stress control cream seems to clear up acne and clean up my skin just like its 3 in 1 that they use to have. I will keep using this for my acne.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXY6YLU6GFT7X56Y5CAKAWNIRRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R264FEYJJYKXLL?ASIN=B001410OG4",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "1.0 out of 5 stars SCAM - FALSE PHOTO ADVERTISMENT",
                "reviewText": "Only one bottle comes in a package and returns are not accepted, false photo advertisement!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana E. Romo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 8, 2019",
                "reviewTitle": "Disminuye el acné",
                "reviewText": "Mi hija lo utiliza, controla y disminuyó el acné",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente de Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 26, 2019",
                "reviewTitle": "No me funciono. Tristemente",
                "reviewText": "Edito: después de 2 semanas de uso tal como dice el empaque no he visto mejoría y al contrario ya vi que vienen varios brotes nuevos. Lo único que hace años me funciono fue PROACTIVE pero ya no lo venden en Mexico así que veré si lo consigo pero tristemente aunque confiaba en este producto no sirvió y no sé qué haré con 3 botes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$29.00",
                "sellerName": "DesignsbyAng",
                "sellerRating": "4.5"
            },
            {
                "price": "$29.00",
                "sellerName": "Beandfit",
                "sellerRating": "5"
            },
            {
                "price": "$29.31",
                "sellerName": "Cire Industries",
                "sellerRating": "4.5"
            }
        ]
    }
}