{
    "remaining_requests": 85,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lucid-Inch-King-Mattress-Box/dp/B0864N2N6M",
    "body": {
        "name": "Lucid 14 Inch King Mattress – Plush Memory Foam Mattress – Bamboo Charcoal Foam – Gel Infused – Hypoallergenic Foam Mattress– Bed-In-A-Box- CertiPUR-US Certified, White",
        "price": "$649.99",
        "originalPrice": "",
        "rawPrice": 649.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lucid-Inch-King-Mattress-Box/dp/B0864N2N6M",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B08QTS3L85"
        ],
        "asinVariationValues": [
            {
                "asin": "B0864MM5VL",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864N266S",
                "variationName": "Size",
                "variationValue": "Twin XL",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864N2N7H",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864N2TYK",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864N2N6M",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864N8WB7",
                "variationName": "Size",
                "variationValue": "California King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "Split King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864MLBWN",
                "variationName": "Style",
                "variationValue": "Medium",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864N2N6M",
                "variationName": "Style",
                "variationValue": "Plush",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0864N2N6M",
                "variationName": "PatternName",
                "variationValue": "Mattress Only",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B08NDJDD4P",
                "variationName": "PatternName",
                "variationValue": "Mattress and Adjustable Base",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51hqM1JYpxL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41rOdEZlFpS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51U4yukfMhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41kQEwpX9kS.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XN4oszTzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41frv4J1lLL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41v-QOezb2L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the LUCID Store",
            "link": "https://www.amazon.com/stores/Lucid/page/73AAE19B-2B34-4B07-B027-1D56CCCB9FD5?ref_=ast_bln"
        },
        "brand": "Lucid",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 4405,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 17 hrs 43 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "GENERAL NOTE: Please allow 24 - 72 hours for your mattress to regain its full shape, any memory foam will expand faster in a warmer room; the expansion time of the mattress will vary as per the surrounding.Care Instructions: ‎Hand Wash Only",
            "PLUSH FEEL: This Lucid mattress provides a plush feel ideal for side sleepers who love the soft hug of memory foam",
            "MEMORY FOAM: A 2-inch layer of latex-like foam, 2-inch layer of gel-infused responsive memory foam, 3-inch layer of transition foam, and 7 inches of bamboo charcoal base foam provide a plush support",
            "BAMBOO CHARCOAL: Bottom layer contains hypoallergenic properties with a bamboo charcoal foam to help maintain freshness and reduce odors",
            "PLACE IN ANY ROOM: Fits primary bedrooms, slatted bed frames, grid-style platforms, and platform beds",
            "MATTRESS IN A BOX: Good sleep can’t wait. This is why we’ve designed all our Lucid mattresses to be compressed, rolled, and shipped in one box for easy delivery and setup; simply unbox, unroll, and wait 24-72 hours for the mattress to expand"
        ],
        "description": "At Lucid, we make beds for the whole family—because when you wake up feeling your best, your family gets the best version of you too. The Lucid 14-Inch Gel Memory Foam Plush Mattress is a great choice for primary bedrooms and side sleepers. Made to perfectly fit, the King mattress will match any King bed frame. A 2-inch layer of latex-like foam, a 2-inch layer of gel-infused memory foam, a 3-inch layer of transition foam, and a 7-inch layer of high-density support foam provide a plush feel. The gel memory foam layer helps regulate body temperature. Plus, the bamboo charcoal infusion help keep your beds smelling fresh thanks to its natural hypoallergenic properties. Comfort awaits.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "‎90.7 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "79\"L x 75\"W x 14\"Th"
            },
            {
                "name": "Item model number",
                "value": "‎LU14KKPL50AF"
            },
            {
                "name": "ASIN",
                "value": "B0864N2N6M"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 4,405 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#73,082 in Home & Kitchen (See Top 100 in Home & Kitchen) #224 in Mattresses"
            },
            {
                "name": "Date First Available",
                "value": "March 19, 2020"
            },
            {
                "name": "Size",
                "value": "King"
            },
            {
                "name": "Special Feature",
                "value": "Hypoallergenic, Pressure Relief, Breathable, Low Motion Transfer"
            },
            {
                "name": "Fill Material",
                "value": "Foam, Gel Memory Foam, Memory Foam"
            },
            {
                "name": "Brand",
                "value": "LUCID"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Coil Type",
                "value": "Encased Coil"
            },
            {
                "name": "Model Name",
                "value": "Lucid 14 Inch Gel Memory Foam Mattress – Plush Feel – Gel Infusion - Hypoallergenic Bamboo Charcoal – Breathable Cover See more"
            },
            {
                "name": "Product Benefits",
                "value": "Crafted with soft, cooling, hypoallergenic, moisture-wicking materials, this premium mattress ensures ultimate night's sleep by offering pressure relief and enhanced breathability. See more"
            },
            {
                "name": "Product Care Instructions",
                "value": "Do not wash. Do not use bleach. Do not machine dry. Do not iron. Do not dry clean., DO NOT REMOVE OR WASH COVER: Spot clean only, vacuum your mattress, sprinkle some baking soda on it. Use a scrub brush to gently rub the powder into the mattress and leave it for 10 minutes and vacuum the excess powder. See more"
            },
            {
                "name": "Item Firmness Description Plush",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Memory Foam",
                "value": "Item Weight 90.7 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Ventilated for Breathability The ventilated design increases airflow through the memory foam layer, helping to create a breathable and comfortable sleep environment. Shipped Compressed LUCID mattresses are compressed, rolled and shipped in an easy-to-manage box for convenient shipping and simple setup. Certi-PUR Certified This product is certified to the highest performance and safety standards to ensure uncompromising comfort and protection for your family.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/abc14f88-2818-4741-b996-d0cdeb777ead.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/cc6490c3-3150-4841-b573-55ce202d3f69.__CR0,0,300,300_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/vc/0f845382-806b-4c5c-b640-ef8aff582037.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "LUCID 14\" Plush LUCID 14\" Medium LUCID 12\" Hybrid LUCID 16\" Memory Foam & Latex Height 14\" 14\" 12\" 16\" Feel Plush Medium Medium-Plush Plush Layers 7\" bamboo charcoal base foam, 3\" transition layer, 2\" gel memory foam, 2\" latex-like top layer 9\" bamboo charcoal base foam, 3\" transition layer, 2\" gel memory foam top layer 6.5\" individually encased steel coils, 2\" Support foam, 3.5\" bamboo charcoal and aloe vera top layer 10\" base foam, 2\" natural latex, 3\" gel memory foam, 1\" bamboo charcoal foam Materials All foam All Foam Hybrid All Foam",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/0f55624b-e6db-4456-a66e-478f66989851.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3acf0f01-12c6-49b8-9286-49a4731b0dba.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/2d4ea158-e1dd-4dc6-8354-ff0c261cb457.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/abc14f88-2818-4741-b996-d0cdeb777ead.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cc6490c3-3150-4841-b573-55ce202d3f69.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0f845382-806b-4c5c-b640-ef8aff582037.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/ddaefb71-2865-4b87-96e7-82715211e640.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/6210542c-d62c-41ab-978b-a1735f2ed99b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/0c376e31-706f-4863-9ef6-2d3a61ef720b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/d37461d1-06ba-47fc-a771-4c62d4871117.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sunshine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIUVOV2B635QDEUFDH7P2DG2SZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3B1SSWC791GTR?ASIN=B0864N2N6M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2018",
                "reviewTitle": "5.0 out of 5 stars Fibromyalgia vs Lucid: An in-depth review",
                "reviewText": "Note to reader: This is an in depth review. I hope it helps in your search.For about a year, I have been conducting online research on mattresses waiting for the day when we could finally purchase new mattresses. I concluded that Talalay latex would likely be the best since I have a severe case of fibromyalgia. We went to our local mattress store to try one out. The three layer wasn’t soft enough. The four layer was better but not “it.” However, anything was a vast improvement on our now 16 year old mattress with its his and her respective ditches. I planned to buy online, but out of curiosity I asked the clerk how much it cost. Good thing we both were lying down at the time. Over $3500! Online prices started around $1500, much better but still a crazy price to me as I would need to add a foundation, sheets, etc. and do that times two since my husband and I sleep in separate bedrooms out of physical necessity. I figured we needed to save at least $4,000 for both of us to get new mattresses, which I could not wrap my head, nor my budget around.Six months later, my body was screaming for a new mattress. One day, we stopped at a different mattress shop to try out a memory foam mattress. I preferred the feel of the memory foam to the latex. Again, I asked how much. Again, we were glad we were lying down. They were having a sale: Queen size reduced from $1800 to $1299. I calculated about $3000++ for both of us to get fully situated, which was still a crazy price. I returned home and started round two of research.I searched “mattress” and “fibromyalgia” to help narrow my search. I went to Amazon and found Lucid and reviewed all of their mattresses. I watched a YouTube video about the 14 inch gel foam memory mattress by Goodbeds.com (I also watched Goodbeds video reviews of competitors) and felt that the Lucid 14 inch gel memory foam was the standard by which to compare all others. I took Goodbeds test to help narrow down likely best mattresses for me, which included questions about health issues and specifically fibromyalgia. They generated a list of mattresses that would support a side sleeper with fibromyalgia. The Lucid 14 inch gel memory foam was one of their top recommendations for me.In the Goodbeds video, they described the top 5 inches of foam as “premium comfort materials.” And they gave the density for each layer.Layer 1: 5.3 lbLayer 2: 3 lbLayer 3: 1.6 lbFurther research about density confirmed Goodbeds statement of “premium comfort materials.Out of curiosity I researched the competitor’s foam densities.T&N. Layer 1: 2.8. Layer 2: 1.8Dream Foam: Layer 1: 4, Layer 2: 2.5, Layer 3: 1.8Novabed, Casper, Nectar, Loom & Leaf, Ghost, etc. None came close to the density levels of the Lucid. None came close in price with prices starting at $800.Determining that quality and price couldn’t be beat, I ordered my Queen Lucid 14 inch gel memory foam mattress for under $500.As stated before I have a severe case of fibromyalgia, which means I am in pain 24/7. As stated before, the old mattress was greatly increasing my pain levels. I was waking up every 2-3 hours in pain. My hips and shoulders hurt greatly as I am a side sleeper. In the mornings, I was so stiff, that I needed to walk for at least 15-20 minutes to loosen up and to reduce the resultant pain spike. I was so tired by the end of my work day that I would be in bed by 6:00 or 7:00 pm. Needless to say, I was beyond excited to be getting a new mattress.However, my two main concerns were 1) firmness since there were a number of reviews who felt this particular mattress was firm m, and 2) off gassing as I am very sensitive to smells. Therefore, we bought my mattress first because if it was too firm or to smelly, my husband would take it as he doesn’t have issues with firmness or smells.The delivery day arrived. Like others have noted, the box it was in had has a hard cross country trip. It was a bit banged up, and the tape on the top had been fully slit. However, the mattress was still in the box and fully protected by the heavy duty plastic. The tool to cut it free was very useful. It was a bit cumbersome, but nothing two people couldn’t manage. Thankfully, my mattress had practically zero smell. My husband had to put his nose on the mattress to smell the off gassing. I just got the smallest of whiffs of off-gassing. It did not bother me at all and fully went away in a few hours. Finally, the mattress plumped up to 14 inches in 4 hours not the 24 hours some reviewers had experienced.Now the real test was to take place - Fibromyalgia vs Lucid! The winner? Lucid!!!My aching body feels like it has found a friend that fully understands how it feels and who wants to make it feel better. The mattress has the perfect balance of plush and support. Pain is not waking me up every 2 hours. My hips and shoulders do not ache. But most amazing of all is that when I get out of bed to start my day, I am not stiff AT. ALL.! I do not need to walk 15-20 minutes to loosen up. I figured the the overall stiffness was 100% fibromyalgia, but it wasn’t. In short, I am sleeping. I am also noticing that because I am better rested certain situations do not wipe me out like they used to. Finally, the memory foam keeps me at the right temperature. On my old mattress, I had to use a heated mattress pad because I was always cold, which increased my pain levels.The Lucid wins on so many levels: supportive comfort for a painful chronic illness, quality of materials, and price.",
                "reviewVotes": "397 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tabatha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGC77USC4MFUUWKAGIE7PRN665YA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YMPWIVBIMHWH?ASIN=B0864N2N6M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 19, 2013",
                "reviewTitle": "5.0 out of 5 stars Nice bed for a great price!!",
                "reviewText": "This bed is firm. I read some reviews saying it was as hard as a rock and I'm confused to what rocks they are holding but it is firm. It is not hard by any means. I've slept on some hard spring beds and this is nothing like that what so ever. I've slept on pillow tops harder. It's a great supportive soft bed. It reminds me of a marshmallow. Firm yet squishy. I slept on my mattress last night and I didn't wake up once to roll over and the noise is gone from the old spring mattress.The bed is thick. I wish the the cashmere cover on it wasn't as loose but oh well. It doesn't slide but it isn't as tight as I wish it was but it's not been the complete 48 hours either since. It has been 24 and I really don't think it will be expanding anymore but if it does I'll add to this review. I am doubting it will.The smell it has airs out quickly. It's winter here and 24 hours later there is only a hint of a memory foam smell. It's the same smell my pillow had when I bought it. Nothing to crazy but if you're not expecting it it could worry you. It's fine though. It is no worse than craft glue or paint. Only these fumes can't hurt you.The only reason I don't 5 star this bed is because it's not quite as high as I thought it would be. I measured my bed frame and how high my mattress needed to be and it isn't quite as high as expected but it is foam and that happens. nothing a topper or a bigger pillow can't fix. The smell was a bit to be desired for and the fact that you smell like it if you sleep on it. If you plan to buy this mattress don't plan to sleep on it the first night. One, it might not be done expanding. Mine took several hours it says in the book it may take 48 hours. Two, the odor coming from the bed it very over whelming at first and you will smell like it if you lay all over it. It isn't fumes it's just the smell of the foam. It can't hurt you but no one likes a bad smell at their house.Other than that the bed is well worth the 400.00 + they ask for it. I would have paid more. I am actually shocked at the price for the quality and now I'm interested in how long it will last. I plan to add to my post when it needs to be replaced or if it begins to wear down.The bed is amazing though, not hard. Not too soft but as I said a firm soft mattress. It's not like sleeping on feathers. Like I said it's like sleeping on a jumbo marshmallow. That's the only description I can give. Unless you want to call it baby bears bed, not to hard not to soft.I did read some reviews about the top not being 100% cashmere and I have to say \"duh\" cashmere is expensive and you shouldn't expect a entire mattress to be wrapped in it for 400.00. You can't get a scarf that is made of 100% cashmere for less than 150.00 unless its on sale. This is a HUGE mattress. It is soft. It probably has cotton in it I'm not sure but it is soft. I do think they expect you to put sheets on the bed though. So why the mattress cover matters is beyond me. I also read a review about the bed not being made of 100% memory foam. If you look at the picture and read the arrows it clearly tells you how much memory foam to expect and how much support foam ect. I am not sure I could sleep on a bed that is 100% memory foam. I think it would be hard to get out of seeing how you melt into it.The packaging was beat up a bit. But my package only had a few holes from being thrown around in the truck. The mattress is wrapped very tightly with 2 players of tape and plastic so it doesn't really matter but don't expect this to be perfect boxing. It is a bit heavy to lift. My eleven year old daughter and I together brought it in off my deck porch. My husband got it up the stairs him self. I would suggest you unroll the bed on your box spring or plat form bed. Between the weight and the smell unrolling it and them moving it is a bit much. That's just my suggestion to others though.All in all great product! I'm very pleased! I can't wait to sleep in it again tonight! Thanks LUCID for the deal and a great bed!UPDATES-It's been a little over 2 years or so and I just recommended this bed to a friend. I've had no issues with this bed. This bed was moved and got smashed down our tight stair well. It has been jumped on by kids, smashed, moved, flipped and still the same as when we bought it.The only issue is the memory foam on top ripped. I expected that with the price and plan to add just another piece over top of it. It's not really noticeable while sleeping but it's a crack.Still a great bed & I would buy another!It is now 2017. I bought this bed in 2013 I believe. It's still working great and I get compliments on how soft and comfortable it is. Still not sinking or losing height.",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MTB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 30, 2014",
                "reviewTitle": "A lot of value for the money....",
                "reviewText": "I searched out all the reviews I could on memory foam mattress's on the internet. I found that most are very expensive but so were the spring mattress's also, so I knew that I wanted to stay with a MF mattress but which one? I came across this one from Lucid. I first thought, it must not be that good for the price they are selling it for. Anyway, after reading as much as I could about it I went ahead and bought this 14\" mattress. It's bit firmer than I would have liked but it seems to be better now that I have been sleeping on it for about 6 weeks or so. It filled out to the full 14 inches just fine. The cover seems really nice to the touch and all in all It's a well made mattress. I wouldn't say as nice as a Tempur-Pedic but dollar for dollar this is a much better value. And when I say \"not as good as a Tempur-Pedic\" I mean that the Tempur-Pedic being a bit more refined as far as manufacturing goes..... like I said, the Lucid mattress is your best bang for the buck. I didn't have nor could I afford $2800.00+ for a Tempur-Pedic. I'm very happy with this purchase. Peace.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris Breckenridge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 20, 2015",
                "reviewTitle": "Ahhhhhhhh!!! Great nights sleep",
                "reviewText": "This mattress is incredible. It is firm, but you do sink into it. My wife likes firm and I like softer mattresses. The sinking in feeling gives the impression of softness, the firmness means that you don't sink to far, and the memory foam around you holds its shape until you move and then you will feel the memory foam re-shape itself around you. The mattress is true to size - although it seems to fill out the bed more than my old spring mattress did. Definitely follow the instructions. lay it out for 48 hours before sleeping on it to allow it to regain its full size. Mine came up to just over 13 inches so I was quite happy. You will need deep pocket sheets for this. I bought 14\" sheets and that particular brand is a tight fit. This mattress is very comfortable on your back and side. If you've never slept on a foam mattress before - it takes a little getting used to. Because it hold your body in a proper position it might feel strange. The first night I thought my bed was angled with the feet higher. The top half of your body is hotter and heavier than your legs, so your torso sinks in more, leaving your legs higher than they would be on a regular spring mattress. While it feels like your feet are raised, this is actually your body sleeping the correct position since the mattress forms to you, not the other way around. I love feeling the mattress form around me and I can feel it supporting the small of my back instead of my back trying to flatten out to accommodate a no give spring mattress. It took me a few nights to stop noticing the different feel and now I love it. You can not beat the comfort for the price you are paying. This mattress comes in a box and is vacuum packed and rolled. The box is about 6 feet tall (queen size) and about 2x2. It weighs just under 100 lbs (memory foam mattresses are heavy). Also be aware of the requirements for the base underneath the mattress. You can not use a box spring that has springs in it. The box spring must be the solid wood type, or a platform.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 3, 2014",
                "reviewTitle": "Trust me, if you like firm/semi-firm, this is the king of well-priced mattresses.",
                "reviewText": "This. Bed. Is. Incredible! Don't cheap out and think you will be comfortable on an 8\" mattress because I tried and it was awful. And then I took a risk on this mattress and it is the best mattress I've ever slept on. I went to a mattress department today and said out loud \"yuck\" when I sat on a different mattress. I was hesitant to spend 550$ on this, because I thought there was no such thing as a quality mattress under 900$, but this was precisely what I was looking for.It is very firm, but not stiff. If you jumped on the mattress, you would feel like you were jumping on a hard surface, but lay for just a few second, and you would feel your body being cushioned just enough to make you feel like a cloud. I have used a soft foam mattress before and it felt awful, like sinking into quicksand. This mattress however has the perfect balance between firmness and comfort. You might think I am being paid by Lucid to praise their mattress so much, but this is all spoken from the heart. I hope some day someone will see this review, and not make the same mistakes I made before finding this. Believe me, this is what you've been looking for.One oddity, is the cashmere cover. It's too thin to be any benefit under a fitted sheet, and you would be crazy to sleep on this mattress without a sheet, so it seems kind of like an odd feature, though it takes nothing away from the mattress and the price is still excellent for the quality.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dirksie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 15, 2017",
                "reviewTitle": "Great bang for your buck!",
                "reviewText": "This bed is great for my wife and I. We are both about 150lbs and this not too hard or soft. I can say that it is too thick to use with an adjustable base. There was little to no off gassing with this product. It came quick and was easy to unpack. If you’re looking for a memory foam mattress and a good price I can’t see why you owing choose this one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Heidi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 8, 2018",
                "reviewTitle": "I was excited about this mattress because I did thorough ...",
                "reviewText": "I was excited about this mattress because I did thorough research. Received it, and tested it it for +week, body sinks in the mattress to the point where it affects your circulation (wake up with sleeping limbs). I wish it was firmer, will be returning it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}