{
    "remaining_requests": 36,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sleep-Innovations-10-inch-Mattress-Warranty/dp/B00H2RS984",
    "body": {
        "name": "Sleep Innovations Marley 10 Inch Cooling Gel Memory Foam Mattress, Full Size, Bed in a Box, Medium Firm Support",
        "price": "$207.99",
        "originalPrice": "$259.99",
        "rawPrice": 207.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sleep-Innovations-10-inch-Mattress-Warranty/dp/B00H2RS984",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C3M3MYBX"
        ],
        "asinVariationValues": [
            {
                "asin": "B00H2RS7J0",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00H2RS984",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00H2RSA88",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00H2RJE4M",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00H2RSB82",
                "variationName": "Size",
                "variationValue": "California King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00H2RSD9E",
                "variationName": "Style",
                "variationValue": "8 Inches",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00H2RS984",
                "variationName": "Style",
                "variationValue": "10 Inches",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B00EZ5TB2O",
                "variationName": "Style",
                "variationValue": "12 Inches",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "4",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51tOusTFw3S.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51AaFCzpKuL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41HETCKLCjL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21CN60hkQtL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51hzaRAxjvL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41fqNSpybsL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Os0517j8L.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Sleep Innovations Store",
            "link": "https://www.amazon.com/stores/SleepInnovations/page/2D8217BC-4835-49EE-B51F-9B170F18B0F4?ref_=ast_bln"
        },
        "brand": "SleepInnovations",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 12564,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16. Order within 17 hrs 37 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Full Size Memory Foam Mattress: This 10 inch cooling gel memory foam mattress features a triple layer design with a soft knit cover, medium firm support, and comforting pressure relief in any sleep position",
            "Cooling Comfort: This full memory foam mattress features cooling gel memory foam and an airflow channel for enhanced breathability, so your sleep is cool and deep all night every night",
            "Support for Every Sleeper: Whether you are a stomach, back or side sleeper, you will find cooling breathability, motion isolation, and durable, high quality materials that hold their shape with a Sleep Innovations memory foam mattress in a box",
            "Quality First: The Marley mattress is made in the USA and Mexico. Our mattresses, mattress toppers, and pillows are all hypoallergenic and made with CertiPUR-US certified foam that is free of phthalates, heavy metals and ozone depleters, with low VOCs",
            "Feel Better with Sleep Innovations: We invented the memory foam bed in a box and continue to deliver sleep restoration today with innovative foams and fabrics; This full bed mattress comes with a 10 year warranty"
        ],
        "description": "Improve your sleep with the essential comfort of our 10 inch, triple layer gel memory foam Marley Mattress. A soft, hypoallergenic cover immediately relaxes you with lasting freshness, while the gel memory foam top layer and all over air flow channels provide a cooling effect. This helps to maintain a consistently comfortable climate for better, deeper sleep. Memory foam is proven to relieve pressure points, easing the impact on your knees, hips, and shoulders in any position. It also prevents motion transfer, allowing you and your partner to enjoy longer periods of undisturbed sleep. Plus, sturdy base foam designed for lasting durability ensures years of restorative rest.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "75\"L x 54\"W x 10\"Th"
            },
            {
                "name": "Item Weight",
                "value": "46.8 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "FXI, Inc."
            },
            {
                "name": "ASIN",
                "value": "B00H2RS984"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "G-MAT-01410-FL-WHT"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 12,564 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14,405 in Home & Kitchen (See Top 100 in Home & Kitchen) #67 in Mattresses"
            },
            {
                "name": "Thickness",
                "value": "10 Inches"
            },
            {
                "name": "Refill",
                "value": "Gel Memory Foam"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Warranty Description",
                "value": "10 year limited manufacturer."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Memory Foam Mattress"
            },
            {
                "name": "Size",
                "value": "Full"
            },
            {
                "name": "Special Feature",
                "value": "Cooling, Bed in a Box, Memory Foam, Durable, Breathable, Hypoallergenic, Fire Retardant, Lightweight, Pressure Relief See more"
            },
            {
                "name": "Fill Material",
                "value": "Gel Memory Foam"
            },
            {
                "name": "Brand",
                "value": "Sleep Innovations"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Model Name",
                "value": "Marley Cooling Gel"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Comfort Layer Material",
                "value": "Gel Memory Foam"
            },
            {
                "name": "Material",
                "value": "Foam"
            },
            {
                "name": "Item Firmness Description Medium Firm",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Memory Foam",
                "value": "Item Weight 46.8 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Marley Gel Memory Foam Mattress Skyler Pillow Top Gel Memory Foam Mattress Ellis Advanced Cooling Gel Memory Foam Mattress Shiloh Memory Foam Mattress Hudson Hybrid Innerspring & Gel Memory Foam Mattress Height options 8”, 10”, 12” 12” 12” 12”, 14” 10”, 12” Comfort Cool comfort at a great value uxurious pillow top cover with fluffy fiberfill Advanced all night-cooling comfort Cloudlike comfort with airflow Hybrid combo of innerspring and gel memory foam Pressure relief ✓ ✓ ✓ ✓ ✓ Cooling Cooling gel memory foam; Air channel foam for breathability Cooling gel memory foam; Air channel foam for breathability; Cool quilted cover Premium EVENcor GelPlus memory foam for maximum cooling; Air channel foam for breathability; Dual cool cover with instant and all-night cooling fibers Ventilated Suretemp memory foam for breathability Advanced cooling gel memory foam with enhanced breathability; Cool to touch quilted cover Support Responsive support foam; Sturdy base foam for stability Responsive support foam; Sturdy base foam for stability Reliable support with consistent-feeling, EVENcor GelPlus memory foam; Sturdy base foam for stability Reliable support with consistent- feeling, Suretemp memory foam; Sturdy base foam for stability Hybrid design with advanced pocketed coil support system; Extra resilient foam for uplifting back support; Reinforced base foam with edge support For all sleep positions ✓ ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6aef4e1-bb98-4fc7-a1b3-08c2425c2494.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/99b85f90-5c9e-49a8-ab69-0d87313ec82e.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/311fbd99-1541-4be2-86d3-d479dfae2c9c.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c957e639-d116-4857-b335-56eca2dd6f41.__CR0,0,970,600_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1dfc3eda-c76b-4a6a-9f81-94bc1f495667.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/56a77b4d-acbd-42ed-bfca-996e6b7db85a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b35c4a9a-2b5f-4d53-98f7-753a7ccf4122.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/113dbbee-b03b-4573-a8d0-a4ceebfcac2a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/cf0b55e8-d1c8-4f25-817b-dd93242fe08a.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kristen C.Kristen C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNMD3RZMPLSOOKW7KUVC2CTWC3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZFXUA9TDXKAO?ASIN=B00H2RS984",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2020",
                "reviewTitle": "5.0 out of 5 stars 8-10 year lifespan: Our best Amazon purchase ever! Great mattress. See UPDATES and pictures:",
                "reviewText": "ORIGINAL REVIEW 2013: I held off on writing this review until my wife and I slept on this bed for one entire year.After toiling for months over which mattress to invest in we decided on this one. First off the mattress was very reasonably priced; the king sized we bought was less expensive than the Sealy innerspring mattress we were replacing (after eleven years) by ~$500. Regardless of the price, this mattress was a great choice. The delivery took several days and came in a vacuum sealed bag. After I brought it up my stairs I placed it on the 7.5” tall box spring (which has 3” support slats) and unwrapped it. I would suggest not breaking the vacuum seal until the mattress is in place because it expands quickly and can be difficult to move once it is expanded. Also be sure that the mattress is facing the right side up. After a few minutes the mattress was at about 90% thickness, after several hours it was fully expanded. We left the window open in our bedroom for the afternoon to let the chemical smell dissipate. When bedtime came the bed was sufficiently aired out and the chemical smell was noticeable only if you really jammed your nose into the mattress. As an aside, my wife and I were prepared to sleep in a spare bedroom if the smell was still too much but we encountered no such problem.Now for the good parts; standard sheet sets fit perfectly on this mattress and laying on the bed was extremely comfortable (analogous to the TempurPedic we tested while buying a different mattress for one of our kids). The memory foam feel is quite different in a good way; supportive but not overly firm. When I was researching memory foam mattresses I got quite confused by the fact that one reviewer would say too firm and the next would say too soft - while referring to the same mattress. After sleeping on the mattress I could rate sleep quality this way: the memory foam becomes very tailored to your body, it feels firm at first but as the foam compresses it supports your body weight in just the right places. The softness feel comes as you sleep on it, it stays soft and comfortable (and at the same time supportive) without feeling like you are sinking into quicksand. It is really great.After sleeping on it for one year and four seasons, I can say that the mattress is still as comfortable as day one. I am a 230lb oaf and my wife is very petite yet we both love the feel of this mattress. There is no warping or hammock-ing of the foam where either of us sleep. Yes, it is a tad warmer in the summer but nothing too drastic.All-in-all this Sleep Innovations mattress is a terrific mattress and an excellent buy. The 12” height is plenty thick and does not make you feel like you have to jump up to get into it like the 14” did. After sleeping on an otherwise high quality spring bed while on vacation, my wife and I both commented on how we could never go back to a non-memory foam mattress again. This was our favorite Amazon purchase EVER and I highly recommend this mattress.Despite my superlatives, keep in mind that what makes a mattress good is a very subjective thing; what is comfortable to me may not be for you - so I attempted to describe this mattress' attributes as best as I could. Hopefully this review helps you decide if it will be a good choice for you. I attached a few pictures for reference.UPDATE 5/1/2015: This bed is still comfortable and it is holding up very well. The foam still compresses and releases as when new and there has been no lumping or hammock-ing. A few months ago I did rotate it 180 degrees to shift the areas that are laid upon as that was recommended to us by other several reviewers (thanks to them!).Still give a full five stars as my wife and I love this bed.UPDATE 11/16/2020: After a bit less than nine years, my side of the bed started to get a little lumpy, presumably from uneven recoiling of the foam after I get up. We loved this bed so much that we ordered an identical one to replace it and the new one seems just as good thus far.",
                "reviewVotes": "1,718 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/815nDM+5oAL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/81rI4-XGGWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "EricNPHX",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMRNO4DWBVKI36SGQIG7YKHR6MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10E2K84D6CKQ1?ASIN=B00H2RS984",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2015",
                "reviewTitle": "5.0 out of 5 stars Great Value but understand this is a very firm mattress.",
                "reviewText": "Update 5-12-19.. had it over 4 years, still my favorite mattress. No issues at all..Update 3-8-18 Still love this mattress. Absolutely no issues to date. No Sagging of any kind.Update: 12-26-16I have had this mattress almost two years now, and I am still super pleased with it. It has stayed constant the entire time. No sagging in the middle what so ever. Still the best mattress I have ever owned, and if for some reason, I would need to buy another, I would in a heartbeat!We are very pleased with our new mattress! We spent a weekend going to many mattress stores and came home very depressed because it was going to cost us 3K to 4K for a new mattress we liked. I did some online research and came across this Sleep Innovations Mattress. It had all of the feature we were looking for, but the price was so low compared to the big name memory foam mattress. After reading the reviews I decided to give it try.. And I am glad I did!It was delivered in two days thanks to Amazon Prime. It was easy to get into the bedroom and set up. I have included a few pictures so you know what to expect. The last picture is after about a hour from the time I opened it. The mattress cover became very tight after about a day. During the set up I didn't have any smell that others have mentioned. I measured the mattress after 48 hours and it was 11 1/4\".We waited 24 hrs. to give it a try, and the first thing we both said was \"Boy this is firm!\" We wanted a firm mattress, but I don't think anything we tried at the stores were even close to this firm. We both sleep well the first night, and have been sleeping even better as we have gotten used to the new mattress. We did change from a traditional pillow top bed mattress, so regardless if we spent big bucks on the name brand, we still would have a learning curve.Now after our first week, and couldn't be happier! I have not had any issues with heat building up, so I am guessing the gel does do what it is supposed to. We have also noticed that we are sleeping much better then we did on the old mattress. This mattress is so comfortable!!!The only thing that I can say that we are sacrificing for this mattress as compared to the Big Name one, it that the material on the Big Name mattress cover does seem to be of a higher quality, which quite frankly has nothing to do with the performance of this mattress. Once the bed is home and the sheets are on it, it was never noticed againAdditionally, this bed is made in the USA!!!",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "claudia gutierrez rubio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 17, 2020",
                "reviewTitle": "Muy buena calidad",
                "reviewText": "Llego a tiempo prometido. Es muy buena calidad , comodo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 28, 2019",
                "reviewTitle": "Buy this!!",
                "reviewText": "I love this mattress. High recommended. I have multiple injuries that are aggravated by sleeping in bad position but this mattress has eliminated that problem.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Glenn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 24, 2019",
                "reviewTitle": "Great option if you want a firm mattress",
                "reviewText": "It didn’t take very long for the mattress to regain its shape after being unpacked.There wasn’t any strong smell that some foam mattresses have.This is a firm mattress, with great support, which is what I was looking for.This is a great mattress, for the price it’s even better.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TLO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 10, 2018",
                "reviewTitle": "Love it!",
                "reviewText": "amazing if you like firm beds! Only issue is that it only expanded to 11 inches but for the price super happy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linda Molloy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2018",
                "reviewTitle": "Great Mattress",
                "reviewText": "Very comfortable, and my husband had back surgery and finds it perfect even with his chronic back pain. Sleeps all night without any trouble. And the price was great. So much quality for the price any day of the week.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}