{
    "remaining_requests": 93,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Serta-Innersprings-Isolation-CertiPUR-US-Certified/dp/B0BZX1P2SY",
    "body": {
        "name": "Serta - Perfect Sleeper - Queen - Nurture Night 14.5\" Plush Pillow Top Cooling Gel Memory Foam Hybrid Mattress - Pocket Innersprings for Motion Isolation, Edge Support, CertiPUR-US Certified",
        "price": "$809.10",
        "originalPrice": "$899.00",
        "rawPrice": 809.1,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Serta-Innersprings-Isolation-CertiPUR-US-Certified/dp/B0BZX1P2SY",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C1P5GWTB"
        ],
        "asinVariationValues": [
            {
                "asin": "B0BZX1DYFQ",
                "variationName": "Style",
                "variationValue": "Firm",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZX11Q73",
                "variationName": "Style",
                "variationValue": "Medium",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZX1P2SY",
                "variationName": "Style",
                "variationValue": "Plush Pillow Top",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZX1CR2Z",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZWZ2FSH",
                "variationName": "Size",
                "variationValue": "Twin XL",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZX1RBQM",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZX1P2SY",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZX39199",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0BZX14G5F",
                "variationName": "Size",
                "variationValue": "California King",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "8",
        "stockDetail": "Only 8 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41kntgTS5LL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41HPHg73IaL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51nMbQHyRDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51e1bRLPHGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51F21RcrlDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Z2EqTCLQL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/81uNqtt8mlL.png"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Serta Store",
            "link": "https://www.amazon.com/stores/SertaDreamConvertibles/page/AE826265-7152-4D75-8A8C-73FC0BBFC46E?ref_=ast_bln"
        },
        "brand": "SertaDreamConvertibles",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 41,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "FREE delivery",
        "deliveryMessages": [
            "FREE delivery"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Cool Twist Gel Memory Foam - This unique design features cooling gel swirled into premium memory foam. This breathable memory foam helps enhance airflow and heat dissipation for a feeling that can only be described as a cool, contouring type of comfort",
            "PillowSoft Aire Soft Foam - This foam provides enhanced cushioning for exceptional comfort and promotes airflow through its unique, gently rippling design. This is coupled with 2\" of Serta's cushion quilt foam to create that plush feeling.",
            "Gel Band Support - A band of gel memory foam provides lumbar support for the lower back and hips",
            "Custom Support Coil System - The includes an 825-coil system that provides contouring, cradling support and minimized motion transfer",
            "Questions - We pride ourselves on customer service and urge you to reach out to us directly if you have any questions at any point, our expert customer service team will be available to help you through any of your hesitations, problems or questions"
        ],
        "description": "Experience unparalleled comfort and support with the Serta Perfect Sleeper Nurture Night mattress. Boasting an 825-coil density system and a lumbar gel support band, this mattress provides zoned comfort and pressure relief, while the Cool Twist Gel Memory Foam conforms to your body for a contoured fit. Additionally, the mattress's advanced cooling technology ensures that you stay cool and comfortable throughout the night. Say goodbye to restless nights and wake up feeling rejuvenated with the Serta Perfect Sleeper Nurture Night mattress.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "79.5\"L x 60\"W x 14.5\"Th"
            },
            {
                "name": "Item Weight",
                "value": "77.9 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Serta"
            },
            {
                "name": "ASIN",
                "value": "B0BZX1P2SY"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "500303123-1050"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 41 ratings 4.0 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#107,960 in Home & Kitchen (See Top 100 in Home & Kitchen) #299 in Mattresses"
            },
            {
                "name": "Refill",
                "value": "Memory Foam"
            },
            {
                "name": "Care instructions",
                "value": "Ensure proper support - A new mattress needs the support of a proper foundation to resist sagging over time., Rotate to even out wear over time - Rotating is not required, but it can help even out normal wear over time. You can rotate your pillow top mattress as often as once per month, or less depending on your preference., Use a liquid resistant mattress protector - Spills and stains can impact the integrity of the mattress fabric and foams. Severe spills can also cause the foams to collapse, making them prone to impressions which can cause discomfort. A liquid resistant mattress protector will help keep your mattress clean and healthy over time. Look for one made from breathable materials., Clean your mattress regularly - Regular vacuuming of the mattress using a handheld attachment is an easy way to clean your mattress. Take caution when considering how to wash the mattress as saturating the foams and fibers with liquid can damage the foam. Instead spot clean stains using warm water and a mild detergent. Then, let the surface dry completely before putting your sheets back on."
            },
            {
                "name": "Warranty Description",
                "value": "10 year limited warranty."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Mattress"
            },
            {
                "name": "Size",
                "value": "Queen"
            },
            {
                "name": "Special Feature",
                "value": "Temperature Regulating, Breathable Construction, Edge Support, Lumbar Support, Low Motion Transfer"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Brand",
                "value": "Serta"
            },
            {
                "name": "Color",
                "value": "Light Blue With Dark Blue Sides"
            },
            {
                "name": "Coil Type",
                "value": "Pocketed Coil"
            },
            {
                "name": "Model Name",
                "value": "Nurture Night"
            },
            {
                "name": "Product Benefits",
                "value": "Its layer of Cool Twist Gel Memory Foam provides the sleeper with cool contouring comfort as they lay on the mattress., Its layer of Pillowsoft Aire Foam provides enhanced cushioning for exceptional comfort that also promotes airflow., Its Gel Band provides zoned support for the lower back and hips., The mattress comes with a 100 night return policy, a 10-year limited warranty and is certified by CertiPUR-US., It includes an 825-coil system that provides contouring, cradling support and minimized motion transfer See more"
            },
            {
                "name": "Product Care Instructions",
                "value": "Ensure proper support - A new mattress needs the support of a proper foundation to resist sagging over time., Rotate to even out wear over time - Rotating is not required, but it can help even out normal wear over time. You can rotate your pillow top mattress as often as once per month, or less depending on your preference., Use a liquid resistant mattress protector - Spills and stains can impact the integrity of the mattress fabric and foams. Severe spills can also cause the foams to collapse, making them prone to impressions which can cause discomfort. A liquid resistant mattress protector will help keep your mattress clean and healthy over time. Look for one made from breathable materials., Clean your mattress regularly - Regular vacuuming of the mattress using a handheld attachment is an easy way to clean your mattress. Take caution when considering how to wash the mattress as saturating the foams and fibers with liquid can damage the foam. Instead spot clean stains using warm water and a mild detergent. Then, let the surface dry completely before putting your sheets back on. See more"
            },
            {
                "name": "Item Firmness Description Plush",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Hybrid",
                "value": "Item Weight 77.9 Pounds"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8e7d9ce6-d1fa-42ba-990b-a1778c98dfab.__CR0,5,3200,990_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d1788c25-b43e-41ff-b336-92643f0be944.__CR0,5,3200,990_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a422c97a-28b1-4348-b7c2-fb432c68d986.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5cb77a1d-e698-46ca-9d51-9873fb787164.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/95411312-9e46-4758-9449-fbafffb448a8.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZCY3YUNBIMNH6VBSBGCPSY5Y7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R6Z6X48RT0LH6?ASIN=B0BZX1P2SY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 25, 2023",
                "reviewTitle": "5.0 out of 5 stars Love my firm matress!",
                "reviewText": "First time I ordered a matress online and it not disappoint. It was delivered in a rectangular box to my home, my entry way. I was able to move it by myself to my room and place on my box spring. I love the firmness of my new Serta Perfect sleeper. Other features: no motion transfer, hybrid with memory foam and gel foam, comfortable top, and no harsh odors nor chemical smells.",
                "reviewVotes": "19 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71pd4PnZsGL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "tina montoro",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHU6N5AX26ZJ3XCHSRWZ7AOKI23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBPN6G6L68RMI?ASIN=B0BZX1P2SY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Goldilocks Approved",
                "reviewText": "Ive been searching for a mattress that didn’t hurt my back shortly after buying it for years now. I think I went through seven or eight, I really lost count. I tried innerspring mattresses that I went and tried in the store, I tried hybrid beds on line, no luck. This bed is by far the best I’ve had, I don’t have back pain anymore, I sleep like a baby, I got the medium, although I am a stomach sleeper and firm probably would’ve been slightly better. But I still can’t complain, I can sleep on my stomach with no issue. I’m so thankful, I could just hug the seller! Serta is definitely a good choice for a quality bed. I’ll send in an update later to attest to the durability, but I’ve had it about two months now and I’m really happy!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JayeJaye",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDSLDZI3GIU4WINYIPOY6LKF5WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16WYG9W827W9Z?ASIN=B0BZX1P2SY",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 4, 2023",
                "reviewTitle": "1.0 out of 5 stars Nothing like the description!!",
                "reviewText": "I spent countless hours researching mattresses to try to choose the right one for my needs. I’m chronically ill, so I spend a lot more time in bed than the average person. And it’s crucial for me to have a bed that’s comfortable.I chose this one for two primary reasons. I need a very soft bed that I can sink into, otherwise it hurts. This was advertised as plush, and the image showing a person lying on their side on the bed shows them sinking into it quite a bit. It also describes being very soft and being able to sink into it.The other reason I chose this one is because it has three different forms of cooling technology. I run very hot when I sleep, and I cannot have a mattress that retains heat or I just can’t sleep.Unfortunately, all of that was a lie.The mattress is extremely firm. Yes, it has a pillow top. But once you sink into that 1st inch or two, it’s hard as a rock. I might as well have a thin mattress topper on top of a slab of wood. It’s absolutely miserable for someone who needs a soft bed.All of this so-called cooling technology? Nope. I’ve slept on memory foam beds that do retain some heat and aren’t terribly comfortable for me, but this one was the absolute worst I’ve ever slept on in my life. it has zero cooling properties, although it does feel quite cool when you first get into it. But the whole idea of the cooling technology is to cool you off while you sleep, not to be cold when you first get in and then turn to broil. In the worst part? With a different mattress, you could at least move to a cooler spot on the bed, but with this one, the entire bed heats up!As if all of that isn’t bad enough, getting this thing delivered was an absolute nightmare. The day that they were supposed to come, they just never showed up and I wasn’t able to reach anyone because their office was closed during my delivery window! When I finally got in touch with somebody the next day, they told me that that delivery window doesn’t even exist. I had already lined up help to be able to get everything changed out and re-situated, plus set aside, specific time for the delivery window that I scheduled. I called the next day, they just informed me that they were going to come the following Monday anytime throughout the day . And where to even willing to give me a choice in selecting a delivery window on a day that works for me.Thankfully, the district manager of the third-party delivery company ended up working with me, although he said that they’ve been trying to get Amazon to remove the incorrect delivery window for a long time. I’m not sure who was at fault, but if that delivery window was an issue, then the third-party company should not have sent me an email confirming it! I received confirmation both from Amazon and from the third-party company. But I did finally get it delivered. It just took a huge amount of time and hassle.I wish I could give negative stars. This entire experience has been a nightmare and I greatly regret buying this. I’m glad that they have a good refund policy, but they don’t come and pick it up for you, so I’m going to need to find help once again to get it out of the frame and figure out how to get it out of my house when I can get a new bed to replace it. And I may end up having to hire somebody to do that because I don’t have a lot of local friends and most of them are very strong either. This thing weighs 125 pounds and takes a bit of muscle to move. I also don’t have a truck to haul it away, so I’m hopeful that I can find somebody local who needs a bed and has the ability to transport it to come get it.",
                "reviewVotes": "33 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71LjDEeSWqL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "NOLA guy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTYT4IE52S7IWU3RSINEGO62GWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RI1IDEIBK9CO4?ASIN=B0BZX1P2SY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Nice and firm. Holding up well",
                "reviewText": "As a middle age couple we wanted something that would be comfortable and durable.We had a king bed. Trashed the mattress and kept the box springs. Deep enough for my extra deep sheets",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Spencer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQBWJGXAVSSY365OUSJXHKTR7BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VESED8GRB3CQ?ASIN=B0BZX1P2SY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect bed for me.",
                "reviewText": "It is actually firm which is exactly what I had been looking for. Delivered on time in perfect condition.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eileen Mackey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPNWLBDUDO7Q7Z654RDOOJEM72A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3C2HWCTJCC2JQ?ASIN=B0BZX1P2SY",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "3.0 out of 5 stars Too Firm For Me",
                "reviewText": "I have back problems and am obese, so I bought these for an adjustable bed. They were much too firm for me. I thought they would be softer and more comfortable on the surface and only firm beyond the initial top surface, but even the surface feels hard to me. My back ached more each day that went by.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Guadalupe Miranda-Sapp",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5BI33PG6NF2HOV3PLQGTKZ2VPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FASIVIH3XHPO?ASIN=B0BZX1P2SY",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Great value, good mattress",
                "reviewText": "Pleasantly surprised at the quality, comfort and value. I’ve recommended it to friends already!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DobeLady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHU6254VL5YV7CZH5SNIGTTXLJVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OQIUYYV6PUDV?ASIN=B0BZX1P2SY",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 9, 2023",
                "reviewTitle": "5.0 out of 5 stars So soft but supportive",
                "reviewText": "Great to just get in bed when you have back pain!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}