{
    "remaining_requests": 63,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Amazon-Basics-Mattress-Isolation-Springs/dp/B07XSBJHWN",
    "body": {
        "name": "Amazon Basics Gel Memory Foam Hybrid Mattress, Medium Feel Motion Isolation Springs, 10 inch, Full, White / Gray",
        "price": "$228.21",
        "originalPrice": "",
        "rawPrice": 228.21,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Amazon-Basics-Mattress-Isolation-Springs/dp/B07XSBJHWN",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C6FJB3NS"
        ],
        "asinVariationValues": [
            {
                "asin": "B07XSBJHWN",
                "variationName": "Style",
                "variationValue": "10-Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07XSBDDXK",
                "variationName": "Style",
                "variationValue": "12-inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07XSC9NY4",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07XSBJHWN",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "90",
        "stockDetail": "Available to ship in 1-2 days",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91c4uFoeejL._AC_SY450_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Amazon Basics Store",
            "link": "https://www.amazon.com/stores/AmazonBasics/page/947C6949-CF8E-4BD3-914A-B411DD3E4433?ref_=ast_bln"
        },
        "brand": "AmazonBasics",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 988,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery February 28 - 29",
            "Or fastest delivery February 25 - 26"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Full size mattress offers enhanced sleeping comfort; ideal for any bedroom or guest room",
            "Medium-firm memory foam supports the contours of the body and reduces pressure points",
            "Vacuum packed for convenient, compact shipping; remove from box and allow up to 48 hours to fully expand",
            "Hybrid design combines a base with pocketed steel coils for edge to edge support and effective airflow, a cooling gel-infused memory foam layer, and a quilted top",
            "CertiPUR-US certified",
            "Product Dimensions: 75 x 54 x 10 inches (LxWxH)"
        ],
        "description": "Product Description Amazon Basics Hybrid Mattress - Medium Feel - Memory Foam - Motion Isolation Springs - 10-Inch, Full From the Manufacturer Amazon Basics",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "‎66 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "75\"L x 54\"W x 10\"Th"
            },
            {
                "name": "Country of Origin",
                "value": "‎USA"
            },
            {
                "name": "Item model number",
                "value": "‎AB10HY46"
            },
            {
                "name": "ASIN",
                "value": "B07XSBJHWN"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 988 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,067 in Our Brands (See Top 100 in Our Brands) #319 in Mattresses"
            },
            {
                "name": "Date First Available",
                "value": "December 12, 2019"
            },
            {
                "name": "Size",
                "value": "Full"
            },
            {
                "name": "Special Feature",
                "value": "Cooling"
            },
            {
                "name": "Fill Material",
                "value": "Memory Foam"
            },
            {
                "name": "Brand",
                "value": "Amazon Basics"
            },
            {
                "name": "Color",
                "value": "White / Gray"
            },
            {
                "name": "Coil Type",
                "value": "Pocketed Coil"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Comfort Layer Material",
                "value": "Memory foam"
            },
            {
                "name": "Material",
                "value": "Memory Foam"
            },
            {
                "name": "Item Firmness Description Medium",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Memory Foam",
                "value": "Item Weight 66 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Amazon Basics Hybrid Mattress, Available in 10 & 12-Inch Hybrid Performance Featuring a memory foam top layer and edge-to-edge innerspring coil, the mattress conforms to your shape to provide a better night's sleep. CertiPUR-US Certified Gel-infused memory foam is certified by CertiPUR-US to ensure it meets rigorous standards for emissions, content, performance, and durability. Cool & Comfortable Stay cool and relaxed through the night with effective airflow channels, and alleviate joint pressure thanks to the mattress’s soft, moldable texture. Easy to Set Up Shipped to your door in a compressed, air-tight roll, the mattress is easy to move and set up. Please allow 48 hours for it to fully expand.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/sota/715b2064-8d8d-42c8-8f8b-c39208636b93.__CR107,0,1393,1045_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/a2bbf801-7741-4c56-9af1-435234d1fa40.__CR155,0,1240,930_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/45d9016f-8516-40c3-9ba3-f14a0d1baf2d.__CR0,256,651,488_PT0_SX300_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media/sota/6802a5a8-879f-4e51-b9b5-97a7accb323e.__CR88,447,1364,1023_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/715b2064-8d8d-42c8-8f8b-c39208636b93.__CR107,0,1393,1045_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/a2bbf801-7741-4c56-9af1-435234d1fa40.__CR155,0,1240,930_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/45d9016f-8516-40c3-9ba3-f14a0d1baf2d.__CR0,256,651,488_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/6802a5a8-879f-4e51-b9b5-97a7accb323e.__CR88,447,1364,1023_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/060a217f-a3e3-4d5a-85b3-4af0c7a97cdf.__CR0,0,1464,600_PT0_SX1464_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/sota/2cd47f65-6764-424e-a4e1-401474fa5d25.__CR0,0,1464,600_PT0_SX1464_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "C&J ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH26ICFLYSG25SNRIWSYSXUZNXUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TQN1LEDIZ16P?ASIN=B07XSBJHWN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 26, 2020",
                "reviewTitle": "5.0 out of 5 stars So far so good with this mattress",
                "reviewText": "First update (July 2020) I'm now a month in and I'm still very happy with this mattress. It is very comfortable, my quality of sleep has improved and I have way less back and shoulder pain. Only thing I've been looking into is a cooling gel infused mattress topper because it's now the dead of summer and uncomfortably warm even at night.I bought this and it arrived at my doorstep within 5 days. Very convenient. Packaged neatly, compressed and delivered by UPS. Total came out to $358.37 which is cheap for a bed, I was questioning the quality but decided to go for it because Amazon's return policies are decent.I ordered this mattress, along with the ZINUS Arnav Modern Studio 10 Inch Platform 2000 Metal Bed Frame (which I also reviewed so it is now available on my profile), after the old mattress I’ve had since high school developed a crater so deep it was visible even when no one was on the bed. Even the box spring was flattened in the center so I decided I needed a whole new setup. I personally spent hours reviewing various mattresses, weighing pros and cons of memory foam vs. spring vs hybrids. I decided on this hybrid mattress from AmazonBasics because I trust the brand a bit more than some of the unfamiliar online-only ones, and I chose hybrid because before this I had a pillow top spring mattress so I wasn’t sure I’d like a 100% foam bed. This mattress is firm without being too hard, it’s comfortable and the motion isolation claims are true, especially for a couple like myself and my spouse who previously had a spring mattress and felt every movement. It is nice being able to turn over without waking each other. The price is very good for the quality and honestly I’d recommend purchasing this bed, I don’t feel like this mattress will have any issues with indenting. However I will be back to update my review especially if anything goes wrong. Also I’d recommend purchasing a mattress protector, I have one on the way. The foam seems like it’d be absorbent and I’d rather not damage it with accidental spills.I think I made a good choice. Overall the process was easy, unbox and unwrap the mattress on the frame or wherever you choose to keep it because it’s easier that way. Personally I think my mattress was full after about 2 hours or so, we slept on it that night with no problems. I ordered the 12 inch / queen version so it’s definitely higher up than I’m used to, but I enjoy how much easier it is to get in and out of bed with the height.I’m comfortable, I slept well, no weird aches or pains, but with the shape that my last mattress was in, anything is an improvement. I fully believe I made a good choice with this bed, as comfortable and well made as it appears. I am a guy in my early 20s though so there was no struggle for me to pick up the box and since it was delivered to my doorstep I just had to drag it down the hallway to my room, where I eagerly tore open packaging like a child on Christmas day, only for this thing to spring open and the impact was like an air-bag. Don’t open it the way I did - watch a video on opening them and for best results, lay it in your bed frame before opening it.TL;DR Freshly ordered and set up, so far so good. No noxious odors, no issues with quality or damage, very comfortable. Will be back to update as time progresses. First night of sleep went really well. If my review helped you, please let me know by hitting the helpful button. Thank you!",
                "reviewVotes": "236 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CS74",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCOTRIEQNUEWJOTPQSBDXOKO5DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R351TOVQEQ3RJ1?ASIN=B07XSBJHWN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 18, 2023",
                "reviewTitle": "5.0 out of 5 stars Great mattress",
                "reviewText": "We needed to get our daughter a new mattress and we could never seem to find the time to go mattress shopping. I was researching mattresses and discovered that Brooklyn Bedding makes Amazon's mattresses. We already have two BB mattresses and love them. We've had them for years and they've held up wonderfully. I read the reviews of the Amazon mattress and it seemed to be comparable to the BB mattress, so we decided to order one. It came packaged well, and quickly. The mattress was expanded fully in just a few hours. It's very comfortable, and a bargain for the quality. Highly recommend.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mason Caiden K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKBSQEKUCBHOKTF76DMOI2VKMXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1D0ZFIV8DJTHJ?ASIN=B07XSBJHWN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Great value, could be firmer",
                "reviewText": "This is a good sized mattress, it comes sealed nice and tight, and it didn't take too long for the memory foam to expand to it's full size. I think the mattress should last a long time, but I would recommend rotating it every 3-6 months for longevity. This mattress is pretty firm, but I think for my preference it could be firmer. I think it's the perfect thickness and all of my sheets fit very nicely around the edges. I'm happy with my purchase and I'll be using this mattress for a while.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mamy B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEMMSJFBE4HD4VG6K6XYFQIDY4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R322IF5P6HT8OM?ASIN=B07XSBJHWN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 28, 2022",
                "reviewTitle": "5.0 out of 5 stars No complaints!",
                "reviewText": "We are in our mid 40s and we were starting to experience a good deal of neck and back pain (leg too). After realizing our old Serta had a bit of a sink hole - we decided to get a new mattress before chalking up the aches and pains to getting older.After a good bit of research and working within our budget - this Amazon mattress looked like it would fit the bill. We’ve never had a memory foam but have the slept on them before. We live in a climate that runs 100-115 degrees in the summer. Memory foam is usually too warm for us (even in the winter they make me hot). So we opted to try out the hybrid. We liked the idea of memory foam for our joints but wanted some support from some springs.Delivery Day: It puffed up pretty quickly after removing the plastic and the out gassing wasn’t particularly bothersome to either one of us. It smelled new sure but it wasn’t that bad.Trying it out: Our first couple nights were actually kind of weird. It was firmer than I thought it would be and we were pretty used to our 20 year old mattress so it took a second to get used to not laying in a hole? 😂 But the first night we both woke up with fewer aches. And by day 3, pretty much no aches and we were reveling in how soft something so firm could feel when sleeping on it.We got this mattress in Nov 2021. It is now almost May 2022 and unlike some reviewer complaints - we’ve not had any issue with the mattress denting or caving in. It still looks pretty much like it did when we got it. I weigh about 140 and my husband weighs about 180 - neither of our sides have dents. We have rotated it once since we’ve had it (just swapped what was the head end).It does run warm. Not as warm as full memory foam mattress. But it still runs warm. In the winter it’s actually fantastic. We haven’t tried it in the summer but we’ve already begun to see some warmer temps and I’ve found less blankets and lighter weight clothes was all we needed to adjust to manage the warmer mattress.I’ll try to update my review after a year has gone by. I hope Amazon keeps making these. They are comfortable, good quality and more affordable than similar options.",
                "reviewVotes": "68 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}