{
    "remaining_requests": 131,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mubulily-Mattress-Individually-Innerspring-CertiPUR-US/dp/B0CCNM161R",
    "body": {
        "name": "Mubulily Queen Mattress,10 Inch Hybrid Mattress in a Box with Gel Memory Foam Mattress,Individually Wrapped Pocket Coils Innerspring Mattress,Pressure Relief,Back Pain Relief,CertiPUR-US.",
        "price": "$195.99",
        "originalPrice": "",
        "rawPrice": 195.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mubulily-Mattress-Individually-Innerspring-CertiPUR-US/dp/B0CCNM161R",
        "soldBy": {
            "sellerID": "A11K1SFS75AVGY",
            "name": "SMJ-US",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html/ref=dp_merchant_link?ie=UTF8&seller=A11K1SFS75AVGY&asin=B0CCNM161R&ref_=dp_merchant_link&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CNH48BG7"
        ],
        "asinVariationValues": [
            {
                "asin": "B0CCNJK5BP",
                "variationName": "Style",
                "variationValue": "8 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCNM161R",
                "variationName": "Style",
                "variationValue": "10 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCNJ787L",
                "variationName": "Style",
                "variationValue": "12 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCNKTPGS",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCNKZS2V",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCNM161R",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0CCNM3K7H",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41wSMmpWZAL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/5149lhUvE L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/519HQxyHB9L.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51VTIGRuUkL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51NRpkTBcrL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51bdDkC9jTL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/A1x qvx5KJL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Mubulily Store",
            "link": "https://www.amazon.com/stores/MubulilyHybridMattress/page/6048675F-91E3-4608-8080-D84E7B5F4D99?ref_=ast_bln"
        },
        "brand": "MubulilyHybridMattress",
        "merchantInfo": "SMJ-US",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 330,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 18 hrs 49 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Better Support and Sweet Sleep:The Mubulily Queen Mattress features a unique combination of individually wrapped pocket coils and cooling gel memory foam, ensures that your weight is evenly distributed from head to toethe pressure point where the body contacts the mattress can be relieved, helping to eliminate your physical fatigue and pain.",
            "Adopt high-density:first-class thermal material, which is comfortable breathable and nature, and can discharge the steam and sweat from the contact surface between you and the mattress, allowing you to sleep comfortably. Mothers will never worry about their children sweating or catching cold in hot or humid weather.",
            "High-quality Top Spring : spring mattresses are made of high-quality knitted fabrics, All memory foam is CertiPUR-US certified and tested to be free of harmful substances,Made without fiberglass, this mattress is a safer and healthier option for your home.",
            "Isolated Motion: built-in high-quality independent pocket spring and slow rebound sponge, which can effectively absorb the noise and vibration caused by turning over during sleep, don’t disturb your companions, and sleep peacefully,which can effectively avoid movement interference between partners, allowing for deep, uninterrupted sleep.",
            "Worry-Free Purchase: Mubulily Mattress comes with 100-night trial and 10-year warranty. We recommend allowing 72 hours for the mattress to return to its full shape. When unwrapping the mattress, be sure to keep a safe distance, as it may expand quickly. If you have any issues or concerns, our customer support team is always here to assist you."
        ],
        "description": "",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "80\"L x 60\"W x 10\"Th"
            },
            {
                "name": "Item Weight",
                "value": "71.5 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Mubulily"
            },
            {
                "name": "ASIN",
                "value": "B0CCNM161R"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 330 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#846 in Home & Kitchen (See Top 100 in Home & Kitchen) #6 in Mattresses"
            },
            {
                "name": "Date First Available",
                "value": "July 24, 2023"
            },
            {
                "name": "Size",
                "value": "Queen"
            },
            {
                "name": "Special Feature",
                "value": "Pressure Relief, Breathable"
            },
            {
                "name": "Fill Material",
                "value": "Gel Memory Foam"
            },
            {
                "name": "Brand",
                "value": "Mubulily"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Material",
                "value": "Gel Memory Foams, Memory Foam"
            },
            {
                "name": "Item Firmness Description Medium",
                "value": "Age Range (Description) Kid"
            },
            {
                "name": "Construction Type Hybrid, Memory Foam",
                "value": "Item Weight 32.5 Kilograms"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f42231c-a346-4981-ac55-60d09e2a79d6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/73ce79d9-eac1-46c5-a0b3-63e5b044abca.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c9a0761a-9b89-4d09-81b0-22b78b3190c6.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/da1aa449-0214-456a-bb35-d1ccba5b1b0f.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/494c1b99-1971-4f3f-84f8-bcb67e221f06.__CR0,0,970,600_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "mammasteed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4QRSP3KQMFYFUZD7ATXCK53I4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUDXRRBS9Y9H3?ASIN=B0CCNM161R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "5.0 out of 5 stars For the price, this is excellent",
                "reviewText": "So, this is the first time I've ever purchased a cheap mattress. I am the girl who usually buys the mattresses that are several thousand dollars.So, anyway, I did not know what to expect with this. I didn't even get to test it in advance. I just took a gamble and tried it.Well. So, it came in a box that was plenty tall, but way too, well, narrow. My first thought was, what the hell? My second thought was, that can't be the mattress, can it? Well, yes, it is.What I learned was that somehow or other, probably using dark magic or something, they deflated it and rolled it up to get it into the box. They also sealed it into plastic.Well, this is extremely convenient for getting the mattress into the room you want. It is a lot easier to maneuver this rolled-up mattress than it is to maneuver a queen-sized mattress.That said, this mattress is extremely heavy. I needed two people to lift it - not because it's bulky, which of course it is because it's a mattress, but because of the weight. That is definitely an issue for someone who lives alone, or someone who lives in a household where one (or even zero) people cannot manage very heavy things. If you are in this situation, plan to get someone to help you move it, or else it will be decorating your porch or entryway for a while until you figure that bit out.I have no clue why it is so heavy. Other mattresses are not this heavy... at least, I've never had one anywhere near this heavy before. It is baffling.But, anyway. At least it is easier to navigate through doorways than a fully-inflated mattress, because it is rolled up. Make use of that bonus.Once you get the mattress to where you want it to go, you release it from the plastic. They warn you to step back when you do this, and they are not kidding. It was like my mattress suddenly gasped for a breath of air, and its \"lungs\" expanded.That said, they ALSO tell you to wait 72 hours after it begins the inflation process. This, too, they are not kidding about. The mattress continued to inflate, slowly but surely, for at least that amount of time.It is my understanding that you absolutely should not use it, even so much as doing a test-sit, until the mattress is done inflating. It is my understanding that if you do, you can prevent the mattress from fully inflating (ever), and thereby have a less-than-stellar mattress which is awful and lumpy and thin (at least in some spots). Well, I did not test that theory. I closed the door to my room to make sure even the dogs and cats did not sit on it until it was done inflating. I would strongly suggest you do the same, if you want this mattress to be the best it can be in the end.Obviously, that creates a short-term problem. WHERE do you let this mattress inflate? You could put it on your bedframe, but if you do (and it's not a new guest bed or some such), then where do you sleep for 3 or 4 nights? You could put it on the floor NEXT to your bed, but that takes up a lot of floor space. And, too, if you have kids or pets, or even if you're just clumsy, you run the risk of someone stepping on it while it's inflating. So, basically, I think most people will find that it disrupts your household quite a lot for that time period.Well, then, you're asking, why do I still give it a good star rating? Well, see, now, that issue is temporary. Yes, it's a pretty big, pretty annoying issue. But, once it is finally done inflating, it's done. You have your mattress then. Problem over.And, yes, the quality of the mattress once you finally can lie on it is good. Very good.No, it doesn't compare to the luxury of a multi-thousand dollar mattress. I would be lying through my teeth if I said it did. The super-expensive mattress is definitely better.But for the price you pay, this mattress is AMAZING. It's pretty comfortable. It cradles your body a bit while you sleep.I admit... I haven't had it long enough to know if the greatness lasts. But it is pretty great so far.I also will say that you do sort of sink in a bit more than you might be used to with more traditional mattresses. As a side effect, the mattress gives you a bit warmer sleep than a regular mattress. If you are a cold person when you sleep, you will probably find this a bonus. It's like an underneath blanket snuggling you, sort of, kind of. But if you sleep hot and find yourself kicking blankets off in the middle of the night, then you will probably find this a minus.I do wonder if that makes this bed somewhat better in winter and somewhat worse in summer. Well, I'll find out in time, for sure.It is my understanding that this type of bed is supposed to be a good bed for about 5 years, maybe a bit less. So, if you are seeking a bed that will last 10, 20, 30 years, nope, this is not it. But it is a very affordable option that will get you a really nice bed right now. And if you don't need or want that sort of longevity in a mattress, then this might be exactly what you are looking for.I'm not looking forward to hauling it out when its lifespan is done, on the theory that it will be as heavy then as it was when we moved in it... but that's a future problem.Count me a happy customer who is sleeping just fine.",
                "reviewVotes": "68 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CynthiaCynthia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFR6J2UWHEQIIVAMISIG2GHPZRLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RT2NPFIFV0RMN?ASIN=B0CCNM161R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Comfy and affordable",
                "reviewText": "I've never tried a hybrid mattress, but I needed a new bed set so I ordered this 12\" queen size mattress. It arrived in a large cardboard box, a heavy box, so I knew it would substantive. I followed the opening instructions carefully. It came fully compressed inside a heavy plastic sheath. I opened the sheath first, then unrolled the inner plastic , which contained my mattress. A small opening tool was included, basically a letter opener type thing, and slit open the final packaging. As soon as it got some air, it started to expand. It was very quick and easy, and within a couple minutes it was nearly fully decompressed. I was expecting a stale-air plastic smell and was pleasantly surprised that there was none. After letting the bed \"grow\" for a couple days, I put it to the test. Wow! Very comfortable! The inner springs provide plenty of support and the foam top provides the soft comfort I like. The fabric seems durable and the size is as advertised. I've been able to sleep on it for a week and I've slept better and longer than on my old mattress. I've already recommended it to family and friends. So far, a very good purchase.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71NpzZbkPhL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "J KimJ Kim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3FQOUWO62TTCNEYOLZVPIXONQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QSUMNVP68RGV?ASIN=B0CCNM161R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars This Mattress is Fantastic!",
                "reviewText": "I recently purchased the Mubulily 12-inch Memory Foam Mattress, and it has been an absolute game-changer for my sleep quality. I cannot express enough how impressed I am with this mattress.First and foremost, the construction feels solid and durable, and the stitching is flawless. Additionally, the mattress comes with a 10-year warranty, which is a testament to the manufacturer's confidence in their product.Another standout feature is the motion isolation. My partner's movements during the night no longer disturb my sleep, thanks to the individually wrapped coils that absorb and minimize motion transfer. It's truly a blessing for light sleepers or those who share their bed with a restless partner.Setting up the mattress was a breeze. It arrived conveniently compressed in a box, and once unboxed and placed on the bed frame, it expanded to its full size within a few hours. No hassle, no fuss!Overall, I highly recommend the Mubulily 12-inch Memory Foam Mattress to anyone in search of a luxurious and supportive sleep experience. Its combination of comfort, cooling technology, and durability make it worth every penny. Trust me, you won't be disappointed with this purchase!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41363UlILoL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41nX20GLjvL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kyle James",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2VWY5WPLX4VMP4CRZCVIXQYIMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RO1EHU8YBY6S?ASIN=B0CCNM161R",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Looks fine, haven’t slept on it.",
                "reviewText": "I have sat on and laid on the bed and it feels like it is comfortable enough. I needed an affordable mattress for my guest bedroom and this seemed like a decent deal. I haven’t slept on it, but it does not feel like it would be a bad sleep.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NicoleNicole",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJN2RMQUCG6WLJ55M5HOVLQMIPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E8FDQSO9L38O?ASIN=B0CCNM161R",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "5.0 out of 5 stars Quality & comfy queen mattress in compact box, so convenient!!",
                "reviewText": "I was looking for a queen mattress that would be delivered right to my door. I remember the days when I would need to rent a big truck to fit a big mattress in it and what a pain it was to get it up the stairs, especially a few flights up in a tight hallway! I ordered this mattress with Amazon Prime and it was here in 2 days, it doesn't get more convenient than that! The box was compact considering how big a queen mattress is! It will be easier if you have 2 people to bring it in and up the stairs, the box is about 70 lbs. I unpacked the mattress and gave it about 3 days to decompress before I slept on it. Overall I'm very happy with it!! The gel memory foam is very comfortable, the material is nice, and it looks well made and modern. I love that it gives me support but that it's not overly firm, I didn't want it to be hard as a rock. I would say it's somewhere between plush and firm which is perfect for me. I've dealt with back pain and sleeping on this has been great, it's almost like the mattress relieves pressure because it conforms to my body (even when I'm tossing and turning some nights). I've been sleeping very well on it so I'm very happy with my purchase, especially for the great price!! I also love that the company gives 100 days to try it out, as well as a 10 year warranty. So worth trying it out, nothing to lose and only good sleep to gain!!",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61heEJKd+UL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}