{
    "remaining_requests": 66,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Olee-Sleep-Aquarius-Mattress-10FM02F/dp/B073VLQ5JR",
    "body": {
        "name": "Olee Sleep Full Mattress, 10 Inch Gel Memory Foam Mattress, Gel Infused for Comfort and Pressure Relief, CertiPUR-US Certified, Bed-in-a-Box, Medium Firm, Grey, Full Size",
        "price": "$238.99",
        "originalPrice": "",
        "rawPrice": 238.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Olee-Sleep-Aquarius-Mattress-10FM02F/dp/B073VLQ5JR",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJMNKKTS"
        ],
        "asinVariationValues": [
            {
                "asin": "",
                "variationName": "Color",
                "variationValue": "Black",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/4168yMz3rWL._SS36_.jpg"
            },
            {
                "asin": "B016WJWC5I",
                "variationName": "Color",
                "variationValue": "Blue",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41EOo09jXAL._SS36_.jpg"
            },
            {
                "asin": "B073VLQ5JR",
                "variationName": "Color",
                "variationValue": "Grey",
                "price": "",
                "variationImageURL": "https://m.media-amazon.com/images/I/41awg-816rL._SS36_.jpg"
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81T8hEJjudL._AC_SY450_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/C12qOttWX3L.pdf",
            "userManualLink": "javascript:void(0)"
        },
        "byLineInfo": {
            "name": "Visit the Olee Sleep Store",
            "link": "https://www.amazon.com/stores/OleeSleep/page/276CAC7B-8784-472E-9CDB-A49116033CA5?ref_=ast_bln"
        },
        "brand": "OleeSleep",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 44459,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Tomorrow, February 12. Order within 6 hrs 11 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[ Dimensions ] - 75 x 54 x 10 inches",
            "[ 4 Layers ] - 1.5\" Cooling Gel Memory Foam + 1.5\" High Density Foam + 2.5\" Convoluted High Density Foam + 4.5\" High Density Foam",
            "[ Temperature Regulating ] - Cooling gel memory foam disperses body heat and regulates temperatures, creating a pleasant sleeping experience while maintaining the right body temperature",
            "[ Pressure Relieving ] - Responsive, medium firm, foam layers adapt and conform to unique body contours, providing optimal comfort while targeting all pressure points",
            "[ Stable Support ] - Durable high density foam guarantees stable support through excellent motion transfer and uniform weight distribution",
            "[ Premium Cover ] - Polyester spandex grey jacquard fabric resists wrinkles and enhances flexibility & durability, ensuring the CertiPUR-US certified mattress is both breathable and protected against moisture, dust and debris",
            "[ Bed-in-a-Box ] - Smart shipping & delivery with vacuum-sealed packaging technology. Please allow the product to rest in room temperature for 72 hours to fully expand and recover"
        ],
        "description": "Olee Sleep 10 Inch Grey Gel Memory Foam Mattress offers temperature control, pressure relieving comfort, and painless sleep experience. We create a multi-layer structure for comfort. Cooling gel memory foam provides heat and temperature regulation. High responsiveness allows foam to adapt to body shapes & movements, for pressure relief and motion isolation. The convoluted foam targets pressure points & promotes airflow. High density foam gives support & integrity. The durable polyester jacquard fabric wicks moisture and protects mattress against dust and debris. The mattress provides exceptional comfort, support, and heat regulation. With perfect motion isolation, supportive design, and temperature regulation, Olee Sleep's mattress guarantees the best sleep quality you've ever experienced.Olee Sleep's vision is to elevate sleep experience by incorporating proprietary technologies and innovative solutions that boast exceptional quality and offer unique features.Material- Polyester Spandex Jacquard: Polyester spandex cover provides breathability, flexibility, and dust protection.- Cooling (I-Gel) Memory Foam: Cool gel infused memory foam technology designed to keep temperature cool through the night.- High Density (HD) Foam: High density foam & memory foam synergy provides enhanced support and top comfort experience.- Convoluted High Density (HD) Foam: Textured foam improves weight distribution, comfort, and air circulation.Product's Certifications- CFR 1632/1633: Certification of mattress for standard flammability resistance.- CertiPUR-US: Certification of polyurethane foam for indoor emissions, product performance, physical durability, and environmental responsibility.- OEKO-TEX: Certification of textile product for human and natural ecosystems safety.Product comes with a 10-year Manufacturer Warranty.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "‎45.2 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "75\"L x 54\"W x 10\"Th"
            },
            {
                "name": "Country of Origin",
                "value": "‎Indonesia"
            },
            {
                "name": "Item model number",
                "value": "‎VC10FM02F"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Assembled Height",
                "value": "‎10 inches"
            },
            {
                "name": "Assembled Width",
                "value": "‎54 inches"
            },
            {
                "name": "Assembled Length",
                "value": "‎75 inches"
            },
            {
                "name": "ASIN",
                "value": "B073VLQ5JR"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 44,459 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,890 in Home & Kitchen (See Top 100 in Home & Kitchen) #41 in Mattresses"
            },
            {
                "name": "Date First Available",
                "value": "October 24, 2015"
            },
            {
                "name": "Size",
                "value": "Full"
            },
            {
                "name": "Special Feature",
                "value": "Temperature Regulating, Body Contouring, Pressure Relief, Low Motion Transfer"
            },
            {
                "name": "Fill Material",
                "value": "Gel Memory Foam, High Density Convoluted Foam, High Density Foam"
            },
            {
                "name": "Brand",
                "value": "Olee Sleep"
            },
            {
                "name": "Color",
                "value": "Grey"
            },
            {
                "name": "Model Name",
                "value": "Gel Infused Memory Foam"
            },
            {
                "name": "Product Care Instructions",
                "value": "Spot Clean Only"
            },
            {
                "name": "Cover Material",
                "value": "Polyester"
            },
            {
                "name": "Comfort Layer Material",
                "value": "Gel Memory Foam"
            },
            {
                "name": "Item Firmness Description Medium Firm",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Memory Foam",
                "value": "Item Weight 45.2 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Why Olee Sleep? No More Sleepless Nights Sufficient quality sleep is one of the three pillars of a healthy lifestyle, along with good nutrition and regular exercise. That’s why Olee Sleep puts a lot of care to construct this memory foam mattress to grow and adapt with your sleeping patterns. The memory foam material will learn to contour around your body, preventing you from turning over frequently, giving you better long lasting sleep. We believe quality sleep is a basic foundation of good health, more energy, and a happy home. Personalized Comfort Waking up with aches and pains can mean you slept in an uncomfortable position that put strain on your neck or back. We don’t want that for you, so our engineers crafted a perfect solution that can truly personalize your needs. These layers can provide adapted temperature regulation, unique contouring support, individual pressure points targeting, and full motion transfer reduction. All of them just for you. Say hello to Olee Sleep. Say goodbye to back aches, neck pain, excessive heat, and all of your previous frequent sleep interruptions. Long Lasting and Durable Made with a combination of soft and firm Olee dura material for the perfect medium firm feel, our first love, Aquarius gel memory foam mattress, features the right amount of support and comfort. We use quality material to ensure the foam layers stay in that perfect condition, delaying all sags and indentations for years to come. This perfect blend offers you the best of both worlds all through the night, every night. Please don’t blame us if you oversleep. It’s because we really care about you. CertiPUR-US Certified Our foams are analyzed and certified to meet strict guidelines for content, emissions and durability. At Olee Sleep, we not only care about how we manufacture our premium foam layers, but we also take responsibility for the impact they have for our consumers and the environment. With CertiPUR-US certified layers, you can rest assured you’ve made the best decision in your mattress for both your loved ones and the environment.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d867f230-614a-4bdf-8858-2c6eb107b37b.__CR0,0,600,600_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/715e5b83-c0b3-4dd7-9764-c19edb65d35a.__CR0,0,600,600_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f539a59-ce19-4ad4-9dda-80ee6ac4f832.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53890789-7d65-4efe-a81b-c3b692867c28.__CR0,0,600,600_PT0_SX220_V1___.jpg"
                ]
            },
            {
                "media_text": "Olee Sleep 10\" Memory Foam Mattress, Blue Olee Sleep 10\" Memory Foam Mattress, Grey Olee Sleep 10\" Memory Foam Mattress, Black Olee Sleep 10\" Premium Cool Silk Memory Foam Mattress Profile 10\" 10\" 10\" 10\" Firmness Medium Medium Medium Medium Cover Material Polyester Polyester Polyester Cool Silk, Polyester Base Material Cooling Gel Memory Foam, High Density Foam, High Density Convoluted Foam Cooling Gel Memory Foam, High Density Foam, High Density Convoluted Foam Cooling Gel Memory Foam, High Density Foam, High Density Convoluted Foam Premium Cooling Gel Memory Foam, High Density Foam, High Density Convoluted Foam Features Temperature Regulation, Body Contouring, Pressure Relief, Motion Isolation Temperature Regulation, Body Contouring, Pressure Relief, Motion Isolation Temperature Regulation, Body Contouring, Pressure Relief, Motion Isolation Enhanced Cooling Properties, Temperature Regulation, Body Contouring, Pressure Relief, Motion Isolation CertiPUR-US Certified ✓ ✓ ✓ ✓ Mattress in a Box ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a96c5059-db2d-4f62-92e0-edf487eb2b34.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f9fa278e-8df6-4e75-9a35-56f6bf44d260.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/172244af-ccec-4321-b322-b377d341eb3a.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d867f230-614a-4bdf-8858-2c6eb107b37b.__CR0,0,600,600_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/715e5b83-c0b3-4dd7-9764-c19edb65d35a.__CR0,0,600,600_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0f539a59-ce19-4ad4-9dda-80ee6ac4f832.__CR0,0,2000,2000_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53890789-7d65-4efe-a81b-c3b692867c28.__CR0,0,600,600_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f95c232a-f592-4d2e-9669-19f67bf9949e.__CR604,0,1150,2300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/00b5c4ab-5520-4bf2-9bde-1a2722417436.__CR677,0,1150,2300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/971d24ea-f92f-4ee6-a2f5-8ebea6432cb0.__CR687,0,1150,2300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ddbb9835-0131-48bb-85bc-da7274c52990.__CR152,288,833,1667_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M. Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFOWF3BYYOAFYWEHW6XJHMXX7GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LWEPPQ05ZZRC?ASIN=B073VLQ5JR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2018",
                "reviewTitle": "5.0 out of 5 stars Get this bed. What are you waiting for? Quality, affordability and comfort",
                "reviewText": "EDIT: 20 month post purchase update (original review below)-So far so good. I felt like this mattress has a little more “give” where I sleep. I’m not the kind of person who sleeps all over the bed. I sleep in one spot. So, when I moved to my new home, I turned it around and it has solved the problem. The area where I slept before shows no signs of the “give.” I sleep alone, so I don’t know how it affects couples. I’m 5’3”, 165lbs (160cm, 75Kg).I do recommend a mattress protector only because of the porous fabric. I learned this on the night of the pukies from my three-year-old daughter.In other news, I recommended this mattress to a friend and she bought it. She sleeps more soundly than she did on her innerspring mattress. I have added the photos from when we unzipped and let the mattress decompress. SHE LOVES IT. She says she read the conflicting reviews, but decided it was worth it because I wouldn’t shut up about it. If she only gets a few years out of it, she still thinks it’s a worthwhile investment because her sleep is so much better and her aches and pains are about gone. Her FitBit has shown a much better sleep pattern.Almost two years later and I’m still in love with this mattress and the frame I bought to go with it.I waited to write this review after having this mattress for about six months. I like to have a product a while before writing a review. When this bed arrives, it comes in a box that is about 18\"x 18\"x 48\". That's an estimated size by memory. You pull the bed out and lay it out. It comes compressed and folded in half. Then, check for the zipper on the bed. Make sure that is on the bottom and open the plastic. The bed begins to decompress. Let it decompress for 24-48 hours. I let it decompress for 48 hours because I was moving into a new apartment and I had the time to do it. I put it on the Home Life Cloth Light Beige Cream Linen 51\" Tall Headboard Platform Bed with Slats Queen - Complete Bed 5 Year Warranty Included 008 Home Life Cloth Light Beige Cream Linen 51\" Tall Headboard Platform Bed with Slats Queen Bed and it looks amazing.Pros: Comfort! It does NOT sleep hot. I don't feel myself tossing and turning at night. I lay there, and I sink in, but not too much. It doesn't take too much effort to move like some lower density mattresses. Sheets do not slip off and they hold really well, so that's a big plus. The soft fabric covering the mattress holds sheets well and the stitched in pattern does not bleed through on white sheets. When I sit on the edge to play my guitar, it's the perfect height and my back feels great- better than any chair.Cons: I see a lot of reviews about the smell. I have a hyper sense of smell. The chemical smell dissipated in a few hours. I did not detect it at all after about six hours. Get the plastic the mattress came in out of your house if you don't want the smell lingering. The mattress is heavy, but that just indicates the quality of the product. Besides, all mattresses are heavy unless they are full of air. When it's cold, the bed becomes harder. When its hot, the bed is softer. Keep that in mind when adjusting the temp of the room. And when I say cold, I'm talking 35 degrees F. I left the heat off when I went out of town and the bed was denser than usual when I got back. I warmed up the room and it went quickly back to normal. On hot nights it is softer. I doubt you're sleeping in freezing temps, so this isn't a big deal.All in all, this thing is a great buy. I'm glad that Amazon has made it as a recommended product. It's comfortable and priced well. The queen sized one works well with a slat bed and after six months has continued to provide a restful night sleep. I'll try to remember to give it another review at the one year mark.",
                "reviewVotes": "1,578 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cat Lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHIRNZR35OCJEU4K2TYROGUQAKBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R271RL252TQV8O?ASIN=B073VLQ5JR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2017",
                "reviewTitle": "5.0 out of 5 stars Perfect",
                "reviewText": "This mattress is perfect. I ordered a Queen size.All my life I've slept on spring/coil mattresses and have grown to really hate them as I age because the springs cause more pain than they do anything else.When I saw this mattress and it's affordable price (budget friendly) I wanted to give it a try and get away from the 21-year-old spring mattress that I have been sleeping on.This mattress is packaged in a large, heavy box and wrapped in plastic. It unrolls after you pull the plastic off and then unfolds. Once I had all the plastic off of the mattress it started to fluff up and was the full 10\" within 3 hours. I was able to sleep on it the same night it arrived. There is a slight \"new\" smell that has been on every memory foam mattress topper I've bought, so this, of course, will go away in a few days and isn't too strong or overwhelming.Actually, this mattress is pretty light compared to the old spring mattress I have and found it to not be a problem putting it on the frame by myself.I do want to note this mattress is firm but not painful firm like a spring mattress that causes so much pain from coils that poke into your joints and body as you sleep. This mattress is firm at first but once you settle in the foam contours to your body and makes it very comfortable to sleep.Generally, I have trouble sleeping on anything firm, like my old mattress, even at 21 years of use, it is so firm that it feels the same as day 1 (painful and like sleeping on a slab of concrete).I have 2 back injuries and laying down on my back or stomach is very painful. Mostly I am a side sleeper but even then on a spring mattress, I wake up several times a night from either my shoulders and hips hurting so badly that I can barely roll over to the other side without feeling like my bones are shattering, but my arm falls asleep. It is hard for me to get comfortable on my old mattress and I wake up in more pain than I went to sleep in.WIth this mattress, I can lay down and quickly settle, even on my back without waking up in severe pain or with my arm falling asleep. In fact, I can sleep a whole night comfortably and wake up without pain. I'm amazed by that and know now that it is the mattress that caused so much pain all these years to my already painful bones.On all the mattress toppers I've had before, and there have been many, they all slept hot. I'd wake up even in winter sweating and with this mattress, I don't wake up sweating. It actually feels cool and comfortable.I really can't say enough good things about this mattress. It is light to move around and even on a platform bed frame, I can't feel the metal underneath. It feels like I am sleeping on a cloud. My bones don't ache anymore from sleeping and I am not waking up multiple times a night in pain. And I don't really like firm mattresses anymore, not after my old nightmare mattress that felt like sleeping on concrete. But this one is much different from being on a spring mattress and is also firm but very comfortable.Pros:Light to move aroundThick enough not to feel the metal bed frame on a platform frameFirm but not something you sink into or are uncomfortable on. Contours to the body and feels like sleeping on a marshmallow.Same thickness as a traditional spring mattress, 10\" of softness and no springsGood qualitySleeps cool, not hotHas a zippered cover that is plush and soft2 people can sleep on this mattress and not feel each other move or get upDid I mention it feels like sleeping on a marshmallow?Cons:0If you haven't tried this mattress yet and are in the market for a budget-friendly (could even sleep with it on the floor if you don't have a frame and be comfortable), firm yet very cozy, good quality mattress, this is the one. I am happy to have found this mattress and would recommend it to everyone looking for an upgrade from spring mattresses. I'll never go back to another spring mattress again. Not even my son (almost 3 years old) sleeps on a spring mattress. My son sleeps on a much smaller version of this mattress, of a different brand (Graco crib mattress) but still feels the same firmness (comfortable as well) and he sleeps the night through.",
                "reviewVotes": "78 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Damian Cruz",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 22, 2023",
                "reviewTitle": "Buenisimo",
                "reviewText": "Por el precio tenia algo de dudas, el unico pequeño detalle que dire es que al crecer no llego a las 10\" (25cm) se quedo en 23-24 sin embargo eso no cambia el hecho de que es bastante comodo y por el precio no he tenido mejor colchón, lo compre para un departamento que rento y me gusta más que el colchón de mi casa, sin duda en cuanto pueda conseguire otro, es como dormir en una nube, se hunde un poco al estar sobre el aunque hay que tomar en cuenta mi fisionomia. 175cm de altura y peso de 100kg, sin embargo no es nada incomodo y las cosas se mantienen en su lugar.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marvin C. Marvin C. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 4, 2023",
                "reviewTitle": "A Last Minute Decision",
                "reviewText": "After being Skeptical about buying a box mattress for the first time, I have to say I am moreeee then amazed. Wrapping was good, box in great condition, easy to instal and exactly 48hrs later ready to sleep on it.Has that breeze feeling, soft enough for my like, and makes no noise what so ever. It was the last one in stock and I just went for it because of all the good reviews. 500$ and change but Worth it!!!TOTALLY RECOMMEND IT !!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71-8M-GCVtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon CustomerAmazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2021",
                "reviewTitle": "Not as advertised",
                "reviewText": "I purchased 3 of these for my teenage kids as Christmas gifts as they were all wanting memory foam mattresses. This was supposed to be a 10” twin. Instructions said to allow 48-72 hours for foam to fully inflate.We lay them flat and they slowly increased in size. We unzipped the cover and exercised the foam daily in an attempt to get them to fully inflate. It has now been 6 days and none of them has inflated to more that 7 1/2 “ at the maximum. They have not recovered evenly and the head and foot of the beds have only expanded to about 6”. The mattresses are not level to the head and foot dip downwards making for a uncomfortable sleep.We opened the cover and the foam at the head and foot of the bed appears melted. Almost like a hot knife cutter was used and it has compromised the foam. There is no way this foam will recover to 10” - especially at the head and foot.The kids have not been able to use. I do not see them expanding to anywhere near the advertised 10”. The. box said 10” but wondering if the wrong mattress was packed or if these 7 1/2” mattresses are just falsely advertised as 10”. I have 3 of these and they are all defective and not as advertised. These are most disappointing.Update: I contacted Amazon to see about a return. A return label was generated and refund will be issued once shipped.However they will not go back in the box as they have obviously expanded. I contacted Amazon customer service and they said I can find another box to ship. So now I need to source 3 cardboard boxes large enough to ship an inflated twin mattress.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71hFawBoNjL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zBb5e+R-L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61FBR3PzleL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+QB1uPwEL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Viridiana Vázquez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 26, 2021",
                "reviewTitle": "Nunca alcanzo la altura (25 cm)",
                "reviewText": "Es un colchón muy suave, tuve que devolverlo porque nunca alcanzo la altura que decía, solo de la parte de en medio llego a 20 cm y el resto ese quedo en 10 cm por lo que recostarse era incomodo porque se hacía un arco y tu espalda quedaba arriba y la cabeza y los pies casi tocaban el piso.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anxelica",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 22, 2024",
                "reviewTitle": "Muy cómodo",
                "reviewText": "No le doy las 5 estrellas porque en una esquina no se termino de levantar por completo, así que quedó un poco más bajito de esa parte que, si bien con la colcha no es notable, sin ella si. Pero está cómodo y las medidas corresponden",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}