{
    "remaining_requests": 118,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ashley-Furniture-Signature-Design-Innerspring/dp/B07C93L8Y8",
    "body": {
        "name": "Signature Design by Ashley King Size Chime 12 Inch Medium Firm Hybrid Mattress with Cooling Gel Memory Foam",
        "price": "$459.99",
        "originalPrice": "$634.12",
        "rawPrice": 459.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ashley-Furniture-Signature-Design-Innerspring/dp/B07C93L8Y8",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CQ51371M"
        ],
        "asinVariationValues": [
            {
                "asin": "B07BNS7M21",
                "variationName": "Style",
                "variationValue": "8 inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07C93H4YF",
                "variationName": "Style",
                "variationValue": "10 inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07C93L8Y8",
                "variationName": "Style",
                "variationValue": "12 inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B09BDDCBXG",
                "variationName": "Style",
                "variationValue": "Euro Top with Memory Foam",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07C93H4YD",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07BNS7WFG",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07BNS7T6V",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07C93L8Y8",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07BNRWM9Z",
                "variationName": "Size",
                "variationValue": "California King",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71HgR86dzcL._AC_SX679_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81kDNr5O-TL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/81kDNr5O-TL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the Signature Design by Ashley Store",
            "link": "https://www.amazon.com/stores/AshleyFurniture/page/9BD0FF61-A3F9-4233-B198-ED21F0E0B1AF?ref_=ast_bln"
        },
        "brand": "AshleyFurniture",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 44869,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 16 hrs 47 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "HYBRID MATTRESS: For supportive, dreamy sleeping. This mattress brings it home with layers of padding atop individually power packed innerspring coils with 2 perimeter rows for a better night's rest",
            "12\" PROFILE: Mattress is designed with gel memory foam, upholstery grade comfort support foam, and 360 individual power packed wrapped coils for maximum lumbar support. Quilt foam gives you that soft, cozy comfort you crave",
            "PLUSH SUPPORT: Includes a .75\" high density gel memory foam, 1\" upholstery grade support foam and 1.5\" soft quilt foam for extra lumbar support",
            "KING SIZE: Measures 76\" W x 79.5\" D x 12\" H and is compatible with most king bed frames. Bed foundation, box spring and frame available, sold separately",
            "ARRIVES IN A BOX: Simply unbox, cut the protective wrap, unroll and watch the mattress expand. Mattress is safe to sleep on immediately but can take 72+ hours for any residual scent from packaging to dissipate and for the mattress to completely expand."
        ],
        "description": "Enjoy endless possibilities for restful sleep with this hybrid innerspring king mattress. Feel the support of a truly traditional coil mattress which contours to your body for a comforting feel. High density foam provides the firmness you love. Gel memory foam provides restorative support for your lower back. Plus, this mattress arrives in a box for quick and easy setup. Simply bring it to your room, remove the plastic wrap, and unroll. Foundation/box spring available, sold separately. When searching for bed frames, look no further than our wide selection and value. Give your mattress an instant upgrade with showstopping headboards and sleek frames that even have storage options. From neutral shades to bold lighting, our bed frames pack a punch of character that’s sure to instantly elevate your room into a suite. And we go the extra mile to package, protect and deliver your purchase in a timely manner.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "79.5\"L x 76\"W x 12\"Th"
            },
            {
                "name": "Item Weight",
                "value": "94 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "Ashley Furniture"
            },
            {
                "name": "ASIN",
                "value": "B07C93L8Y8"
            },
            {
                "name": "Country of Origin",
                "value": "China"
            },
            {
                "name": "Item model number",
                "value": "M69741"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 44,869 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,948 in Home & Kitchen (See Top 100 in Home & Kitchen) #28 in Mattresses"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Refill",
                "value": "Gel Memory Foam, High Density Foam"
            },
            {
                "name": "Care instructions",
                "value": "Spot clean"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "King Mattress"
            },
            {
                "name": "Size",
                "value": "King"
            },
            {
                "name": "Special Feature",
                "value": "Lightweight, Breathable"
            },
            {
                "name": "Fill Material",
                "value": "Gel Memory Foam, High Density Foam"
            },
            {
                "name": "Brand",
                "value": "Signature Design by Ashley"
            },
            {
                "name": "Color",
                "value": "King"
            },
            {
                "name": "Coil Type",
                "value": "Pocketed Coil"
            },
            {
                "name": "Model Name",
                "value": "M69741"
            },
            {
                "name": "Product Care Instructions",
                "value": "Spot clean"
            },
            {
                "name": "Comfort Layer Material",
                "value": "Gel Memory Foam"
            },
            {
                "name": "Item Firmness Description Firm",
                "value": "Age Range (Description) Kid, Toddler"
            },
            {
                "name": "Construction Type Hybrid",
                "value": "Item Weight 94 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Chime 8 Inch Innerspring Chime 10 Inch Hybrid Chime 10 Inch Memory Foam Chime 8 Inch Memory Foam Chime 12 Inch Memory Foam Profile Height 8 Inch 10 Inch 10 Inch 8 Inch 12 Inch Mattress Type Hybrid Hybrid Memory Foam Memory Foam Memory Foam Firmness Type Medium Firm Medium Firm Medium Firm Medium Firm Medium Firm Sleep Positions Back, Side, & Stomach Back, Side, & Stomach Back, Side, & Stomach Back, Side, & Stomach Back, Side, & Stomach Sizes Available Twin, Full, Queen, King Twin, Full, Queen, King, California King Twin, Full, Queen, King, California King Twin, Full, Queen, King Twin, Full, Queen, King, California King",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/602deadc-e3d5-4838-8c6b-b33a15e3b763.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fade219b-f50d-497b-af5f-d75e9b1165e4.__CR0,2,1280,396_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ab2b632-4ce5-4217-aafb-bbbf27ac421a.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d707dd26-7cdb-4006-8ba1-7c418705a8c6.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0ab34c61-db48-4c36-bbf5-ed156ba08a31.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5e63dd3-406d-4ada-8e58-28862a57d5e9.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2e010419-4c5c-4c18-96f9-e49ae693f4bc.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/422e62c6-6939-4af2-a706-e2fa39fb9f70.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a0dbb2d1-eb59-406f-afc0-f94e1457392c.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEC3ZRB5MFTAZIVTC434H3DE2HWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IJ7O3DSAB7RP?ASIN=B07C93L8Y8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2022",
                "reviewTitle": "5.0 out of 5 stars Mattress itself is great, but learn from my mistakes.",
                "reviewText": "UPDATE, Dec 23, 2022: Two weeks of use so far, and I'm a new man. I haven't cursed anyone out in a week. I haven't threatened to throttle anyone in days. I've managed to stay awake the entire day for the last week instead of nodding off on my lunch break at work. I'm getting a daily workout from sprinting to the bathroom in the morning because I'm sleeping straight through the night instead of waking up multiple times to pee.The mattress isn't sink-right-in cushion-y. I'm 5'8\" and around 250lbs at the moment (might change soon, I have the energy to exercise now!), it offers good support without being rock hard and that support does make a difference...my back has been almost completely pain-free for a week now that I'm adjusting to it. The top isn't super-squishy, but it pads the mattress comfortably. I'm a side-sleeper who rolls onto my back during the night, and it supports both positions perfectly. Also easy to get up from (I have a very low bed and a sassy knee), it's got a touch of springiness but not too much. Again, I don't care about the aesthetics, so my fitted sheet is pinning the corners down and I never bothered to check to see if they fully puffed up or whatever. So far, I feel like I got a good value for my money, and I'm legitimately shocked at the difference the right mattress can make. Still five stars.ORIGINAL: I'll preface this with the admission that I haven't slept on this mattress yet. Once I give it a little bit of time, I'll return and adjust the review as necessary. As of today, December 10 2022, five stars.A few years ago, someone bought me a mattress without my input that met exactly 0 of my sleeping needs, and my back has been more contorted than a yoga instructor ever since. I searched Amazon for a plush, full-size, mattress-in-a-box out of agonized desperation, and I never went past the second line of the search results because this was one of the top suggestions.I have furniture from Ashley Furniture that I love, so I felt comfortable with the brand. It was on sale for a great price, it had a delivery date available for this weekend, it was a hybrid mattress, and it came in a box. Surely, this was a sign from heaven. I ordered one, and then my sieve-like brain promptly forgot all about it.I ordered a mattress-in-a-box because I, in all my obnoxiously overconfident non-wisdom, believe I can do anything despite possessing noodley arms and brittle, middle-aged bones. I wanted something compact enough to handle on my own, without having to re-enact the FRIENDS \"pivot\" scene with any of my equally dimwitted acquaintances.The mattress delivery is coordinated with Ashley Furniture, so you pick your delivery day upon ordering. You can have the service bring the mattress in and set it up for you if you want to pay a little extra, but I opted to have it delivered in my home entryway to deal with myself. In the preparation guidelines, it's stated you'll be notified at the phone number you provide when your delivery is near and can follow along on a tracker until it arrives.I woke up at 6:55 this morning to my dog losing her mind because a another early morning delivery landed on my doorstep. Tired, confused, and substantially achy, I puttered around contemplating the universe for around 10 minutes before my phone went off to alert me my delivery was imminent. I was halfway through reading this text message when there was a knock on my door. Still confused, still tired, and looking as dapper as ever in my bedhead and pajamas, I opened the door to allow two delivery men to bring the surprisingly early box into the house.I definitely suggest having another person to help out with this. Most people will say that's obvious, but I know there are guys out there like me who scoff in the face of reason. It's not impossible to handle by oneself, but help is...well, helpful. I had to take the bound mattress from the box to maneuver it upstairs alone, which I did by bear-hugging it and hauling it up, one step at a time. It's about as heavy as any other mattress (which isn't extremely heavy, but the bulk makes them difficult), so not awful, but it probably wasn't safe for me to carry it up that way.The mattress is wrapped in an outer layer of plastic to be removed once you're ready to place it, and when you have it where you want it you can cut the last restraining plastic. It opens right up, fully formed and ready to go. The middle of the foam pops up pretty much instantly, but the corners are a little flat and probably need more time.I didn't measure the mattress to test against some of the other reviews' size complaints. I don't care if the corners never puff up perfectly. I laid down to test it once it was open and my back, accustomed to my concrete slab of a previous mattress, began crackling like a bowl of cereal. I stayed there for five minutes and vertebrae I didn't realize I still had started expanding back into shape. It's comfortable, it's supportive, it's nice, and it's affordable.I'll have to re-assess after I've slept on it for a little bit to see how it stands up, but so far it looks like a surprisingly good mattress. Just remember: 1) have help available, 2) don't forget you ordered a mattress, and 3) if your delivery window begins at 7am then be dressed and ready by 7am.",
                "reviewVotes": "643 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meezer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI4CMXAFSWD33MCE7WUZP2KWB4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1KD65KMTBCOC7?ASIN=B07C93L8Y8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2018",
                "reviewTitle": "5.0 out of 5 stars Worth Every Penny Two Years and Going Strong!",
                "reviewText": "I am a single woman who recently lost 200 pounds and my old mattress was wrecked, I needed a new one but didn't have a 1000 bucks for a new one. I'd been a loyal Spring Air Customer. So I did my homework and looked at mattresses in my local stores. The mattress you are looking at was the one I chose. For a Full Size it was 599 dollars plus tax from the store. I really didn't have it. I was going to finance it through the store. But, I kept thinking maybe I should check on Amazon first. I thought I might be able to save a few dollars. When I was able to get the very same mattress (no tax) delivered to my home for 190 dollars on the nose, well I clicked and bought it right away. I was scared of a bait and switch or maybe a counterfeit product I will admit. I could not have been more wrong, the mattress was the real thing and delivered to my home in two days. I will also sat it was heavy but I was able to wrestle it in the house and followed the instructions to open it. I was almost send through the wall when it \"popped\". Be careful, they tell you there is 2 layers of plastic to cut through and there is not. When you cut its going to pop out and start unfurling. So be ready for the expansion. The mattress came to full size almost immediately although I let it alone on the box springs all day and let it rise before putting linens on it. I let a fan blow on it all day but there really was not an odor. I've slept on it every night since 8-9-18 and couldn't be happier. No pain (and I have back troubles and fibromyalgia) and it looks wonderful. I have it on my box springs that are Spring Air and were in fine condition. Its firm but not so much it is painful or anything. I like it so far. I will occasionally come back if my opinion changes. I will be happy if this lasts a few years or longer. I have had this 2 years now and can't tell it has ever been used, a real value. Still a great matress after all this time 3/17/21; Still doing great 4 years later, my granddaughter sleeps over with me and says it's so comfy. Her dad bought the same mattress and loves it. Five years later 7/28/23 still going strong, might get another in the near future in case they would quit carrying them. They have jumped 100 dollars on the price point. I know inflation, so I guess you still can't beat the price. Okay it's now been about 6-7 years and I am ready for a new mattress and I will be buying another one of these mattresses, I am still using my old box springs but the mattress is wearing out now.",
                "reviewVotes": "2,692 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chantelle FessChantelle Fess",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 13, 2022",
                "reviewTitle": "Great quality bed despite coming in a box",
                "reviewText": "I was unsure at first about the quality of a bed that comes in a box BUT...my son loves this mattress! He said it's very comfortable and it has kept it's shape really well. As you can see in the pictures, it's quite thick! We followed the instructions on letting it take shape after removing it from the box and it took just over a day but was worth the wait! Was surprised at how thick and solid this was after being in a box. Would definitely recommend this product to anyone looking for a quality reasonably priced mattress!**Frame not included, bought it separately**",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711cpETCFFL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/711WYlgSnsL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61enhBC0L2L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephanie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 12, 2021",
                "reviewTitle": "Not 12 inches but I slept great on this bed.",
                "reviewText": "Thank goodness I decided to switch my mattress for a better one(Ashley 12 inch Chime). My sibling has this mattress and I was given positive feedback. I got the firm because that’s what I prefer to sleep on. I experience zero back pain and it’s very comfortable to sleep on. Despite my mattress not reaching 12inches after 5 days of giving it extra time to fully expand, I would still recommend this mattress to anybody seeking a peaceful night’s sleep. Most certainly worth the money.I had back issues sleeping on another mattress from a different brand here on Amazon. Not only were the seams coming apart, but the bed was very uncomfortable to sleep on.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thoris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 1, 2023",
                "reviewTitle": "Reasonably comfortable - durability unknown",
                "reviewText": "Seems well made and reasonably comfortable. We'll see how it stands up.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joan ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 18, 2021",
                "reviewTitle": "Great mattress",
                "reviewText": "Great mattress, had already purchased one, but couldn’t get another at the local furniture store, I was ecstatic when I discover this same one. Now I’m looking to get another BUT it has gone up in price. I will keep looking. Very comfortable. You won’t go wrong by purchasing this.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rhonda",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 9, 2022",
                "reviewTitle": "Comfortable",
                "reviewText": "We are very pleased with our purchase. Firm and comfortable. No weight transfer moving. Easy unpacking and putting together.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}