{
    "remaining_requests": 112,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Olee-Sleep-Ventilated-Convolution-08FM01F/dp/B010TYBICU",
    "body": {
        "name": "Olee Sleep Full Mattress, 8 Inch Gel Memory Foam Mattress, Gel Infused for Comfort and Pressure Relief, CertiPUR-US Certified, Bed-in-a-Box, Medium Firm, Full Size",
        "price": "$128.00",
        "originalPrice": "$154.00",
        "rawPrice": 128.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Olee-Sleep-Ventilated-Convolution-08FM01F/dp/B010TYBICU",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0CJN34HLV"
        ],
        "asinVariationValues": [
            {
                "asin": "B010GLBM1I",
                "variationName": "Style",
                "variationValue": "6 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B010TYBICU",
                "variationName": "Style",
                "variationValue": "8 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B012JEG2AG",
                "variationName": "Style",
                "variationValue": "9 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B010TYBICK",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "Twin XL",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B010TYBICU",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B010TYBIJI",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "10",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/61MIJnsqTwL._AC_SX450_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Visit the Olee Sleep Store",
            "link": "https://www.amazon.com/stores/OleeSleep/page/276CAC7B-8784-472E-9CDB-A49116033CA5?ref_=ast_bln"
        },
        "brand": "OleeSleep",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 10635,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 19 hrs 46 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "[ Dimensions ] - 75 x 54 x 8 inches",
            "[ 4 Layers ] - 1\" Cooling Gel Memory Foam + 1\" High Density Foam + 2.5\" Convoluted High Density Foam + 3.5\" High Density Foam",
            "[ Temperature Regulating ] - Cooling gel memory foam disperses body heat and regulates temperatures, creating a pleasant sleeping experience while maintaining the right body temperature",
            "[ Pressure Relieving ] - Responsive, medium firm, foam layers adapt and conform to unique body contours, providing optimal comfort while targeting all pressure points",
            "[ Stable Support ] - Durable high density foam guarantees stable support through excellent motion transfer and uniform weight distribution",
            "[ Premium Cover ] - Polyester spandex jacquard fabric resists wrinkles and enhances flexibility & durability, ensuring the CertiPUR-US certified mattress is both breathable and protected against moisture, dust and debris",
            "[ Bed-in-a-Box ] - Smart shipping & delivery with vacuum-sealed packaging technology. Please allow the product to rest in room temperature for 72 hours to fully expand and recover"
        ],
        "description": "Olee Sleep 8 Inch White Gel Memory Foam Mattress offers temperature control, pressure relieving comfort, and painless sleep experience. We create a multi-layer structure for comfort. Cooling gel memory foam provides heat and temperature regulation. High responsiveness allows foam to adapt to body shapes and movements, for pressure relief and motion isolation. The convoluted foam targets pressure points & promotes airflow. High density foam gives support & integrity. The durable polyester jacquard fabric wicks moisture and protects mattress against dust and debris. The mattress provides exceptional comfort, support, and heat regulation. With perfect motion isolation, supportive design, and temperature regulation, Olee Sleep's mattress guarantees the best sleep quality you've ever experienced.Olee Sleep's vision is to elevate sleep experience by incorporating proprietary technologies and innovative solutions that boast exceptional quality and offer unique features.Material- Polyester Spandex Jacquard: Polyester spandex cover provides breathability, flexibility, and dust protection. - Cooling (I-Gel) Memory Foam: Cool gel infused memory foam technology designed to keep temperature cool through the night.- Convoluted High Density (HD) Foam: Textured foam improves weight distribution, comfort, and air circulation. - High Density (HD) Foam: High density foam & memory foam synergy provides enhanced support and top comfort experience.Product's Certifications- CFR 1632/1633: Certification of mattress for standard flammability resistance.- CertiPUR-US: Certification of polyurethane foam for indoor emissions, product performance, physical durability, and environmental responsibility.- OEKO-TEX: Certification of textile product for human and natural ecosystems safety.Product comes with a 10-year Manufacturer Warranty.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Item Weight",
                "value": "‎39.9 pounds"
            },
            {
                "name": "Product Dimensions",
                "value": "75\"L x 54\"W x 8\"Th"
            },
            {
                "name": "Country of Origin",
                "value": "‎Indonesia"
            },
            {
                "name": "Item model number",
                "value": "‎VC08FM01F"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "‎No"
            },
            {
                "name": "Assembled Height",
                "value": "‎8 inches"
            },
            {
                "name": "Assembled Width",
                "value": "‎39 inches"
            },
            {
                "name": "Assembled Length",
                "value": "‎75 inches"
            },
            {
                "name": "Weight",
                "value": "‎36.38 Pounds"
            },
            {
                "name": "ASIN",
                "value": "B010TYBICU"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 10,635 ratings 4.5 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,527 in Home & Kitchen (See Top 100 in Home & Kitchen) #26 in Mattresses"
            },
            {
                "name": "Date First Available",
                "value": "July 2, 2015"
            },
            {
                "name": "Size",
                "value": "Full"
            },
            {
                "name": "Special Feature",
                "value": "Temperature Regulating, Body Contouring, Pressure Relief, Low Motion Transfer"
            },
            {
                "name": "Fill Material",
                "value": "Gel Memory Foam, High Density Convoluted Foam, High Density Foam"
            },
            {
                "name": "Brand",
                "value": "Olee Sleep"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Model Name",
                "value": "Gel Infused Memory Foam"
            },
            {
                "name": "Product Care Instructions",
                "value": "Spot Clean Only"
            },
            {
                "name": "Cover Material",
                "value": "Polyester"
            },
            {
                "name": "Number of Layers",
                "value": "4"
            },
            {
                "name": "Item Firmness Description Medium Firm",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Memory Foam",
                "value": "Item Weight 39.9 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Olee Sleep Tri-Folding Mattress Topper Olee Sleep 8” Memory Foam Mattress Olee Sleep 10” Memory Foam Mattress Olee Sleep 12” Hybrid Spring Mattress Olee Sleep 9” Modern Steel Frame Olee Sleep 14” Heavy Duty Steel Frame Available Profiles 4” 6”, 8”, 9” 10” 10”, 12” 9”, 14” 14”, 18” Available Sizes Single, Twin, Twin XL, Full, Cot Twin, Twin XL, Full, Queen, King Twin, Full, Queen, King, Cal King Twin, Full, Queen, King Twin, Twin XL, Full, Queen, King Twin, Twin XL, Full, Queen, King, Cal King Available Colors Blue, Grey White Blue, Grey, Black White Black Black Firmness Soft Medium Medium Soft, Firm - - Base Material Memory Foam Memory Foam Memory Foam Pocket Spring Steel Steel CertiPUR-US Certified Foams ✓ ✓ ✓ ✓ - - Mattress in a Box ✓ ✓ ✓ ✓ - -",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/83332cd4-60ca-4635-a9ae-da520dcdced3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/09172ef4-5589-4b02-8de2-f81dab4d9a55.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1ac80c4c-db4c-4c73-92a7-426df5ecf667.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/849a8c17-4e16-496e-989a-893787fd6947.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8d3cabf-a4ea-434e-9e11-1836c0ecc578.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bca3ea77-d5a1-4e54-a0ed-3322059a925c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a5221c60-b9e4-4ae8-a7ab-cde7c525d910.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e6059a5b-443f-4927-b776-d46da269ec6e.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/21ef41b8-f2f2-4c96-8138-134afc17f81c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fd2789e1-e689-4642-879f-086fa06f9aa7.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kyla Diaz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETTABICELFORLWYQCCPJ44VFPSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IN90EV4XXNIO?ASIN=B010TYBICU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Blissful Comfort: A Review of My Olee Gel Memory Foam Full Mattress",
                "reviewText": "I recently purchased the Olee Gel Memory Foam Full Mattress, and it has transformed my sleep experience. Here's why I can't stop raving about it:Unmatched Comfort: The gel memory foam provides an incredible level of comfort. It contours to my body, offering the perfect balance of support and softness. Every night feels like a dream.Cooling Technology: The gel-infused memory foam does an excellent job of regulating temperature. I no longer wake up feeling overheated; instead, the mattress keeps me cool and comfortable throughout the night.Full-Body Support: The mattress provides full-body support, alleviating pressure points. I wake up without any aches or stiffness, which has significantly improved my overall sleep quality.Quality Construction: The construction of the Olee mattress is top-notch. The materials used are durable, and the craftsmanship is evident. It's a long-term investment in quality sleep.Undisturbed Sleep: The mattress effectively minimizes motion transfer. This means that even if there's movement on one side of the bed, the other side remains undisturbed, allowing for a peaceful night's sleep.Overall, I am thrilled with my Olee Gel Memory Foam Full Mattress. It's not just a mattress; it's a ticket to a restful and rejuvenating night's sleep. If you're in search of unparalleled comfort and quality, I highly recommend giving this mattress a try. It's a game-changer!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MKC's mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEAGUTKKUFSFBUNYSOPPMI5GZ23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HKSYRBH7B6QB?ASIN=B010TYBICU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 11, 2016",
                "reviewTitle": "5.0 out of 5 stars This bed is AWESOME!! ***UPDATED AFTER MONTHS OF USE!!",
                "reviewText": "Shipping was very fast and I received it earlier than I expected. My one year old son and I have been sleeping on an air mattress because our pillow top mattress was involved in a hit and run accident during our last move about two months ago. I knew I wanted a memory foam mattress (I LOVE my mom's) so I read tons of reviews on tons of different memory foam mattresses. It was really difficult to choose one.I was pleasantly surprised that there wasn't a bad odor when I removed the packaging from my mattress. I read some reviews on other mattresses saying that their mattress nearly killed them when opening it because it sprung to life. Thankfully, that did not happen to me even though I was prepared for it. I'm sure I looked like a SWAT team member opening the package. It rolled out nicely and immediately began expanding once the plastic wrap was removed. It had a new smell but it was very very faint.I read on the instructions that it may take 72 hrs to fully expand, but I considered sleeping on it the first night because it had already expanded the full eight inches. BUT as difficult as it was, I waited until the second night lol 😁This is my second night of sleeping on it and all I can say is that it feels amazing. It isn't hard in my opinion, but not so soft that you feel like you're being eaten by a marshmallow (I'm claustrophobic so that would never work). I would say it is medium firmness. It actually conforms to your body. I haven't gotten hot either and I'm one of those people that cannot sleep hot. There's absolutely no smell at all now. It actually vanished within a few hours. One thing I did notice is that this bed is a good bit larger than my queen pillow top mattress. I was planning on using the same box spring under this mattress but I'm thinking I might need a platform bed or something longer and wider. It definitely isn't a problem for me since I need all the room I can get (my little one is a bed hog).Overall, I'm extremely pleased with my decision to buy this mattress. I really hope it lasts for a long time. I'll definitely update this review in a few weeks. Hopefully, I'll still be loving it. For all you fellow mattress hunters out there, this bed is awesome!**** UPDATE*****Okay so I said I would update in a few weeks, but it's obviously been a lot longer than that. 4 or 5 months, I guess? The point is, I'm still as happy with this mattress as I was the first night I slept on it. It still looks brand new and there aren't any indentations from where we sleep on it every night. And I pretty much sleep in the exact same spot every night. Since this was a worry of mine, I'm happy that it's holding strong. Honestly, I've never slept on a bed that is more comfortable. Not even once have I gotten hot in this bed and I live in the south. I read a review saying that it isn't suitable to use on a platform bed and I'm confused as to why the buyer thought this. I ended up buying a platform bed since this mattress was too big to fit on top of my box spring. It hasn't affected the comfort or condition of this mattress. I'm super happy with this purchase and I've even considered buying another one in king size since I'm expecting baby number two. My mom agrees that this mattress is even more comfortable than hers, which she bought on sale for $1,200 at a mattress store. I'll update again as time goes on, but I don't foresee me feeling any different about this incredible mattress. I hope not anyway, since I love it so much!",
                "reviewVotes": "36 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RC shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHNGDWQSEYBLXE6UYWUFEWWQJ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S9LVE9SK8PIE?ASIN=B010TYBICU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 13, 2020",
                "reviewTitle": "5.0 out of 5 stars The price was right and the mattress is nice!",
                "reviewText": "After looking at twin mattresses and the price range for them I came across this \"Olee Sleep 6 inch Ventilated Multi Layered Memory Foam Mattress\". They were about $70. I read up on the different layers of the mattress in its description. I also read the good and the bad reviews. The bad reviews did make me hesitate buying this mattress. I read a couple reviews stating the mattress did not expand to the full 6 inches. I remember one reviewer complaining about the corners didn't expand properly and others about a chemical smell. I hesitated but found myself coming back because of the price, the 6 inch thickness and \"the multi layered combination of memory foam and High density Support Foam\". The price was right not to minchin I needed two twin mattresses so I took the chance and purchased two of these \"Olee Sleep 6 inch Ventilated Multi Layered Memory Foam Mattress\" and I'm glad I did. I knew for the price I wasn't getting a \"Tempurpedic\" but I did want it comfortable enough for a child to sleep on. When the mattresses arrived I opened them up and placed them on the bed and let the expand. There was a slight chemical smell but it wasn't pungent. The light chemical smell dissipated as the mattresses expanded to size. They both have no chemical smell after the mattresses expanded to there full twin 6 inch thick size corners as well. I have laid on the mattress and they are supportable and comfortable for even an adult. I thought I would feel the bars of the the day bed frame while sitting or laying on the matters but I don't. My final thoughts on this \"Olee Sleep 6 inch Ventilated Multi Layered Memory Foam Mattress\" is it is worth buying. Keep in mind the money your spending and I feel if you are a reasonable thinker this mattress will live up to or exceed your expectations.",
                "reviewVotes": "37 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sunshine Ladybug",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZGISN5QTARFQ6U2IOYSA3DXZFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DQ2H52YAT1DJ?ASIN=B010TYBICU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars perfect for our guest room",
                "reviewText": "This is perfect for our guest room, laid flat very quickly and is very comfortable. The price is good and product I would buy again",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sew much more",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 20, 2023",
                "reviewTitle": "So far",
                "reviewText": "This was purchased for a gift. So far they like itDelivered on time",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}