{
    "remaining_requests": 55,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LUCID-Inch-Twin-Hybrid-Mattress/dp/B0774QBC52",
    "body": {
        "name": "LUCID 12 Inch Hybrid Mattress - Bamboo Charcoal and Aloe Vera Infused - Memory Foam and Encased Springs - Medium Plush Feel - Bed in a Box - Pressure Relief and Motion Isolation - Twin XL Size",
        "price": "$335.99",
        "originalPrice": "",
        "rawPrice": 335.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LUCID-Inch-Twin-Hybrid-Mattress/dp/B0774QBC52",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B07X6VVJXR"
        ],
        "asinVariationValues": [
            {
                "asin": "B0774T2DH7",
                "variationName": "Size",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0774QBC52",
                "variationName": "Size",
                "variationValue": "Twin XL",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0774MRNNT",
                "variationName": "Size",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0774YTYF7",
                "variationName": "Size",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0774N97YT",
                "variationName": "Size",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0774TGDZ1",
                "variationName": "Size",
                "variationValue": "California King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "",
                "variationName": "Size",
                "variationValue": "Split King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0775YNZ42",
                "variationName": "Style",
                "variationValue": "10 inch Mattress Only",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07987DJ7H",
                "variationName": "Style",
                "variationValue": "10 inch Mattress and Adjustable Base",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0774QBC52",
                "variationName": "Style",
                "variationValue": "12 inch Mattress Only",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B07988CGBF",
                "variationName": "Style",
                "variationValue": "12 inch Mattress and Adjustable Base",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $18 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51upfz-HOYL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41e5F6RMPGL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41tPd5-6jIL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/415NE1sNPBL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41XN4oszTzL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41aTu8wulwL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51gLvAKfrdL.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/81RXHqBj0iL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91ZbysShETL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the LUCID Store",
            "link": "https://www.amazon.com/stores/Lucid/page/73AAE19B-2B34-4B07-B027-1D56CCCB9FD5?ref_=ast_bln"
        },
        "brand": "Lucid",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 10226,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Wednesday, February 14. Order within 17 hrs 39 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "Polyester Blend",
            "MATTRESS IN A BOX AND ARRIVES COMPRESSED: Your memory foam hybrid mattress is compressed, rolled, and arrives in a box right to your doorstep; mattress will expand more quickly in a warm room, but please allow 24-72 hours for mattress for full expansion",
            "BAMBOO CHARCOAL AND ALOE VERA INFUSIONS: Bamboo charcoal infusion helps eliminate odors and pulls moisture away from the skin for a naturally hypoallergenic bed while aloe vera-infused foam creates a calming sleep environment that promotes daily freshness",
            "PRESSURE RELIEVING MEMORY FOAM: This hybrid mattress has layers of springs, comfort foam, and memory foam that contour to your shape and align the spine for a perfect medium-plush feel and pressure relieving comfort all night long",
            "PREMIUM MOTION ISOLATION: Get undisturbed sleep with premium steel coils individually encased in foam to help isolate motion so you won’t feel your partner move in the night",
            "HYBRID DESIGN: Premium steel coils combine with layers of memory foam to create a super supportive and comfortable mattress for all sleep styles; all memory foam is CertiPUR- US certified, free from harmful chemicals"
        ],
        "description": "Combining all the best mattress materials and features in a box, we created the ultimate in comfort and sophistication: the LUCID 12 Inch Bamboo Charcoal and Aloe Vera Hybrid Mattress. Our 6.5-inch, individually encased, high-gauge steel coils are sandwiched between two layers of base foam for premium, durable support. Our motion-isolating base is topped with more foam and finished with a layer of aloe vera transition foam and a 2-inch layer of memory foam infused with bamboo charcoal for superior comfort. Snuggle in with the odor-reducing and moisture-wicking properties of bamboo charcoal and the calm and soothing effects of aloe vera for an unmatched night’s sleep. Topped with a classy circular knit cover, this foam mattress hybrid is sure to impress in the guest room or the primary bedroom. Compatible with an adjustable bed frame, slatted bedframe, box spring, and platform bed.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "80\"L x 38\"W x 12\"Th"
            },
            {
                "name": "Item Weight",
                "value": "54.7 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "LUCID"
            },
            {
                "name": "ASIN",
                "value": "B0774QBC52"
            },
            {
                "name": "Item model number",
                "value": "LU12TX38BH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 10,226 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#29,257 in Home & Kitchen (See Top 100 in Home & Kitchen) #114 in Mattresses"
            },
            {
                "name": "Thickness",
                "value": "12 Inches"
            },
            {
                "name": "Fabric Type",
                "value": "Polyester Blend"
            },
            {
                "name": "Refill",
                "value": "Encased Pocket Coil, Foam, Memory Foam"
            },
            {
                "name": "Care instructions",
                "value": "Do not wash. Do not use bleach. Do not machine dry. Do not iron. Do not dry clean., DO NOT REMOVE OR WASH COVER: Spot clean only, vacuum your mattress, sprinkle some baking soda on it. Use a scrub brush to gently rub the powder into the mattress and leave it for 10 minutes and vacuum the excess powder."
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Number of pieces",
                "value": "1"
            },
            {
                "name": "Warranty Description",
                "value": "10-year u. S. Warranty guards against manufacturer defects."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "Compressed Mattress"
            },
            {
                "name": "Size",
                "value": "Twin XL"
            },
            {
                "name": "Special Feature",
                "value": "Temperature Regulating, Hypoallergenic, Pressure Relief, Low Motion Transfer, Breathable"
            },
            {
                "name": "Fill Material",
                "value": "Encased Pocket Coil, Foam, Memory Foam"
            },
            {
                "name": "Brand",
                "value": "LUCID"
            },
            {
                "name": "Color",
                "value": "White"
            },
            {
                "name": "Coil Type",
                "value": "Encased Coil"
            },
            {
                "name": "Model Name",
                "value": "Lucid 12 Inch Hybrid Mattress – Bamboo Charcoal and Aloe Vera Infused- Memory Foam Mattress- Moisture Wicking – Odor Reducing See more"
            },
            {
                "name": "Product Benefits",
                "value": "Get the best of both worlds with our affordable hybrid mattress. The contouring comfort of memory foam and the durable bouncy feel of steel springs provide unbeatable value and medium-plush support. Perfect for any room or age. See more"
            },
            {
                "name": "Product Care Instructions",
                "value": "Do not wash. Do not use bleach. Do not machine dry. Do not iron. Do not dry clean., DO NOT REMOVE OR WASH COVER: Spot clean only, vacuum your mattress, sprinkle some baking soda on it. Use a scrub brush to gently rub the powder into the mattress and leave it for 10 minutes and vacuum the excess powder. See more"
            },
            {
                "name": "Item Firmness Description Medium Plush",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Hybrid",
                "value": "Item Weight 54.7 Pounds"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Lucid 10 Inch Hybrid Mattress – Bamboo Charcoal Memory Foam Mattress Lucid 12 Inch Hybrid Mattress – Bamboo Charcoal Memory Foam Mattress Lucid 10 Inch Latex Hybrid Mattress Lucid 12 Inch Latex Hybrid Mattress Material Bamboo Charcoal and Aloe Vera Infused Memory Foam Bamboo Charcoal and Aloe Vera Infused Memory Foam Natural Latex and Gel Infused Memory Foam Natural Latex and Gel Infused Memory Foam Feel Medium Firm Plush Medium Firm Firm CertiPUR-US ✓ ✓ ✓ ✓",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ce6949fc-47e7-4f3f-a755-5f1cf31f8ed7.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e3b26b-ac5c-40b7-8843-1added4e7838.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5688f934-5b76-42e8-a0af-1bd9645f5460.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a2825509-93b7-4975-b2c6-ee34f77efd5d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/52a9d98e-03e8-462b-adc3-59e03293c891.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/15630afd-520e-4ecb-9c37-ea6a86038415.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c7b3c61-5322-4498-be7b-0bcfae43b658.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e214fd82-0749-48e1-b165-a24b457754b1.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51a22395-86ab-4834-9525-346cb054e284.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0c218a4-79be-4d26-a262-a103b3c60509.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Evan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBIJ2LLR3NN33XNXZVA622A7HBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SVTTHLT1EE6L?ASIN=B0774QBC52",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 26, 2018",
                "reviewTitle": "5.0 out of 5 stars Impressed so far",
                "reviewText": "Having browsed several different mattresses and companies, I ultimately decided to give this bed a shot based on other customers' reviews and managed to catch it at an even further discounted price, though that has little at all to do with the review.I'll start by saying that I have only had this mattress for about a month at the time of this review, but thus far, I've been fairly impressed with it. The quality seems to be there; I'm fond of the stitching and the covering for the mattress itself. The zipper for it is a bit wonky, but nothing that isn't manageable. I washed the covering before sleeping on it and found that it went through the wash well; it didn't fray, shrink, or tear. Placing it back on the mattress was a bit awkward again due to the odd zipper layout, but can easily be done by one person alone with some patience.The mattress itself looks impressive at first glance. The layers seem thoughtful, the construction seems firm, and having never seen a pocket-coil hybrid mattress before, I rather like the uniqueness it offers by comparison to just a standard foam or spring mattress.To the touch, the top layer has the soft, almost slow give one expects from a foam mattress with little recoil; it almost seems to mold to the hand. Further still and you suddenly find a firm support that does offer that springy feeling of a more traditional mattress. In sitting first on the edge, I felt well supported. It was quite easy to stand from the mattress, and I didn't feel like I was being sucked into it. Laying down, again first on the edge, I still felt a comfortable support that, while not sinking towards the center, did not seem to want to throw me onto the ground either, something that a lot of foam mattresses struggle to provide.Lying down properly on my back in the center of the mattress, I gradually felt my weight sink into the foam layers as they contoured to my lower back and shoulders. It was here that I thought I might begin to feel that stuck-in-the-mud sensation; however, I was pleasantly surprised when I found the support of the encased coil springs, and sank no further. Turning from side to side was easy and required substantially less effort than I was used to from sleeping on an all-foam mattress: a nice perk.Flipping onto my side, I experienced much the same sensation. There was a little more pressure around my shoulder and hip; but, nothing that wasn't profoundly uncomfortable.Rolling onto my stomach, I found some decent support at my hips, something that stomach sleepers know all-to-well is paramount to getting a good night's rest. I felt comfortable; but, admittedly not as much as I did on my back, and I'm primarily a side and stomach sleeper. Still, it wasn't something I found profound enough to be a naysayer.As advertised, Lucid claims this is a plush to medium feel. Here, I'd have to disagree. This mattress is more of a medium to medium-firm feel; about a 6.5 out of ten if I had to put a number to it with 1 being plush and 10 firm. Of course, one's personal weight is a huge factor in perception, and for me, I'm 160lbs.Having slept on it for a little bit now, I have to admit that I am impressed. It sleeps quite cool which I appreciate immensely. I change positions frequently throughout the night, and the mattress facilitates these changes with minimal effort. While I cannot speak much for the Bamboo Charcoal and aloe vera infusion actually doing much for me or my sleep cycle, I don't feel like I paid a premium for them, so I don't mind how it's advertised. Plus, they do make the mattress itself look unique, and again, I like that divergence.Overall, I'd actually give this mattress a 4.5 in the short run that I've had it. For the sake of the company, I gave a 5 star review on amazon since amazon doesn't split the level there. The only conflicting thing I have to say about it is the firmness, which I think for most will likely be more on the firm side than advertised. But the price of the mattress in relation to its quality thus far is tantalizing, and in my opinion makes it a strong contender for anyone on a budget. I'd even pit it against other, more popular brands such as Casper, Tuft and Needle, bear, ect.",
                "reviewVotes": "62 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC7NJEDEW4WTVCO2DBFORE2QLXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2GXBEF8FYWBCX?ASIN=B0774QBC52",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Literally my best investment in years",
                "reviewText": "From someone who used to sleep on spring mattresses to this is a phenomenal experience and upgrade. The immediate pain relief on many parts of my body down to a more fulfilling sleep experience compared to the old style beds this mattress is worth the price for certain. One key factor is to be aware of your frame as well. Do not use your standard full flat bottoms for these mattresses. The mattress needs to be able to breathe and expand daily in my experience to feel the fullest benefits of this mattress. One can use the cheap wire metal frames sold by Amazon and it'll work just fine. I'm a big guy myself at 5'11 235+lbs and the frame holds fine. Over time the bed does crease as it conforms to your sleep positions and body. Just like other mattresses it can start to sank if it is not rotated eventually if you're heavier person like me. I rotate my mattress every so often maybe 1-3 months depending on the feel. The bed will also let you feel when it is needing or ready to swap around. The material used for layer by layer is very plush and comfortable also, and one of my favorite quality of the material is the bed does little to zero squeak when you get up or move around. If you're contemplating about buying this, just do it. It will be a worthwhile investment at 3/4 off of the price you'd find in store for something similar.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MessieJessie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2YITTU6MK6YHY56KWFMMCCQYFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CGUZ9CNLB8SQ?ASIN=B0774QBC52",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 24, 2019",
                "reviewTitle": "4.0 out of 5 stars Cautiously optimistic.",
                "reviewText": "We have only slept on this mattress for a week, and so far... it's really dang comfortable. But I can't speak to longevity. I've read reviews that say it goes bad after a couple months, what with sagging and the foam breaking down. I don't know yet how it's going to hold up, but I can speak to other aspects.First, the packaging is unbelievable. Was very impressed. The outer box was absolutely destroyed in shipping, but its 77 lbs and awkward as heck to move around. The Inner packing was however pristine. I strongly suggest opening the roll where it will reside. Moving it around after the fact is a bit of a PITA. But the overall construction is surprisingly good. For 400 ducks, is really as good or better than I expected. I was very pleased. To FULLY inflate, I'd say it took the full 48 hours. It looked fully inflated after about 6, but it got better and better the longer we waited, really up to about 48 hours, when the fabric looked fully stretched out to its proper final dimensions and the foam felt at it's full density. In terms of smell, it did have a slight smell of foam, and it still has the faintest of odors. But it was never even when first opened, anything more than noticeable. What remains dosen't bother either of us, and we dont even notice it unless we check to see if it's still there. It's not so much an off gassing as it is just the normal smell of foam. We also bought a 2 inch memory foam topper with bamboo cover that has been on the bed from the start. We encased both of these in a cover. We have only ever slept on the mattress in this configuration. The result is,,,, very different from what we are used to. But so far, we really like it. I am a side sleeper, 5 ft 6 in and 230 lbs, and I find it very comfortable so far. Because I am heavy, I found sleeping on my stomach painful in my ribs. But not with this setup. Its actually comfortable. Again, so far. We dont even want to try it without the topper now, and I'm hoping that the topper will also help preserve the integrity of the foam in the mattress. Both the mattress and topper have skid resistance bottoms that we also really appreciate. There is virtually no, or very little motion transfer. The topper let's you sink in, cradling your body shape. The memory foam in the mattress continues that trend further, but it's not working as hard as it would have to otherwise. Then you get to a firmness that suspends you without feeling like concrete. I imagine that's the transition foam and springs at work. You would think moving would be difficult, and it feels like it should be, but its just not. The foam bounces back surprisingly quickly, and is ready to remold itself to your new position. It's what I describe as shocking with how far you sink when you sit , kneel or stand on the mattress. It feels like you're never gonna stop sinking. This really worried me at first, but once you spread your weight across the mattress, it's a actually well calibrated. The sides of the bed have a stiffer foam that helps prevent the sides from collapsing away , and while effective enough, they could stand to have even more support. It's ok when lying down, but sitting on the edge of the bed is a bit disconcerting. Overall, we really like the mattress and topper combination so far. But we are still waiting for the othe shoe to drop. If we can reasonably get five good years out of this mattress, I will be ecstatic. If it collapses in the first year, I'm gonna be really upset. But so far so good. I'll update later on once time has passed.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan N.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 7, 2023",
                "reviewTitle": "Increíble, igual que un Sealy.",
                "reviewText": "Son tan buenos como un Sealy... te cuento. Ya había comprado en oferta colchones de esta marca versión infantil. Funcionaron muy bien, incluso con el peso de los adultos, Yo soy muy pesado y dormí bien en esos colchones. Así que me decidí a buscar algo para mi mujer y yo. Estuve mirando los siempre excelsos Sealy, fui a probarlos a las tiendas de colchones y estuve a punto de comprarlos. Pero al ver los sistemas de camas eléctricas me di cuenta de que los Sealy se veían iguales a estos. Todo apuntaba a que Lucid estaba haciendo clones de Sealy o al menos imitándolos en los detalles. No me equivoqué, estos colchones son EXCELSOS, el descanso es estupendo incluso para personas obesas como yo. Hay una capa de suavidad en la parte superior y firmeza capas adentro. Los uso con camas electricas gemelas y mi esposa duerme supercomoda. En sensación, son identicos a los Sealy de lujo. Otro detalle extra es que mido 1.84 y los colchones de largo estándar de 200 cm no me funcionan, mis pies quedaban demasiado cerce del frío del piso y tenía calanmbres nocturnos. Este lago extra de la versión Lucid XL me ayuda a tener los pies dentro del colchon con espacio de sobra, y adios a los calambres nocturnos. En resumen, son una excelente compra, son de alta calidad como los Sealy, sus capas están diseñadas para un confort de lujo y con el extra de grosor los obesos como yo dormimos mejor, el largo extra nos ayuda mucho a los altos y solo por la mitad de un colchón de lujo. Con todo lo que me ahorré me pude comprar un sistema de dos colchones individuales XL con bases eléctricas y aunque así estar a la mitad del precio del mismo sistema Sealy. Si has estado pensando en cambiar de cama y colchón o solo de colchón te lo recomiendo. La cama es el lugar donde tu cuerpo se regenera, es donde pasarás el 33% de tu vida, no escatimes en darte un lugar de descanso de calidad, noatarás en tu salud que has invertido y no gastado. Mal dormir acorta la vida, te lo comentó por malas experiencias. Saludos.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Georgina González",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2023",
                "reviewTitle": "Lo recomiendo",
                "reviewText": "Muy buen producto. La caja venía muy maltratada, pero el colchón en perfectas condiciones. Es realmente muy cómodo y a un precio muy accesible en relación a otras marcas. Lo recomiendo",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aarón H.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 29, 2023",
                "reviewTitle": "Suave y rígido a la vez",
                "reviewText": "Las primeras capas del colchón hacen que se sienta muy suave y blando, pero mantiene una rigidez muy buena después que evita que te hundas. Es un poco más largo que otros colchones que tuve, lo recomiendo para personas altas. Es pesado y se siente robusto, ahora el problema es levantarme de la cama al despertar 😅",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edith Rivera",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 18, 2021",
                "reviewTitle": "Excelente producto",
                "reviewText": "Muy cómodo y suave. Se adaptó perfecto a una cama eléctrica",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jackie M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 2, 2021",
                "reviewTitle": "Just what I needed.",
                "reviewText": "Last year I bought a mattress online from National Mattress during the first Covid lockdown. It was a SERTA 8 inch pillow top. Within a year, the mattress started to sag right down the middle and gave me a tremendous about of back and hip pain. I couldn't walk some days. Because I had spent $500+ on that mattress I didn't want to buy another mattress. But the pain was getting worse so I decided to try these memory foam mattress on a recommendation.This mattress surpassed my expectations 😁😊When the box arrived it was super heavy, so best to have 2 people to help maneuver. The unboxing was easy. it just rolled out of the first layer of plastic and then I cut the vaccum seal starting at the corner first, laying it flat on my box spring then flipped it over as we removed the plastic. I gave it 6 hours before I slept on it. By that time it was 70-80 % expanded. I would say it took about 24 hours before it fully expanded. I love the density it's impressive. It sat on my box spring just fine.I'm a combination sleeper and this mattress hits all of my pressure points and curves perfectly so NO more back pain or hip pain. I weight 145lbs, when I turnover I don't feel that bounce. Also the reaction is really good. With 2 people sleeping on this mattress approximately 350lbs + you do feel the motion of the other person, just not as much as you would on a spring/coil mattress.The Lucid 12 inch Mattress runs firm. I didn't bother putting my mattress topper on because of foam reaction. When I lay down it hugs my curves just right.After sleeping on it for 3 days now, I feel no more pain. Added bonus for me is that my bedframe no longer moves around or squeaks because the mattress is so heavy. If you have a box spring that is 6 to 8 inches, this 12 inch mattress gives you great height for those that climbing in bed, rather than flopping in bed.Overall, this was a great buy. I am really impressed by this Lucid mattress so far. It has given me pain relief, great comfort, the price was just right and when I wake up I feel ready to go not achy and in pain. Also shipping was pretty quick too even during the Covid delays! I highly recommend for those with lower back and hip pain.Update: I've had this mattress for a year now and it's still the best mattress I've ever purchased. I'm pain free. 😊",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}