{
    "remaining_requests": 97,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/LUCID-12-Inch-Queen-Mattress/dp/B0779JJSV5",
    "body": {
        "name": "LUCID 12 Inch Latex Hybrid Mattress - Responsive Latex Foam and Encased Springs - Firm Feel - Motion Isolation - Edge Support - Gel Infused - Pressure Relief - Bed in a Box - Queen Size",
        "price": "$510.25",
        "originalPrice": "$579.99",
        "rawPrice": 510.25,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/LUCID-12-Inch-Queen-Mattress/dp/B0779JJSV5",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": [
            "B0C9F38PLD"
        ],
        "asinVariationValues": [
            {
                "asin": "B0771MFY74",
                "variationName": "Size",
                "variationValue": "10 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0779JJSV5",
                "variationName": "Size",
                "variationValue": "12 Inch",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0779GHR57",
                "variationName": "Style",
                "variationValue": "Twin",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0779GJ5NY",
                "variationName": "Style",
                "variationValue": "Twin XL",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0779LW4HW",
                "variationName": "Style",
                "variationValue": "Full",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0779JJSV5",
                "variationName": "Style",
                "variationValue": "Queen",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0779JQFRG",
                "variationName": "Style",
                "variationValue": "King",
                "price": "",
                "variationImageURL": ""
            },
            {
                "asin": "B0779K2KGN",
                "variationName": "Style",
                "variationValue": "California King",
                "price": "",
                "variationImageURL": ""
            }
        ],
        "isPrime": false,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "Apply $58 coupon",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41poCsX7MhL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41eh h7pEpL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41F2eq0pZxL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/21h8UiDDauL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51Ed7LhYfJL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/41gCgfim7xL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51f6rNULCML.jpg"
        ],
        "imagesCount": 7,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "https://m.media-amazon.com/images/I/41FsfF5IOgL.pdf",
            "userManualLink": "https://m.media-amazon.com/images/I/91ZbysShETL.pdf"
        },
        "byLineInfo": {
            "name": "Visit the LUCID Store",
            "link": "https://www.amazon.com/stores/Lucid/page/73AAE19B-2B34-4B07-B027-1D56CCCB9FD5?ref_=ast_bln"
        },
        "brand": "Lucid",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 5666,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 16",
            "Or fastest delivery Thursday, February 15. Order within 17 hrs 44 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": [
            "MATTRESS IN A BOX AND ARRIVES COMPRESSED: Your latex hybrid mattress is compressed, rolled, and arrives in a box right to your doorstep; mattress will expand more quickly in a warm room, but please allow 24-72 hours for mattress for full expansion",
            "RESPONSIVE LATEX AND GEL FOAM: Premium latex foam gives this mattress a uniquely firm yet responsive feel that provides excellent support and comfort while a layer of gel memory foam assists in temperature regulation for a more comfortable sleep climate",
            "FIRM FEEL: Constructed with layers of latex foam, gel memory foam, support foam, and a supportive coil base, stomach sleepers and those looking to help alleviate back pain will love the firm feel of this latex hybrid mattress",
            "PREMIUM MOTION ISOLATION: Get undisturbed sleep with premium steel coils individually encased in foam to help isolate motion so you won’t feel your partner move in the night",
            "HYBRID DESIGN: Premium steel coils combine with layers of latex foam and gel infused memory foam to create a super supportive and comfortable mattress for all sleep styles; all memory foam is CertiPUR- US certified, free from harmful chemicals"
        ],
        "description": "At Lucid, we make beds for the whole family—because when you wake up feeling your best, your family gets the best version of you too. The LUCID 12-Inch Latex Hybrid Mattress will help you sleep cooler and enjoy greater body support from your bed. By combining supportive coils, plush memory foam, and responsive latex, we’ve compiled all the best materials to form the sleep dream team for your bed frame. This mattress in a box is supported by individually encased steel coil base sandwiched in foam for greater edge support and motion isolation, so you can sleep without interruption on your mattress. Comfort awaits.",
        "breadCrumbs": [
            {
                "name": "Home & Kitchen",
                "link": "https://www.amazon.com/home-garden-kitchen-furniture-bedding/b/ref=dp_bc_aui_C_1?ie=UTF8&node=1055398"
            },
            {
                "name": "Furniture",
                "link": "https://www.amazon.com/Furniture/b/ref=dp_bc_aui_C_2?ie=UTF8&node=1063306"
            },
            {
                "name": "Bedroom Furniture",
                "link": "https://www.amazon.com/Bedroom-Furniture/b/ref=dp_bc_aui_C_3?ie=UTF8&node=1063308"
            },
            {
                "name": "Mattresses & Box Springs",
                "link": "https://www.amazon.com/Mattresses-Box-Springs/b/ref=dp_bc_aui_C_4?ie=UTF8&node=3732961"
            },
            {
                "name": "Mattresses",
                "link": "https://www.amazon.com/Mattresses/b/ref=dp_bc_aui_C_5?ie=UTF8&node=3732981"
            }
        ],
        "productInformation": [
            {
                "name": "Product Dimensions",
                "value": "80\"L x 60\"W x 12\"Th"
            },
            {
                "name": "Item Weight",
                "value": "101.2 pounds"
            },
            {
                "name": "Manufacturer",
                "value": "LUCID"
            },
            {
                "name": "ASIN",
                "value": "B0779JJSV5"
            },
            {
                "name": "Country of Origin",
                "value": "USA"
            },
            {
                "name": "Item model number",
                "value": "LU12QQ70LH"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 5,666 ratings 4.4 out of 5 stars"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#107,102 in Home & Kitchen (See Top 100 in Home & Kitchen) #296 in Mattresses"
            },
            {
                "name": "Is Discontinued By Manufacturer",
                "value": "No"
            },
            {
                "name": "Thickness",
                "value": "12 Inches"
            },
            {
                "name": "Refill",
                "value": "Gel Memory Foam, Memory Foam, Latex"
            },
            {
                "name": "Care instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Assembly required",
                "value": "No"
            },
            {
                "name": "Warranty Description",
                "value": "10-year u. S. Warranty guards against manufacturer defect."
            },
            {
                "name": "Batteries required",
                "value": "No"
            },
            {
                "name": "Included Components",
                "value": "mattress"
            },
            {
                "name": "Size",
                "value": "12 Inch"
            },
            {
                "name": "Special Feature",
                "value": "Orthopedic, Hypoallergenic, Pressure Relief, Breathable, Low Motion Transfer"
            },
            {
                "name": "Fill Material",
                "value": "Gel Memory Foam, Memory Foam, Latex"
            },
            {
                "name": "Brand",
                "value": "LUCID"
            },
            {
                "name": "Color",
                "value": "12 Inch"
            },
            {
                "name": "Coil Type",
                "value": "Encased Coil"
            },
            {
                "name": "Product Benefits",
                "value": "Latex, memory foam & supportive coils to provide optimal support and comfort"
            },
            {
                "name": "Product Care Instructions",
                "value": "Hand Wash Only"
            },
            {
                "name": "Cover Material",
                "value": "Polyester Blend"
            },
            {
                "name": "Item Firmness Description Firm",
                "value": "Age Range (Description) Adult"
            },
            {
                "name": "Construction Type Hybrid",
                "value": "Item Weight 46 Kilograms"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "LUCID 10\" Latex Hybrid Mattress - Memory Foam LUCID 12\" Latex Hybrid Mattress - Memory Foam LUCID 10\" Mattress - Bamboo Charcoal and Aloe Vera Memory Foam LUCID 12\" Mattress - Bamboo Charcoal and Aloe Vera Memory Foam Material Natural Latex and Gel Infused Memory Foam Natural Latex and Gel Infused Memory Foam Bamboo Charcoal and Aloe Infused Memory Foam Bamboo Charcoal and Aloe Infused Memory Foam Feel Firm Firm Medium Firm Medium Firm CertiPUR-US Certified Certified Certified Certified",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d5b3e75e-1973-45c0-8cb8-00499444f5af.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3e3b26b-ac5c-40b7-8843-1added4e7838.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b529f6d5-3449-4133-a47b-b70ec14cb531.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c50788f-23ea-4864-8a76-ed76f6647449.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df4d833b-be67-43a3-94c2-b16a621a5fcf.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ee16ad19-8eab-4168-802c-452cafdefd3f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/51a22395-86ab-4834-9525-346cb054e284.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0c218a4-79be-4d26-a262-a103b3c60509.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c7b3c61-5322-4498-be7b-0bcfae43b658.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e214fd82-0749-48e1-b165-a24b457754b1.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "RaineRaine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPFFYJAQ34G5UF2GXHUMNR4PWJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20T7JYFSXNQFN?ASIN=B0779JJSV5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2018",
                "reviewTitle": "5.0 out of 5 stars Goldilocks would approve! w/ 6-month update",
                "reviewText": "Update. April 6, 2019:The mattress is still going strong. I know it's been only 6 months, but with previous mattresses we've had over the years, none of them made it past the 6-month mark before showing wear. So I believe this is a good sign.Original review: For the last year I've had insomnia due to my chronic pain from Lupus and because our old memory foam mattress apparently had amnesia. I spent over 30 hours ( spread out over several days) researching all kinds of mattresses, and everything one should know about them. I'm considering myself an expert now. Hehe. For our situation, based on everything that is out there, I decided we needed a latex and pocketed spring hybrid, which led me to two choices: this one and one on another website that cost $1700 and who's return policy was questionable. Or course we decided to try out this one. Funny and sad thing is that this was the first mattress that I saw in my research journey. I could have spared myself the 30+ hours of research.We needed a mattress that would sleep cool. I kept burning up at night with our old one. It's not fun. My research led me to two things that keep a mattress cool: latex and pocketed coils. So then I researched which types have the best support. My husband weighs 280 pounds, which is hard on mattresses, especially memory foam. Again, my research led me to latex and pocketed coils. They offered what we needed, soft feeling, but firm. We could have gone straight latex, from what I was reading, but that was very expensive, and my husband was convinced we needed coils because of his weight. Side support was another issue we were hoping to remedy. This mattress offers excellent side support. Sometimes I have to sleep on the side to let my arm hang over because of nerve issues, I can do that with this one and not feel like I'm going to fall off.Our previous mattress, a pure memory foam, failed us within a year. I think we might be partially responsible for that as we did not wait more than a few hours to lay on it because my husband refused to wait. It never rose completely. He kept measuring the sides only on that one, that had reached the desired measurement of 11-inches, but did not care about the head and foot of the mattress that was not anywhere near the required 11-inches. Well, my latest research suggests that all memory foam mattresses need to be aired out the entire duration recommended by the manufacturers to extend their longetivity. Once we lay on them, if they did not reach their full height, they never will. He was fussed at and educated by me on how his decision cost us, so he did not give me a hard time on the 48-hour wait with this mattress. In fact, I've been in so much pain, I was the one willing to cave on the recommended wait time about 24 hours in, but he put his foot down. LOL. So please, with whatever mattress you end up getting, wait the recommended time, even if it looks high enough. It's worth the wait.Onto what we think about this mattress...Let me first explain my situation, I've just recently been diagnosed with Lupus. For the last few years I've been on a steady decline in health and went from occasional pain, to all over massive pain accompanied by migraines, and now a lovely rash. I have nerve pain all over, fibromyalsia, arthritis, etc. I hurt 24/7. I just recently had to start walking with a cane. I'm just a little overweight, and until two years ago, I was doing 5k's three times a week. The last few months were unbearable. The pain and our old bed made it hard for me to get even 3 hours sleep. That would be a good night. This amazing Lucid mattress has changed my life. I'm getting a good 7+ hours sleep now, which for me is a miracle! I would probably get more sleep, but nerve pain still wakes me up, but not as bad. I've never slept in a bed as comfortable as this one. Ever. It even sleeps cool! My husband's snoring is almost non-existent now. He is sleeping soundly now. (Probably because I am. LOL.) We have no complaints so far. We just hope it gives us at least 5 years. If it does, we'll consider it money well spent.When we first rested on our LUCID 12-Inch King Latex Hybrid Mattress we said, wow, this is soft. Yet, we did not sink into the mattress and it really supported us. We are stomach and side sleepers. But I've tried out every position on this mattress, and really you can't go wrong. It's comfy no matter how you sleep. It's not too soft or too hard. It's just right for all of us Goldilocks sleepers. No pressure on joints or our back. It feels amazing. We can even cuddle again! Our old mattress couldn't handle that, leaving us feeling like we were slipping into a sinkhole. In this bed we can cuddle all we want.You've seen other pictures of what the mattress looks like, so I just included what ours looks like made up, and pictures of the condition of the box it arrived it. As you can see, the box arrived all battered up. It looks like UPS did their best to tape it up to keep it together. I want you to see these pictures because if you order this bed and it arrives this way, I don't want you to have the small heartattack I had. The mattress was so well wrapped inside of the box, it was unscathed. So fear not.From what I read it's best to have cotton sheets and a bedspread that is cotton, to help with keeping cool, with any type of bed. The best sheets I've found are at Sam's Club, their $40-$50 brand. They are wrinkle free, soft and silky, and feel just heavenly. They get softer every time you wash them and last for years. We just purchased the oversized king bedspread as seen in the picture, here on Amazon. It's another amazing find. It completely covers your bed so you do not need a bedskirt, which is helpful when rotating your memory foam mattress. You will find my review for this amazing bedspread when you click my name here, if you are searching for one. The manufacturer of our bedspread has other patterns/colors.I will update this review on how well this bed holds up. As of right now, we've only had this mattress a month. I'm good about updating my reviews, so we'll see how this dream mattress holds up and I'll let you know. Fingers crossed! Good luck on your mattress journey, whatever you decide.",
                "reviewVotes": "484 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/7167tHL+JQL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/7172fhHWa6L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71S8+UlAteL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/71XFVFYetzL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. K. Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSGMD2DW4MYQWJT6CBAG6UFH34Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KWTTFQY400FX?ASIN=B0779JJSV5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Light, Airy and Firm",
                "reviewText": "Terrific bed! Aches and pains are minimal since I’ve been sleeping on it. The layers of foam combined with the coils gives the perfect support for robust guys. Mattress conforms to spine and lower back areas, yet gives the correct amount of firmness. So it’s not mushy like other foam mattresses. Again, very supportive. Bed feels sturdily constructed and hefty. It fully expanded within 24 hours. I will definitely consider Lucid in the future. I was also pleased with delivery and haul away service, prompt and efficient.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sdjeff4sc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQL2DPLTIDBNRV7WCWAUZDCQSHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZQ0VY21T783Y?ASIN=B0779JJSV5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 30, 2020",
                "reviewTitle": "4.0 out of 5 stars Yeah... It's FIRM...",
                "reviewText": "12\" Lucid Hybrid Latex Mattress - QueenThis is going to be long, but I'll address the delivery first... These are exceptional times we are living thru and the mattress took over a week to arrive which is OK, ordered on 4/16, but for \"some\" reason, UPS scanned this item into San Diego (where I live) on Fri, 4/24... b/c of \"circumstances beyond our control\", UPS did NOT make delivery until Mon, 4/27... Like many other reviews who stated that their \"package\" arrived with a pretty beat-up box, my \"Package\" arrived with no box, no shipping manifest, no invoice, no warranty information, no \"handy package opener\" (letter opener), I debated whether to accept the package - just a mattress wrapped in plastic in a tube-like form. After several minutes of consideration, I accepted delivery b/c I didn't want to wait an additional 2 weeks...Once inside... It's quite heavy, about 110 lbs, by myself, it took some effort to navigate into my bedroom because my apartment is tiny and with my furniture, there is little room to maneuver, but that's my problem... Once I got it set up, I had the \"package opener\" left from a previous Lucid 4\" Gel-infused memory foam mattress topper - more on that later... Once I sliced the packaging open, the mattress \"unfolded\" just like many of the unboxing videos you can watch on YouTube. Just like in all of those videos, the mattress unfolded upside down - must be a manufacturing issue when they package the mattress at the factory (in Turkey and not China! I'm not sayin' that's bad, it's good that not everything comes from China!). Another massive effort to get the mattress flipped over into it's proper configuration and it was set. It would be nice if Lucid could get the manufacturer to package the mattress in such a way that when you slice open the plastic, it opens \"right-side up\"... just sayin'...There was no noticeable off-gassing, mattress smelled neutral right of it's compressed wrapping. It quickly achieved it's 12\" height, I left it sit for about 4 hours before actually sitting down on it... just kidding... no I didn't, I sat/laid down on it immediately, but left the room and left it alone for several hours after that. Coming back into the room, there was no noticeable smell, although I kept my ceiling fan on high the entire time with the windows open.Delivery and setup aside... This mattress is FIRM... I'm 6'4\", 180 lbs... it is bouncy, just like all the YouTube videos, but it's pretty firm, I'm still getting used to it. Fortunately, as mentioned previously, I purchased a 4\" Gel-infused memory foam topper last year from Lucid to try and make my old mattress last just a little bit longer - it worked, I loved the topper for the year I used it prior to taking delivery of the 12\" Latex Hybrid (which included the handy \"package-opener\" which I still happened to have!). Although it's an extra $100, I really do like the deep, sink-in, feeling of the memory foam topper. If I didn't have the topper, I'm not sure if I would like this mattress...Although it wasn't necessary, I placed the mattress on top of the box spring I had left over from my old mattress - BIG mistake, the bed sat way too high, couldn't see my alarm clock, couldn't set my feet on the ground if I sat on the edge (and I'm 6'4\"!)... Decided I needed to get rid of the box spring, had to get a friend to come over to help with the \"repositioning\" due to the confined space...Overall... Mattress now sets on a structured bed-frame with slats and a slice of plywood over the slats for extra structural support. Memory-foam topper back on top. I've spent 3 nights on this mattress and am still getting used to it. I had a really old mattress/box spring that this replaced, and the old mattress with the 4\" Lucid topper really worked well for me - I slept really well, but felt it was time to get a new mattress. We'll see how well I sleep on it tonite w/out the box-spring underneath it, but right now, I get a softer feel with the mattress coils doing the work that my old box-spring might have been doing...If you want to \"sink-in\" like with memory foam, this mattress is NOT for you, b/c I already had a 4\" gel-infused memory foam topper, I'm optimistic that this will work for me. I sleep comfortably, but because I work weird shifts, I cannot comment on whether you get a full, undisturbed sleep with this mattress. without my old box-spring, it feels incredibly comfortable right now. I gave it a 4 overall, with 3's in the specific categories while I get used to this new mattress, I was sleeping on a desperately old mattress and I've only spent 3 nights on it, I'll return to give a more experienced review before I come up on my return date, I'm inclined to keep this mattress b/c I already have the memory foam topper, but unless you really need the support, you might prefer the 12\" hybrid memory foam model of this mattress... just sayin'...",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUSIEPVNIXMLUOWILA3EGKQ6O2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AQXVK85BQSD4?ASIN=B0779JJSV5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Holding up well, 3 years in!",
                "reviewText": "Super comfortable! Buying mattresses can be really confusing, I don't usually write reviews but I wanted to share how great this bed has been for me. Some reviewers say it's too firm, others too soft -- latex beds are just really different than other types. I have a \"medium-firm\" full which feels a little too firm on its own, I did buy a fluffy (\"extra-thick\") mattress topper and it feels like a hotel bed, so cozy.Bought this in January 2021, as of January 2024 it's holding up well. I weigh about 165 and there is no \"dip\" in the bed.My mom got also queen-size one of these mattresses for her guest room, too. I love that you don't feel any springs in the bed, it's just very smooth overall. Will update review if the mattress gets a dip or I encounter any issues.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alonso sanchez rodriguez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 14, 2022",
                "reviewTitle": "Este colchón es una chulada",
                "reviewText": "Solo te puedo decir cómpratelo , lo selecciones suavidad media y me encanto , duermo y descanso perfecto , funciona muy bien con las bases l100 muy contento con la compra se hinchó los 25 cm y venían muy bien empacados",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PatricePatrice",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 28, 2019",
                "reviewTitle": "Great value for the money",
                "reviewText": "Spent almost a week researching memory foam bed-in-a-box mattresses and was a bit hesitant to purchase this onebut after thorough comparisons from all the others I finally decided to take the chance with LUCID, seemingly the best choice out of all the other ones out there (IMO). WOW - I'm super happy I took that chance !- First off, the price is great for a hybrid mattress and shipping is ROCKET FUELED (ordered 18 May in pm - received 23 May noon through Canada Post regular shipping.) Overall package weighs around 50-60 lbs. so a helping hand could come in handy although I did it myself slowly (pic 1). Took it inside, opened it up and let it expand to its proper size.It was a quick process as I could've slept in it that same night but, out of consideration for proper expansion I did let it sit overnight.- Secondly, NO CHEMICAL SMELLS OR GASSING ! That was really a + as all other reviewers of bed-in-a-box mattresses complain about that odor problem.What saves us here is because it's not a 100% memory foam but a hybrid so 50% coils + 50% memory foam thus lessening the odor factor in the making of the mattress since less foam.LUCID added a wise thing in the package, a delicate credit-card snipping tool (pics 2-3) to let you open up the plastic's (transport and protective) with ease and without worries of having any would-be incident should've one used scissors.BRILLIANT !Construction (pics 4-5-6) is well conceived and quilting is close-knit and dense. Memory foam top layer padding depth is just right and you won't have that sinking effect. Coils in the base layer High Density Poly Foam are solidly encapsulated and padded (pic 6.) I agree with the firmness evaluations, myself I give it between firm and medium-firm so make that ± 7/10 scale. Either back or side sleeping, there is no problem whatsoever as all positions are comfortable (even stomach). The mattress holds you comfortably & supports perfectly in whatever position you lay in.- Finally, a true 12\" mattress (pics 7-8).Conclusion its a well made mattress, easy to set up and no gassing. Very positive purchase and I stand behind LUCID 100% on this particular mattress. This one is value for the money, I confirm !-----------------------------P.S.: I was not paid or asked to write this review, I am simply sharing my opinion with the community who, like me,have spent considerable time researching for the BEST quality money-wise mattress can buy.----------------------------------------------------------------------------------------------------------------------------------Update June 7 2020 :Its been a year now and the mattress is holding on GREAT!No sagging, sinking, weakening or other declining factors and it still stands high at 12\".Can truly confirm that it was a GREAT buy, and I still stand behind Lucid and this particular mattress purchase.I thought I'd share my experience with all you doubtful buyers out there (as I was too !)",
                "reviewVotes": "178 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41g5z9m9hfL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/31b8BTwmcZL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41X6sY6gZgL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/317CPv5atIL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41jtTiWURGL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/418lZ99E6UL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41kv1+2uPHL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51YMJgRjQWL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jason PerryJason Perry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 19, 2020",
                "reviewTitle": "This is the best bed I have ever owned.",
                "reviewText": "First, a disclaimer. I have no affiliation with any of the companies and products I review. If I love something I enjoy recommending it. I also have a big mouth and can type very fast. Bad combination sometimes. Heh. Since this is a bed and a very important part of a persons life I spent hours watching and re-watching video reviews for the diff offerings out there. The same for reading reviews. At this point I can tell you nearly everything about every latex hybrid and memory foam bed out there. It's been exactly a month sleeping on it so I feel I can do a good review. After around two weeks of obsessing over beds I finally settled on this bed. It is a latex hybrid which was very important for me. I cannot sleep in a bed that is warm and traps heat. So far it does not disappoint.The bed was very easy to set up and there was no off gassing. The little tool included came in handy and once you used it the plastic slipped off very easily and the bed began to come to life. In one of the pics you will see what the corner of the mattress looked like immediately after it expanded. There is a tiny indentation where the zipper was but over night this filled out and you will see this in another one of the pics. That is what I expected anyway. I was able to sleep on the bed that night. The mattress cover is really nice and actually comfortable to sleep on as is. I had a diff brand cover on it up until a week ago and I removed it and have been sleeping on the default cover and I really like it. Whether you sleep on the mattress as is or toss a diff brand cover on top of Lucid's cover you'll be happy. I would say the firmness is medium. I weigh approximately 210 pounds and I never sank into it and it was easy to get out of. No special gymnastics maneuvering. I wake up feeling fine and pain free. I have some muscle issues and this bed does no aggravate them at all. There is nothing I can call a \"con\" when discussing this bed. The closest thing I would call a con would be the fact that the box could have had cutouts on the sides of the box to make it easier for one person to drag or carry. Of course this isn't related to the bed itself so I wouldn't even consider it when reviewing or buying it. I am happy with this bed. The price point is excellent and I can see me getting many years out of this bed. Why pay $1500-2000 for a bed that won't last much longer? These beds are also really fun to setup. They go from pancake to the most comfortable thing in moments. Not sure what else to say. If you buy this bed you won't be disappointed.",
                "reviewVotes": "60 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61b8HmmBFML.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/81T8aEXY17L.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71HxKC5R1KL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71i+E9t1HeL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "RODRIGO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on September 21, 2019",
                "reviewTitle": "Excelente compra",
                "reviewText": "Excelente colchón, está en el punto exacto de suavidad y firmeza, Lucid está en un rango de precio medio, ví opciones en otras marcas que costaban el doble o incluso más, aunque también las hay más económicas, es difícil comprar un colchon sin probarlo antes, pero para mí resultó exactamente como lo esperaba, duermo y descanso perfecto, volvería a comprar de ésta marca sin pensarlo 2 veces",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bill Fox",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 27, 2023",
                "reviewTitle": "Has held up well over the last year",
                "reviewText": "Comes compacted into a box that does take an effort to get up stairs although this is good since you don't want a flimsy bed to sleep on. The mattress regained shape with no problems and is comfortable for sleeping. After a year of use there is no visible sagging or other signs of wear on the material",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}