{
    "remaining_requests": 1288,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/My-Dreams-Hold-Knife-Novel/dp/1728243203",
    "body": {
        "name": "In My Dreams I Hold a Knife: A Novel",
        "price": "$9.89 $4.53",
        "originalPrice": "$16.99",
        "rawPrice": 9.89,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/My-Dreams-Hold-Knife-Novel/dp/1728243203",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 KD-RLxRL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41lxngmzDDL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/31mGwMGlFQL.jpg",
            "https://m.media-amazon.com/images/I/513MAXhe3kL._SX35_SY46.jpg"
        ],
        "imagesCount": 4,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ashley Winstead",
            "link": "https://www.amazon.com/Ashley-Winstead/e/B08SZ9XJTL/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by Goodwill of Dayton Ohio.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 6782,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"Ashley Winstead’s mordant debut novel is the latest entry in the budding subgenre of “dark academia,” where the crime narrative takes place on a college campus...At its heart, Winstead’s novel examines what it means to covet the lives of others, no matter the cost.\" ― The New York Times\"Looking for an eerie campus setting? This chilling suspense novel has murder, friendship and defiance when six people return to their college reunion a decade after one of their close friends was murdered.\" ― Parade\"An engrossing tale of murder, love, and obsession set against the backdrop of an elite southern university. Delve into the dark secrets and ever-shifting allegiances of the East…This page-turning debut suspense novel is perfect for fans of Pretty Little Liars and J.T. Ellison’s Good Girls Lie.\" ― Crime By The Book\"A twisty, dark puzzle...Fans of books such as The Girl on the Train and Gone Girl will find this book captivating, as will anyone who enjoys being led down a winding, frightening path. Highly recommended.\" ― New York Journal of Books\"An addictive and entertaining thriller.\" ― Texas Lifestyle Magazine\"A college reunion brings together a group of friends once shattered by a vicious crime in this thrilling debut, reminiscent of Cruel Intentions, Heathers, and, of course, the Secret History.\" ― CrimeReads\"[A] captivating debut...Winstead does an expert job keeping the reader guessing whodunit. Suspense fans will eagerly await her next.\" ― Publishers Weekly\"Packed with intrigue, scandal, and enough twists and turns to match Donna Tartt’s The Secret History, this is a solid psychological-thriller debut.\" ― Booklist\"Fans of The Secret History, Ruth Ware, and Andrea Bartz will devour this dark academic thriller with an addictive locked-room mystery at its core. Ten years after an unsolved campus murder, the victim's best friends reunite, knowing one might be a monster--but is anyone innocent? Over the course of a single shocking night, Ashley Winstead peels back lie after lie, exposing the poisoned roots of ambition, friendship, and belonging itself. An astonishingly sure-footed debut, In My Dreams I Hold a Knife is the definition of compulsive reading. The last page will give you nightmares.\" ― Amy Gentry, bestselling author of Good as Gone, Last Woman Standing, and Bad Habits\"Nostalgic and sinister, In My Dreams I Hold a Knife whisks the reader back to college. Glory days, unbreakable friendships, all-night parties and a belief that the best in life is ahead of you. But ten years after the murder of one of the East House Seven, the unbreakable bonds may be hiding fractured secrets of a group bound not by loyalty but by fear. Twisty and compulsively readable, In My Dreams I Hold a Knife will have you turning pages late into the night, not just to figure out who murdered beloved Heather Shelby, but to see whether friendships forged under fire can ever be resurrected again.\" ― Julie Clark, New York Times bestselling author of The Last Flight\"Deeply drawn characters and masterful storytelling come together to create an addictive and riveting psychological thriller. Put this one at the very top of your 2021 reading list.\" ― Liv Constantine, internationally bestselling author of The Last Mrs. Parrish\"Tense, twisty and packed with shocks, Ashley Winstead’s assured debut dares to ask how much we can trust those we know best―including ourselves. A terrific read!\" ― Riley Sager, New York Times bestselling author of Survive The Night\"An unsolved murder, dark secrets and dysfunctional college days, all wrapped up in a twisty plot that will keep you flipping pages.\" ― Darby Kane, #1 internationally bestselling author of Pretty Little Wife\"With its compelling puzzlebox structure and delightfully ruthless cast of characters, this twisty dark academia thriller will have you flipping pages like you’re pulling an all-nighter to cram for a final. In My Dreams I Hold a Knife is required reading for fans of Donna Tartt's The Secret History and Amy Gentry's Bad Habits.\" ― Layne Fargo, author of They Never Learn About the Author Ashley Winstead is an academic turned novelist with a Ph.D. in contemporary American literature. She lives in Houston with her husband, two cats, and beloved wine fridge. You can find her at www.ashleywinstead.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 35 mins",
            "$3.99 delivery Monday, February 26."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An Amazon Best Book of the Month\"[A] mordant debut novel....examines what it means to covet the lives of others, no matter the cost.\"―The New York Times\"Tense, twisty, and packed with shocks.\"―Riley Sager, New York Times bestselling author of Survive The NightSix friends.One college reunion.One unsolved murder.Ten years after graduation, Jessica Miller has planned her triumphant return to her southern, elite Duquette University, down to the envious whispers that are sure to follow in her wake. Everyone is going to see the girl she wants them to see―confident, beautiful, indifferent. Not the girl she was when she left campus, back when Heather Shelby's murder fractured everything, including the tight bond linking the six friends she'd been closest to since freshman year.But not everyone is ready to move on. Not everyone left Duquette ten years ago, and not everyone can let Heather's murder go unsolved. Someone is determined to trap the real killer, to make the guilty pay. When the six friends are reunited, they will be forced to confront what happened that night―and the years' worth of secrets each of them would do anything to keep hidden.Told in racing dual timelines, with a dark campus setting and a darker look at friendship, love, obsession, and ambition, In My Dreams I Hold A Knife is an addictive, propulsive read you won't be able to put down.\"Beautiful writing, juicy secrets, complex female characters, and drumbeat suspense―what more could you want from a debut thriller?\"―Andrea Bartz, author of Reese's Book Club pick We Were Never Here Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Sourcebooks Landmark (April 19, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1728243203"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728243207"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.75 x 1 x 8.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#12,713 in Books (See Top 100 in Books) #1,020 in Psychological Thrillers (Books) #1,378 in Literary Fiction (Books) #2,077 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 6,782 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "In My Dreams I Hold A Knife The Last Housewife Midnight is the Darkest Hour More thrillers by Ashley Winstead!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c6dbdb33-e6c2-4817-8646-de8cc5a621ea.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4017c8be-5dd7-42c0-8bff-8fd9846c5fea.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1d3ab1aa-0339-4c91-bcc4-af51b40837b0.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9c587011-750d-41ef-aa39-8277e4db8c18.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91fadd5d-a8a1-43f0-8f38-63e9dca5d511.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53a48fa9-facb-4db3-bfb1-7576e3ae05bf.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60f61f7d-690b-48f7-9760-7a172150eb0b.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ebb9245-3f4b-4f6b-a70b-dcddc20364f4.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Krysty MalysKrysty Malys",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGX7F7OVLEWKSCLMZCVU3VH3NESA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2K7F9X9THOL74?ASIN=1728243203",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Devoured this book!!! 🔥",
                "reviewText": "From the outset, this book just seemed like another whodunit murder mystery, which, thanks to Jeneva Rose, I’ve found out I love. 🔥But in reality, this book read more like a commentary on the human condition. Winstead splayed out inner secrets so raw and really put out how we carry baggage we tell absolutely no one about, even our closest friends. She laid out in detail how that pain, those secrets, rip apart families and friendships. The prose in the book was almost poetic to me. Heartbreaking and brutal.Would give it ⭐️⭐️⭐️⭐️⭐️ on the mystery and the whodunit alone. I would give it six stars and break the damn scale if I could.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71nttADAg-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "All Shades Of Purple",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKL3Z2IZOXLLXDL7KCPP7MDMP3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35N0IG3J9B600?ASIN=1728243203",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 11, 2023",
                "reviewTitle": "4.0 out of 5 stars First Book by this Author",
                "reviewText": "I started out disliking Jessica Miller to the point that I thought I could not get over it and enjoy the story. However, Winstead did such a fantastic job writing a flawed person that I began to understand and sympathize with her. All the characters are shown to be written in a mix of being centered, ambitious, broken, overachiever, competitive, and authentic self-destructive people.In the end, though I was not surprised by who the killer was, I found that I could understand Jessica, Coop, and the rest of the group. I enjoyed this book and will be reading from this author again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erica Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTWWMYNBXB6GJSQWQANIKAU7QPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Z3C4MU00QZLT?ASIN=1728243203",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 16, 2023",
                "reviewTitle": "3.0 out of 5 stars An Okay Thriller",
                "reviewText": "In My Dreams I Hold a Knife was a decent read from start to finish. I was a bit nervous at first because I thought it was going to start off slow, but I was pleasantly surprised. There are things that happen in the beginning that made me intrigued. I was always wanting more. I needed more information in every chapter. Which, in the end, made this a super quick read for me.Jessica is…something else. I didn’t really enjoy her character, but I think that’s how it’s supposed to be. She has all the confidence in the world, but at the same time, she has no confidence at all. She always needed everyone else’s validation and I hated that for her. She was through some things when it came to her father. He wasn’t very supportive and that had a huge impact on how she viewed herself.Honestly though, even though Jessica wasn’t “likeable” I still wanted to learn more about her, and at times, I was rooting for her. The question is…did I make the right decision? Should I support her? You have to read the book to find out.There are so many twists and turns throughout the whole book that you really don’t know who to trust and who to believe. The ending had me absolutely shocked. There was a slight moment that I was right, but then I changed my mind and was like, “No way.” Although I may have thought of the person once, I did not think of the why/how.There’s actually a bit more information once we find out the whodunnit. That information is wild. Even though this book won’t go down as one of my favorites, it was still a good read. You should pick it up because of the many twists and turns and how it continuously keeps you on your toes.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabrielle GrosbetyGabrielle Grosbety",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7SSTEEZR2FASCUQT3DFUUOUAQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R211Y4JPFMWSZN?ASIN=1728243203",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 2, 2022",
                "reviewTitle": "5.0 out of 5 stars Dark academia meets dangerous obsession",
                "reviewText": "“My life was a narrative I couldn’t parse, full of conflicting evidence.”For a while, it was quite comforting, perhaps strangely so given the genre, to always have this book to return to to break up what I was otherwise doing, especially amidst finals. I relished in being part of this world that tilted slightly, dangerously, on its axis, drawing suspicion towards every character by the end. With the thought that each was imperfect, damaged, and at most turns messy, but definitely, undeniably, twistingly human. Author Ashley Winstead just does it right. She exacts from each character turmoil and powerfully unearths the shameful, ugly parts that they desperately wish to keep hidden from others. There were also little, surprising undertones of dark humor woven in, which only strengthened the story and made me just unabashedly feel and feel deeply and pensively.“But in a flash, a vision of torn blond hair, sticky and red, matted against white sheets. I shook my head, pushing away the glitch.”Now, for the actual story: Jessica Miller, the narrator, breathlessly, urgently craves perfection, always has since college where she meets and becomes part of the coveted East House Seven, which includes herself, Mint, Caro, Frankie, Coop, Heather, and Jack. With each of her new friends, she feels all at once armed with a different sense of belonging and place, but also views them as prizes to shamelessly show off, her association to them further cementing her level of status and prestige, both of which she is relentlessly, addictively after and always yearning for. However, of all of Jessica’s friends, I had a soft spot for Coop, who was filled with grit, original, no-nonsense, and all about knocking the Greek system and its toxic exclusivity. I loved every inch of him for that. However, regardless of his words of wisdom to Jessica to forget markers of status and focus, instead, on loosening up and enjoying more, she can’t help herself, she is primed, by other factors and most rigorously herself, toward becoming something greater than what she believes she is.“He took my face in his hands and looked me in the eyes. How terrifying, to be truly looked at.”So, regardless of reason, does Jessica’s obsession for perfection eventually go to her head and get the better of her? Do one of her friends have a vengeful, dark side they may be covering up? All these questions barge to the forefront as Heather is brutally murdered and the case eventually goes cold, with evidence, but not enough, pointing to Jack, her college boyfriend, being the main suspect. However, don’t you know, that he must be too simple, the low-hanging fruit for the real perpetrator to frame. Hence in using an effective flashing between present and past approach, Winstead puts all these characters, now called back in modern day for a college reunion, right on center stage, as each feels the heat in new and pressing ways to confess to how they could be related to the crime on that fateful, terrifying night. I loved every minute of this richly fleshed out story as doom and elitism clashed in new and interesting ways that pierced through me and held me captive.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71OrubWuxTL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alisa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 20, 2021",
                "reviewTitle": "Loved everything about this book!",
                "reviewText": "Six Friends.One college reunion.One unsolved murder.😱 😱 😱In My Dreams I Hold A Knife is a debut by Ashley Winstead that seriously packs a punch! This book had all the elements which I love and I was completely absorbed and devoured it. But not too quickly because I wanted to savour all the juicy details 😉. The college setting/reunion, dual time lines and characters which you kind of hate but love at the same time, plus an unsolved murder = winner for me. As with all “hyped” books I avoided reading reviews or the synopsis when I got the book and just went in blind so I had no expectations. And I loved it! If you’re a fan of dark academia, plenty of drama and a layered story which peels away beautifully with each page, give this a read.I seriously had a book hang over after this one.This was a perfect summer read!!!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eloise",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 8, 2024",
                "reviewTitle": "Fast pace and ticked all my boxes",
                "reviewText": "This was everything I wanted from a thriller. Fast paced, lots of secrets and twists. I can’t fault it as there was nothing I didn’t like about it! Really recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angie67",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 16, 2022",
                "reviewTitle": "Great academic thriller",
                "reviewText": "This was one of my most anticipated reads of this year. I couldn't wait to get my hands on it after seeing some bookstas raving enthusiastically about it.I have to say that I was not disappointed.If you love academic thrillers, you can't miss out on this one.I loved the dual timeline which is very well done in this book as we follow the reunion of former college friends (minus a dead one) today and the story of what really happened ten years ago.First of all thank you @mariesembar for buddy reading this with me and explaining everything I needed to know about sororities and US colleges. I would have been lost without you. We follow Jessica Miller who is determined to steal the show from everyone at her reunion with her once closest friends at the elite Duquette University. Today she is a successful woman, well dressed and nothing like the lost girl she once was when her roommate Heather was murdered and her life sealed forever.At the time, everyone was sure that Jack, Heather's boyfriend, was responsible for the murder, but the police could never find any evidence. When the group is unexpectedly confronted by Eric, Heather's brother, who is still looking for answers, it quickly becomes clear that each of them had the means and motives to kill poor Heather. So, if Jack is innocent, what really happened that night?I wouldn't classify it as a locked-room mystery, but even without Eric's accusations, it's clear from the start that one of these 7 people must be Heather's killer. Trying to figure out who is telling the truth and who is weaving a lie is what sucks the reader in.I couldn't quite give it 5 stars because the characters' voices seemed very childish to me. Even though they were now in their thirties, their voices and behaviour felt more like that of a teenager.But a part from that, this was a solid thriller which I can only recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachael M",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 12, 2023",
                "reviewTitle": "5 stars!",
                "reviewText": "Oh, my, goodness! The hype for this book was real, and it was not misplaced at all. This was my favourite book of November ❤️.This book is told in duel timelines: then and now. The two timelines are interwoven together perfectly to slowly drip feed us trickles of information that kept me guessing until the very last pages... I constantly had different theories, and everyone of them was wrong. In the end it was shock after shock after shock.I loved the character development in this book. Every character felt so real and was so deliciously flawed that I was enthralled. The East House Seven characters are a bunch of liars, cheaters, stalkers, drug dealers, and drug addicts. Their strong friendship bond consists of lies, betrayal, and rivalry.The other thing I loved about this book is how well timed every single twist and turn is. Some of them left me gobsmacked. I loved this wild, action packed, trickery, whodunnit premise so much and devoured it at one sit!I think I may have a slight crush on Coop, he is just the perfect bad boy made good!I liked going back and forth between different timelines which give enough clues about characters’ motives and perspectives. Especially last two flashbacks involving Jess’ birthday party with her family and and her talk with Heather where do they see themselves ten years later were the best flashback chapters of the book shook me to the core.This is a must read!Synopsis:Ten years after graduation, Jessica Miller has planned her triumphant return to University, down to the envious whispers that are sure to follow in her wake. Everyone is going to see the girl she wants them to see—confident, beautiful, indifferent—not the girl she was when she left campus, back when Heather’s murder fractured everything, including the tight bond linking the six friends she’d been closest to since freshman year.But not everyone is ready to move on and not everyone can let Heather’s murder go unsolved. Someone is determined to trap the real killer, to make them pay!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "uthayakumar ramasamy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 25, 2023",
                "reviewTitle": "really big",
                "reviewText": "i bought it for my sister and she loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}