{
    "remaining_requests": 1190,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Ghost-Fleet-audiobook/dp/B00YI2LXAC",
    "body": {
        "name": "Ghost Fleet: A Novel of the Next World War",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Ghost-Fleet-audiobook/dp/B00YI2LXAC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51g4gj6CKzL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "P. W. Singer",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=P.+W.+Singer"
        },
        "brand": "P. W. Singer",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 7481,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The year is 2026. China has taken over as the world's largest economy, while the United States, mired in an oil shortage, struggles to adjust to its diminished role. Then, a surprise attack throws the US into a chaos unseen since Pearl Harbor. As the enemy takes control, the survival of the nation will depend upon the most unlikely forces: the Navy's antiquated Ghost Fleet and a cadre of homegrown terrorists. Ghost Fleet is unique in that every piece of technology featured in the novel already exists or is in the works. Peter W. Singer is Senior Fellow and Director of the 21st Century Defense Initiative at the Brookings Institution and a consultant for the US Department of Defense and FBI. August Cole is a journalist and writer specializing in national security issues and is an Adjunct Fellow at the American Security Project. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Spies & Politics",
                "link": "https://www.amazon.com/Spy-Stories-Tales-Intrigue-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10493"
            },
            {
                "name": "Political",
                "link": "https://www.amazon.com/Political-Thrillers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7538395011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 25 minutes"
            },
            {
                "name": "Author",
                "value": "P. W. Singer, August Cole"
            },
            {
                "name": "Narrator",
                "value": "Rich Orlow"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 30, 2015"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00YI2LXAC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,983 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #68 in Military Thrillers (Audible Books & Originals) #185 in War & Military Fiction #207 in Technothrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M. GUERNSEY",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESDOGI4ISJ23Z7NX2PH4LBMU7JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21X1LG7W9LMKW?ASIN=B00YI2LXAC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent book",
                "reviewText": "It's not Tom Clancy but this is a great book. Not a lot of fantasy but good plausible story. I really enjoyed reading it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Crimson Hawk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTI7RTLZASPHYAIRAXTU56ZAYIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N6BJC7IMEEQK?ASIN=B00YI2LXAC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Flawed but solid",
                "reviewText": "It’s always hard to write a book that is in the future of the year it is written. This book is a solid read. It’s fun and the future tech ideas are awesome. In some places it’s too far into the unbelievable realm. That said I had to sing it a Star. Not every book can be five stars or else the rating won’t matter. Give it a chance if you like a war story. I won’t spoil anything except to say pirates are awesome :).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Firemanjim",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHKG5ECFVQHXPADSBEU4Z6CB5QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L1NFU1KJS4O4?ASIN=B00YI2LXAC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great story",
                "reviewText": "It’s a little confusing at first, but eventually all the various threads tied together when they do the story is really, really entertaining",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Captain Crutchfield Adair",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXDUT7YTJMX5I3MXCGMQAC2HLGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R374J1RM0OYQOG?ASIN=B00YI2LXAC",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 5, 2016",
                "reviewTitle": "3.0 out of 5 stars Ghost Fleet needs a Ghost Writer~Editor",
                "reviewText": "Imagine this: Sometime in the next near future China, hoping to pound America into submission, reduce it to a vassal state, launches a surprise attack. The attack on Hawaii alone makes 1942 look like child’s play. Within minutes, every American satellite is vaporized, communications are virtually nonexistent. Nothing works and worse, the Chinese monitor/control whatever is left. A small Chinese force occupies Hawaii, an easy feat given the invader’s advanced toys and the island’s defenders, out classed, are canon fodder. Given the prospect of mutually assured destruction, nobody gets nuked so it’s goin’ to be a knockdown alley fight, a heavy weight merciless pro verses a crippled blind guy with one hand tied behind his back.Things are bleak:The US Pacific fleet is sunk or reduced to scrap iron, thousands of sailor lost. America’s ICBM subs, the once invincible “Boomers,” hiding or sunk, the ocean suddenly transparent. America’s most modern, lethal aircraft, computers with wings, swatted out of the sky.Only a single Navy fighting ship, the much maligned aluminum super destroyer Zumwalt, a technical failure owing to, among things, Congressional spending cuts, somehow evades the catastrophe at Pearl Harbor. Zumwalt sails alone, the vanguard against the might of a huge, modern Chinese navy, its only asset being a not fully operational electronic rail gun and its captain and crew. Owing to fleet-wide casualties, fully half its crew are young women and recycled, crusty old sea-dogs.So, imagine this:China, long the dominate supplier of electronic components has secretly built in code that allows the chip to be disabled. Electronic “Trojan Horses” buried in everything: refrigerators, TV sets, computers, everything in the digital age. The heavy hitter has the decisive advantage.Things are worse than bleak.98% of the good-guy characters in the novel die except for Zumwalt. America is seemingly on the verge of surrendering, humiliated, and China set to become the world’s super power.If you could spend bar-time with an honest, objective military analyst, you would hear there is some truth inside this imaginary scenario.But, given the writers imagination, China is more or less vanquished by America’s spirit of imagination and self-sacrifice.To read Ghost Fleet, one must be willing enter into a world of a dime a dozen super computers, super Google Glasses © that project 3-D images of anything, anywhere; autonomous robots that exceed the limits (but not imagination) of human ability and weapons systems that either exist or eventually will exist. The Chinese DongFeng DF21 aircraft carrier killer missile (more or less existing), appears as an upgraded “Stonefish” missile and sink US super aircraft carriers with impunity. Cameos of US military systems, existing and not ready yet are displayed.Reading Ghost Fleet takes patience, skimming over paragraphs of propeller-head technical fantasy, but if you, like me, can suffer the clutter, you will \"Damn the Torpedoes\" and read \"Full Speed Ahead\" to the conclusion if only to see how the good guy and girls survive to the ending.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thomas M. Magee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTVVZDX4M2WTFA3LG5AMZDCIRYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P28EEHI21VEZ?ASIN=B00YI2LXAC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 15, 2015",
                "reviewTitle": "4.0 out of 5 stars Marginal Book, Innovative Ideas",
                "reviewText": "I got this book because of the vast amount of PR out there about it. I saw it commented on in various columns, blogs, and other defense related material. I had never seen a defense novel get so much PR since the heyday of the Clancy books. I am not sure how the publishers did it but they have some sort of gift there.I found this book had mixed results. The story is sort of choppy. The author introduces things out of the blue. You find yourself asking where did that came from? The story line is based off of a few small key stories. The big picture isn't clearly explained. Character development needs more attention. That makes it hard to follow. There is an exciting start out of left field. The center of the book is slow. Activities in the book really picks up in the last 70 pages.The good part of the book, and why I gave it 4 stars was the concept. This book is a first. This is one of those books in which people use as a frame of reference to talk about new developments in warfare. This is the new \"Hunt for Red October\" or \"Red Storm Rising\". The book talks and frames how tactics and doctrine might change in the near future, even though the plot is far off in the future. It explains how things like computer viruses, surveillance from space, old fashion spies, deception and other things work together to produce victory. The twist of how China attacked is very believable. The authors play a heavy role for drones. It will be interesting to see if markets deliver what is described here.I really liked the battlestar glactica twist. The new stuff for the US was compromised by computer viruses. The viruses were hidden in Chinese chips. That compromise opened up the door for drones or other things to attack. Those events really damaged the country. That forced them to resort to using mothballed Navy ships and old cold war aircraft which did not have an abundance of chips. As our nation continues to cut the defense budget and buys more and more stuff overseas the story line sounds all of real.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauricio",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 13, 2020",
                "reviewTitle": "An interesting fiction of what an upcoming global war would be.",
                "reviewText": "I really enojoyed this book. It is a novel written nicely about what a global war in the current times would be: cyberwarfare at the forefront.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judicael",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 24, 2021",
                "reviewTitle": "Now I know",
                "reviewText": "... What the 3rd WW will look like",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stefano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 5, 2020",
                "reviewTitle": "ottima lettura per appassionati di racconti militari/strategici",
                "reviewText": "Il libro, in lingua inglese, racconta molto bene una ipotesi strategica in epoca contemporanea appena futuristica, con novizia di particolari per quanto riguarda equipaggiamenti e strumentazioni militari oggi in uso, appena introdotte o di prossima introduzione nel mondo militare, ispirandosi a personaggi e situazioni molto vicine alla realtà odierna.Ne consiglio la lettura agli appasionati di thriller militari/strategici.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wellington Amorim",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 29, 2018",
                "reviewTitle": "Ótimo technothriller",
                "reviewText": "O livro irá agradar tanto o leitor que estiver saudoso de um bom livro de Tom Clancy quanto os saudosos de uma obra tecnicamente mais robusta como A Terceira Guerra Mundial, de Sir John Hackett. A premissa é inteligente e as inúmeras referências técnicas, ao final do livro, mostram como os avanços mencionados na tecnologia bélica são plenamente verossímeis a curto e médio prazos. Houve um novo choque do petróleo e o Partido Comunista Chinês é substituído por um Diretório controlado pelas Forças Armadas e pela alta burguesia (qualquer semelhança com a Revolução Francesa não é mera coincidência...rsrs). Buscando mais projeção de poder, China e Russia surpreendem os EUA e o Havaí é ocupado. Além disso, toda a frota de submarinos dos EUA é inutilizada. A frota fantasma do título se refere à derradeira chance dos EUA em recuperar o terreno. Em vários ambientes, inclusive o espaço sideral, a trama se desenvolve de forma harmoniosa e a batalha final tem vários ecos de Midway, para quem já está familiarizado. Ou seja, uma leitura fundamental para quem se interessa por Relações Internacionais.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sachin Gaur",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 18, 2018",
                "reviewTitle": "A Stark Reminder!",
                "reviewText": "This book is a strong reaffirmation of the current situation in Asia - relatively stable at the surface but perilously imbalanced right below it. What is scary is not the fact that a conflict is probable, but that China has completed preparation to win any such conflict. Realistic, scary and riveting!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}