{
    "remaining_requests": 1222,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Lone-Wolf-Orphan-Book/dp/B0C3P7LBJ7",
    "body": {
        "name": "Lone Wolf: Orphan X, Book 9",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Lone-Wolf-Orphan-Book/dp/B0C3P7LBJ7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51f1yFJPxsL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gregg Hurwitz",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Gregg+Hurwitz&search-alias=audible"
        },
        "brand": "Gregg Hurwitz&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 225,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This program is read by multi-award-winning narrator Scott Brick.\"The winning combination of Gregg Hurwitz and Scott Brick returns for another action-packed listen featuring Evan Smoak.... Brick is so convincing at embodying Smoak that listeners will be forgiven for thinking they too could take on four bad guys to protect a good guy in need of help.\" —AudioFile on Prodigal SonOnce a black ops government assassin known as Orphan X, Evan Smoak left the Program, went deep underground, and reinvented himself as someone who will go anywhere and risk everything to help the truly desperate who have nowhere else to turn. Since then, Evan has fought international crime syndicates and drug cartels, faced down the most powerful people in the world and even brought down a President. Now struggling with an unexpected personal crisis, Evan goes back to the very basics of his mission—and this time, the truly desperate is a little girl who wants him to find her missing dog.Not his usual mission, and not one Evan embraces with enthusiasm, but this unlikely, tiny job quickly explodes into his biggest mission yet, one that finds him battered between twisted AI technocrat billionaires, a mysterious female assassin who seems a mirror of himself, and personal stakes so gut-wrenching he can scarcely make sense of them.Evan's mission pushes him to his limit—he must find and take down the assassin known only as the Wolf, before she succeeds in completing her mission and killing the people who can identify her—a teenaged daughter of her last target, and Evan himself. Matched skill for skill, instinct for instinct, Evan must outwit an opponent who will literally stop at nothing if he is to survive.A Macmillan Audio production from Minotaur Books. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 13 minutes"
            },
            {
                "name": "Author",
                "value": "Gregg Hurwitz"
            },
            {
                "name": "Narrator",
                "value": "Scott Brick"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 13, 2024"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0C3P7LBJ7"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#35 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Crime Thrillers (Audible Books & Originals) #4 in Suspense (Audible Books & Originals) #15 in Crime Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sjm",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFUY4T7KNZZUH2VLGJ5AOVO632A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UALB3MC9MOWL?ASIN=B0C3P7LBJ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Intense",
                "reviewText": "I loved this book, it took me on quite the ride of emotions. I think everything that happen to X in this book could have easily been stretched into two books. But I guess that is why it ended like it did, to set up the next book. I have complicated feelings when Evan tries to tackle emotions, cause I love that he is able to shut down and be so fierce. But then all of a sudden he has to navigate Joey. It’s like whiplash. And it makes me the reader feel that way too. I mean she calls on a mission and he somehow, I don’t know how he did it, relate to her and save people at the same time. And I’m missing Mia and Peter too. but then at the same time how could he ever be in their lives. And truthfully I don’t know that I want that either. And I’m very conflicted about the next book, I mean come on, that came out of nowhere for X. Of course I stop and look up every name of every vodka that is mentioned and see where I can buy it, lol. He should get paid for pushing vodka. Only in this book he , shockingly drinks something else! The part that I’m still shaking my head over is how he got away from all the cops, that was brilliant. And how can I not say anything about how it makes you look at your phone differently. And the big thing AI. This book had so much, his dad, his brother, his niece, the missing dog, it was almost overwhelming.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SirReadalot",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHM4TFWM445XRFLNT3QS6LTDFFAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29L3EDIB8SCFH?ASIN=B0C3P7LBJ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Lone Wolf is SO GOOD! This series just does not stop getting better",
                "reviewText": "Yes, I am a fan of the series, and yes I preordered the book last summer, but even if you had never read an Orphan X novel, I guarantee this book will keep you up late into the night.The book starts out with Evan out of sorts due to some personal experiences, and in an effort to find himself, agrees to find a lost dog. That simple task leads Evan to stumble on to the evil, female version of himself. An assassin that is every bit his equal, and because he has seen her face, he is now her next target.Trying to find her before she finds him, Evan confronts billionaires, human traffickers, a police manhunt, and the terrifying realities of AI and what our dependence on digital devices is leading to. Also Evan is simultaneously learning to deal with emotions related to Joey, his half-brother, and his new niece. For Evan to be the nowhere man, he has always been an unfeeling machine. But, it’s so much fun to read about him learning the joys and intricacies of a messy life with people in it that you care about.While this is a work of fiction, there is a frightening amount of truth in this book regarding AI, the singularity, and how much agency we give up every day with our attachment to our devices.I can’t imagine anyone not being glad they read this book, and I highly encourage you to do so.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rockymtnhigh",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFFCY4QU63B6DIE6YEE4KIQWHYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C4SP26I9EQ72?ASIN=B0C3P7LBJ7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Assume Nothing - Orphan X is back!",
                "reviewText": "I was pleased to read an advanced copy of Gregg Hurwitz' forthcoming Orphan X novel, Lone Wolf, thanks to the publisher, Minotaur Books/Macmillan. I have read all seven of the Evan Smoak, Orphan X nowhere man novels, although I have mostly read them with the audiobook version.Lone Wolf is really an excellent novel, but it is not the novel for someone to first get introduced to the Nowhere Man. The book follows events in the last two books, Dark Horse, and the Last Orphan, and really is helping to advance the storyline and character development of both Evan and his young protoge Joey, plus the comedic yet poignant interactions with Evan's armor, Tommy. The only characters missing are Mia and Peter, who are traveling and do not appear in the novel. The book begins with Evan's quest to find his father, and the consequences of that. Evan has a lot of internal turmoil and emotional baggage, tied up in his OCD powered brain. But Evan remains committed to fighting injustice. And it does not take long for injustice to present itself. The book quickly spins in to a new mission, which deals with the battles of corporate billionaires who are seeking to dramatically change the world with artificial intelligence, in a way that will eradicate what little privacy we have left.The writing in Lone Wolf was crisp; Evan, Joey and Tommy had me laughing out loud several times. Orphan X fans will definitely want to read this when it becomes available in early 2024. I'll probably then listen to the audiobook of it, just so I can hear the master Scott Brick tell the story as only he can.And remember the First Commandment, assume nothing.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOM32UAGR7WFB55OFIKSIDXJG7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YE2S4W93CU4A?ASIN=B0C3P7LBJ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Artificial Insanity",
                "reviewText": "This kinder, gentler X (just kidding)has actually met family members, but has that really changed anything or has it just added more responsibilities to his already heavily laden life? Evan’s niece, the daughter of his newly discovered brother has lost her dog, and it seems that his brother has been bragging him up.So, X gets stuck looking for a scruffy little dog with Joey’s help and when he goes to the house where the dog was last seen he walks in on a murder in progress. X manages to save the daughter, but it is too late for the father who happens to be a tech genius. The assassin is a Candy McClure, also known as Orphan V level assassin, who gets away, and X knows she’ll be back to finish the job.Gregg Hurwitz has built the best characters and they just keep getting deeper and deeper. I have never been disappointed by one of Orphan X’s stories and this was certainly no exception. I just wish Hurwitz could write faster!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SIMATSU",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWZLSCNNT3BVGFMW447KQ3H4GUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGPPHEQITEYWY?ASIN=B0C3P7LBJ7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Magical",
                "reviewText": "I am a huge Orphan X fan and gobble up the story every time a new book comes out. This plot of this story is a little different from the previous stories. Evan finds himself on a mission that has him feeling more emotional than he is accustomed to. Readers will enjoy Evan’s interactions with the children as they show his softer side. The author also gives us a different peak into the relationship with Evan and Joey which is just delightful. Every turn of the page leads to interesting and entertaining revelations. Readers will especially love the end of the story as it sets up what surely promises to be the next exciting installment of Orphan X. Make sure to buy your copy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "smartdade",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 15, 2024",
                "reviewTitle": "Didn’t Disappoint - Well Worth the Wait!",
                "reviewText": "The latest book in the Orphan X series is a must read. It has all the aspects a great thriller must have, and it has these aspects in spades.The hardest part is waiting for the next book. Bravo to the author!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 15, 2024",
                "reviewTitle": "Another fabulous Orphan X",
                "reviewText": "Every time I read an Orphan X book, I think the author can’t possibly top this. Then about a year later, he releases a new book and proves me wrong. Lone Wolf is no exception.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Domingo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 15, 2024",
                "reviewTitle": "1/5 of the book is about a dog???!!!!!",
                "reviewText": "ARE YOU KIDDING ME!???. 1/5 of the book is about the best assassin on the planet looking for a dog …is this a joke ??? ..I want my money back…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}