{
    "remaining_requests": 1308,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/House-Across-Lake-Novel/dp/0593183215",
    "body": {
        "name": "The House Across the Lake: A Novel",
        "price": "$10.53",
        "originalPrice": "$18.00",
        "rawPrice": 10.53,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/House-Across-Lake-Novel/dp/0593183215",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81hi9uJ4j1L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Riley Sager",
            "link": "https://www.amazon.com/Riley-Sager/e/B071D6HYJK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 17263,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Sager’s best plot twist yet.” —People, \"Best Summer Books\"“Pure escape . . . A voyeuristic page-turner. After I read it, I dove for more Sager: luckily he has five others, bestsellers all.” —The Boston Globe, “Ten Thrillers to Read on Your Summer Vacation”“The tale takes a series of weird turns, morphing into a cross between Silence of the Lambs and The Exorcist. . . . As with Sager’s first five thrillers, the characters are well drawn and the prose is first rate.”—Associated Press“It's a familiar psychological thriller structure--until everything changes. . . . A page-turning climax.”—USA Today“The thrills and chills are all present and accounted for in this tale.”—E! News“The House Across the Lake reads like a psychological thriller version of The Great Gatsby, featuring binoculars for more accurate across-the-lake spying, smaller gatherings for a shorter list of suspects, and a truly bat**** twist for more satisfying consumption. So basically The Great Gatsby, but better. I know, them’s fightin' words.”—CrimeReads“A suspense novel brimming with twists and turns.”—PureWow“Riley Sager is a master of the art of the thriller.”—Shondaland, \"The Best Books for June 2022\"“A classic tale brimming with Hitchcockian suspense.” —BookTrib, \"Put These 12 Summer Reads in Your Beach Bag\"\"Highly entertaining . . . Sager keeps the Rear Window-esque plot of The House Across the Lake focused keenly on believable characters who may not always be likable but who readers will care deeply about. . . . Deliciously eerie plot.\"—South Florida SunSentinel\"The House Across the Lake is the work of a master storyteller. A Hitchcockian premise is given an exciting new spin, as voyeurism, murder, and the lies we tell ourselves about our nearest and dearest spiral out of control in this gripping mystery, where nothing is what it seems. I had a thrilling time reading this. An unputdownable page-turner.\"—Alex Michaelides, #1 New York Times bestselling author of The Silent Patient and The Maidens“Riley Sager is an auto-buy for me, and his latest propulsive thriller, The House Across the Lake, may just be my favorite of his yet. With his characteristic mix of dynamic characters and riveting plot twists, Sager will keep you turning the pages in his foray into secrets, grief, revenge, and love.” —Laura Dave, #1 New York Times bestselling author ofThe Last Thing He Told Me\"The House Across the Lake pulls you under on the first page and doesn’t let you come up for air. With fascinating characters, a suffocating setting, and an intriguing premise, Riley Sager relentlessly turns up the tension on every page. Good luck putting this book down.\"—Simone St. James, New York Times bestselling author of The Book of Cold Cases\"For a fresh and twisty take on Rear Window, just add water: The House Across the Lake is a propulsive, tautly plotted, and atmospheric thriller with a vividly drawn cast of compelling characters and a final what-just-happened twist that will have you reeling. Loved it!\"—Ellery Lloyd, internationally bestselling author of The Club\"[An] outstanding novel of suspense . . . Sager brilliantly misdirects readers while playing fair with them. Newcomers and fans both will be eager to see what he pulls off in his next book.”—Publishers Weekly (starred)“Sager is the literary equivalent of a master chef, using a deft hand to configure tasty ingredients . . . then adding a generous pinch of pulp and a delicious surprise at the end. The result is an addictive beach read that fans will devour in one sitting and leave feeling thoroughly sated.”—BookPage (starred) \"A highly entertaining read.\"—Kirkus Reviews“Sager is terrific at creating suspense within a confined, sometimes claustrophobic setting. . . . Fans of stories that keep the heart pounding and the mind engaged will enjoy this one. . . . One of the genre's most entertaining authors.”—Booklist“The atmosphere Sager writes is delightfully claustrophobic and the twists surprising while still being plausible.”—BookRiot“Casey as the unreliable narrator mixed with suspicious neighbors, supernatural undertones, and multiple blindsiding twists, means Sager (Survive the Night) has written another winner.\"—Library Journal“Go into the book blind for a full experience. The clues are definitely there for you to piece together but I was still surprised. You will be questioning everyone and everything, making this book such a fun read.” —Mystery and Suspense“Sager (Final Girls) offers consistent twists and turns—including one very surprising one—that’ll keep you flipping pages until the end.\" —New Jersey Monthly\"This relentless thriller pulls you in and never lets go before leaving your head spinning with some jaw-dropping revelations and plot twists that only a master of the genre can conceive.\"—Bookreporter“Reader . . . before you think you know what’s going on, know that you’re wrong. The thing you think that happened? It didn’t. Your second guess? Also wrong. Your third will be wrong as well.”—The Big Thrill\"Rear Window gets a jaw-dropping twist in this tense, daring, and utterly propulsive thriller. If you’re not already reading Riley Sager, you’re missing out.\"—Catherine Ryan Howard, #1 Irish bestselling author of 56 Days\"Brilliantly written with a dark and clever twist on a well-worn trope, and as for that ending . . . ?! What a fun book. I devoured it!\"—Susi Holliday, author of The Last Resort“The plot is packed with twists.” —First For Women About the Author Riley Sager is the New York Times bestselling author of six novels, most recently Home Before Dark and Survive the Night. A native of Pennsylvania, he now lives in Princeton, New Jersey. Excerpt. © Reprinted by permission. All rights reserved. Now I stare at the detective on the other side of the table, an untouched mug of coffee in front of me. The steam rising from it gives her a gauzy air of mystery. Not that she needs help in that regard. Wilma Anson possesses a calm blankness that rarely changes. Even at this late hour and soaked by the storm, she remains unperturbed. \"Have you watched the Royce house at all this evening?\" she says. \"Yes.\" There's no point in lying. \"See anything unusual?\" \"More unusual than everything I've already seen?\" I say. A nod from Wilma. \"That's what I'm asking.\" \"No.\" This time a lie is required. I've seen a lot this evening. More than I ever wanted to. \"Why?\" A gust of wind lashes rain against the French doors that lead to the back porch. Both of us pause a moment to watch the droplets smacking the glass. Already, the storm is worse than the TV weatherman said it would be-and what he had predicted was already severe. The tail end of a Category 4 hurricane turned tropical storm as it swerved like a boomerang from deep inland back to the North Atlantic. Rare for mid-October. Rarer still for eastern Vermont. \"Because Tom Royce might be missing,\" Wilma says. I tear my gaze from the French doors' rain-specked panes to give Wilma a look of surprise. She stares back, unflappable as ever. \"Are you sure?\" I say. \"I was just there. The house is unlocked. That fancy car of his is still in the driveway. Nothing inside seems to be missing. Except for him.\" I turn again to the French doors, as if I'll be able to see the Royce house rising from the lake's opposite shore. Instead, all I can make out is howling darkness and lightning-lit flashes of water whipped into a frenzy by the wind. \"Do you think he ran?\" \"His wallet and keys are on the kitchen counter,\" Wilma says. \"It's hard to run without cash or a car. Especially in this weather. So I doubt it.\" I note her word choice. Doubt. \"Maybe he had help,\" I suggest. \"Or maybe someone made him disappear. You know anything about that?\" My mouth drops open in surprise. \"You think I'm involved in this?\" \"You did break into their house.\" \"I snuck in,\" I say, hoping the distinction will lessen the crime in Wilma's eyes. \"And that doesn't mean I know anything about where Tom is now.\" Wilma remains quiet, hoping I'll say more and possibly incriminate myself. Seconds pass. Lots of them. All announced by the ticking of the grandfather clock in the living room, which acts as a steady beat backing the song of the storm. Wilma listens to it, seemingly in no rush. She's a marvel of composure. I suspect her name has a lot to do with that. If a lifetime of Flintstones jokes teaches you anything, it's deep patience. \"Listen,\" Wilma says after what feels like three whole minutes. \"I know you're worried about Katherine Royce. I know you want to find her. So do I. But I already told you that taking matters into your own hands won't help. Let me do my job, Casey. It's our best chance of getting Katherine back alive. So if you know anything about where her husband is, please tell me.\" \"I have absolutely no clue where Tom Royce could be.\" I lean forward, my palms flat against the table, trying to summon the same opaque energy Wilma's putting off. \"If you don't believe me, you're welcome to search the house.\" Wilma considers it. For the first time since we sat down, I can sense her mind ticking as steadily as the grandfather clock. \"I believe you,\" she finally says. \"For now. But I could change my mind at any moment.\" When she leaves, I make sure to watch her go, standing in the doorway while being buffeted by rain slanting onto the front porch. In the driveway, Wilma trots back to her unmarked sedan and slides behind the wheel. I wave as she backs the car out of the driveway, splashes through a puddle that wasn't there an hour ago, and speeds off. I close the front door, shake off the rain, and go to the kitchen, where I pour myself a supersized bourbon. This new turn of events requires a kick coffee can't provide. Outside, another gust of wind jostles the house. The eaves creak and the lights flicker. Signs the storm is getting worse. Tail end, my ass. Bourbon glass in hand, I head upstairs, into the first bedroom on the right. He's exactly how I left him. Splayed out across the twin bed. Ankles and wrists tied to the bedposts. Towel stuffed into his mouth to form a makeshift gag. I remove the towel, sit on the identical bed on the other side of the room, and take a long, slow sip of bourbon. \"We're running out of time,\" I say. \"Now tell me what you did to Katherine.\" Before I see it out of the corner of my eye. A breach of the water's surface. Ripples. Sunlight. Something rising from the water, then sinking back under. I've been watching the lake at a mental remove, which happens when you've seen something a thousand times. Looking but not really. Seeing everything, registering nothing. Bourbon might have something to do with that. I'm on my third. Maybe fourth. Counting drinks-another thing I do at a remove. But the motion in the water now has my full attention. Rising from the rocking chair onto legs unsteady after three (or four) day drinks, I watch the lake's glassy surface again break into sun-dappled circles. I squint, trying to emerge from the bourbon haze long enough to see what it is. It's useless. The movement is located in the dead center of the lake-too far away to see clearly. I leave the back porch of the lake house, step inside, and shuffle to the cramped foyer just beyond the front door. A coatrack is there, buried under anoraks and rain slickers. Among them is a pair of binoculars in a leather case hanging from a frayed strap, untouched for more than a year. Binoculars in hand, I return to the back porch and stand at the railing, scanning the lake. The ripples reappear, and in the epicenter, a hand emerges from the water. The binoculars drop to the porch floor. I think: Someone's drowning. I think: I need to save them. I think: Len. That last thought-of my husband, of how he died in this same deep water-propels me into action. I push off the railing, the movement jiggling the ice in the bourbon glass next to the rocking chair. It clinks lightly as I leave the porch, scurry down the steps, and spring across the few yards of mossy ground between the house and the water's edge. The wooden dock shudders when I leap onto it and continues to shake as I run to the motorboat moored at its end. I untie the boat, wobble into it, grab a paddle, and push off the dock. The boat twirls a moment, doing a less-than-elegant pirouette atop the water before I straighten it out with the paddle. Once the boat's pointed toward the center of the lake, I start the outboard motor with an arm-aching tug. Five seconds later, the boat is gliding over the water, toward where I last saw the circular ripples but now see nothing. I start to hope that what I saw was merely a fish leaping out of the water. Or a loon diving into it. Or that the sun, the reflection of the sky on the lake, and several bourbons caused me to see something that wasn't really there. Wishful thinking, all of it. Because as the boat nears the middle of the lake, I spot something in the water. A body. Bobbing on the surface. Motionless. I cut the motor and scramble to the front of the boat to get a better view. I can't tell if the person is faceup or facedown, alive or dead. All I can see are the shadows of outstretched limbs in the water and a tangle of hair floating like kelp. I get a mental picture of Len in this very position and yell toward the shore. \"Help! Someone's drowning!\" The words echo off the flame-hued trees on both sides of the lake, likely heard by no one. It's the middle of October, and Lake Greene, never crowded to begin with, is all but abandoned. The only full-time resident is Eli, and he's gone until evening. If someone else is around, they aren't making their presence known. I'm on my own. I grab the paddle again and start to row toward the person in the water. A woman, I see now. Her hair is long. A one-piece bathing suit exposes a tanned back, long legs, toned arms. She floats like driftwood, bobbing gently in the boat's wake. Yet another image of Len pushes into my brain as I scramble for the anchor tied to one of the cleats on the boat's rim. The anchor isn't heavy-only twenty pounds-but weighty enough to keep the boat from drifting. I drop it into the water, the rope attached to it hissing against the side of the boat as it sinks to the lake's bottom. Next, I snag a life vest stowed under one of the seats, stumble to the side of the boat, and join the anchor in the water. I enter the lake awkwardly. No graceful dive for me. It's more of a sideways plop. But the coldness of the water sobers me like a slap. Senses sharpened and body stinging, I tuck the life vest under my left arm and use my right to paddle toward the woman. I'm a strong swimmer, even half drunk. I grew up on Lake Greene and spent many summer days more in the water than out of it. And even though fourteen months have passed since I've submerged myself in the lake, the water is as familiar to me as my own bed. Bracing, even on the hottest days, and crystal clear for only a moment before darkness takes over. Splashing toward the floating woman, I search for signs of life. There's nothing. No twitch of her arms or kick of her feet or slow turn of her head. One thought echoes through my skull as I reach her. Part plea, part prayer. Please don't be dead. Please, please be alive. But when I hook the life vest around her neck and flip her over, she doesn't look alive. Afloat only because of the life vest and with her head tilted toward the sky, she resembles a corpse. Closed eyes. Blue lips. Frigid skin. I connect the straps at the bottom of the life vest, tightening it around her, and slap a hand to her chest. No trace of a heartbeat. Fuck. I want to shout for help again, but I'm too winded to get the words out. Even strong swimmers have their limits, and I've reached mine. Exhaustion pulls at me like a tide, and I know a few more minutes of paddling in place while clinging to a maybe/probably dead woman might leave me just like her. I put one arm around her waist and use the other to start paddling back to the boat. I have no idea what to do when I reach it. Cling to the side, I guess. Hold on tight while also holding onto the likely/definitely dead woman and hope I regain enough lung power to scream again. And that this time someone will hear me. Right now, though, my main concern is getting back to the boat at all. I didn't think to grab a life vest for myself, and now my strokes are slowing and my heart is pounding and I can no longer feel my legs kicking, even though I think they still are. The water's so cold and I'm so tired. So scarily, unbearably exhausted that for a moment I consider taking the woman's life vest for myself and letting her drift into the depths. Self-preservation kicking in. I can't save her without saving myself first, and she might already be beyond rescue. But then I think again about Len, dead for more than a year now, his body found crumpled on the shore of this very lake. I can't let the same thing happen to this woman. So I continue my one-armed paddling and numb kicking and tugging of what I'm now certain is a corpse. I keep at it until the boat is ten feet away. Then nine. Then eight. Beside me, the woman's body suddenly spasms. A shocking jolt. This time, I do let go, my arm recoiling in surprise. The woman's eyes snap open. She coughs-a series of long, loud, gurgling hacks. A spout of water flies from her mouth and trickles down her chin while a line of snot runs from her left nostril to her cheek. She wipes it all away and stares at me, confused, breathless, and terrified. \"What just happened?\" \"Don't freak out,\" I say, recalling her blue lips, her ice-cold skin, her utter, unnerving stillness. \"But I think you almost drowned.\" Neither one of us speaks again until we're both safely in the boat. There wasn't time for words as I clawed, kicked, and climbed my way up the side until I was able to flop onto the boat floor like a recently caught fish. Getting the woman on board was even harder, seeing how her near-death experience had sapped all her energy. It took so much tugging and lifting on my part that, once she was in the boat, I was too exhausted to move, let alone speak. But now, after a few minutes of panting, we've pulled ourselves into seats. The woman and I face each other, shell-shocked by the whole situation and all too happy to rest a few minutes while we regroup. \"You said I almost drowned,\" the woman says. She's wrapped in a plaid blanket I found stowed under one of the boat's seats, which gives her the look of a kitten rescued from a storm drain. Battered and vulnerable and grateful. \"Yes,\" I say as I wring water from my flannel shirt. Because there's only one blanket on board, I remain soaked and chilly. I don't mind. I'm not the one who needed rescue. \"Define almost.\" \"Honestly? I thought you were dead.\" Beneath the blanket, the woman shudders. \"Jesus.\" \"But I was wrong,\" I add, trying to soothe her obvious shock. \"Clearly. You came back on your own. I did nothing.\" The woman shifts in her seat, revealing a flash of bright bathing suit deep within the blanket. Teal. So tropical. And so inappropriate for autumn in Vermont it makes me wonder how she even ended up here. If she told me aliens had zapped her to Lake Greene from a white-sand beach in the Seychelles, I'd almost believe it. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "THE INSTANT NEW YORK TIMES BESTSELLERNamed a most-anticipated summer book by USA Today, People, E! News, Cosmopolitan, PureWow, CNN.com, New York Post, CrimeReads, POPSUGAR, and more The bestselling author of Final Girls and Survive the Night is back with his “best plot twist yet.” (People, \"Best Summer Books\")Be careful what you watch for . . . Casey Fletcher, a recently widowed actress trying to escape a streak of bad press, has retreated to the peace and quiet of her family’s lake house in Vermont. Armed with a pair of binoculars and several bottles of bourbon, she passes the time watching Tom and Katherine Royce, the glamorous couple living in the house across the lake. They make for good viewing—a tech innovator, Tom is powerful; and a former model, Katherine is gorgeous. One day on the lake, Casey saves Katherine from drowning, and the two strike up a budding friendship. But the more they get to know each other—and the longer Casey watches—it becomes clear that Katherine and Tom’s marriage isn’t as perfect as it appears. When Katherine suddenly vanishes, Casey immediately suspects Tom of foul play. What she doesn’t realize is that there’s more to the story than meets the eye—and that shocking secrets can lurk beneath the most placid of surfaces. Packed with sharp characters, psychological suspense, and gasp-worthy plot twists, Riley Sager’s The House Across the Lake is the ultimate escapist read . . . no lake house required. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Dutton; Reprint edition (June 6, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593183215"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593183212"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.47 x 0.79 x 8.23 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,418 in Books (See Top 100 in Books) #61 in Supernatural Thrillers (Books) #243 in Psychological Thrillers (Books) #368 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 17,263 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Colleen Noyes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFRY4IHKYY2R5U7SYKMJRYN523A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YNT13DFHYLH1?ASIN=0593183215",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Incredible",
                "reviewText": "This is hands down one of the most twisty turvy books I’ve read in a while. Having never read a book by this author I wasn’t sure what to expect and was pleasantly surprised. This book kept me on my toes and on the edge of my seat. Just when you thought you had it figured out, you realized that something was amiss and you were being led down a completely different path. While I did figure out some of it, I was thrown for a complete loop with what the actual mystery was. It is not often, that an author can do that to me and keep me completely engaged. If this is how the author writes all of their books, I can’t wait to dive in.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Suzanne Hoos",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWKNY4VGLEDY2K327RL7RKLXXMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I7WR9F6T5P5F?ASIN=0593183215",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "4.0 out of 5 stars Good read",
                "reviewText": "This book had great realistic characters. The trouble I had was trying to believe the paranormal plotline. Otherwise, the book was well worth my time.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DoomKittieKhan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3KFCH2SB5WE3C5IZDGA2SH3EYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3GLZPKPGYYXO6?ASIN=0593183215",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 19, 2022",
                "reviewTitle": "3.0 out of 5 stars I still love you Riley Sager. I will keep reading your books. But I know you can be better.",
                "reviewText": "Without fail, I will always look forward to a new Riley Sager book. Over the years, this anticipation has fluxed between honest enjoyment to cringy disappointment. I loved his early books were clearly fun reboots of canon horror films. I loved that they had the same flashy appeal as summer blockbusters. They are quick to read, easy to enjoy, and merit more than a few audible gasps. My love of Riley Sager's work peaked at Lock Every Door and plummeted to a new low with his last book, Survive the Night. So, it was with cautious optimism that I requested an advance copy of The House Across the Lake.Told in a split narrative that divides the book chronologically, we follow the functionally drunk and recently widowed actress, Casey Fletcher, to her family's lake home in Vermont. There we sink comfortably into a Rear Window-style frame story as Casey spies on her neighbors from the relative seclusion of her porch. While we sit with Casey, a glass of bourbon in hand, we drift along with her stream of conscious ramblings on the past and musing on the present.This is a comfortable thriller read. By that I mean that I didn't find myself on the edge of my seat, but I was invested in the story and wanted to see where it would go. Per usual, Sager pulls no punches with his twists and layers in an element of the supernatural to spice up the mystery. Because of this, I understand why there is serious divide about this book. While I love a good haunting, I felt like Sager didn't fully execute that portion of the story. I wanted to be more creeped out, more haunted. Instead, I was strapped with a narrator that was so focused on not being haunted that the paranormal elements fell flat. I like them, but I was not enthusiastic about them. I don't want to spoil anything, but I will say that I expected the narrator to at least ponder the haunting stories of the lake more as they would relate to the central story Sager was trying to tell. Especially since her family was one of the first to build on the lake and have consequently been there the longest. I just didn't buy it.I still love you Riley Sager. I will keep reading your books. But I know you can be better.Many thanks to Edelweiss, the author, and publisher for providing me with an ARC in exchange for an honest review",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dustin violet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBZESHCGCWBPE74HMI4MZKLUEIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCPHRDJ5RQWKF?ASIN=0593183215",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars My 1st Riley Sager book",
                "reviewText": "And boy was I hooked. This was recommended to me by my best friend after I fell into a reading slump. This pulled me right out of it. I was so curious about what would happen next. I was shocked at one point when a twist was revealed. I didnt see it coming and I loved that coz most stories are predictable to me now. I loved this book and will def be reading more of this authors works now.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martin Roy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOUMANCW5Q5VEAGTOKWO6ANVN6Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1N87SLBBYONGN?ASIN=0593183215",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 9, 2023",
                "reviewTitle": "4.0 out of 5 stars It Was Just Okay...",
                "reviewText": "I was extremely excited when this book came out. I knew that Mr. Sager would bring all the horror elements to the highest degree. But this novel, I found being the weakest of all of his books so far.I found myself distracted, putting the book down for several months until I attempted reading again. The novel simply didn't have the flair like his others. I was disappointed.I will continue to support and read his future novels, though.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLMQZ6RU6EK65DJRZ3QRYDCWCDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3AZB3FZ68RSBY?ASIN=0593183215",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Quick, easy read",
                "reviewText": "This was my first Riley Sager book, but it definitely won't be my last. I loved not guessing the twists and turns it would take. Very well-written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brooke GBrooke G",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3H47NK6WUDJTCY6LI6OF4IAP5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EE0B091FSU?ASIN=0593183215",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "2.0 out of 5 stars Demonic",
                "reviewText": "Not going to lie. Started off good until it got the ending and just started sounding so demonic. This book deals with possession. If you’re not into that, don’t read this. Last time I checked I wasn’t trying to read an exorcist book. I wanted to skip past some pages towards the end. My absolute least favorite book by Sager 👎🏽",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71AEEGLIgRL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charity Bower",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHGWQ6BKYOWKG4A5RU22RKXY7LPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WBS1947LYG4H?ASIN=0593183215",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2023",
                "reviewTitle": "4.0 out of 5 stars Thriller",
                "reviewText": "I had no idea the storyline before picking this book up. I saw it mentioned on Booktok and it looked interesting. The author does a great job weaving the storyline together in a way that keeps you guessing. I read this book in less than 24hrs.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marg Peebles",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Can you say Plot Twist?",
                "reviewText": "This book started off as expected…typical mystery…a salute to James Stewart in Rear Window, and was unfolding as expected as well.Until…plot twist…and another, and another!Just when you think you have it all figured out, the author rips the solid ground out from under you, and you’re lost again.Thoroughly enjoyed this book and I’m off to see if she has any other novels published.-",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Victor",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 2, 2023",
                "reviewTitle": "Disappointing",
                "reviewText": "I’ve mixed feelings on this book. ‘Til the half of the story, I really enjoyed how things went on and the manner the protagonist had been developed by the author. Although it had some (not to say many lol) cliches, I kinda didn’t much care, since I was enjoying the story’s atmosphere, the scenario that it took place and how things were going on.However, at 2/3 of the book, there are some awkward plot twists which make no sense. It felt like the author had to simply put a shocking/twisting event only to awe his readers. So he actually ended up putting it and he kinda developed this event on the story through the most random meaning which seems took out of the blue. It just makes no sense how the stories continues from that on and sort of disappointed me, especially the ending. Although having some good moments, the whole plot simply ain’t convincing. Wish luck for those willing to figure out on their own!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chelsea-anne kennedy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 17, 2023",
                "reviewTitle": "What did I just read.",
                "reviewText": "I picked this up expecting a run of the mill thriller, this is anything but. It does start out that way, we follow Casey a drunk actress at her lake house grieving her husband, when she starts spying on her neighbours. When the woman she was spying on goes missing after a fight with her husband, Casey plays detective.Sager has a way of writing women which sometimes feels like he hasn't never met one. However, I cannot seem to put his books down. He gets you immersed in the story and even if they start slow paced like this one. You will be turning the pages to find out what happened. Do I think this is a great book, no. But I enjoyed reading it and I loved the twists even if they seem extreme. I know when I pick up a Sager book its going to be fun.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "enthusiastic bookworm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on March 10, 2023",
                "reviewTitle": "A good book with a slightly odd plot twist",
                "reviewText": "I found The house across the lake to be a very good book. The style is great, and the mood is fantastic. On the other hand, I found the plot twist a bit disappointing.Was it unexpected? Yes.Was is jaw-dropping? Yes.Was it believable? No.Because of this last answer, I would give the book four stars. If you are not easily disappointed by a totally unrealistic plot twist, then I would recommend this book. The style, the thrill, and the mood are still very satisfying.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angie67",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 9, 2023",
                "reviewTitle": "Rear Window with the mother of all twists",
                "reviewText": "Whoa! What did I just read?This must be the Oscar winner for best WTF moments in a thriller book!I’ve seen so many mixed reviews for this one I didn’t know what to expect but in the end I shouldn’t have worried, because it’s Riley Sager! And he’s never disappointed me yet.His trademark is ’to entertain’, and boy was I entertained!Some might think he’s gone one step too far with this one! But if you love Stephen King like me, there is no step too far for a writer! As long as the plot is clever and original, I’m in!Casey, actress and alcoholic is hiding away in her house on the lake, waiting for some bad press to die down! Memories of her husband drowning in the lake keep surfacing between a bottle of bourbon and the other until one day she saves her neighbour Katherine’s life from drowning in the very same lake.A tentative friendship ensures and Casey starts watching Katherine through her binoculars as she and her husband go about their lives in the house across the lake! But one night after a heated discussion between the couple, Katherine vanishes.I absolutely loved this atmospheric read! My speculations were all over the place. But the moment the truth was revealed my jaw hung open for a full minute! Honestly… how on earth did the author come up with this?Brilliant!This was a perfect spooky read! So if you haven’t read it yet, what are you waiting for?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.54",
                "sellerName": "LaFonde",
                "sellerRating": "5"
            },
            {
                "price": "$6.28",
                "sellerName": "Page Masters",
                "sellerRating": "4.5"
            }
        ]
    }
}