{
    "remaining_requests": 1143,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dark-Roads-A-Novel/dp/B08PL73B3M",
    "body": {
        "name": "Dark Roads: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dark-Roads-A-Novel/dp/B08PL73B3M",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51FBNONYfBS.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Chevy Stevens",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Chevy+Stevens"
        },
        "brand": "Chevy Stevens",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 3517,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"Chevy Stevens is a brilliant and unique talent and Dark Roads is an instant classic. My hat’s off to her.\" (C. J. Box, number one New York Times best-selling author of Long Range)The Cold Creek Highway stretches close to five hundred miles through British Columbia’s rugged wilderness to the west coast. Isolated and vast, it has become a prime hunting ground for predators. For decades, young women traveling the road have gone missing. Motorists and hitchhikers, those passing through or living in one of the small towns scattered along the region, have fallen prey time and again. And no killer or abductor who has stalked the highway has ever been brought to justice.Hailey McBride calls Cold Creek home. Her father taught her to respect nature, how to live and survive off the land, and to never travel the highway alone. Now he’s gone, leaving her a teenage orphan in the care of her aunt whose police officer husband uses his badge as a means to bully and control Hailey. Overwhelmed by grief and forbidden to work, socialize, or date, Hailey vanishes into the mountainous terrain, hoping everyone will believe she’s left town. Rumors spread that she was taken by the highway killer - who’s claimed another victim over the summer.One year later, Beth Chevalier arrives in Cold Creek, where her sister Amber lived - and where she was murdered. Estranged from her parents and seeking closure, Beth takes a waitressing job at the local diner, just as Amber did, desperate to understand what happened to her and why. But Beth’s search for answers puts a target on her back - and threatens to reveal the truth behind Hailey’s disappearance....A Macmillan Audio production from St. Martin's Press \"Dark Roads is a chilling, pulse-pounding thriller that also tugs at the heartstrings. It's everything you've come to love from a master of the psych thriller genre!\" (Mary Kubica, New York Times bestselling author of The Other Mrs.)\"My favorite Chevy Stevens book since Still Missing. Stevens reliably creates complex, resilient female characters, and Hailey and Beth - whose lives collide in Dark Roads - are utterly compelling. The suspense builds with every page, and the ending is a complete shocker.\" (Sarah Pekkanen, number one New York Times best-selling Author of The Wife Between Us) Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 7 minutes"
            },
            {
                "name": "Author",
                "value": "Chevy Stevens"
            },
            {
                "name": "Narrator",
                "value": "Angela Dawe, Brittany Pressley, Isabella Star LaBlanc"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 03, 2021"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08PL73B3M"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#40,754 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3,186 in Suspense (Audible Books & Originals) #10,681 in Suspense Thrillers #13,645 in Literature & Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer Prystash",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7JW6OFAQXFU5BWWGSZWNKVTSDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UWQX2THC6SGU?ASIN=B08PL73B3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Perfect Ending!",
                "reviewText": "So many pieces of this book came together in a startling, and yet peaceful ending. I fell in love with the main character and was happy to see her get a “good” ending!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNDX7TOUV3F6HGEH2MKF7G2BGTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18F8K0NB6QEW6?ASIN=B08PL73B3M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars 4.5 stars",
                "reviewText": "Within the first few chapter I was hooked. I’m not one to read a book within a week period but I finished this one in a day and a half. The characters are described in such detail which allows you to empathize with them. Just when you think you’ve figured it out a new lead and theory comes into play yet those first theories still linger. This was my first read by Chevy Steven’s and I can say after reading this book I will be buying more of her books as I thought she did a wonderful job.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Trisha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFXBPBMCYX57WVHJIIPJJV7QOVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUJ0MSQRKR2M7?ASIN=B08PL73B3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Second book by this author",
                "reviewText": "The first book I read by this author was 'those girls' that book was amazing and I couldn't put it down. I finished in less than a day. So when I posted in my book club on facebook about it this book and 'still missing' was suggested highly. I will say out of these 3 books this one was tied for second along with those girls. At first I was unsure if I would like it but by the end of the first chapter I was hooked. I also finished this in a day. I do wish more of this authors books were on kindle unlimited. It's one of the many things I love about Freida McFadden.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dawn H",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3UOCUPFNKLPX46F5OHDZTPO4UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W2GCK76M2TD7?ASIN=B08PL73B3M",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2022",
                "reviewTitle": "3.0 out of 5 stars Not your usual Chevy Stevens thriller",
                "reviewText": "Let me start by saying, I am a huge Chevy Stevens fan. She is one of my auto-buy authors. I was so looking forward to this book but it fell short for me.The first 2/3 of the book felt like it was written by someone else and didn't hold any of those intense thriller aspects that I love in Chevy's books. Frankly, it was hard for me to get into and I wasn't invested at all.The last 1/3 of the book, when it all came together, was more like what I expect when picking up a book by this author.I'd recommend this book for readers who have never read a Chevy Stevens book before. If, like me, you've read them all, go into this one expecting a different kind of story than what she usually tells.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LaShan Carr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCPJMNPPNE2WGH6UGW3IWMEBEPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CWK5QJ5D2333?ASIN=B08PL73B3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Unbelievably Real!",
                "reviewText": "Dark Roads had me hooked from page one! It was unbelievably real and I felt like I was right with Hailey through the entire book!I loved the suspense and twists I did not see coming!This is my third book by Chevy Stevens and they just keep getting better!I can’t wait until she releases something new!Great Author! Great Book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RSW Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXZLU6VURRSQC2NFU7CK4MH57SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FDXR1D5PW470?ASIN=B08PL73B3M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2021",
                "reviewTitle": "4.0 out of 5 stars 4.5 Stars",
                "reviewText": "This <b>4.5 Star</b> thriller captured my attention from page one to the epilogue. I could not stop reading, I was absolutely had to know what was going to happen next!<b>SUMMARY</b>Seventeen year old Hailey lost her beloved father in a car accident, making her an orphan. She always believed that her mother's premature death by cancer would be the worst thing she would have to live through, but it turns out she was wrong. She was sent to live with her aunt who happens to be married to Vaughan, the unyielding police chief of their small British Columbian mountain town.Vaughn does not approve of much that happens in their town and particularly disapproves of Hailey's BFF Jonny. He seems hell bent on controlling Hailey and trying to find a reason to bust Jonny.In addition to Hailey's family drama, the town has a long history of women going missing along the highway that runs through town. For decades women have mysteriously disappeared, some bodies have been found, others have never been found. This small town has a lot of natural beauty, with its mountains and lakes, it attracts many campers and hikers. No one has ever been sure if the murderer is local or a trucker or tourist who passes through regularly.Hailey becomes extremely uncomfortable under her uncle's control and makes a plan to escape. The more Hailey digs, the more reasons she finds to get as far away from Vaughn as possible. Around that same time, another girl disappears and things in this already tense town reach a boiling point.Then Beth, the sister of the most recent victim, pops up in town, also looking for answers and stirs things up even more. Something has got to give! The plot takes the reader on a fast paced, unpredictable journey with Hailey, Jonny and Beth, none of whom will give up until the truth is uncovered.<b>WHAT I LOVED</b>I'm a big Chevy Stevens fan! This is my fourth Chevy Stevens book and definitely my favorite. Looking back at <i>Never Knowing</i>, <i>Still Missing</i> and <i>Never Let You Go</i>, I liked all of them, but in this book, Stevens seems to have mastered writing a thriller. The suspense sucked me right in. Although I knew this is a work of fiction, I found myself stressing out over the safety of this seventeen year old girl! I felt like I HAD to keep reading, if I stopped, she'd be stuck in limbo. Its safe to say I was very absorbed in the book and invested in all the characters.I LOVED the setting! British Columbia is such a beautiful place. I visited once and have never stopped thinking about it. I loved reading about this lovely town and could picture it in my head.The suspense was fantastic! I loved it all.There was a LGBTQ aspect to the story, a relationship between two girls. I loved the way it was woven into the story in a way that didn't distract from the plot but was undeniably there. I think we will see a lot more of that in literature moving forward.There was a fantastic dog. He was everything a dog should be; loyal, smart, loving and funny. I loved him!<b>WHAT I DIDN'T LOVE</b>There was really nothing I didn't like about the book, hence my 4.5 rating. It's not quite timeless enough to be a 5, but very few books are per my rating scale.<b>OVERALL</b>If you like fast paced thrillers and getting emotionally attached to characters, this is the book for you! I loved it and wish it was not over while simultaneously being happy for the characters that they have had some sort of resolution.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eun",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6BG3NH4QNBLLAICRL2TLPOJNDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVR2SFXULO40X?ASIN=B08PL73B3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "This is a great read filled with gut tightening chapters that seem as though I’m there. In Hailey, Chevy Stevens has conjured up a seventeen year old going on forty. After losing her father in a tragic accident, the girl is forced to live with her maternal aunt and herdictatorial police officer, husband. Monitoring her life, the officer keeps her on a tight leash and forces Haley to sneak out to join her friends. Wanting to escape from under his thumb, Haley runs away and lives in a minors cabin deep in the forest. It is thought that she is another victim of the cold creek highway murderer.Haley’s friend Amber is murdered and another victim of the cold Creek highway. When Amber sister BETH arrives in town. She is determined to find out who murdered her sister. What she and covers is shocking.This was a dark story in the subject matter difficult to grasp in that so many girls have been victims. To say I enjoyed this book doesn’t pay justice. It really held my interest and I felt the angst Haley and BETH experienced.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mandy ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDBASR3NU3H7AE2AB4TKRRRYYSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DZ5RW546WIH0?ASIN=B08PL73B3M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2023",
                "reviewTitle": "5.0 out of 5 stars A Page Turner",
                "reviewText": "There was always something happening that made you want to keep on reading. Left with suspense in middle of the book. Loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "john pynnaken",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 24, 2023",
                "reviewTitle": "Novel",
                "reviewText": "One of the best authors around, if you don’t read often or don’t feel reading is for you, this author will change your mind….very easy to read! 😊",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mrs s a Harrison",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 4, 2023",
                "reviewTitle": "exciting",
                "reviewText": "This was exciting and kept me in my toes till the very end with such an unexpected ending throughly enjoyed this can’t wait for the next one",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon customer :)",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 31, 2021",
                "reviewTitle": "nice one",
                "reviewText": "Nice one , it wasn't that bad . It got slow in between but i liked it.If you like thriller books then go for it !!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 16, 2022",
                "reviewTitle": "Good read.",
                "reviewText": "This was a good read for me but It was slower than Chevy’s other books. I wouldn’t say it’s one of my favourites by her but worth the read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "anon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 2, 2024",
                "reviewTitle": "Dark roads",
                "reviewText": "Bought as a gift for a happy recipient.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}