{
    "remaining_requests": 1285,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Good-Daughter-Novel-Karin-Slaughter/dp/0062430254",
    "body": {
        "name": "The Good Daughter: A Novel",
        "price": "$5.59",
        "originalPrice": "",
        "rawPrice": 5.59,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Good-Daughter-Novel-Karin-Slaughter/dp/0062430254",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81C9IoXbtuL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Karin Slaughter",
            "link": "https://www.amazon.com/Karin-Slaughter/e/B001IGHPV2/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 44417,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “Simply the best book you’ll read all year. Raw, powerful and utterly gripping – yet written with a tenderness and empathy that will break your heart.” — Kathryn Stockett, author of The Help“Simply one of the best thriller writers working today. I’d follow her anywhere.” — Gillian Flynn“Enter the world of Karin Slaughter. Just be forewarned, there’s no going back.” — Lisa Gardner“Fiction doesn’t get any better than this.” — Jeffery Deaver“If you’re into mystery thrillers, then you’re into Karin Slaughter.” — Skimm“Her characters, plot, and pacing are unrivaled among thriller writers, and if you haven’t yet read her, this is the moment.” — Michael Connelly“A fearless writer. One of the boldest thriller writers working today.” — Tess Gerritsen“Every Karin Slaughter novel is a cause for celebration.” — Kathy Reichs“Karin Slaughter has – by far – the best name of all of us mystery novelists. More to the point, The Good Daughter is Karin Slaughter’s most ambitious, most emotional, and best novel. So far, anyway.” — James Patterson“This is a great writer at the peak of her powers. Karin Slaughter is at her nail biting, heart stopping, emotionally draining best.” — Peter James“It is Karin Slaughter at her very best” — Huffington Post“Chilling, but with a lot of heart, this is a thriller you shouldn’t miss” — Happy Ever After blog, USA Today“But the success of writers like Gillian Flynn and Paula Hawkins and Karin Slaughter isn’t just due to the fact that they’re women... It’s about writers comprehending why women are so compelled by stories about brutal, graphic violence in the first place.” — The Atlantic“Though this is a crime novel, suspenseful and thrilling in every way, at its heart it is an exploration of family and the ties that persist through the most difficult moments... Slaughter delves into our darkest selves to reveal what is truly human.” — Library Journal“The plot twists here are satisfyingly surprising and plausible, but it’s Slaughter’s prodigious gifts of characterization that make her stand out among thriller writers…Slaughter’s satirical touches are as deft as her grimmer renditions of real life.” — Washington Post“Slaughter’s work is like a professional athlete coming to the playground to show the kids how it’s done. With her themes, tensions and metaphors, she has a talent for classic literature that is often missing in recent fiction.” — RTbookreviews.com“The darkness of the past is very present in this utterly chilling thriller. With heart and skill, Karin Slaughter keeps you hooked from the first page until the last.” — #1 Worldwide Bestselling Thriller Writer, Camilla Lackberg From the Back Cover The stunning new novel from the internationally #1 bestselling author—a searing, spellbinding blend of cold-case thriller and psychological suspenseTwenty-eight years ago, Charlotte and Samantha Quinn’s happy small-town family life was torn apart by a terrifying attack on their family home. It left their mother dead. It left their father—Pikeville’s notorious defense attorney—devastated. And it left the family fractured beyond repair, consumed by secrets from that terrible night.Twenty-eight years later, Charlie has followed in her father’s footsteps to become a lawyer herself—the ideal good daughter. But when violence comes to Pikeville again—and a shocking tragedy leaves the whole town traumatized—Charlie is plunged into a nightmare. Not only is she the first witness on the scene, but it’s a case that unleashes the terrible memories she’s spent so long trying to suppress. Because the shocking truth about the crime that destroyed her family nearly thirty years ago won’t stay buried forever . . . About the Author Karin Slaughter is one of the world’s most popular storytellers. She is the author of more than twenty instant New York Times bestselling novels, including the Edgar-nominated Cop Town and standalone novels The Good Daughter and Pretty Girls. An international bestseller, Slaughter is published in 120 countries with more than 40 million copies sold across the globe. Pieces of Her is now a #1 Netflix original series starring Toni Collette, Will Trent is now a hit television series starring Ramón Rodríguez on ABC, and further projects are in development for television. Karin Slaughter is the founder of the Save the Libraries project—a nonprofit organization established to support libraries and library programming. A native of Georgia, she lives in Atlanta. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 35 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“The Good Daughter is like Law and Order meets The Good Wife.” —theSkimmThe stunning new novel from the New York Times bestselling author of Pieces of Her— a searing, spellbinding blend of cold-case thriller and psychological suspense.Two girls are forced into the woods at gunpoint. One runs for her life. One is left behind…Twenty-eight years ago, Charlotte and Samantha Quinn's happy small-town family life was torn apart by a terrifying attack on their family home. It left their mother dead. It left their father — Pikeville's notorious defense attorney — devastated. And it left the family fractured beyond repair, consumed by secrets from that terrible night.Twenty-eight years later, and Charlie has followed in her father's footsteps to become a lawyer herself — the ideal good daughter. But when violence comes to Pikeville again — and a shocking tragedy leaves the whole town traumatized — Charlie is plunged into a nightmare. Not only is she the first witness on the scene, but it's a case that unleashes the terrible memories she's spent so long trying to suppress. Because the shocking truth about the crime that destroyed her family nearly thirty years ago won't stay buried forever…Packed with twists and turns, brimming with emotion and heart, The Good Daughter is fiction at its most thrilling.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ William Morrow Paperbacks; Reprint edition (April 17, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Mass Market Paperback ‏",
                "value": "‎ 656 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062430254"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062430250"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.8 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.19 x 1.48 x 7.5 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,509 in Books (See Top 100 in Books) #136 in Murder Thrillers #360 in Psychological Thrillers (Books) #571 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 44,417 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mad Karen’s cousin ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJDU5YFHGOZ2BU3ZYE47A7VKINQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQY59JC62EHH1?ASIN=0062430254",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars Really complicated",
                "reviewText": "I had to read certain sections twice to understand it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGD7QB2T4HQSMQW7YCS7NWPFZFEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VD9H88EIEXKS?ASIN=0062430254",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Great book.",
                "reviewText": "I loved this book. I could not put it down and I could not get enough of it. It was heart wrenching, but yet so good. It pulled me in right from the beginning. Great read. Love Karin Slaughter!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYGVMQ4NB65LY7UOWAT6VOHPFYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RYQNKBPKW7ZJ?ASIN=0062430254",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "5.0 out of 5 stars All consuming!!",
                "reviewText": "I’m honestly not sure if saying that “I loved this book” is the best way to put my reading experience.. Is it dark? Absolutely. Is it traumatic and disturbing? In true Karin Slaughter fashion, of course. But is it also so all consuming that you’ll have a hard time putting it down? 100 percent.Personally, I find Karin Slaughter books to be somewhat therapeutic - as someone that has unfortunately dealt with SA and doesn’t have it as a trigger when reading dark storylines. I cried when Charlie was explaining what SA truly takes from a person. I FELT that. Her detailing how she wanted to rid herself of everything inside her body that she felt was tainted by Zach, it’s so real. I didn’t even realize it at first, but I found myself sobbing.These types of books are definitely not for everyone. Know your triggers, if you have them. There are plenty of reviews so you don’t need to go in blind. Her books are extremely detailed and can sometimes be gruesome. That’s what makes them so incredible and realistic.As with her others, the character development in this book was phenomenal. You truly understood the motivations behind the main characters and you felt their emotions during each twist and turn. The story is gripping and once you’re in, if you can handle it, you won’t be able to put it down.If you’re interested in reading it, don’t hesitate. It’s absolutely worth it. I’ve quickly become a huge Karin Slaughter fan after 4 books and I’m looking forward to reading the rest!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grannie in Texas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLPK3FTWDZYQDSSLLCQXPIPMXIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19UGOE200J4SK?ASIN=0062430254",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Suspense all the way through!",
                "reviewText": "The suspense of what ws going to happen was there all the way through the book! I had absolutely no idea how the story would end!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa Reid",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7PVKF7F3A2OZTC45AJTUQ3VQEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZCTTU4ES10KY?ASIN=0062430254",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "3.0 out of 5 stars Excellent Thriller!",
                "reviewText": "Great read!! It was hard to put down and somewhat long; but it was very easy to get sucked into this great book. There are two mysteries, one from the past and one from the current day.I honestly never could have imagined how deep this families’ secrets were!The three star rating is due to a lengthy description of an event at the very onset of the book. This same event is then told two more times; yes, from new perspectives with some new important details but the author could have saved the reader a lot of time by summarizing the event the second and third time with only heavily, detailed, descriptions of the new, relevant information/details. Instead, however, the reader is forced to read verbatim, the same very, detailed, oriented rendering of this event two more times with the exact word for word writing. It’ll leave the reader experiencing major deja vu!Highly recommend this book and author; just need to be a patient reader!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sunny",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGE7H66R35OCW5E4MXC53ZKE6AXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU0BMDBB7YB3H?ASIN=0062430254",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "4.0 out of 5 stars Unnecessarily long, but a good storyline",
                "reviewText": "Overall, I really liked this book but felt that it was so unnecessarily long. It could have been condensed, and some areas it dragged on without really saying anything new. Some details didn't really need to be there and were just fluff. Not every single breath that people took nor a description of every inanimate item was needed. Lots of repetition with not much new info. I was irritated by that in the first 50% of the book, especially, but the overall storyline and family dynamic kept me reading. I was in the middle of a few other things that didn't allow me to read as much at once, so the amount of time it took me to get through the book probably didn't help this either.A truly heartbreaking story for many reasons. 3.5 rounded up to 4.The audible version of this story is excellent - 5/5 for that.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTS32ERLYDMPVLL4C7FRWPBGERA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFNCPX4JNPQRL?ASIN=0062430254",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow!!!",
                "reviewText": "Oh my word. This was an incredible read from start to finish! Had me hooked until the very last page!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regina Cook",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAO3THH3NSJHGIYSQGKWYI2PDFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2R4W2W3WQDYAN?ASIN=0062430254",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "5.0 out of 5 stars great read",
                "reviewText": "This book was a great read. A fantastic storyline, and was easy to follow. It was hard for me to put the book down!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reader1996Reader1996",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 2, 2021",
                "reviewTitle": "Fraught with raw suspense and a brutally honest depiction of the police and the legal system",
                "reviewText": "My taste in thrillers is getting better by the day, I see. Riddled with dark secrets wrapped in fine details, \"The Good Daughter\" is undoubtedly one of the most fulfilling crime thrillers you can read if you're into the genre. Some books leave you aching for more while some others make you desperate for a conclusion to all the loose ends. With all its raw suspense and brutally honest depictions of the police and the legal system, this book satisfies the latter. If you're someone who isn't scared to have your safety bubble ruptured with naked visions of corruption and dirty politics, this book is definitely for you.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1wpuO0Ye-S.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Astrid V",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 15, 2019",
                "reviewTitle": "Thriller muy bueno.",
                "reviewText": "Muy bueno, entretenido.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana Paula Alvaro",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 19, 2018",
                "reviewTitle": "Sensational",
                "reviewText": "One of those books you can’t put down!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Meghan Green",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 13, 2017",
                "reviewTitle": "emotional roller coaster in the best way",
                "reviewText": "I'm not sure where to start but I'm gutted that the books is over but relieved because I can get off this emotional roller coaster and get back to real life.Because I follow Harper Collins on Facebook I saw this book advertised. I clicked through and saw the price ($13.99 cad) and because I'm cheap and do bookbub I thought well maybe not. Then I saw she had a prequel to this novel for $2.99 so I bought that instead thinking if I really liked that one I could go back and buy this one.I read it in one night and started this book the same night and stayed up until 3 am reading then started again first thing when I got up at 8 and read until I was done.This book needs to be a movie.The beginning was so gripping and so terrifying I had major anxiety about what would happen next. The adrenaline alone kept me awake to keep reading.Then this morning in the second half of the book I cried so many times I am glad I was home alone! It's not often a book can make you laugh, be scared out of your wits, and the sob uncontrollably.If you are on the fence about reading this book, don't be. But order the prequel first too... worth the $3 for the extra emotional investment in what happens in this one.Either way, buy this book. But don't read it at night if want to sleep and maybe save it for a weekend or vacation so you can go at it all at once....because you will even if you do have to get up the next day.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carmen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 1, 2019",
                "reviewTitle": "Esta nuevo",
                "reviewText": "Esta nuevo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}