{
    "remaining_requests": 1172,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Vicious-Circle-C-J-Box-audiobook/dp/B06WRT9FSR",
    "body": {
        "name": "Vicious Circle",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Vicious-Circle-C-J-Box-audiobook/dp/B06WRT9FSR",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51n5UWA8qvL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "C. J. Box",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=C.+J.+Box&search-alias=audible"
        },
        "brand": "C. J. Box&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 14355,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The plane circled in the dark. Joe Pickett could just make out down below a figure in the snow and timber, and then three other figures closing in. There was nothing he could do about it. And Joe knew that he might be their next target. The Cates family had always been a bad lot. Game warden Joe Pickett had been able to strike a fierce blow against them when the life of his daughter April had been endangered, but he'd always wondered if there'd be a day of reckoning. He's not wondering any longer. Joe knows they're coming after him and his family now. He has his friend Nate by his side, but will that be enough this time? All he can do is prepare...and wait for them to make the first move. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 20 minutes"
            },
            {
                "name": "Author",
                "value": "C. J. Box"
            },
            {
                "name": "Narrator",
                "value": "David Chandler"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 21, 2017"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B06WRT9FSR"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,409 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #267 in Crime Fiction (Audible Books & Originals) #372 in Mysteries (Audible Books & Originals) #589 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Phil Strader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG3EYR2OERH6KOJWH63MEUFTSJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1L38SSEZ3IEM7?ASIN=B06WRT9FSR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Another awesome book!",
                "reviewText": "This is a great book and a must read for sure! A real page turner and hard to put down….definitely recommend the series!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pat Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETTZ3UEMQEEP3ZXNSEYQK7BHW2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26P9N7OEDHIAH?ASIN=B06WRT9FSR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 16, 2023",
                "reviewTitle": "5.0 out of 5 stars Well laid out and exciting plot",
                "reviewText": "It is suspenseful and kept me fully engaged. All the characters we know were in it. I am reading all of Box’s books in order and this was one of the best.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard P. Anderson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHWBMZ65WTBFDLI4SQYLCKFGQHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38K1LDCY2SP7Z?ASIN=B06WRT9FSR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Always Good, But",
                "reviewText": "Fun read but one thing I’ve always appreciated about the series is the writing stayed at a higher level. Family values, integrity and high moral character always seemed to have a prominent place in the books. This one had some crude moments, especially the CO’s description of sex acts in the women’s prison that puts an image in your mind that is disgusting and totally unnecessary. Why stoop to that level? That moment soured the rest of the book for me.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gerald Chrisman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHG2EV45FQWOKV7MYKR3E7A4NWLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2U3Z1CAL67VWK?ASIN=B06WRT9FSR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars great author",
                "reviewText": "I’ve enjoyed every book he has written. The new series Joe Pickett is good also. Don’t know if he wrote the script",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joan Boyle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFTUCKV7A7WQR3MED73RAOULVAMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R388MP5CH1ZORU?ASIN=B06WRT9FSR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars My husbands favorite author!",
                "reviewText": "Great story lines each book is interesting and captivating!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda O",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI32MK2KMP5AM5JCQ3HMOCEJZPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10OP12ZZI4VHT?ASIN=B06WRT9FSR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Kept me coming back",
                "reviewText": "Couldn't put it down, always cheering Joe Pickett on in his adventures. What a good guy!! Can't get enough, always ends too soon!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKRQAWYZO4IFJ3WM3MI2QENDVCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZLFIIMF424FF?ASIN=B06WRT9FSR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 24, 2017",
                "reviewTitle": "4.0 out of 5 stars Survival of the fittest demands a Pickett character evolution",
                "reviewText": "This Joe Picket novel has a brief dramatic beginning then slows down as the author wades through all the back stories of all the repeating characters. But the last half of the book finishes strong as the ties up the loose ends of the Cates family that were left hanging in a previous book. There are even a few surprises.On the down side, I'd expect more thoughtful ecological insight into the plants and animals of Wyoming as seen through the eyes of a college educated and trained State game warden. Is the exotic Siberian peashrub referred to as caragana in this novel really invading expanses of Wyoming big sagebrush in northeastern Wyoming? Is there really a giant cedar tree towering above other trees in the Bighorns? Are marmots really running through pine forests above the rimrock after the fall season's first snowfall and the beginning of elk season? I doubt the answers are yes, but if so I'd expect a game warden and keen observer of nature to note the ecological irregularities.Could a derelict Wyoming state trooper who wears sunglasses at night for dramatic effect really slip through the State's hiring and oversight processes?I've always found the Joe Pickett character's love affair with his Remington 870 shotgun interesting even though at times in past books Joe's shotgun preference has seemed tactically incongruous for a peace officer who has survived so many armed conflicts in the backcountry. In Vicious Circle Pickett notes the unfortunate range limitation of his shotgun's buckshot, but for some reason he doesn't slip in a rifled slug load which makes the shotgun a longer range and more versatile tactical weapon. In the real world of Wyoming game wardens, I suspect that most who keep a shotgun in the State pickup truck will also keep some rifled slugs along with their buckshot and birdshot.The proximity to death in an armed conflict tends to motivate peace officers to improve their tactical ability, and Joe Pickett's repeated survival of armed conflict would probably make him a national expert sought for training other officers. And in the real world of typically wide-open Wyoming we'd also expect more tactically savvy peace officers to carry carbines and rifles -- specially game wardens who on a fairly regular basis have to perform a coup de grace on injured or wounded wildlife that are still mobile enough to flee. And those same officers equip their long guns with optics that help them do their job both in low light and at longer range.I hope C.J. Box will help us suspend our disbelief well enough that we can become even more deeply engaged with his Wyoming natives -- human, flora, and fauna. In the next Pickett novel I hope Joe will be much higher on the officer survival learning curve and be the tactical expert that he would have become had he really survived so many gunfights. It's also logically consistent that Maribeth and the girls would become concealed carry handgun experts after being terrified by a meth head ax murderer and seeing their home burned down by a revenge-crazed felon. I eagerly awaite Box's next Joe Pickett novel, and hope Joe will have learned and grown as a peace officer just as he has learned and grown as a father.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AER5ZUJYMNKSLACT2UHEGGHYERDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NFH0HRNW00FL?ASIN=B06WRT9FSR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "5.0 out of 5 stars C. J. Box",
                "reviewText": "C.J.Box just keeps getting better and better. I hooked on Joe Picket and Cassie Dewell. Read both full series.!!! What a ride!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Abhishek Kumar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 31, 2020",
                "reviewTitle": "Excellent",
                "reviewText": "This is the seventeent book in the series of game warden Joe Pickett which is as good as his other book in the series and the fans of the author will find this interesting and enjoyable read however newcomers should start from the beginning for better read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan Hampson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 17, 2019",
                "reviewTitle": "One of my favourite series",
                "reviewText": "I have been with Joe Pickett from the very first book and have loved every single one of them. Joe is a solid family man, a hard worker, honest and fair. He has well and truly earned his high ranking badge as one of Wyoming Big Horn Mountain rangers. I fell in love with this place and the author’s ‘come to life’ descriptions. The harsh winters, beautiful but deadly too. What I really like is the feeling of home in Jackson Hole that I get every time I open a new book to read about familiar characters, hoping that my favourites will be hidden in other chapters further in the book. It really is something special for an author to give you a feeling of missing home when you have never been there.What begins as a search by air for a missing local man in the mountains turns into the search team making him a visible target for the killers that are hunting him down. Helpless there is little they can do from the air by the time they realise what is happening it is too late.Past events are back to haunt Joe Pickett and his family as Dallas, a former Rodeo star and only one of two family members that are still alive after nearly killing Joe’s adopted daughter, is back for revenge. His prison sentence is over and he has a couple of new acquaintances in tow to lend a hand at what they do best.This isn’t really a series that I feel you can just nip in and out of as the rolling characters are tied into the family from different books. The books began when the girls were only small, only two of them then and now only one is at home looking forward to college.Dallas is a real mummy’s boy and although she is now only able to move her neck and head, after her encounter with Joe in an earlier book, she still manages to rule the inmates of the prison she is in. She is one scary lady.My skin crawled with the arrogance of Dallas, but Joe is determined to bring his rein finally to an end to protect his daughters.This is a perfect addition to this already superb series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda - Hagersville",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 2, 2017",
                "reviewTitle": "solid thriller mystery",
                "reviewText": "This is book 17 and Joe Pickett is a well established law and order game warden with strong family ties. The cat & mouse investigation had many twists and frightening scenes for Joe's family.Joe & his family are threatened when Dallas Cates returns to Twelve Sleep County to avenge his family's tragedy. Poaching in the district has become a major problem and the new state governor isn't the politician the voters thought they elected, putting Joe's ethics to the test.Excellent reading.There is some violence in this novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 28, 2017",
                "reviewTitle": "Vicious Circle",
                "reviewText": "The pages just turn too fast. I adore Joe Pickett and Marybeth, and Nate and the girls too. Since the first book 'Open Season I've been totally hooked'. I can recommend this book and certainly this author, C.J.Box. Don't hesitate -go ahead and buy it, you will not be disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Roger Mayer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 19, 2020",
                "reviewTitle": "Great story",
                "reviewText": "I like the inclusion of the natural history and descriptions of the country. It makes one feel like they are there.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}