{
    "remaining_requests": 1188,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Clinic-Novel-Cate-Quinn-ebook/dp/B0BZ9NT4XT",
    "body": {
        "name": "The Clinic: A Novel",
        "price": "$7.39",
        "originalPrice": "",
        "rawPrice": 7.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Clinic-Novel-Cate-Quinn-ebook/dp/B0BZ9NT4XT",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81OnAl6SObL._SY522_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Cate Quinn",
            "link": "https://www.amazon.com/Cate-Quinn/e/B08WKQYLLD/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 299,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BZ9NT4XT"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Sourcebooks Landmark (January 23, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 23, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4212 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 444 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1464216215"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,343 in Kindle Store (See Top 100 in Kindle Store) #68 in Amateur Sleuth Mysteries (Kindle Store) #97 in Amateur Sleuths #193 in Murder Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 299 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f71db43-3e41-4071-a673-59e034ae9649.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f1d25a1-5471-4aed-a1d1-e294d338b2a5.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/df8d4ec1-19be-4795-803d-24f9e275645d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25d7f690-7b5d-4025-941a-278ad8d876e3.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "R. Robinson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR32JNFPOKA7FB6IDFOOWTUSNYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JROG3GM3Q24T?ASIN=B0BZ9NT4XT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "4.0 out of 5 stars Twisty atmospheric psychological thriller about addiction and trauma",
                "reviewText": "I chose this book mostly because of the cover. The large old fog-shrouded Victorian house atop a rocky cliff along the ocean in the Pacific Northwest just screamed mystery and doom to me. The description sealed it for me. I love mysteries with a medical element. The book pulled me in at once and didn't let go until the wee hours of the morning when I arrived at the shocking ending. It would make a great movie.This is a book about trauma and addiction. The Clinic is a exclusive rehab center catering to the rich and famous. It is housed in what was once a prison but redone in the most upscale way by the owner Dr Lutz. It sits far removed from local towns along a lonely road surrounded by the ocean on one side and towering forests on the other and often wrapped in a shroud of fog and mist.Haley, the pretty blonde rock star is at The Clinic for her drug addiction. She is found dead and it is assumed to be suicide by drug overdose. Her sister Meg is a professional card player who takes on different personas to catch bad guys in a casino in LA. She is addicted to oxycodone after a shoulder injury and drinks too much to get through the day. She and Haley have an on-again, off-again relationship, but she doesn't believe Haley would commit suicide. She checks herself into The Clinic to investigate Haley's death. Cara is The Clinic manager hired away from an big hotel chain. She is very organized and rule-oriented.The story is told in short alternating chapters by Meg and Cara. Through them we meet Dr Lutz, who looks like he could be an aging Seattle hipster in jeans and t-shirts with flip-flops, and Max, the Clinic's psychiatrist. Through Meg we get to know the other addicts at The Clinic, all of whom are rock stars, actors and actresses.Like Meg, I suspected each of the characters at one point or another. Every time I thought I had it figured out, suspicion would be cast on someone else. The end was so twisty it was almost hard to keep up with. The ending was a total surprise.The book deals with addiction and underlying trauma in a very realistic manner. We find out in the author's acknowledgement that she spent time in rehab for alcohol addiction so she is very well versed in the goings on at a rehab clinic She obviously did a lot of research on some of the less mainstream methods used at The Clinic and on the particular drug being studied there. The book is detailed in these things but it is never boring. I commend the author for sharing her story in the acknowledgement and congratulate her for her success in remaining sober while still writing an excellent book.Thanks to netGalley, The author, and Sourcebooks Landmark for allowing me to read and review an early copy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "jeg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2S5DV37EGD64WV7RZABCWKZN5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3164UZMFR3G60?ASIN=B0BZ9NT4XT",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars The Clinic",
                "reviewText": "This was a great book. It was a look into addiction and treatment, family, and friends. . It kept me guessing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thisisjusttheprologue_Thisisjusttheprologue_",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDZENBU5FWMHNO3PGTI7R5LGKSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12ZYN7U2W4MB3?ASIN=B0BZ9NT4XT",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars Twisty locked room thriller",
                "reviewText": "Meg, a DEA agent whose gig is working undercover in casinos, admits herself to an exclusive (and expensive!) rehabilitation center where her celebrity sister, Haley, was found dead. She knows that someone there had something to do with her sister’s death and wants to get to the bottom of it- but does that mean she’s trapped there with a killer? In this locked room thriller, Meg is stuck inpatient at a rehab that’s so off the beaten path, it’s not on GPS. Isolated in a fully restored old mansion, this state of the art facility has all sorts of luxury amenities, as well as secrets.This was a well-written thriller that kept me guessing throughout. I loved the super short chapters (115 chapters, to be exact)- I felt that it was the best way to tell this story and keep the reader engaged and rearing to turn the page. With the way that Quinn described The Clinic, especially the spa area, I felt like I could see the building myself. With a single, linear timeline and alternating duel points of view between Cara, the clinic manager, and Meg, a patient at the rehab clinic, the characters in this book were straightforward and it was easy to keep track of who’s who. I enjoyed getting to know Meg as a character and felt that there was decent character development here that let the reader learn more about her (and decide whether to love or hate her). It was interesting to see her journey while in the rehab as she realizes that she actually may need the help that is offered there.I liked how a lot of the male characters had 3 letter first names and that was a hint from one of Haley’s journal entries. This had me guessing which character Haley could have been writing about. I appreciate the authors note and how she used some of her own experiences with rehab to write this book. I also found the research about blowfish and fugu fascinating and I absolutely took to Google to find out more. 🐡While this book was full of twists and turns, the major twist was so shocking that I felt it was a bit too unrealistic to be entirely enjoyable to me, which is what kept me from rating this book a full five stars.The Clinic published January 23rd and is available everywhere now!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61QMOvK81sL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "oriette",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 10, 2024",
                "reviewTitle": "Another great book by Cate Quinn, well worth reading.",
                "reviewText": "The open honesty from Cate Quinn about something so personal made me realise this book was going to be even better than I expected. And having read other books by the same author, my expectations were already high.The story is gripping, I didn’t want to put it down. There are several interesting, and often troubled, characters to get to know and working out who is good and who isn’t is a puzzle that kept me occupied whilst reading, and my mind was changed often. After the death of a singer the finger of suspicion is pointed at each person at the clinic. But with both staff and clients keeping secrets there are many twists and turns along the way to finding out. I learned a lot about people and how different mental health conditions affect them whilst reading too. I consider myself to be good at showing empathy but hopefully I’ll be even better after reading this. Highly recommend book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Moimoi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 10, 2024",
                "reviewTitle": "A very readable thriller",
                "reviewText": "Well crafted and paced, I enjoyed this book. I found the neuro and psychological stuff interesting and it helped that the main character Meg was relatable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}