{
    "remaining_requests": 1144,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Plot-Jean-Hanff-Korelitz-ebook/dp/B08JKC299M",
    "body": {
        "name": "The Plot: A Novel",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Plot-Jean-Hanff-Korelitz-ebook/dp/B08JKC299M",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/413BX0UWqEL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/61qWgzP9bSL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jean Hanff Korelitz",
            "link": "https://www.amazon.com/Jean-Hanff-Korelitz/e/B001HCV342/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 21949,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08JKC299M"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Celadon Books (May 11, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ May 11, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2728 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 317 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#26,716 in Kindle Store (See Top 100 in Kindle Store) #182 in Heist Thrillers #368 in Psychological Fiction (Kindle Store) #406 in Domestic Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 21,949 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "AN INTERVIEW WITH THE AUTHOR At the risk of sounding too meta, how did you come up with the plot of The Plot? JEAN HANFF KORELITZ: Like most writers I’m fascinated by plagiarism and the murkiness around creative appropriation: chefs stealing recipes from other chefs, comedians helping themselves to other comedians’ jokes, academic theft, and above all creative writers appropriating work by others. I’m hardly the first novelist to write about this — there’s an entire sub-genre of Stephen King work on this theme — and it’s not the first time I’ve touched on it in my own work, but it’s the first time I’ve placed it front and center in a book. I think it makes sense to write about the things that fascinate us.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b55ff15a-3c96-48dd-8544-ee8e5b1f150d.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            },
            {
                "media_text": "While writing this book, you must have put yourself in the shoes of the main character. Do you think you’d ever steal a genius idea for a book if you knew it would never be used? I wouldn’t, but only because I’m squeamish by nature and I’d be terrified about that degree of exposure and disapproval. But like most artists, I also understand that stories run underneath the ground of our collective experience, and we all dip into them, whether we’re aware of it or not. The real question is: At what point does a collective story become the individual property of a person or an artist? A contender for the 2020 Pulitzer Prize for Drama was The Inheritance by Matthew Lopez, which openly adapts Forster’s Howards End to contemporary New York City. This is a normal, even laudatory practice, which artists fully understand. But to help yourself to the specific plot of a recently deceased author who never completed his book? I don’t know where the line is, exactly, but I’m pretty sure that’s over it.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c153cfc2-23f8-4fa7-bc25-2c5b2cd108fc.__CR0,0,300,300_PT0_SX300_V1___.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9f48e38d-fe5c-4828-b27c-834caa042d76.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/28321f1c-0ecd-45cb-825a-658de1f2488a.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/954dcbf4-42e7-45da-8cd5-782423faa912.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b55ff15a-3c96-48dd-8544-ee8e5b1f150d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c153cfc2-23f8-4fa7-bc25-2c5b2cd108fc.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer Childs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDZLVNLKOQEXCSPBCSGRLFS6EGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVIRRTJ58GVFD?ASIN=B08JKC299M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Certainly interesting",
                "reviewText": "This book had twists and turns all the way to the bitter end. It was well worth the read and I highly recommend it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Schroeder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUGOQROFP7OAMXOTTAUTBNB3E3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3BJ7CPSFDD3ZT?ASIN=B08JKC299M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Lived up to its name",
                "reviewText": "With a book like this, the plot better be fantastic and it delivers. I've already bought this for my mother who loves a good thriller.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMXFZJLBMIHAPE6TOGIEH43MLVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AERNH3LZSMQB?ASIN=B08JKC299M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Plot twister",
                "reviewText": "This was incredibly well-written. Edge of your seat twists and turns. Get ready for a long night of reading as it’s so hard to put down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3KF6QTMUN6JVZVQ4JSM6IDBN7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4D47EDW41BF4?ASIN=B08JKC299M",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "3.0 out of 5 stars Great story ruined by unnecessary political snark",
                "reviewText": "I read to get away from politics. Unfortunately, as with most things these days, the author chose to unnecessarily sprinke politics into this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan M. Baumann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFF4RLO2XJJ4YKGEIJPESXE5I2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2I0PLWTCXTU7J?ASIN=B08JKC299M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 6, 2021",
                "reviewTitle": "4.0 out of 5 stars An Intricate Plot",
                "reviewText": "Hanff Korelitz created a main character that I initially loathed, then later liked, despite his flaws, and then even eventually rooted for in the end. Not an easy task, so kudos on that front. Jake is a novelist who experienced early modest acclaim, but he hasn’t been able to replicate that success in his subsequent efforts. He longs for the dreamed-of accolades of a truly famous writer, but instead teaches creative writing at a small, obscure MFA program in Vermont. He’s envious of his student’s youth and potential talent, and also disdainful of what he views as their naïveté and inferiority. Then, he meets his new student, Evan Parker, who has obvious confidence in himself and his work. Jake automatically assumes Evan is without merit or skill and is stunned when Evan reluctantly shares his story ideas with him, begrudgingly agreeing that he can indeed write and has a viable, potential blockbuster plot on his hands. Jake is morose, competitive and churlishly waiting for Evan’s mega-hit to reach publication, but nothing happens. Jake is understandably curious, and assumes that the dazzling idea just never made it to completion. He’s mollified and appeased. Years pass. Jake gets curious again and searches for Evan and his book online. He finds nothing, but instead, stumbles on Evan’s obituary. Jake is shocked. He mulls over the thought of a fresh idea languishing unused with the now-deceased Evan. Jake decides to take the original idea and craft it into a novel of his own. Staggering success comes to him as a result. He basks in the glory that he has always wanted, but is vaguely uneasy, fearful that someone will nullify his success if they discover where the initial book idea originated. Jake pushes down his reservations and misgivings, enjoying book tours and radio and television appearances. During one such appearance on a popular radio show, he meets, Anna, a smitten fan. They have a whirlwind courtship and marriage, and she moves to NY from WA to begin their life together. Jake can’t believe his good fortune and they settle in happily. Anna improves his life, his diet, his apartment and his relationships. Then, suddenly out of nowhere, Jake begins receiving online messages from a stranger, who claims to know that Jake stole and plagiarized his stratospheric novel. He threatens exposure, and the threats escalate rapidly. Jake is in turmoil and sets out on a long journey to determine who his tormentor is. The book was slow to start, but the suspense ratchets up, once the story gains momentum. The book is well-written and carefully-plotted, with an intricate, disturbing and unsettling story. Somewhat implausible that a stranger (Jake) on a quest, with a shoestring of attachment to Evan, could garner so much information from townspeople in various states, who would more likely be suspicious and reticent of an outsider. I guessed the perpetrator/antagonist early on, but wondered if the author intended that, and wanted the reader to know, and only for Jake to be unaware. I disliked the ending, and thought it might veer in another direction. I hoped for feline intervention!This is a well-paced, dark thriller, with a glimpse into the world of publishing, exploring the complex motives and ambitions of authors seeking notoriety and all that entails. A good read.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pumpkinman4ever",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7346NQUC2IYOAQSETIEMI4IFRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35R2GAG4R3L1Z?ASIN=B08JKC299M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2021",
                "reviewTitle": "5.0 out of 5 stars A Very Intriguing Mysterious Thriller!!!",
                "reviewText": "I was interested in this book because Jimmy Fallon mentioned it on The Tonight Show, when he was doing 'Summer Reads' My top two choices were this and Razorblade Tears. I'm Happy 'The Plot' won, because I was definitely intrigued by the story. In a way, it reminded me of a mix between I Know What you Did Last Summer and a Stephen King story called Secret Window, Secret Garden. This is not horror, but it's a mystery/thriller. This was the first book I read by Jean Hanff Korelitz, and I'm happy I did. I finished the book in about 4 days. I thought it started out a little slow, but when I got to chapter 7, it definitely started to pick up.Our main protagonist is a has-been author named Jacob 'Jake' Finch Bonner. Jake has written two books, but nobody really knows about his work. He becomes a writing teacher at Ripley college and one of his students is named Evan Parker. Parker is a narcisstic and full of himself. He looks down on everyone, including Jake. Jake wants his students to share their stories and ideas with each other, but Evan refuses, thinking he's writing the greatest book of all time. A book that everyone will read and a famous director will turn it into a movie someday.One day, Evan shares a few pages with Jake. The story is about a teenaged girl who lives in a large house and wants desperately to escape her mom. Jake is intrigued by the story, but goes on to try and do better things. Over the next two years, Jake is really struggling to find work, and eventually looks up to see if Evan ever published his 'great' novel. Turns out, Evan Parker died by an overdose, so Jake, desperate to make ends meet, decides to steal aspects of Evan's story for himself.Three years later, Jake has finally written a successful novel titled 'Crib' He's going on book tours, making television and radio appearances and even meets the love of his life named Anna. His book is so successful, that Steven Spielberg is turning it into a movie. Life is going great for Jake Bonner, until one day, he receives an e-mail from someone named Talented Tom that says \"You are a thief\"Jake begins to play detective and tries to figure out who Talented Tom is, why they're sending e-mails, and Evan's family history. The e-mails keep coming and even harassment on all social media. Clearly, someone doesn't want this story to be told, but why?Overall, I'm really glad I read this book. I was very intrigued by it, and it has a pretty cool twist. Hopefully someday, they'll turn it into a movie or tv series. I highly recommend THE PLOT!!!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Chu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 24, 2022",
                "reviewTitle": "Enredo muito interessante",
                "reviewText": "Apesar das diversas avaliações na Amazon dando muitos spoilers, a trama não deixa de ser interessante, especialmente o retrato dos percalços por que passa um escritor. Mesmo antevendo o segredo que é revelado no final, a autora consegue manter o interesse na investigação do protagonista, mesmo ele não sendo um personagem carismático. Já a história dentro da história não empolga tanto e nem convence se tratar de um enredo surpreendente capaz de torna a história um best-seller internacional.Relevando-se estes detalhes, o livro é muito bem escrito e para quem gosta do gênero, é uma leitura recomendada.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vlad Thelad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2021",
                "reviewTitle": "Writers writing about writers",
                "reviewText": "Writers writing about writers is not exactly an automatic “go-to” for fiction lovers. I am not even sure it merits being considered as a subgenre on its own. Or maybe I haven’t come across many that attracted me to read them. I picked up “The Plot” because it made a top 2021 fiction list I saw, probably the result of great marketing by a strong publishing house, of the sort one will find in this novel. This is a novel to be enjoyed as a thriller that steadily builds suspense in an almost deceptive way, until you realise you cannot stop thinking about it and have to continue reading. On a lighter note, it also portrays the inner workings of the editorial and publishing world, and, finally, it takes a few stabs at a writer’s ethical dilemmas regarding authorship and appropriation. All in all, a very entertaining read as we wrap up another year.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Justareview",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 2, 2024",
                "reviewTitle": "Liked it",
                "reviewText": "Read it with book club, great plot twist",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elke Fehling",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 25, 2022",
                "reviewTitle": "Disappointing",
                "reviewText": "Disappointing, because the ominous plot wasn't so great after all. Not a story that would make any writer a bestselling author, like everyone said. Just a normal crime story.You start reading the book and wonder what great story this is about, and then this... Nah.And the whole story was too predictable. I knew relatively early who did what.Disappointing.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nandini",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 1, 2022",
                "reviewTitle": "Keeps you guessing till the end",
                "reviewText": "Ingenious plot and superior narrative construction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}