{
    "remaining_requests": 1347,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Then-She-Was-Gone-Novel/dp/1501154656",
    "body": {
        "name": "Then She Was Gone: A Novel",
        "price": "$10.08 $9.08",
        "originalPrice": "$16.00",
        "rawPrice": 10.08,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Then-She-Was-Gone-Novel/dp/1501154656",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/910nluQF9+L._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lisa Jewell",
            "link": "https://www.amazon.com/Lisa-Jewell/e/B001IO9ULM/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 101801,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for Then She Was Gone:“Then She Was Gone is a riveting thriller.” ― PopSugar“Jewell teases out her twisty plot at just the right pace, leaving readers on the edge of their seats. There will surely be comparisons to novels such as Emma Donoghue’s Room (2010) as well as all of the “Girl” thrillers, but Jewell’s latest really isn’t at all derivative. Her multilayered characters are sheer perfection, and even the most astute thriller reader won’t see where everything is going until the final threads are unknotted. Those few who do guess early won’t mind, as the pace and prose will keep them hooked.” ― Booklist (starred review)“Jewell gets more riveting and twisty with every book she writes. Completely absorbing, fast-paced, well-written and with a shocking ending that will keep readers guessing, Then She Was Gone is a nearly pitch-perfect thriller. Fans of Gillian Flynn, Paula Hawkins and Ruth Ware are sure to adore this haunting novel.” ― Shelf Awareness“More than a whiff of The Lovely Bones wafts through this haunting domestic noir from bestseller Jewell…Skillfully told by several narrators, Jewell’s gripping novel is an emotionally resonant story of loss, grief, and renewal.” ― Publishers Weekly\"For thriller readers, Jewell's latest will not disappoint. Sharply written with twists and turns, it will please fans of Gone Girl, The Girl on the Train, or Luckiest Girl Alive.\" ― Library Journal“In addition to being a complex and genuinely suspenseful narrative, Then She Was Gone is a rich study of the ways in which people respond to grief and how past trauma can continue to shape their decision-making and relationships years or decades later. Readers will be truly affected by Ellie’s real story once it’s revealed—and they’ll be satisfied by the hopeful yet bittersweet ending. Jewell demonstrates once again that she has what it takes to genuinely shock, surprise and move her readers.” ― Book Reporter\"What begins as a story about the mother of a missing girl starting a new relationship as she comes terms with her grief morphs into a gripping, disturbing and utterly fascinating tale about what really happened to young Ellie Mack. I've been a Lisa Jewell fan for a long time and in this book, as in all her others, she deftly weaves a compelling plot with an emotional depth that leaves you gasping. In Then She Was Gone she has created a book that is dark and claustrophobic but also heartfelt and moving. Then She Was Gone packs a huge emotional punch that will leave you winded. I loved it.\" -- C.L. Taylor, bestselling author\"If you were the first of your friends to read Girl On The Train, and have read Gone Girl more times than you can remember, then here is your summer read. A thriller about a 15-year-old girl who has vanished and a mother who won’t give up hope. A perfect Pimm’s companion.\" ― The Sun (UK)\"Smart and engrossing.\" ― Sunday Mirror (UK)\"A dark, compulsive psychological thriller, yet one which is also uplifting and tender. I absolutely loved Then She Was Gone.\" ― Rachel Rhys, author of Dangerous Crossing\"Jewell has departed from chick lit and gone full tilt into a psycho thriller, but she’s lost none of her brilliance… Deeply emotional and incredibly clever. Bravo.\" ― Mail OnlinePraise for I Found You:“Lisa Jewell is a brilliant storyteller, creating suspenseful yet believable novels time and again. I Found You is no exception—filled with intriguing characters connected in startling ways. Quickly paced yet delicately nuanced, this novel is sure to appeal to fans of Big Little Lies and The Woman in Cabin 10.” ― Shelf Awareness (starred review)\"Jewell is a wonderful storyteller. Her characters are believable, her writing is strong and poetic, and her narrative is infused with just enough intrigue to keep the pages turning. Readers of Liane Moriarty, Paula Hawkins, and Ruth Ware will love.\" ― Library Journal (starred review)“How [the] plots intersect and finally collide is one of the great thrills of reading Jewell’s book. She ratchets up the tension masterfully, and her writing is lively.” ― New York Times Book Review\"Jewell keeps the reader guessing.\" ― New York Post, Required Reading column“The structure keeps the suspense level high, and Jewell manages surprising revelations all the way up to the ending. The mix of women’s fiction and suspense—plus a no-nonsense 40-something heroine at the heart of the story—makes this a good fit for fans of Liane Moriarty.” ― Booklist“Riveting…numerous twists avoid predictability, and the novel is well-paced as it weaves three narratives together. Dark and moody, this is a mystery with substance.” ― Kirkus Reviews\"One word: wow! This latest offering from Jewell starts off strong and keeps readers riveted until the very last word…this book is ‘unreliable narrator’ at its best!\" ― RT Book Reviews“Jewell is a genuinely original and skilled novelist with an impressive flair for deftly crafted narratives and surprising plot development.” ― Midwest Book Review About the Author Lisa Jewell is the #1 New York Times bestselling author of nineteen novels, including The Family Upstairs and Then She Was Gone, as well as Invisible Girl and Watching You. Her novels have sold over 10 million copies internationally, and her work has also been translated into twenty-nine languages. Connect with her on Twitter @LisaJewellUK, on Instagram @LisaJewellUK, and on Facebook @LisaJewellOfficial. Excerpt. © Reprinted by permission. All rights reserved. Prologue PROLOGUE Those months, the months before she disappeared, were the best months. Really. Just the best. Every moment presented itself to her like a gift and said, Here I am, another perfect moment, just look at me, can you believe how lovely I am? Every morning was a flurry of mascara and butterflies, quickening pulse as she neared the school gates, blooming joy as her eyes found him. School was no longer a cage; it was the bustling, spotlit film set for her love story. Ellie Mack could not believe that Theo Goodman had wanted to go out with her. Theo Goodman was the best-looking boy in year eleven, bar none. He’d also been the best-looking boy in year ten, year nine, and year eight. Not year seven though. None of the boys in year seven were good-looking. They were all tiny, bug-eyed babies in huge shoes and oversized blazers. Theo Goodman had never had a girlfriend and everyone thought maybe he was gay. He was kind of pretty, for a boy, and very thin. And just, basically, really, really nice. Ellie had dreamed about being with him for years, whether he was gay or not. She would have been happy just to have been his friend. His young, pretty mum walked to school with him every day. She wore gym gear and had her hair in a ponytail and usually had a small white dog with her that Theo would pick up and kiss on the cheek before placing it gently back down on the pavement; then he would kiss his mum and saunter through the gates. He didn’t care who saw. He wasn’t embarrassed by the powder-puff dog or his mum. He was self-assured. Then one day last year, just after the summer holiday, he had struck up a conversation with her. Just like that. During lunch, something to do with some homework assignment or other, and Ellie, who really knew nothing much about anything, knew immediately that he wasn’t gay and that he was talking to her because he liked her. It was totally obvious. And then, just like that, they were boyfriend and girlfriend. She’d thought it would be more complicated. But one wrong move, one tiny kink in the time line, it was all over. Not just their love story, but all of it. Youth. Life. Ellie Mack. All gone. All gone forever. If she could rewind the timeline, untwist it and roll it back the other way like a ball of wool, she’d see the knots in the yarn, the warning signs. Looking at it backward it was obvious all along. But back then, when she knew nothing about anything, she had not seen it coming. She had walked straight into it with her eyes open. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 6 hrs 12 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 17 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER From the New York Times bestselling author of Invisible Girl and The Truth About Melody Browne comes a “riveting” (PopSugar) and “acutely observed family drama” (People) that delves into the lingering aftermath of a young girl’s disappearance.Ellie Mack was the perfect daughter. She was fifteen, the youngest of three. Beloved by her parents, friends, and teachers, and half of a teenaged golden couple. Ellie was days away from an idyllic post-exams summer vacation, with her whole life ahead of her. And then she was gone. Now, her mother Laurel Mack is trying to put her life back together. It’s been ten years since her daughter disappeared, seven years since her marriage ended, and only months since the last clue in Ellie’s case was unearthed. So when she meets an unexpectedly charming man in a café, no one is more surprised than Laurel at how quickly their flirtation develops into something deeper. Before she knows it, she’s meeting Floyd’s daughters—and his youngest, Poppy, takes Laurel’s breath away. Because looking at Poppy is like looking at Ellie. And now, the unanswered questions she’s tried so hard to put to rest begin to haunt Laurel anew. Where did Ellie go? Did she really run away from home, as the police have long suspected, or was there a more sinister reason for her disappearance? Who is Floyd, really? And why does his daughter remind Laurel so viscerally of her own missing girl? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books; Reprint edition (November 6, 2018)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1501154656"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1501154652"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL760L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#302 in Books (See Top 100 in Books) #23 in Family Life Fiction (Books) #48 in Women's Domestic Life Fiction #128 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 101,801 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/ed7615e2-3986-44da-85b2-09f8313c7f91.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/55f10099-ed76-466b-b044-cef95683475b.__CR0,0,1080,1080_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/63c9b1dd-16d1-4f53-9b92-e937ba090c8b.__CR0,0,1080,1080_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/3e81781a-f784-45d8-93ad-b103480ff957.__CR0,0,1080,1080_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/5ef3a1c9-f32e-434b-9d64-27dc8b1b26a1.__CR0,0,1080,1080_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kat Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGIIAN4KSENOPYZL7NO74WZJ47FA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TEEVF4L19U6Q?ASIN=1501154656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A mother’s worst nightmare…",
                "reviewText": "I really liked this book! I am sitting here writing this with tears in my eyes, because the ending in the epilogue, I was hoping for that, and I’m glad Lisa gave it to us readers. As a mom this was a hard book to read, because it literally is a nightmare for me as a mom, your daughter who you love, suddenly disappears and there is no trace of her. For years, they tell you that she has probably run away, but you know that couldn’t be the case, there is something wrong. Years and years go by and as the rest of the world and your family move on, even your husband, but you still have a missing piece of your heart, questions left unanswered. I felt all the feelings that Laurel was having. Then when you least expect it, a man enters your life, with a beautiful daughter, and everything changes.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bonnie Gard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHY7O3IEFRTVQIG2UOEJYF4GLDMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE6PO8UEK9VT9?ASIN=1501154656",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars then she was gone - great book",
                "reviewText": "Then she was gone is a great book. The only part I disliked was it was a little long in a few of the chapters with filler that didn’t need to be there,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LilyLily",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7S7DFKONPTSQVBILDPUHCXL6MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IUU55H0M26YD?ASIN=1501154656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Slow burn at first but brilliantly bizarre thriller",
                "reviewText": "Ellie, the youngest of three, disappeared when she was fifteen. Ten years later, her mother, Laurel Mack, who‘s still struggling to put her life back together, is caught by surprise when she meets a charming guy, Floyd Dunn. Before long, she meets his children. Poppy, the youngest, looks like the spitting image of her lost Ellie. Now her determination to find out what happened to her youngest reignites. The question is, what will Laurel find out?THEN SHE WAS GONE is brilliantly bizarre. It has the dark and eerie characteristic of thrillers as well as redemption and well-captured relationship complexities all wrapped into one story.The first half was more of a slow burn. But then, I couldn’t put the novel down until I finished. I had to figure out all that was going on and how things would end. I was not disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71aK6dl-vkL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Stephens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6R4YTUPT7ZITLQNMZKIGRPYA7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HFKBTRSZR4T0?ASIN=1501154656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars ⭐️⭐️⭐️⭐️⭐️",
                "reviewText": "This book hooked me from the beginning. I thought I knew where it was going, but I only guessed a part of it. It was devastatingly sad, yet healing at the same time. It came full circle at the end and left you satisfied when finished.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFKHTXXGX3QA3ZNTVZPBDM3VP23Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X86EKB6982ET?ASIN=1501154656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Hard to put down",
                "reviewText": "Do not start reading this book if you are busy and have things to accomplish. This book was so good that I did not want to put it down. It took me a few days to finish it because of work and other responsibilities. This would be a great book to read while relaxing on vacation.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly M. Benn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSR462UVIXYRG3U5LA63YY6BEAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38TEOJVXSI7NT?ASIN=1501154656",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars Captivating read",
                "reviewText": "Don't read the full synopsis. I read something that gave away a piece that had I not known before starting would have made this an excellent read. There were still some great plot twists. Good character development with the lead role. Easy read and I couldn't put it down. It was chosen for a book club.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaitlin Montgomery",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7FY7F4DGUWT65L3APXRZPWVJAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJULG4EDBMCQO?ASIN=1501154656",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "3.0 out of 5 stars ehh",
                "reviewText": "It took me several parts to get into this book! All the foreshadowing events are just kept me in it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGO6NDM3G2MGVOD4N5HZKRUAIW3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RX7M3TIX1EJKH?ASIN=1501154656",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Suspenseful story",
                "reviewText": "I enjoyed the way the characters were introduced. The story seemed to move slowly at the beginning but picked up. I am glad I bought the recorded version that I would listen to at night. It took a bit longer to complete. It helped this American with the British/Irish fiction story. There are definitely some cultural things that helped me by listening to the recorded version. The different accents made it so much more interesting, as well. The plot was twisty and I was not expecting where it ended up. A good story and I will definitely be looking forward to reading more by this author. Definitely will purchase the recorded version.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emily Shapka",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 28, 2023",
                "reviewTitle": "amazing",
                "reviewText": "Not only is it a captivating mystery, but I was crying by the end. I was beyond attached to the characters and invested in their lives. If you want a book that will take all your attention and then break your heart, this is the one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on October 1, 2021",
                "reviewTitle": "So much Interesting book",
                "reviewText": "This book catch up out attention from beginning to the end. Awesome. I was just wondering a different endpoint but that was a incredible experience to read this book",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jess.G",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "Brilliant writing and story. I often guess what is about to happen. I was hooked. This is the third Lisa Jewell book iv read and just can't put any of them down. I definitely recommend reading this along with her other books.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pelalith",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 5, 2024",
                "reviewTitle": "livraison rapide, livre interessant",
                "reviewText": "bien reçu. Très rapidement. Conforme à ma commande. Livre comandé pour mon fils de 14 ans qui s'ennuyait en classe: correspond à ses attentes",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Za dsanta",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on January 25, 2024",
                "reviewTitle": "absolutely amazing",
                "reviewText": "Beautifully writtenI could not t put the book downAbsolutely fabulous . It s about the love of a mother for her kids, the pain of losing a child, the surprises life can give you after an enormous tragedyWell recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.00",
                "sellerName": "charlestonsoon",
                "sellerRating": "4.5"
            }
        ]
    }
}