{
    "remaining_requests": 1081,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Breaking-Point-Pickett-Novel-Book/dp/B00BSLPZXC",
    "body": {
        "name": "Breaking Point: A Joe Pickett Novel Book 13",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Breaking-Point-Pickett-Novel-Book/dp/B00BSLPZXC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51heNk-4WAL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "C. J. Box",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=C.+J.+Box&search-alias=audible"
        },
        "brand": "C. J. Box&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 10048,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The recipient of Edgar, Anthony, and Macavity Awards, New York Times best-selling author C. J. Box has won almost every honor in his field. In Breaking Point, Wyoming game warden Joe Pickett is glad to catch up with old friend Lyle Pendergast, but then the man goes missing and is named a suspect in the death of two EPA employees. All signs point to Lyle’s guilt, but the more Joe digs into the case, the more he realizes he’s stepped into the middle of a deadly power play. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 37 minutes"
            },
            {
                "name": "Author",
                "value": "C. J. Box"
            },
            {
                "name": "Narrator",
                "value": "David Chandler"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 12, 2013"
            },
            {
                "name": "Publisher",
                "value": "Recorded Books"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00BSLPZXC"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,730 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #236 in Crime Fiction (Audible Books & Originals) #322 in Mysteries (Audible Books & Originals) #523 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Roger Gold",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7QIGENGLJRX6Y5VO56CQ6EXQUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R133X7808ZWJ9Y?ASIN=B00BSLPZXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Box yet",
                "reviewText": "I enjoyed the concept of bringing back many of the characters we meet in earlier stories and expanding on their personalities .The story lines were well developed and held the readers interests. The theme of the novel was something most of the followers have concerns about in our own lives. The outcomes of the stories were unique and followed C. j. ,s abilities to hold my interests to the very last pages.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shari Ring Wolf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2Q2F6OW26NVDDF6EIQR2WO7NHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NCRJZE74Z2S8?ASIN=B00BSLPZXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2023",
                "reviewTitle": "5.0 out of 5 stars He’s back",
                "reviewText": "Thank goodness. I was unable to read the book prior to this one in the series. I usually listen to CJ Box’s Joe Pickett books on my 3X per week drives, and if I’m really into the story I get the text version, as well. I could NOT get into that last one, so I just stopped listening to the series for a time. Then I decided to trust the “stand alone” promise given for this series and just move on.I’m glad I did. I have no idea how the old sheriff was ousted and a paraplegic Reed took his place, but it isn’t real important, at least not yet. I almost immediately got into the story, read it when I wasn’t listening, and finished off the book faster than I wanted to, really. Now I have to purchase another book for my travels. Already. Before my next Audible credit.It was obvious this book was loosely based on a true story from the headlines involving the EPA. I looked it up online when [the Sackett case] was first mentioned in the book. It made the story more depressing; it brought on feelings of powerlessness and fear for me. It reminded me that this stuff really does happen in these United States I live in. I had to remind myself that the violent consequences suffered in this book were fiction.Of course those consequences included the most daring adventures amidst the beautiful forests, streams, and mountains of Wyoming! Yes, Joe survives again, but how? *smiles* I’ve come to expect all that and I would be crestfallen if it wasn’t there. Again, the story includes death scenes so vivid and repugnant that someone throws up, but at least it wasn’t Joe this time, haha. And, for ' monce the Pickett family did not have a spaghetti dinner…but there was no family dinner scene at all this time. The family, which is probably my favorite sub-part of the series, was not featured prominently IMO. Nate doesn’t really show up til the end.Hope I’m not giving up spoilers here!I could say what the plot is, but you’ve probably already read it in the synopsis. So I will just say that I enjoyed reading and listening to the story. I love that the same narrator is used each book. I’ve come to recognize the voices of Joe, McClanahan, Nate, and some of the others that the narrator uses consistently across the series. In this book it’s pointed out that our Joe seems to be aging some, but the description of MaryBeth remains the same: tall, blonde, fit, and green-eyed. Smart. Killer at researching the Internet for information!Now…Time to go find me some more Joe Pickett.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEMRVLS746GN23TBNQGRKQDREMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RU0WLBS1CUZ5?ASIN=B00BSLPZXC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Joe Picket",
                "reviewText": "...does good again. A real mystery about the EPA and local friends ofthe Pickets. Lots of crazy and wild action in the mountain wilds.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrew C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENSUCQ2DMXTZENRPBMK6HLVAGDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KIHZ2AMKJ3GV?ASIN=B00BSLPZXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Pickett is the Best!",
                "reviewText": "This could very well be my favorite series. Pickett and Box ate the best. This book is everything that is good about how Box writes. His characters, his plot, the twists in the story, and just as important, how he writes about nature....incorporating it into his story. The Scary thing is that I could see this really happening. Abuse of power and government bureaucracy are definitely a realistic premise, so this book just hit all the right notes. Joe and Mary Beth are amazing together as always. Enjoy this read, its one of the best in the series. Simply riveting!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ann M Gourley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF7Y47CQW7RMAYRT66Q6HO337CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2WC65TFTTF7L3?ASIN=B00BSLPZXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "5.0 out of 5 stars great",
                "reviewText": "I love all the C.J. Box books. I’m not crazy about the samples because They leave you hanging but great books all around",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "the Butch Bell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCBF46UJ6DSGJOLS3O3EEZGZJEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XVGL30DGRPHZ?ASIN=B00BSLPZXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 20, 2023",
                "reviewTitle": "5.0 out of 5 stars Another Winner for C. J. Box",
                "reviewText": "The books in this series just keep getting better. Unrelenting action from the first chapter keeps you reading and makes it real hard to put down. Joe Pickett and his family are just as you expect if you have been reading this series. The story line is new as always with a special twist at the end.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLNSQXVUJESI6TQKC6A3SJS362A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NEYISDHRPOC1?ASIN=B00BSLPZXC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 23, 2023",
                "reviewTitle": "5.0 out of 5 stars The series contiues",
                "reviewText": "The characters grow and you feel you are there with them. Great series and great supporting cast. You have to keep up with the details because what goes on before comes back relevant later on.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Yvonne Jocks",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENG5TG6GY7C6M23VMUTNBZUIM3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PB9XV6W6JNKR?ASIN=B00BSLPZXC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 22, 2023",
                "reviewTitle": "4.0 out of 5 stars Great Action & Mystery -- Increasingly Preachy",
                "reviewText": "The fact that I'm still giving this 4 of 5 stars, despite STRONG personal issues with its politics, tells you just how good the mystery and the adventure parts of this story are. If you like the Joe Pickett series, you'll probably love this one. I did not figure this mystery out until the end. The entire last third of the book was a symphony of suspense and imagery that takes you right into the Bighorn Mountains with all nature's amoral beauty. The Pickett family remains a strong anchor for the adventure, and several enjoyable characters return.Just be forewarned, if you've been uncomfortable with bits of anti-government subtext in the series--this book takes those politics from subtext to full out text. All government employees (except game wardens and one FBI guy) don't understand real America, earn incredible money, don't much care about the world and have a guaranteed job for life. In the CJ Box world, Feds are as immoral as the fat characters tend to be. There's a lot of hyperbole about people's lives being \"destroyed\" not by illness or homelessness or natural disaster or losing a loved one to murder, but by being told they will owe government fines they can't possibly pay (and it is not the system, but blatant MISUSE of the system, the kind that in real life goes to court). Reading on Kindle, I ended up using the \"Note\" feature just to argue back. A lot. (Such as: One could argue that the government doesn't destroy lives, but only certain bad actors WITHIN the government destroy lives.)Still, I'm going to try the next book in the series to see if the brilliance of the story, as with this one, washes away the bitter taste of the politics.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard Lamanque",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2021",
                "reviewTitle": "Joe Pickett series 👍",
                "reviewText": "Was a big Lee Child Jack Ryan fan. Now Joe Pickett has taken over. A super suspense read. Suggest start from the first and go on. You won't regret it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "froggy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on September 1, 2023",
                "reviewTitle": "Great book.",
                "reviewText": "A true escapism to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GelS",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 16, 2013",
                "reviewTitle": "Classic Joe",
                "reviewText": "I've read one Joe Pickett novel, in[loaned] paperback form, so seeing a new one on Kindle at an attractive price meant a very quick decision to click the order button and download it. Just finished yesterday, this proved to be a wise investment.For the uninitiated, Joe Pickett is a game warden in Wyoming who has a very firm sense of right and wrong that sometimes puts him at odds with the deskbound bureaucrats (Joe loves the outdoors aspect of his job). In this book two Environmental Protection Agency (EPA) agents are shot while delivering a notice to a local man clearing his land to build a home for his family. Assumed guilty without a trial, the man heads for the hills he loves and a huge, EPA-led, manhunt ensues. Joe senses something essentially wrong in the whole affair but is unable to escape involvement, with individuals vying for position and power instead of justice. The truth of the matter gradually unfurls, but not before events escalate alarmingly to a really shocking, satisfying conclusion, preceded by a roller-coaster sequence of events and excitement as nature shows her raw power. Even more dreadful is the author's note that the basis of the plot is a true story of big-brother manipulation (though not in Wyoming). C.J. Box lives in Wyoming and his descriptive skills all but transport the reader to the mountains and forests. A wonderfully absorbing series to delight the cowboy in us all. For under £3.00, this is a gem that could be a great introduction to a new protagonist and an author's work worth exploring further.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauger Emmanuel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 25, 2013",
                "reviewTitle": "Superbe, comme d'habitude",
                "reviewText": "C J Box nous livre une nouvelle aventure de son héros préféré Joe Pickett et c'est encore une réussite. L'ensemble est en progrès à chaque nouvel épisode. On regrettera l'apparition soudaine et très brève d'un vieil ami de Joe Pickett, Nate Romanovski, surgit de nulle part pour qq pages seulement, et le sale boulot comme trop souvent dans la série.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. Mourey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 7, 2013",
                "reviewTitle": "I read them all !",
                "reviewText": "Joe Picket and his family became my friends. I began with the first crime novel and bought one after one, until I finished the last one in the series. I hope, there will still be an other one to follow! I can only recommend them as very well written, page turning adventures/crimes, where you in the same time learn a lot about the beautiful nature of the Big Horn Mountains and the animals living there!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}