{
    "remaining_requests": 1346,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Flicker-Dark-Novel-Stacy-Willingham/dp/1250803845",
    "body": {
        "name": "Flicker in the Dark",
        "price": "$11.39$11.39$10.59$10.59$11.39",
        "originalPrice": "$17.99",
        "rawPrice": 11.39,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Flicker-Dark-Novel-Stacy-Willingham/dp/1250803845",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Pfj0VRR8L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51HiZ-ujL3L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stacy Willingham",
            "link": "https://www.amazon.com/Stacy-Willingham/e/B092XW36G3/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by LKMZ and Fulfilled by Amazon.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 45761,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for A Flicker in the DarkGoodreads – One of the Readers’ Most Anticipated Mysteries of 2022 Nerd Daily – One of the Most Anticipated 2022 Book Releases Crime by the Book – One of the Most Anticipated Crime Books of Early 2022 SIBA – One of the ‘Read This Next!’ Picks of the Month Deep South Magazine – Fall/Winter Reading Lists \"Exceptionally smart, entertaining.... [Willingham's] denouement is both surprising and plausible.\" ―The Washington Post\"Beautifully written... a must read.\" ―Paste“Equal parts domestic suspense and hard-edged police procedural. . . Willingham pulls together a tight, involving plot with a solid psychological look at the effects of a horrid crime on the Davises, the victims’ families and the small community. . . The gripping A Flicker in the Dark sets a terrific course for the new year, shining a bright light on a new author to savor in Willingham.” ―Oline Cogdill, South Florida Sun Sentinel“Charleston author Stacy Willingham’s debut novel A Flicker in the Dark is collecting accolades for its lyrical prose and propulsive, deeply creepy story.” ―Augusta Chronicle “A book you won’t want to put down.” ―Red Carpet Crash“A Flicker in the Dark will have you sleeping with the lights on by the time you reach the end. . . Suspense climbs as the pages turn, you won’t be able to put this one down once you pick it up.” ―Daily Hive“A great addition to any mystery/psychological thriller collection, with an unforgettable character haunted by her past in an authentic Louisiana setting, which ups the creep factor.” ―Library Journal“Willingham skillfully intercuts Chloe’s anxious first-person narration in the present with flashbacks to her childhood, ratcheting up the tension. Atmospheric prose and abundant red herrings amplify the tale’s intensity. Willingham is a writer to watch.” ―Publishers Weekly“Willingham offers taut storytelling and a heroine with compelling vulnerability. This is a strong debut recommended for domestic-suspense readers lining up next-reads.” ―Booklist“I have not felt this excited about a thriller in years. I could not put this book down. It's fabulous.” ―Chelsea Cain\"Don't trust anyone in this wickedly good debut by Stacy Willingham. A twisty and propulsive thriller.\" ―Peter Swanson“A Flicker in the Dark is equal parts lush Southern Gothic, penetrating character study, family tragedy wrenching enough to bruise, taut psychological suspense, and―best of all―a mystery as profoundly satisfying as any I've read in years. Evocative and exhilarating.” ―A.J. Finn\"A psychological thriller in the truest sense -- an engaging, propulsive read, loaded with surprising twists, that genuinely thrills as it gets deep under the skin of its fascinating heroine, Chloe Davis. I tore through this book.\" ―Alison Gaylin\"Haunting, lyrical and utterly compelling! These are just a few of the words of praise one could use to describe A Flicker in the Dark. Author Willingham takes us on an unstoppable journey through the psychology of evil, and of courage (in many senses), all told in a pitch-perfect literary style. Once you start reading, you will not put it down.\" ―Jeffery Deaver About the Author STACY WILLINGHAM is the New York Times, USA Today and internationally bestselling author of A Flicker in the Dark, All the Dangerous Things and Only If You're Lucky. Her debut, A Flicker in the Dark, was a 2022 finalist for the Book of the Month's Book of the Year award, Goodreads Choice Best Debut award, Goodreads Choice Best Mystery & Thriller award, and ITW's Best First Novel award. Her work has been translated in more than thirty languages. Before turning to fiction, she was a copywriter and brand strategist for various marketing agencies. She earned her B.A. in magazine journalism from the University of Georgia and M.F.A. in writing from the Savannah College of Art and Design. She currently lives in Charleston, South Carolina, with her husband, Britt, and Labradoodle, Mako."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 42 mins",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest Same-Day pickup Today 10 AM - 3 PM. Order within 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A New York Times Bestseller“A smart, edge-of-your-seat story with plot twists you’ll never see coming. Stacy Willingham’s debut will keep you turning pages long past your bedtime.” ―Karin SlaughterWhen Chloe Davis was twelve, six teenage girls went missing in her small Louisiana town. By the end of the summer, her own father had confessed to the crimes and was put away for life, leaving Chloe and the rest of her family to grapple with the truth and try to move forward while dealing with the aftermath.Now twenty years later, Chloe is a psychologist in Baton Rouge and getting ready for her wedding. While she finally has a fragile grasp on the happiness she’s worked so hard to achieve, she sometimes feels as out of control of her own life as the troubled teens who are her patients. So when a local teenage girl goes missing, and then another, that terrifying summer comes crashing back. Is she paranoid, seeing parallels from her past that aren't actually there, or for the second time in her life, is Chloe about to unmask a killer?From debut author Stacy Willingham comes a masterfully done, lyrical thriller, certain to be the launch of an amazing career. A Flicker in the Dark is eerily compelling to the very last page.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Minotaur; Reprint edition (January 10, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 384 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250803845"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250803849"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.5 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.38 x 0.88 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#642 in Books (See Top 100 in Books) #40 in Serial Killer Thrillers #149 in Psychological Thrillers (Books) #218 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 45,761 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LizzyK2",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPCBNLBXZO4XYRBK5HKZ7SLD75Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PZXTC3MM896F?ASIN=1250803845",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars She got me...again",
                "reviewText": "So, I first read All the Dangerous Things, and I swear I thought up every possible scenario for what the outcome would be, and the actual outcome was none of them. I was thoroughly impressed, and that led me to read THIS book. I felt like I had the upper hand this time... Going into it knowing the reveal wasn't gonna be what I expected. So I started thinking of even crazier explanations and conclusions. Then I started doubting myself when things seemed to unfold in the most obvious way, only to realize I was duped once again, and my assumptions were wrong. I LOVE when the author can out-smart me, and Stacy Willingham has done it brilliantly, twice now. Kudos to her. She has my respect.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Colleen Noyes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFRY4IHKYY2R5U7SYKMJRYN523A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18NORAT9DMMR7?ASIN=1250803845",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars A Flicker in the Dark",
                "reviewText": "Chloe Davis has had a difficult life. Being the daughter of a man in prison for a series of murders has made her leery to trust. She was very close to her father and can’t believe that he is capable of taking so many lives. Having a difficult childhood where her and her brother are abandoned by her father who goes to jail, her mother who tried to take her own life and now is in a mental facility, and years of trauma she’s trying to rebuild her life. It’s been 20 years since the horrific events she endured in Louisiana but now it seems that things may be starting up again. She’s trying to find happiness with her fiancé Daniel however, her brother thinks that there is something off about him. Can Chloe really trust herself? Can she really trust believing in people given what was going on that she didn’t realize 20 years ago? Enter reporter Aaron Jansen who is poking around and now Chloe isn’t sure what is real and what is not. She’s a medical psychologist, but you soon find that she has all of these hidden issues, she’s just barely hanging on herself. What does she discover when she truly looks in the mirror and at her own life? I thought that the author did a very good job of making Chloe complicated and complex. There are so many layers to the character and so many things that you stop and wonder about and question. While I did figure out what was going on in one sense pretty early on there were some twists that I never saw coming. This was an excellent psychological thriller with incredible depth. This is the second book I’ve read by this author and I cannot wait to read her newest release.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Miss Nostagia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHAQOCKF6XO6MG42LKMAJBXR3P2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RP44QPWOMCV89?ASIN=1250803845",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Good, intense read with many twists",
                "reviewText": "This author captures your imagination and brings up so many possibilities…what if….Poor Dr. Chloe from childhood through teens and into adulthood she can’t shake her past, learn to trust, or stop trying to escape the nightmares ans memories of those missing girls and the role her family played in them….will she ever be “normal” again?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Simmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEIGIF4S2JHUH4IADMSPIIPQOPXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UZ2EL96WGIK9?ASIN=1250803845",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "3.0 out of 5 stars Well written, but contrived in places",
                "reviewText": "I wish I could give this book 5 stars, because I did think it was hard to put down. However, there were many plot twists, but they were far- fetched. SPOILER ALERT: How in the world could the mother suddenly come to life enough to be spelling out “Daniel?” How could she even know details about him? How could Chloe put herself in harm’s way so many times? How could she not have suspected her brother? Also, as far as I’m concerned, a final visit to her mom, and definitely one visit to her dad should have been a must.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MrsLeif",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFD5AHZ6V6TZ5AIY542YTX62QMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35K755Z6UXGB1?ASIN=1250803845",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2022",
                "reviewTitle": "4.0 out of 5 stars Another book that I connected with and I was unable to put down.",
                "reviewText": "I'm glad my luck is holding. Another book that I connected with and I was unable to put down.Chloe Davis is a psychologist in the present time. She is trying to help teenagers and their trauma. After all, she knows something about trauma. When she was twelve, she discovered her father was a serial killer and he went to jail for it but the bodies were never found. This impacted her life and her older brother's life too.Chloe is engaged to be married and she is thinking that life is finally giving her some happiness when a teenager goes missing and then another one after her. The situation seems too coincidental and it's eerie how much these cases have in common with what her dad confessed to. Is there a copycat? Does she know him? Is she close to him?Read it to find out.So what did I enjoy about A Flicker in the Dark?I did enjoy this unreliable narrator despite her addiction to pills (which is new for me since I hate when the female character is impaired and is not sure if things that are happening around her are true or she is just imagining it). I was reading and listening as fast as I could.Did I guess the plot?Yep, from the very beginning but despite that I was able to root for Chloe.Did I like the ending?I think it was fitting.Am I happy it will be a limited series on TV?I didn't know Emma Stone was interested in this novel before I read it but I'm glad this book will be coming to life on my TV.Cliffhanger: No4/5 FangsI'm glad my luck is holding. Another book that I connected with and I was unable to put down.Chloe Davis is a psychologist in the present time. She is trying to help teenagers and their trauma. After all, she knows something about trauma. When she was twelve, she discovered her father was a serial killer and he went to jail for it but the bodies were never found. This impacted her life and her older brother's life too.Chloe is engaged to be married and she is thinking that life is finally giving her some happiness when a teenager goes missing and then another one after her. The situation seems too coincidental and it's eerie how much these cases have in common with what her dad confessed to. Is there a copycat? Does she know him? Is she close to him?Read it to find out.So what did I enjoy about A Flicker in the Dark?I did enjoy this unreliable narrator despite her addiction to pills (which is new for me since I hate when the female character is impaired and is not sure if things that are happening around her are true or she is just imagining it). I was reading and listening as fast as I could.Did I guess the plot?Yep, from the very beginning but despite that I was able to root for Chloe.Did I like the ending?I think it was fitting.Am I happy it will be a limited series on TV?I didn't know Emma Stone was interested in this novel before I read it but I'm glad this book will be coming to life on my TV.Cliffhanger: No4/5 FangsI'm glad my luck is holding. Another book that I connected with and I was unable to put down.Chloe Davis is a psychologist in the present time. She is trying to help teenagers and their trauma. After all, she knows something about trauma. When she was twelve, she discovered her father was a serial killer and he went to jail for it but the bodies were never found. This impacted her life and her older brother's life too.Chloe is engaged to be married and she is thinking that life is finally giving her some happiness when a teenager goes missing and then another one after her. The situation seems too coincidental and it's eerie how much these cases have in common with what her dad confessed to. Is there a copycat? Does she know him? Is she close to him?Read it to find out.So what did I enjoy about A Flicker in the Dark?I did enjoy this unreliable narrator despite her addiction to pills (which is new for me since I hate when the female character is impaired and is not sure if things that are happening around her are true or she is just imagining it). I was reading and listening as fast as I could.Did I guess the plot?Yep, from the very beginning but despite that I was able to root for Chloe.Did I like the ending?I think it was fitting.Am I happy it will be a limited series on TV?I didn't know Emma Stone was interested in this novel before I read it but I'm glad this book will be coming to life on my TV.Cliffhanger: No4/5 Fangs",
                "reviewVotes": "58 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dana Croft",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQBPXKYKWEKLU7VATZMPSQE6LMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CAFJGC3PBPZU?ASIN=1250803845",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars dark then light",
                "reviewText": "The subject is hard to read….but in the end, light….captures you from the start bc it’s unbelievable, the pain and sadness….you cant put it down bc you just have hope it will be ok in the end",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JRR",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNNFOACGBNBSZ7QRPTDVUIYVG2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMHM3NX6Q7TF0?ASIN=1250803845",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "4.0 out of 5 stars A one sitting read with an excellent twist",
                "reviewText": "A book that’s excellent in parts, although our main character, Chloe, a hypervigilant woman with skills in psychology, comes across as surprisingly dense with any of the men in her life. Why does she think her fiancé has her best interests at heart? He’s a jerk. As a reader, the question for me, was whether her insensitive fiancé’s behaviour was a bunch of red herrings for the reader to get lost in, or is he in fact a copycat killer? What about her brother, or the reporter, or the cops?A satisfying read, with a nicely plotted twist. Unfortunately for me, I saw the twist right from the start, but kept on reading to find out if that’s how the story panned out. Definitely worth reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isabella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 24, 2023",
                "reviewTitle": "Wonderful",
                "reviewText": "I loved the plot and the characters. A really page-turner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ange",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 31, 2023",
                "reviewTitle": "Good read",
                "reviewText": "Book arrived in perfect condition and was delivered quickly.The novel itself is really good. Fast paced with twist and turns along the way. Anyway who enjoys murder mysteries will enjoy this",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christian Berner",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 27, 2023",
                "reviewTitle": "A must read for all fans of thrillers",
                "reviewText": "This thriller is sure to be a never-ending read for you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "livia sbarbaro.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on April 6, 2023",
                "reviewTitle": "Absolutely Gripping...",
                "reviewText": "Chloe Davis grew up in the swamp lands in Beaux Bridge ..In the long hot summer of 1999, when Chloe was twelve years old ..six little girls go missing ..and Chloe's father is incarcerated and put away .As the people of Beaux Bridge try to cope with the aftermath, Chloe and her brother Cooper's life is changed forever ..Now, twenty years later on the Anniversary of the girls going missing ..another young girl has disappeared, and for Chloe , now a psychologist, who is getting ready to marry the man of her dreams ..it brings back the nightmares all over again .For Chloe in her sleep she has nightmares, awake she has such thoughts..not sure of which is worse. Could there be a copy cat killer at work here? So much misdirection...never knowing who to trust ...What evil forces are at work here ? To the lady in Waterstones, Princes Street , Edinburgh...who told me this was their book of the week ..and to trust her ..its brilliant...you were right ..A Flicker in The Dark is most definitely my kind of Phychological thriller...that kept me right on the very edge of my seat...all the way through...5 Stars Gripping...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 3, 2022",
                "reviewTitle": "Awesome twist",
                "reviewText": "This book is a must read for all the thriller lovers. The plot is perfect and 5 stars for story telling and twists. The book stayed on my mind long after finishing as well",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}