{
    "remaining_requests": 1191,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Moscow-X-Novel-David-McCloskey-ebook/dp/B0BWLJ4K63",
    "body": {
        "name": "Moscow X: A Novel",
        "price": "$9.66",
        "originalPrice": "",
        "rawPrice": 9.66,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Moscow-X-Novel-David-McCloskey-ebook/dp/B0BWLJ4K63",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/8138gz82+lL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "David McCloskey",
            "link": "https://www.amazon.com/David-McCloskey/e/B094RGDC82/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 1680,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A daring CIA operation threatens chaos in the Kremlin. But can Langley trust the Russian at its center?CIA officers Sia and Max enter Russia under commercial cover to recruit Vladimir Putin’s moneyman. Sia works for a London law firm that conceals the wealth of the superrich. Max’s family business in Mexico—a CIA front since the 1960s—is a farm that breeds high-end racehorses. They pose as a couple to target Vadim, Putin’s private banker, and his wife, Anna, who—unbeknownst to CIA—is a Russian intelligence officer under deep cover at the bank. As they descend further into a Russian world dripping with luxury and rife with gangland violence, Sia and Max’s only hope may be Anna, who is playing a game of her own. Careening between the horse ranch in northern Mexico, the corridors of Langley, and the dark opulence of Putin’s Russia, Moscow X is both a gripping thriller of modern espionage and a raw, unsparing commentary on the nature of truth, loyalty, and vengeance amid the shadow war between the United States and Russia.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BWLJ4K63"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ W. W. Norton & Company (October 3, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 3, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3156 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 460 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#16,606 in Kindle Store (See Top 100 in Kindle Store) #14 in Political Fiction (Kindle Store) #41 in Political Fiction (Books) #108 in Political Thrillers & Suspense"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 1,680 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Damascus Station: A Novel Moscow X: A Novel Also by David McCloskey A CIA officer and his recruit arrive in war-ravaged Damascus to hunt for a killer. A daring CIA operation threatens chaos in the Kremlin. But can Langley trust the Russian at its center? \"I could not put down McCloskey’s gripping spy novel Damascus Station.…A must-read for anyone interested in Syria or espionage.\" ―Clarissa Ward, CNN chief international correspondent \"With chilling Cold War era intrigue set against a fantastic modern plot, Moscow X is a jaw-dropper from start to finish. David McCloskey is the new John le Carré.\" ―Brad Thor, #1 New York Times best-selling author of Dead Fall",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bc5966f9-6848-4d3a-b530-63cec81239e7.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f0eee313-bd46-40ba-a43a-5711e97e1581.__CR0,1,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/20966e21-66f8-4399-8f20-ecd82e546e76.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c406008-9e6f-45b5-9a67-15819a329bd1.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4a2ff55b-fc74-4e1d-85d2-04de9ce4972c.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ffc4c01e-709e-40fb-a4fc-5bc889546440.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/30bd906c-446c-4f56-a315-10f8e2527de9.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Steven Christensen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBLKOEBM3DMXFIDX44MNTZEONOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2N4DB2AG276CB?ASIN=B0BWLJ4K63",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars A Cerebral Chess Match!",
                "reviewText": "If you are looking for a high octane action spy thriller this book is not for you. If you are looking for an extremely well written, albeit sometimes tedious cerebral read you will like this fine novel. I like it but it does require the readers attention to catch all the subtle nuances.This is a story of two women.....are they cohorts or enemies? There is Sia, a CIA agent working as a lawyer at a bank in London that specializes in moving Russia's (Putins) money out of of Russia. There is Anna, A SVR secret agent married to the man responsible for moving the funds out of Russia who she hates. The two women first meet at an arranged horse ranch in Mexico where her husband wishes to purchases a stud stallion from Max the wealthy rancher.The tale moves onto Russia as Sia and Max are invited to visit the the Russians. So begins the story of the two women trying to use each other for different reasons, Sia to tap into Putin's money and steal it while Anna wants only recover millions in gold stolen from her imprisoned father and destroy her husband with bitter revenge. The interplay between the two women is fascinating as each tries to gain the advantage in this cerebral chess match of two minds. From the previous book Proctor is once again the manipulator behind the scenes but her role is almost comical and does not fit well in the story. This book is highly recommended as is Damascus Station, the author's debut novel that is perhaps even better than this one.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mjr",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFO6ZRSPPQS2UZRTZUZ3R4COKDCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CYK8LVYNV9O4?ASIN=B0BWLJ4K63",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Kept Me Entertained",
                "reviewText": "Was a solid spy thriller. Nothing really great or really bad.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUFRS767AIMCCOJULE3E3M252AA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27T40FBXX1PN0?ASIN=B0BWLJ4K63",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "5.0 out of 5 stars Simply X-cellent",
                "reviewText": "MOSCOW X by David McCloskeyEvery so often, an author comes alone who sparks a flame… creates something new in their genre that will be read long after they are gone. In the cannon of espionage, these include John le Carré, Graham Greene, Jason Matthews, Olen Steinhauer… the list is finite. Those who speak truth to the craft. Two years ago, David McCloskey secured his place with his debut, DAMASCUS STATION. With MOSCOW X, he reaffirms his skill and place among those giants.I’ve often said, there is something truly special about a novel written by a former practitioner, and with regard to McCloskey, he defines this. His writing is sublime. The tail he spins is more than readable, but simply addictive. He nails the details in a way that reveals the clandestine world to those outside, and honors those that practice the secret craft. MOSCOW X is the stuff of an operations officers’ dreams and nightmares, heady as they might be. McCloskey is the poet laureate of the clandestine world.McCloskey’s characters – protagonists and antagonists – are richly layered and genuine. The operation, breathtakingly audacious, the sort of thing I wish our leaders would give consideration. The narrative, with all it’s twists and turns, is all too believable. If you ever wondered what it would take to exfiltrate an officer from Russia… read this book. I cringed as my cortisol soared reading that segment.Simply excellent. I can’t wait for THE SEVENTH FLOOR.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SF One Zero",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2322RIHGZ5TJP6K2TBJY6UGNYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12OSCONRZU8N6?ASIN=B0BWLJ4K63",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "5.0 out of 5 stars An espionage thriller of the best caliber!",
                "reviewText": "Second novels always come with a high price tag: the publisher’s requirements and reader’s expectations are all waiting to ambush the writer’s hopes.David McCloskey succeeds with Moscow X. At once similar and yet different than Damascus Station, in this novel he returns Artemis Proctor — the first chapter’s explanation of why she now sits in the penalty box is worth reading alone — and dispatches two CIA non-official cover officers on a dangerous journey to subvert the powerful moneyman of the Russian President.It is a tale of cross and double-cross told in the best traditions of espionage thrillers of a dizzyingly complex operation that is all too real in his description.McCloskey’s characters are human—nuanced with traits the reader can love or hate—the quandaries they face and the painful decisions they must make bring great depth to the story. As a former CIA officer, the tradecraft he infuses into the story is genuinely accurate and the 7th Floor’s bureaucracy maddeningly real. A tale tightly woven with intermittent bursts of energy and calm until the final drive which takes the story on an breathless downhill race to a finish that leaves openings to continue the story.This book is superb, better in my opinion than Damascus Station, and fully establishes David in the Pantheon of the best spy writers.”",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Landsurveyor",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJH6E5BTLQIXJZV2JK45MXZ5RQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20RN60S2ULEEC?ASIN=B0BWLJ4K63",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars love the spinning of spycraft.",
                "reviewText": "Loved the way story weaved together. The characters were excellent. Entertaining until the very end. Happy to hear it is part of a trilogy: looking forward to the next one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leah Tchack",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR6HR44LR5YPVTSOEEDZNI3ZWYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3VYZ1MYQYD8UT?ASIN=B0BWLJ4K63",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "4.0 out of 5 stars Should be better",
                "reviewText": "McCloskey is not yet the new LeCarre, although he might move up to that level. What he desperately needs is a new editor!! I have read both of his latest with some enjoyment and admiration, but the editing is sadly lacking. Clunky phrases everywhere, sometimes not comprehensible, even by a careful reader. And there are outright mistakes: a broodmare is said in the book to be \"out of\" her sire and a mare. Everybody knows that a horse is \"out of\" her dam (mare, mother) and \"by\" her sire. Overall, there's a good spy novel buried in there among the confusing and disorderly writing, and that's why we have editors.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Craig Stephans",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKADS7LVZVUGZWPOYIDMZMNPJRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5ITTOEUJWD0J?ASIN=B0BWLJ4K63",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Smartly Written Spy Novel",
                "reviewText": "Moscow X is a complex tale of spycraft between the CIA and Russian agents that occurs in the US, Mexico, Russia and London. The story has many twists and turns and at times frustratingly slows to develop the complexities of the plot that involves financial maneuvers involving cryptocurrency and exchanges. The novel indicates deep knowledge of the dynamics involved in the conflicts between East and West that never make the news. Ultimately, Moscow X turns into a compelling and thrilling read that covers its mysteries until the climactic conclusions. I will look forward the next in the series having enjoyed this one along with Damascus Station.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr Mervyn Eastman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "Books 1 & 2",
                "reviewText": "Having read both these offerings back to back from David McCloskey, & avoiding any spoilers, (clearly in the mood for Spy thrillers) I have no hesitation in giving a five 🌟 rating to both. With regard to Damascus Stn, I found an intelligent, well informed setting, & not surprisingly, given the authors career background, insight into the corporate & individual protagonists mindset, organisational culture of a State Agency of dubious reputation (CIA).Characters in the main well crafted & captivating. My only reservation and common in this garndra, the romantic development, contrived, inevitable & on occasions , silly. Be that as it may, the plot, story telling, grit & pace is highly captivating.The second book, Moscow X, whilst not following Sam Joseph of the first, I found better, but that may be because of the Putin factor. I loved the female & unique lead of the lead character most quirky & entertaining. Great read, & looking forward to more from this author developing a reputation of the likes of Tom Clancy!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 18, 2024",
                "reviewTitle": "Over-priced disappointment",
                "reviewText": "Is this the same McCloskey that wrote Damascus Station, which was concise and paced without getting lost in immaterial details? What a letdown after so much expectation. The first few chapters of Moscow X are promising, but then descent into a very long preamble of over 150 pages to set the scene. Interesting maybe for horse trade lovers. It does not improve when one progresses further in the book and for me reading became a tedium which I could not finish, so half way through the book I chucked it, figuratively. McCloskey lost himself and struggled to get an interesting story together, which is a shame as Damascus Station was brilliant as a spy thriller in a lot of respects, Moscow X is an over-priced disappointment. The next scheduled installment in this series for release in 2025 is even priced 10% higher and based on current performance it is better off to be scrapped, at least I will not buy it unless severely discounted.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Price",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 1, 2024",
                "reviewTitle": "good but almost like a different writer",
                "reviewText": "So strange after his first book ,it felt like this was a different writer. Long clunky sentences , some totally unintelligible and poor use of English. You could see similar styles and plot development but that is where the similarities to the first book ended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pippa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 11, 2024",
                "reviewTitle": "Excellent",
                "reviewText": "Very tense, a great thriller. I just wish he didn't use \"atop\" in every other chapter. Lazy, and cringey. Boo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Julie Johnson-begg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on November 6, 2023",
                "reviewTitle": "Missing the Excitement of debut novel",
                "reviewText": "Damascus Station was an impressive suspenseful read. Absolutely one of the best. However this follow up was painful the read, wordy uninteresting plot at one point I did not think I would be bothered finishing it. The multiple characters lacked the vibrancy of those from the debut novel, the plot was too long missing any thread of suspense or anticipation.Sorry David this was below par.It was reminiscent of the classic Russian novels in format and content.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}