{
    "remaining_requests": 1258,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Holly/dp/B0BSXS2WNR",
    "body": {
        "name": "Holly",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Holly/dp/B0BSXS2WNR",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51J9mQz4SrL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephen King",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Stephen+King"
        },
        "brand": "Stephen King",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 27013,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Holly Gibney, one of Stephen King’s most compelling and ingeniously resourceful characters, returns in this thrilling novel to solve the gruesome truth behind multiple disappearances in a midwestern town.“Sometimes the universe throws you a rope.” —BILL HODGES Stephen King’s Holly marks the triumphant return of beloved King character Holly Gibney. Audiences have witnessed Holly’s gradual transformation from a shy (but also brave and ethical) recluse in Mr. Mercedes to Bill Hodges’s partner in Finders Keepers to a full-fledged, smart, and occasionally tough private detective in The Outsider. In King’s new novel, Holly is on her own, and up against a pair of unimaginably depraved and brilliantly disguised adversaries. When Penny Dahl calls the Finders Keepers detective agency hoping for help locating her missing daughter, Holly is reluctant to accept the case. Her partner, Pete, has Covid. Her (very complicated) mother has just died. And Holly is meant to be on leave. But something in Penny Dahl’s desperate voice makes it impossible for Holly to turn her down. Mere blocks from where Bonnie Dahl disappeared live Professors Rodney and Emily Harris. They are the picture of bourgeois respectability: married octogenarians, devoted to each other, and semi-retired lifelong academics. But they are harboring an unholy secret in the basement of their well-kept, book-lined home, one that may be related to Bonnie’s disappearance. And it will prove nearly impossible to discover what they are up to: they are savvy, they are patient, and they are ruthless. Holly must summon all her formidable talents to outthink and outmaneuver the shockingly twisted professors in this chilling new masterwork from Stephen King.“I could never let Holly Gibney go. She was supposed to be a walk-on character in Mr. Mercedes and she just kind of stole the book and stole my heart. Holly is all her.” —STEPHEN KING Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 24 minutes"
            },
            {
                "name": "Author",
                "value": "Stephen King"
            },
            {
                "name": "Narrator",
                "value": "Stephen King, Justine Lupe"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 05, 2023"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BSXS2WNR"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#159 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #4 in Horror Fiction #13 in Horror Literature & Fiction #15 in Psychological Thrillers (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jefferson House",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUUJ4WKUJB3ZCPWBSVQLBUEEPYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1T2NVRO7HNHR5?ASIN=B0BSXS2WNR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 20, 2024",
                "reviewTitle": "5.0 out of 5 stars Tense and taut crime thriller from the modern master of the macabre",
                "reviewText": "Holly is a tense and taut crime thriller, with a strong horror edge that one would expect from the modern master of the macabre. It features Holly Gibney, and her supporting character, as established in King’s previous outings in this universe, including the Bill Hodges series, and Outsider. Mr. King utilizes the tropes and tactics of a suspense crime thriller to great effect, including withholding information from certain characters, while revealing that information to others (and the readers), giving our protagonist some flaws, as well as some sympathetic traits to the villains (though not many), and of course, the breakneck escalating pacing King is famous for. These elements combined provide for a quick, brutal, yet somehow enduring crime tale set in a very modern, very real (uncomfortably so, for some) world, which should not be ignored. This reality and topicality has been a sticking point for some readers, and there’s no ignoring that. The Covid pandemic, the Trump Presidency, and Black Lives Matter protests are all mentioned here, but this story isn’t ABOUT any of those things; in any other regard than how they impact the plot, and how they relate to one of the books themes, in fear of mortality, fear in general, the power of belief, and how that belief, or reality we choose to subscribe to, impacts our actions. That said, a novel or other fictional work was bound to feature these real-world events at some point. My opinion is such that those who avoid a fictional work because they don’t agree with the author’s perceived stance reveal more about themselves than they do about the author or their work.That said, I myself bring my own expectations and bias to the book, as any reader does. Spoiler here, but my mother died, just as Holly’s did in the book. Similar circumstances and even time frame as depicted. I have always been interested in poetry as another character depicted, and my wife is an avid knitter and crocheter, as depicted by a minor character. I’m sure that these similarities influence my interpretation of the work, and possibly enhance or detract from my enjoyment of such. I will say that I found myself engaging with the text quite a bit, rereading previous passages to gain insight, looking up foreign words and phrases, or even words or people that were unfamiliar to me. One does not do that unless they are invested.Ultimately, if Holly is considered polarizing, it is only because it was written and set during a polarizing time. Unlike some authors, King does not flinch away from some of the darker aspects of society (would you really expect the creator of Pennywise, Carrie, Christine and Cujo to do so?), but gives us his own frank take on real world events, as context for a lean and compelling crime tale, with believable and relatable characters, and horrifying human villains. If you’re a supporter of a certain former president or a denier of a recent global pandemic, you may be (pardon the modern vernacular)”triggered” by some of the minor depictions, plot points, etc. found here. If, however, you are one of Mr. King’s “constant readers” and especially if you’ve enjoyed some of his recent crime and suspense novels. You will most certainly enjoy Holly’s self-titled case. 5/5 red balloons.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary C.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFROM6CJTC5I2TDH72BG5LYNVQDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R38D0TLRZHAGQC?ASIN=B0BSXS2WNR",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Fast-paced Thriller",
                "reviewText": "I haven’t read any Stephen King in quite awhile, so I didn’t realize that the main character in this book, Holly Gibney, had been a character in many of King’s other books. Although references were made to those earlier books, it wasn’t necessary to have read them to be able to follow this.I was a little hesitant to continue after the first section about Jorge Castro ended and the POV switched to Holly. I didn’t know what the book was about, and at that point, I thought it was going to be a lot of claustrophobic horror, like Gerald’s Game or Misery. I did pick it up again, and while some parts of the book were horrific, it really was more along the lines of a thriller than a horror novel.Some reviewers have commented about the book being too political and unnecessarily focused on COVID. I’ll admit that I did stop at one point, early on, to see if any other readers had commented on the numerous mentions of an actual (former) president because it seemed so intrusive. Once the pace of the book picked up, however, I didn’t notice the political commentary, and the continual references to COVID didn’t bother me, especially as they were often used for characterization purposes.All in all, a good story that made me want to go back and read the Bill Hodges trilogy.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike Keller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPAKMK6GHYWGUGSPQTTVLNID2JQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TJHGAC7AGMXO?ASIN=B0BSXS2WNR",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "5.0 out of 5 stars As Covid-19 locks down the world, another killer stalks Holly's neighborhood.",
                "reviewText": "It's early autumn of 2012 and Jorge Castro is taking his nightly run down Ridge Road to the Deerfield Park. Jorge is a 40 year old teacher of creative writing and Latin American literature at the Bell College of Arts and Sciences. Tonight's run is interrupted when he spots an elderly couple trying to get a wheelchair up the ramp into their disability modified van. As he's pushing the heavy chair up into the van, there's a sharp sting in his neck. When he awakes he's in a sturdy cage still suffering the effects of whatever he was injected with and intolerably thirsty. He fades out, awakens a couple more times before the drug wears off. Professor Emily Harris gingerly walks down the stairs bringing a tray with a bottle of water, a cup with a package stuffed in it and a hunk of raw meat. She sets the tray on the floor and uses a broom to push the tray through a small covered doorway at the bottom of the door. Turning to leave, she tells Jorge to eat it all. Eventually, thirst and hunger win and he forces himself to nibble at the liver, finally to finish it and drink the bloody drippings from the tray.It's July 2021. Holly Gibney and her partner Pete Huntley own Finders Keepers, a private investigation agency. Pete's at home suffering from Covid 19. He's double vaxxed, but the Delta variant doesn't care. He has a mild case, but it's keeping him quarantined nevertheless. Even though the office is technically closed by the Covid shutdown, Holly listens to a distraught mother whose daughter, Bonnie Dahl, has been missing. Bonnie's bicycle had been found near Deerfield Park with a note pinned to the seat reading \"I've had enough\". Against her better judgement, she takes the case unaware that this investigation will nearly end her life in a cage in a basement with a tray of raw liver and a bottle of water.For Stephen King, this story is a bit milder than usual, but still a good read! As usual, his characters are lively and well defined. The story builds to an epic conclusion and doesn't slip from the horror along the way.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Claudia Sanchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 3, 2024",
                "reviewTitle": "Lo que se espera de King",
                "reviewText": "Una historia que te atrapa. Es extenso, como sabemos el señor King no sabe lo que es el resúmen, pero tiene justificada la longitud del libro.Me encantó.Y como un extra, la portada del libro pasta dura (la que cubre) brilla en la oscuridad y me pegó un susto una noche que entré a mi recamara a oscuras y de la nada vi esas palabras brillando “HOLLY, STEPHEN KING”",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah Jane Clark Sarah Jane Clark ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 7, 2024",
                "reviewTitle": "A haunting and immersive tale that delves into the depths of human nature and the unthinkable.",
                "reviewText": "The story follows protagonist Holly Gibney as she uncovers a series of chilling mysterious disappearances that threaten to unravel her sanity.King's mastery of the horror genre is on full display in \"Holly.\" From the very first page, he draws readers into a world filled with dread and unease, where nothing is as it seems. The atmosphere is palpable, with every shadow and whisper contributing to the sense of impending doom.At the heart of the novel is Holly herself, a complex and compelling character who struggles with her own demons as she confronts the darkness lurking in town. King's portrayal of Holly is both empathetic and chilling, making her journey all the more riveting.What sets \"Holly\" apart is its exploration of themes such as grief, trauma, and the power of belief. Through Holly's eyes, King examines the human psyche and the lengths to which people will go to confront their fears.In typical King fashion, the plot is full of twists and turns that will keep readers guessing until the very end. With its richly drawn characters and spine-tingling suspense, \"Holly\" is a must-read for fans of horror and psychological thrillers alike. Stephen King once again proves why he is the master of the genre with this gripping and unforgettable novel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/717do8kT4uL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "mariella galea",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 27, 2024",
                "reviewTitle": "\"Holly\" - A Riveting Tale of Suspense with Masterful Pacing by Stephen King",
                "reviewText": "Stephen King's \"Holly\" is a literary gem that masterfully weaves suspense into its narrative, keeping readers on the edge of their seats from start to finish. This novella not only showcases King's storytelling prowess but also exhibits a remarkable sense of pacing that contributes to the overall gripping experience.The suspense in \"Holly\" is palpable from the very beginning, drawing readers into a world of mystery and intrigue. King skillfully introduces and develops characters, gradually unraveling a plot that is as enigmatic as it is captivating. The air of tension is maintained throughout, creating a sense of anticipation that makes it difficult to put the book down.What sets \"Holly\" apart is its exceptional pacing. The narrative unfolds with a rhythmic cadence, carefully dosing out revelations and twists at just the right moments. The story progresses seamlessly, and each chapter leaves you hungry for more. King's ability to maintain this pace without sacrificing depth or nuance is a testament to his mastery of the craft.The novella's brevity doesn't compromise its impact; instead, it heightens the intensity, making every page count. King's prose is both engaging and evocative, immersing the reader in the world he has crafted. The characters are well-drawn, and their development contributes to the overall sense of urgency and suspense.In conclusion, \"Holly\" is a testament to Stephen King's ability to create a gripping narrative with an impeccable sense of pacing. If you're a fan of suspenseful tales that keep you guessing until the very end, \"Holly\" is a must-read. King once again proves why he is a master of the genre, delivering a novella that lingers in the mind long after the final page is turned.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nadette 43",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 12, 2024",
                "reviewTitle": "super",
                "reviewText": "Article offert à Noël ,ma fille est ravie car il est écrit en anglais et elle adore, je recommande ce livre ,très bonne transaction rapide",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cristian",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 13, 2023",
                "reviewTitle": "appassionante",
                "reviewText": "se siete fan del genere horror e' da non perdere!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}