{
    "remaining_requests": 1165,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Midnight-Darkest-Hour-Ashley-Winstead-ebook/dp/B0BTMXDL2N",
    "body": {
        "name": "Midnight Is the Darkest Hour: A Novel",
        "price": "$8.54",
        "originalPrice": "",
        "rawPrice": 8.54,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Midnight-Darkest-Hour-Ashley-Winstead-ebook/dp/B0BTMXDL2N",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81o9kfMLuPL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ashley Winstead",
            "link": "https://www.amazon.com/Ashley-Winstead/e/B08SZ9XJTL/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 1275,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the critically acclaimed author of In My Dreams I Hold A Knife and The Last Housewife comes Midnight is the Darkest Hour, a gothic Southern thriller about a killer haunting a small Louisiana town, where two outcasts—the preacher's daughter and the boy from the wrong side of the tracks—hold the key to uncovering the truth.For fans of Verity and A Flicker in the Dark, Midnight is the Darkest Hour is a twisted tale of murder, obsessive love, and the beastly urges that lie dormant within us all...even the God-fearing folk of Bottom Springs, Louisiana. In her small hometown, librarian Ruth Cornier has always felt like an outsider, even as her beloved father rains fire-and-brimstone warnings from the pulpit at Holy Fire Baptist. Unfortunately for Ruth, the only things the townspeople fear more than the God and the Devil are the myths that haunt the area, like the story of the Low Man, a vampiric figure said to steal into sinners' bedrooms and kill them on moonless nights. When a skull is found deep in the swamp next to mysterious carved symbols, Bottom Springs is thrown into uproar—and Ruth realizes only she and Everett, an old friend with a dark past, have the power to comb the town's secret underbelly in search of true evil.A dark and powerful novel like fans have come to expect from Ashley Winstead, Midnight is the Darkest Hour is an examination of the ways we've come to expect love, religion, and stories to save us, the lengths we have to go to in order to take back power, and the monstrous work of being a girl in this world.\"Where The Crawdads Sing meets Twilight meets Thelma and Louise in this brilliantly realized, totally original thriller. Absolutely sensational—I couldn't put it down.\" —Clare Mackintosh, New York Times bestselling author Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BTMXDL2N"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Sourcebooks Landmark (October 3, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 3, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 8126 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 391 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1443471712"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,614 in Kindle Store (See Top 100 in Kindle Store) #34 in Psychological Literary Fiction #97 in Mystery, Thriller & Suspense Literary Fiction #650 in Psychological Thrillers (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 1,275 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "In My Dreams I Hold A Knife The Last Housewife Midnight is the Darkest Hour More thrillers by Ashley Winstead!",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/91982e95-3d8d-4adc-a2b2-a0fc05214750.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1e4f353a-2671-4b0a-9d9b-2b6510db4081.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/23e0c89e-713b-4090-b6cd-9b653ed85a0e.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9dd5e5ab-f4f9-4c1d-8c13-cd48533e8e25.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c18b7e59-7bae-4c7a-b5c5-91561845ac3a.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/edbb078f-b3d5-461e-a8f4-7d6ee5ac1162.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d10539a5-a69e-4a2b-8b3f-33ae3b3c7d54.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/53a48fa9-facb-4db3-bfb1-7576e3ae05bf.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/60f61f7d-690b-48f7-9760-7a172150eb0b.__CR0,0,150,300_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7ebb9245-3f4b-4f6b-a70b-dcddc20364f4.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "CeleneCelene",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFZPCT2A2UEJGA7TATGQTTHLHGQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YQ9T7VTDJ1UY?ASIN=B0BTMXDL2N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Probably my favorite of Winstead's so far.",
                "reviewText": "I have been stewing over my thoughts and my review for this book since I finished it last night. I'm going to be honest. I still don't know what to say or even what to rate it. I'm normally not this indecisive and I don't know what that means as far as what I've just read. 😂 There were some elements I enjoyed and some not so much, so I'm going with a lukewarm 4 stars and prefacing this whole review with: if you've loved Winstead's writing in the past, you'll love this one also. Because here's the thing....I have never giving one of Winstead's books a 5 star rating before. They are never books I readily recommend and I'm never obsessed with how good they are. They have all just been okay, decent reads with the exception of one being absolutely terrible for me (The Last Housewife). So I guess it shouldn't be surprising that this one was a like and not a love, but with all the hyped up praise, I really thought it would turn out differently for me. However, I will say of all of Winstead's books this one is probably my favorite!One thing I respect about Winstead is her ability to write different genres. I love how she can rotate between romance and thriller. With Midnight, we get a genre bending book that is some parts Southern gothic, a dash of romance and I wouldn't necessarily call it a thriller specifically, more of a dark drama, but definitely gives you some heart pounding moments.So here is what I loved:I loved the ode to Twilight with all the references and vampire vibes we get with this book. That was definitely my favorite part about this story. Her take and going at this book from that angle felt so unique that as I was reading it, I had no idea where it was going with certain details. The atmospheric writing was also a huge plus. I truly felt transported to the Louisana bayou and now the references to Where The Crawdad Sings makes sense to me. I really enjoyed the main character, Ruth, but especially loved Everett. Although, it would become frustrating for me with some of Ruth's choices. I was still quite invested in her as a character. And I loved their relationship/ friendship and it was my favorite aspect of this whole book.The parts I didn't like so much:The extremist Southern Baptist religious cult this whole town is under. It reminded me of the cult aspect of The Last Housewife and overall, just felt too over the top and exaggerated, I couldn't take it serious and felt too dramatic/theatrical for it to be real. I normally don't mind reading about cults, but this one missed the mark for me.Another aspect I didn't particularly love was the ending. If you like books left open to interpretation, you won't mind it. But I like closure and that last sentence had me flipping through the last pages and going back to the last paragraph to reread it thinking, \"That's it?!\". Would be good for book club/buddy reading dialogue, but not when reading solo.And although, this wasn't a major issue for me because I like dual timelines, this book's timelines felt a bit disjointed. I could see where some who may not enjoy the back and forth in the first place would probably hate these and I've heard the audio is hard to enjoy, because of all the different timelines that take place, so make note of that if you enjoy audiobooks when picking this one up.All in all, was it overhyped and a bit disappointing for me? Yes. I thought it would be top 5 contender for me this year and sadly, it is not. And although, I will continue to read all of Winstead's writing, I am going to go in with lower expectations and knowing that she's not my particular cup of tea nor be an auto-buy author, but I'll wait my turn for the library loan. 😊Also, I just noticed the blurb compared this to Verity?? How very misleading. Verity it is not. 😅 And I wouldn't say I got A Flicker in The Dark vibes either. Lol.",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71Or1p77+-L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETQ3O3MVVMNF3PBXSCRZHXJ6VTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SMG2MSCVFW2D?ASIN=B0BTMXDL2N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars I feel broken",
                "reviewText": "I want a love like theirs. I want an Everett to always be there. — The ending broke me. I feel absolutely broken. The way my body reacts to this book. I feel too stunned to even have a big cry after the end. I just — what now? What do I even do with myself now? Everything about this novel was amazing. Not only the romance but the whole plot line was incredibly interesting. I’m just… oh god hahahahhaha. Gonna try to cry it out so I’m not stuck feeling so heavy.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Erika Breslin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFY4V57LFCL4KAOAZC6FCZKBZJ2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OGWY9A3HG0CT?ASIN=B0BTMXDL2N",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 1, 2023",
                "reviewTitle": "3.0 out of 5 stars A slower domestic thrillerish paranormal romance, I think",
                "reviewText": "This was a story about a girl who, raised in strictly hellfire and brimstone, has grown into a shy and obedient daughter. With her father as the pastor and one of the most prominent townsfolk, it seems impossible to achieve a life outside Bottom Springs... until one fateful night when she's saved by Everett, the class pariah. We watch as they come closer to both each other and to unraveling the town's hidden secrets.The most important part of my review is that - (IYKYK 😆)I was so excited to read this. I swallowed it in 3 days. With that being said, it was not my favorite Ashley Winstead work. I've seen from others and agree that there are True Blood and Sons of Anarchy vibes. But they are much, much, much slower vibes than I'm used to reading from the author.It felt like not much happened in the first 60% of the book other than multiple timeline jumps that left me questioning if I should be focusing on the romance, mystery, or horror portions of it. If you enjoy a more character-driven, slower burn, this is for you.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jennifer Halleran",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMJB2S6VYS7756GUVTL36IQZV7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCBSWOZJHHACI?ASIN=B0BTMXDL2N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "4.0 out of 5 stars An Enticing Read",
                "reviewText": "Wow. Just finished reading “Midnight is the Darkest Hour.” It was a very enticing and interesting read! I was drawn to the book when I read the summary because it was a dark romance. I did not anticipate the southern small town hysteria, which made the novel all the more appealing. Ruth, to me, was a very….I am not sure the word to describe her. She is tougher and stronger, brought out by Everett. She seems like such a meek teenage girl, but is actually more profound, more observant and justified as the novel progresses. Everett…I was mesmerized by him from the star…as I imagine it was intended, just as audiences are with Edward Cullen. He was strong, dark and intriguing. Mysterious. With a heart in the right place and a deep love for Ruth. Such a deep and tangle novel of relationships.The novel really does have a web of relationships. I am in disbelief at the hysteria of the small town and how gullible the townsfolk are in following James. There is no question in his statements, just unwavering loyalty. I despise how the women in the novel are treated, which makes me soar with pride and happiness at how strong Ruth is at the end, stepping up to the real monster in the novel.The real monster. But, what about Ruth’s past? Her current actions? And what about Ever’s actions? Are they justified? I understand why they did it, but does that make it right? I will think about this for the rest of the night and days to come! That’s how you know it’s a good one-stimulating one to think! Against what is considered normal. There is so much to unpack and untangle in this novel. And the end-I have what I want to happen, and what I believe will happen. What do you think?",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Baiba",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 1, 2023",
                "reviewTitle": "😭",
                "reviewText": "🤯 okay i did not expect what happened, i had my theories… also this book was a LOT like Together we rot by Skyla Arndt, if you loved the religious part of it and the mystery you should read that book too",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. O'Regan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 16, 2023",
                "reviewTitle": "Atmospheric Southern Gothic",
                "reviewText": "“And then I found Twilight. … It was the ultimate contraband: a story both occult and romantic, and meant for girls like me. In Bella, I found a mirror. We were both shy and overlooked, with the smallest of lives, hemmed in by circumstances outside our control. And in the vampire Edward, I found everything I’d ever wanted in a man.” - ‘Midnight is the Darkest Hour’ by Ashley Winstead.In the small Louisiana town of Bottom Springs librarian Ruth Cornier has always felt like an outsider. Her father, Pastor James Cornier, regularly rains fire-and-brimstone warnings from the pulpit at Holy Fire Baptist. Ruth had a strict upbringing though found comfort in her secret reading of forbidden books, especially the Twilight series.In Bottom Springs the only thing that the townspeople fear more than God and the Devil are the folklore that haunts the area, such as the story of the Low Man, a vampiric figure said to steal into sinners' bedrooms and kill them on moonless nights.When a skull is found deep in the swamp next to mysterious carved symbols, Bottom Springs is thrown into uproar. Yet Ruth has a different perspective and reaches out to Everett, an old friend with a dark past. They each have secrets linked to the swamp and set out to seek their own answers. No further details to avoid spoilers.This was my first experience of Ashley Winstead’s writing. It was pure Southern Gothic in its setting and themes. I found it quite a slow burn that stressed character development over flashy twists. There were revelations along the way though I felt that these rose organically from the narrative.I experienced this as a thoughtful novel that considered concepts of morality; examining the degree to which the behaviour of Ruth and Everett were reactions to the strict moral codes that are the norm in the community and promoted by Pastor James Cornier.I appreciated Ashley Winstead’s closing ‘A Conversation with the Author’ in which she discusses her intentions and choices in the novel. It especially put the novel’s shocking final pages into context as well as her reasons for the inclusion of the Twilight references. A Reading Group Guide is also included.Overall, I found ‘Midnight is the Darkest Hour’ an impressive work of psychological horror that examines the effects of lingering superstitions, crime, small town politics, and religion upon the lives of its characters. It made me curious to read her other writings.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kait",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 24, 2023",
                "reviewTitle": "Had so much potential",
                "reviewText": "I really liked ‘In My Dreams I Hold A Knife’ and I couldn’t put that book down once I started reading it, however this book was not the same. ‘Midnight Is The Darkest Hour’ felt like a bit of a slog to get through at times, and although at times the story was sometimes interesting, other times the plot was meandering and I don’t think the switch between the past and the present was enough to pique my interest. The main character Ruth was also quite infuriatingly naive at times, and towards the end of the book, I struggled to care what happened to her to be honest so when I got to the ending, it didn’t feel like much of a cliffhanger as I’d lost interest in what happened to her and Everett.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}