{
    "remaining_requests": 1141,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Wolf-Watchman-Niklas-Natt-och-ebook/dp/B07GNT9TWM",
    "body": {
        "name": "The Wolf and the Watchman: 1793: A Novel",
        "price": "$13.99",
        "originalPrice": "",
        "rawPrice": 13.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Wolf-Watchman-Niklas-Natt-och-ebook/dp/B07GNT9TWM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81lE9J+QBvL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Niklas Natt och Dag",
            "link": "https://www.amazon.com/Niklas-Natt-och-Dag/e/B07NQHVVFZ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 3136,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“The Alienist set in eighteenth-century Stockholm: Brawny, bloody, intricate, enthralling—and the best historical thriller I’ve read in twenty years.” —A.J. Finn, #1 bestselling author of The Woman in the Window “Thrilling, unnerving, clever, and beautiful.” —Fredrik Backman, #1 bestselling author of A Man Called Ove “Chilling and thought-provoking. Relentless, well-written, and nearly impossible to put down.” —Kirkus Reviews (starred review)One morning in the autumn of 1793, watchman Mikel Cardell is awakened from his drunken slumber with reports of a body seen floating in the Larder, once a pristine lake on Stockholm’s Southern Isle, now a rancid bog. Efforts to identify the bizarrely mutilated corpse are entrusted to incorruptible lawyer Cecil Winge, who enlists Cardell’s help to solve the case. But time is short: Winge’s health is failing, the monarchy is in shambles, and whispered conspiracies and paranoia abound. Winge and Cardell become immersed in a brutal world of guttersnipes and thieves, mercenaries and madams. From a farmer’s son who is lead down a treacherous path when he seeks his fortune in the capital to an orphan girl consigned to the workhouse by a pitiless parish priest, their investigation peels back layer upon layer of the city’s labyrinthine society. The rich and the poor, the pious and the fallen, the living and the dead—all collide and interconnect with the body pulled from the lake. Breathtakingly bold and intricately constructed, The Wolf and the Watchman brings to life the crowded streets, gilded palaces, and dark corners of late-eighteenth-century Stockholm, offering a startling vision of the crimes we commit in the name of justice, and the sacrifices we make in order to survive. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B07GNT9TWM"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Atria Books (March 5, 2019)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 5, 2019"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 8709 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 381 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1982123206"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#207,820 in Kindle Store (See Top 100 in Kindle Store) #947 in Mystery, Thriller & Suspense Literary Fiction #1,075 in Historical Mystery, Thriller & Suspense Fiction #1,354 in Historical Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 3,136 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mac6uffin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5TO2XEWZONGQUYQ7SEH42BI5XA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24T5A4ZJZV25D?ASIN=B07GNT9TWM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 25, 2020",
                "reviewTitle": "5.0 out of 5 stars To Go Into the Belly Of the Beast, You First Must Brave the Teeth",
                "reviewText": "1793 Stockholm - a dirty and disgusting city. Every open body of water is an open sewer. Men, women, and even children are prostituted to survive. Out of one of these sewer-lakes a body is discovered. Limbs neatly severed like a surgeon, the eyes and tongue removed. Our protagonists are the titular watchman (watchmen are a mostly corrupt police force which enforce moral laws) with a wooden arm and demons from a past war, and an investigator who is nearly dead from what was then called consumption. They are hunting a wolf... a man that preys upon other men. How really different is he from other men in this city where everyone seemingly preys upon someone else? From \"homo homini lupus est\", which can translate as, “Like a wolf is man to other men.” Other novels have explored this heart of darkness in humanity, but this novel proves you don't have to travel up a river in Africa to find bloodstained teeth in a smile. This debut novel won acclaim and it’s easy to see why. Chilling and haunting.Five stars.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH55C7VTUJRLRHKGHKGNAIN2M7PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QCU8BPMPJD4G?ASIN=B07GNT9TWM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 24, 2019",
                "reviewTitle": "4.0 out of 5 stars Old Noir",
                "reviewText": "This one, for Nordic Noir, is Nordic and it is sort of noir but not the way you usually think of noir. The setting makes the difference. This is 19th century Stockholm and there are no gangs, no intrepid detectives, and only one real murder. The “detectives” who end up solving the various mysteries that occur are not even detectives. The “team” consists of a lawyer with a terminal case of consumption, Cecil Wenge, and a watchman, sort of an “eye on the town” kind of guy, Mickel Cordell. Cordell is usually found in a pub somewhere near the floor. He is an accomplished battler but he has one handicap that actually turns into an advantage: one of his misadventures cost him his left arm but the wooden replacement is heavy enough to do great damages in the fights that he gets into during the story. In one memorable encounter, he remembers fighting but he remembers only after he wakes up from passing out from being drunk: he has two teeth stuck in his arm. The placid existence for the two ends with the discovery of a body in a stagnant sort of bog called the Larder. The body has not been in the water long, but it is unusual in that it has no arms, legs or eyes, making identification difficult, if not impossible. Cardell enlists Winge in attacking the various aspects of the problem of identification and finding out who may have been so brutal as to dismember it while the victim was alive. In the process of finding out who the victim is, we meet a thoroughly disgusting cross-section of late-18th century Sweden: drunks, whores, pimps, cheats, pickpockets, addicts and thieves. We meet the man who amputated the victim’s limbs, we meet the man who told the villain to do it, we meet a wonderful innocent who gets caught up in the life of a prostitute though she is not one and the whole mess of types mingle together in separate chapters to make a wonderfully crazy whole. Winge continues his process of dying, with momentary reprieves while Cardell ties to stop drinking and try coffee to no success. There are heart-stopping escapes, near-death experiences, various states of unconsciousness, almost-loves and all the time there is a crime to be solved. Not your normal noir, it is historical fiction at its best: good history with a good plot and memorable characters. Recommended.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESY4WA5JTMFO2EF6TDJDFCNK6UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RKXU7M0QGKB0?ASIN=B07GNT9TWM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2023",
                "reviewTitle": "5.0 out of 5 stars Gives a vivid picture of life during the period.",
                "reviewText": "Gives a vivid picture of life during the period.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Insight1001",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEAASBT6T4ZEAD4UEJRGVYGAKBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UJ6N027I0GIH?ASIN=B07GNT9TWM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 6, 2019",
                "reviewTitle": "3.0 out of 5 stars First and Last Sections are Best",
                "reviewText": "Others have written about the excellence of the author's writing as well as the gruesome nature of his subject. My sentiments exactly. The author provided a wonderful tour of late 18th Century Stockholm - complete with all the dirt and filth.The book divided into four parts. Part One described the issue and introduced the two primary characters: a prosecutor with an indefinite brief and a former sailor, turned night watchman, who lost much of his arm in battle. These two characters hold one's interest and make the book worthwhile. Section Two describes in gory detail the 'surgery' performed on the poor subject. Part Three outlines how the description of these activities comes to be known. In Parts Two and Three, the two primary characters play almost no part. They return with a vengeance in Part Four to solve the mystery and bring the book to its conclusion. For those finding Part Two too gory for their tastes and Part Three boring (as I did), it's possible to skip them with only a modest effect on the overall enjoyment.",
                "reviewVotes": "26 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terry Licia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRFZVG27NND5EWBMG6MOJGOC7SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R357U7CEQA34SA?ASIN=B07GNT9TWM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 31, 2019",
                "reviewTitle": "5.0 out of 5 stars Agony and Ecstasy",
                "reviewText": "I've not written a review in quite a while. Mainly because no stories have thrilled me enough to care! But this novel is utterly fantastic! Life in Sweden so long ago is richly detailed, and describes the class separations unlike any novel I've read before. I know coldness having lived in Alaska most of my adult life, and I know the darkness that robs many of their sanity. But the combination of the two along with terrible abuses from our fellow humans can lead some to the loss of their very humanity, while for others, that journey is what fulfills them. In this book, I FELT every characters emotions as if I was there! I couldn't stop reading, and finished the story at 5 am, satisfied that justice had been completely served! Great feeling!The author Matt Natt och Dag has captured the purity and the monstrosity of the human soul as clearly as his very name, night and day. An amazing debut novel!A MUST READ! Twenty stars!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr Christopher Wright",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 25, 2023",
                "reviewTitle": "Thoroughly engaging Scandi-Noir set in 18 century Sweden",
                "reviewText": "An extremely well written, thoroughly engaging Scandi Noir book 1 of 3",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "celsius antonio lodder",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 8, 2020",
                "reviewTitle": "Mais um clássico escandinavo",
                "reviewText": "Um livro de estréia escrito por um nobre sueco que se chama Nacht en Dag, Noite e Dia. É um livro de procedimento investigativo criminal que se passa em fins do século XV em Estocolmo. Vc pode não acreditar, dentro destas informações que, se o comprar, estarará lendo um clássico do gênero.'O crime cometido é horripilante e sua descrição não deverá ser fácil de ler para muitos. Os personagens do autor são todos condenados pela miséria, pelo sofrimento e pela desesperança, mas é isso que os move 'a frente, enfrentando seus difíceis problemas. Definitivamente não é um livro divertido de ler, mas é um grande livro, uma obra prima do gênero policial em uma cidade e num século que, paradoxalmente, nem justiça havia, quanto mais polícia. Não deixe de lê-lo.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Gina Machado",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 9, 2019",
                "reviewTitle": "Brilliant",
                "reviewText": "OMG-one of the best books of all time. All I ask is that the author write more books that are unique like this one. Not for the faint of heart but moments of beauty as well. I loved the characters and there is such atmosphere. True literature and mystery as well. Love it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DTM",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 26, 2020",
                "reviewTitle": "Buena prosa. Errónea decisión de forma",
                "reviewText": "A pesar de las buenas críticas y de ser tratada como el thriller histórico del año, tiene muchas carencias.La historia está bien, la prosa es magnífica, pero no es suficiente porque la elección del autor a la hora de contar los hechos ha sido errónea. Al menos, para mí.Después de 200 páginas con un thriller clásico, el autor decide pasarse las siguientes 100 páginas —o más— con una historia que encajará después con la historia principal pero que hace, a mi forma de ver, que se pierda absolutamente el ritmo de la lectura.Con muchos menos datos hubiéramos entendido a los personajes de la misma forma y habríamos permanecido más conectados a la historia.Un error. No puedo darle más que 3 estrellas (y solo por la magnífica prosa).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Herbert M.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 25, 2019",
                "reviewTitle": "Interessant zum Lesen!",
                "reviewText": "Interessant zum Lesen!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}