{
    "remaining_requests": 1300,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-The-Fury/dp/B0BZWVDKQF",
    "body": {
        "name": "The Fury",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-The-Fury/dp/B0BZWVDKQF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51ORZCdSm6L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Alex Michaelides",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Alex+Michaelides&search-alias=audible"
        },
        "brand": "Alex Michaelides&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 3413,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"Alex Jennings' impeccable accent keeps the already propulsive novel quite engaging, and moving like a steam train about to run you over.\"—VultureThis program is read by Alex Jennings, who has worked extensively with the Royal Shakespeare Company and National Theatre. He is also known for his role as Edward VIII, the Duke of Windsor, in the Netflix series The Crown, along with his roles in The Queen, Lady in the Van, and The Wings of the Dove. He is a three-time Olivier Award winner and has been nominated for a BAFTAA masterfully paced thriller about a reclusive ex-movie star and her famous friends whose spontaneous trip to a private Greek island is upended by a murder—from the #1 New York Times bestselling author of The Silent PatientThis is a tale of murder.Or maybe that’s not quite true. At its heart, it’s a love story, isn’t it?Lana Farrar is a reclusive ex-movie star and one of the most famous women in the world. Every year, she invites her closest friends to escape the English weather and spend Easter on her idyllic private Greek island.I tell you this because you may think you know this story. You probably read about it at the time―it caused a real stir in the tabloids, if you remember. It had all the necessary ingredients for a press sensation: a celebrity; a private island cut off by the wind…and a murder.We found ourselves trapped there overnight. Our old friendships concealed hatred and a desire for revenge. What followed was a game of cat and mouse―a battle of wits, full of twists and turns, building to an unforgettable climax. The night ended in violence and death, as one of us was found murdered.But who am I?My name is Elliot Chase, and I’m going to tell you a story unlike any you’ve ever heard.A Macmillan Audio production from Celadon Books. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "8 hours and 8 minutes"
            },
            {
                "name": "Author",
                "value": "Alex Michaelides"
            },
            {
                "name": "Narrator",
                "value": "Alex Jennings"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 16, 2024"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BZWVDKQF"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#147 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #12 in Psychological Thrillers (Audible Books & Originals) #22 in Suspense (Audible Books & Originals) #58 in Psychological Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Laurel-Rain Snow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG47Z3XNPUL5RK3JVKGCVQAIISFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CMVBX24MQUHJ?ASIN=B0BZWVDKQF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars TWISTS & TURNS...",
                "reviewText": "This is a tale of murder.Or maybe that’s not quite true. At its heart, it’s a love story, isn’t it?Lana Farrar is a reclusive ex–movie star and one of the most famous women in the world. Every year, she invites her closest friends to escape the English weather and spend Easter on her idyllic private Greek island.I tell you this because you may think you know this story. You probably read about it at the time ― it caused a real stir in the tabloids, if you remember. It had all the necessary ingredients for a press sensation: a celebrity; a private island cut off by the wind…and a murder.We found ourselves trapped there overnight. Our old friendships concealed hatred and a desire for revenge. What followed was a game of cat and mouse ― a battle of wits, full of twists and turns, building to an unforgettable climax. The night ended in violence and death, as one of us was found murdered.But who am I?My name is Elliot Chase, and I’m going to tell you a story unlike any you’ve ever heard.my thoughtsAs we ride along with the narrator Elliot Chase, we are caught up in the twisty story he tells. Just when we think we have it all figured out, he turns a corner and we are asking more questions.The setting of The Fury is a Greek island, with friends/enemies plotting murder. But does a murder actually happen? And to whom?The tale kept me intrigued, and I was still puzzling about it all by the end. 4.5 stars.***",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "under the radar dot com",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHF2IV7WP6BMOQRLPFFQ7VK5TWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3638WT2P241JE?ASIN=B0BZWVDKQF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Everything you need for a five-star reading experience is in this book.",
                "reviewText": "THE FURYAlex MichaelidesEverything you need to know to be prepared for a five-star experience is in the synopsis. Everything you need for a five-star reading experience is in this book.Let’s talk about THE FURY!In THE FURY we are following a group of friends on a private Greek Island called Aura. Lana Farrar, the ex-movie star, has invited her very close friends to unwind and relax over Easter weekend.By the end of the weekend, plans unravel, secrets are revealed, and someone ends up dead. We learn the who, the what, and most importantly the why, in this spectacular “WHYDUNIT” by Alex Michaelides, out January 2024!I spent a weekend reading THE FURY. The first thing I noticed was how intentional the writing was. Thought and time and care went into thinking about what the words were saying, where the sentence was landing, and how the reader was experiencing the book.I had a spectacular and unforgettable reading experience.Just as the painting was in THE SILENT PATIENT, so is the wind in the fury. It’s a non-human entity that acts much like a character. It interacts with the scene; it has its own behavior and becomes just as vocal and informative as the dialogue between characters.There are elements carried over from both THE SILENT PATIENT and THE MAIDENS. THE FURY is synergistic and felt like the culmination of something bigger than itself.The sum of many parts.There is something here for every reader out there and will be particularly compelling for die-hard thriller fans. This is the one you’ve been waiting for.I cannot wait to hear this as an audiobook and I’m 100% rereading this with you when it comes out in January 2024.Finally, again a book by Michaelides well worth the price of admission.If this is the show, I want a ticket!THE FURY...⭐️⭐️⭐️⭐️⭐️Thanks to Celadon Books for the advanced copy and the awesome opportunity to provide early feedback!",
                "reviewVotes": "18 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mnmloveli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCTV7IKYZWBT7ILD5IGDKAVHTAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RASA9ZUX6B50V?ASIN=B0BZWVDKQF",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "3.0 out of 5 stars Disappointing !",
                "reviewText": "24 - 3 STARSDESCRIPTION : This is a tale of murder. Or maybe that’s not quite true. At its heart, it’s a love story, isn’t it? Lana Farrar is a reclusive ex–movie star and one of the most famous women in the world. Every year, she invites her closest friends to escape the English weather and spend Easter on her idyllic private Greek island. I tell you this because you may think you know this story. You probably read about it at the time ― it caused a real stir in the tabloids, if you remember. It had all the necessary ingredients for a press sensation: a celebrity; a private island cut off by the wind…and a murder. We found ourselves trapped there overnight. Our old friendships concealed hatred and a desire for revenge. What followed was a game of cat and mouse ― a battle of wits, full of twists and turns, building to an unforgettable climax. The night ended in violence and death, as one of us was found murdered. But who am I? My name is Elliot Chase, and I’m going to tell you a story unlike any you’ve ever heard.REVIEW :First two books by this author were The Maidens (‘21 - 3 Stars) and The Silent Patient ('19 - 5 Stars).I love how this author’s writing pulls you in, even if there’s not much going on and wraps you up so you can’t stop reading. During this authors interview on Good Morning America, he said he wrote this book totally different; he had no plan. He wanted to flip the murder mystery with stranded guests on an island plot on its head with lots of twists. At 50%, it’s only the flow of the author’s words that is keeping me reading; plot - not so much. The last 50% was very predictable for me; a couple of turns but nothing shocking. If you like murder mysteries, you might like this one more than me. I went with 3 stars for the author’s writing ALONE! If he didn’t have such a way with words, this book might have gotten 2 stars. If only he could find another plot as good as The Silent Patient - I’ll keep hoping !",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emma ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3TQ3ESZQWAJ5HBK4EYSJVG6ENA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R132CDOC6QPR7G?ASIN=B0BZWVDKQF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars A fun mystery",
                "reviewText": "A fun mystery. I wouldn’t go into this expecting a “The Silent Patient” level plot twist or shock or anything to that effect. That just isn’t the nature of this book, in my opinion. It’s a glass onion, and then there were none type mystery with a playwright twist on it. It’s narrated in the first person, which gives it a conversational nature—especially considering the fourth wall breaks. The chapters are short and quick, so I would recommend to any glass onion fans looking for a quick mystery.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nilton C. Teixeira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Very atmospheric",
                "reviewText": "A generous 4 stars.A slow start and a story filled with beautiful descriptions of places and food that made me wish to take the next flight back to Greece.I simultaneously listened to the audiobook. The audiobook had more words than my paperback edition.Here is a simple example:Book: “A small figure was…”Audiobook: “ There was a small figure…”Book: “That the guns…”Audiobook: “ The fact that the guns…”Book: some times a pronoun was usedAudiobook: that pronoun was substituted by the character’s name.Anyways, those differences were not a big deal but I thought I should mention.I thought that this book was much better than “The Maidens”, but not as thrilling as “The Silent Patient”.I enjoyed the writing and specially the narrative, but the development of the storyline was very slow.Regardless, I did find it very atmospheric, hence my ratings.The chapters are very short and well constructed, but no characters are likeable and unfortunately I did not connect with a single one.As for the narrator, there was no way that he could have known everything.Paperback (Celadon Books): 299 pages (or 320 pages if cover to cover - so many empty pages and spaces - I felt cheated). It’s divided into 5 acts, and most of the chapters are very short.ebook (Kobo): 217 pages (default), 67k wordsaudiobook narrated by Alex Jennings: 8.1 hours (normal speed)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allison Valentine ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2024",
                "reviewTitle": "Highly recommend",
                "reviewText": "When Elliott visits ex movie star Lana Farrar and her friends on a Greek island all is well until shots are heard and a body is found.Who did it and for what reason?The story is brilliantly narrated and Alex has a knack of bringing each character to life.I would say it is a love story but with some wicked twists.What's that old saying.....Hell have no FURY like a woman scorned!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Francis Aylward",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Great book!",
                "reviewText": "Love this author!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Moreau",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Zippy murder mystery on a Greek island",
                "reviewText": "I inhaled this book. In a cold depths of February a fun murder mystery set on a Greek island was just what I needed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S S Mukharjee Madivada",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 6, 2024",
                "reviewTitle": "This is not something that you would expect",
                "reviewText": "“The Fury” by Alex Michaelides is not your routine novel. It teases you from one question to the next: from a whodunit, to what happened exactly and to why it all happened; It does so while answering some fundamental questions about relationships in general, and the lasting effects of childhood trauma on shaping an individual in particular.It is one of the most nonlinear story plots that I have read. The nonlinearity amuses the readers without losing them in between the subplots. The first person narrative occasionally makes you feel a bit annoyed, but that cost comes at the benefit of revealing the story twists beautifully.This is by far the best of Alex’s three novels to date: The silent patient was brilliant; The maidens was good. The Fury can easily become a cult classic.To enjoy the novel thoroughly, you have to give in to the narrative: the protagonist asks you to sit besides him on a bar stool, sip a drink with him and listen to his story. Yield and you will be treated to a lovely story. Start saying “WTF, why can’t he just tell the story straight?”, you will lose him. Humor him and enjoy his tale.The novel reminds you - unabashedly of course - of a lot of other stories, but holds its ground in being unique in the story-unraveling technique.Dr. M.S.S. Mukharjee.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}