{
    "remaining_requests": 1116,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Mile-High-Death-Gripping-Thriller-ebook/dp/B08B3VCV1M",
    "body": {
        "name": "Mile High Death: An absolutely enthralling crime thriller novella (Tess Winnett)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Mile-High-Death-Gripping-Thriller-ebook/dp/B08B3VCV1M",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71JZu-qnXSL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Leslie Wolfe",
            "link": "https://www.amazon.com/Leslie-Wolfe/e/B00KR1QZ0G/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 4293,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The sea didn’t have her long enough to ravage her broken body. Her beauty is still intact, her pale lips slightly parted in the memory of her last breath, her dark hair clinging to her face in long, wavy strands. Every inch of her skin bears testimony of her terrifying fate at the hands of the man who never expected her to be found. “I know I am reading a Leslie Wolfe thriller when I feel chills run up and down my spine. She sets the scene, develops her characters and teases the reader's senses enough that hers are the only thrillers you want to read. Pick this one up today.” – Cheryl Pompilii, five stars review on Amazon.After the body of a brutally murdered young woman is recovered from the Gulf of Mexico far from shore, FBI Special Agent Tess Winnett is called in to assist with the profiling of the murderer. Although only one body has been found, every detail about the gruesome crime points to the work of a serial killer.Have there been others, left to die far at sea, where no one will ever find them? Is there a connection to be found, or is Tess searching for evidence that doesn’t exist?Partnering with Detective Michowsky, Tess is frantically looking for answers in the case that left no evidence other than a body that was never supposed to be found. How many others perished like her? And how many others will?The best-selling author of Dawn Girl is back with another suspenseful, gripping crime thriller. If you’re a fan of David Baldacci, Melinda Leigh, and James Patterson, you will enjoy Leslie Wolfe’s enthralling police procedural that will keep you reading until the last page.What Readers and Reviewers Are Saying About Leslie Wolfe“Wolfe's strong female characters, who all appear to be flawed, never disappoint. ”“The action is immediate and nonstop, and just when you think you have it all figured out, Wolfe tosses in a twist so masterful that it’ll make your head spin. ”“Wow... Leslie Wolfe is an incredible story teller. Can't wait for more of Agent Tess Winnett.”“Leslie Wolfe has a wonderful ability to make you feel as if you were right there watching the events unfold in this fast paced and nail-biting thriller.”",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08B3VCV1M"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Italics Publishing (June 26, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ June 26, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2538 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 123 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,876 in Kindle Store (See Top 100 in Kindle Store) #68 in Kidnapping Crime Fiction #250 in Kidnapping Thrillers #251 in Serial Killer Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 4,293 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/49041a87-a219-4362-9e12-5c1111dc6094.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/140804f0-63ab-4d16-8e21-6532f93aa9cb.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f35bb9e1-cb17-424c-88f2-0b69839bcb70.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJJT47EXWXQAT3GG4X6QYKSUXZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DD8B5NB9IZRL?ASIN=B08B3VCV1M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2023",
                "reviewTitle": "5.0 out of 5 stars Gripping",
                "reviewText": "Another gripping story. I read alot of drama stories and Leslie always seems to amaze me with the new crazies. Amazed at how the story flows and as always ends too soon. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pisces51",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXYPVRGP5MKCYIYCQR34SOLNGHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LPMN59Z2JDGL?ASIN=B08B3VCV1M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 28, 2020",
                "reviewTitle": "4.0 out of 5 stars ANOTHER ENTERTAINING INSTALLMENT IN WOLFE'S OUTSTANDING TESS WINNETT SERIES",
                "reviewText": "MY REVIEW 4.5 STARSI just finished reading this third novella to be released this year in Leslie Wolfe's popular FBI Special Agent Tess Winnett book series. All three were outstanding. I would recommend to anyone who has read this installment (or one of the other two for that matter) to go back and read the four full-length novels featuring FBI Special Agent Tess Winnett. Winnett is a strong female lead and a woman who has proven that she is a survivor. As a reader of crime fiction in general, and an aficionado of police procedurals and serial killer thrillers in particular, I have an aversion to the flawed protagonists who have populated this genre (and sub-genres) for so long now. I mean this in a non-sexist way and it goes for male leads as well their female counterparts. The notable exception of course is that the hero (or heroine) has suffered a horrible fate but has subsequently recovered from the trauma and is now hitting on all six cylinders. Tess is just this sort of protagonist. Readers who go back and read the full length novels will appreciate her journey out of hell and into her current world of quasi normalcy. She is an incredibly intuitive and talented criminal profiler who has stubbornly refused to join the behavioral sciences at Quantico because of residual insecurities. Winnett is brash and bold, exhibits a \"take no prisoners\" approach to evil wherever she finds it. Her braggadocio hides her vulnerability like a lead shield, and her amazing profiler skills and brilliant intellect invariably carries the day. In short, FBI Special Agent Tess Winnett is a lead character that you will find yourself loving but occasionally wanting to smack her upside the head for her acerbic remarks delivered at the \"good guys\".Wolfe has a special affinity for writing imaginative yet realistic ”nail biting\" thrillers that feature serial predators. In a typical outing by this author, the reader will experience the mounting horror of the victim(s), explore the depths of the disturbed psyche of the sociopathic killer as he relives his murders and as he stalks his new prey. The author is a master at alternating the third person narrative to focus on the viewpoints of victim, killer, and hunter. The reader will of course be privy to the astute observations and investigative skills of Winnett while compulsively turning the pages due to the rapidly escalating pace of the narrative. Wolfe does an incredible job with the above described technique. In fact, her serial killers are fleshed out so well in many cases that you can almost feel their breath on your neck.In MILE HIGH DEATH we find an Ed Kemper scenario that is totally believable, and a serial predator that is totally chilling. Fans of forensic science will enjoy the pathology of what happens to a body falling from 1000 feet into an ocean below. It's actually gruesome and not since Ted Dekker's Bestselling BONEMAN'S DAUGHTERS have fractures of the human body been so fascinating. In this outing Winnett uses her mental acumen and a generous helping of guile (and not her service weapon) to end the flourishing career of this story's monster. MILE HIGH DEATH felt more like a novella than the prior two installments did, but that isn't so much a criticism as it is an observation.Thoroughly enjoy the works of Leslie Wolfe and at the risk of redundancy I would note that she is perhaps one of the more underrated authors in the crowded field of psychological suspense and crime fiction.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M.B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE2PJYSZ5LQYMVBFRPJPI2WQLEPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19XV3VS5DZBPL?ASIN=B08B3VCV1M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2023",
                "reviewTitle": "5.0 out of 5 stars All I can say is Wow!!!!!",
                "reviewText": "This book hooks you at the very first page. The pace of the book kept me reading and wanting to get to the end. I strongly recommend this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "secyatlaw",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE74C4DFANAVSBSBBXOAIXLGI5ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JW2R8JSEPG6U?ASIN=B08B3VCV1M",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 30, 2023",
                "reviewTitle": "3.0 out of 5 stars Another Short Form Quick Read",
                "reviewText": "Against all odds, a body is discovered 150 miles off the coast. Young, beautiful and very, very dead, brutalized, bruised, choked and newly dead.Tess homes in on a very wealthy, very calculating man.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7OBAZ72N3IMOMYJK5WF2KE3BVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31LWRQ38XRZ7Z?ASIN=B08B3VCV1M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2023",
                "reviewTitle": "5.0 out of 5 stars So good!",
                "reviewText": "I love anything by Leslie Wolfe. Her books start with a bang and they end with a bang with no cliffhangers. Her books flow seamlessly from one book to the next",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Mule",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFB2SGUVKSAVNT4BL7WHKLO3UJCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SVY88X3Y7GNV?ASIN=B08B3VCV1M",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2023",
                "reviewTitle": "4.0 out of 5 stars Up up",
                "reviewText": "And away. Flying high and committing crimes. SSA Winnett is chasing a new killer who has kept a clean trail of victims until now.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "excalibur",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFT3A6A3TSJR7AOF7PV4D4375QA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NYM356Z2Q1B3?ASIN=B08B3VCV1M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 12, 2023",
                "reviewTitle": "5.0 out of 5 stars Tess Winnett books are great",
                "reviewText": "If you like serial killer books where the serial killers receive the best sort of justice read the Tess Winnet books",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gloria Kessingeran an ARC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQZ2DGGZQO2IEAX6VKU3EAXLSHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1H5VAJIX4CSBY?ASIN=B08B3VCV1M",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 30, 2020",
                "reviewTitle": "5.0 out of 5 stars Plunging Death",
                "reviewText": "I've just completed the ARC of the novella “Mile High Death”, by Leslie Wolfe, and wow what a thriller it was! It had me enthralled from the very first page. The story is told in such a realistic way, you can feel yourself becoming a part of it. This is book 7 in the Tess Winnett series, and Tess Winnett, a Profiler, and an Investigative Detective with the F.B.I., is at her very best. I really appreciated the way the personality of the characters was developed and portrayed – it was easy to feel liking & trust, sympathy, disdain, even hatred for the different individuals.Tesss Winnett and her trusty partner Gary Michowski are called to the discovery of a body pulled in from the Gulf of Mexico by the Florida Coast Guard. This was an extremely unusual find, as the Pathologist, Dr. Rizza, determined she had only been dead for a few hours. Normally, a body dumped in such a large body of water would Never be found! With absolutely No evidence to go on, Tess almost immediately declares this as the work of a serial killer, and she and Michowski set out to solve itThis is a fantastic suspense, and the ending will blow you away. I highly recommend this book!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Malcolm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 19, 2021",
                "reviewTitle": "Excellent Read",
                "reviewText": "We badly need distractions right now with the pandemic. All of Leslie Wolf's books fill the bill. Mile High Death is no exception. Fast moving, well written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adrian Lawrence",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 31, 2023",
                "reviewTitle": "Size doesn't matter.",
                "reviewText": "Yeah, most of us prefer a full length novel to a novella, but I suggest you don't pass this one up. Of course things happen quickly in a shorter story but this book is every bit as engrossing as the longer iterations. In my opinion the Tess Winnett series remains in the top three in this genre.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Michael",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 17, 2020",
                "reviewTitle": "So good",
                "reviewText": "As always another good story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "carole manette",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 23, 2022",
                "reviewTitle": "Novella's are fine",
                "reviewText": "Novella's are fine and I enjoyed the storyline, but so much more could have been written to flesh out the characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pat goode",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 23, 2021",
                "reviewTitle": "Good",
                "reviewText": "Wasnt a very long story,didnt think I,d finished the story,was enjoying it and then it was over,every strange I thought",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}