{
    "remaining_requests": 1348,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Family-Across-Street-unputdownable-psychological/dp/1800198272",
    "body": {
        "name": "The Family Across the Street: A totally unputdownable psychological thriller with a shocking twist",
        "price": "$9.93",
        "originalPrice": "",
        "rawPrice": 9.93,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Family-Across-Street-unputdownable-psychological/dp/1800198272",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71KnOamOInL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nicole Trope",
            "link": "https://www.amazon.com/Nicole-Trope/e/B00IXBRJ7A/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 22022,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 42 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (August 4, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 248 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1800198272"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1800198272"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 10 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.06 x 0.62 x 7.81 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#495 in Books (See Top 100 in Books) #36 in Psychological Fiction (Books) #46 in Contemporary Women Fiction #127 in Psychological Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 22,022 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Tom McGee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJUXFHV3BOMV2SXOYCSRYKA5KQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1AAYR8QJ12JKH?ASIN=1800198272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 25, 2023",
                "reviewTitle": "5.0 out of 5 stars The Most Entertaining Psychological Trillers That I Read in Many Years! Enjoy!",
                "reviewText": "The Family Across the Street, was my first exposure to author Nicole Trope, but will not be my last. I have already purchased her book, The Boy in the Photo.This 249-page suspense novel kept me glued to my chair rapidly reading through the wee hours of the morning and wishing I would have begun reading it earlier in the day.Trope knows how to grab the reader at the onset and hold on to the reader throughout the entire compelling tale.At times I was a bit confused by characters; however, I figured it out and I realize that was the author’s ingenious intent.Set-in modern-day Australia the story begins with two dysfunctional families. Logan and his sister, Maddy’s parents were terrible parents that had a negative impact on their children’s lives. Their father always said that Logan would end up in jail. Associating with the wrong people, Logan did end up going to jail after home invasions and smoking a powerful drug. Maddy ended up with Patrick a young man who was severely abused by his father. Patrick’s mom and dad divorced, and his father later committed suicide, but not before he manipulated Patrick into believing that his mother was the source of all of his problems. Maddy ended up in a Melbourne hospital on life support with an induced coma after Patrick beat her nearly to death.Another family, Katherine and John were having troubles of their own. Katherine believed that John was having an affair after she saw heart emojis on his cell phone texts. The strain of raising their 5-year-old twins, George and Sophie was negatively impacting their family and they seemed to be falling out of love with each other. After their elderly neighbors, Lou and Gladys heard John’s tires squealing as he left for work Gladys became annoyed. When she noticed that the Katherine and John’s blinds were closed and the children had not left for school, she worried that something was not right at Katherines home. Likewise, Debby’s husband Logan, a postal worker was concerned when he tried to deliver a laptop to Katherine's address. She refused to open the door for a signature resulting in him unable to deliver the computer. As he continued his postal route, he began to think something was wrong at that address. When he tried again, he heard a child at the door make a remark that amplified that concern.The remainder of the tail deals with suspenseful happenings within Katherine’s home and Gladys and Logan worrying about it.This is an enthralling suspense thriller that I recommend as a must read to fans of this genre. It is the best that I have read in years.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQLPOM7J52SPO6L7P2MA6UON6BQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EK1JBC8XGPZ1?ASIN=1800198272",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars Cover Description Not Accurate But Good Australian Based Book",
                "reviewText": "When I read the description on the back cover I was so excited to read this book. I didn’t realize it was based in Australia so I was confused at 1st when they mentioned weather/temperatures but I quickly realized they must be referring to Celsius rather than Fahrenheit temps (I live in the U.S).The books switches between different characters’ viewpoints, which adds to the suspense and mystery a little bit. But it also starts to feel like a frustrating read about halfway through. In the conclusion, it makes sense as to why it is written the way it is, but I’ll admit that it felt a little complicated and confusing at times.In short, I would recommend the book to friends, but I would warn them that1. The description on the back cover is somewhat misleadingAnd2. It becomes a little frustrating with the scattered storylines and it almost feels like work to carry on reading at timesBUT, if they power through the challenging parts, it will be worth it once you see the full picture.Also, it does feel like the ending was a bit rushed but I don’t want to be too critical. Overall, I was satisfied with my purchase and I don’t have any regrets buying/reading this book!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane Buckman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKEANWFZQUUAV3QLDE5DT4TYZEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DPRK5PIBRZYG?ASIN=1800198272",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars You will not be able to put this book down!",
                "reviewText": "I started reading this book late at night. I read the first chapter and was instantly hooked, but I had to force myself to put the book down and go to sleep because I had work the next morning. I couldn’t deal with the suspense and anticipation and wanted to read it all at once without interruption so I made myself put the book down and go to sleep, which was very hard to do, mind you.I waited until the weekend where I could read the book without putting it down. I started reading it about 7PM and did not (could not) put the book down until now 1:50 AM. This was the only book I have ever read from front to back nonstop. The thrill and suspense was nonstop, giving you chills as you read it. As I was reading this book, I was picturing it as a movie in my head vividly. This could easily be made into a movie and I would definitely buy a ticket to go see it in the theater just saying. Logan was my favorite character and he was truly an inspiration. I can relate a lot to Logan and I felt a strong connection to him and his character. Overall, I give this book a 10 out of 10. Loved it!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arsham Parsi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 6, 2024",
                "reviewTitle": "Greatly Recommended",
                "reviewText": "I was not a person to read lots of books with no pictures. 😊 I am very visual and I should see some pictures in the book to be encouraged to read.I had lots if games on my phone and they frustrated my partner. Once he said instead of games, get a book and I did delete them all and got this by a total chance.I enjoyed the Family Across the Street and I finished it within 3-4 days.I liked her writing style and was a pleasant book to read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T Stanley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 29, 2024",
                "reviewTitle": "Excellent plot twist",
                "reviewText": "I really enjoyed this. It was a nice easy read and when I got to the twist, I questioned everything I had just read…very clever. Read it in a day. I love a book that does that to me. Looking forward to reading more from this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "rubystar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 3, 2024",
                "reviewTitle": "WOW! Highly recommended.",
                "reviewText": "I rarely give 5 star ratings, but had to with this book. I never saw the twist coming and it was a complete surprise as to who was committing the crime… IAbsolutely loved the setting in a suburban Australia neighbourhood, and loved the imagery of the screeching cicadas and hot day - so totally relatable, as I struggle through heatwave conditions myself as I read… All of the characters were great, and I loved how the story was written from each one’s point of view, even the perpetrator. There really wasn’t anything I could fault. Ms Trope should be congratulated because she has written an excellent, thrilling story. Can’t wait to read more of her work!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 25, 2023",
                "reviewTitle": "Enjoyed it",
                "reviewText": "nice book with an unexpected twist",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "musical gogs",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 18, 2023",
                "reviewTitle": "A good twist and fast paced",
                "reviewText": "The story kept you guessing where it was going and the twist at the end was sneaking up from nowhere . I liked it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$5.44",
                "sellerName": "Land of Lincoln Goodwill",
                "sellerRating": "5"
            },
            {
                "price": "$10.99",
                "sellerName": "Hopefinder",
                "sellerRating": "4.5"
            },
            {
                "price": "$7.60",
                "sellerName": "PurselBooksellers",
                "sellerRating": "5"
            }
        ]
    }
}