{
    "remaining_requests": 1145,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Us-Lying-Bayview-High/dp/1524714755",
    "body": {
        "name": "One of Us Is Lying",
        "price": "$9.74$9.74",
        "originalPrice": "",
        "rawPrice": 9.74,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Us-Lying-Bayview-High/dp/1524714755",
        "soldBy": {
            "sellerID": "A1ZMSWN8P7M5C4",
            "name": "ThriftBooks-Dallas",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1ZMSWN8P7M5C4"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81cOaGbJ87L._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Karen M. McManus",
            "link": "https://www.amazon.com/Karen-M-McManus/e/B01M4HOSP5/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "ThriftBooks-Dallas",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 42535,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review A New York Times BestsellerAn Entertainment WeeklyBest YA Book of the Year Selection A Buzzfeed Best YA Book of the Year SelectionA New York Public Library's Best Book for Teens Selection A Popcrush Best Young Adult Book of the Year SelectionA CBC Teen Choice Book Award NomineeA Bustle Best Young Adult Book of the MonthA Goodreads Best Young Adult Book of the Year NomineeA YALSA Top Ten Best Fiction Book NomineeA YALSA Quick Pick for Reluctant Young Adult Readers “Pretty Little Liars meets The Breakfast Club....so make room for One of Us Is Lying in your bags, because this is one carry-on you won’t want to put down.\" —Entertainment Weekly Online“You’ll tear through this juicy, super-fun (if murder can ever be fun?) thriller.\"—Bustle \"A whodunit with a Breakfast Club twist...following four unique voices on a chase to find the killer, this one will keep you guessing until the very, very end.\"—Popcrush\"Twisty plotting, breakneck pacing and intriguing characterisation add up to an exciting, single-sitting thrillerish treat.\"—The Guardian\"This is no ordinary whodunit…surprising and relevant.\"—USA Today\"Readers will have a hard time putting this clever page-turner down.\" —BookPage Online“An addictive, devour-in-one-sitting thriller with so many twists and turns you'll be wondering until the very end: Who really killed Simon?”—Kara Thomas, author of The Darkest Corners and Little Monsters★\"[As] McManus's intense mystery unfolds...each character becomes more complex and nuanced, adding richness and depth to the suspense.\" —VOYA, Starred Review\"This fast-paced blend of Gossip Girl, Pretty Little Liars, and classic John Hughes will leave readers racing to the finish as the try to unravel the mystery on their own.\"—Kirkus Reviews\"One of Us Is Lying is flat-out addictive...[McManus] weaves an authentic, suspenseful mystery that readers can imagine taking place at their very own high school.”—RT Book Reviews\"A smart, twisted, and unpredictable YA mystery that will have readers guessing until the very end.\"—SLJ \"An engaging, enticing look at the pressures of high school and the things that cause a person to lose control.\"—Booklist About the Author Karen M. McManus earned her BA in English from the College of the Holy Cross and her MA in journalism from Northeastern University. She is the #1 New York Times bestselling author of One of Us Is Lying, its sequel One of Us Is Next, Two Can Keep a Secret and The Cousins. Her work has been published in more than 40 languages. To learn more about Karen and her books, visit karenmcmanus.com, or follow @writerkmc on Twitter and Instagram. Excerpt. © Reprinted by permission. All rights reserved. Chapter One Bronwyn Monday, September 24, 2:55 p.m. A sex tape. A pregnancy scare. Two cheating scandals. And that’s just this week’s update. If all you knew of Bayview High was Simon Kelleher’s gossip app, you’d wonder how anyone found time to go to class. “Old news, Bronwyn,” says a voice over my shoulder. “Wait till you see tomorrow’s post.” Damn. I hate getting caught reading About That, especially by its creator. I lower my phone and slam my locker shut. “Whose lives are you ruining next, Simon?” Simon falls into step beside me as I move against the flow of students heading for the exit. “It’s a public service,” he says with a dismissive wave. “You tutor Reggie Crawley, don’t you? Wouldn’t you rather know he has a camera in his bedroom?” I don’t bother answering. Me getting anywhere near the bedroom of perpetual stoner Reggie Crawley is about as likely as Simon growing a conscience. “Anyway, they bring it on themselves. If people didn’t lie and cheat, I’d be out of business.” Simon’s cold blue eyes take in my lengthening strides. “Where are you rushing off to? Covering yourself in extracurricular glory?” I wish. As if to taunt me, an alert crosses my phone: Mathlete practice, 3 p.m., Epoch Coffee. Followed by a text from one of my teammates: Evan’s here. Of course he is. The cute Mathlete--less of an oxymoron than you might think--seems to only ever show up when I can’t. “Not exactly,” I say. As a general rule, and especially lately, I try to give Simon as little information as possible. We push through green metal doors to the back stairwell, a dividing line between the dinginess of the original Bayview High and its bright, airy new wing. Every year more wealthy families get priced out of San Diego and come fifteen miles east to Bayview, expecting that their tax dollars will buy them a nicer school experience than popcorn ceilings and scarred linoleum. Simon’s still on my heels when I reach Mr. Avery’s lab on the third floor, and I half turn with my arms crossed. “Don’t you have someplace to be?” “Yeah. Detention,” Simon says, and waits for me to keep walking. When I grasp the knob instead, he bursts out laughing. “You’re kidding me. You too? What’s your crime?” “I’m wrongfully accused,” I mutter, and yank the door open. Three other students are already seated, and I pause to take them in. Not the group I would have predicted. Except one. Nate Macauley tips his chair back and smirks at me. “You make a wrong turn? This is detention, not student council.” He should know. Nate’s been in trouble since fifth grade, which is right around the time we last spoke. The gossip mill tells me he’s on probation with Bayview’s finest for . . . something. It might be a DUI; it might be drug dealing. He’s a notorious supplier, but my knowledge is purely theoretical. “Save the commentary.” Mr. Avery checks something off on a clipboard and closes the door behind Simon. High arched windows lining the back wall send triangles of afternoon sun splashing across the floor, and faint sounds of football practice float from the field behind the parking lot below. I take a seat as Cooper Clay, who’s palming a crumpled piece of paper like a baseball, whispers “Heads up, Addy” and tosses it toward the girl across from him. Addy Prentiss blinks, smiles uncertainly, and lets the ball drop to the floor. The classroom clock inches toward three, and I follow its progress with a helpless feeling of injustice. I shouldn’t even be here. I should be at Epoch Coffee, flirting awkwardly with Evan Neiman over differential equations. Mr. Avery is a give-detention-first, ask-questions-never kind of guy, but maybe there’s still time to change his mind. I clear my throat and start to raise my hand until I notice Nate’s smirk broadening. “Mr. Avery, that wasn’t my phone you found. I don’t know how it got into my bag. This is mine,” I say, brandishing my iPhone in its melon-striped case. Honestly, you’d have to be clueless to bring a phone to Mr. Avery’s lab. He has a strict no-phone policy and spends the first ten minutes of every class rooting through backpacks like he’s head of airline security and we’re all on the watch list. My phone was in my locker, like always. “You too?” Addy turns to me so quickly, her blond shampoo-ad hair swirls around her shoulders. She must have been surgically removed from her boyfriend in order to show up alone. “That wasn’t my phone either.” “Me three,” Cooper chimes in. His Southern accent makes it sound like thray. He and Addy exchange surprised looks, and I wonder how this is news to them when they’re part of the same clique. Maybe überpopular people have better things to talk about than unfair detentions. “Somebody punked us!” Simon leans forward with his elbows on the desk, looking spring-loaded and ready to pounce on fresh gossip. His gaze darts over all four of us, clustered in the middle of the otherwise empty classroom, before settling on Nate. “Why would anybody want to trap a bunch of students with mostly spotless records in detention? Seems like the sort of thing that, oh, I don’t know, a guy who’s here all the time might do for fun.” I look at Nate, but can’t picture it. Rigging detention sounds like work, and everything about Nate--from his messy dark hair to his ratty leather jacket--screams Can’t be bothered. Or yawns it, maybe. He meets my eyes but doesn’t say a word, just tips his chair back even farther. Another millimeter and he’ll fall right over. Cooper sits up straighter, a frown crossing his Captain America face. “Hang on. I thought this was just a mix-up, but if the same thing happened to all of us, it’s somebody’s stupid idea of a prank. And I’m missing baseball practice because of it.” He says it like he’s a heart surgeon being detained from a lifesaving operation. Mr. Avery rolls his eyes. “Save the conspiracy theories for another teacher. I’m not buying it. You all know the rules against bringing phones to class, and you broke them.” He gives Simon an especially sour glance. Teachers know About That exists, but there’s not much they can do to stop it. Simon only uses initials to identify people and never talks openly about school. “Now listen up. You’re here until four. I want each of you to write a five-hundred-word essay on how technology is ruining American high schools. Anyone who can’t follow the rules gets another detention tomorrow.” “What do we write with?” Addy asks. “There aren’t any computers here.” Most classrooms have Chromebooks, but Mr. Avery, who looks like he should have retired a decade ago, is a holdout. Mr. Avery crosses to Addy’s desk and taps the corner of a lined yellow notepad. We all have one. “Explore the magic of longhand writing. It’s a lost art.” Addy’s pretty, heart-shaped face is a mask of confusion. “But how do we know when we’ve reached five hundred words?” “Count,” Mr. Avery replies. His eyes drop to the phone I’m still holding. “And hand that over, Miss Rojas.” “Doesn’t the fact that you’re confiscating my phone twice give you pause? Who has two phones?” I ask. Nate grins, so quick I almost miss it. “Seriously, Mr. Avery, somebody was playing a joke on us.” Mr. Avery’s snowy mustache twitches in annoyance, and he extends his hand with a beckoning motion. “Phone, Miss Rojas. Unless you want a return visit.” I give it over with a sigh as he looks disapprovingly at the others. “The phones I took from the rest of you earlier are in my desk. You’ll get them back after detention.” Addy and Cooper exchange amused glances, probably because their actual phones are safe in their backpacks. Mr. Avery tosses my phone into a drawer and sits behind the teacher’s desk, opening a book as he prepares to ignore us for the next hour. I pull out a pen, tap it against my yellow notepad, and contemplate the assignment. Does Mr. Avery really believe technology is ruining schools? That’s a pretty sweeping statement to make over a few contraband phones. Maybe it’s a trap and he’s looking for us to contradict him instead of agree. I glance at Nate, who’s bent over his notepad writing computers suck over and over in block letters. It’s possible I’m overthinking this. Cooper Monday, September 24, 3:05 p.m. My hand hurts within minutes. It’s pathetic, I guess, but I can’t remember the last time I wrote anything longhand. Plus I’m using my right hand, which never feels natural no matter how many years I’ve done it. My father insisted I learn to write right-handed in second grade after he first saw me pitch. Your left arm’s gold, he told me. Don’t waste it on crap that don’t matter. Which is anything but pitching as far as he’s concerned. That was when he started calling me Cooperstown, like the baseball hall of fame. Nothing like putting a little pressure on an eight-year-old. Simon reaches for his backpack and roots around, unzipping every section. He hoists it onto his lap and peers inside. “Where the hell’s my water bottle?” “No talking, Mr. Kelleher,” Mr. Avery says without looking up. “I know, but--my water bottle’s missing. And I’m thirsty.” Mr. Avery points toward the sink at the back of the room, its counter crowded with beakers and petri dishes. “Get yourself a drink. Quietly.” Simon gets up and grabs a cup from a stack on the counter, filling it with water from the tap. He heads back to his seat and puts the cup on his desk, but seems distracted by Nate’s methodical writing. “Dude,” he says, kicking his sneaker against the leg of Nate’s desk. “Seriously. Did you put those phones in our backpacks to mess with us?” Now Mr. Avery looks up, frowning. “I said quietly, Mr. Kelleher.” Nate leans back and crosses his arms. “Why would I do that?” Simon shrugs. “Why do you do anything? So you’ll have company for whatever your screw-up of the day was?” “One more word out of either of you and it’s detention tomorrow,” Mr. Avery warns. Simon opens his mouth anyway, but before he can speak there’s the sound of tires squealing and then the crash of two cars hitting each other. Addy gasps and I brace myself against my desk like somebody just rear-ended me. Nate, who looks glad for the interruption, is the first on his feet toward the window. “Who gets into a fender bender in the school parking lot?” he asks. Bronwyn looks at Mr. Avery like she’s asking for permission, and when he gets up from his desk she heads for the window as well. Addy follows her, and I finally unfold myself from my seat. Might as well see what’s going on. I lean against the ledge to look outside, and Simon comes up beside me with a disparaging laugh as he surveys the scene below. Two cars, an old red one and a nondescript gray one, are smashed into each other at a right angle. We all stare at them in silence until Mr. Avery lets out an exasperated sigh. “I’d better make sure no one was hurt.” He runs his eyes over all of us and zeroes in on Bronwyn as the most responsible of the bunch. “Miss Rojas, keep this room contained until I get back.” “Okay,” Bronwyn says, casting a nervous glance toward Nate. We stay at the window, watching the scene below, but before Mr. Avery or another teacher appears outside, both cars start their engines and drive out of the parking lot. “Well, that was anticlimactic,” Simon says. He heads back to his desk and picks up his cup, but instead of sitting he wanders to the front of the room and scans the periodic table of elements poster. He leans out into the hallway like he’s about to leave, but then he turns and raises his cup like he’s toasting us. “Anyone else want some water?” “I do,” Addy says, slipping into her chair. “Get it yourself, princess.” Simon smirks. Addy rolls her eyes and stays put while Simon leans against Mr. Avery’s desk. “Literally, huh? What’ll you do with yourself now that homecoming’s over? Big gap between now and senior prom.” Addy looks at me without answering. I don’t blame her. ­Simon’s train of thought almost never goes anywhere good when it comes to our friends. He acts like he’s above caring whether he’s popular, but he was pretty smug when he wound up on the junior prom court last spring. I’m still not sure how he pulled that off, unless he traded keeping secrets for votes. Simon was nowhere to be found on homecoming court last week, though. I was voted king, so maybe I’m next on his list to harass, or whatever the hell he’s doing. “What’s your point, Simon?” I ask, taking a seat next to Addy. Addy and I aren’t close, exactly, but I kind of feel protective of her. She’s been dating my best friend since freshman year, and she’s a sweet girl. Also not the kind of person who knows how to stand up to a guy like Simon who just won’t quit. “She’s a princess and you’re a jock,” he says. He thrusts his chin toward Bronwyn, then at Nate. “And you’re a brain. And you’re a criminal. You’re all walking teen-movie stereotypes.” “What about you?” Bronwyn asks. She’s been hovering near the window, but now goes to her desk and perches on top of it. She crosses her legs and pulls her dark ponytail over one shoulder. Something about her is cuter this year. New glasses, maybe? Longer hair? All of a sudden, she’s kind of working this sexy-nerd thing. “I’m the omniscient narrator,” Simon says. Bronwyn’s brows rise above her black frames. “There’s no such thing in teen movies.” “Ah, but Bronwyn.” Simon winks and chugs his water in one long gulp. “There is such a thing in life.” He says it like a threat, and I wonder if he’s got something on Bronwyn for that stupid app of his. I hate that thing. Almost all my friends have been on it at one point or another, and sometimes it causes real problems. My buddy Luis and his girlfriend broke up because of something Simon wrote. Though it was a true story about Luis hooking up with his girlfriend’s cousin. But still. That stuff doesn’t have to be published. Hallway gossip is bad enough. And if I’m being honest, I’m pretty freaked at what Simon could write about me if he put his mind to it. Simon holds his cup up, grimacing. “This tastes like crap.” He drops the cup, and I roll my eyes at his attempt at drama. Even when he falls to the floor, I still think he’s messing around. But then the wheezing starts. Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 20 mins",
            "FREE delivery February 27 - 28.",
            "Or fastest delivery February 21 - 23."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER • NAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY ENTERTAINMENT WEEKLY • BUZZFEED • POPCRUSH“Pretty Little Liars meets The Breakfast Club” (Entertainment Weekly) in this addictive mystery about what happens when five strangers walk into detention and only four walk out alive. Pay close attention and you might solve this.On Monday afternoon, five students at Bayview High walk into detention. Bronwyn, the brain, is Yale-bound and never breaks a rule. Addy, the beauty, is the picture-perfect homecoming princess. Nate, the criminal, is already on probation for dealing. Cooper, the athlete, is the all-star baseball pitcher. And Simon, the outcast, is the creator of Bayview High’s notorious gossip app. Only, Simon never makes it out of that classroom. Before the end of detention Simon's dead. And according to investigators, his death wasn’t an accident. On Monday, he died. But on Tuesday, he’d planned to post juicy reveals about all four of his high-profile classmates, which makes all four of them suspects in his murder. Or are they the perfect patsies for a killer who’s still on the loose?Everyone has secrets, right? What really matters is how far you would go to protect them.All the secrets of the Bayview Four will be revealed in the TV series now streaming on NBC's Peacock! And don’t miss the #1 New York Times bestselling sequel, One of Us is Next!",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Delacorte Press; Reprint edition (February 28, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1524714755"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1524714758"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 14+ years, from customers"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL730L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.44 x 0.84 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,093 in Books (See Top 100 in Books) #13 in Teen & Young Adult Mysteries & Detective Stories #15 in Teen & Young Adult Thrillers & Suspense (Books) #32 in Teen & Young Adult Contemporary Romance"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 42,535 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Praise for KAREN M. MCMANUS and the ONE OF US IS LYING series",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9309fac9-9fd4-4b51-9939-4f3d6a3674ec.__CR0,0,970,600_PT0_SX970_V1___.jpg"
                ]
            },
            {
                "media_text": "One of Us Is Lying One of Us Is Next: The Sequel to One of Us Is Lying One of Us Is Lying TV Series Tie-In Edition Karen M. McManus 2 Book Box Set Read the fast-paced story of the Bayview Four! Four teenager's lives unwind after being the only witnesses to their classmate's suspected murder. The electrifying sequel to One of Us Is Lying. A TV tie-in edition with a cover based on the Peacock series streaming now! One of Us Is Lying & One of Us Is Next",
                "media_link": []
            },
            {
                "media_text": "Two Can Keep a Secret The Cousins You'll Be the Death of Me Nothing More to Tell Don’t miss Karen McManus’s other pulse-pounding thrillers A small town begins to relive its dark past after a girl goes missing before homecoming. A gripping family drama where a trio of cousins uncover a trail of lies and betrayals. Three friends relive an epic ditch day, and it goes horribly—and fatally—wrong. Four years ago someone got away with murder. More terrifying is that they might be closer than anyone thinks.",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8d567d2-b8a0-4019-bb75-0c9d7df098b3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9309fac9-9fd4-4b51-9939-4f3d6a3674ec.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/abac7533-de40-4450-b988-7f583b1a493f.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e7ffe363-e2c4-4dee-a217-62855900bdb9.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1ceb308a-3a83-4bd7-936e-b79328bc76a9.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/37b0146e-32e7-420f-9d6b-a6b69ecf80f6.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4016b69b-2b3e-491e-afcc-fd47c28ce39c.__CR0,0,300,600_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/020d7860-fcee-43a6-a732-418b9c6baaa2.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/649e4e74-1d10-4745-85d3-bfdc346f461c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f824cee6-2296-4a05-b4c9-d006cc66093b.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ac4a6345-0462-4fc6-82d8-556d78f84fb8.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Noriko",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGJBX6WOMJ4VMK2RDMSIZGFNKNDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SA03IP9ZMOD2?ASIN=1524714755",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 26, 2018",
                "reviewTitle": "5.0 out of 5 stars Great, Suspenseful YA Mystery",
                "reviewText": "I think I went off on the wrong foot with this book; I wrongly and mistakenly assumed that this book wasn’t for me – boring, full of high school dramas and teenage angst which, to tell the truth, were not my thing at the moment.It indeed took a while for this book to grow on me. As I mentioned earlier, except for the first chapter where Simon, a notorious gossip mastermind of Bayview High, mysteriously died from a severe peanut allergy, I spent a huge chunk of the first half frustrated and feeling detached from the story. I knew the book was in the middle of build up, but what I thought endless, too detailed descriptions about the four suspects – the four students – and their backgrounds and emotional conflicts were a bit too much for me. I was expecting more of the mystery – whodunnit – elements (as this book is supposedly YA mystery), definitely NOT high school dramas involving drama kings and drama queens where they whine and go on and on about what they have done wrong. To be honest, I wasn’t remotely interested in such kind of stuff. It may sound harsh, but I was pretty close to giving up on this book.But I didn’t want to.So I tried to throw all my preconceived ideas about this book and start over with a clean slate, seeing this book as a mere YA contemporary rather than a YA mystery.And I’m glad to say, it worked. It actually took me another 20% of the book to get me fully invested in this book, it worked nonetheless. I think it was where a big secret of the Mr. Nice guy was finally out and how it leads to a debacle of his future, friendship and familial relationship. The grim undertone reeled me in the story in the true sense of the word – for the first time – and I realized this book might call for readers in the right frame of mind and being patient. Your opinions might differ from mine and you may have been hooked by this book straight away, but it wasn’t the case for me. It needed me to read this book with the same approach that I usually take when reading YA contemporary/romance.Anyways, from then onwards, I found this book pretty unputdownable; I enjoyed all the elements in this book. Friendship, budding romance, suspicion, and emotional struggles and guilt from what they have done. Such elements are really well-integrated and gelled with the main plot, and I definitely enjoyed the thrills and excitement as I was inching towards the end, as I got closer to the revelations to the whole plot.Although I might have made this book out to be devoid of the mystery elements earlier, it isn’t true. The disturbing and mysterious ‘Tumbler’ posts which were not ought to be published because of Simon’s death certainly got me curious to know who actually killed Simon. Was it either of the four students? Or is there an accomplice??The plot twist which I didn’t see it coming took me by surprise but this book doesn’t end there – there’s actually another important key to this murder case and I thought it was really well done. I read the last 30% in one sitting – I was kept on the edge of my seat, I couldn’t put it down.The characters, especially the main four characters are all well-fleshed out. Their issues, secrets and consternation from unexpectedly embroiled in the murder case are well delineated with the solid writing and alternating multiple POVs, getting me emotionally close to them. I especially enjoyed how the four characters begin to close ranks to get down to the bottom of the case, supporting each other despite the fact they were not really friends nor particularly close before it happened.When the story, or the situations surrounding the main character(s) spin out of control, multiple POV style works really well, giving readers enough glimpse of their emotional process and what is going on in their minds. It adds a lot of tension and intrigues, a sheer delight of reading. Karen M. McManus certainly pulled off in that regard.She’s also brilliant at messing with our emotions – getting our hopes up and then crushing them on the next second. I went through this agony especially in Bronwyn’s chapters. I personally Bronwyn and Cooper’s chapters are outstanding compared to the ones of the other two characters. I might be wrong, but I felt that way anyway.I appreciate this book ends on a light, hopeful note. The four characters have gone through their own nightmares and debacles, it has also made them stronger and be honest to themselves.This book left me with warm feelings, wondering what their future holds for them.Apart from the depictions of police procedural being pretty shoddy (I was like, ‘Come on, they couldn’t be this sloppy, could they?’), I am quite satisfied with this book.This is surprisingly emotionally charged, well-written book. I am glad I ended up liking this book in the end.Another lesson NOT to easily DNF a book; Story CAN pick up where you leave off.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "chelsea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESOHC3ADX77HEOWI3M6K4BGRXCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R355UOWK2GIWM8?ASIN=1524714755",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "4.0 out of 5 stars 4.5 star",
                "reviewText": "It was easy to read and a good pace. Information was revealed when it needed to be and didn’t leave you waiting for chapters before you found out why it mattered. It felt like you were part of the Bayview Four and trying to figure out how to “unframe” yourself. Great book overall!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Reading with FeFe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGN5JXX4KTWSB3DUC3F22KOOU55A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IE2X8YD3H7JJ?ASIN=1524714755",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Where were the books like this when I was a teenager?! SO GOOD!",
                "reviewText": "1st person/multi povNow I see why this was picked up and put on TV! When I say I could not stop myself from reading this book every second I had to spare I am not kidding. I haven't had as much time as I normally do to read here lately but as soon as I saw a chance to get a few more pages into the story I took it every single time. I really enjoyed how we see the events following that horrible day in detention play out through different perspectives but not all of them. Keeping some of the characters' point of view for certain parts of the story a mystery added this air of uncertainty as you try to unravel what actually happened and who could have been behind it. The friendships formed due to the bond they share by going through this situation together give me the \"found family\" feelings that keep me coming back to a book over and over. Then the twist in the plot and the truth being revealed was such a satisfying moment that it took the whole story to the next level for me. I am so excited to dive into the next in the series!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEY7MUGSSF4RJ43XI7CKXMABGPDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RTZGIVDOAT5TS?ASIN=1524714755",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great book, very engaging!",
                "reviewText": "Honestly I loved this book, such a great mystery book! I love the book twist at the end, I honestly didn’t see it coming",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Solange Le Gendre",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKP6IJQ6EKQMVHW2IGGUKOF3VBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15ZO9AH484FZG?ASIN=1524714755",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Page turner",
                "reviewText": "I don’t think I’ve ever read a YA thriller book before and this was marvelously written. Never guessed who the murderer was and was rooting for the romance. Actually looking forward to the sequel!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSK554LQJZ5SY6AV6FF3SGZGX4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJSWDY36QODUY?ASIN=1524714755",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "3.0 out of 5 stars I knew It!!!",
                "reviewText": "I hated that I knew who killed Simon from the beginning but for the most part the plot twist did catch me off guard. I was able to enjoy this book a lot more because it was told from multiple first person points of view, but I would have loved to have read about Simon from the days leading up to his murder. I love that there was a little romance along with some character development.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZGKKDWKXU3O2CQB5OWQNX4WGUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NBZJVJL5QFDG?ASIN=1524714755",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "4.0 out of 5 stars A nail biter",
                "reviewText": "There is nothing like a locked room mystery, especially one starring The Breakfast Club. Coming from the perspective of the kids, there are a lot of questions yet unanswered - like why was their teacher a technophobe - but the way the story unravelled was a ton of fun and kept me on the edge of my seat.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTHM2DRGKSJHS5VD33SSUC2RARQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DOSV7RU6OXZE?ASIN=1524714755",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Reread",
                "reviewText": "I'm totally rereading this so that I can go into the second one with no issues. I liked it the first time. I liked the story, I liked the characters, I liked everything having to do with this book 5/5 on Goodreads/Amazon/fable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "reanna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 11, 2023",
                "reviewTitle": "10/10",
                "reviewText": "Such a good book!! Absolutely loved it, kept me hooked all the way through, finished it within a couple days!! Ordered the next two - can’t wait to get them :)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Macy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "This book got me into reading and now i read all the time.",
                "reviewText": "I used to not like reading book, i used to get bored and distracted when reading. But this book got me into reading, i didnt get bored and read it in a few days, it such a good book for people who are getting into reading. I know read all the time mostly crime, thriller, and horror. Would 100% recommend this book to whoever want to start reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 4, 2024",
                "reviewTitle": "Bien",
                "reviewText": "Bien",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "roteHex",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 3, 2024",
                "reviewTitle": "Tolles Buch",
                "reviewText": "Ich hatte mir das Buch schon in Deutsch gekauft und meine Tochter animiert, dies zu lesen ....Mir hat es sehr gut gefallen. Meiner Tochter eigentlich auch.Jetzt wurde das Buch für den Englisch Unterricht ausgewählt ... auch sehr gut zu lesen ....Die Klasse fand das Buch echt gut",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VdRx_Kpu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 5, 2023",
                "reviewTitle": "Perfect",
                "reviewText": "Perfect, thank you so much !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}