{
    "remaining_requests": 1076,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Brass-Verdict-Novel-Lincoln-Lawyer-ebook/dp/B0018QOYKC",
    "body": {
        "name": "The Brass Verdict (A Lincoln Lawyer Novel Book 2)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Brass-Verdict-Novel-Lincoln-Lawyer-ebook/dp/B0018QOYKC",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81mdV8JnqbL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michael Connelly",
            "link": "https://www.amazon.com/Michael-Connelly/e/B000APETH0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 23258,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157305011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0018QOYKC"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Little, Brown and Company (September 18, 2008)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 18, 2008"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1207 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 433 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,379 in Kindle Store (See Top 100 in Kindle Store) #77 in Legal Thrillers (Kindle Store) #231 in Police Procedurals (Books) #251 in Police Procedurals (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 23,258 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kevin WALD",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKHDVFCTUUCUJBIX62OMYYRE3TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFMT8PJEYEVWQ?ASIN=B0018QOYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars small detail",
                "reviewText": "My only minor quibble was I wondered whether jurors aren’t fingerprinted, which would make it impossible for someone to fake his way onto a jury.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. M. Cain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUJML3UZZV3OF6JKODIOQ63IGAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RT622XQKP8JH?ASIN=B0018QOYKC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Excellent story telling.",
                "reviewText": "Connelly crafts a tight story line with compelling characters. This is book two in the series and between Connellys ability to craft both story and characters, he makes me want to continue the journey with him.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shackelford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFSTA7IUCHEZ6JVN6S6WNB554U4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HLOMVNDYXWJF?ASIN=B0018QOYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars Hard to put down",
                "reviewText": "I have read all the Bosh stories and wasn’t sure I would like the lawyer books but this one was fantastic! Makes you think, justice is not always black and white, there is a lot of gray.Anyway it’s a great story and I highly recommend it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERXYIPJJUCAM6FLGKW3KTQCBUFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DEF981WA3851?ASIN=B0018QOYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Enjoyable read",
                "reviewText": "I watched the Netflix series before reading this novel. While the show updated the concept, it uses more or less all of the same twists, so I didn't find it as enjoyable to read except to gain more insight into Mickey and Walter. However, while treating it as its own independent piece of work respective of the show, it's a pretty solid read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "writer 1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQCPRPUUBX7ITYPFJMIE4MVIK3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1YNBMN85GLZ4T?ASIN=B0018QOYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Brass. Verdict is a Winner",
                "reviewText": "Great story, compelling Plot and believable characters. My intrest piqued with each turn of the page. Highly recommend Brass Verdict.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCI7WHKQ3VL4XPWU2PMUC4FY7UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A7SGUQMUPXOA?ASIN=B0018QOYKC",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 10, 2014",
                "reviewTitle": "4.0 out of 5 stars A treat for Michael Connelly fans!",
                "reviewText": "The second installment of the Lincoln Lawyer series, \"The Brass Verdict\" is sure to please fans of Michael Connelly. This book contained his two main characters, Mickey Haller and Harry Bosch, as well as a small appearance by crime beat reporter Jack McEvoy.The book starts in 1992, when Mickey Haller was still at the public defender's office. Involved in a double murder trial, Haller has evidence that the prosecutor, Jerry Vincent, used some underhanded tactics in the trial. Vincent, knowing his career as a prosecutor would be finished if the information came to light, tried to make a deal with Mickey. However Haller went for the jugular and got his client an acquittal. Fast forward 15 years and believe it or not, Vincent and Haller are friends and stand in for each other when one cannot make it to court. Apparently, leaving the prosecutor's office was the best thing ever for Vincent's pocket book. He never would have been this well off if he had stayed.Haller has taken a one year hiatus from practicing law (we later find for a drug dependency problem due to being shot in the previous book) and is thinking about coming back to work slowly when he is called into chief judge Mary Holder's office. She informs Mickey that Jerry Vincent had been murdered the previous night and that Jerry had named Mickey to inherit his law practice. Among Vincent's cases was the high profile murder case of studio mogul Walter Elliot, who stood accused of killing his wife and her lover at his Malibu beach house.These cases, and especially the Elliot case, would set Mickey up quite nicely, although it was not really the slow comeback he had planned. He meets Harry Bosch, who is lead investigator on the Vincent murder, and soon begins their strange love-hate relationship. Vincent kept all his trial strategy on his laptop, along with hard copies in his briefcase, both of which were stolen after his murder. Mickey was forced to reconstruct Vincent's calendar from the case files in Vincent's office. Bosch is certain the key to Vincent's killing lies in one of the case files, but Mickey is unable (and unwilling) to breach the attorney-client privilege.The main focus of the book was in fact the Elliot murder case. However, there was another case Mickey thought was somehow connected. He racked his brain until he finally found it. Also interesting was his handling of a one time professional surfer accused of theft, who Mickey ultimately hired to drive his Lincoln. Bosch's investigation of Vincent's murder was seamlessly integrated into the plot making this book a treat for both Mickey Haller and Harry Bosch fans.I took off one star because the ending came out of nowhere. Mickey had found the person pulling the strings with information received from Cisco, his investigator. This is fine except that information was never shared with the reader until Haller dropped his bomb. I like to try to solve mysteries along with the protagonist. I am not always good at it, but at least I like to give it a try. I felt cheated on this one because there was little chance of solving this without the crucial piece of evidence dropped on us at the end. I will admit it was a shocking ending, but not the way I prefer it being presented.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cynthia K. Robertson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI7YILO4JRFKRXQXGDBHDIYZVVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32LU6R5CKCZD3?ASIN=B0018QOYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 27, 2008",
                "reviewTitle": "5.0 out of 5 stars Riveting...",
                "reviewText": "There is not a day that goes by that I don't find some time to read. But once in a great while, I find a book that is so riveting that I plant myself in a comfortable spot and abdicate all other responsibilities until I'm finished. The Brass Verdict by Michael Connelly is just such a book. In fact, it might be one of the best mysteries I have read--ever.The Brass Verdict has been touted as a combination of Connelly's Harry Bosch series with Michael (Mickey) Haller, a lawyer who has appeared in other books and who made the big time in the best-seller, The Lincoln Lawyer. Instead of being strictly a police drama, The Brass Verdict is written in the first person (Haller) and is more of a legal thriller. In fact, Bosch is a rather shadowy figure in The Brass Verdict.Haller has had a year-long sabatical as he recovers from being gut-shot, as well as an addiction to pain killers and alcohol. But instead of starting off slowly, Haller has 31 cases dumped in his lap when fellow lawyer Jerry Vincent is murdered. One of those cases is the trial of the decade. Hollywood movie mogul Walter Elliott is accused of killing is wife and her lover. This is one of those high-stakes, high-paying cases that defense attorneys only dream of. LAPD detective Harry Bosch is on the case of Vincent's murder, and he believes that one of those 31 cases could hold the secret to the lawyer's death. But Haller and Bosch are reluctant to share information as they're sitting on opposite sides of the law.When Vincent was murdered, the killer took Vincent's laptop and calendar. So Haller must try to reconstruct his cases before proceeding. But as he accomplishes this, he discovers that Vincent was involved in some very shady dealings. But the bad news is that if the killer thinks that Haller knows what Vincent was up to, that his life is also in danger. Haller and Bosch reluctantly find themselves on the same team as they try to get to the bottom of this mystery.Connelly is one of the best writers today--mystery or otherwise. From the very first page, he has the reader hooked. \"Everybody lies. Cops lie. Lawyers lie. Witnesses lie. The victims lie. A trial is a contest of lies.\" But the job of the defense team is to be patient, waiting for a lie, \"the one you can grab on to and forge like hot iron into a sharpened blade. You then use that blade to rip the case open and spill its guts out on the floor.\" Connelly also continues his love-hate relationship with Los Angeles. This city \"was the kind of place where everybody was from somewhere else and nobody really dropped anchor. It was a transient place. People drawn by the dream, people running from the nightmare.\" In terms of the writing, Connelly writes from experience. He has a genuine feel for both law enforcement and the courts. Also, the plot has enough twists and turns to make you dizzy.The Brass Verdict is Connelly's 20th book, and it's great to know that this is one of his best. Unlike many authors, he not getting older, he's just getting better.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOWDK5SRKPJ4BAAH6FHGMDR2ZTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JLR6B3MSG65D?ASIN=B0018QOYKC",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book",
                "reviewText": "The story line is very good and it’s well written. Michael Connelly and Bosch are the best-bring on more books and tv series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sailnsun",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2022",
                "reviewTitle": "Love the Author! Love the Book!",
                "reviewText": "It arrived on time. I bought a new book and I received a new book. This is the first of the Lincoln Lawyer series. I was unable to buy this book from our local bookstore ... in store or online, so I resorted to searching on Amazon and found it. Same price as it would have been in the bookstore, if they had it in stock. My husband bought me the second book in the series for Christmas. It was the first time I had read a Michael Connelly book. It captivated my attention first paragraph and I did not want to put it down. Now I'm half way through this book, I received it 2 days ago, and began it yesterday. I have bought so many Heather's picks, and New York Bestsellers, only to struggle reading through the first 4 chapters, and finally I put it down and never pick it up again, because it just doesn't grab me. As I said, first paragraph, in the first book and this second book grabs my attention and holds it. I love it and would highly recommend this book and this author!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WENVOENIAN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 2, 2024",
                "reviewTitle": "Great story from Michael Connelly",
                "reviewText": "Michael Connelly always keeps you guessing with his stories and this one is another of them. I would like to say that this story is different to the serialised episodes on TV. I was disappointed in this and from now I will read the book before watching the next series of Mickey Haller on TV.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Supratik Biswas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 2, 2023",
                "reviewTitle": "A true page turner",
                "reviewText": "Worth every penny,a good followup to the first book in the Lincoln lawyer series.The introduction of Bosch is an icing on the cake and we can't wait for more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CHRISTINA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on September 25, 2022",
                "reviewTitle": "Ottimo",
                "reviewText": "Ottimo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on August 29, 2022",
                "reviewTitle": "Très bien.",
                "reviewText": "Livre acheté neuf, arrivé rapidement en Colissimo et en parfait état.Deuxième tome de la série des Lincoln Lawyer, mélange de policier et monde des tribunaux américains, style très vivant et bon suspense.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}