{
    "remaining_requests": 1273,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Bad-Summer-People-A-Novel/dp/B0BFG848TH",
    "body": {
        "name": "Bad Summer People: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Bad-Summer-People-A-Novel/dp/B0BFG848TH",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41uf1xk98PL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Emma Rosenblum",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Emma+Rosenblum&search-alias=audible"
        },
        "brand": "Emma Rosenblum&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 11867,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "This program includes a bonus conversation between the author and Chandler Baker, author of Cutting Teeth.\"Narrator January LaVoy's range is highlighted in this audiobook about a single summer on Fire Island when gossip among vacationers and townies is ratcheted up to new levels.\"- AudioFile Emma Rosenblum's Bad Summer People is a whip-smart, propulsive debut about infidelity, backstabbing, and murderous intrigue, set against an exclusive summer haven on Fire Island.\"This roiling beach community satire serves up wicked, clever fun that is White Lotus sharp.\" —Kevin Kwan, New York Times bestselling author of Crazy Rich Asians and Sex and VanityNone of them would claim to be a particularly good person. But who among them is actually capable of murder?Jen Weinstein and Lauren Parker rule the town of Salcombe, Fire Island every summer. They hold sway on the beach and the tennis court, and are adept at manipulating people to get what they want. Their husbands, Sam and Jason, have summered together on the island since childhood, despite lifelong grudges and numerous secrets. Their one single friend, Rachel Woolf, is looking to meet her match, whether he’s the tennis pro—or someone else’s husband. But even with plenty to gossip about, this season starts out as quietly as any other.Until a body is discovered, face down, off the side of the boardwalk.Stylish, subversive, and darkly comedic, this is a story of what's lurking under the surface of picture-perfect lives in a place where everyone has something to hide.A Macmillan Audio production from Flatiron Books. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b?ie=UTF8&node=10134"
            },
            {
                "name": "Family Life",
                "link": "https://www.amazon.com/Family-Life-Fiction/b?ie=UTF8&node=11047977011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 48 minutes"
            },
            {
                "name": "Author",
                "value": "Emma Rosenblum"
            },
            {
                "name": "Narrator",
                "value": "January LaVoy"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 23, 2023"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BFG848TH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,702 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #84 in Domestic Thrillers (Audible Books & Originals) #257 in Family Life Fiction (Audible Books & Originals) #486 in Domestic Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Carla Wilson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBXXTBDXKPUNECAX24GT3AJS43Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RJQM1W0FHS5W?ASIN=B0BFG848TH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "4.0 out of 5 stars Fun read--diabolical rich people",
                "reviewText": "Every character in this book is unlike able and yet, you keep reading to see what they do, until you're kind of rooting for some of them. If you like White Lotus, you'll like this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFWC6XGF42UMTFBR3KPM3VE36IA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R9SRL42M1VQ8G?ASIN=B0BFG848TH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "What a surprise ending!!! I was totally shocked, mouth hanging wide open shocked.I will definitely be looking at more Emma Rosenblum novels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Thornberg",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEVA5XA2IYR43M5EV4EC4SJX2FHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1P0A9B9Z95GPX?ASIN=B0BFG848TH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2023",
                "reviewTitle": "3.0 out of 5 stars Rich people behaving badly",
                "reviewText": "I went into this one with high hopes with the gorgeous cover that screams juicy beach read and the Fire Island setting, which seems to be the hot place for summer novels this year, and a special favorite of mine as my husband grew up as a year rounder in the town next to Saltaire so I’m familiar with the area, if not the summer people themselves. I ended up liking it, but not loving it.The story takes place over the course of a summer, when the city people flock to their Fire Island houses for a few months of idyllic relaxed beach life, biking around town (no cars allowed, one of my favorite island features!), drinking freely, and in the case of this story, behaving very badly. It starts with a dead body, and then veers off into the gossipy group for so long you sort of forget someone dies until you get to the end and the plot heads back in that direction.There are a lot of characters to keep track of, and the story alternates between a lot of different perspectives so it gets a bit confusing. And they are basically all doing some form of lying, cheating, and stealing throughout, not a redeeming quality in sight. It also overlaps the timeline to share the story of the same occurrence from different perspectives, which took me a bit to pick up on. But still, I wanted to see how it all played out, and I did like that all the questions were answered by the end.Pick this one up if you like beach reads with a large dose of scandalous behavior, skip if if you’re not a big fan of cheating and lying themes.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rose",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFPFCEKNOHQ4LLPIREKEKW2L4QQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3R5IJEHO482JM?ASIN=B0BFG848TH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Definitely a beach read.",
                "reviewText": "This kept me entertained throughout even though it’s a pretty shallow story. Many, many characters and all with flawed personalities. Not sure so many people were needed and it did prove a bit confusing at times. I think the author was trying for some exciting twists at the end, but they fell flat. More like one-upmanship than actual plot twists. The author’s use of “button-down” to describe everyone’s shirts drove me crazy. Not sure why the author was so in love with that word—it proved distracting. Recommend as a beach read, because it was a quick read with little substance.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shree",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF74PUVLK3YOSERCMTFIOLNVYTGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BOJC5LC4JQW?ASIN=B0BFG848TH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 7, 2024",
                "reviewTitle": "5.0 out of 5 stars so fun to read",
                "reviewText": "like a white lotus episode that takes place in a hamptons adjacent town; the multiple povs were very fun and i’m always a fan of a good snowball effect",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHPMS5YVT74RENJNL5DOCNSL7PA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SSNYB0BCAR8K?ASIN=B0BFG848TH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 2, 2023",
                "reviewTitle": "3.0 out of 5 stars A Kinky Cozy Mystery",
                "reviewText": "“Bad Summer People” is difficult to classify. Originally marketed as “a steamy beach read,” the novel is a murder mystery set in the town of Salcombe on Fire Island.The action begins with the discovery of a body, at the end of the summer, and then author Emma Rosenblum shifts the narrative back to June and elaborates the events that led to the death.Lauren Parker, Robert Heyworth, Rachel Woolf, Jen Weinstein, Susan Steinhagen, Jason Parker, San Weinstein, Larry Higgins… “Bad Summer People” is told through multiple points of view and, therefore could fit into the mystery subgenre “cozy.” Because there’s a lot of sex, let’s settle on “kinky cozy.”Switching from one narrator to another is a distraction. Particularly since none of them is appealing.“Bad Summer People,” a kinky cozy murder mystery, where the sanest person is the one who dies.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BooksAreWings",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSEH6IAAJYBO2CUD3UUVPS3JKEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26P4SBPQ9PCAU?ASIN=B0BFG848TH",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2023",
                "reviewTitle": "2.0 out of 5 stars Plotless and unsatisfying....Not worth your time. Even beach time.",
                "reviewText": "Disclosure: bought the book because I love Fire Island and wanted to read a novel set there, plus, all the rave reviews. Let me save you the time I just wasted.Wow, what a disappointment! Sure, Bad Summer People gives an overview of life in one of the preppiest towns on FI, Saltaire (here called Salcombe). Other than that...nada.This is one of those books where every character is despicable: arrogant, posturing guys; vapid, wealthy women; desperate social climbers (everyone).BSP opens with the discovery of a body and then jumps back in time several months.The first 3/4 or so of the ENTIRE BOOK is waiting to find out who died (the cleverest part of this book is the teasing of possible murder every time a character is walking home alone- unfortunately all cleverness stops there).There is literally zero further plot. People gossip, do bad things, drink a lot. There's a lot of brand name dropping (not in the fun way), and weirdly ageist/misogynistic stuff like describing 35-year-old women as \"well-preserved\" and milking a sad, desperate singleton character who's all of 42. (Admittedly the author is pretty savage on the guys as well.)There is no whodunit here, no suspense, and basically no fun. (Also no copy editing - the grammar is messy to the point of atrocious.) The ending is as meh as meh can be.This is not the entertaining beach read it's sold as; it's a quick and boring slog through the world's dullest mean beach town. You are better off with a frosé and a tabloid than Bad Summer People.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dee P.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFXU7PLRG3NKWMJRLC4Q2O7UG66Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OGOD6XS2KGKL?ASIN=B0BFG848TH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "4.0 out of 5 stars Who do you root for?",
                "reviewText": "It was a good story with lots of twists and turns.But I'm really tired of books that are filled with loathsome characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LadySausage",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 6, 2023",
                "reviewTitle": "Captivating summer read",
                "reviewText": "Didn’t know what to expect but really enjoyed the writing style, plot and the interconnection of the characters. Super.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 13, 2023",
                "reviewTitle": "Longwinded story",
                "reviewText": "I felt the story fell apart in the middle, but I finished the book in a hope it would take an unexpected turn or have an interesting twist. Unfortunately, I found the ending disappointing. It seemed farfetched and unimaginative.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}