{
    "remaining_requests": 1151,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-The-September-House/dp/B0BR8L2F14",
    "body": {
        "name": "The September House",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-The-September-House/dp/B0BR8L2F14",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51DZF6apB L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Carissa Orlando",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Carissa+Orlando"
        },
        "brand": "Carissa Orlando",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 2344,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "“Why run from a haunted house when you can stay and ignore the ghosts? Just when you thought you'd seen everything a haunted house novel could do, The September House comes along and delivers an eerie, darkly funny, and emotionally grounded book about the ghosts that haunt houses and marriages.\"– Grady Hendrix, New York Times bestselling author of How to Sell a Haunted House A woman is determined to stay in her dream home even after it becomes a haunted nightmare in this thoroughly enjoyable, twisty, and layered debut novel. When Margaret and her husband Hal bought the large Victorian house on Hawthorn Street—for sale at a surprisingly reasonable price—they couldn’t believe they finally had a home of their own. Then they discovered the hauntings. Every September, the walls drip blood. The ghosts of former inhabitants appear, and all of them are terrified of something that lurks in the basement. Most people would flee. Margaret is not most people. Margaret is staying. It’s her house. But after four years Hal can’t take it anymore, and he leaves abruptly. Now, he’s not returning calls, and their daughter Katherine—who knows nothing about the hauntings—arrives, intent on looking for her missing father. To make things worse, September has just begun, and with every attempt Margaret and Katherine make at finding Hal, the hauntings grow more harrowing, because there are some secrets the house needs to keep. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            },
            {
                "name": "Ghosts",
                "link": "https://www.amazon.com/Ghosts-Horror-Genre-Fiction-Books/b/ref=dp_bc_aui_C_5?ie=UTF8&node=9810"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 31 minutes"
            },
            {
                "name": "Author",
                "value": "Carissa Orlando"
            },
            {
                "name": "Narrator",
                "value": "Kimberly Farr"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 05, 2023"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BR8L2F14"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,617 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #6 in Ghost Horror Fiction #11 in Ghost Fiction #14 in Ghost Thrillers"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6TIYUDF3T5IOIGU26UL34IZOKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BENKH3LP1UZL?ASIN=B0BR8L2F14",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Shock, humour, fear, comfort…it has it all!",
                "reviewText": "The September House is one of the most original thrillers I’ve read in a while. This stunning character-driven story is an emotional roller-coaster: shock, humour, fear, comfort…it has it all!We follow the story of Margaret, who lives in a haunted house with her husband, Hal. Or at least she did, until Hal went missing. Throughout the years of their stay in the house, the couple realized that something wasn’t quite right with the beautiful Victorian mansion—what with the walls bleeding, the endless screaming at night and the unwanted ghostly visitors that would literally take a chomp out of your flesh if you gave them a chance. Eventually, the couple’s only choices were to leave the house, or make peace with it and follow the rules of the entity controlling their lives. Margaret chose the latter. When Hal goes missing, their daughter, Katherine, wants to come stay in the house to investigate her father’s strange vanishing incident…only she isn’t aware that the house is haunted, and Margaret will try everything in her power to stop her daughter from finding out.What stood out to me while reading The September House was the amazing character work. The three main characters are Margaret, Katherine and Fredericka:Margaret could be a truly frustrating character at times—but for valid reasons. Her voice was balanced and well developed, with well-placed humour combined with a sad reality of loneliness and trauma. Watching her process her ever-changing environment and the changes in herself was fascinating, making her feel so very realistic. It is especially interesting watching her live in denial, building coping mechanisms that the reader sees straight through:“This house was everything I’d ever wanted. Sure, it wasn’t perfect, but sometimes it actually was. Or at least as close as anything could come to perfect in this life, which admittedly was not very close…I knew how to survive here, and I always had the sense that if…I just played by the rules well enough, I could make it into a perfect home…I loved this house. And you didn’t give up on the things you loved.”(Page 191)Katherine was so annoying—in a good way! She helped drive the plot forward by placing constant conflict in her mother’s life, forcing Margaret to question her beliefs and the lies to tells herself to survive. It was Katherine’s character arc that felt the strongest in the end.Fredericka was my favourite character, adding fun and a good deal of sarcasm to the story. I still catch myself thinking “Needs must when the devil drives” (Page 16) whenever an unpleasant situation that I cannot avoid arises.The story setting was FANTASTIC. Bleeding walls? Victorian décor? Ghosts who snap and love and murder? Hell yes! The setting contributed wonderfully to the overall moodiness and creepy vibes of the book.As for the plot: creative, unpredictable and filled with strong moral codes. I really enjoyed the pace of the story; it built up to an utter wild ride towards the end. Those last few chapters were hectic in all the best ways!What I loved and appreciated most about this book is the theme of finding beauty in darkness:“A leopard cannot change his spots,” she (Fredericka) said before moving into the living room to fluff the pillows.“Can’t imagine why he’d want to,” I (Margaret) thought. “The spots are part of what makes leopards so beautiful.”(Page 106)The September House inspires one to carry on despite difficult situations, but also evokes a warning of becoming too comfortable with the darkness.5 stars and one of my new favourite books!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Taylor Hathcock",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXD54YEQIKR44DIVIDEPMEIEINQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BXZYOSM0PL8L?ASIN=B0BR8L2F14",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "4.0 out of 5 stars A fascinating ghost story with an unexpected twist",
                "reviewText": "I have to say I did not expect this book to be all that it was. I thought it was just going to be your basic ghost/haunted house story... and boy it was not that at all. It was honestly a masterpiece in the way it tackled some tough topics. Margaret may be one of my new favorite characters of all time. She has had a past that is far from ideal and it shows in that she's just like \"oh cool we have ghosts.\" I loved how Margaret had developed these rules for living with the ghosts, an easy task for her considering her entire relationship with Hal is built on these rules. We get a sense pretty early on in the story that Margaret knows where Hal is given her lack of concern when Katherine comes searching for him. I think it was interesting to see how both Katherine and Margaret were victims of Hal's abuse but reacted in such different ways. Margaret has made her life about rules and following them and Katherine has become this angry almost child... at least seen through Margaret's eyes. I think the ghost element was done really well in this book. It was the perfect level of creepy and wait a minute.. is this even real? I think the author took an interesting tactic, because once Katherine comes into the picture we start to question whether or not Margaret is even sane.. It's this beautiful balance of wait a minute what to I even believe is happening right now. I absoultely loved that I only knew one element of this book... and in all fairness it was a pretty obvious one. This whole book took me by surprise to be honest. I adored Margaret even when I was questioning her sanity, because I was like well yeah no wonder. I was rooting for her the whole time. She is probably one of the strongest character's that I have seen written in a long time. And I loved the little ways the author juxtaposed her strength compared to Hal. I went through about 95 theories in the last three chapters of this book. It was insane. The only issue I had was that I wished a few other things had been cleared up or explained more at the end. But overall, this is a killer horror.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Jordan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJOMXQ5EDEAMYTHX55GYDBHKDUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R11W6UE2XPNHTA?ASIN=B0BR8L2F14",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 26, 2023",
                "reviewTitle": "3.0 out of 5 stars Prim-like Horror",
                "reviewText": "The only thing I admired about this book was Margret's nonchalance with all the horror. It definitely took me by surprise and even made me laugh in places, this woman who was so willing to put up with well-- everything. Casually ducking bitey ghost children and cleaved housekeepers. But everything else about the book was weak and slow. Not original with no sense of urgency or stakes. Kind of just read it to get it over with. A horror story with horror that was told by a prim British woman over tea:\"I daresay that waterfall of blood was positively ghastly this morning. Spent all my energy cleaning it. Oh and did I tell you about the gobbets of meat in the sink? Good heavens, I'll be inhaling the smell of pennies and tin for weeks!\"I can't believe I paid full kindle price for this. Refreshingly boring for a horror novel?",
                "reviewVotes": "14 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amyrinthe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBYN35QJ646UYJFJ6FFWYSLP36Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3UTO8QMLSH9HK?ASIN=B0BR8L2F14",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Shockingly, Outrageously Good!!!",
                "reviewText": "I've been reading horror for 30 years. This book is an absolute stand-out. If you're a fan of the haunted house sub-genre, READ THIS BOOK!!!The September House is unlike any haunted house book I've ever read - it throws the formula out the window and replaces it with deep, thoughtful story-telling, smart pacing, laugh-out-loud dark humor, fantastic characters, and some of the scariest scenes I've ever read.Buy this book!!! And buy a few friends copies, too. You are definitely going to want to talk about this one when you're done reading it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Chelseybuns",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 17, 2023",
                "reviewTitle": "Could not stop reading",
                "reviewText": "This book was a really great horror book for people who aren’t great with horror. The plot was intense and clever, the characters were endearing, and it was filled with a kind of dry humour that I found really charming. A+ would read again.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 16, 2024",
                "reviewTitle": "Margaret really loves that house…",
                "reviewText": "Absolutely loved this book and could not put it down. Spooky, horror, thriller, a wee bit comedic. If you like ghoulish horror and twists and turns in a plot, this is definitely worth a read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 26, 2023",
                "reviewTitle": "Fantastic horror novel!",
                "reviewText": "This was such a fantastic horror novel. I found the genuine and sympathetic and her whole situation really worked for me. I was also often genuinely scared which isn't a given when it comes to horror. I loved that the author was able to blend multiple genres in a way that really fit for me and I wasn't surprised to find out that the author has her doctorate in psychology as many of the psychological aspects of the story really rang true. I can't wait for her next book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon customer :)",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 19, 2023",
                "reviewTitle": "I liked it",
                "reviewText": "It was good , i actually liked it.Being a bookworm and fan of gothic books it was really a good one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "adelinemtl5",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 2, 2023",
                "reviewTitle": "loved it!",
                "reviewText": "I couldn’t put this book down!! I loved Margaret, loved how well it was written. One of my top reads of the year!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}