{
    "remaining_requests": 1235,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Heart-Me-Up-Texas-Novel-ebook/dp/B0B2RWN89N",
    "body": {
        "name": "Heart Me Up: A Humorous MM Romance with Pets, Hurt/Comfort, and Suspense (A Bent Oak, Texas Novel)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Heart-Me-Up-Texas-Novel-ebook/dp/B0B2RWN89N",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81y+xoyru1L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Bix Barrow",
            "link": "https://www.amazon.com/Bix-Barrow/e/B09D9SYVFR/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 259,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0B2RWN89N"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ (September 30, 2022)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ September 30, 2022"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3821 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 230 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B0BGNL4SNG"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#97,769 in Kindle Store (See Top 100 in Kindle Store) #241 in LGBTQ+ Action & Adventure #935 in Action & Adventure Romance Fiction #1,814 in Mystery Action & Adventure"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 259 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Linda C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG4YL4IW6BYO4AZ2O53UVP7EAKVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PAJBD24AJA3V?ASIN=B0B2RWN89N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2022",
                "reviewTitle": "5.0 out of 5 stars Love it",
                "reviewText": "This is a really great read! I enjoyed every page. Very well written, held my interest the ENTIRE book, to my delight. Every page counted, and not just rehashing dialog or issues over and over to fill pages.Foster is a detective in Austin, loves his job. Has a great partner, a tiny but fierce and funny female, who has a a really terrific husband, and they are close with two other detectives outside of work as well as on the job. The whole department is tight and they are incredibly funny. And there are no sacred cows. Nothing is off limits. They, along with Sylvia, a cool elderly neighbor of Foster's, have regular frequent Game Nights that now mostly occur at Foster's house. Because everyone is in love with this elderly funny dream of a cook Sylvia, and the guys drool all over themselves to get in on every bite. Them boys...Craig is co-owner of a Pet Spa with his best friend Greg. They met in college and are besties. Craig hasn't dated in 2 years and is going to weekly psychiatrist appointments, due to trauma a few years ago. Fun guy but just stays to himself outside of the Pet Spa. One day Foster needs to speak with the owners (Greg and Craig) informally, to get to the bottom of what someone close to him reported they felt was a cruel joke played on an employee. As soon as Foster and Craig meet, sparks. They go their separate ways, reluctantly, but run into each other later that same night. And they talk to each other and laugh and it's just so great, but they have to go their separate ways suddenly and then they each think \"wow - what just happened today??\". This starts a really low angst great story. This author takes you on such a great journey, romantic and funny and those really good feels, without being sugary sweet and unrealistic. I loved these two guys, and even better was the whole cast of characters and how they related to each other. Highly recommend, 5 big stars.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rosemary",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGMWUHGNKYXHXIABJWO7VJ4K2DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SBAYRTLW0ZDS?ASIN=B0B2RWN89N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 26, 2023",
                "reviewTitle": "4.0 out of 5 stars I thought this was a fun book",
                "reviewText": "A new author for me so I am always skeptical until I finish the book. I was very pleasantly surprised. I thought Craig and Foster were great characters, especially Craig. Some readers may have thought Craig grieved too long for his dog but I know exactly how he felt as I still grieve for my lost dogs years later. All true animal lovers would agree. This book, though, also had so much humor, I loved the first dog collar scene and Craig's revenge on Malcolm for Malcolm's trick on Craig. So well done. I actually thought the author did a great job in almost all of the book, so much that I've already purchased the first one in the series to see what I've missed. I thought all the characters were spot on and added a lot to the book.I did have a couple of things that bothered me though. The first was the warning at the back of the book regarding the fake suicide. That was overkill, the \"suicide\" was almost immediately obviously a fake and then it became a non issue. Why get people who have an issue with this upset from the get go. Also, and something that really upset me, was Craig's therapist not letting Craig come to see her less and then saying she was going on vacation and \"needed to make bank\". I'm sure the author meant this to be funny but it came across as cruel and very unprofessional. No real therapist would dream of saying something like that. Aside from those two issues, it was a good book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tomas Prower",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKJMEJYAIRTUJ6YZPDPLBZ27LKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R12R0DGMHQ28FB?ASIN=B0B2RWN89N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 30, 2023",
                "reviewTitle": "5.0 out of 5 stars The Perfect 1st Book for Someone New to the M/M Romance Genre",
                "reviewText": "This was my very first M/M romance book... and it was a perfect entrance to the genre. Sweet, exciting, and character driven, it made me want to explore more M/M romance books (by this author and other authors).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Raven reads",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGRRY5RMWLHR7Y3QZY22AJKIS3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2P2RDGG51OOGX?ASIN=B0B2RWN89N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 13, 2023",
                "reviewTitle": "5.0 out of 5 stars I loved these guys",
                "reviewText": "I absolutely loved Foster and Craig’s story. Craig has a fun loving side that hasn’t seen the light of day ever since a traumatic event a couple of years before, but there is just something about Foster that brings it out of him again. Watching these two interact was so much fun as Virgin slowly came out of his shell. I am gonna have to go read the rest of this series now. I have read the first one but I need Malcom’s story now!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DLB2572",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSQOAK4JJPNKGSWL2VHLJX2ONRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NW5KGGPJHTRN?ASIN=B0B2RWN89N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "4.0 out of 5 stars A Lot of Fun",
                "reviewText": "I had a lot of fun reading this story. I laughed out loud so many times with this. I can definitely see myself going back to read this one again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ethel Nesson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZXW2OQXLTNZJ2ELEYY7NS5S72A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5B54GYHM51OI?ASIN=B0B2RWN89N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2023",
                "reviewTitle": "5.0 out of 5 stars Great Fun!!!",
                "reviewText": "Hot Guys in Love! Dogs, Cats and Good Friends!Craig and Foster hit it off right away, but their lives are full with work, family, friends, furry friends, and neighbors. Enjoy their fast paced, passionate and fun adventures!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dani",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3AENNQSQ7CHY4R7LRA2HTVJE2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W86GME6NAXJE?ASIN=B0B2RWN89N",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Foster and Craig are absolutely incredible together!",
                "reviewText": "Talk about a feel-good read from start to finish; even the little bits of drama only added to the story and carried their love along. I know amazon works in stars, but I'd give this one five hearts if I could!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGL7XKWDYT6RCBEFYDBWY2VGKO2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3L4UG2GB5Z22B?ASIN=B0B2RWN89N",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2022",
                "reviewTitle": "4.0 out of 5 stars A detective and a pet salon owner... And a collar?",
                "reviewText": "Foster is a detective in his home town, he has weekly game nights with his friends and fellow coworkers, he is watching his best friend's cat... But he's still lonely, he's missing something.When Foster meets Craig he finally finds what he was missing, what was missing from his life was Craig. He just didn't know it.I adored these two characters, Craig was sweet and smart and has had a rough coupe of years, Foster's head strong, loyal and caring. He helps out his neighbor and he agrees to blind date his great aunt sets him up with. On said blind date he needs rescuing from that date, who rescues him you may ask? Craig, that's who! That moment I could not stop laughing and smiling at my phone, it was so funny and amusing! The author was very creative and clever coming up with that and then writing it so well.This book was really well written with terrific characters and very detailed backgrounds for each character. I loved Mariposa, I want a Maine coon cat so to read about one made me smile. I really enjoyed how even the side characters played such a big part in the overall storyline, they all contributed to adding more dimension and humor into the story.The only reason I'm giving this a 4 star is because I wish we got to see more of Foster doing his job, we got to see Craig doing his job but we didn't get much of Foster doing his. That's pretty minor considering the story was really good.I definitely recommend this story and can I just say, I loved the ending of this book!*I received an early copy of this book and this is my honest review.*",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jodie.c",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on April 10, 2023",
                "reviewTitle": "broken heart",
                "reviewText": "OMG the ending was beautiful I totally cried. Poor Graig I would kill anyone who hurt my furbabies. Foster and a Craig were so good together and Malcolm and Greg were entertaining characters along with the rest of the games night gang. Fun story especially all the furry kink jokes lol",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 3, 2024",
                "reviewTitle": "Entertaining romance",
                "reviewText": "I enjoyed seeing Craig and Foster come together and rescue one another in so many different ways. The friendship group was awesome, and there was a great array of characters, most good, some seriously flawed but trying, some grumpy. ;)Craig’s mental health progression through the novel was wonderful to witness. I liked all the humour in the relationship along with the sweet moments and the heat. Although Craig and Foster haven’t known one another long, it felt like they were building the relationship the right way (with a few hiccoughs along the way).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mandy Paton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 11, 2022",
                "reviewTitle": "A great and fun read.",
                "reviewText": "This was a great and fun read that held me captive from the first page to the last. Foster and Craig were great together and all the interesting secondary characters added a lot to the story. It was sweet, fun, emotional at times and steamy. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}