{
    "remaining_requests": 1240,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/All-Sinners-Bleed-S-Cosby/dp/1250831911",
    "body": {
        "name": "All the Sinners Bleed: A Novel",
        "price": "$16.79 $13.30",
        "originalPrice": "$27.99",
        "rawPrice": 16.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/All-Sinners-Bleed-S-Cosby/dp/1250831911",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91xxhwnNcyL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "S. A. Cosby",
            "link": "https://www.amazon.com/S-A-Cosby/e/B07J1785FN/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Discounted Reads and Fulfilled by Amazon.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 9796,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 14 hrs 30 mins",
            "FREE delivery February 27 - 29 on orders shipped by Amazon over $35",
            "Or fastest delivery February 25 - 27",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 6 hrs 45 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "United States",
                "link": "https://www.amazon.com/United-States-World-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=9822"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Flatiron Books (June 6, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Hardcover ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250831911"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250831910"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.19 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6.5 x 1.12 x 9.62 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,328 in Books (See Top 100 in Books) #6 in Black & African American Mystery, Thriller and Suspense #45 in Small Town & Rural Fiction (Books) #121 in Murder Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 9,796 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/aa04538a-8cab-4cc9-a3bf-7e7aa761db29.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/0c79ab74-3457-4b11-8c23-29cd9e91ba2d.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/18edef03-7733-45f8-a566-56db96bd6712.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ccb9eac6-7e93-49ff-bc10-c7e1bf39e32e.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Greg Barlin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI2W7BQ6OCK26MJFZPU6FNYJG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HIPM6OMHOS0G?ASIN=1250831911",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2023",
                "reviewTitle": "5.0 out of 5 stars My \"Best Book of 2023 So Far\", and Cosby's most complete novel yet",
                "reviewText": "It will come as no surprise to see an S.A. Cosby novel at or near the top of my \"Best Books of the Year\" list. Blacktop Wasteland was my #1 book of 2020, and Cosby's followup Razorblade Tears finished #4 in 2021. So to say I was excitedly anticipating All the Sinners Bleed is an understatement. And I'm happy to say that it overdelivered on those very high expectations.Like Cosby's previous two novels, All the Sinners Bleed is set in the rural counties of eastern Virginia, this time in the fictional county of Charon. The county is small and most residents spend their entire lives there. As a result, there are few strangers among them. The novel's main protagonist, Sheriff Titus Crown, was one of the few to make it out of Charon. After college at UVA and a masters from Columbia, Titus spent time with the FBI before a difficult case and his father's ailing health brought him back to the county of his birth. He chose to run for sheriff, narrowly won, and now attempts to keep the peace as the first Black man in that seat, overseeing a county in the south that, despite electing him, hasn't fully accepted someone who looks like him holding that position.The novel opens with what has become all too common these days -- a school shooting. A beloved teacher is murdered, and the gunman is killed by Titus's deputies before he can be disarmed. The investigation into the school shooting is what opens up the main plot and mystery of the story. The teacher, the gunman, and a third man who Titus starts to think of as \"The Last Wolf\" were engaged in abhorrent behavior involving the children of Charon. Two are dead, but one still prowls, and Sheriff Crown makes it his personal mission to find and stop The Last Wolf.While I loved Cosby's previous two books, I was a bit worried going into this one that he was settling into to a formulaic approach to his writing. As I noted in my review of Razorblade Tears, \"I’m just going to say it: this is 'Blacktop Wasteland 2'.\" While Cosby clearly has a style, All the Sinners Bleed is distinctly different from Blacktop Wasteland or Razorblade Tears. I love that he chose to write about a lawman (his previous main characters did not typically \"operate within the confines of the law\"), and a Black one at that. While Cosby does not fully explore the complexities of law enforcement and the Black community in the novel, it obviously comes up enough that it is addressed, and having that conversation through a main character who is both Black and a police officer is a smart way to approach it. Cosby creates a character with depth and a backstory and allows the reader to see all of the conflict within him. Whether it's Crown trying to find peace from the events of his past, working to build relationships with his family or his girlfriend, or struggling to walk the razor's edge between all the different directions in which the community pulls him, he's a man constantly waging an internal war with himself.Cosby does not shy away from live wire issues in any of his books, and All the Sinners Bleed is consistent in that as well. He once again incorporates race relations as a major component of the novel, and this time adds some pointed commentary on religion. I had no idea what Cosby personally thought about religion, but because it's such a significant component of All the Sinners Bleed, it's come up in interviews about the book. In short, Cosby is no fan, having witnessed first-hand growing up the corrupted side of organized religion.Cosby has imprinted onto Titus Crown a lot of those same sentiments, as well as some of the reasons for feeling that way. After watching his mother dies from a debilitating disease, and seeing the dark underbelly of humanity through his work, Crown feels abandoned by God, and he makes that position very clearly known throughout the book. He calls out everything from hypocrisies in interpretation of scripture to misappropriation of church funds. Cosby typically presents more of a multi-viewed, nuanced take on some of those live wire issues, but there's little balance in All the Sinners Bleed. Religion is a scourge, as far as Titus Crown is concerned. At the same time, Crown can identify or recite almost any passage from the Bible, which creates an interesting exploration of the topic, demonstrating that Crown was very much a believer at one point, before reversing his position. It also suggests that Crown's opinion is one he didn't arrive at quickly or without a lot of information. I say all of that simply because I think this may be a difficult read if God and faith are an important part of your life.This is a really tightly crafted mystery, down to the final page and resolution. Cosby's deeply developed characters and social commentary elevate the story beyond others in the genre, but even without that, this would be among the better mysteries I've read in a while. When you layer in that depth, this rises to be something really special.So how high does it rise on my \"Best Books of 2023 So Far\" list? The current pole-sitter is Dennis Lehane's Small Mercies, a spot it's held on to solidly for several weeks with very little challenge. It's interesting that there are some crossover themes between these two books. Both tackle race relations head-on, and both craft a nuanced mystery around which to have that commentary. But All the Sinners Bleed has a little something extra: a little more nuance to the mystery, and a main character who was a hair more believable, making it (at least for the moment) my top book of 2023.",
                "reviewVotes": "77 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. Blue",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5ICAGIJGRC4ZSCW733KLVND32A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ31D71LMODND?ASIN=1250831911",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "4.0 out of 5 stars All Sinners Heed...",
                "reviewText": "S.A. Cosby has done it again! Another \"edge of your seat\" thriller that keeps the reader in suspense until the end.Titus Crown, the first African-American Sheriff of Charon County, whose major town issues were the upcoming fall festival and the occasional town brawl, suddenly has a school shooting, which lead to the discovery of 7 unsolved murders to contend with. Not only were these murders horrific, but they were heinous as well.There are a host (and I do mean HOST) of characters, and this book tackles issues of grief, regret, infidelity, mental illness, pedophilia and more.During the investigation of school shooting and the subsequent discovery of murders, the Sheriff uncovers secrets of some of the townspeople and reveals several of his own. The mystery \"appears\" to be rooted in racist hate, but is it?So, I do not give away any spoilers, do yourself a favor and \"pick\" this one up!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joel Burcat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGDZZFLF3Y74Y637DKRS2YXF3MQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLBGHM3P3YM6?ASIN=1250831911",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars A great crime thriller!",
                "reviewText": "Like many readers I’m looking back on 2023 to determine which was my favorite new read. Without any doubt, it’s S.A. Cosby's ALL THE SINNERS BLEED. Cosby tells the story of Titus Crown, the first Black Sheriff of Charon County, Virginia (a made-up place, I checked). Titus must deal with a horrifying and dangerous serial killer who has killed children and his accomplices.Titus is a complex character and one of Cosby’s great strengths is what we writers call “deep point of view.” He goes deeply into Titus soul and shows that to us. Not many writers can pull that off, but Cosby is a master who is able to plumb the inner working of his protagonist’s mind. Titus is not a perfect man. He has his faults, which makes him a better character. We root for him to succeed.Cosby builds a world that is emblematic of Tidewater Virginia. He goes into the history, both distant and recent, that is drawn from the true history of that region. The place seems so real, you can almost taste the grits. The book is a real character study of a place.He provides believable side characters, Titus’s family, and his love interest. We know these folks. Most importantly, the conflict is palpable and like a tight banjo string until the final pages. Titus confronts pure evil and we are along for the ride as he struggles to solve the crime and stay alive.There’s a reason shy this book has been called Southern Noir. Cosby embraces the South, with all of its charm, beauty, racism, deceit, and ugliness. This is a great crime mystery and thriller. Once you pick it up you will find it hard to put down. Highly recommended.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 7, 2024",
                "reviewTitle": "Magnificent and captivating",
                "reviewText": "One of my new favourite novelist. Loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adrian Dooley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 4, 2024",
                "reviewTitle": "Bleak in the best of ways.",
                "reviewText": "Boy that was an intense read. Cosby is fast becoming one of my favourite authors. His books are bleak, gritty, disturbing but splattered with memorable characters and great story telling and at the heart of them the worst and best of human nature.Again another book with an anti hero, a running theme in his books, this time a sherrif. An ex FBI agent who returns to his home town to look after his aging father and troubled brother, he became sherrif of his southern hometown a year ago much to the disdain of many a towns folk.A school shooting sets off a series of events that uncovers child abuse, a serial killer and much more, this book ain’t for the faint hearted.The thing with Cosby books, no matter who the main character is, be it a fugitive, a cop, a family man, they are all more or less the same character. An anti hero struggling with their place in the world with guilt and regret, yet all so well written. I’ve been on the side of all of them.We also have common themes running throughout, race, racism, religion, family, the very essence of life for many. All painted across the bleakest of crimes and yet amongst it all there are always little glimmers of hope and goodness shining brightly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Allan Dalcher",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on July 3, 2023",
                "reviewTitle": "Disappointing denouement: not recommended",
                "reviewText": "I liked the main characters and the atmosphere until it got so deeply into EVIL. The last part of the book is a real drag. Evil targets good cop. What crap!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Naama",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 26, 2024",
                "reviewTitle": "Amazing Book",
                "reviewText": "My first S.A. Cosby didn't disappoint! Worth the read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacqui Jay Grafton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 19, 2023",
                "reviewTitle": "Good book, could have been great",
                "reviewText": "Ever since I first became aware of S A Cosby, I have looked forward to each new novel. Razorblade Tears had a raw, rough energy that enthralled me. His characters were drawn in, warts and all, and I was pulled into his world of the Deep South.Only Sinners Bleed is also set in that world and the main character, Titus Crown has his soul laid bare for the reader. As the sheriff of Charon, he is presented with an horrific case of multiple child abuse and murders. His task is made harder because he is a black man in an area where the white residents still revere the days of the Confederacy and the black preachers are fired up to protect their civil rights. As well as trying to solve the gruesome crimes escalating around him, Crown also has to deal with resentment and prejudice from both black and white citizens.It’s a hard book to review because there are so many different elements competing for attention that they actually have the reverse effect. Crown is much given to rumination, dwelling on the past and recalling wise advice from his late mother and ex colleagues. These episodes come randomly, sometimes inserted at a time when the main hunt for the killer was just heating up. For me, Crown was carrying just too much angst.There are some really nice descriptive passages, at times reminiscent of James Lee Burke, and a sub plot that rumbles along until it becomes relevant at a later time. Running through all this background noise, is a hard=edged murder story which taxes Crown to the limit as the bodies pile up.I felt a little like I’d eaten too many chocolates by the time I came to the end of the story – I’d enjoyed it a lot but wished there hadn’t been so much of it. There was such an abundance of characters that, by the time the murderer was revealed, I wasn’t sure if I’d ever heard of him before.It’s complicated, thought-provoking and, at times, verges on great literature. But I missed the raw simplicity of Cosby’s earlier books.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}