{
    "remaining_requests": 1207,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Coworker-Freida-McFadden/dp/172829620X",
    "body": {
        "name": "The Coworker",
        "price": "$10.93$10.93",
        "originalPrice": "$17.99",
        "rawPrice": 10.93,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Coworker-Freida-McFadden/dp/172829620X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51QNshhlI3L.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41qUJ6Syv-L.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Freida McFadden",
            "link": "https://www.amazon.com/Freida-McFadden/e/B00ELQLN2I/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 52316,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            ""
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 1 hr 27 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 7 hrs 27 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "INSTANT NEW YORK TIMES AND USA TODAY BESTSELLER\"Don't start a Freida McFadden book late at night. You won't be able to put it down!\"― Natalie Barelli, bestselling author of UnforgivableTwo women. An office filled with secrets. One terrible crime that can't be taken back.Dawn Schiff is strange.At least, everyone thinks so at Vixed, the nutritional supplement company where Dawn works as an accountant. She never says the right thing. She has no friends. And she is always at her desk at precisely 8:45 a.m.So when Dawn doesn't show up to the office one morning, her coworker Natalie Farrell―beautiful, popular, top sales rep five years running―is surprised. Then she receives an unsettling, anonymous phone call that changes everything…It turns out Dawn wasn't just an awkward outsider―she was being targeted by someone close. And now Natalie is irrevocably tied to Dawn as she finds herself caught in a twisted game of cat and mouse that leaves her wondering: who's the real victim?But one thing is incredibly clear: somebody hated Dawn Schiff. Enough to kill.The Coworker is a tense, unputdownable thriller from New York Times bestselling author Freida McFadden that explores the dark ways the past can echo through the present―with deadly consequences.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Poisoned Pen Press (August 29, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 172829620X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1728296203"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5 x 0.92 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#266 in Books (See Top 100 in Books) #26 in Murder Thrillers #86 in Psychological Thrillers (Books) #122 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 52,316 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/1f5703c4-aa82-4c02-beb2-117f74d91fba.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6fe6d540-0083-47ad-8f7f-365d3caa1b67.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "TayTay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHEEGEOFN4RVLJ6ATFBTMIRRCZSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3E11JX85WUCYG?ASIN=172829620X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars 🕵️‍♀️📚 Unraveling Office Mysteries: \"The Coworker\" by Freida McFadden",
                "reviewText": "Rating: ⭐️⭐️😜😰🤩TLDR; I read this with my mom and we could not put it down. This was a fun, quick, and suspenseful read. Gotta love Freida's twists. I always wonder how she does it but she does. If you are in a reading slump, need a break from a larger series or just trying to get back into reading - read this or start with one of Freida's books.This review is for fun and hope its entertaining in some way - enjoy and read this book.In the cold, sterile halls of Vixed, where nutritional supplements are crafted, secrets fester like an unspoken toxin. Freida McFadden's \"The Coworker\" beckons readers into the enigmatic world of Dawn Schiff, the peculiar accountant who vanished, leaving behind a whirlwind of suspicion and a twisted game that not even the office's queen bee, Natalie Farrell, can escape.🕰️ A Game of Shadows:As the clock ticks towards 8:45 a.m., the strangeness of Dawn Schiff unfurls like a shadowy dance. McFadden paints Dawn as an enigma, an outsider harboring mysteries that elude the prying eyes of the Vixed coworkers. The suspense tightens when Dawn vanishes, leaving Natalie ensnared in a web of questions with no easy answers.😂 Office Humor Meets Dark Secrets:In the monotony of office life, McFadden injects doses of humor (she's good at it), transforming the mundane into a comedic escapade. The quirks of office culture find a place amidst the suspense, creating a narrative that oscillates between chuckles and gasps. It's a rollercoaster of emotions, where laughter and tension intertwine in an unusual office tango. Just when you think you got it figured out someone else pops up.🔍 Twists That Tease:McFadden's trademark twists take center stage, beckoning readers into a maze of uncertainty. The anonymous phone call becomes a siren's song, luring Natalie into a labyrinth where the distinction between victim and perpetrator blurs. With each revelation, the plot tightens its grip, leaving readers guessing until the final, gasp-inducing twist.👥 Cat and Mouse:Caught in a twisted game of cat and mouse, Natalie grapples with her connection to Dawn. The lines between alliances and betrayals blur as she navigates the treacherous terrain of office politics turned deadly. McFadden expertly weaves a tale of suspicion and mistrust, leaving readers to wonder who's pulling the strings.💀 Echoes of the Past:The echoes of Dawn's mysterious past reverberate through the present, casting shadows that stretch far beyond the office walls. McFadden, a maestro of suspense, explores the sinister ways in which the past can claw its way into the present, leaving a trail of deadly consequences.In \"The Coworker,\" Freida McFadden concocts a potion of humor, suspense, and office intrigue that proves irresistible. A page-turner that entices you into the labyrinth of secrets lurking beneath the veneer of Vixed, it's a thriller that echoes long after the final revelation. Will you uncover the truth, or will the shadows of the office swallow you whole? 🕵️‍♀️🔍🕰️",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephenee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWZ25RS5SAEAX4VXJ25AFH77BHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DD5RU0VFDE7D?ASIN=172829620X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Not my favorite by this author -",
                "reviewText": "I have read all of author Freida McFadden's thriller's and this was one was by far my least favorite. I give it 3.5 stars, but rounded up for the purpose of this review. It wasn't as edge of my seat as her others, it wasn't as attention seeking as her previous books and the reader was actually able to kind of guess some of the twists in this one.The turtle's were a bit much - it became a bit overwhelming, I mean I like turtles, but the amount of turtle stuff was too much - it was filler/fluff designed to make the book longer and this reader didn't appreciate it. The character's weren't exactly likeable and the reader didn't want to root for any of them - they were just annoying at some parts.The plot was good, it was unique, and it had some really good parts, but also some really eh parts. I will read more by this author because I usually love her books, but for some reason this one just wasn't a favorite. Overall a good read, but not the best. Give it a read and see for yourself!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kattbelly",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3KD5SAA4DQH2M3TEEYCZLIVIHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO5FS6WWAJP93?ASIN=172829620X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "3.0 out of 5 stars Karma on a mean girl-or is there a twist?",
                "reviewText": "Natalie is the most successful salesperson at her health and beauty products company. She is beautiful and charismatic. She hosts a yearly 5K run for cerebral palsy, in honor of her childhood friend Amelia who died of it.The story starts with her strange cubical mate Dawn who obsessively loves turtles, missing from her desk. As she is also obsessively punctual, Natalie is shocked to not see her there. Dawn’s phone rings and Natalie answers it to hear a weak cry for help, then the line goes dead. Could that be Dawn? She encounters her new office boy friend, Caleb, on her way to ask her boss, Seth, if Dawn called in sick. Caleb hasn’t seen Dawn, and Seth hasn’t heard from her either.Natalie finds a ceramic turtle on her desk that wasn’t there before, encrusted in a dried russet substance. Is someone messing with her? What does it mean?As the story unfolds, we start to see Natalie in a different light than she presents herself. She see’s herself and her motives in a more generous way than reality. We also see Dawn through her emails to her friend Mia, which paints a much different picture of Natalie, though Dawn is naive in her perceptions of Natalie-assuming a friendship and kindness that we are starting to see aren’t real.The police are starting to see Dawn as a potential murder victim, and things are pointing to Natalie as the murderer as the detective starts to investigate these emails and other pieces of evidence occurring.All of the characters involved coalesce into the finale with plenty of twists and strange surprising motives. It’s worth reading, but I gave it 3 stars instead of 4 because the motives of the characters keep changing, even at the very end. You start to root for a character, then there’s an abrupt change that is interesting but at the same time implausible. It ends with a prescient self awareness that was bleak, even when some characters get a “happy ending.”",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFKFODXEXSNRUEKRZ7TND2NCBVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39DHOAOJ3JVHZ?ASIN=172829620X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars a twist and turn of events.",
                "reviewText": "Things that I thought were insignificant would later be revealed as connected to the story. This whole book left me at times hating the main characters and at others feeling bad for them like they were wronged in some strange way. It was absolutely amazing. My first book read from Freida McFadden and I will definitely be reading more. Highly recommend to anyone looking for a great book to distract us all from our lives. Freida lives up to the hype around all her works. Can’t wait to dive in and read more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daniel Benitez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWJTSL3YSGUUAZEREQLAGNPK3KA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R360FZNVS6Y8AI?ASIN=172829620X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Twisty mystery",
                "reviewText": "This was a fun page-turner. The action stats at the beginning and doesn’t stop. I liked how it goes back and forth in time so you can see the past, but it’s only in e-mail form. Then it catches up and in typical mystery style the explanation happens and you get the twist. The twists keep coming though, which makes this book fun to read till the end. It does get a tiny bit into unbelievable territory, but it still works. Good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth Noseworthy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2024",
                "reviewTitle": "Thriller book",
                "reviewText": "It was a great book with a wonderful and surprising ending",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Montserrat Lozano",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 13, 2023",
                "reviewTitle": "Nice surprise",
                "reviewText": "Wasn't the history I thought (guided by the title) but it was a nice surprise, that final, oh God, didn't saw that one coming.Easy reading, great story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "william cameron",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "Brilliant",
                "reviewText": "Another great story from Freida. Once you start reading you are not going to be able to put it down. That’s how good she is. You say to yourself, just one more chapter.Do yourself a favour and get this book, you won’t regret it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "No doubt I survive on it as I stay alone... It reminds me about my wifes had made fish fry and that wistful affection 🥰....   Craving for fish but too hungry yet too lazy to make masala? Then zyka masala is best option super easy to make and taste amazing !    You can eat these meals without impacting your health , can be made instantly without requiring a lot of effort and same  masala can be used to make curry as well.  Thanks zyka for such a mess free eating option... God Bless ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 11, 2024",
                "reviewTitle": "Too good",
                "reviewText": "Epic... Frieda not only open new horizon of creativity but educate her readers too... With her realtime experience ... Studies and knowledge..Great author ... Thanks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Loik Allain",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 6, 2024",
                "reviewTitle": "A lire sans retenue",
                "reviewText": "Encore un roman qui tient éveillé toute la nuit ! Un vrai page turner ! Comme à chaque fois, l’auteur a le secret d’un rebondissement qui surprend ! A lire absolument ! En anglais c’est encore mieux",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}