{
    "remaining_requests": 1168,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Force-Nature-JANE-HARPER/dp/125010565X",
    "body": {
        "name": "Force of Nature: A Novel",
        "price": "$10.29 $7.94",
        "originalPrice": "$18.99",
        "rawPrice": 10.29,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Force-Nature-JANE-HARPER/dp/125010565X",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51pqWT6gWEL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31veYby2G6L.jpg",
            "https://m.media-amazon.com/images/I/51lDP6cJhAL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jane Harper",
            "link": "https://www.amazon.com/Jane-Harper/e/B001KI8MCE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by GREENWORLD BOOKS and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 32989,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"I love Jane Harper's Australia-based mysteries.\" ―Stephen King\"Compelling...Harper continues the intense plotting and detail for characters and setting that she established in The Dry.\"―Associated Press\"All of the novel's characters have been drawn with exceptional complexity, and none more so than Aaron Falk...So much more than a conventional detective, the reflective and compassionate Falk provides the book's moral compass.\" ―New York Times Book Review“Secrets revealed as the investigation unfolds will keep readers guessing until the unlikely plot reveals itself in the last pages of the novel. Fans of her debut book The Dry will find Force of Nature lives up to the exciting expectations Harper is becoming known for building.”―Florida Times-Union“Force of Nature reinforces Harper’s gift for creating characters with complicated relationships and especially for writing about wild landscapes, where anything can happen.”―LitHub“Even more impressive than The Dry…An almost unbearable level of suspense…Nature is a hostile, unpredictable force in both of Harper’s novels, but her brilliance lies in making it into a test of horribly fallible human nature.”―Sunday Times“While the plot unfolds at an expertly controlled pace and is resolved in a satisfyingly ambiguous fashion, it is the relationships between the women that drive the novel…Thoughtful, moving, troubling.”―Irish Times\"Both novels are intense, deeply intelligent psychological thrillers that explore how our pasts – especially our childhoods – mold and disrupt our lives in the present.\"―Christian Science Monitor\"Riveting, tension-driven thriller…Perfect for fans of Tana French and readers who enjoy literary page-turners.”―Booklist, starred review“Harper’s crackerjack plotting propels the story…Harper layers her story with hidden depths, expertly mining the distrust between Alice and her four colleagues, and the secrets that simmer under the surface…A spooky, compelling read.”―Kirkus“Stellar… The briefest dip into the prologue results in stomach-tightening anticipation that begs the reader to continue… [Harper] infuses the narrative with energy and atmosphere as Falk plumbs professional and personal relationships for clues to Alice's fate.”―Shelf Awareness\"Set against the fascinating backdrop of a wild, rural location in south Australia...Presents an intriguing crime that might not actually exist and potential suspects with realistically complex personalities and possible motives. The two story lines, past and present, collide with a satisfying yet not gratuitous conclusion.\"―Library Journal“A gripping tale of an elemental battle for survival…Harper once again shows herself to be a storytelling force to be reckoned with.”―Publishers Weekly“Jane Harper is a must-read writer, and Aaron Falk is the Harry Bosch of the outback. Force Of Nature is a remarkable hybrid of suspense, wilderness survival, memorable characters, and gorgeous writing.”―Michael Koryta, New York Times bestselling author of Those Who Wish Me Dead“I loved The Dry. Force of Nature is even better. Brilliantly paced, it wrong-foots the reader like a rocky trail through the bush. I adored it.”―Susie Steiner, bestselling author of Missing, Presumed and Persons Unknown“A major voice in contemporary fiction. Like Tana French's Dublin Murder Squad series and Kate Atkinson's Jackson Brodie novels, Jane Harper's deftly plotted mysteries double as sensitive inquiries into human nature, behavior, and psychology. And like The Dry, Force of Nature bristles with wit; it crackles with suspense; it radiates atmosphere. An astonishing book from an astonishing writer.” ―A.J. Finn, author of The Woman in the Window“Lord of the Flies in the Australian outback, with grown women in place of school boys. I loved every chilling moment of it. A blistering follow-up to The Dry from one of the best new voices in crime fiction.”―Sarah Hilary, author of the bestselling DI Marnie Rome series“Manages to be two things at once. It's a financially skewed police procedural with a likeable detective with his own personal trajectory at its heart, and it's something of a \"locked room mystery\". The fact that the \"locked room\" is neither in a vicarage, nor on an island, but somewhere in the claustrophobic vastness of the Australian bush renders Force of Nature all the more original and engaging.”―Sydney Morning Herald“As thick with menace as the bush that seems to swallow the difficult Alice…Force of Nature cuts between past and present, corporate and domestic, and cements its author as one of Australia’s boldest thriller writers.” ―Australian Women’s Weekly\"The narrative is finely constructed, with perfectly measured pace and suspense. So much so that it reminded me of another master of form, Liane Moriarty...There are echoes of Picnic at Hanging Rock and Lord of the Flies as any appearance of civility slips away and the women lose direction in a hostile landscape.\"―The Saturday Paper (Aus)\"Harper’s mastery of pace makes Force Of Nature one of 2017’s best thrillers.\"―Elle (Aus)\"Gripping thriller will have readers hooked.\"―Sunday Telegraph \"Force of Nature proves Jane Harper, author of The Dry, is no one-hit wonder. Its premise is instantly gripping.\"―Herald Sun (Aus) About the Author Jane Harper is the New York Times bestselling author of The Dry, Force of Nature, and The Lost Man. Jane previously worked as a print journalist in Australia and the UK and lives in Melbourne with her husband, daughter, and son."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 6 hrs 8 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 17 hrs 23 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"I love Jane Harper's Australia-based mysteries.\" ―Stephen KingGoodreads Choice Award Finalist (Mystery & Thriller, 2018) BookBrowse Best Books of 2018Winner of the Prix Polar Award for Best International NovelBookRiot’s 25 Best Suspense Books from 2018Davitt Awards shortlist for Adult Crime Novel 2018Dead Good Reads shortlist for Best Small Town Mystery 2018Five women go on a hike. Only four return. Jane Harper, the New York Times bestselling author of The Dry, asks: How well do you really know the people you work with?When five colleagues are forced to go on a corporate retreat in the wilderness, they reluctantly pick up their backpacks and start walking down the muddy path. But one of the women doesn’t come out of the woods. And each of her companions tells a slightly different story about what happened. Federal Police Agent Aaron Falk has a keen interest in the whereabouts of the missing hiker. In an investigation that takes him deep into isolated forest, Falk discovers secrets lurking in the mountains, and a tangled web of personal and professional friendship, suspicion, and betrayal among the hikers. But did that lead to murder?“Force of Nature bristles with wit; it crackles with suspense; it radiates atmosphere. An astonishing book from an astonishing writer.”―A.J. Finn, author of The Woman in the WindowSelect praise for The Dry:\"One of the most stunning debuts I've ever read. Every word is near perfect. Read it!\"―David Baldacci, #1 New York Times bestselling author“A breathless page-turner … Ms. Harper has made her own major mark.”―The New York Times Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Flatiron Books; Reprint edition (January 8, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 125010565X"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250105653"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.35 x 0.95 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#25,011 in Books (See Top 100 in Books) #335 in Small Town & Rural Fiction (Books) #970 in Murder Thrillers #1,222 in Police Procedurals (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 32,989 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jessica Madden",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFIJ2ASPN5DBVLS7F5PV6BW3FTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HTOFR855WY26?ASIN=125010565X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "4.0 out of 5 stars Good!",
                "reviewText": "I read these out of order, starting with book three and then moving to the first. I think out of the three, this one was my least favourite. Maybe because this wasn’t so much focused on Aaron. He had his moments remembering his father and coming to terms with his past, but it felt more muted with this book. Add in the mystery, which was actually really good, but it wasn’t really solved by anyone. We just see what happened in the flashbacks. The cops don’t really do much to crack the case open. It felt like they stumbled into the answer. The constant changing of present to past with each chapter started to feel tedious by the end. Add in the story-lines which went nowhere and I’m not sure this is one I’ll be rereading.So, would I recommend? Yes. It wasn’t bad, just didn’t stand out as much to me as the first and third book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R30VT52Q2VEXHD?ASIN=125010565X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 2, 2018",
                "reviewTitle": "5.0 out of 5 stars Are you a happy camper?",
                "reviewText": "Remember the fun stuff you did at summer camp? When you were a boy scout or a campfire girl? Bass fishing at the lake? Sightseeing in the national park? What can be more enjoyable than sitting around a bonfire toasting marshmallows, roasting hot dogs, and telling ghost stories on a warm, moon-lit summer night? Singing \"Home on the Range,\" \"Good-bye Old Paint,\" and other traditional favorites. Hiking the trail, canoeing, spying wild animals in their natural habitats through your binoculars. How peaceful and serene it all seemed! Or, perhaps, you went out to a scenic secluded spot in a remote recreational area just so you and your best buddies could drink beer and listen to the music on a newly installed AM FM stereo radio-CD player played really loud, without disturbing anyone outside a radius of about two city blocks, while you listened to \"Dark Side of the Moon.\" You thought about installing a C.B. radio underneath the dashboard as well, but you were twenty-one, on a limited budget, didn't really need one, and couldn't afford one anyway. Now someone is thinking how the world has changed so very rapidly and dramatically, how nothing can ever really be the same as it once was. He probably thinks how he has more survival skills in his little pinky finger than all of the corporate executives combined gone fishing, hiking, bird-watching, or relaxing in their easy chairs, seated in friendly, comfortable surroundings, drinking aperitifs and telling jokes at the lodge for the duration of their long lost week-end in the national forest have in their whole bodies. He wanted to re-live the wonder years of his youth, so he volunteered as an active participant in the next corporate retreat to the great outdoors. The destination is none other than the incredible Outback of \"Crocodile Dundee's\" Australian wilderness. This is the gist of the novel, Force of Nature, written by Jane Harper, published in 2017. The story becomes very interesting quite quickly. As suspense-filled and intriguing as the question I just made up is loaded: \"Being strictly vegetarians, what were you able to survive on besides bush-meat?\" An avid book reader, one has a great tendency to look for the moral in the story--even if there doesn't appear to be one at first glance. For this particular book, although \"laughter is not necessarily the best medicine,\" having slightly modified the title of the \"Readers Digest\" periodical column, one might offer the aphorism, \"He who laughs last, laughs best\" as an alternative. But that's not right either. What transpires on their trip is no laughing matter. All right. So I ask myself a simple rhetorical question, \"What is the story about then?\" The answer which immediately comes to mind is obviously too vague, and more of a riddle than an answer, but here goes anyway: \"Close to, but not exactly the last desperate act of a dying man, going off the deep end in the secretarial pool, drowning in massive corporate debt.\" Indeed, such a blanket statement could be grossly misleading and quite plainly wrong. Upon further reflection, perhaps wanting to revise my interpretation of the book altogether, I'm reminded of two basic bits of advice that any dedicated careerist may have heard repeated over the years: \"Don't take your work home with you.\" and \"Don't bring your personal problems to work.\" Okay. That was another tangential point of departure for the rational thought process of an eccentric individual who obviously enjoys analyzing a promising work of fiction. Trying again. The story is actually about a couple of federal investigators who endeavor to solve a stunningly serious, heinous, vexing and perplexing crime. This fact alone makes reading the book worthwhile. You can often tell from the first few pages that it's going to be a good novel from the rhythm and pace of the writing by an experienced investigative reporter and competent police detective. R. Royce was deeply concerned that his ten-year-old niece might have become overly shy, withdrawn, and introverted spending so much of her time in front of a computer. He thought she needed a healthy and beneficial opportunity to break out of her shell, so to speak. Just before the upcoming Fourth of July week-end, he drove his brother Lehman and his daughter Lou Ellen to the lake one day to see if anyone was catching any fish. On the way, Lehman noticed that a fireworks stand was open for business and Royce stopped to let him buy some sparklers and firecrackers to liven up the outing a bit. All well and good. The two of them enjoyed the flashy, flaming noisemakers immensely, but Royce was not overly enthusiastic or satisfied by these less than impressive results. After they had their fun with the fireworks, the trio drove through the camp ground at the second spillway from the dam at the posted speed limit of 5 mph. Royce had an inspiration, then, wondering if the people they saw were sufficiently enjoying their vacations. He rolled down his window and got the attention of the first group of people they met, seated around a picnic table next to a smoking barbecuer. He began chatting with him for a moment. He discovered that the family lived in Tulsa and were camping at the lake for the holiday week-end. When they drove on further, he asked Lehman and Lou Ellen if they could tell whether the other people they saw along the way, were also on vacation, or not. His brother played along and said, \"I can't really tell at all. I think that you have to stop and ask them in person if you want to be absolutely certain whether they are on vacation or just out swimming for the afternoon.\" \"Let's see if we can find any happy campers,\" Royce said. He braked to a complete stop beside the very next campsite and suggested to Lou Ellen, \"Why don't you roll down your window and ask?\" Bravely, fearlessly, she rapidly rolled down the car window. She leaned out of the window and inquired of the first person she met who was standing nearby, \"Are you a happy camper?\" \"I am definitely a happy camper,\" the dashing young fellow replied, cheerfully and enthusiastically, a boy of her age and temperament, in his high-altitude jeans. \"My family and friends are going to be here for the long week-end. We've already been fishing and swimming. Later on, we're going water skiing. Our boat and trailer is over there by the picnic table. Mom is grilling frankfurters for lunch. Want a soda?\" The flood-gates had opened with his reply. \"No, thanks. Are you going to see the fireworks show tonight?\" she asked, hopefully. She had come out of her shell in no time at all. They had no need of great concern. The two of them were after all, cousins. She would meet several more at the family reunion, planned well in advance, especially for this auspicious occasion. Distant relatives would be arriving soon from Wichita.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A lover of books",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6MFCCWBCTEV7X2PGKSA5373RIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1HQM40RWRINR8?ASIN=125010565X",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "3.0 out of 5 stars Good",
                "reviewText": "An Interesting story about some really mixed up women. One is an absolute b and the other 4 have real emotional problems.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BRW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF5ALIVAONXIZGJ2OUFI23TFMX4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1MZG2U0R2LNNT?ASIN=125010565X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 30, 2023",
                "reviewTitle": "4.0 out of 5 stars interesting human interactions",
                "reviewText": "Jane Harper creates a tangle of emotions inside a circle of workmates. The book illustrates the intense emotions in a stark situation.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "H. Grove (errantdreams)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF72YA5ZZ7VLAAJK2M2VSDTVYFFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IYWWTDC6XWPH?ASIN=125010565X",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 23, 2021",
                "reviewTitle": "5.0 out of 5 stars I was riveted!",
                "reviewText": "Sometimes I hear about authors in roundabout ways. This time, the guy from my college who was helping me with my resume saw that I reviewed genre novels and told me I should read Jane Harper’s thriller/mystery The Dry. I loved it so much that I almost immediately afterward went on to read Force of Nature: A Novel. It’s every bit as good.The company of BaileyTennants sent a bunch of its employees on a kind of corporate retreat in the woods. The women took one trail, and the men took another. When the women arrive–late and injured–they’re missing one of their number. Alice Russell has vanished. The group insists she left to move on in the middle of the night because she didn’t want to wait until morning, but there’s reason to believe that isn’t the case. Federal Agent Aaron Falk and his partner Carmen Cooper were using Alice to get files and contracts implicating her bosses in money laundering, and more. On the night she disappeared, she tried to leave a voice mail for Aaron. While rescuers search the woods looking for Alice, Aaron and Carmen question everyone involved, trying not to give any hint to the employees that they are in fact already investigating the bosses. So the question is, did one or more of the ladies do something to Alice? Did the son of a serial killer who’s rumored to live in the woods nearby kill her? Did someone else, like maybe the guy running the executive adventures company, do something? There’s a lot of ill-will between the various women, leaving Aaron and Carmen with quite a few suspects.Force of Nature follows after The Dry. Aaron is still facing some of the fallout from what happened in that novel. I don’t think you have to have read it first–this is primarily about the mystery–but it wouldn’t hurt to have that personal background for Aaron. Besides, The Dry is an excellent novel worth reading!The characters have a lot of depth to them. There’s Jill, who didn’t want to work for her father but when he insisted, she buckled down and got to work. Her brother is the CEO. We gradually discover that Alice isn’t exactly going to be missed by a lot of people, with the exception of her teenaged daughter. Beth and Bree–twins–are about as different as night and day. Bree is Alice’s assistant, and constantly trying to impress the woman. Beth is the troublemaker of the family, although not always in the ways you might expect. Lauren and Alice both went to the “Endeavor Ladies’ College” together, which put some focus on learning to handle the out-of-doors, and their daughters have followed in their footsteps.The women find a mysterious, run-down cabin out in the woods, and they start to wonder whether it has any connection to a serial killer who hunted the area some years ago. He was caught, but everyone wonders if his missing son has picked up the family torch. We watch the women make their way through the woods in parallel to the unfolding investigation, and it’s timed well. I never felt confused as to where or when I was.This is a really fascinating tale and I highly recommend it!Content note for death and injury of course.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elizabeth du Fresne",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVYPOKXADJDFGE6Q3NL2PKKBAJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNKI6PL3HYEGB?ASIN=125010565X",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 7, 2023",
                "reviewTitle": "4.0 out of 5 stars Not as good as The Dry but a fast read that maintains its tension",
                "reviewText": "I'm a Jane Harper fan. This well-written book tells a story of a corporate retreat set in the outback of Australia. There are two parallel paths of narrative. The one traces chronologically the events of the three days of the retreat. The other is involved with the police effort to find and rescue a missing corporate officer who does not come back from the time in the bush. Harper maintain an atmospheric tension to both lines of the tale. Without many fleshed out details of the personalities engaged in the wilderness exercise or of the police who are searching and investigating, the author manages to make the reader care about the fate of the participants and their families. A good thriller you can zoom through in a weekend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda Leeming",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 19, 2022",
                "reviewTitle": "Roller coaster one day read!",
                "reviewText": "Discovered Jane Harper (The Dry) while visiting my son in Australia and in between time with our grandson and day trips it was an excellent read with really surprise ending!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ian B.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on October 1, 2023",
                "reviewTitle": "Masterful Storytelling",
                "reviewText": "Following on from the success of 'The Dry', Jane Harper once again impresses with her mastery of suspense, character and atmosphere. Beautifully written in confident, limpid prose, with once again the Australian bush as a genuine, sometimes sinister presence. Highly recommended",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jacob Collins",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 26, 2022",
                "reviewTitle": "Another gripping read from Jane Harper!",
                "reviewText": "I loved Jane Harper’s debut novel, The Dry, when I read it a few years ago, so I’m really pleased that I’ve caught up on the second book in the series, Force of Nature. Aaron Falk is back, and this time, he is investigating the disappearance of a woman, Alice Russell, who has vanished while on a back packing trip with friends in the Australian outback. Aaron Falk has previously worked with Alice, who has worked with him on an investigation, so this adds a chilling note to Alice’s disappearance, particularly as the investigation was to do with the company she works for. This is especially the case when we learn that one of Alice’s last messages before she went missing was to Falk.I loved the tension Jane Harper creates surrounding Alice’s disappearance. There is an immediate threat of danger, and you know from the outset, that the chances of the police finding Alice alive are very slim, especially given the terrain she has vanished in. But what happened to Alice? I really wanted to know, and I liked how Jane Harper went back in time, showing us what happened in the days preceding Alice’s disappearance as the group of friends set off together.Jane Harper is a master at crafting landscapes in her novels, and she really captures the danger as the women set off. The way in which Jane describes the landscapes, making them feel so real in her writing, is what makes both of these two books unique. I’m kicking myself that it’s taken me this long to get round to reading Force of Nature. You get the sense that things can quickly change, away from the main towns and cities, and Jane Harper shows how experienced you need to be in exploring these routes. Falk and the police know how difficult their task is.Falk is a brilliant character, and his voice draws you into the story, keeping you captivated. He isn’t a police detective; he is part of the financial investigation unit. From the moment when he is contacted by Alice Russell, when she leaves him a mysterious voice message, in the beginning of the book, you can sense the dread he is feeling. You can see that he is determined to find out what has happened to her.I thoroughly enjoyed Force of Nature. It is another gripping read from Jane Harper and I will make sure that I catch up on her other books as soon as possible.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vince",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on August 5, 2022",
                "reviewTitle": "A story that could have been better",
                "reviewText": "Jane Harper knows how to write and this second book after The Dry is a decent book. The stage is once more the Australian bush, the wilderness of this enormous continent. The writer uses the forces of nature to explore the depth of the human soul. She partially succeeds, but the story is long, elaborate and a bit oppressive: it could have been shorter. The usual trick of dedicating one chapter to the present and the following to the past is effective to a certain extent and soon becomes tedious. I agree with others that The Dry is better, but capturing the readers’ attention throughout several books on similar subjects is very difficult…",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nora",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on June 14, 2022",
                "reviewTitle": "Prima verhaal maar onprettige uitgave qua bladspiegel",
                "reviewText": "Het verhaal is onderhoudend maar niet zo boeiend als haar eerdere boek The Dry. Nadeel van deze smallere paperback versie (met deze kaft) is dat de bladspiegel ook erg smal is vergeleken met andere paperbacks/edities. Leest \"anders\". Maar, wel een stuk goedkoper!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}