{
    "remaining_requests": 1198,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-The-Maid-A-Novel/dp/B09FYHXPBH",
    "body": {
        "name": "The Maid: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-The-Maid-A-Novel/dp/B09FYHXPBH",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41bAvQ7iK5L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nita Prose",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Nita+Prose"
        },
        "brand": "Nita Prose",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 88583,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "2023 Edgar Allan Poe Award for Best Novel, Short-listed 2022 Ned Kelly Award - Best International Crime Fiction, Winner#1 NEW YORK TIMES BESTSELLER GOOD MORNING AMERICA BOOK CLUB PICK “A heartwarming mystery with a lovable oddball at its center” (Real Simple), this cozy whodunit introduces a one-of-a-kind heroine who will steal your heart. FINALIST FOR THE EDGAR AWARD “The reader comes to understand Molly’s worldview, and to sympathize with her longing to be accepted—a quest that gives The Maid real emotional heft.”—The New York Times Book Review (Editors’ Choice) “Think Clue. Think page-turner.”—GlamourONE OF THE TEN BEST BOOKS OF THE YEAR: Reader’s Digest WINNER: The Anthony Award, The Fingerprint Award, The Barry Award In development as a major motion picture Molly Gray is not like everyone else. She struggles with social skills and misreads the intentions of others. Her gran used to interpret the world for her, codifying it into simple rules that Molly could live by.Since Gran died a few months ago, twenty-five-year-old Molly has been navigating life’s complexities all by herself. No matter—she throws herself with gusto into her work as a hotel maid. Her unique character, along with her obsessive love of cleaning and proper etiquette, make her an ideal fit for the job. She delights in donning her crisp uniform each morning, stocking her cart with miniature soaps and bottles, and returning guest rooms at the Regency Grand Hotel to a state of perfection.But Molly’s orderly life is upended the day she enters the suite of the infamous and wealthy Charles Black, only to find it in a state of disarray and Mr. Black himself dead in his bed. Before she knows what’s happening, Molly’s unusual demeanor has the police targeting her as their lead suspect. She quickly finds herself caught in a web of deception, one she has no idea how to untangle. Fortunately for Molly, friends she never knew she had unite with her in a search for clues to what really happened to Mr. Black—but will they be able to find the real killer before it’s too late?A Clue-like, locked-room mystery and a heartwarming journey of the spirit, The Maid explores what it means to be the same as everyone else and yet entirely different—and reveals that all mysteries can be solved through connection to the human heart.ONE OF THE BEST BOOKS OF THE YEAR: The Washington Post, The Guardian, Glamour, Elle, PopSugar, Newsweek, Mental Floss, She Reads, Kirkus Reviews Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=10457"
            },
            {
                "name": "Cozy",
                "link": "https://www.amazon.com/Cozy-Mysteries/b?ie=UTF8&node=7538396011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 37 minutes"
            },
            {
                "name": "Author",
                "value": "Nita Prose"
            },
            {
                "name": "Narrator",
                "value": "Lauren Ambrose"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 04, 2022"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09FYHXPBH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#574 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #3 in Cozy Mysteries (Audible Books & Originals) #8 in Domestic Thrillers (Audible Books & Originals) #28 in Cozy Mysteries (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Crafty ConsumerCrafty Consumer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6FKZWFPK7PVBYWEASBRPIUJCYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1J6VTT6IOJAV5?ASIN=B09FYHXPBH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Maid in the Shade, Then the Sunshine",
                "reviewText": "When my sister chose Nita Prose's The Maid to read for our book club, I thought it was Maid, the novel that became a gritty TV series. Naturally, I was relieved to find out that it wasn't that book. But once I started turning the pages of Prose's debut not-quite-whodunit, my concern returned.Twenty-five-year-old Molly Gray is a maid at a fancy hotel. But she isn't a clock puncher eager to trade her Pledge for party clothes after her shift. Cleaning is Molly's life. She takes unparalleled joy in \"returning rooms to a state of perfection\" and maintains a rigorous home housework schedule in the tenement she shares with her grandmother. Molly and her grandmother are best friends. Actually, Gran is Molly's only friend. Her wisdom, often dispensed as aphorisms, helps Molly navigate the daily challenge of social situations as well as the sometimes not-so-nice (i.e. cruel) colleagues and guests she encounters.So it isn't easy being Molly. And it gets more difficult when she finds a dead body while cleaning the penthouse. What happens next tests everything Molly knows -- and doesn't know -- about how people work. Their characters, their motivations, and their shockingly common tendency to bend the truth. Watching her forge through the forest that is this puzzle is painful, memories of her grandmother and other past moments mingling to reveal the extent of her struggles.Prose's story isn't so much about solving a murder mystery, or even the mystery of Molly herself. It's about understanding -- and ultimately respecting -- people who are different. Because as Gran herself often says, \"We're all the same in different ways.\" By placing Molly in a dangerous situation, Prose magnifies her otherness, rousing our sympathies. But she also shows us that Molly has the rare kind of courage that just might save the day.Poignant and human and sometimes hard to read, The Maid is a metaphor for life's messes. In the end, I was glad we read it for book club.If only as a little reminder that we're each equipped with our own kind of mop.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61W6jal4QFL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat Durham",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNARPVTXR6GNHRRV6BWGBWXEJWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KNISM8LAID8V?ASIN=B09FYHXPBH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "4.0 out of 5 stars What you missed",
                "reviewText": "I thought it was an ok WhoDunnit until the very end, which seemed unnecessary to the story. But then I realized that Molly actually deserved to be in jail because she was an accessory to murder, or at a minimum for obstruction of justice (hiding the pillow, erasing the fingerprints, sending Gizelle out of town, major omissions in her statements to Detective Stark). And she was just fine helping send someone to jail who she knew to be innocent only because she didn't like him. All her life she had had fantasies of vigilante justice towards those who had been unkindly to her. She finally had her opportunity. If those who cared for her had known the truth I don't think they would have stayed so enamoured with her. So, an interesting psychological twist, which all the reviews I have read so far have overlooked.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tina",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF53YGQIWKO4JMWP2FLD42MWJBXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R33SIH88OHBC0B?ASIN=B09FYHXPBH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Good read",
                "reviewText": "The main character gets annoying after awhile but you still root for her and the plot twist makes you so happy you stuck with it to the end. Loved it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lourena Phillips",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE75EP4LKCGNPGYWODE4AP4D57HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2S9VTEEE4D4AP?ASIN=B09FYHXPBH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "3.0 out of 5 stars Not what I expected",
                "reviewText": "Well written but slowly developed mystery. I enjoyed some of it a lot and some of it dragged. I know they wanted to develop the maids character with flashbacks and tediously repetitively described details of her cleaning. I had a hard time not skimming. I did find myself surprised a few times. A fascinating dip into autistic or ocd person.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jerri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH6NZ6XJBICL5WAZTXW7AGCSMVUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQM4050VFIUQ0?ASIN=B09FYHXPBH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars A Little Lean on the Mystery",
                "reviewText": "I really wanted to love this - so many good reviews from some familiar names. It just wasn't that well written to grab my attention. This is probably the 10th book I've read in the past few years with a main character who is a little different. Normally I like the odd ducks, whether it is because they are somewhere on the spectrum or socially dysfunctional from past trauma, whatever the reason. I can empathize with them easily, and usually enjoy their journey and story. For some reason Molly, although hardworking, sweet and kind, just got on my nerves. I'd get so frustrated with her naivety, I'd have to take a break. Some of the situations just didn't make sense, no matter the excuse. There wasn't much tension in the mystery, it's pretty obvious from the get go what's going on.So moving right along, I wish Ms. Prose well. I hope her next book has a little more teeth to it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "E. K.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETV5ZWC6YRJIXWEDWZR4M4PFTUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IMQS3VD0TAPI?ASIN=B09FYHXPBH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 25, 2023",
                "reviewTitle": "5.0 out of 5 stars An Interesting 1st Person Narrative",
                "reviewText": "I’m surprised many reviewers did not seem to understand that Molly is not just a quirky character. She is obviously quite intelligent and, yes, more than a bit odd, but she is also obviously on the autism spectrum with the additional trait of OCD. Every character who comes in contact with her soon realizes that she is “special”. Molly often mentions her inability to correctly read and understand other people, but that doesn’t stop her from being the very best she can be—which is quite awesome! Because she has the ability to cut through “the noise”, tell it like it is with no embellishments, and see the fine details that other people would not notice, she makes a particularly interesting storyteller and witness even though her interpretations are sometimes wrong. This is a great read and is told first person by a lovable character who happens to be on the autism spectrum. You’ll laugh with Molly and be cheering for her every step of the way.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Book Babe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLWEQH5EZB47D5UVUJKQPYYVZBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBPM4N4SBMQEL?ASIN=B09FYHXPBH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 23, 2023",
                "reviewTitle": "5.0 out of 5 stars On the Lighter Side But Worth Reading",
                "reviewText": "This is a \"light\" murder / mystery. The plot is mostly realistic and we get to know Molly well. It's a good reminder that there are people who aren't born cynical and untrusting. The story falls apart a bit as the arrest / court room drama would never happen that way. For instance, Molly wasn't on trial - she was a witness - so why would she have her own attorney cross-examining her.? Only the prosecutor and the defense attorney would have done any questioning. But in the end, it's a cute, feel good story and the good guys win. If you're looking for a simple plot where you don't have to put in a lot of work to read the book, this is a good one.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Valeria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 8, 2024",
                "reviewTitle": "Fue un libro más",
                "reviewText": "Todo en torno a la entrega muy bien, el paquete llegó a tiempo y bien empacado. Respecto al libro, no me encantó, siento que fue lento y predecible, sentí un poco aburrida la historia. Es para pasar el rato, si eres lector frecuente no creo que te enganche.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kevin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "A fascinating insight into the mind of a high functioning autistic character",
                "reviewText": "I found the character to be compelling, and could not stop reading after the first few chapters. Molly is clearly very intelligent, but sees things through a simpler worldview than most others. One of my favorite elements of the book is Molly's evolution from a simplistice right/wrong morality to a more nuanced understanding as she internalizes the lessons from the world around her.Also interesting is that as a reader, I experienced much stronger emotions than Molly herself as it became clear what was happening to her while she did not understand. At the very end, however, it became clear that I had underestimated her just like the other characters in the novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mônica de Mattos Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 3, 2023",
                "reviewTitle": "Comic and curious",
                "reviewText": "Very good reading. When you think you found the vilan, you are taken to another character. At the same time, a light reading.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Placeholder",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 16, 2024",
                "reviewTitle": "Amazing",
                "reviewText": "Absolutely gripping",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 6, 2024",
                "reviewTitle": "An endearing main character and a great murder mystery",
                "reviewText": "The story:Molly the maid takes great satisfaction in her role at the Regency Grand Hotel, returning the guest’s rooms to a state of perfection each day, whatever mess they might have left behind.But what she finds in Suite 401 one day isn’t so easily tidied away. A very important guest is dead, and the police believe it might be more than a heart attack… There is something messy lurking at the heart of the Regency Grand, and who better to deal with a mess than the maid?My thoughts:Although “The Maid”, by Nita Prose set in the modern day, Molly is an old-fashioned (or perhaps more accurately, a ‘proper’) young woman. As she says herself, she doesn’t perceive the world in quite the same way others do, and struggles to deal with people who don’t say what they mean (or mean what they say). She loves and takes great pride in her job as a maid at the up-market Regency Grand Hotel (where I would very much like to stay!), and is diligent and hard-working in applying the training Mr Snow, the hotel manager, has bestowed on her.Despite having passed away several months before the story begins, Molly’s gran is also an important character in the story. Throughout her life she’s guided Molly through a world she doesn’t fully understand, and Molly calls on her memories of her gran’s wisdom and advice to help her make sense of the behaviour of others.When Molly is unlucky enough to discover a body in one of the hotel’s best suites, it soon becomes clear to the reader that Mr Black (who is “very dead”!) was not a nice man… In fact, there are a few unpleasant people in this story, and seeing their treatment of the trusting and loyal Molly is enough to make the blood boil…But there are also those who see Molly’s unique characteristics in the positive light they deserve, and it’s great to see them rally round her when Molly herself is brought under suspicion.As well as introducing us to a truly endearing lead character, this book is also a cracking murder mystery — of all the people who had good reason to hate Mr Black, who is responsible for his death? I’ll leave it to you to find out!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}