{
    "remaining_requests": 1150,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Girl-Novel-Abigail-Dean-ebook/dp/B08H18WHX5",
    "body": {
        "name": "Girl A: A Novel",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Girl-Novel-Abigail-Dean-ebook/dp/B08H18WHX5",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/911Q22urOnL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Abigail Dean",
            "link": "https://www.amazon.com/Abigail-Dean/e/B08BLWYX6S/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 25034,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "AN INSTANT NEW YORK TIMES BESTSELLER “Pitch-perfect... Dean tells this story with such nuance and humanity, you’re desperate to step into its pages.\" —The New York Times “Heart-stopping psychological drama… A modern-day classic.\" —Jeffery Deaver, New York Times bestselling author “A gripping story about family dynamics and the nature of human psychology.” —Good Housekeeping She thought she had escaped her past. But there are some things you can’t outrun.Lex Gracie doesn't want to think about her family. She doesn't want to think about growing up in her parents' House of Horrors. And she doesn't want to think about her identity as Girl A: the girl who escaped, the eldest sister who freed her older brother and four younger siblings. It's been easy enough to avoid her parents--her father never made it out of the House of Horrors he created, and her mother spent the rest of her life behind bars. But when her mother dies in prison and leaves Lex and her siblings the family home, she can't run from her past any longer. Together with her sister, Evie, Lex intends to turn the home into a force for good. But first she must come to terms with her siblings--and with the childhood they shared.What begins as a propulsive tale of escape and survival becomes a gripping psychological family story about the shifting alliances and betrayals of sibling relationships--about the secrets our siblings keep, from themselves and each other. Who have each of these siblings become? How do their memories defy or galvanize Lex's own? As Lex pins each sibling down to agree to her family's final act, she discovers how potent the spell of their shared family mythology is, and who among them remains in its thrall and who has truly broken free.For readers of Room and Sharp Objects, an absorbing and psychologically immersive novel about a young girl who escapes captivity–but not the secrets that shadow the rest of her life.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B08H18WHX5"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Penguin Books (February 2, 2021)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 2, 2021"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4793 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#30,517 in Kindle Store (See Top 100 in Kindle Store) #142 in Women's Psychological Fiction #144 in Mystery, Thriller & Suspense Literary Fiction #285 in Women's Literary Fiction"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 25,034 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3c589fbf-8f18-4288-941b-5d5c8003d74b.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f4f08ce7-6b0b-4164-9f96-8d534fd447bc.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/fafe7215-6566-459e-81e7-812ee6f03835.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/77c7873c-4d8a-4d58-aa3f-1c63221bdef4.__CR0,0,800,800_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4793c5bb-f4ab-49f2-af2b-8127a107abb6.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Katherine Y",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2BP5YW62ZB3VR3NHPHEUNIZ2EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13L09F36GG4KU?ASIN=B08H18WHX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 19, 2021",
                "reviewTitle": "5.0 out of 5 stars Chilling novel about abused siblings has a twist ending",
                "reviewText": "The idea for this novel could have been taken from a recent case involving extreme child abuse. What the author has done is to give voices to seven siblings subjected to torture and to spotlight the enduring psychological damage. The novel reflects on each of the experiences of the children in the family, but the main focus is on the oldest daughter, Lex, who managed to escape and obtain help for the others.Lex and her siblings were chained to beds by their parents, not allowed to bathe, and denied food. They were slowly starving to death. After years of mistreatment, Lex finally escapes and gets help, bringing the police to their suburban prison. The father commits suicide before the police arrive, and the mother is sent to prison for life. Lex and her younger siblings are sent to separate foster homes. Adopted by a policeman working on her case, Lex goes to college and becomes a successful woman. When her mother dies in prison, she learns she has been named executor of the estate, including the house of their torment. She, one of her brothers, and a sister concoct a plan to turn the house into a community center.It requires all the sibling’s approvals to execute the plan for the house, so Lex searches for her other brothers and sisters, some of whom she has not seen for years. The only relationships she has maintained are with Evie, her sister who has been her closest confidante, and Ethan, a successful author who escaped the worst of their parents’ sadistic behavior. In the case of her youngest brother, Lex has to comb through records to find who adopted him. He is the luckiest; because he was a toddler, he remembers nothing of his past. One brother is in a mental institution because of his rages. All of them are affected. Although Lex is outwardly composed, she may have the most severe problem of them all.The horrors recounted by Lex and her siblings may repulse many readers. This novel is not for those who are sensitive to brutal descriptions of child abuse. What kept me reading were the psychological depth the author gives to her characters and the feeling the author was holding back on the whole story. Mystery readers will like a particular reveal involving one of Lex’s relationships that will have them thumbing back pages to see how the author set it up. I recommend this novel for readers who like psychological suspense.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley Story",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKRPFDP3CW3VYG7J34632MZJWGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R188R4AX8VU8UH?ASIN=B08H18WHX5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2022",
                "reviewTitle": "4.0 out of 5 stars A gripping suspenseful psychological thriller",
                "reviewText": "Girl A is a thriller that I think is best described as weirdly detached and deeply unsettling. Lex Gracie is the narrator of this story, AKA Girl A, the girl who escaped her abusive father and rescued her five siblings. This story is split up into seven chapters, the first six are about Lex and her siblings and the chapters are told in present day and flashbacks, the last chapter is where everything unfolds and combusts together. The non-linear narrative, the self admitted unstable narrator, and the ending that had me in tears, makes Girl A a firm favorite. One I will definitely recommend to those who like psychological thrillers told in survivor/flashback format. I cannot wait to read more from this author.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anita",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHBNIGRRMZGBWWY6GGZVAX36CQGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28P1G95KCNZDX?ASIN=B08H18WHX5",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "3.0 out of 5 stars Girl A",
                "reviewText": "The story jumped around alot which made it hard to follow. It also did not explain as the reason for the abuse of their family. Plus the ending left you hanging.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRKMU5PCAWC2YMK2F5PQ3IACYNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I1ARXWWURMGY?ASIN=B08H18WHX5",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2021",
                "reviewTitle": "5.0 out of 5 stars Survivor",
                "reviewText": "It isn’t every day that I come across a book that I can relate to so viscerally as I have with Girl A. Yes, it was scary and sad and the loss that this author has gone through is too terrible for words. All of this is very true. But I haven’t cried in a long time. The trauma I have experienced in my own life has seen to that. And there was a section in this book that caught my breath and I just connected with Abigail. I just felt like I was at the computer with her in that moment, feeling her emotions with her. Because mine were so real. This book hasn’t really been one of healing for me, but there were many quotable moments that I have taken for journaling prompts, and I used these moments for deep inflection. It’s a well-written book that chronicles the life of one woman who observes the lives of her siblings. It is a narrative of horrifying abuse that she somehow survived when others did not: “Did you really think I made it out of that room?”- that was the moment that I cried at for a few seconds before the tears dried up again. Sorry for this, but this is just such an important moment for me. And this is my review. This woman is a hero and I am so thankful to her for being strong enough to tell us, to tell me, what happened to her and to her brothers and sisters. And how the abuse they all suffered through impacted all of them. It gives me hope that there’s a way out, even after what may seem like a long time of “being safe”. I hope, in time, I will find my voice again. For now, Abigail Dean’s book Girl A is a very worthy placement. Purchase this book in whatever format is best for you, and be strong. There are Abigail Dean’s all over the place. Maybe not to the same extent, but they are everywhere. And they deserve to have their voices heard.",
                "reviewVotes": "64 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike 27",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTSLW6NZ4GXQPYNKOOTLJNPHIPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RAREMQ3GX8YNX?ASIN=B08H18WHX5",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 5, 2021",
                "reviewTitle": "4.0 out of 5 stars A very good story!",
                "reviewText": "Had I known the story before hand I would have been very hesitant to read it; but it was told/unfolded in such an interesting way that I was compelled to read on. The story is disturbing but the narrator perseveres and keeps you engaged through the whole thing. She endures hardships but keeps on going and you have this undercurrent throughout that there must be a reckoning coming. Heartbreaking and yet uplifting at the same time I really enjoyed this book.This was one of Amazon Primes first reads books and I am very happy that I chose this book.You run the gamut of emotions but never feel manipulated. Solid story with richly developed characters and worth every bit of time it takes to read this book! Highly recommend!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jilla Lonsdale",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on March 17, 2021",
                "reviewTitle": "An excellent read!",
                "reviewText": "A very compelling story that grabs you from the onset and keeps you interested right up until the end.Amazing flow and character development and an intriguing premise. Grab a coffee or tea (or glass of wine) and dive into this book -- it's a one of a kind read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marie East",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 1, 2024",
                "reviewTitle": "Best book I’ve read in ages!",
                "reviewText": "This book was hard to put down, I have since lent it to several people! Brilliant, thought provoking and well written. Will deffo be looking for more books by this author!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hamna LabeebHamna Labeeb",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on June 10, 2021",
                "reviewTitle": "Great graphic writing",
                "reviewText": "As a writer, here's what I indulged myself in as I read this novel on how one lives on and survives after trauma. More than a thriller, more than an adventurous escape, this book is on the parts we do not wish to talk about. The parts we conveniently forget after a trauma in our life.More often than not, surviving trauma and living on with its shadows falling on us every day of rest of our lives is more harrowing than being killed in the process of being traumatized. In no way is this a slightening of death but it is a loud shoutout for those who have survived, for those who managed to escape and live on, for those who are told, \"That was a long time ago. Get over it.\"Lex Gracie, Girl A, has turned out well against all odds, because she wanted to. The transformations, the shame, the helplessness, the distortions and the need to survive and escape, make her full and human.The story moves forward in flashbacks and present narrative, with chapters titled Girls A to C and Boys A to D (the siblings were 3 girls and 4 boys) and \"All of Us\".Full of life, yet ambiguous enough to leave you guessing the worst, Abigail Dean writes about the House of Horrors and the despicable contents of it (including the state of humans in it) with great graphic penchant. I could see it playing out in front of my eyes and that is exactly what makes the book worth your time.However, once I finished reading Girl A, I was left a little incomplete, a little fuzzy, a little tender but absolutely amazed by the writing in this debut book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51wPKq99o8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Craft",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on April 16, 2021",
                "reviewTitle": "James Craft",
                "reviewText": "Mitreissend von der ersten bis zur letzten Seite. Ihr erstes Werk. Nur zu hoffen das bald ein zweites Buch folgt, und noch viele. Und von Amazon pünktlich geliefert. Vielen Dank!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angie67",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on March 22, 2021",
                "reviewTitle": "Depressing",
                "reviewText": "This is a book you either love or hate. I’m afraid I’m pending toward the latter at the moment.First of all let me point out that this book is listed as a literary thriller but is nothing of the sort! It’s a drama about dysfunctional and abusive parents and the psychological strain their children endure because of it!I can’t even begin to tell you how many problems I had with this book! The first and biggest problem was the writing! I felt I was in the author’s head trying to interpret her jumbled thoughts. The sentences were clipped and scarse jumping from one subject to another.Each paragraph started in a different timeline (there are only 5 or 6 chapters in the whole book, each of them referring to one of the abused siblings) so that I often found myself rereading whole sentences because I thought I was in the past instead of the present and viceversa!Her writing was just all over the place!Another thing that bothered me was that there was no climax or mid-point in the book, just the nightmarish retelling of what these children endured and how the past followed them into adulthood! There was one minor revelation near the end, but by then I had completely lost interest in all the characters.I’m not saying it’s awful, someone else will probably find some hidden meaning and find her writing style innovative and fresh! The author certainly was brave to face such a heavy topic for her debut novel. But I need to enjoy a book, be it a heavy topic or not and that didn’t happen with this book!All in all a very depressing and discouraging tale that failed to convey some much deserving optimism for the future.Not for me I’m afraid!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}