{
    "remaining_requests": 1216,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Maids-Diary-A-Novel/dp/B0B8JY1HCH",
    "body": {
        "name": "The Maid's Diary: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Maids-Diary-A-Novel/dp/B0B8JY1HCH",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41410mCZgXL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Loreth Anne White",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Loreth+Anne+White"
        },
        "brand": "Loreth Anne White",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 41070,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "2023 SOVAS Award Finalist for Audiobook Narration—Thrillers, Best VoiceoverA cunning, twisty, and unsettling novel of psychological suspense with a startling conclusion by Loreth Anne White, the Amazon Charts and Washington Post bestselling author of The Patient’s Secret.Kit Darling is a maid with a snooping problem. She’s the “invisible girl,” compelled to poke into her wealthy clients’ closely guarded lives. It’s a harmless hobby until Kit sees something she can’t unsee in the home of her brand-new clients: a secret so dark it could destroy the privileged couple expecting their first child. This makes Kit dangerous to the couple. In turn, it makes the couple—who might kill to keep their secret—dangerous to Kit.When homicide cop Mallory Van Alst is called to a scene at a luxury waterfront home known as the Glass House, she’s confronted with evidence of a violent attack so bloody it’s improbable the victim is alive. But there’s no body. The homeowners are gone. And their maid is missing. The only witness is the elderly woman next door, who woke to screams in the night. The neighbor was also the last person to see Kit Darling alive.As Mal begins to uncover the secret that has sent the lives of everyone involved on a devious and inescapable collision course, she realizes that nothing is quite as it seems. And no one escapes their past. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "12 hours and 10 minutes"
            },
            {
                "name": "Author",
                "value": "Loreth Anne White"
            },
            {
                "name": "Narrator",
                "value": "Jane Oppenheimer"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 01, 2023"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0B8JY1HCH"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,479 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #22 in Domestic Thrillers (Audible Books & Originals) #68 in Psychological Thrillers (Audible Books & Originals) #116 in Domestic Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Carrie Hall",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFUAPBTBQL5I7S6BFJZTMBEPAQBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NZ48NNXFK6D8?ASIN=B0B8JY1HCH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Twisty as hell!",
                "reviewText": "Wow wow wow! This book was great!I do have to first quickly get out of the way the fact that in the beginning of this book, the multiple POV’s (7 of them to be exact!) was really throwing me off in the beginning. I was getting introduced to character after character after character, whose POV’s were all CRUCIAL to the story, and I was having a really hard time keeping TWO different couples, AND everyone else’s story straight.I had to go through 7 brand new POV’s (the first 7 chapters) before it FINALLY circled back to a character that I was familiar with.And because of that, I literally almost DNF’d this book after completing the first 7 chapters. (Which I have NEVER done!) but I was getting really confused and frustrated.But because I’m stubborn and hate to DNF (and was still already invested in the story by this point, even though I was scrambling to put pieces together) I was thankfully reminded WHY I hate to DNF, which is that I always think to myself “but what if the story gets better from here and I end up being glad I continued?” and “well now I can’t live with myself if I don’t find out what happens!”I am definitely glad that I stuck to it and finished this book! YES, there were still a lot of POV‘s and a lot of moving parts in this story, but I think that ended up being part of the reason why it was so engaging and fascinating. Practically all I read is thrillers and horror, and sometimes the books start to all blend together when you’re reading the same kind of thing constantly.But this book definitely stands out! I think this was literally the twistiest thriller I’ve ever read! It was such a freakin ride, and we are constantly getting a piece of the puzzle revealed. I don’t think there was a dull moment in this book (even during the parts in the beginning when I was confused 🤣)I honestly think it’s gonna be hard to find a thriller that tops this one now. I am going to have to go and see if I can find more by this author.I definitely 100% recommend this book to anyone who comes across it! Especially if you’re in a reading slump! This book will definitely get your heart pounding, and your critical thinking and murder-solving skills turning again!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Darren M. Reed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZBSZO26KTJQPA5STUGVYRCW2SA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZNOU6N1Q0GLP?ASIN=B0B8JY1HCH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 13, 2023",
                "reviewTitle": "4.0 out of 5 stars A twisty novel surrounding many savory characters",
                "reviewText": "This is a very difficult book to review as I have mixed feelings. I like the style of writing. The author alternates the chapters between the Maids Diary, the main characters prior to the murder and the investigators and lead characters post murder. The author does a great job developing the characters and setting the scene. The main characters are the Maid – Kit, Daisy and Jon Rittenberg, Vanessa and Haruto North, the investigators – Mal and Benoit and Kits friend Boon. Jon is an ex-gold medal winning Olympic skier and his wife Daisy is from a very wealthy and prominent family in the area.The story begins with “How it Ends - Slowly, she slides she slides between sleep and consciousness”… This is the murder. The novel then goes into detail of the night of the murder by a neighbor witness and from the perspective of a couple in the midst of a scandalous sexual affair at the sight of the body dumping; they are political figures and cannot report what they have seen because it would expose their affair.When the authorities arrive at the scene of the bloody crime they notice a pie smashed and oozing out of its box on the steps of the house with a note from a friend. It doesn’t take the investigators long to determine it was from a friend of the house owners (Vanessa and Haruto North) Daisy and Jon Rittenberg. We then learn a lot about those main characters. We learn the Jon has a very sordid past that Daisy has helped stay hidden. The story is leading us to believe Jon and or Daisy may be involved with the Murder since the only eyewitness (that speaks to the police) states that one of the people at the scene appeared to be a man and the other a larger (round) person and Daisy is pregnant.I think this is a good suspenseful novel with a good twist at the end, however the alternating timelines (some undated) can be a little confusing.MINOR SPOILERS:The neighbor who reported the crime never saw the body but rather a large rug being lugged out to a vehicle; a vehicle that matches the Rittenbergs. The maids car was also at the scene. However, we learn that the North’s are not who we thought they are. The North’s are confirmed as vacationing out of the country and have been for some time. We now know that the friend of Daisy is a poser living in the North’s house. Meanwhile, another side story is Daisy’s paranoia surrounding ominous and threatening messages she is receiving regarding her unborn baby. They are very personalized and refer to things only people from her past would know about. She is obsessed with who this mysterious person could be and tries tracking down people from her and Jon’s past. She has no idea that that person is related to the main story. The Maid who is the protagonist is quirky in her own right. She loves pretending to be someone she is not and posting social media about a fabulous life that is not hers. She loves snooping in her clients house and learning of their secrets. She is the maid at the Norths and also starts serving at the Rittenbergs. At the Rittenberg’s she realizes it is Jon’s house and her past comes screaming back to her. She is part of the Rittenbergs past.MAJOR SPOILERS:Although we shift our victim(s) from the Norths to the Main; we eventually learn it is no one. We learn that Kit is playing the Rittenbergs and acting as both Kit Vanessa and Mia and has been orchestrating the entire “Fake murder” to set up the Rittenbergs. However, due to the encounter and the devasting effects she has had on Jon’s life we are led to believe that he actually did murder her…My biggest issue with this book is the timelines… I love twists and I love how many authors lead you down a path but in this case I feel the book is written in a way that you cannot put pieces together. For example: On page 302 (Kindle version) the author writes:Kit says: “Full disclosure”, she says as she sets her glass carefully on a small table at her side. \"I only became Mia after I saw whatDaisy had locked in her safe. It really was a point of no return, seeing that recorded footage-that proof of what happened that night at the ski lodge party. This is not true. John meets Kit as “Mia” on page 76 while John is having food and drinks with Henry on 10/17/19 and Kit doesn’t discover the evidence until page 168 during the Maids Diary (undated). So since the diary is undated it could be accurate but it seems to be misleading.",
                "reviewVotes": "24 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "slykesz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLEA5GP6EZNGT3UXIBEH5OP2XMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROBM9Q3I4YFI1?ASIN=B0B8JY1HCH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars WOW !!! This is one amazing book.",
                "reviewText": "I had never heard of this author and was out of books to read, so I took a chance. I am so thankful that I did.Her writing just pulls you in and keeps you wanting more. Several times I stopped and commented to my husband “this is book is amazing !!! I cannot put it down !!!”I am off to find another book written by her. Thank you Loreth Anne White. I love your work !!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rachel Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETWN667O7GRGIWIHYYBNTOWSRUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ54SBDKPUTBJ?ASIN=B0B8JY1HCH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Another Winner from this Author",
                "reviewText": "Oh goodness. Well, I'll say that I didn't think I'd keep reading after my usual \"give it 50 pages\", but I am glad I kept going. I predicted a little, and while I feel too much was left untold at the end, just the story alone is why it's a 5 star read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lesa Duff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGPKBBXD76VK7GH6YWUFYIISAYPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQZ4CSPJ61SO7?ASIN=B0B8JY1HCH",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars Tantalizing",
                "reviewText": "I liked this book a lot. I thought I knew what was coming, but White twisted and turned until I wasn’t sure how it would end. She lost a star simply because I am not a fan of profanity.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Adams",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4X72WR3CSTSLNJSRCYVUV2ZFWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R335LDD0ZKOH?ASIN=B0B8JY1HCH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars One of the best books I've read in a long time",
                "reviewText": "This book keeps you intrigued so much so you do not want to put it down. You're constantly questioning which direction this is going in who is going to become the victim in who is the villain and it's just amazing!! I want more I want more in this style this is just fantastic!! I'm definitely a fan for life if this is a type book that she's going to put out.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGNMOUWVJ4Y5LZ2B3QF2MFF4M5GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SO8JRKA3UVXG?ASIN=B0B8JY1HCH",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "3.0 out of 5 stars I thought it was going to be better",
                "reviewText": "I like the part were kit told daisy and jon that whole truth, it is the turning point of the story. I dislike, how the writer kept changing character point of view or telling their part of the story. I believe it low reader attention to the story, it doesn't make it interest it in a way. Also the end it didn't quite end it as i was expecting. I thought she was going to died which it didn't happen.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael S Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHZKBDLUTULDO3YRGYBQ7UYD2TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LNBFNPM9YIUR?ASIN=B0B8JY1HCH",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Keeps you guessing up to the last page",
                "reviewText": "A fantastic read with lots of twists and turns. I also loved that nothing is as it seems initially; characters are drawn with lots of shades of grey. Expert storytelling. This is definitely a book I'll gift to my friends because there's nothing like sharing a good thriller.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 22, 2023",
                "reviewTitle": "Slowww",
                "reviewText": "To me was so slow some parts but I still found entertainment in my free time thank you I will keep trying this author",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Graham Kippax",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 7, 2024",
                "reviewTitle": "Unputdownable",
                "reviewText": "My first read of a book by Loreth Anne White and it won’t be my last!It had me hooked from the beginning and didn’t let me go until the very end.No wonder that she is on bestseller lists. Well done Loreth",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deep",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 10, 2024",
                "reviewTitle": "Cannot put down",
                "reviewText": "Highly recommended read.All the plot twists, Loreth Anne White is my new favorite author. This book really had me hooked.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hellen Kontos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 17, 2024",
                "reviewTitle": "I was desperate to get to the end",
                "reviewText": "Definitely worth the read. It kept me up most the night so I could get through it. Easy to read and captivating",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regalcanary",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 4, 2024",
                "reviewTitle": "A Twisted Tale Set in Vancouver",
                "reviewText": "Can you ever really “get over” a traumatic experience? If so, what would that process entail? Or is it simply impossible to “get over” trauma, at best learning to live with the truth of it, to find a narrative for events that you can be at peace with? These are the essential questions behind the events in this novel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}