{
    "remaining_requests": 1125,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Identity-A-Novel/dp/B0BH9BBTZM",
    "body": {
        "name": "Identity: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Identity-A-Novel/dp/B0BH9BBTZM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GeJWWzuIL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Nora Roberts",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Nora+Roberts"
        },
        "brand": "Nora Roberts",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 23206,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "\"Narrator January LaVoy brings a richly layered performance to a story.... She expertly handles the large cast of multigenerational characters\" —AudioFile on HideawayThe #1 New York Times-bestselling author's terrifying new thriller about one man's ice-cold malice, and one woman's fight to reclaim her life.Former Army brat Morgan Albright has finally planted roots in a friendly neighborhood near Baltimore. Her friend and roommate Nina helps her make the mortgage payments, as does Morgan's job as a bartender. But after she and Nina host their first dinner party—attended by Luke, the flirtatious IT guy who'd been chatting her up at the bar—her carefully built world is shattered. The back door glass is broken, cash and jewelry are missing, her car is gone, and Nina lies dead on the floor. Soon, a horrific truth emerges: It was Morgan who let the monster in. \"Luke\" is actually a cold-hearted con artist named Gavin who targets a particular type of woman, steals her assets and identity, and then commits his ultimate goal: murder. What the FBI tells Morgan is beyond chilling. Nina wasn't his type. Morgan is. Nina was simply in the wrong place at the wrong time. And Morgan's nightmare is just beginning. Soon she has no choice but to flee to her mother's home in Vermont. While she struggles to build something new, she meets another man, Miles Jameson. He isn't flashy or flirtatious, and his family business has deep roots in town. But Gavin is still out there hunting new victims, and he hasn't forgotten the one who got away.A Macmillan Audio production from St. Martin's Press. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 4 minutes"
            },
            {
                "name": "Author",
                "value": "Nora Roberts"
            },
            {
                "name": "Narrator",
                "value": "January LaVoy"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 23, 2023"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BH9BBTZM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#422 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #12 in Romantic Suspense (Audible Books & Originals) #25 in Women's Fiction (Audible Books & Originals) #56 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "P. Blevins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5OZRDARE5O55VBCRBHWGYCO5WQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3RUXNDVY8RO6Y?ASIN=B0BH9BBTZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars excellenr",
                "reviewText": "Identity is an excellent book by Nora Roberts. I simply could not put it down. It points out how important your identity is and how devastating identity theft can be.Morgan Albright had been an army brat while growing up. Her father's career kept them constantly on the move as did her mother after the divorce. Morgan longed for a place to set down roots. After college, she settled on a small town near Baltimore. By working two jobs and careful planning and saving, she finally bought a small house and began setting down roots. Her best friend, Nina, moved in with her to help pay the mortgage. Now that she had her house, she began the second phase of her dream, to own a bar. She loved tending bar and talking to different people all the time. She was good at what she did.One evening, she met Luke Hudson in her bar. He was an It guy and traveled a lot designing and installing computer systems in homes and businesses. Morgan liked talking to him and finally, he asked her to dinner and unlike herself, she agreed. Finally, she invited him to a dinner party as her house with Nina and her boyfriend Sam. Though neither Nina nor Morgan cooked much, with Nina's mother's help, they managed to cook a very good meal. The four of them had a great time, although Luke had to leave early for a new assignment.Several days later, while Luke was still gone, Nina was sent home from work as she was sick. Unfortunately, that same day, Luke broke into the house and taking some software he had installed on Morgan's computer earlier. This software enabled him to access all her financial accounts. Unfortunately, Nina caught him in the act and he murdered her. He ransacked the house for valuables and then left. Hours later, Morgan discovered Nina's murder. Later, she learned Luke was actually a con artist and murderer who stole women's identities and then murdered them. Morgan was his intended victim. By the time his identity was confirmed, he had ruined her. He had taken all her money and savings, ran up credit cards in her name, taken out loans in her name leaving her bankrupt with nothing but Nina's run-down car. How was she to get out of this mess? She was forced to start over again from rock bottom. Her new start began with her moving home to Vermont to live with her grandmother and mother as she started her life anew.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "bonnie keator",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELXJICVJJ6ICTMC7VCLMISH4IBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGXTG7PCCCH2W?ASIN=B0BH9BBTZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars It is Nora-what else to say?",
                "reviewText": "I enjoyed this book-a bit of a different storyline, although Morgan is the usual tall blonde with shortish blonde hair. Just once I'd like to see a short, long haired heroine. Anyway, The doh-Howl-is great! Morgan's best friend is murdered in their home, and she has to move in with her mother and grandmother. Her drams have been crushed, she thinks, but of course she falls in love with someone, and the murderer of her friend is loose, and going to kill her also. All ends well, My review isn't the greatest, but I don't think you will be disappointed reading this.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtney F.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWXODPC63DAZRWP47G4EI4AUQDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MDQT1CIE5VNW?ASIN=B0BH9BBTZM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Another great romantic thriller!",
                "reviewText": "I have to preface this review with the fact that I am a HUGE lover of Nora Roberts books (pretty sure I've read all of them at this point) and was SUPER excited to be given this opportunity to read this ARC. So excited, in fact, I didn't even bother to read the description and just jumped right into the story. Which, in hindsight I'm really glad I didn't read it because it added an unintended surprise factor for me along the way. Honestly, I think this may be my favorite romantic suspense ever by Nora Roberts because of that reason. I started this book last night and ended up staying up to 2AM because I HAD to finish it to see how it ended! It was that good.Now, having said all that, these are few of the reasons why I love Nora Roberts' books in general and why you should read this one in particular. First, she is a master at developing characters and relationships within stories. I always feel like when I'm reading her books I either fall completely in love with the characters or want to be BFFs with them. I feel like I'm a part of their family and am invested in their well-being. I also love the inner strength of her characters - they can have the most terrible things happen to them and still manage to get up in the mornings and live life. In Identity, Morgan is a woman who fights fiercely for her independence and even when she gets knocked down and everything is taken from her, she still finds that inner strength to keep going, to keep getting up each day and start again. Morgan discovers she is stronger than she realizes in the face of her perceived failure and in the end is capable of putting down those much desired roots. She also is just such an inspiration character. You just keep rooting for her and wanting for her to make it out of the nightmare she ends up living through.Second, Nora Roberts just seems to know how to craft the scene and weave details of everyday life into a fascinating story. If she were to literally write about someone who got up each day and went to work and came home and nothing exciting happens, I'd still read it. This book kind of has that feel - Morgan is just living her life when something horrible happens to her and the story becomes how she picks up her life in spite of this awful event (this is a theme that Nora Roberts has written in the past, and each time it's always slightly different and unique, which I love).Third, the aforementioned \"awful event\". This is definitely a suspenseful thriller. There is no \"whodunit\" component - you will know who did the awful deed and why. The suspense is all about the when and the what in this book. When will the awful even rear its ugly head once again? What more awful things will be done and what will Morgan do to respond? Along the lines of character development again, one of the most interesting thing about this book is the dual progression of two characters: the protagonist (Morgan) is evolving and growing stronger while at the same time the antagonist devolving and coming apart. This was beautifully woven into the overall storyline and added to the suspense - when will the antagonist fully come apart and what happens next?Overall, I loved this book. There is a bit of romance thrown in there (because would it really be a Nora Roberts book without a little romance?? Absolutely not!), but it's not thrown in the story in a way that distracts from it or takes away at all. It actually adds to the growth of Morgan's character and just gives you one more character to love. I cannot wait to buy this book and share it with my friends and family. 100% absolutely recommend if you love a good suspenseful thriller and amazing characters.Thank you SO MUCH to NetGalley and the publisher for the opportunity to read this ARC in exchange for an honest review.",
                "reviewVotes": "68 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Babs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCMDKCDQWUACNIVTJN6JTO7EVVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FOI3HZMD36JX?ASIN=B0BH9BBTZM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "4.0 out of 5 stars Only TWO HOURS of sleep!",
                "reviewText": "I initially just got a free sample to see if the book was something I would be interested in and possibly purchase down the line... I REALLY didn't have the time to read it last night since it was ALREADY LATE (My husband had already gone to bed!) PLUS with an early morning Doctor appointment in the morning... BUT Nora being Nora just pulled me in from the very beginning! (I KNEW BETTER) So if course I HAD to buy it!! I looked up at the clock at 3AM, but by this point I was WIDE AWAKE and knew I was in for the duration! There was NO WAY I could sleep until I finished it! If my Border Collie (ESA/Service Dog) hadn't climbed up on my LAP (?!) to CUDDLE at 4AM being EMPATHETIC to my emotional state, I DID MENTION THAT HE'S A BORDER COLLIE and NOT a potential Lap Dog LOL He positioned himself to paw my Kindle Fire and I finally gave up after he SHUT DOWN the Kindle App THREE TIMES! I brought it with me to finish in the waiting room, but they took me right back, FIGURES! SOOO I FINALLY finished it when I got home! This book was different than what I'm used to coming from Nora and I must say it kept my interest throughout! The ONLY reason I gave it 4 Stars instead of 5 is because the epilogue could have been a little more extensive, my opinion....",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Virginia Shepley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 29, 2024",
                "reviewTitle": "Hard to put down loving it",
                "reviewText": "Interesting at all times .held my interest which I have been having trouble finding a good book to read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle-klant",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 24, 2023",
                "reviewTitle": "Good summer read",
                "reviewText": "As usual Nora Roberts reads effortlessly and the story takes you off.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 20, 2023",
                "reviewTitle": "Reading",
                "reviewText": "Enjoyed immensely! Well written suspenseful, great finish!I look forward to reading more novels by this author. I like her storytelling style.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zobida Ali",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 13, 2023",
                "reviewTitle": "this book was Ok not great.",
                "reviewText": "it is all about family which this author does well.,",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Winifred ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 24, 2023",
                "reviewTitle": "Fabulous",
                "reviewText": "I started this book at 8 am enjoying a cup of coffee. I was engrossed by chapter 1. Finally did some housework at 2 pm. This book I found difficult to put down. I loved the characters and how they interacted. So believable. I finished the book on day later at midnight. I had appointments all day so started reading at 7 pm. I would love to see this book as a movie. I thinkI have read most of Nora Robert’s books. My favourite is Public Secrets . I reread it every year or 2 . This I will re read too.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}