{
    "remaining_requests": 1133,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Leave-World-Behind-Novel/dp/B083Y64H85",
    "body": {
        "name": "Leave the World Behind: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Leave-World-Behind-Novel/dp/B083Y64H85",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41 8V VvyYL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Rumaan Alam",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Rumaan+Alam&search-alias=audible"
        },
        "brand": "Rumaan Alam&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 18731,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A Read with Jenna Today Show Book Club Pick!Finalist for the 2020 National Book Award (Fiction)A Best Book of the Year From: The Washington Post * Time * NPR * Elle * Esquire * Kirkus * Library Journal * The Chicago Public Library * The New York Public Library * BookPage * The Globe and Mail * EW.com * The LA Times * USA Today * InStyle * The New Yorker * AARP * Publisher's Lunch * LitHub * Book Marks * Electric Literature * Brooklyn Based * The Boston GlobeA magnetic novel about two families, strangers to each other, who are forced together on a long weekend gone terribly wrong.From the bestselling author of Rich and Pretty comes a suspenseful and provocative novel keenly attuned to the complexities of parenthood, race, and class. Leave the World Behind explores how our closest bonds are reshaped—and unexpected new ones are forged—in moments of crisis.Amanda and Clay head out to a remote corner of Long Island expecting a vacation: a quiet reprieve from life in New York City, quality time with their teenage son and daughter, and a taste of the good life in the luxurious home they’ve rented for the week. But a late-night knock on the door breaks the spell. Ruth and G. H. are an older couple—it’s their house, and they’ve arrived in a panic. They bring the news that a sudden blackout has swept the city. But in this rural area—with the TV and internet now down, and no cell phone service—it’s hard to know what to believe.Should Amanda and Clay trust this couple—and vice versa? What happened back in New York? Is the vacation home, isolated from civilization, a truly safe place for their families? And are they safe from one other? Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Family Life",
                "link": "https://www.amazon.com/Family-Life-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11047977011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "7 hours and 26 minutes"
            },
            {
                "name": "Author",
                "value": "Rumaan Alam"
            },
            {
                "name": "Narrator",
                "value": "Marin Ireland"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 06, 2020"
            },
            {
                "name": "Publisher",
                "value": "HarperAudio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B083Y64H85"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,121 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #122 in Family Life Fiction (Audible Books & Originals) #206 in Literary Fiction (Audible Books & Originals) #242 in Women's Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Rick Howell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQWLUPEIZK7OKD5C3SYVQVA6KWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1C64I3USS1HRC?ASIN=B083Y64H85",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars A novel that doesn't disappoint",
                "reviewText": "For people who have seen the Netflix movie version of this - which was excellent - you won't be disappointed in the novel. I don't read a lot of novels, but after watching the movie, I had to get this one. It's worthy of the same praise the film is getting. The writing is sparse where it has to be, yet filled with the details that often get lost in a movie. It's easy to read because it's so well-written. One of the themes that really interested me was just how anxious and worried people are in our time. It takes a while to really figure out what's going on here, but when we do, it's not really a surprise. Perhaps the worst we can imagine is just ahead.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tasha Parrish",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZJSHMB32OR6V2PZ3RYAVFDHGEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R228780VGYQ4XV?ASIN=B083Y64H85",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Unexpected",
                "reviewText": "Unexpected as in, I read this on my Kindle and didn’t even notice I had finished it until that last page, half blank! Of course I wanted more, but should have known the way future details were written in as Easter eggs that they were all I was getting.Honestly, the first 1/4 of the book ticked me off (too many inner dialogues, too many focuses on body parts, pointless story so far?). But it picked up, and by halfway I was in it for good. And it did get good. I only wanted to smack one of the adults by the end, not all 4.Lots to think about. I’ll be Googling hypersonic noise, intergenerational trauma in the animal population, and unexpected tooth loss, so please don’t report me!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan C. Velandia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFRLUOJBBIDRNG2TELA7IUA7ISA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S24A9DFFYOH2?ASIN=B083Y64H85",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "3.0 out of 5 stars A great beginning of a story that slowly fades away...",
                "reviewText": "Clay and Amanda go on a family vacation with their children to a beautiful cabin far from everything and everyone... Nothing new there... One night, the owners of that house, Ruth and George, show up at the front door. There's been some sort of blackout and they had no idea where to go, except their own house... That, right there, it's the recipe for a fabulous horror / scary book... But no, it disappoints...I absolutely loved the beginning and all the details the author gives the reader: the smells, the sounds, the little movements... It's all those little things that made the situation and the characters feel alive, at least to me! And I felt right there, next to them. The story keeps getting interesting, you start wondering what's going on and if Ruth and George are truly the owners of the house....And slowly, the rhythm starts decaying. It's interesting to witness the characters getting to know each other and try to figure out what's happening in the real world, but it comes to a point when it feels the story is stuck in the same dynamics. It's pretty clear that they all feel like time is going slower, like everything gets weird and they enter this weird numbness... But it feels repetitive to me, even boring at moments...Yes, there are great phrases all around, reflections about relationships, parenthood, even a bit of racism... The topics and the situation are all perfect to create a better drama, or a nice thriller... But it kinda gets stuck in the way, in my opinion. I kept going with the audiobook thanks to the fabulous narration of Marin Ireland. She absolutely nails all the inflections for every character, the dramatic charge of the dialogues, their doubt, fears and anguish... She was amazing!It inevitably reminded me of Paul G. Tremblay's \"The Cabin At The End Of The World\" and its film adaptation, the whole \"end of the world\" idea, the emergency system, the urgency... And its weird ending, as well... I feel there's a common denominator there, and not many options to finish a story like this... Some people loved it, some felt disappointed (like me), I guess I was expecting a lot after its interesting beginning and a great writing... But it was entertaining, after all.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. Ali Fant",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSECRC5QAZYJTWSYRP4CJO72D7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QMTZB3572MMZ?ASIN=B083Y64H85",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "1.0 out of 5 stars Recast of \"The Next Voice You Hear \" film, but far less hopeful and uplifting - an Elevator Story.",
                "reviewText": "Review of Leave the World Behind, 2023The book seems to be a recasting of “The Next Voice You Hear,” the 1950 movie starting James Whitmore (1921-2009) and a pre-First Lady Nancy Davis Reagan (1921-2016). As in the 1950 film, the reader is never told what happened to force the end of humanity. There is too much implicit and explicit sexuality in the book as if the only purpose of humanity is animal sexuality. This is not a spiritual lifting book like the 1950 film where the “Voice” heard throughout the world on all radio and television channels is in the native language of the listener – except for Whitmore – who hears nothing for technical reasons. The reasons he cannot hear God is because of external factors: the radio is broken, television has a bad tube, etc.In the film, everyone knows what is coming – except for Whitmore. He only hears God’s Pronouncements second-hand from other humans. In the Alam book, God is dismissed as a useless superstition of less enlightened humans.It is not a fun book to read for happy endings.Two notable quotes about President Barack Hussein Obama II are in the book – which was made into a 2023 movie produced by President Obama.“That was something he’d disliked in Obama; the nebulous almost religious promise. He (G.H. protagonist) preferred a plan.” Page 178 in e-Book.“So he didn’t like Obama, either. It had to do only with the presumption of it. The fist bumping, the joviality. It insulted him, a mockery of the world as he understood it.” Page 227 in e-Book.Basically, the book is an “elevator story” story line used in many television shows and movies when funding is low. This is not to be confused with the Elevator Pitch used for sales presentations. This is a “remote house” storyline where the actors are trapped for unknown reasons in their situation.Dr. Ali Fant, WB5WAF",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "PATRICK KELLY",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 8, 2024",
                "reviewTitle": "Saw the movie first",
                "reviewText": "Read the book but the movie is different in a good way. Saw the movie three times. It takes a new perspective on war",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mariana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 14, 2023",
                "reviewTitle": "Libro dañado",
                "reviewText": "Llegó dañado, al parecer el libro no es nuevo :(",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul@Aude_France",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 10, 2024",
                "reviewTitle": "Scary",
                "reviewText": "A very intense novel that should be read within as short a time as possible to keep the tension going. Throughout the book, the author builds a feeling of menace which at first the reader might believe is just in the characters' imaginations but which gradually becomes real.This is also a book about being a parent, especially a father as the fathers in the story struggle with helplessness and despair. Not to mention their own fear.Very much recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carolina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 22, 2024",
                "reviewTitle": "etwas zu detailliert, aber spannend",
                "reviewText": "Ich habe das Buch noch nicht fertig, aber die Spannung lässt mich weiter.Lieferung was schnell und das Buch war gut verpackt",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "zania",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on October 19, 2023",
                "reviewTitle": "awful book",
                "reviewText": "not interesting. pointless. waste of time. you can tell the author thinks that detailed descriptions and metaphors means good storytelling. gross. the book starts and ends nowhere.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}