{
    "remaining_requests": 1319,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dark-Matter-Novel-Blake-Crouch/dp/1101904240",
    "body": {
        "name": "Dark Matter: A Novel",
        "price": "$9.91 $4.33",
        "originalPrice": "$18.00",
        "rawPrice": 9.91,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dark-Matter-Novel-Blake-Crouch/dp/1101904240",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51pNE1le6lL.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/517yrrnpbSL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Blake Crouch",
            "link": "https://www.amazon.com/Blake-Crouch/e/B001H6U8X0/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by GoodwillVSB.",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 69645,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 39 mins",
            "$3.99 delivery Tuesday, February 27."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=720360"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Random House Publishing Group; Reprint edition (May 2, 2017)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 368 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1101904240"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1101904244"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.2 x 0.8 x 7.9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#677 in Books (See Top 100 in Books) #6 in Technothrillers (Books) #37 in Science Fiction Adventures #234 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 69,645 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A Conversation with Blake Crouch author of DARK MATTER Q. In your own words, can you introduce readers to the premise of Dark Matter? A. A brilliant physicist named Jason Dessen is living in Chicago with his wife, Daniela, and son, Charlie. He is a true genius, and while there was a point in his late twenties when his research could have made him a star in his field, he instead chose a family-focused life. One night, while walking home, he’s abducted by a mysterious masked man and injected with a drug. When he next awakes, his world has completely changed. He’s no longer married, doesn’t have a son, and has achieved professional success beyond his wildest dreams. This sets him on a thrilling, mysterious, and at times terrifying journey to learn what has happened to him, and to find his way home to the people and the life he loves. Q. Where did the idea for the novel originate? A. For the last decade, I’ve wanted to write a story that hinges on quantum mechanics. I tried several times to write a version of Dark Matter - getting into Spoiler Territory Here. Three different story lines had been teasing me, and I’d tried and failed to write them all separately. One story line involved the box. Another involved the idea of meeting yourself. And the last was about a man being hopelessly lost in time. The novelist Marcus Sakey is one of my good friends, and we always meet up at the inception stage of a new book to pressure-check each other on our ideas. While we were in Chicago two years ago, I was pitching each of these ideas to him separately when it occurred to me they were actually all part of the same story. They suddenly clicked together, like puzzle pieces, and I was off and running. I find the writing process endlessly mysterious and wonderful. Q. Millions of readers will recognize you as the author of the bestselling Wayward Pines trilogy and for your suspense novels and short stories. Dark Matter is a new direction for you. Can you tell us a bit about what sparked the change? A. In a way, Dark Matter is very much like the Wayward Pines trilogy in that it’s a thriller with a backbone of speculative science. But with this book, I wanted to push myself to do something bigger and better than I’d ever written before. The story opens up much faster than Wayward Pines and is larger in scope — about as large as it’s possible to get, really, given that it takes place (Spoilers Ahead!) in the multiverse. And the quantum-mechanics underpinning for the premise was a huge challenge to tackle. Trying to understand that science, even on a basic level — let alone incorporate it into a story without dragging the narrative down into incomprehensibility — seemed so daunting. But I knew that if I pulled it off, it would let me play with some really big ideas about our day-to-day existence and the choices we make that haunt us. It allowed me to build a really cool, far-out thriller plot around themes that felt very grounded and meaningful to me. Q. Dark Matter is grounded in very real scientific theory and principles — quantum mechanics, superposition, etc. How did you go about weaving the science so seamlessly into the narrative and making it understandable to a lay audience? A. I hope it’s seamless, thank you! I am definitely not a physicist. In fact, I took as few science and math courses as I possibly could on my way to my English degree at the University of North Carolina. If the science is understandable to a lay audience, it’s because I’m a lay audience. To prepare, I read a ton of books on the subject and pulled out the elements of quantum mechanics that intrigued me — and that I could actually comprehend. One of the most fascinating things I stumbled across was a Ted Talk by Aaron O’Connell entitled “Making Sense of a Visible Quantum Object.” Unlike most material on quantum mechanics, which focuses on subatomic matter and can feel very abstract, O’Connell’s talk is about how quantum mechanics might actually be at work at the macro level. At our level. And what that might imply about the world around us. His presentation (which is short and easily findable on YouTube) is worth viewing. When the book was done, I hired a brilliant professor from USC named Clifford Johnson to read the manuscript and make sure I hadn’t gone too far off the rails. This is speculative fiction, and there’s still a certain leap the reader has to be willing to make, but I wanted to present the concepts behind the story with as much accuracy as I could. Q. Do you yourself believe there could be other Blakes out there living in alternate realities? A. According to the Many-Worlds interpretation of quantum mechanics, every choice we make and every event that affects us really does cause reality to branch into alternate timelines. So, as crazy as the concept sounds — sure, it’s absolutely possible. The idea of different versions of myself living different lives, with different careers, spouses, children, etc., was actually my main inspiration for writing this book. Q. If you had the chance to enter “the box” and explore parallel universes, would you? A. Never! I can’t imagine a more dangerous place to be. The chances of finding another world like ours are unimaginably slim. The odds of stepping into a world of ruin and fear and destruction are massive. Q. While Dark Matter certainly has elements of science fiction and is a vivid suspense thriller, themes of love and family also seem to be at the heart of the story. Would you say that’s a fair assessment? A. Absolutely. Dark Matter is a thriller, of course, but it’s also the first love story I’ve ever written, and I worked hard to strike a balance among thrills, science fiction, and genuine emotion. To me, it’s the love and family elements that make up the beating heart of Dark Matter. Q. Daniela’s character is also essential to not only the plot of the novel but to the tone and emotional feel. What was the inspiration behind her character? A. With Daniela, I wanted to explore the flip side of Jason’s experience. What would it be like to meet another version of your spouse? What if they were married to someone else or worked a different job or you two had never met? Would there still be a flicker of electricity? Would there be some recognition? Would the intensity of your relationship in your world bleed over, on some small level, into others? Q. Do you see any of yourself in your characters? A. Very much so. It never really occurs to me until I’ve finished a book, but all of my novels are ultimately therapy and reflective of what I’m dealing with personally during the writing. The last few years have been insanely busy for me on the professional front, and I often feel the tension between me the writer and me the father and husband. The pull of both worlds. It’s not as simple as either/or, but every day we make choices about the person we want to be, the life we want to have. So Jason’s story hits close to home, because I feel like I’ve been wrestling lately with the same push and pull between family and career, and trying to find that balance. Q. Speaking of being busy, in addition to being a novelist, you’re currently adapting the screenplay of Dark Matter for Sony, producing for the Wayward Pines TV series on FOX, and writing/producing Good Behavior, a new TV series (based on another of your novels), for TNT. How are you able to move so fluently across mediums? And how do you find the time? A. I view myself primarily as a novelist, but I love the process of taking a book and turning it into film and television. The mediums are quite different, but it’s all about story structure at the end of the day. The film/TV business lights up the extroverted part of my personality, while the novel writing very much speaks to my introverted self. Time is becoming an issue, because I never imagined I would be lucky enough to have two TV shows going into production simultaneously and this script adaptation of Dark Matter to contend with. As much as I’m enjoying it, I also find myself getting more and more excited about that moment when I get to go back to the basics of being a novelist and figure out my next book. The brainstorming process of a new novel is my favorite part of writing. All potential and possibility. Q. You’re originally from North Carolina and spend a great deal of time in New York and Los Angeles for your film and TV work, but you live in Durango, Colorado. What drew you there? A. I moved to Durango out of college, sight unseen, because I love everything about the West. The wide-open space. The history. The mentality. Rain curtains over the desert. How much deeper and more rattling thunder sounds as opposed to everywhere else. Sage brush. Mountains. Desert. Snow. But most important, a serene, contemplative place to write.",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/vc/7b1a4a1f-5a0c-4ff0-aabc-9ee0f89711bb._SR300,300_.jpg"
                ]
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/538e026f-0c92-4158-8f4d-15d32be74242._SR970,300_.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7b1a4a1f-5a0c-4ff0-aabc-9ee0f89711bb._SR300,300_.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Beth Deese",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOIPCBED2R4JHUF5ZR2LR7TKYCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34CBYB0CA2FLM?ASIN=1101904240",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Sheesh! What a mind melting journey!",
                "reviewText": "This book was one wild ride and I loved it! Have you ever wondered about the road not taken in your own life? About the possibilities had you made any other choice but the ones you did, who you would be, what your relationships would be like, what you might have accomplished? Maybe there are multiple versions of us out there now, who made those choices, who are living alternate realities from our own.It’s all a little much and Crouch’s journey into the multiverse is all a little too much as well but in the best way. It’s a suspenseful thriller that meets sci fi and the result is electric!Jason Dessen is a physicist past his prime, now teaching college classes and enjoying his life with his wife and 15 year old son. His life is happy, mostly. But he has questions that nag in a small corner of his mind, the what ifs in life. One evening, life takes a very sharp turn left and he faces a high stakes life or death puzzle of how to get back on the path he needs to be on.The story is a fast paced heart pounder. I was a little nervous when some of the scientific terminology started coming out but Crouch does a very good job of explaining some key theories like quantum physics, parallel universes and Schrodinger’s cat. I feel a little smarter! But also, a little mentally numb trying to keep up with this insane story.Have fun digging in! You’ll enjoy it!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GreasyLittleDog",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOCQQWGTP3UNSZ7YSDVPNLEJ6GA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3INPL9SFM32Q3?ASIN=1101904240",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Good read",
                "reviewText": "It was interesting and held my attention. Just enough heart vs. sci fi. A tad unbelievable but really only a tad (after all it is sci fi).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Prashanth Iyer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4A7JVODB5523X2NQWDMUPC6IJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRJ6CHIT3MZHB?ASIN=1101904240",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent sci-fi book that leads to some interesting psychological questions",
                "reviewText": "Excellent sci-fi book that leads to some interesting psychological questions. This book plays with quantum mechanics, but is easy to follow and fun to read. The ending was great and I just want to say - there are a bunch of reviews which say it started off well and then slowed down - I did NOT feel that at all. It was a decently good fun paced book throughout. As a reference - I liked Project Hail Mary , after that I read the 3 body problem which I felt was boring and slow paced in the beginning , then I read this one - which is awesome again. I am going onto Recursion (his other book) next!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Huggins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFEU5FKYZCBRDUAUQIN2YO3SWNYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V9331GAIPZAD?ASIN=1101904240",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 22, 2016",
                "reviewTitle": "3.0 out of 5 stars Definitely an airport or beach novel, though somewhat thought-provoking",
                "reviewText": "I bought this book, after reading a very positive review in a magazine, on the mistaken assumption that it would be a William Gibson novel--that is, a book that used an intense exploration of scientific facts to create a haunting reality that gets deep into your head and leaves you not quite sure just what you've encountered. Instead, I felt as though I were reading a rehash of a great many other things, books and film, that I've read or seen, including Sheldon J. Pacotti's novel \"The Demiurge,\" Sam Shepherd's play \"True West,\" the TV series \"Awake,\" with Jason Isaacs, and the movies \"Julia and Julia,\" \"Total Recall,\" \"Regarding Henry,\" \"Somewhere in Time,\" \"The Thirteenth Floor,\" \"Primer,\" and \"The Age of Adaline,\" as well as other TV programs and movies whose titles I have simply forgotten.The book is, to be sure, a page-turner, and I read it through in a single afternoon, all 300+ pages, while stranded at an airport waiting for my canceled flight to finally be scheduled for takeoff. It kept me fully absorbed, and the last few chapters were quite suspenseful. But in the end, it was the intellectual equivalent of a meal at MacDonald's.The premise of the book is that the \"multiverse\" theory of some physicists is actually true, and that someone might find a path from one such universe to another and possibly wreak havoc.The \"multiverse\" is an idea based on quantum physics. According to this theory, whenever we make a choice, an entire different universe \"splits off\" from the one we know, and in that universe, we made the other choice. Thus, according to this theory, there is a universe in which Hitler was admitted to art school and never sought political power, so the Third Reich never happened.Now imagine that a physicist had invented an advanced machine, and the Hitler we know of began to wonder what his life might have been like as an illustrator of popular magazines, and he found a way into that alternate universe. Meanwhile, the obscure artist version of Hitler found himself yanked into the universe we know, with the Nazi hierarchy addressing him as Fuhrer and asking to know what his plans were for world conquest.I cite the above only as an illustration. The book has nothing to do with Hitler. It concerns an obscure American physics professor teaching at a local college near Chicago, married to a woman with artistic talent, and with a teenage son. Fifteen years earlier, the professor was on his way to making path-breaking discoveries in science and being in the running for international prizes, and his wife might have been a very famous artist. Instead, she became pregnant, they decided to keep the baby and stay together, and now, they live lives of near-contentment, loving each other and their son, to be sure, but occasionally still wondering what might have been.One night, after leaving a celebration at a bar for a pal who actually did win international prizes and renown, the humble professor finds himself kidnapped at gunpoint by a man in a mask, who takes him to an abandoned industrial plant, forces him to strip, and injects him with a drug. When the professor awakes, he finds himself in a parallel world where serious and ruthless men treat him as a celebrity and are waiting to know what he will do next in the service of the large and powerful organization that in this world, he helped found.In this world, he even meets his parallel wife, now a famous artist, though she remembers him only as a boyfriend who broke up with her 15 years before. Determined to get back to the world he knows, he sets out into nightmarish adventures via a trans-dimensional machine that he invented as his \"successful\" self, emerging into various alternate Chicagos, some of them horrifying, while others are passable but never quite right.Will he ever make it back?And if, as the theory holds, our choices bring other universes into existence, could he also have birthed alternate selves, even in the course of his quest, all of whom have the same idea of reclaiming the life he once knew?As Arnold Schwarzenegger's character says in \"Total Recall,\" \"If I'm not me, den who da h___ am I?By the way, I could be wrong, but I believe the book is mistitled. Dark Matter is a known and demonstrable property of the universe that is the only way to account for the universe's weight and shape, as well as certain gravitational phenomena. It is no longer considered speculative and, as far, as I know, the \"multiverse\" theory is not based on it. The idea of a multiverse is, indeed, a logical extrapolation from certain demonstrated principles of quantum physics, and some scientists find it quite plausible, but it is not, as far as I know, based on dark matter, nor is it considered a settled question, as dark matter is. I could be wrong. In any case, \"Dark Matter\" is a more intriguing title than \"The Multiverse.\"",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXEFAA5TZNH7OFZNEUJK4P3VZPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TZN9Z5OYCXYL?ASIN=1101904240",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Interesting book!",
                "reviewText": "I will say that the first 100-ish pages were kind of boring, but the writing style was really easy to read so it wasn’t terrible. Interesting concept for a book, though. Also it wasn’t too difficult to get into. Some sci fi books use big words and confusing terms, but most people have heard about the multiverse theory, so it wasn’t overwhelming or confusing. Really enjoyed!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SeasonedBuyer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 31, 2023",
                "reviewTitle": "exciting, exhilarating, thought-provoking",
                "reviewText": "I devoured this book. I’m grateful I started reading on a Friday. I couldn’t stop. This book was phenomenal. Go into it blind. Enjoy the ride.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 31, 2023",
                "reviewTitle": "Emocionante",
                "reviewText": "Livro cheio de emoções e questionamentos.Algumas vezes previsível, mas sempre com um algo a mais que não tinha como imaginar!!Uma história que prende do começo ao fimRecomendo aos que amam ficção científica, ação e aos que buscam uma história única sobre um amor que ultrapassa dimensões",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tilly H ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "brilliant!",
                "reviewText": "gifted this to my mum and she had read half of it by the end of boxing day!! she says she loved it and it was “just my cup of tea”",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mauricio Sanchez",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on June 1, 2021",
                "reviewTitle": "Excelente libro",
                "reviewText": "La historia es excelente, el libro de portada dura es precioso y perfecto para poner en el librero.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "pegah",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on December 24, 2023",
                "reviewTitle": "A book like an episode of black mirror",
                "reviewText": "A story that makes you think, it wasn’t scary, it didn’t have a big twist either. If you like black mirror this could easily be an episode of that. Nicely written.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}