{
    "remaining_requests": 1227,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Puppet-Maker-addictive-thriller-Detective-ebook/dp/B0C9JJ5XYB",
    "body": {
        "name": "The Puppet Maker: An addictive Irish crime thriller and mystery novel (Detective Alana Mack Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Puppet-Maker-addictive-thriller-Detective-ebook/dp/B0C9JJ5XYB",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81fF0wZwNfL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jenny O'Brien",
            "link": "https://www.amazon.com/Jenny-OBrien/e/B014TN5SKK/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 120,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C9JJ5XYB"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Storm Publishing (October 17, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 17, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2039 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 298 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,125 in Kindle Store (See Top 100 in Kindle Store) #153 in Serial Killer Thrillers #158 in Women Sleuths (Books) #161 in Police Procedurals (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 120 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "What readers are saying about The Puppet Maker",
                "media_link": [
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/f8d89b38-1241-497d-a960-72867d3ee2a4.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/97ddca01-a6b4-4204-9dd8-ce6de3a514d8.__CR0,0,1080,1080_PT0_SX300_V1___.png",
                    "https://m.media-amazon.com/images/S/aplus-media/kdp/95eb7043-43f8-4470-9e36-9510dda77384.__CR0,0,1080,1080_PT0_SX300_V1___.png"
                ]
            },
            {
                "media_text": "More crime thrillers from Jenny O'Brien",
                "media_link": []
            },
            {
                "media_text": "The Puppet Maker Roses for the Dead Cage of Bones Detective Alana Mack series Book 1 Book 2 Book 3",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/kdp/f8d89b38-1241-497d-a960-72867d3ee2a4.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/97ddca01-a6b4-4204-9dd8-ce6de3a514d8.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/95eb7043-43f8-4470-9e36-9510dda77384.__CR0,0,1080,1080_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/15479b5a-b538-4212-aeb4-a3d3aa90fb3b.__CR0,0,600,1200_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/e4d86c0a-b117-417e-bca6-53ce0eb592c1.__CR0,0,600,1200_PT0_SX150_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media/kdp/6c50b4aa-e875-4ecf-a4ce-f86d93fadd53.__CR0,0,600,1200_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Audrey Davis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCXEJBOZAMYAX2L7JH3VIA6BROA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PR62EVCC0KGL?ASIN=B0C9JJ5XYB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 17, 2023",
                "reviewTitle": "5.0 out of 5 stars A gripping tale",
                "reviewText": "This book is the opener of a new series set in Ireland and featuring the feisty Detective Alana Mack. As a crime thriller it ticks all the right boxes, with sufficient tension and twists to keep the reader on their toes. At times very graphic, it holds back on several details — particularly pertaining to Alana (Alan)'s back story. No doubt more will be revealed in the next instalment. A gripping and worthy addition to the genre.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mary s",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AETSOOSQXA6Z3BJK4QMKYOCJHITA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MOPGCRJ3ZN3O?ASIN=B0C9JJ5XYB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 20, 2023",
                "reviewTitle": "4.0 out of 5 stars Gripping thriller featuring unusual female leading detective",
                "reviewText": "I voluntarily read and reviewed an advanced copy of this book, given to me by Storm Publishing via NetGalley. All thoughts and opinions are my own.A gripping, suspenseful thriller story set in Dublin, “The Puppet Maker”, by Jenny O’Brien (Storm Publishing), features an unusual leading detective and a cast of characters that will grow on you as the narrative progressesI liked the complexity of the plot and how the different plotlines gradually tied together and characters that initially seemed unrelated later interconnected.Alana Mack is an interesting leading character; it’s great that she’s a woman in a man’s world, disabled, and that there’s no great drama or fuss about it. She’s strong, determined and brave.All the characters, relationships and interaction grew more compelling as the story went on. I was particularly curious about a potential romance between Alan and Billy, and amazed with William’s dramatic baptism by fire.The story is hard and gruesome, a cruel portrayal of domestic abuse and violence and how violence perpetuates itself through generations.I liked the depiction of Dublin and its outskirts and how the scenery and the weather and climate conditions are important elements of the story.Some details seemed too unprofessional or rash to be believable: wouldn’t examine carefully the child be an immediate task? Although explained, William’s decision to advance alone seemed amateurish, even puerile.Even if I liked that the heroine is a wheelchair user and adjusted to her new reality, I felt sometimes the disability’s portrayal was a bit superficial.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sara Steven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFT7PSIIFFZYHFYKJ7ZO3DI3JKYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PNFLJEPZQITI?ASIN=B0C9JJ5XYB",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Riveting",
                "reviewText": "The Puppet Maker is so, so good. Like, the kind of reading experience where you don’t want to put the book down because you have to find out what happens next, kind of good. There are mysteries that reveal the culprit over time, and then there are mysteries that have already allowed you into the culprit’s world, fearful of what they might do, or who will be the next target. That’s the type of story the author has created here, and it worked wonderfully.There are different viewpoints provided that help to round out the plot, and I think it helped tremendously. The story is told primarily from Alana’s perspective–or Alan, as she’s best known by–but she can only relay her side of things, particularly when it pertains to the police and all they are attempting to do to save possible victims from death, or in this case, a fate even worse than death. I loved the connect-the-dot moments that tie in the little girl Casey with the human remains, and the victims and why they’ve been targeted.The pacing within the pages is perfection. Nothing was sped up or slowed down in such a way that would make me feel bogged down by plot points or events that delineate from the story. I felt like I was watching some sort of real-life crime scene investigation unfold in front of me, like I was one of Alan’s team members, trying to solve a mystery. At one point, we discover that there is a mole who has been working behind-the-scenes, leaking crucial information to media outlets, and when the mole is finally revealed, I was pretty shocked by that. The way Alan handles that situation was amazing and more than justified.I also wasn’t sure if in the end, Casey would be reunited with her mother. That sort of resolution could have swung either way, but the discovery of that felt like it was the right call. With how quickly Casey seems to attach herself to Alan, I really didn’t know how things would go, but I’m glad it went down the way it did. It looks as though this is the first book I’ve read by author Jenny O’Brien, which is a complete shock to me. I plan on changing that. The Puppet Maker is a definite five-star page turner!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Brenda Telford",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE735T5E6H75ML3TIYL6Z77OXHMQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F9XPRV79XN9Z?ASIN=B0C9JJ5XYB",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 18, 2023",
                "reviewTitle": "4.0 out of 5 stars A great start to a new series!",
                "reviewText": "Detective Alana Mack (Alan to her friends) was still recovering from the shattering injury which left her in a wheelchair for the rest of her life, and learning to delegate more, as her ability to be on the front line had lessened immensely. Paddy, her partner, was learning to tread the fine line in caring for Alan, but not mollycoddling her. It was the discovery of a distraught abandoned child, approximately two years old, who said her name was Casey and she wanted her Mammy, that set the small Clonabee police station on high alert. At the same time Casey was brought to the station, two homeless men fronted up with a bag which contained human remains, plus there was a report of a missing man, who had seemingly vanished from his home the night before. Suddenly from no cases to several - were they linked? - Alan and her team were inundated with work.The discovery of the note in Casey's clothes led them to keep details quiet, as it was obvious that both Casey and her mother were in danger. When another man went missing, the race was on; the clock was ticking. Could Alan and her team find the killer before more deaths? Would they be able to find Casey's mother before it was too late? And who was the mole in the department who was leaking to the media?The Puppet Maker is the 1st in the Detective Alana Mack series by Jenny O'Brien and it was fast paced, action packed, and brutal! I thoroughly enjoyed Alan's character and her determination to ignore her disability as best she could. Set in Ireland near Dublin - a place I'd love to visit - the story was narrated both by Alan, and Casey's mother. I'm looking forward to #2 in the series. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tara D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on October 29, 2023",
                "reviewTitle": "Loved this book!",
                "reviewText": "Alana Mack is a baddie and I can't wait to see what she gets up to next!This book is well written with neat characters and a wicked story line.Definitely recommend giving it a read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JaneyB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 21, 2023",
                "reviewTitle": "A brilliant new detective",
                "reviewText": "Following the gruesome discovery of discarded body parts, Alana Mack and her team set out to uncover the perpetrator of a series of chilling crimes.I’m full of praise for this gripping new series from Jenny O’Brien. At its heart is a brilliant new detective, Alana Mack, who is both likeable and empathetic, but also knows how to fight her corner. She is definitely someone I’ll enjoy reading more about in the next book in the series. I’m also keen to learn how William gets on as part of the team.This was a fast-paced and thoroughly enjoyable ‘whydunnit’. The dual point of view provided insights into the killer’s motives, as well as the police investigation. All of the characters were cleverly drawn, and the team dynamics between the detectives provided several lighter moments.An excellent start to this series. Looking forward to reading the next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 13, 2024",
                "reviewTitle": "Great Read",
                "reviewText": "Alana Mack is an excellent alternative hero in a crime series. She has a back story that is touched upon but as a wheelchair bound detective she has to use intellectual skills over physical attributes. This is a great story building up to a strong climax and an excellent read! I look forward to the next book in the series!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Whitelight",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 7, 2023",
                "reviewTitle": "A Great Start to a New Series",
                "reviewText": "Having read O'Brien's others books I knew this would be another cracker - and it was! Loved that it was set in my hometown and thought the characters were well-rounded. I look forward to see how they develop in the series. The plot was nicely paced and loved that characters from her Welsh series made an appearance. Looking forward to book 2.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Adrian Dooley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 28, 2023",
                "reviewTitle": "Ok",
                "reviewText": "A crime thriller set in Dublin(my home town) should have been right up my street but although this book was ok I just didn’t connect with it.Two missing men, bags of human organs found in a public bin and an abandoned child at a supermarket set the scene for The Puppet Maker.Our main character is Detective Alana Mack, a recently wheelchair bound and divorced woman, her back story is hinted at but never really explained.The story really draws you in with some fascinating story lines as openers but it doesn’t live up to its initial promise.The book drags quite a lot, reading a lot longer than it’s page count, the characters I never really bonded with which didn’t help and it did feel a bit repetitive.I wanted to empathize with Alana more and root for her but, after initial promise, her character wasn’t all that interesting or well written. I do with we were given her full back story.Anyway it wasn’t a bad book just not that great a one. I think 3 stars is a fair assessment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}