{
    "remaining_requests": 1196,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dangerous-Fortune-Novel-Ken-Follett-ebook/dp/B003V4BPJW",
    "body": {
        "name": "A Dangerous Fortune: A Novel",
        "price": "$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dangerous-Fortune-Novel-Ken-Follett-ebook/dp/B003V4BPJW",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/9133s6Cya5L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ken Follett",
            "link": "https://www.amazon.com/Ken-Follett/e/B000APHCPQ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 35468,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A breathtaking thriller featuring \"political and amorous intrigues, cold-blooded murder, and financial crises\" (San Francisco Chronicle), from the #1 New York Times bestselling author of A Column of FireIn 1866, tragedy strikes the exclusive Windfield School when a young student drowns in a mysterious accident. His death and its aftermath initiate a spiraling circle of treachery that will span three decades and entwine many lives. From the exclusive men’s clubs and brothels that cater to every dark desire of London’s upper class to the dazzling ballrooms and mahogany-paneled suites of the manipulators of the world’s wealth, one family is splintered by a shared legacy. But greed, fed by the shocking truth of a boy’s death, must be stopped, or the dreams of a nation will die. Praise for A Dangerous Fortune “A terrific page-turner.”—Los Angeles Times “Political and amorous intrigues, cold-blooded murder, and financial crises . . . old-fashioned entertainment.”—San Francisco Chronicle “Breathlessly plotted . . . relentlessly suspenseful.”—The New York Times “Gripping, complex plot . . . sexual intrigue . . . fascinating characters . . . You won’t be able to put down this exciting page-turner.”—Lexington Herald-Leader “Follett [builds] to a dramatic climax with the same masterful control that guided Eye of the Needle and The Pillars of the Earth.”—Playboy “I don’t usually enjoy historical thrillers but admit to being totally captivated by Ken Follett’s A Dangerous Fortune.”—Chicago Tribune “Highly entertaining . . . Follett’s characters are drawn with broad, realistic strokes . . . this story of greed and retribution should win Follett new fans.”—Publishers Weekly “Rich, complex, thrilling, suspenseful, well plotted . . . A Dangerous Fortune is dangerous reading. You won’t be able to put it down.”—Authors and Critics",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "History & Criticism",
                "link": "https://www.amazon.com/History-Criticism-Literature-Fiction-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10204"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B003V4BPJW"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Dell; Reprint edition (July 9, 2010)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ July 9, 2010"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2999 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 578 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#27,707 in Kindle Store (See Top 100 in Kindle Store) #81 in Historical Thrillers (Kindle Store) #98 in Historical Mystery, Thriller & Suspense Fiction #172 in Historical British & Irish Literature"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 35,468 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "A Colorado Shopper",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBCC4A7Z3Z3VFUE2J3GCF6OYLQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1317PAG7FBFYJ?ASIN=B003V4BPJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars 1866 - 1892 England’s banking industry",
                "reviewText": "The world runs on currency of different kinds: coins, relationships, world-trade, sex, ideas. I enjoyed this novel very much because it reflects the time period of England/Europe and same time mentions that the US Civil War had ended. Living in Colorado, as I do now, this gave me a reference point of what was happening in the ‘old world’. I know our Civil War history and settling of Old West as people moved in wagon trains. I wanted to know more about England at this time.Children are born into family groups and situations. Hugh Pilaster’s father died. That set him on a life path to be a ‘poor relation’ in the Pilaster banking family. Banking was considered as ‘upper middle class’ working positions. Making interest on loans was how a bank succeeds, even today. How well that money is managed determines how successful the bank will be. I looked at this book from several perspectives. What was the banking industry like at that time? Who were these people? And what effect did the management have on others, good or bad.The characters were intriguing! Hugh made his own way after his father’s death. He met Maisie and fell in love. He wasn’t spoiled, like his cousin Edward Pilaster. Edward was overindulged by his mother, Augusta. She was ruthless and manipulative to move her son, Edward, into the head position of the bank. But could Edward do the job?No. We all can reach a level of incompetence where we can’t function. This is a fact even for the 21st century. Follett reveals this. Edward had no ambition, integrity, brains to help the bank move forward. Just because you are son of a lead partner doesn’t automatically mean you can do the job. We see this also today.Women were dependent on their men’s positions. How ‘well’ you married determined your status and success.As the boys at the elite boys school were all affected from a boy’s drowning, the book focuses on the Pilaster banking family. They were directly involved. Or were they? They were directly affected by the tragic event.Miguel (Micky) Miranda was the protagonist. But so was Augusta Pilaster, Edward’s mother. This leaped off the page for me. How far would they go to get their needs met?These two wonderful characters had their ‘own secret agendas’ to further advance their lives to wealth and fame. They both were ambitious people and put no limits on themselves to get what they wanted.TV shows today lack revealing the internal thought process of what makes a person do something, what makes a character ‘tick’. Reading is where I go to find great novels that reveal the inner thought-process.Edward’s indulgence in brothels with friend, Micky Miranda, was an excellent reminder of how men entertained themselves and how women used sex as their trade at that time. It again is a form of currency.I won’t write the ending. It was fascinating to see how far the characters were pushed and what they did.I highly recommend this psychological drama in this novel. It’s about different currencies and what we each trade during our lives.I am age 74, a retired accountant, female. I love books. I learned to read at age 4. My grandmother raised me, pushed me early to read. It was the very best gift I ever received. She and my father taught me how to ‘think’. He was a business owner. I learned about banking and trade early in life.We all have options. This novel is a great demonstration of this. Yes, the book is about banking. But our choices can determine and define our success.Loved this book! Please read it. It is shocking, intriguing, baffling. Why do people do what they do? It made me think, analyze, reflect.Buy this book!A Colorado Reader Feb 7, 2024",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Todd F. Rumbo",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQ2HQROBQKV7A7GNGY5F5GKTZAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNGJVJVRPQNTT?ASIN=B003V4BPJW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "4.0 out of 5 stars Follett Doesn’t Write Bad Novels",
                "reviewText": "Good story. Great characters. Follett always gives you someone to root for and against. Rarely disappoints. He doesn’t here. Always captures the age in which he writes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JR Weingart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5HQSMRH7EPHQA63XXWJQI7LNBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1VIYLLJ1E82AC?ASIN=B003V4BPJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Book",
                "reviewText": "Like most of Ken Follett's books, this one is excellent",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shane Evans",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2I4ONH3KZNMKBUKLEKALBSMMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ARQV1V93PAGZ?ASIN=B003V4BPJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Kept you going until the end",
                "reviewText": "You know that things should turn around for the Hugh and Masie , but you have to deal with the evil winning for most of the book. Once your protagonist wins, you miss the battle and journey to get there.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AntiochAndy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHN2AEDG6NJD7C5FDRPOODGDWJUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDX3BWHT4SP7S?ASIN=B003V4BPJW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2001",
                "reviewTitle": "4.0 out of 5 stars Very Entertaining",
                "reviewText": "In my opinion, Ken Follett is one of the better writers working currently, and A DANGEROUS FORTUNE is one of his best books to date. I liked his EYE OF THE NEEDLE and PILLARS OF THE EARTH very much, too, and while I don't think FORTUNE is quite that good, it is still one of the most entertaining books I've read recently. The story is set in England in the latter half of the 19th century, and revolves around the wealthy Pilaster family. The Pilasters are bankers and control the large and powerful Pilaster Bank. As schoolboys, both Edward Pilaster and his cousin Hugh, son of the family black sheep, are involved in the death by drowning of a fellow student. That event is the beginning of 25 years of intrigue, corruption and murder as the fortunes of the Pilasters and those close to them play out. Follett weaves an intricate and fast-paced, if not always surprising, plot around his characters that carries the reader from the mansions of London's rich and powerful, through seedy bordellos, to vile gambling dens.This is contemporary pulp fiction at its best. The characters have depth and believability and Follett seems to do a good job of evoking the look and feel of the period. The pages roll by quickly and the book is hard to put down. But, if it's so good, why didn't I give it five stars? Generally, I reserve five-star status for books of what I regard to be classic status. Caesar, Tolkien, Sherlock Holmes, Harry Potter (yeah, I do think Harry Potter will be around for a long time). Maybe Harry Bosch, although I may have gotten carried away, there. This is, after all, pulp fiction and it just doesn't have the depth of the above. It is very entertaining, though, and I think most readers will enjoy it very much. Consider it a strong four plus and give it a look.",
                "reviewVotes": "107 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judy Hovis, Author of 'All the Seasons Never Lived'.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHAP5PCGRTORL2YERBVMKIO7EIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2298LJBK2MHCE?ASIN=B003V4BPJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 14, 2023",
                "reviewTitle": "5.0 out of 5 stars Historical Treasure",
                "reviewText": "Ken Follett's books never disappoint. It's hard to imagine not having a Ken Follett book to read at least twice a year. Historical accuracy is interwoven with fiction to provide the reader with a very entertaining take on different periods of time. The detail pulls you in before you know it, and you will find yourself living in the experience.Judy HovisAuthor 'All the Seasons Never Lived'",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jack Cohen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGE2FXDWHDUIJQY6KNRNGQSHDR5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OJW6KS4C97BY?ASIN=B003V4BPJW",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 10, 2023",
                "reviewTitle": "3.0 out of 5 stars A real page turner",
                "reviewText": "This is vintage Follett, a fascinating story with a clear sense of time and place, vivid characters, admirable heroes and heroines and truly foul villains. One problem, the characters often do things that make no sense, jars the narrative, but that's one of the joys of writing fiction, you create a world with characters who must do exactly what you want them to do.While it doesn't have the historical sweep of Pillars of the Earth or the suspenseful intrigue of his spy thrillers like Jackdaws or Eye of the Needle, it is a thoroughly enjoyable novel with a compulsively readable narrative that never flags.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Myles Grosskopf",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPB5FTBIWFYUQHRJJ3KLSEREHBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1G0QX4851ETON?ASIN=B003V4BPJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars A very enjoyable read",
                "reviewText": "Vivid characters with intricate relationships and devious plots amongst them with two genuinely moral and loving protagonists and a very satisfying conclusion to the novel. A fast and enjoyable read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Db",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 19, 2023",
                "reviewTitle": "hard at the beginning but ultimately inspiring",
                "reviewText": "I considered stopping this book until about 55% in but, as usual for Ken Follett books the real intrigue starts then. In the end, Justice is well served. Sorry if I have given too much away but in the end I loved the book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "joy cunningham",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 13, 2024",
                "reviewTitle": "Good story,marvellous writer",
                "reviewText": "See above",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 11, 2024",
                "reviewTitle": "To get upset as you come to the end of the book",
                "reviewText": "It couldn't get any better as of all his books ,I've read already started Looking for my next book with confidence",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Saimohan pahwa",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 25, 2023",
                "reviewTitle": "pageturner !!!!",
                "reviewText": "Loved it !I had read this book when it originally came out In the 90’s read it again … was simply captivating!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on December 9, 2023",
                "reviewTitle": "Me gusta",
                "reviewText": "Me gusta este autor",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}