{
    "remaining_requests": 1226,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Quiet-Tenant-A-Novel/dp/B0BJ4Z92YD",
    "body": {
        "name": "The Quiet Tenant: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Quiet-Tenant-A-Novel/dp/B0BJ4Z92YD",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51 UuuNu9aL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Clémence Michallon",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Cl%C3%A9mence+Michallon&search-alias=audible"
        },
        "brand": "Clémence Michallon&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 6862,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BEST SELLER A NEW YORK TIMES BEST CRIME NOVEL OF THE YEAR GMA BUZZ PICK “A bravura feat of storytelling...daring and completely satisfying.”—James Patterson, #1 best-selling authorA PULSE-POUNDING PSYCHOLOGICAL THRILLER ABOUT A SERIAL KILLER NARRATED BY THOSE CLOSEST TO HIM: HIS 13-YEAR-OLD DAUGHTER, HIS GIRLFRIEND—AND THE ONE VICTIM HE HAS SPARED\"Intelligent and suspenseful.\"—Paul Tremblay, author of The Cabin at the End of the World“All…of the expected suspense and psychological tension, but offering a story about women—the ones who didn’t know the evil that lurked within, the ones who tried to placate or fight but still perished, the ones who might actually survive. Haunting but never prurient…truly unforgettable.”—Alafair Burke, author of The WifeAidan Thomas is a hard-working family man and a somewhat beloved figure in the small upstate New York town where he lives. He’s the kind of man who always lends a hand and has a good word for everyone. But Aidan has a dark secret he’s been keeping from everyone in town and those closest to him. He’s a kidnapper and serial killer. Aidan has murdered eight women and there’s a ninth he has earmarked for death: Rachel, imprisoned in a backyard shed, fearing for her life. When Aidan’s wife dies, he and his thirteen-year-old daughter Cecilia are forced to move. Aidan has no choice but to bring Rachel along, introducing her to Cecilia as a “family friend” who needs a place to stay. Aidan is betting on Rachel, after five years of captivity, being too brainwashed and fearful to attempt to escape. But Rachel is a fighter and survivor, and recognizes Cecilia might just be the lifeline she has waited for all these years. As Rachel tests the boundaries of her new living situation, she begins to form a tenuous connection with Cecilia. And when Emily, a local restaurant owner, develops a crush on the handsome widower, she finds herself drawn into Rachel and Cecilia’s orbit, coming dangerously close to discovering Aidan’s secret.Told through the perspectives of Rachel, Cecilia, and Emily, The Quiet Tenant explores the psychological impact of Aidan’s crimes on the women in his life—and the bonds between those women that give them the strength to fight back. Both a searing thriller and an astute study of trauma, survival, and the dynamics of power, The Quiet Tenant is an electrifying debut thriller by a major talent. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 44 minutes"
            },
            {
                "name": "Author",
                "value": "Clémence Michallon"
            },
            {
                "name": "Narrator",
                "value": "Clémence Michallon, Gilli Messer, Elena Rey, Valerie Rose Lohman, Amber Battaglia, Reba Buhr, Jess Nahikian, Aure Nash, Milly Sanders, Sara Sheckells, Yu-Li Alice Shen"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 20, 2023"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0BJ4Z92YD"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,120 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #92 in Crime Fiction (Audible Books & Originals) #97 in Psychological Thrillers (Audible Books & Originals) #240 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kate McBride",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGT6V45F7FVEMENZPZKRWZBQCMHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31BXWPISIFW0F?ASIN=B0BJ4Z92YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars Monsters are everywhere",
                "reviewText": "Great read. I really got sucked into this because I think we read about people like this far to often.This is a story of a girl who is kidnapped, raped, beaten. He life is stripped from her all while hiding in plain sight. It is about the fear of escaping and the fear of staying in place. The will to fight and the real thoughts of just giving in because it is easier.It is a good read, but a hard read especially if you have trauma.Quote I liked from the book:\"Trauma is what happens after you see yourself die. You witness the story of your own death, and it rings so true that you're never the same again. You don't get it, until you do.\"",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vanessa Booked Up",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJPTJAOZRNZO4Y3K4C6WSTHOJ4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2E94Z83ROEAFS?ASIN=B0BJ4Z92YD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "4.0 out of 5 stars Truly riveting psychological thriller",
                "reviewText": "4 Stars!\"Rule number one of staying alive in the shed: He always wins. For five years, you have made sure of it.\"I have read many kidnapping stories but this one is on a whole other level. It did such a great job of delving into the long game involved, the psychological aspect. The prose was flawless and thought-provoking.Rachel's fight and her patience during all she had to endure was both astounding and shocking.This is the story told from the point of views of the three women in this ruthless serial killer's life: his victim, his daughter, and the woman in his life...or is she his next victim.Loved it. But the ending felt rushed and a little underwhelming…There were so many more questions I had. Really left me wanting.Great read otherwise.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V. Myers",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFU2VFJCUGZI6DO2OVERQWQI76HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FKGCXFO742KI?ASIN=B0BJ4Z92YD",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 27, 2023",
                "reviewTitle": "3.0 out of 5 stars Author needs to do her research",
                "reviewText": "This book read like it was written by a personn who reads a lot of mysteries but did no real research for her own book. The premise was interesting but the execution was completely implausible. The story is told from three POVs that all had the same general tone. The bar owner/girlfriend, Emily, was simply unbearable and it was difficult to care what happened to someone who comes across as a weak minded, immature stalker who becomes obssessed with a man she knows nothing about and doesn't even really talk to before becoming infatuated and unhinged. The way she behaves in the end is so annoying that any sympathy I even tried to feel for her during the book was gone and I just wanted her to disappear. Rachel, the victim, isn't a terrible character but the circumstances of her disappearance and her character throughout are not believable in the least. Again, her character is the most like something that was created out of the author's experience reading a bunch of similiar books and then just writing one of her own without really thinking about the mindset and actions that felt natural. Chloe, the daughter, feels relatively incidental and I literally forgot about her by the end of book. I did not particularly enjoy this book but I did feel compelled to finish, The author clearly has talent and hopefully with experience she can develop a more complex and realistic experience in the future. 3 stars - good writing, plot and character development need work.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shelby Watters",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRE2ITXCGAYTJFMGKZEAPLPU5DA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PHTC2K6NBY8O?ASIN=B0BJ4Z92YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Hooked",
                "reviewText": "Um. So this book. It crawled under my skin, sunk its teeth, and stayed. I became fully engrossed with the plot, the characters, the scenes. I can't believe this is a debut novel. It also made me question everything about my sense of reality when just being outside my home or passing strangers - do we really know anyone? How much are we willing to overlook because of our own personal need? Read this book! You won't regret it!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue Eyes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDVOUXEKZNRWDTH456RX7BXWJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BKH7DVGG0ZUH?ASIN=B0BJ4Z92YD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars He tells her her name is Rachel and for five years she has obeyed him",
                "reviewText": "He has killed others but he has kept her for 5 years. And she has obeyed him for 5 years. Now he tells her he has to move and she has no idea what will happen to her now,He is an upstanding member of the community. Everyone loves him. He is the guy that he,pa out everyone, His wife died recently and he is left alone to raise his 13 year old daughter. They don’t know is about Rachel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Hannon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6LJOUVY4ANVXXCYFHS3TFOETNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NNB5XU0W2331?ASIN=B0BJ4Z92YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars is there a sequel?",
                "reviewText": "I enjoyed the structure of this story with each main character having their own chapter. Was taken with the depth of each individual’s story. Suspense city!! I found the ending to be very lacking, limited resolution for each individual. So I believe there is another book there, the no longer quiet former tenant has some explaining to do!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katy the Book Lady",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSSPGOZCEY6QQ7AGYEJ5HNKOUCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDBRHWBKR3D0J?ASIN=B0BJ4Z92YD",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars Well Done",
                "reviewText": "The Quiet Tenement is Clemence Michallon's first thriller novel and the first novel she has written in English. I found it quite suspenseful and interesting. I gave it four stars instead of five because I found one particular part a bit outrageous and unbelievable (Emily entering the house, not once, but twice!). Overall though, it was quite well written and I couldn't turn the pages fast enough. Strongly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MsNay",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE4QPDDF3X4BH4HYIC2L4FW7JIQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OTWNBBHQ0YID?ASIN=B0BJ4Z92YD",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Breathtaking",
                "reviewText": "I absolutely loved this book. The first one I've read written by this author. I was there. Through it all. I felt the handcuffs. I felt the fear. My pulse pounding, planning and hoping to escape..... one day.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KellyJane",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 12, 2024",
                "reviewTitle": "Absolutely brilliant!",
                "reviewText": "4.5 ratingSo impressed that this is a debut novel written by a woman who's first language is French and this being her first English novel. Outstanding! The cover of this book, doesn't do it justice. Looks like your typical serial killer//thriller type book but it definitely isn't.I loved how we got the story from all the women and not from the bad guy. The way the chapters were written from the woman in the shed/house was brilliant, made me feel like I was her and I so desperately wanted her to escape, I was screaming in my head for her to escape at times I thought she could have so easily but the book portrayed how this guy had brain washed her and made her paranoid. Very insightful and thought provoking. Read this now!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VANESSA",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on December 28, 2023",
                "reviewTitle": "One of the best thrillers I have ever read !",
                "reviewText": "Her first book was already a success but this one goes far beyond ! Intriguing… it is just impossible to leave the book aside. Love the way it is written, short paragraphs, … and she happens to be the daughter of a very good friend of mine. Very proud of Clémence ! Go and read this book, you won’t be disappointed !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debidutta MishraDebidutta Mishra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 24, 2023",
                "reviewTitle": "A great psychological thriller.",
                "reviewText": "This book was so unique in a way it was told. Three different perspectives and each perspective about serial killer living in plain sight. Not only was the POV interesting, but some of the story was told in the second person, and it worked.I was hooked the whole way through and was curious about a lot as I was reading. I really liked that as a reader, for some moments, we know what was happening without having to be directly told or for the author to go into explicit detail.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71w9aoN3j1L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 8, 2023",
                "reviewTitle": "Could not put his down",
                "reviewText": "Loved this book! I couldn’t put it down. I was hooked from the first chapter. Highly recommend it if you live a good thriller.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mary-louise riley",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 29, 2024",
                "reviewTitle": "Really good",
                "reviewText": "A really good read but then the ending sort of lets it down.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}