{
    "remaining_requests": 1086,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Exchange-After-Firm-Book-ebook/dp/B0BYHPHG1L",
    "body": {
        "name": "The Exchange: After The Firm (The Firm Series Book 2)",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Exchange-After-Firm-Book-ebook/dp/B0BYHPHG1L",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91afIYwE9BL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Grisham",
            "link": "https://www.amazon.com/John-Grisham/e/B000AQ40M8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 42061,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER • John Grisham delivers high-flying international suspense in a stunning new legal thriller that marks the return of Mitch McDeere, the brilliant hero of The Firm.What became of Mitch and Abby McDeere after they exposed the crimes of Memphis law firm Bendini, Lambert & Locke and fled the country? The answer is in The Exchange, the riveting sequel to The Firm, the blockbuster thriller that launched the career of America’s favorite storyteller. It is now fifteen years later, and Mitch and Abby are living in Manhattan, where Mitch is a partner at the largest law firm in the world. When a mentor in Rome asks him for a favor that will take him far from home, Mitch finds himself at the center of a sinister plot that has worldwide implications—and once again endangers his colleagues, friends, and family. Mitch has become a master at staying one step ahead of his adversaries, but this time there’s nowhere to hide. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0BYHPHG1L"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Doubleday (October 17, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 17, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3566 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 339 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#330 in Kindle Store (See Top 100 in Kindle Store) #1 in Political Thrillers (Books) #2 in Legal Thrillers (Kindle Store) #14 in Crime Thrillers (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 42,061 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5a687a18-5832-4c1d-a56e-44bcb7e42b82.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a1989d01-fa22-410d-a880-701f89b86f1c.__CR0,0,970,300_PT0_SX970_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c8d8797e-2df4-4379-ace1-9efce3f0adb2.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robert James Vandevoort (Show Low, Arizona)Robert James Vandevoort (Show Low, Arizona)",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPFXLSI2DEUSBAAUC3UZEP2XQVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LEAW0PTGBLEA?ASIN=B0BYHPHG1L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars WOW! The Exchange by author John Grishman is simply the Best of all his novels!",
                "reviewText": "Has anyone seen my socks? When finishing John Grisham’s recent novel “The Exchange”, the story absolutely blew my socks off. For this reader, this is simply the best novel he has written.Mitch and Abby McDeere are back. This time they are back in a big way. Mitch is now a partner of the largest law firm in the world. They have offices throughout the world with the headquarters in Manhattan.They represent Lannak, a Turkish construction company, that has done a number of projects in Libya. The latest project is a massive bridge that was supposed to have a river of water underneath it, but instead it is a river of sand. The massive project was thought up by Colonel Gaddafi himself. The challenge for Mitch is that the Colonel has lost interest in the project and thus has not paid the Turkish company.Jack Ruch, the top man at Scully & Pershing, wants Mitch to go to Libya and appraise the situation. Jack takes with him a beautiful Italian woman who works at their UK office. Giovanna’s father is the head partner in Italy. His daughter wanted to get out of the office and work with Scully & Pershing’s international clients. Her first assignment is with Mitch in Libya.The plan is to first go to the bridge project and get a better understanding of the situation from the onsite managers of Lannak. Sometimes plans simply do not work the way they were meant to, especially in third world countries. What really appealed to this reader was the international aspect of dealing in the third world. This reader’s career was outside the United States, and he still has memories of third world countries, especially Pakistan, that he would like to forget.“The Exchange” is the sequel to the author Grisham’s second novel “The Firm” which was published in 1991. This reader read “The Firm” over three nights in Tokyo in September, 1993. A re-read of that novel is now imperative.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71zooSKWXKL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mary Ann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHUKNBCZBTSW4RNK2X65SFCGURZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSOIKM5MNH7KP?ASIN=B0BYHPHG1L",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "4.0 out of 5 stars An well-formed read.",
                "reviewText": "First of all, revisiting Mitch and Abbie from The Firm is an excellent idea. Throughout the years, all of Grisham's novels have well-formed, interesting characters. Bringing them back with what follows in their lives is an excellent idea. It's like catching up with old friends. As usual, Grisham can write. His characters, locations and plot always have just enough information to form complete pictures in the reader's mind, without going to boring extremes. He writes about things he knows, and it shows. So why only four stars? Occasionally, the story seems more like reading a journal than following a story. And keeping it real, I didn't really love Mitch and Abbie. It's like intellectually they learned from their mistakes, but when things got tough, expediency rules. Mitch and Abbie were really quite predictable. I found myself wanting to know more about the terrorist liaisons and Abbie's guard. What motivated them? What's their side of the plot and the story? All that being said, I do hope Grisham goes back to some of his other characters. They're often just too interesting to keep on a shelf.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James A. Glynn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEN3KUKTJ6E3MFD5WTV67MGDYADA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3F7HVZ8CYZWQL?ASIN=B0BYHPHG1L",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "3.0 out of 5 stars Not the sequel that it's supposed to be",
                "reviewText": "Of the 41 adult novels that John Grisham has written, “The Firm” was second, the debut novel having been “A Time to Kill.” Both have been made into movies. His most recent offering, “The Exchange” (2023, 368 pages in hardback), has been promoted as a sequel to “The Firm.” I don’t know. To me, a sequel is something that picks up where the preceding novel left off. But, except for a “passing mention” in the final pages, the only carryovers from “The Firm” are Mitch and Abby McDeere. In the first novel, Mitch was fresh out of law school and got a job with the Memphis law firm Bendini, Lambert, and Locke that — unbeknownst to him — was tied in with the mob. In the new book, the storyline takes place 15 years later, Mitch is now a partner in the world’s largest international law firm, Scullly & Pershing, and the plot has virtually no connection to the first book. But here’s full disclosure. I’ve never been satisfied with any of Grisham’s sequels, so perhaps I was predisposed toward skepticism when I began to read this thriller. The book is kind of low on action, except for Mitch’s many airplane flights: U.S., Europe, and North Africa. Abby also manages to get some trans-Atlantic frequent-flyer miles. The international aspects of the book emerge because Mitch is burned out on taking death-row cases, which he loses, as part of Scully & Pershing’s commitment to pro-bono work. So, he agrees to help Luca Sandroni, a friend and a Scully & Pershing partner in Rome. Luca is handling a lawsuit on behalf of Turkish construction company Lannak. Lannak’s owners are suing the government of Libya (which means they’re suing Muammar Gaddafi) for an unpaid debt of $400 million. Gaddafi wanted a bridge to cross a river that he intended to create in the desert. However, Libyan engineers were unable to produce a river through thousands of miles of sand, so Gaddafi welched on the deal. However, Luca is dying. So, Mitch agrees to represent him in Libya. Luca’s daughter, Giovanna, is a lawyer in London, is unhappy there, and pleads with Luca to join Mitch in Libya. Luca says that he’s been there many times, and its perfectly safe. In Libya, Mitch decides that he must go and see this “Bridge to Nowhere,” but he comes down with a nearly fatal case of food poisoning. Giovanna goes in his stead and is kidnapped by a ruthless and bloodthirsty gang. While Luca, Mitch, and the law partners await instructions for the ransom, Abby is contacted in New York by a mysterious woman. The woman is the go-between and will only deal with Abby. The gang wants $100 million, an impossible sum. The fast-paced “action” in the book mainly concerns the efforts to put together such a huge amount of money by involving several sources, including the governments of England and Italy, as Giovanna has duel citizenship. This book is enjoyable reading; I just don’t think it’s one of Grisham’s best.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGWCILOYLAPDLJCSHNWO34AXME5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EQAHDIL23J7B?ASIN=B0BYHPHG1L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellently woven tale of international intrique",
                "reviewText": "Kidnapping, murders and a gang of Arab terrorists mingle with top-notch New York law firms and governmental politics across the world in this continuation of The Firm. Twenty years after the McDeeres escaped Mitch's first law firm's murderous pattern, the couple again faces legal and personal entanglements, threatening their safety. The Exchange is suspenseful, as its well designed plot zips across continents untangling problem as it goes.John Grisham never disappoints.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jwags3 ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUYUJZTOTRM2VRO2MKSXBRJHKCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IP04WI8CKRWO?ASIN=B0BYHPHG1L",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars loved it!",
                "reviewText": "Difficult time putting it down on my Kindle. Very engrossing narrative by an author whomI’ve read for the past decades.Very enjoyable, but sad there was no resolution to the terrorists at the end. My h like a foreign film, not everything is resolved when it fades. To black.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W. R. Jongejan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on December 22, 2023",
                "reviewTitle": "Grisham in topvorm",
                "reviewText": "Dit boek is weer een onvervalste Grisham. Spannend van begin tot eind en inhoudelijk interessant. Dit boek beschrijft ook hoe ingewikkeld internationale verhoudingen zijn. Ik wil niets over de inhoud vertellen om geen leesplezier te bederven. Ik heb het in één ruk uitgelezen.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doc Culbard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 14, 2024",
                "reviewTitle": "Another enjoyable and stimulating novel from the master of literary fiction",
                "reviewText": "In the conclusion to an Author’s Note at the end of this book, The Exchange, John Grisham says, “A special thanks to the readers who have enjoyed The Firm over the years and have been kind enough to write and ask: Will we ever see Mitch and Abby (McDeere) again?” Well, The Exchange is Grisham’s 41st novel, and 38 others have been written by this prolific author since The Firm, the book that introduced the McDeere’s to this author’s readership.In terms of time, it has been fifteen years since Mitch McDeere stole $15 million from the mob and disappeared. In its passing narrative, occupying some 334 pages from the Hodder and Stoughton publishers, The Exchange fills-in some of the details of that event, by way of offering a possible reason why, since then, Mitch and his wife, Abby, have lived in relative obscurity, with Mitch working his way to being one of the top lawyers working for the biggest law firm in the world, Scully & Pershing.It is not by chance that John Grisham is amongst the foremost writers of his time, and, in The Exchange, John Grisham tells the story of how a new case takes Mitch McDeere to Libya and his involvement in one of the biggest hostage negotiations in recent history. Terrorists who have murdered, and will do so again, have captured a fellow London-based lawyer with the firm of Scully & Pershing, Giovanna, the daughter of a wealthy Italian, Luca. Mitch and Giovanna had been representing Luca in his legal battle with the Libyan government over the latter’s refusal to reimburse Luca for his company's work in building a bridge for the Libyan government in the Libyan desert.Whilst in Libya, Giovanna had been captured by terrorists and held for a $100 million ransom – to be paid within ten days. Mitch, and in due course, his wife Abby, has become central to the negotiations with the terrorists for Giovanna’s release. The narrative of the novel develops from this situation. In some ways, The Exchange is a follow-up to The Firm, but in other ways it is a separate story which, with Grisham’s narrative skills, simply and clearly offers some parallels between Mitch McDeere’s previous experiences and those he now faces and shares with Abby. The difference now is that with the clock ticking, Mitch must remain one step ahead of those who have kidnapped Giovanna. So too, unlike his experiences with the mob who are intent on revenge, there is nowhere where Mitch can now hide.Early in the novel, John Grisham prepares his readers well for what is to come. There is a gradual development of the story, with important background information concerning his major characters. There are no overwhelming emotional or physical junctures, but it is a narrative that gradually draws in the reader as the story continues and develops. When it is reached, the denouement of the plot and the conclusion to the novel provides satisfaction and literary completion, rather than great tension and surprise. This is the mark of an experienced and successful writer, and, in these areas, there are few who are the equal of John Grisham.The Exchange is, for this reviewer, one of the most enjoyable and stimulating of John Grisham’s later novels. Not only does The Exchange reintroduce the character of Mitch McDeere, but there is also a gentle but firm reminder that the author, John Grisham, remains one of the modern legends of literary fiction. The Exchange is well worth its purchase price and comes with this reviewer’s highest recommendation.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "amazonreader",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 22, 2023",
                "reviewTitle": "The Firm The Exchange The Tension",
                "reviewText": "I've just been reading the first two chapters of The Exchange - and it's back: the tension of the story is tickling my nerves again, just like when I was reading The Firm a few years ago. It's great story-telling.It's like a piece of music played with a \"strange vibration between the notes\".",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kjell Ivarsson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on November 14, 2023",
                "reviewTitle": "Ännu ett mästerverk",
                "reviewText": "Johan Grisham är min absoluta favoritförfattare, läser allt han skriver.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "roberto",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on November 13, 2023",
                "reviewTitle": "bello",
                "reviewText": "da legere",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}