{
    "remaining_requests": 1059,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Trap-Devil-Ben-Coes-audiobook/dp/B06Y2JQ7X2",
    "body": {
        "name": "Trap the Devil: Dewey Andreas, Book 7",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Trap-Devil-Ben-Coes-audiobook/dp/B06Y2JQ7X2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/515LGOOznFL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ben Coes",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ben+Coes"
        },
        "brand": "Ben Coes",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5053,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A group of some of the most powerful people in the government, the military, and the private sector has begun a brutal plan to quietly take over the reins of the US government. They've begun to remove the people who stand in their way - and replace them with their own sympathizers and puppets. They've already taken out the Speaker of the House - whose death was made to look like an accidental drowning - and the president and vice president are next. Once they have their own people in place, they plan to start a bloody, brutal war on an unimaginable scale. On restricted duty while he recovers from injuries incurred on a previous mission, Dewey Andreas is sent to Paris by CIA director Hector Calibrisi. The Secretary of State is going there for secret talks, and Dewey is to be an extra layer of security above the State Department team. But what should be an easy mission couldn't go more wrong. The cabal has sent in a hit man to take out the Secretary of State and lay the blame for this murder at the feet of Dewey himself. With the Secretary of State dead, shot by Dewey's weapon, Dewey is on the run and out in the cold, desperately trying to unravel the plot before the conspirators succeed in killing millions of innocents. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Spies & Politics",
                "link": "https://www.amazon.com/Spy-Stories-Tales-Intrigue-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10493"
            },
            {
                "name": "Political",
                "link": "https://www.amazon.com/Political-Thrillers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7538395011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 3 minutes"
            },
            {
                "name": "Author",
                "value": "Ben Coes"
            },
            {
                "name": "Narrator",
                "value": "Jay Snyder"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 20, 2017"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B06Y2JQ7X2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#31,779 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #172 in Military Thrillers (Audible Books & Originals) #206 in Political Thrillers (Audible Books & Originals) #468 in War & Military Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Adam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFTL2BUQZXBMQS76EED4IFAAHSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QFZ2DXU7MH7M?ASIN=B06Y2JQ7X2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Another Classic",
                "reviewText": "Ben Cora delivers another classic, each better than the last. I was hooked from page 1. What a story. Onto the next one!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W. D. Barnum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFNWLAN7XVFFQEUOG32CPTCSKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RIYFTJ2CM69KO?ASIN=B06Y2JQ7X2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 11, 2018",
                "reviewTitle": "4.0 out of 5 stars Plot is not as good as some in the series",
                "reviewText": "One of the things I have enjoyed in the Dewey Andreas series of books by Ben Coes are the plots, however, this one seems to fall short in my opinion. It's been done many times before - the takeover of the US government by killing off the top leaders and placing the evil doers in their places.The book does have plenty of action, as do all the books in the series, and Dewey is, as usual, indestructible.I read the eighth book (and the latest) in this series, Bloody Sunday, first and enjoyed it. So, I went back and bought the others and have read them in order. This book is the seventh in the series, and takes the reader to the place that Bloody Sunday starts. I would suggest reading these books in order of publication.The author continues not to understand that Arab men do not wear Hijabs and still does not know when to use the word \"take\" instead of \"bring\". Just annoying. At least he did not have the many errors surrounding weapons, which seemed to plague the earlier works.If you are reading the series, then buy it and read it, but beware that it may not grip you as do some in the series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard B.  Schwartz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW3DUWSCRVG5OG6WYOZSID2GB7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RV1JT30N8YHIC?ASIN=B06Y2JQ7X2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 29, 2017",
                "reviewTitle": "5.0 out of 5 stars Another Summer Delight",
                "reviewText": "Dewey Andreas is an ex-Delta, CIA operative who dates the daughter of the Director of the CIA and spends the bulk of his professional time saving the world (though not necessarily in that order). In TRAP THE DEVIL Dewey faces his greatest challenge yet. A group of rogue Washington agents have formed what amounts to a shadow government. Their plans are simple: to assassinate the Speaker of the House, the Secretary of State, the Vice President and President. They will then insert their ringer Speaker into the presidency and launch nuclear strikes against the Middle East and Europe. Their goal is to prevent any further Islamic terrorism by effacing all Muslims from the face of the earth.Dewey has been dispatched to Paris as backup protection for the Secretary of State, but when he is murdered (using Dewey’s pistol) the hunt is on. Dewey is captured by the French security apparat, but when he escapes they issue an INTERPOL alert which signals to each and every one of Dewey’s past opponents (a very long list) that he is on the lam and vulnerable to capture and assassination. At any one point, Dewey is being chased by the French, some Middle East terrorists, the Iranians and an agent of the rogue conspirators. In return, Dewey himself is looking for a woman who was seen in the Secretary of State’s suite at the time of his murder. Was she the murderer or a person who conveyed information to him which resulted in his death?Much of the action takes place in France, with a wonderful car chase through Paris and a classic series of scenes on the night train from Marseille to Frankfurt, a sequence that would have put Cubby Broccoli into paroxysms of joy and made the Orient Express scenes in FROM RUSSIA WITH LOVE look like an underfunded first draft for state of the art action/adventure on the rails.Only one regret: while Katie and Rob are along for the ride, with Hector Calibrisi, et al. in support, there is no appearance by the stunning Mossad operative, Kohl Meir. Perhaps next time.Ben Coes does not write reflective, philosophic fiction; he writes slam/bang commercial fiction with an insider’s knowledge of government agencies and an aficionado’s knowledge of weaponry, both that made of steel and that made of 1’s and 0’s. His books convey the feeling that our government is far more effective and its defense systems far more advanced than we would ever dream. He takes us from country to country and, as far as I can tell, his facts are solid. The best test is to check him on some sequence of details with which the reader is personally familiar. In this story, e.g., there is a scene at a restaurant in Great Falls, VA and a car chase that ensues on the country road that connects the restaurant to the rest of the northern Virginia grid. I have eaten at that restaurant on multiple occasions (as has most of Washington) and driven that road many times, always in the dark. It looks and feels just as Ben Coes describes it.TRAP THE DEVIL is part of the summer’s bounty thus far, along with such other delights as Brett Battle’s THE AGGRIEVED and Don Winslow’s stunning THE FORCE. Personally, I am a sucker for the Washington suburbs, with evil people sitting on old leather couches, warming themselves before fiery hearths, sipping expensive whiskey and planning to destroy America, particularly when you just know that their cashmere cardigans are going to be covered in blood in just a few hours of reading time.Enjoy.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dan Berger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGLSC3ZESDAQWTZ3JNTDE7TUBU2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CCQK25RI0OAA?ASIN=B06Y2JQ7X2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2017",
                "reviewTitle": "5.0 out of 5 stars Coes delves deeper into Andreas' surly loner personality",
                "reviewText": "I enjoy the Dewey Andreas novels immensely. They have a ton of action and Coes doesn’t sugar-coat it: they’re very violent with a high exploding-head quotient. The tradecraft and inside poop are always good.Andreas’ surly loner persona creates both a tension and a realism, since you can’t see a normal person doing what he does. Writers wanting to establish their action heroes as nice guys sometimes defy realism, but Andreas’ combination of laconic guy humor at one end, and the desire not to kill if he doesn’t really have to at the other, are enough to do that here. That plus knowing the president, the CIA director, the latter’s cute daughter and others in an inner circle all love him.This story fascinates a couple of accounts. We dig deeper into his surly loner head. CIA boss Hector Calibrisi orders him to visit the agency psychiatrist, to explore his obvious death wish. Andreas constantly strikes off on his own, without orders, against the world’s worst bad guys. This story yields a stunning twist into the event which set him down this path, the death of his wife, for which he was charged and acquitted, but which poisoned his relationship with the Army.As the FBI, cooperating with the Canadians, plots to take down a jihadi-recruiting Toronto mosque, carnage breaks out there. NSA data crunching leads to a shock: cell phone calls tied to it were moving through an off-the-books spy satellite with a never-used frequency. There’s a plot and it involves some very inside people.Meanwhile a Swiss woman learns her husband is plotting to kill the U.S. president. Before she can flee she’s locked up in a psychiatric hospital.Dewey, who while being shrunk is given what’s supposed to be an unchallenging assignment protecting the Secretary of State overseas, is nearby when the man is assassinated. French intelligence throws Andreas in jail and begins a brutal interrogation.White right-wing bad guys - the villains du jour for virtually every TV, movie or novel lately - are plotting to rid the world of Muslims. It’ll take the presidency to do what they want: massive nuclear strikes throughout the world of Islam.So launches a massive nuclear strike of an action thriller. I particularly liked the over-the-top train sequence, in which Dewey and the woman’s assassin husband are both chasing her and both Arab terrorists and Iranian spies are chasing Dewey. He’s aided meanwhile by his frequent confederates Katie and Rob.Like all good train scenes, the climactic action actually happens over the top, up on the roof during a howling blizzard. Coes is just exuberant in his action scene plotting. The intensity of this book just keeps on building.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Huw",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 4, 2017",
                "reviewTitle": "Trap The Devil – Ben Coes. The book begins ...",
                "reviewText": "Trap The Devil – Ben Coes.The book begins with a series of flashbacks the first one a terrorist attack at a Madrid train station which among others kills Charles Bruner’s nine-year-old daughter. The second to a meeting at CIA headquarters Langley Virginia, setting out a covert programme named Order Six, housed inside state, beyond the parameters of protecting the president without the restrictions of the pentagon and CIA, using only elite soldiers from Coronado, Bragg and the farm, a pre-emptive, of the books undocumented, lethal outside the lines black on black team, run by Charles Bruner.But now decades later Order Six has gone rouge with an inner circle of 2 joint chiefs of staff, 3 cabinet sectaries, more than 2 dozen high ranking officials inside President Dellenbaugh’s administration, along with members of the military and the private sector, all loyal to the vision of Bruner’s American dream, wanting to kill everyone who gets in their way, and replace them with their own people, a sort of shadow government in waiting. The speaker of the house is their first victim killed while duck hunting in Georgia, with their own man becoming 3rd inline to the presidency.Dewey Andreas on light duties after being stabbed and almost killed by Sirham el-Khan on the roof of Columbia university, is sent to see a shrink in order to understand what he’s been through and to get back into operational duties, is asked by Hector Calibrisi to accompany the US secretary of state to France for secret talks with Iran. But Dewey is framed for the murder of the secretary of state his colt .45 M1911A1 found at the scene.Dewey is on the run from the authorities trying to find a woman with all the answers about Order Six, before they can kill her and set the scene for Charles Bruner’s endgame to kill the President and vice President, put his own man in charge and kill millions of people, to make up for his daughter’s death. Dewey is helped along the way by Katie Fox and Rob Tacoma, all the while being hunted by Iranian agents after previously stealing their only nuclear weapon and Nebuchar Fortuna, hell bent on revenge for the death of his father and brother, along the way finding out the truth of the death of His Wife Holly.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Client d'Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in France on July 22, 2017",
                "reviewTitle": "Disappointed",
                "reviewText": "French sentenses translated with google, is it so difficult to find a french speaking person and check... ? Places in Europa far from reality, should have used google maps... Speaking french in Lauterbrunnen, ha ha ha... Technical big errors with frequency, medical and satellite. Some characters are overcomplicated (Romy) and not explained at the end. Nice to read, but poor quality.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Todd Simpson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on July 17, 2017",
                "reviewTitle": "An Amazing Story",
                "reviewText": "Wow, what an exceptional story. Ben Coes really knows how to write brilliant Action Thrillers, and he has built up quite a following with his fabulous books. I’ve read all seven books in the series, and I’ve really enjoyed every one of them. This book has a good balance between the Action scenes and the main story line. There is also a vast range of interesting and diverse characters. Dewey thought he was being given a soft assignment when his boss asked him to travel to Paris to look after the Secretary of State. Romy Banker was unlucky enough to over hear her husband’s horrifying plan, and even more so to learn that Kyrie was a paid assassin. Romy knew that she had to find someone she could trust, and pass on what Kyrie and some other powerful men were planning. She had no idea what lengths these men were prepared to go to stop her. When the Secretary of State is killed and Dewey is accused of his murder, he is suddenly put on everyone’s radar around the world. His biggest problem isn’t so much getting out of the murder wrap, but more so the dangerous men who are out to kill him. The Author has that wonderful ability to pull the reader into the story and not let go. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CW",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 25, 2022",
                "reviewTitle": "Great read.",
                "reviewText": "Page turner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mr. Deryck R. Sealy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 4, 2018",
                "reviewTitle": "An excellent spy thriller",
                "reviewText": "If you enjoy Vince Flynn's, Matt Rapp character, this will be right up your street. This is a barnstorming read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}