{
    "remaining_requests": 1224,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Everyone-Who-Can-Forgive-Dead-ebook/dp/B0C1X7W5QP",
    "body": {
        "name": "Everyone Who Can Forgive Me Is Dead: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Everyone-Who-Can-Forgive-Dead-ebook/dp/B0C1X7W5QP",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91R34ScmjlL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jenny Hollander",
            "link": "https://www.amazon.com/Jenny-Hollander/e/B0CSKKT36W/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.8 out of 5 stars",
        "customerReviewCount": 160,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157305011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C1X7W5QP"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Minotaur Books (February 6, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ February 6, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4859 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 294 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1250890845"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,372 in Kindle Store (See Top 100 in Kindle Store) #374 in Psychological Thrillers (Kindle Store) #530 in Psychological Thrillers (Books) #881 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "3.8 3.8 out of 5 stars 160 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/86655a3f-45a2-456c-915d-e655ac042e87.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e12c1bb8-0936-4297-abc5-343f78a51866.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2712ed5e-62fc-40ac-ba2b-e6864125663c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7fa7fe64-cf49-460c-a533-d309ee4ca02c.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "the beached quill",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVUZNEFADC4DYYQX5ZR2CA23AQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27N0CWDPYN38T?ASIN=B0C1X7W5QP",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "4.0 out of 5 stars Survivors of their college multiple murders struggle to uncover the clouded truth of it.",
                "reviewText": "When I first heard this terrific title I thought 'this sounds like either a psychological thriller or an Italian western that Clint Eastwood passed on. It's the first of those two choices and belongs in an ever growing sub-genre of thrillers........in which the survivors of bloody mass murders deal with the repercussions of the crime.....with the deaths usually happening a decade or so earlier during their college days. I've already read any number of such novels and it seems like they're piling up enough for librarians and booksellers to group them in special displays.....(possibly under the heading, \"You thought YOU had it tough in college\" The alumni of a prestigious journalism graduate school have done pretty well for themselves, especially 'Charlie' Colbert, a transplanted Brit who's become the editor of a celebrated supplement to a major newspaper. And not only that, she's engaged to the heir of powerful publishing empire. But Charlie's haunted with agonized guilt over the notoriously named \"Scarlet Christmas\", when those among her circle of collegiate friends were brutally murdered on Christmas Eve. Her memory's blocked out the worst parts of it and she fears if the whole truth is ever revealed, she'll somehow end up incriminated. Her worst nightmare comes true when fellow survivor Steph, a formidable TV personality, plans to produce a movie of Scarlet Christmas.....a movie in which all the facts of what really happened that night (and who did what to whom) will be laid out for a worldwide audience. How could I ever resist a set up like that? As Charlie's carefully perfect life starts to come undone, author Jenny Hollander carefully rations out nuggets of clues about the murders......which naturally guarantees us to keep reading till we get the whole story. What I liked most.......unlike other books in this particular genre, it doesn't slip into that sinkhole of internal monologues that forces a reader to skim through the interminable blah-blah-blah of potentially unreliable narrators. It's a zippy read, filled with dialogue and the prose nails these characters with knowing observation. In other words a genuine page turner from beginning to end. But what I found myself going 'hmmm' about was the final big reveal and epilogue wrap-up. Satisfying for sure, but some of the motives and behavior struck me as unclear, not fully explained......and to be honest, maybe just a bit far-fetched and tough to swallow. For me, that's why I knocked it down from 5 stars to 4. I can't deny though that \"Everyone Who Can Forgive Me' kept me riveted and entertained. It did have me swiping through the e-pages at maximum speed to see what happened and uncover the worst of those 'Scarlet Christmas' secrets. So I'd sincerely advise librarians and booksellers to not forget to include this one in your displays of books about mass murder survivors trying to make sense of their trauma....and the elusive truth of it.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linzie H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPDN4FGIR3BK2GBD7RYOB3QLOLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3U61HCP4VVT4Z?ASIN=B0C1X7W5QP",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "3.0 out of 5 stars A startling exposé on grief and trauma, but not exactly a thriller (3.5 stars)…",
                "reviewText": "When Charlotte ‘Charlie’ Colbert was a young, impressionable twenty-three year old just starting her graduate degree in journalism, her world was rocked off of its foundation. Supposedly just a mere witness, the life-altering events that took place on Christmas Eve at her crème de la crème university, have left Charlie scarred by the past. It took everything she had to get through the aftermath of what the country coined ‘Scarlet Christmas.’ Especially given that she knows she was so much more than just a spectator, which is a fact she’s worked hard to keep hidden.Now nine years after that fateful, blood-soaked night, Charlie has worked her way up to editor-in-chief of a glamorous magazine and is engaged to the heir of a major publishing house. With a thicker skin and quite the reputation to protect, Charlie is adamant that no one will ever be able to get through her defenses again. Especially once she learns of a new movie set to be filmed. Based on the events of the worst night of her life, Charlie knows she can’t let it go ahead. She simply has too much to lose. No matter the cost, she will stop the film in its tracks—even if it means more blood must be spilled.Everyone Who Can Forgive Me Is Dead was quite the slow burn psychological suspense novel. Not exactly a thriller, in my humble opinion, it was nevertheless a startling exposé on grief and trauma. Complete with several shocking twists and a top-notch unreliable narrator, this compelling debut from Jenny Hollander was a solid read for this mystery lover.The strongest piece to this puzzle of a plot were certainly the dynamic characters—especially Charlie herself. Taut and beautifully written, her fragile state was perfectly crafted. From debilitating anxiety to life-altering dissociation, Charlie’s mental health drove the storyline for much of the book. Don’t get me wrong, there were plenty of well guarded secrets and underhanded motivations, but the characters were easily the star, as the rest of the cast were also simply sublime.As for that plot, around halfway through I was utterly floored by what I thought would be a game-changing twist. Sadly, however, it didn’t quite lead anywhere in the end. Even the perfectly set up climax was somewhat of a let down when it too was less than I expected. Just the same, Charlie’s unraveling and the much hinted at mysterious history kept me gladly turning the pages until the final conclusion, which had me smiling with glee.My biggest issue with the story, however, was the very format itself. Told via dual timelines of then and now with the focus primarily on the latter, I personally thought it could’ve been a much stronger novel if the emphasis had been on the former. With constantly building foreboding and mania for days, I would have much preferred to see the events taking place live, so to speak, instead of them coming across as rather flat, all said and done.Still, it was quite the gripping novel. Starting with a bang with an attention-grabbing prologue that promised one heck of a plot, the poignant exploration of trauma was a serious hole in one. On top of that, the tension I could feel seemed to raise the stakes as the plot continued to unfold, making me race through the pages to learn the truth of what happened that fateful night. In the end, while it wasn’t necessarily perfect, I enjoyed this book wholeheartedly and look forward to seeing what Hollander writes in the future. Rating of 3.5 stars.Thank you to Jenny Hollander and Minotaur Books for my complimentary copy. All opinions are my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jamie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHX23SX34QOCILOBWU66UM6DQZ3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FKQEFBYQTL59?ASIN=B0C1X7W5QP",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Dazzling suspense",
                "reviewText": "When I tell you this novel kept me on the edge of my seat, I am not being dramatic. This novel was perfectly paced. Typically I hate flashbacks, but the sequence in which Jenny places them and the pacing was perfect. I’m a huge fan of the thriller/suspense genre, and this is one of my top 5 of all time. Jenny Hollander, you brilliant minx. Incredible novel, I can’t wait to read what you publish next!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "louise hogan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2024",
                "reviewTitle": "Twisty, enjoyable read",
                "reviewText": "I loved this book! It's a really twisty thriller with compelling characters. Making the main character a magazine editor and her fiancee a publishing scion gives it a real gloss of wealth that's compulsive to read but the characters have a lot of depth too. I raced to the end, highly recommend.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}