{
    "remaining_requests": 1095,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Time-Mercy-Jake-Brigance-Book-ebook/dp/B087PKF9LZ",
    "body": {
        "name": "A Time for Mercy (Jake Brigance Book 3)",
        "price": "$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Time-Mercy-Jake-Brigance-Book-ebook/dp/B087PKF9LZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51GLWc0PGES.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/516cEdIm16L._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "John Grisham",
            "link": "https://www.amazon.com/John-Grisham/e/B000AQ40M8/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 84722,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B087PKF9LZ"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Anchor (October 13, 2020)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ October 13, 2020"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5626 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 468 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1529342368"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#11,340 in Kindle Store (See Top 100 in Kindle Store) #115 in Legal Thrillers (Kindle Store) #288 in Murder Thrillers #499 in Crime Thrillers (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 84,722 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/711f777a-b9cc-4000-9c61-9638c969882c.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a7638713-dd09-4430-b6c3-8822533ed0a9.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/cbfeff20-df4f-49d7-9d28-b2a0190c0ad7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/f3e6e5f6-c7a0-4fac-a6fd-40cfd1097548.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kay Thompson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJKHRKHDILDRHRYU54J25V4TWEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29AXWJLKJIXGH?ASIN=B087PKF9LZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars At least a 10 star book.",
                "reviewText": "Being molested as a child of 12, this book captivated me. I was re-living my horror story through Drew and Kiera. Even though I didn't get to find out if Drew would be found not guilty, I was very happy to hear the first trial was declared a mis- trial. Maybe one day you will do another great book continuing this story and Drew found not guilty, and Kiera and Josie will be doing amazing. Thanks again for a great read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DebC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4D5ZPCRK5CSFHT7ZZLMRYCFHPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3LH9FIJNEJARX?ASIN=B087PKF9LZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Fabulous Story",
                "reviewText": "Loved this book so much. Great storyline, great characters and compelling to the very end. Love John Grisham’s novels. He’s one of the best!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JHSiess",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4QWSK6PEY7RKELK2WPE7EKPVSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OPGQCO0APB1W?ASIN=B087PKF9LZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2021",
                "reviewTitle": "4.0 out of 5 stars Grisham has no equal when it comes to courtroom dramas",
                "reviewText": "Five years have passed since Jake Brigance found himself handling the most controversial and consequential case of his career to date. Carl Lee Hailey, out of his mind with shock, outrage, and grief after his little ten-year-old daughter was ruthlessly, brutally attacked by two shiftless, callous young men, sought justice on his own terms. In the process of defending him, Jake nearly lost everything -- his home, his legal practice, his family, and his own life. But after the verdict was announced, the television news crews left to chase other stories, the people of the little town of Clanton, Mississippi calmed down, and things pretty much went back to normal, and Jake, Carla, and their daughter, Hanna, were able to put their lives back together. Jake is still practicing law, Carla is teaching, Hannah is growing and thriving. And for the business folks in Clanton, life still pretty much begins anew every morning in the local Coffee Shop where the waitresses don't have to ask anyone what they want to order. Everyone there is acquainted and news is shared long before it's published in the local paper.But after 2:00 a.m. on a Saturday night, in a nondescript little house six miles south of Clanton \"on an old country road that went nowhere in particular,\" Josie \"took a deep breath, said a quick prayer, and eased to the window to watch\" Stuart Kofer's car as it pulled into the driveway. Josie braced herself as she tried to discern if the car was weaving or under control. Clad in a negligee that had pleased him once before, Josie watched Stuart stagger into the house as her children, Drew, age 16, and Kiera, two years younger, hid upstairs. The three of them have nowhere else to go, so Josie has endured the beatings that invariably come after Stuart has been drinking.In a mesmerizingly horrifying first chapter, Grisham describes what ensues after Stuart bursts through the door and finds Josie still awake. After a row in the kitchen as the children listen, the house suddenly goes quiet. Stuart stumbles up the stairs and appears to be headed for the room in which they have attempted to blockade themselves. Instead, he moves on to his own room. But Drew has had enough. Believing Stuart has finally killed Josie, like Carl Lee Hailey, Drew seeks justice on behalf of his mother, sister, and himself. He puts the tip of Stuart's nine-millimeter Glock -- his duty weapon -- one inch from Stuart's left temple . . . and pulls the trigger.Ozzie Wells is still the Sheriff of Ford County, having been elected in 1983. It was a historic election because Ozzie is the first black sheriff and he is deeply shaken at losing a deputy for the first time. Carl Lee Hailey shot DeWayne Looney and caused him to lose part of his leg, but DeWayne remains on the force. But now Ozzie has to call in the Mississippi state police to investigate the murder of one of his own. He warns his deputies to handle the case by the book and put Drew in mechanical restraints (handcuffs), opting to transport Drew and Kiera to the jail himself, accompanied by his chief deputy, Moss Junior Tatum. Kiera has already told Tatum that Drew shot Stuart. She is taken in by Reverend Charles McGarry, a 26-year-old pastor leading the fundamentalist Good Shepherd Bible Church that Josie and her children attended a few times.Now 37 years old, six days a week Jake is in the Coffee Shop by 6:00 a.m. On Sundays, the family enjoys breakfast before proceeding to church together. But Harry Rex Vonner, a divorce attorney and Jake's best friend, calls at 7:05 a.m. to warn him to leave town for a couple of days. The Honorable Omar Noose is sure to call Jake and appoint him to represent Drew, despite Jake's involvement in a large wrongful death case going to trial soon involving malfunctioning railroad crossing warning lights. \"Listen to me, Jake, you do not want a dead-cop case. The facts are against you. The politics are against you. There's not a chance in hell the jury will show any sympathy,\" Harry Rex cautions.Sure enough, Judge Noose appoints Jake and he has no choice but to defend Drew for the paltry fee of $1000. Once again he is in the middle of a controversial case, and starts avoiding the Coffee Shop and the hostility directed at him by many Clanton citizens, especially members of law enforcement, many of whom are his friends and neighbors. Stuart was a popular deputy in a town that respects law and order. Indeed, Stuart's family members take possession of the house and angrily burn the pitifully few items of personal property Josie and her children owned. Jake soon learns about Josie's troubled history, and the way she has raised Drew and Kiera. Jake quickly realizes that Josie and Kiera have no voice and no one to protect them, either. Jake's investigation also unearths facts about Stuart that enrage and disappoint Ozzie, and figure prominently into Jake's defense of Drew.Despite the financial and familial strain caused by his defense of Drew, and the potential negative impact on the wrongful death case, Jake soon finds himself squaring off against Lowell Dyer, the district attorney Jake supported in his bid to defeat Rufus Buckley, the man who unsuccessfully prosecuted Carl Lee Hailey. And to make matters worse, Dyer announces he will prosecute Drew in accordance with the 1988 Death Penalty Enhancement Act making it a capital offense to murder a peace officer whether he or she is on or off duty. With no ruling on its constitutionality by a higher court, Judge Noose is not inclined to strike the indictment.Grisham deftly and compassionately details the progress of Jake's preparation for Drew's trial, as well as developments in the railroad crossing case. Although he was a pariah in his own little town during the Carl Lee Hailey trial, it is still hurtful and difficult to find himself in that situation again, and it causes strife for his family, as well. And places Jake in grave danger.But Jake literally has no choice once he is appointed, and his sense of duty, coupled with his humanity, compels him to put his client's best interests first. Grisham's affection and empathy for his characters and their circumstances is evident on every page. (He makes no secret of the fact that A Time to Kill remains his favorite book.) At issue is the question of Drew's state of mind when he pulled the trigger, killing Stuart, and how the legal system should determine what is just. How is it fair to try any 16-year-old as an adult? While Stuart was passed out drunk when Drew killed him, he had just abused Josie yet again, terrifying her children who feared he had finally killed their mother and they would be his next victims. Drew is a particularly young 16 -- small, underdeveloped, and unsophisticated. Was he capable of what Dyer characterizes as \"coldblooded murder?\" Yet again, Jake finds himself at the center of an ethical conundrum: Was Drew's action justified?The story moves at an unrelenting pace, compelled forward by shocking developments and the crisp, pointed, and sometimes ironically witty dialogue of Grisham's beloved characters. In addition to the others, Lucien Wilbanks, Jake's alcoholic, disbarred mentor appears, again offering advice, support, and other assistance.As always, Grisham's story asks more questions than it answers which is, of course, the point. In addition to the legal quagmire illustrated by Drew's case, Grisham explores societal issues, including the appropriateness of the death penalty, abortion, the manner in which poverty impacts a defendant's ability to receive competent representation and a fair trial, and faith. Racism also figures into the story, as Jake is assisted by Portia, a brilliant African-American paralegal who will soon start law school and become a trial attorney herself. He does so by telling his characters' stories, never letting his narrative lapse into a preachy or judgmental tone. On the contrary, as is his habit, Grisham wants his readers to draw their own conclusions. That is more clearly evident in A Time for Mercy than in Grisham's other work. Not all readers will find the ending satisfactory.Grisham again proves that he is unequalled when it comes to engrossing and thought-provoking courtroom dramas populated by colorful, fascinating, and sympathetic characters. A Time for Mercy will delight Grisham fans who are familiar with the inhabitants of Clanton, Mississippi, and surely make fans of those who get to know them through this volume, which can be enjoyed as a stand-alone novel.Thanks to NetGalley for an Advance Reader's Copy of the book.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olivia",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTAVUOFHR6366RWALN5YZ3OYKEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2L9I2SP0T7R9K?ASIN=B087PKF9LZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Engaged",
                "reviewText": "Life was busy during this read but kept me coming back. Good read, Relatable, balanced & engaging. This story is probably too often true.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tim mcgaha",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKJL4ZGMQV2YYBNEEYXPW6GLROA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26T60IOREGCHS?ASIN=B087PKF9LZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars good read",
                "reviewText": "It would have been nice for the boy to have been exonerated but the adoption was a nice touch… our crazy legal system..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sobryan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOUHGE6OQPJORDHKV6EL47YUNUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3V2OUQTMMSS4J?ASIN=B087PKF9LZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 23, 2020",
                "reviewTitle": "5.0 out of 5 stars Jake Brigance, welcome back!",
                "reviewText": "An early holiday gift to each fiction readers each year is a John Grisham novel. This year, it gives us “A Time for Mercy” wrapped in decorative paper and tied with a pretty bow. In other words, his latest legal/crime thriller is a gift that should be “opened” as soon as possible and enjoyed at once.Grisham returns to his novel roots with this novel featuring Jake Brigance and his cast of cohorts, plus quite a few new ones. Before we get into the merits of this new novel, let’s review the Brigance legacy. He first was the lead character in “A Time to Kill,” Grisham’s first novel, but second to made into a movie after “The Firm.” That novel followed a young lawyer caught up in the fraud and criminal activity at his first law firm job. The movie starred Tom Cruise.It was a “Time to Kill” that set the tone for what has become Grisham’s best-selling author status. The novel was filled with racial tension, injustice, a father’s despair after his daughter’s rape, and a conclusion that felt so right, so deserved. Jake Brigance was just starting out as a lawyer in the small southern town of Clanton. He was handed a case that many in his community felt would crash his career before it even started. Grisham’s protagonist proved them wrong.When the movie came out, Matthew McConaughey stole the show with his depiction of Brigance. It’s hard to reread “A Time to Kill” without inserting McConaughey’s distinctive accent into every word.Grisham wrote another Brigance-based novel, “Sycamore Tree” (2013), about a dying man who hangs himself and leaves behind a handwritten will that throws the Clanton community into a racial storm, murder trial, and more. It was a fascinating story, but it doesn’t compare to the latest Brigance legal thriller.In “A Time for Mercy,” Brigance has settled into normal life as he waits for a hopeful “cash cow” trial to refill his coffers. All is on track until Judge Noose taps him as the court-appointed attorney for Drew Gamble, a young man accused of shooting a domestic abuser. When the man wasn’t beating up the boy’s mom, he was a deputy for Sheriff Ozzie Wells. From there, the story evolves into a fight for juvenile justice, women’s rights, legal reform, and much, much more. The town and surrounding areas are divided with many, including the dead man’s family, clamoring for a speedy trial and the death penalty.This is where Grisham shines. His own experiences as a lawyer in the South give a depth of truth, justice, and personal struggle to his writing. This is especially true in “A Time for Mercy,” where the author’s true desire for justice shows in the way Brigance approaches law. The character’s strong beliefs in equal representation for all, innocent or guilty, and fighting for the little guy drive him steadily forward. Brigance comes off as a compassionate human that readers can’t help be admire. Yes, he stumbles and sometimes falls, but he gets up again to confront his mistakes, his personal beliefs, and his need to protect his family.Brigance’s representation of a 16-year-old, who happens to look more like a 12-year-old, divides the community. The boy and his younger sister Kiera thought their mom Josie was dead. They were afraid her boyfriend, Stuart Kofer would come after them when he woke up from a drunken sleep. The boy shot him and confessed. End of story? Far from it, but to tell more would spoil it for the reader.In the Brigance trilogy, there’s a time to kill, a time for justice, and a time for mercy. And, as said earlier, as you read this novel, Matthew McConaughey will be whispering in your ear.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ute",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHZPSE2UYNNB4WMVY562A22RLSQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R399BJID0OKREU?ASIN=B087PKF9LZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Excellent",
                "reviewText": "Great book. Keeps you interested. Great story line. Can't wait for the next book from the Author. Will buy another.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B elli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSUZO4KPULZP5RRHWW5USWQXOCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UHVAISR5DADK?ASIN=B087PKF9LZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "5.0 out of 5 stars A time for mercy",
                "reviewText": "Another great novel by a great author. While attorney Jake Brigance gains a win, it is only a temporary one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cindy watson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 27, 2023",
                "reviewTitle": "Great read!",
                "reviewText": "Another great book by John Grisham. It held my attention at the first page. I was a little disappointed in the ending though.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Regininha",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 5, 2022",
                "reviewTitle": "Não é exatamente um romance policial. Desde logo se sabe quem foi. É história do julgamento .",
                "reviewText": "Texto claro, bem escrito, excelente descrição do aprofundamento da relação entre as pessoas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 15, 2022",
                "reviewTitle": "Truly, the best of Grisham.",
                "reviewText": "No hesitation in highly recommending this title. With its incredible twists and turns the reader will be totally absorbed until the last sentence.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Margit Flierl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 10, 2023",
                "reviewTitle": "A Time for Mercy",
                "reviewText": "Please let me award 6 Stars? Buy it, read it, enjoy it! It really great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Therry Keasberry",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 18, 2022",
                "reviewTitle": "As always John Grisham!!",
                "reviewText": "There's nothing NOT to like about john Grisham's books!!!!I've read most and enjoyed them all!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}