{
    "remaining_requests": 1309,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Good-Girls-Guide-Murder/dp/1984896393",
    "body": {
        "name": "A Good Girl's Guide to Murder",
        "price": "$7.97$7.97",
        "originalPrice": "",
        "rawPrice": 7.97,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Good-Girls-Guide-Murder/dp/1984896393",
        "soldBy": {
            "sellerID": "A8146B9Q816MQ",
            "name": "Martistore",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A8146B9Q816MQ"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81jasyjB5LL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Holly Jackson",
            "link": "https://www.amazon.com/Holly-Jackson/e/B07QKBC6JZ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Martistore",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 49232,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review Praise for Holly Jackson's A GOOD GIRL'S GUIDE TO MURDER series: \"The perfect nail-biting mystery.\" —Natasha Preston, #1 New York Times bestselling author “Holly Jackson plays off of our collective true crime obsession brilliantly.” —PopSugar “Gripping.”—E! News Online “If you love true crime, murder mysteries, and unstoppable young women, this is the perfect easy-read thriller.” —Business Insider“A knockout series.” —The Nerd Daily “An instant shocker that will leave you on the edge of your seat.” —Los Angeles Times High School Insider\"This is a great, twisty read for fans of YA.\" —Book Riot \"A taut, compulsively readable, elegantly plotted thriller.\"—The Guardian“A fun, gripping, and skillfully constructed novel of suspense. I loved Pip—her relatable quirks, her inventive investigative approach, and her willingness to step outside of her safe world in search of the truth.” —Emily Arsenault, author of All the Pretty Things\"Dark, dangerous and intricately plotted—my heart literally pounded.\" —Laura Steven, author of The Exact Opposite of Okay\"So so clever.\" —Savannah Brown, author of The Truth About Keeping Secrets“Well-executed…. A treat for mystery readers who enjoy being kept in suspense.” —Kirkus Reviews\"Legions of fans of true crime podcasts may therefore flock to this one, and they’re unlikely to be disappointed.\" —Bulletin\"Fans of true crime will be hooked by the hunt for a killer, but there’s more to this Guide than just a whodunit. It’s a story of families, community and the ways a crisis can turn them against one another in the blink of an eye.\" —BookPage About the Author Holly Jackson is the #1 New York Times bestselling author of the A Good Girl's Guide to Murder series. She started writing stories at a young age, completing her first (poor) attempt at a novel when she was fifteen. Holly graduated from the University of Nottingham, where she studied literary linguistics and creative writing, with a master's degree in English. She enjoys playing video games and watching true-crime documentaries so she can pretend to be a detective. She lives in London. Follow Holly on Twitter and Instagram at @HoJay92. Excerpt. © Reprinted by permission. All rights reserved. one Pip knew where they lived. Everyone in Fairview knew where they lived. Their home was like the town’s own haunted house; people’s footsteps quickened as they walked by, and their words strangled and died in their throats. Shrieking children would gather on their walk home from school, daring one another to run up and touch the front gate. But it wasn’t haunted by ghosts, just three sad people trying to live their lives as before. A house not haunted by flickering lights or spectral falling chairs, but by dark spray-­painted letters of “Scum Family” and stone-­shattered windows. Pip had always wondered why they didn’t move. Not that they had to; they hadn’t done anything wrong. But she didn’t know how they lived like that. How the Singhs found the strength to stay here. Here, in Fairview, under the weight of so many widened eyes, of the comments whispered just loud enough to be heard, of neighborly small talk never stretching into real talk anymore. It was a particular cruelty that their house was so close to Fairview High School, where both Andie Bell and Sal Singh had gone, where Pip would return for her senior year in a few weeks when the late-­summer sun dipped into September. Pip stopped and rested her hand on the front gate, instantly braver than half the town’s kids. Her eyes traced the path to the front door. It was possible that this was a very bad idea; she had considered that. Pausing for just a second, Pip held her breath, then pushed the creaking gate and crossed the yard. She stopped at the door and knocked three times. Her reflection stared back at her: the long dark hair sun-­bleached a lighter brown at the tips, the pale white skin despite a week just spent in the Caribbean, the sharp muddy-­green eyes braced for impact. The door opened with the clatter of a falling chain and clicking locks. “H-­hello?” he said, holding the door half open, with his hand folded over the side. Pip blinked to break her stare, but she couldn’t help it. He looked so much like Sal: the Sal she knew from all those television reports and newspaper pictures. The Sal now fading from her memory. Ravi had his brother’s messy black side-swept hair, thick arched eyebrows, and oaken-­hued skin. “Hello?” he said again. “Um . . .” Pip faltered. He’d grown even taller since she last saw him. She’d never been this close before, but now that she was, she saw he had a dimple in his chin, just like hers. “Um, sorry, hi.” She did an awkward half wave that she immediately regretted. “Hi?”“Hi, Ravi,” she said. “I . . . You don’t know me. . . . I’m Pippa Fitz-­Amobi. I was a few years below you at school before you left.” “OK . . .” “I was just wondering if I could borrow a second of your time? Well, not only a second, we’re already way past that. . . . Maybe like a few sequential seconds, if you can spare them?” Oh god, this was what happened when she was nervous: words spewed out, unchecked and overexplained, until someone stopped her.Ravi looked confused. “Sorry,” Pip said, recovering. “I mean, I’m doing my senior capstone project at school and—­”“What’s a capstone project?” “It’s kind of like a senior thesis you work on independently, alongside normal classes. You can pick any topic you want, and I was wondering if you’d be willing to be interviewed for mine.” “What’s it about?” His dark eyebrows hugged closer to his eyes. “Um . . . it’s about what happened five years ago.” Ravi exhaled loudly, his lip curling with what looked like anger. “Why?” he said. “Because I don’t think your brother did it—­and I’m going to try to prove it.” Pippa Fitz-­Amobi 7/30/19 Capstone Project Log—­Entry 1 Our capstone project logs are supposed to be for recording any obstacles we face in our research; our progress; and the aims of our final reports. Mine will have to be a little different: I’m going to record all my research here, both relevant and irrelevant, because I don’t really know what my final report will be yet or what will end up being important. I will just have to wait and see where I’m at after all my investigating and what essay I can bring together.I’m hoping it will not be the topic I proposed to Mrs. Morgan. I’m hoping it will be the truth. What really happened to Andie Bell on April 18, 2014? And if—­as my instincts tell me—Salil “Sal” Singh is not guilty, then who killed her? I don’t think I’ll actually solve the case and figure out who murdered Andie. I’m not deluded. But I’m hoping my findings might lead to reasonable doubt about Sal’s guilt, and suggest that the police were mistaken in closing the case without digging further. The first stage in this project is to research what happened to Andrea Bell—­known to everyone as Andie—­and the circumstances surrounding her disappearance. From the first national online news outlet to report on the event: Andrea Bell, seventeen, was reported missing from her home in Fairview, Connecticut, last Friday.She left home in her car—­a white Honda Civic—­with her cell phone, but did not take any clothes with her. Police say her disappearance is “completely out of character.” Police began searching the woodland near the family home this past weekend. Andrea, known as Andie, is described as white, five feet six inches tall, with long blond hair and blue eyes. It is thought that she was wearing dark jeans and a blue cropped sweater on the night she went missing.1 Other sources had more details as to when Andie was last seen alive, and the time frame in which she is believed to have been abducted. Andie Bell was “last seen alive by her younger sister, Becca, around 10:30 p.m. on April 18, 2014.”2This was corroborated by the police in a press conference on Tuesday, April 22: “Footage taken from a security camera outside the bank on Fairview’s Main Street confirms that Andie’s car was seen driving away from her home at about 10:40 p.m.”3According to her parents, Jason and Dawn Bell, Andie was “supposed to pick (them) up from a dinner party at 12:45 a.m.” When Andie didn’t show up or answer any of their phone calls, they started reaching out to her friends to see if anyone knew of her whereabouts. Jason Bell “called the police to report his daughter missing at 3:00 a.m. Saturday morning.”4 So whatever happened to Andie Bell that night happened between 10:40 p.m. and 12:45 a.m. Here seems like a good place to type up the transcript from my interview with Angela Johnson. Transcript of interview with Angela Johnson from the Missing Persons Bureau Angela: Hello. Pip: Hi, is this Angela Johnson? Angela: Speaking, yep. Is this Pippa? Pip: Yes, thanks so much for replying to my email. Do you mind if I record this interview for my project? Angela: Yeah, that’s fine. I’m sorry, I’ve only got about ten minutes. So what do you want to know about missing persons?Pip: Well, I was wondering if you could talk me through what happens when someone is reported missing? What’s the process and the first steps taken by the police? Angela: When someone is reported missing, the police will try to get as much detail as possible so they can identify the potential risk to the missing person, and an appropriate police response can be made. They’ll ask for name, age, description, the clothes they were last seen wearing, the circumstances of their disappearance, if going missing is out of character for this person, details of any vehicle involved. Using this information, the police will determine whether this is an at-­risk missing persons case. Pip: And what circumstances would make it an at-­risk case? Angela: If they are vulnerable because of their age or a disability, or if the behavior is out of character, which indicates they could have been exposed to harm. Pip: Um, so, if the missing person is seventeen years old and it is deemed out of character for her to go missing, would that be considered an at-­risk case? Angela: Absolutely, when a minor is involved. Pip: So how would the police respond? Angela: Well, there would be immediate deployment of police officers to the location the person is missing from. The officers will get further information about the missing person, such as details of their friends or partners; any health conditions; financial information, in case they try to withdraw money. Police will also need recent photographs and might take DNA samples, in case they’re needed in subsequent forensic examinations. And, with consent of the homeowners, the location would be searched thoroughly to see if the missing person is concealed or hiding there and to establish whether there are any further evidential leads. Pip: So immediately the police are looking for any clues or suggestions that the missing person has been the victim of a crime? Angela: Absolutely. If the circumstances of the disappearance are suspicious, officers are instructed to document evidence early on, as though they were investigating a murder. Of course, only a very small percentage of missing persons cases turn into homicide cases. Pip: And what happens if nothing significant turns up after the initial home search? Angela: They’ll expand the search to the immediate area. They’ll question friends, neighbors, anyone who might have relevant information. If it is a teenager who’s missing, we can’t assume the reporting parent knows all of their child’s friends and acquaintances. Peers are good points of contact to establish other important leads—­you know, any secret boyfriends, that sort of thing. And a press strategy is usually discussed because appeals for information in the media can be very useful in these situations. Pip: So if it’s a seventeen-­year-­old girl who’s gone missing, the police would contact her friends and boyfriend early on? Angela: Yes, of course. Inquiries will be made, because if the missing person has run away, they are likely to be hiding out with someone close to them. Pip: And at what point in a missing persons case do police assume they are looking for a body? Angela: Well, timewise, it’s not—­ Oh, Pippa, I have to go. Sorry, I’ve been called into my meeting. Pip: Oh, OK, thanks so much for taking the time to talk to me. Angela: And if you have more questions, just shoot me an email and I’ll get to it when I can. Pip: Will do, thanks again. I found these statistics: 80% of missing people are found in the first twenty-­four hours. 97% are found in the first week, and 99% of cases are resolved in the first year. That leaves just 1%. 1% of people who disappear are never found. And just 0.25% of all missing persons cases have a fatal outcome.5 So where does this leave Andie Bell? Floating incessantly somewhere between 1% and 0.25%. Even though Andie has never been found and her body never recovered, most people accept that she is dead. And why is that? Sal Singh is why. two Pip’s hands hovered over the keyboard as she strained to listen to the commotion downstairs. A crash, heavy footsteps, skidding claws, and unrestrained boyish giggles. “Josh! Why is the dog wearing my shirt!” Pip’s dad shouted, the sound floating upstairs. Pip snort-­laughed as she clicked to save her capstone project log and closed her laptop. It was never quiet once her dad returned from work. Downstairs, Pip found Josh running from room to room—­kitchen to hallway to living room—­on repeat. Cackling as he went. Close behind was Barney, the golden retriever, wearing her dad’s loudest shirt, the blindingly green patterned one he’d bought during their last trip to Nigeria. The dog skidded elatedly across the polished oak in the hall, excitement whistling through his teeth. Bringing up the rear was Pip’s dad in his gray Hugo Boss three-­piece suit, all six and a half feet of him charging after the dog and the boy, laughing in wild bursts. “Oh my god, I was trying to do homework,” Pip said, restraining a smile as she jumped back to avoid being mowed down. Barney stopped for a moment to headbutt her shin and then scampered off to jump on Victor and Josh as they collapsed together on the sofa. “Hello, pickle,” her dad said, patting the couch beside him. “Hi, Dad. You were so quiet I didn’t even know you were home.” “My Pipsicle, you are too clever to recycle a joke.”She sat down beside them. Josh started excavating his right nostril, and Pip’s dad batted his hand away. “How were your days, then?” her dad asked, setting Josh off on a graphic spiel about the soccer games he’d played earlier. Pip zoned out; she’d already heard it all in the car when she picked Josh up from practice. She’d only been half listening, distracted by the way the replacement coach had stared at her, uncertain, when she’d pointed out which of the nine-­year-­olds was hers and said: “I’m Josh’s sister.” She should have been used to it by now, the lingering looks while people tried to work out the logistics of her family. Victor, the tall Nigerian man, was evidently her stepfather; and Josh, her half brother. But Pip didn’t like those words, those cold technicalities. The people you love weren’t calculated, subtracted, or held at arm’s length across a decimal point. Victor was her dad, who’d raised her since she was four years old, and Josh was her annoying little brother. Her “real” father, the man who lent the Fitz to her name, died in a car accident when she was ten months old. And though Pip nodded and smiled when her mom would ask whether she remembered the way her father hummed while he brushed his teeth or how he’d laughed when Pip’s second spoken word was “poo,” she didn’t remember him. But sometimes remembering isn’t for yourself; sometimes you do it just to make someone else smile. “And how’s the project going, Pip?” Her dad turned to her as he unbuttoned the shirt from the dog. “It’s OK,” she said. “I’m just researching at the moment. I did go to see Ravi Singh this morning, though.”“Oh, and . . . ?” “He was busy, but he said I could go back on Friday.”“I wouldn’t,” Josh said in a cautionary tone.“That’s because you’re a judgmental prepubescent boy who still thinks little people live inside traffic lights.” Pip looked at him. “The Singhs haven’t done anything wrong.”Victor stepped in. “Josh, try to imagine if everyone judged you because of something your sister had done.” 1 www.ustn.com/news/2014/04/21/local-­teen-­missing, 4/21/142 www.fairfieldctnews.com/fairview/crime-­4839, 4/24/143 www.ustn.com/news/2014/04/22/missing-­schoolgirl-­698834, 4/22/144 Forbes, Stanley, 2014, “The Real Story of Andie Bell’s Killer,” Fairview Mail, 4/29/14, pp. 1–­4.5 www.missingpersonstats.com Read more"
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 2 hrs 38 mins",
            "FREE delivery February 29 - March 1.",
            "Or fastest delivery Thursday, February 22.",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 14 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "THE MUST-READ MULTIMILLION BESTSELLING MYSTERY SERIES • Everyone is talking about A Good Girl's Guide to Murder! With shades of Serial and Making a Murderer this is the story about an investigation turned obsession, full of twists and turns and with an ending you'll never expect.Everyone in Fairview knows the story.Pretty and popular high school senior Andie Bell was murdered by her boyfriend, Sal Singh, who then killed himself. It was all anyone could talk about. And five years later, Pip sees how the tragedy still haunts her town.But she can't shake the feeling that there was more to what happened that day. She knew Sal when she was a child, and he was always so kind to her. How could he possibly have been a killer?Now a senior herself, Pip decides to reexamine the closed case for her final project, at first just to cast doubt on the original investigation. But soon she discovers a trail of dark secrets that might actually prove Sal innocent . . . and the line between past and present begins to blur. Someone in Fairview doesn't want Pip digging around for answers, and now her own life might be in danger.And don't miss the sequel, Good Girl, Bad Blood!\"The perfect nail-biting mystery.\" —Natasha Preston, #1 New York Times bestselling author Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Teen & Young Adult",
                "link": "https://www.amazon.com/Young-Adult-Teens-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=28"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Teens-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=17443"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Ember (January 5, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1984896393"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1984896391"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 14 - 17 years"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL700L"
            },
            {
                "name": "Grade level ‏",
                "value": "‎ 9 - 12"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.82 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#548 in Books (See Top 100 in Books) #3 in Teen & Young Adult Law & Crime Stories #4 in Teen & Young Adult Thrillers & Suspense (Books) #6 in Teen & Young Adult Romantic Mysteries & Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 49,232 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "A GOOD GIRL’S GUIDE TO MURDER GOOD GIRL, BAD BLOOD A GOOD GIRL'S GUIDE TO MURDER SERIES BOXED SET FIVE SURVIVE Devour the thrilling series that reads like your favorite true crime podcast or Netflix show! Meet Pip and uncover the truth behind Fairview’s most famous crime in this addictive must-read mystery. More dark secrets are exposed in this true-crime fueled thriller. This fast-paced mystery series is now a three-book hardcover boxed set! A road trip turns deadly in this addictive YA thriller from bestselling author HOLLY JACKSON",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b16f85ab-64d8-4cad-b589-b67593bccc07.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7dba9cdb-21d3-4b9b-97fe-4151fe57295c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/93d8f350-84f4-4a2c-8019-298c3755dc7c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/62f57538-53b2-4b0c-ae82-9189bf9a35f1.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3ce5b319-f1b6-46f6-a504-b27afb91b074.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/e30c914e-8601-46c8-bf0f-0f805616f810.__CR0,0,150,300_PT0_SX150_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Karissa Deiter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFZUVDCITJTEXHDVHREQNBALCQ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26PBSW8E0KGQQ?ASIN=1984896393",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "5.0 out of 5 stars I love this book.",
                "reviewText": "It usually takes me a while to get hooked on a book, but I was in right away.I appreciate the Capstone project entries. It was a great way to relay Pip's investigative findings without feeling unnatural. They also provided a nice format for her interviews so that there could be uninterrupted dialog.This book also had a very charming writing style -- with silly phrasing that just feels good (\"Pip slipped on her not-allowed-to-be-left-in-the-kitchen sneakers, which she’d left in the kitchen, and grabbed the leash.\")I have very few grievances. One being at the very beginning of the book (minor spoiler ahead). Pip mentioned multiple times at the start how unhappy the Singhs must be all the time. Her first extended conversation with Ravi, however, was very light-hearted. He joked, even flirted frequently. Now, she could only make an assumption because before this, she hadn't interacted with the family. She may not pick up on flirtatious comments, but she's very intelligent and I feel she should have mentioned that he was not as emotionally bleak as she expected.Obviously there are things here and there that people could complain about -- stupid decisions characters make that no one in their right mind would in real life -- but this is entertainment, and there was a purpose for this decisions.Wonderful story. I cannot wait to read the second book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stacey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJIWTWVREKPX7OMZAXT5NM3I3SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSS25HCHV2WOY?ASIN=1984896393",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Lightly creepy",
                "reviewText": "Story ***** World *****Main Characters ***** Side Characters ****Emotions **** Reader Frustration **Romance * Creepiness ***Narration **** Scary *Pros- Pip is smart at seeing the connections and nice- Ravi is sweet and smart and cute- I kept changing my mind on who was guilty. Then at the end it was not what I saw coming. Great twists.- I love it when you never know when the guilty party is going to move something or leave something...creepy- Lots of bad people get what they have coming- Though 20 and 17 I do like the peak at a maybe romance cause I adore RaviCons- Too many times PIP makes dangerous and stupid choices to do things alone when she knows there is a killer, even confronts the killer- I HATE the secret trope and when she doesn't tell her parents or Ravi someone broke into the house it is too far because there are more people involved than her- The amount of time the 20 year old Ravi and the 17 year old Pip spend alone in her room or the fact he keeps coming to see her would be weird for a parent- They make Ravi seem like a teenage boyI read and listened to this book and enjoyed it both ways. The audible is really engaging. I would give it a 4.5 if they had the rating. The reason I gave it a 4 was because of her secretly wandering off alone too often. Otherwise, I spent the entire book just waiting for what would come next. I wish the friend group was a little more developed but the ones that were critical to the story were developed. I will definitely be reading the next book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beth Deese",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOIPCBED2R4JHUF5ZR2LR7TKYCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13M2NX2UBJ6FY?ASIN=1984896393",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "5.0 out of 5 stars fast-paced and intense!",
                "reviewText": "So I’m honestly not a big crime and mystery reader. I get scared way too easily and I hate that feeling. This book kept coming up in recommendations as a must read so I took the plunge, turned on all the lights in the house and started on a journey with Pippa to discover just what happened to her town’s teen queen, Andie Bell, one twisted night. This book hooked me right from the beginning and I loved solving the mystery with Pippa!Holly Jackson sure knows how to write a who-dun-it. The details unfolded at such a pace I could barely keep up with them, but I loved rocketing along and never getting bored. I finished this book in 24 hours because I just couldn’t put it down. It’s intense without being too terrifying. I’m glad it was YA to save me from nightmares, lol.Pippa, the MC, was well-written and relatable. She decides to make her senior project at school an effort to solve a 5 year old town murder and throws herself headlong into the investigation from an inside perspective as she personally knows or has connections to the key players. I admired her bravery as a character to go talk to strangers and hostile witnesses who don’t want the past stirred up. I loved that one of the victim’s in the story, Sal, had a brother who joined Pippa to solve the murder. I could have used a little more romance between those two as the flying sparks almost hit me in the eye a couple times! lol!Seriously, this was a fun and wild ride that I totally enjoyed and worth a read!",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shebuysit",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE52FKSFE6QKVSG7VSWOQATFZLSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KGDHTR6SB0RH?ASIN=1984896393",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars A Top 3 Favorite Book",
                "reviewText": "No spoilers!! One of the best books I’ve read in a while. I love watching murder mystery type of shows and decided why not try it out in a book. Such a great read. I loved solving the mystery along with the characters. And it never seemed over the top. I read it in 3 days!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Katie K",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4VCSXEYPOXLGGS64UOXA5PE5HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BXWNJ8KF2VBC?ASIN=1984896393",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Debut Novel",
                "reviewText": "This was a really great debut novel for the author! I enjoyed the read a lot and even though I can sometimes struggle to get into books with MCs this young, I didn’t have that problem at all. The plot was really interesting and there was a lot of intrigue!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Susan S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG5L4SSHFB2FIVBX7EEXY26OYASQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2JWB7F1WZXQQE?ASIN=1984896393",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars Kept me guessing",
                "reviewText": "I really enjoyed reading this fast-paced mystery. I made notes throughout every time I thought I figured out the whodunnit. I the d, I was partially correct and mostly wrong. Pippa gave us all the clues we needed, and then some, as she used her senior year capstone project to salve a five year old murder of a high school “perfect beauty “ and her boyfriend Sal's suicide, after he was revealed as the murderer. Or was he? We meet Sal's brother, Pippa's friends, teachers, and follow in her footsteps as Sal's brother helps Pippa in trying to solve what really happened that night so long ago. There’s danger and romance, fear and pride. It was a very good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Daliah ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQCWKIWTBHVJQRFAI6VLZDLNHEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/ROI7IYT10XM2U?ASIN=1984896393",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "3.0 out of 5 stars It’s good but not my fav no spoilers",
                "reviewText": "It’s a good book! It was hard to read at first bc the beginning is boring but when it picks up it’s good! The ending is crazy so there’s a good ending but it’s still a crazy book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KarenInVA",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR5AIEVXLAC2A7IHSYQP5RTOGZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N9GNBVYU09ON?ASIN=1984896393",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Everyone would enjoy this book",
                "reviewText": "This YA novel kept this 66 year old turning the pages. Anyone who was that bookish somewhat nerdy kid in high school will relate to the driven, intelligent, insatiably curious Pip. A great murder mystery with a complex plot that was difficult to work out. Pip is the modern teenage version of Miss Marple and I think this book is for everyone.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle Xu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 30, 2024",
                "reviewTitle": "4.75 stars!",
                "reviewText": "I love this series and the transcripts, articles, illustrations, and visuals in between the chapters",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Renata - autora de O Jardim de Chloe",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on June 26, 2023",
                "reviewTitle": "Great story!",
                "reviewText": "This is a great story, in which every character is well worked, and all the details matter to intertwine the big web of the crimes involved in it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mm",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on December 30, 2021",
                "reviewTitle": "Vale la pena",
                "reviewText": "El libro llego en muy buen estado y tiene linda presentación, si lo quieren usar para EMPEZAR a leer en inglés cómo muchos, no lo \"recomiendo\" ya que tiene un poco más amplio el vocabulario, pero en general la trama es buena y entretenida.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61qRaStg2OL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/51142nxC5xL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jem",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 16, 2024",
                "reviewTitle": "An easy to read thriller",
                "reviewText": "I loved this book - I went on to buy the rest of the books in this series. I’ve been trying to get back into reading and this book hooked me in from the start and I didn’t want to put it down!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Esteban",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 5, 2024",
                "reviewTitle": "Livre",
                "reviewText": "pour un cadeau, mon amie a adorée!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}