{
    "remaining_requests": 1332,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Whisper-Man-Novel-Alex-North/dp/1250318009",
    "body": {
        "name": "The Whisper Man: A Novel",
        "price": "$11.50$11.50",
        "originalPrice": "",
        "rawPrice": 11.5,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Whisper-Man-Novel-Alex-North/dp/1250318009",
        "soldBy": {
            "sellerID": "A5JZAI8QHYQN0",
            "name": "Vogman",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A5JZAI8QHYQN0&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41u jLsOKTL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/41xkorx1NlL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Alex North",
            "link": "https://www.amazon.com/Alex-North/e/B07KWDKSZQ/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Vogman",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 25741,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 40 mins",
            "FREE delivery Monday, February 26 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Celadon Books (June 9, 2020)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 400 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1250318009"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1250318008"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.35 x 1 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,894 in Books (See Top 100 in Books) #593 in Murder Thrillers #1,087 in Psychological Thrillers (Books) #2,227 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 25,741 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4f390f50-3ba7-4552-b438-518967314970.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jen B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFU3LUPHKXC4I2TW2ZSL6POI2HA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16WR5W3KWSSJA?ASIN=1250318009",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2021",
                "reviewTitle": "5.0 out of 5 stars I was Hooked!",
                "reviewText": "I thought it was suspenseful from the get-go and made me feel like I was playing the role of the abductor for a moment. My sub-conscience asking myself \"Why are you lurking around this innocent little kid, you creeper?!\" But at the same time I was hopeful that the situation wasn't as grave as it appeared; that the abductor was rescuing the boy from a worse fate. *naiveThe writing is done as though it were a screenplay, especially when it comes to transitioning from one chapter to the next. It keeps the pace of the reading going with a smooth and clever transition style; each chapter ending in an episodic way either not giving you enough of the answer you were looking for, forcing you to continue or ending in such a chilling manner that you have to continue to be able to go about your day! Ahhh... so basically it's a quick read!It starts out a little creepy, then gets scary, then terrifying!!!The father-son duo is so sweet and grows stronger throughout the read. Both Tom and Jake, being so much alike, assume that the other doesn't care for them as much as they'd hope. That the other is not giving them what they need nor communicating in a way that they can understand. Both eventually having to learn the hard way (the impossibly intense end-of-the-world hard way) that they really do love and truly feel the love from one another.I cannot fathom the hurt of losing a young child, especially in such a horrific manner and this book had me rethinking my plans of procreation all together. I also think that it would be extremely creepy to read this as a parent - - steer clear padres. It's about young boys being carefully selected then abducted by a strange man whispering to them in the night through their bedroom windows and luring them outside; hence the name The Whisper Man.I tend to do most of my reading at night and circumstances had it that I spent most of this book's reading solo. *Perfect timing, Universe! I love my scary stories but oh my God this one had me reeling. I literally caught myself hallucinating in the pitch black before I fell asleep at night and realized in the morning that I had tiny black book residue on my fingertips most likely from excessively gripping the cover so as to not be sucked in fully.Kudos to Alex North who managed to create a gripping, perfectly paced, twisted story with incredibly beautiful and complicated characters. The names Featherbank and Carter will forever haunt me and my heart will most likely sink to my gut the next time someone whispers my name... yeesh! Equally, I fear that I may never see butterflies in the same light hereafter. Not necessarily in a worse light (with the exception of corpse moths) but in a different light with a new depth and appreciation. The appreciation stemming from the complete metamorphosis of a caterpillar to a butterfly; a process similarly found in the slow but dramatic development of the main characters lives and personas. They all grow through the hurt and emerge from their cocoons as their true selves.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bob Lewis",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGTJIDNNGD7WE4DZPWMLIAE7PCWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R27G78N7IAH6QZ?ASIN=1250318009",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 9, 2020",
                "reviewTitle": "4.0 out of 5 stars One of the more effective thrillers I've read lately",
                "reviewText": "I honestly didn't know what I was in for when I picked up this book. I was unfamiliar with the novel and I've never read anything else by the author. The only reason I happened across it at all was that it was a book club selection. And what a selection it was! Though I was initially skeptical, I quickly found it to be one of the more effective (in this case, effective means creepy and suspenseful) thrillers I've read in recent years.Though I try to read a bit of everything, I'm usually more drawn to horror than to thrillers. Nothing against the latter genre; just the way things seem to go for me. The Whisper Man lives in the gray area between the two genres. One would more productively call it a thriller, yet it ends up actually being scarier than most horror novels. Admittedly, this isn't a \"sleep with the lights on\" kind of book, but it expertly captures perhaps one of the most fundamental fears common to all human beings.When I first started reading, I wasn't sure if I was going to like the book. It's prone to jumping from perspective to perspective a bit more than I ordinarily prefer and some of this shifts actually involve changing from third person to first person narration and back, which I found incredibly jarring. Furthermore, the novel seemed at times like it wanted to be too many things at once: a thriller, a supernatural horror novel, a family drama, a police procedural. The first 100 pages or so were a bit rocky as these disparate threads seemed to clash. It was interesting enough to keep reading, but I occasionally found myself wishing it would choose a track and stick with it.However, the final two-thirds or so managed to synthesize these disparate elements into a cohesive unit while simultaneously ramping up the tension in a way that made for a thriller that's as gripping as it is disturbing. Far from simply playing on the surface-level fears related to killers and child abductions, the novel manages to probe emotional depths in a study of the often-fraught father-son relationships that's both affecting and believable. Ultimately, this book is about fathers and sons, and the promises and disappointments inherent in those relationships, and that makes the \"horrifying\" aspects of the book all the more powerful.Ultimately, while I don't feel I can give it a five-star review because the opening chapters didn't quite live up to the quality of the rest of the book, I do highly recommend it. Odds are, once you get past the opening, you'll find yourself reading the rest of the book in a single sitting.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kimberly ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHHW42KF2G6VDHBKCZZUN36F5UQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RXCIVX9OG2R61?ASIN=1250318009",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "Really enjoyed this book fast paced couldn't put it down. Definitely would recommend reading to people who enjoy thriller and mysteries",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 26, 2023",
                "reviewTitle": "Fantastic read!",
                "reviewText": "A thriller with a bit of the « supernatural », but then it all makes sense in the end. It also examines the complex relationship between fathers and sons. Quite good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jussara Berlie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 26, 2022",
                "reviewTitle": "Excelente!",
                "reviewText": "Excelente livro.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 30, 2024",
                "reviewTitle": "Great book",
                "reviewText": "Once you start reading you won't be able to stop. So buckle up for one hell of a ride Buckos!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Disha GaikwadDisha Gaikwad",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 10, 2021",
                "reviewTitle": "The Author Is a Magician ❤️❤️",
                "reviewText": "“The butterflies didn’t have a choice, after all. That’s what things do. Even in the toughest of circumstances, they keep living.”― Alex North, The Whisper ManRatings: ❤❤❤❤.5/5Who doesn't like a nice spooky thriller that gives you a creepy vibe all along the read, and some chills while on the journey? I know I do!!!This book revolves around Tom Kennedy who wants a fresh start for himself and his son Jake to cope with his wife's sudden death. They move into a new house in a small English town called Featherbank. Little do they know that the town which looks like the nice place to be at is hiding its own dirty scary secrets.20 years ago, \"The Whisper Man\", had abducted and killed several young children. Now in present times, history is repeating itself, except- \"The Whisper Man\" was caught 20 yrs ago and is now serving his time in prison.The mystery starts to unravel when Jake starts acting strangely and claims he heard whispers at his window.There is no denying that this book reminds me of \"The Shining\" at certain instances, but it was an entertaining read. It was spooky just as much - I mean to think of a 7yo boy casually saying - \"The boy in the floor told me things!!!\" --- eeppp scary! (This is exactly what Alex Norths' son just casually said one day😅... I just idk what to say about that....Also, came across this on Goodreads!!)Even so, it is not a continuous horror show, it portrays the father-son bond across different generations and some super interesting police proceedings.The story is told via multiple POVs, again not usually a Multiple POV fan, yet I bloody loved it here!! The pace, the narrative collectively makes this a great one sit read! (Cause that's exactly what I did 🤷🏻‍♀️)I hope you guys read this and love it as much as I did...and be equally spooked...!!Happy Reading 💕!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/B1wKz8WqTpS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gaby Camargo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on November 19, 2019",
                "reviewTitle": "Lista para leer",
                "reviewText": "Me llego mucho antes de lo previsto y en perfectas condiciones",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}