{
    "remaining_requests": 1057,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Lost-Girls-gripping-thriller-Detective-ebook/dp/B01408LTV6",
    "body": {
        "name": "Lost Girls: A fast paced, gripping thriller novel (Detective Kim Stone Crime Thriller Series Book 3)",
        "price": "$4.99",
        "originalPrice": "",
        "rawPrice": 4.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Lost-Girls-gripping-thriller-Detective-ebook/dp/B01408LTV6",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91p+NVmEQOL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Angela Marsons",
            "link": "https://www.amazon.com/Angela-Marsons/e/B00J6D3914/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 27847,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B01408LTV6"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Bookouture (November 6, 2015)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 6, 2015"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2324 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 482 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#191,624 in Kindle Store (See Top 100 in Kindle Store) #1,101 in Serial Killers #2,697 in Serial Killer Thrillers #2,728 in Murder"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 27,847 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3B4ZF25T7BV35UNSG34ENWTDQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20MY9XRV8BTPT?ASIN=B01408LTV6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Where she goes",
                "reviewText": "Angela Marsons is a new author to me, and her stories are very well written. The places her stories go make me slightly concerned about her mental state.Scary thoughts if the scenarios happened in real life.You can't go wrong with her books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Denein Mcclain",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3IUGITZJ47FXA2P7LYF3CHNC2Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R29TGKB87AFZ1H?ASIN=B01408LTV6",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 16, 2023",
                "reviewTitle": "4.0 out of 5 stars I’m a fan!",
                "reviewText": "I thought that Book 3 was just as good as the previous two. Once again the story is intricate and clever and well written. The subject matter is gritty and dark. I guessed the twist, but that didn’t detract from the story. I do think it helps to read the series in order. They could be read as standalones, but Kim’s backstory is interesting and each book adds to her depth as a character.⭐️⭐️⭐️⭐️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna Miller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4H3B3H7Z6MHZVNHR4FY6ZKLUJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Q3YW2W8YNRY2?ASIN=B01408LTV6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 26, 2016",
                "reviewTitle": "5.0 out of 5 stars Kim Stone",
                "reviewText": "I've read all Angela Marsons' books This one was riveting from the first page and never let go. Well written with a thorough understanding of how parents would react to the kidnapping. Brave little girls who loved each other and all four were strong beyond their years. Love Kim Stone she has her issues though damaged she's managed to make a life for herself true it involves helping others rather than herself but she's making progress.The premise is two girls are kidnapped only one will be returned alive, parents and close friends being forced to bid against each other for the return safely. There are three people involved, one a sadistic killer who has been promised Charlie and Amy the nine year old victims, the \"brains\" behind the kidnapping who is in for the money and finally the third alpha who is a mystery until the end.This isn't the first kidnapping, a year ago instigator. a year ago Suzie and Emily were taken and held for ransom again only one would be returned but something happened and Emily is set free with Suzie presumed dead. There is also a sub plot involving a young man from the streets who was killed by gang members that killing too is solved which almost felt like an afterthought.Kim and her team along with specialized members of the Midlands Police struggle against almost hopeless odds in bringing both girls home safely.As they sift through what few clues they contact the parents of the first two kidnap victims opening wounds for both the mother whose child was nv never returned and the surviving girl who's life is forever changed. I\"m usually pretty good at seeing the \"bad\" guys but this one threw me.All and all a very satisfying and thrilling read that leaves one satisfied and panting for her next one.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "The Review",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHP57KREBVY3HB6R53Y3GCYTTDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UYEZZWHK51UL?ASIN=B01408LTV6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2017",
                "reviewTitle": "5.0 out of 5 stars Angela Marson is just an awesome Author. I hope she keeps writing about Kim Stone.",
                "reviewText": "Angela Marson, after reading two of her Kim Stone series has become my favorite author. She has created such a wonderful team of crime fighters. But her creation of Kim Stone is amazing. She has made such a real person. A person who has come through many pains and experiences to create who she is. There is such history in who she is. And you love knowing it because you get to know Kim Stone at the core. In all her books. I reccomend that you read them in order.This book had such an interesting twist to it. I thought it was amazing. I knew who the killer was early on by a guess because I thought it would be so neat if it was this person. I thought the author must of had the same thought and then created the book that way But it was just a guess. I am sure it will be a surprise because it was not easy and there were no giveaways..The story is about a two families who are close because their children are close. A group kidnap the two girls and the kidnappers demand that the families outbid each other to save one child and the other child is to die. This same crime was done a couple of years previously and the perpertraitors were not caught. So they need to find out whether these are in fact the same people.One of the mothers demand that Kim Stone lead the case. So that is the setting. It was a very exciting book. You will love. It. I am glad to have it in my collection This is a book I am sure to read again after some time passes. It was that enjoyable.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "UncleEdwin2105",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEWNXDPM5SOGDNLDBD3NFBQJDULQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YXAU1GNMPJWM?ASIN=B01408LTV6",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 20, 2016",
                "reviewTitle": "5.0 out of 5 stars Child Kidnapping With a Twist",
                "reviewText": "A crime thriller about a case of double child kidnapping that presents a different dynamic of a police investigation. The author weaves numerous scenarios into the investigation dynamic that both the reader and Kim's team are required to wade through as they try and solve the crime and bring the children home. Ms. Marsons does a very good job of taking the reader on a journey through a crime investigation filled with complications (as seen through Kim's eyes), team dynamics (two new members) and crime solution intrigue (why a double kidnapping? ).The third book in the DI Kim Stone series starts with the kidnapping of two young girls, childhood friends Charlie Timmons and Amy Hanson. With the exception of the above, I prefer to let Ms. Marsons take the reader on a journey through the scenarios. Ms. Marsons exposes more of Kim's childhood history, adds two new members to Kim's team dynamic and adds a twist to what starts out as a conventional child kidnapping (if child kidnapping can be termed conventional). The journey is fast paced, intriguing, emotional (good and bad) and builds to a conclusion that allows the reader to use their imagination (Kim with a social life??).At the end of the book \"Evil Games\", the reader is left to wonder about the personal security of Kim's emotional building blocks. Compared to \"Evil Games\", this book does little to satisfy the readers appetite for more of \"Who is Kim?\". What this book does do is present a unique child kidnapping scenario and adds to Kim's team dynamic. The readers' imagination is tweaked and we are left with \"What is next?\" and asking for more. A really good read, highly recommended and I eagerly await the next installment.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2024",
                "reviewTitle": "Excellent",
                "reviewText": "Superb book. Really gripping and the characters are totally believable. Highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaye",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 8, 2023",
                "reviewTitle": "Excellent Crime Series",
                "reviewText": "This was the third in the series of very good crime books. I am now addicted and have all the rest waiting to be read. Clever plots, interesting characters, just good all round.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on September 17, 2017",
                "reviewTitle": "Narrativa um pouco arrastada, mas Kim arrasa!",
                "reviewText": "Esse livro é diferente dos dois anteriores porque o crime que a detetive Kim Stone tem de solucionar envolve pessoas vivas. Duas meninas foram sequestradas e a policial corre contra o tempo para encontrá-las. Os sequestradores fazem uma espécie de leilão com as famílias, quem pagar a maior soma, terá a filha de volta. Particularmente, não gosto muito desse tipo de história, mas virei fã da personagem e pretendo ler a série toda. No entanto, eu me surpreendi com a história. Não conseguia largar o livro e, de modo geral, achei a narrativa bem amarrada. A única coisa de que não gostei muito foi a justificativa do mandante dos crimes, tem de ser muito criativo (ou muito louco) para torturar os pais das meninas por um motivo tão fútil (ou egoísta). O livro é longo e a história poderia ser encurtada, há momentos que a narrativa se torna arrastada, porém a escolha por capítulos curtos ajuda a leitura a fluir melhor. Mesmo com essas ressalvas, adorei o livro!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RebeccaN",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on June 27, 2017",
                "reviewTitle": "Great",
                "reviewText": "Very good story that sucks you right into it right away and till the end. Definitely worth reading for crime lovers",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 30, 2016",
                "reviewTitle": "A growing character",
                "reviewText": "This is the third book that I just finished reading some moments ago. It's the first of Kim Stone's book in English. I read the first two books of Kim Stone's series in Italian. The character building is this series is fascinating. Kim Stone is able to bring me into a roller coaster experience where fear, suspicion, logic, frustration, joy and dedication exist. I have downloaded the fourth series. So eager to start the next one. Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}