{
    "remaining_requests": 1295,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Just-the-Nicest-Couple/dp/B0B39QVGRM",
    "body": {
        "name": "Just the Nicest Couple",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Just-the-Nicest-Couple/dp/B0B39QVGRM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51el1QppOcL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mary Kubica",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Mary+Kubica"
        },
        "brand": "Mary Kubica",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 9468,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A NEW YORK TIMES BESTSELLER“Grabs you on the first page and doesn’t let go until you reach the end.”—Laura Dave, New York Times bestselling author of The Last Thing He Told MeA husband’s disappearance links two couples in this twisty thriller from the New York Times bestselling author of Local Woman Missing, Mary Kubica Jake Hayes is missing. This much is certain. At first, his wife, Nina, thinks he is blowing off steam at a friend’s house after their heated fight the night before. But then a day goes by. Two days. Five. And Jake is still nowhere to be found.Lily Scott, Nina’s friend and coworker, thinks she may have been the last to see Jake before he went missing. After Lily confesses everything to her husband, Christian, the two decide that nobody can find out what happened leading up to Jake’s disappearance, especially not Nina. But Nina is out there looking for her husband, and she won’t stop until the truth is discovered.\"Rich with detail and a mounting, almost suffocating sense of dread, Just the Nicest Couple is a dark and twisted exploration of loyalty, family, and how far we’ll go to protect the ones we love.\"—Andrea Bartz, New York Times bestselling author of We Were Never HereDon't miss Mary Kubica's chilling upcoming novel, She's Not Sorry, where an ICU nurse accidentally uncovers a patient's frightening past...Look for these other edge-of-your-seat thrillers by New York Times bestselling author Mary Kubica:The Good GirlPretty BabyDon’t You CryEvery Last LieWhen the Lights Go OutThe Other Mrs.Local Woman MissingShe's Not Sorry Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 32 minutes"
            },
            {
                "name": "Author",
                "value": "Mary Kubica"
            },
            {
                "name": "Narrator",
                "value": "Brittany Pressley, Gary Tiedemann"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 10, 2023"
            },
            {
                "name": "Publisher",
                "value": "Harlequin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0B39QVGRM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#613 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #10 in Domestic Thrillers (Audible Books & Originals) #34 in Psychological Thrillers (Audible Books & Originals) #57 in Domestic Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Susan M. Baumann",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFFF4RLO2XJJ4YKGEIJPESXE5I2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RR4W0ZXNIWYZ7?ASIN=B0B39QVGRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars A Jolt of Adrenaline",
                "reviewText": "Kubica certainly knows how to create nail-biting suspense and unrelenting dread. The story starts with a jolt of adrenaline. Lily confesses to her husband, Christian, that something terrible has happened. She was attacked in the park. Fearing for her life, she struck the man repeatedly with a large rock and was able to flee. In her panic, she drives home, instead of going to the police. Worse still, her attacker was their friend and respected neurosurgeon, Jake, husband to Nina, Lily’s colleague.Meanwhile, Jake hasn’t come home. Nina’s worried because they’d had a particularly heated fight the night before and both said things that she wished they hadn’t. She figures that Jake just needs time to calm down. Days pass with no word. Nina thinks that maybe Jake has finally left her. They’ve been going through a rough patch in their relationship lately. Nina’s been caring for her ailing mother, and Jake feels neglected. When the hospital calls however, Nina’s alarm skyrockets because Jake loves his job and would never do anything to jeopardize it.So where is he? Jake’s disappearance baffles Nina and terrifies Lily and Christian. Lily last saw him angry and bloodied at the forest preserve where he physically assaulted her, but she didn’t notify the authorities. Is Jake still out there now, full of vengeance and wrath or is it something much worse? A series of increasingly bad decisions follow, inexorably linking Jake, Lily, Christian and Nina in a twisted maze of deception and terror. Lily recoils at the thought of what might be true, and Nina pushes forward, intent on finding her husband.Kubica has crafted an intricate and riveting tale. The constant momentum is impressive. I felt Lily and Christian’s palpable anxiety every time there was a knock at the door. I cringed when Christian’s behavior became even more reckless and impulsive, but understood his desire to protect his pregnant wife from the dangerous web she was entangled in.This was a great book that I genuinely enjoyed.It’s a propulsive read that’s pensive, too, and that is no small feat. While turning pages in a flurry, I found myself contemplating as well. The idea that one decision or traumatic event can set off a cacophony of life-altering choices is sobering. Each character thought they knew themselves and each other, but were shocked and surprised when unforeseen circumstances tested their resolve. Highly recommend the book. The ending is masterfully done.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELDOHGB6GWLK4CKWCYELISQT2HQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FFGQVBVAGXK6?ASIN=B0B39QVGRM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "4.0 out of 5 stars slow moving thriller",
                "reviewText": "The beginning took me a while to get through and it felt very slow building, but the ending was very surprising and I was glued to it to figure out every mystery!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Marie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJR5DKN73A4GZQA6IL6K757GM7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14MKP96DB1UL5?ASIN=B0B39QVGRM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 17, 2023",
                "reviewTitle": "3.0 out of 5 stars Hmmm.. well",
                "reviewText": "This was... okay? I've never read Mary Kubica before, and this was chosen as our book club selection for the month. I went in completely blind. I read no reviews, only a brief synopsis of what it was about. It sounded okay, like something I would read occasionally. I do enjoy a good psychological thriller from time to time.We have 2 main couples in the one. Lily and Christian, and Nina and Jake. It's told through Nina and Christian. I went between audio and my Kindle on this one, and the audio was okay. I actually did enjoy the back-and-forth perspectives of each side of the story. Nina's husband Jake went missing after a fight one night. She doesn't think too much of it until his work calls and says he hasn't been to work. Since he's a neurosurgeon, he doesn't miss work. Period.On the opposite side of that Lily is acting strangely at home. Christian finally pries it out of her, and she explains she ran into Jake while out walking. And something bad happened.A lot of blah blah blah back and forth throughout the entire book and a few storylines that could have been completely left out. I felt like it could have been shorter. The twists we mostly all predictable until the very last one, but it honestly didn't come as too much of a shock.Not sure if I'll give this author another shot or not, but we will see.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO5KTOLLGRTW3YKL66QE4SECUKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OBPBWK3T9QUT?ASIN=B0B39QVGRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Great Book",
                "reviewText": "Enjoyed the plot of the story. Glad I ordered this book. Very satisfied with this purchase.Would like to mention that before the holidays I made a purchase that was very disappointing. 2 packages of breadsticks arrived in crumbs. Made a complaint but did not get a response.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFH4LFSP35QE7MZC3TSDG7L5N6DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DPBRCRYVT3X1?ASIN=B0B39QVGRM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "4.0 out of 5 stars It Kept My Attention",
                "reviewText": "The first few pages of a book are critical for me to continue reading. This one kept my attention and I couldn’t wait to pick it back up as soon as possible to find out what happened in the end.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sergio",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE3EGXXCCBY2W5KB6SWGSJXWKPRQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OOCFGOHCSFCC?ASIN=B0B39QVGRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Gripping!",
                "reviewText": "I thought I had it figured out by the middle of the book but I was not even close. I can not express how much I enjoyed this book. I devoured it in 2 days!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Arieal.A",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKULAGJUN5DUL37BZK6ZRVOGY4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18FG0O2EV8S0E?ASIN=B0B39QVGRM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 19, 2023",
                "reviewTitle": "4.0 out of 5 stars Great read!",
                "reviewText": "Really enjoyed this book. The way she wrote the different perspectives was very engaging and she tied in a very interesting twist at the end. Definitely recommend it.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley S.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESROU5WI2T3ZQEN5JKZKONN7UUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2734SJFYEYT6T?ASIN=B0B39QVGRM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 24, 2023",
                "reviewTitle": "3.0 out of 5 stars Very meh story I struggled to finish",
                "reviewText": "I got this book after several positive reviews of book reading accounts I follow and normally like the books they recommend. I've read previous Maria Kubica books that I've liked (but not one I've loved yet). This one was very meh. The storyline was pretty ridiculous and not in a mind-blowing kind of way. One of the main characters did so many stupid things that I wanted to jump into the pages and punch him. And again, not in an exciting and fun way. Just like \"why did you write it like this?\"Save your time and money and get a different book. I definitely don't recommend this one. Gave 3/5 because I did finish it and it was easy to read.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Garden Girl",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 22, 2024",
                "reviewTitle": "Kept my attention throughout!",
                "reviewText": "For me to read this book for 6 hrs. non-stop until 4 a.m. ..this MUST be given the 5 GOLD STAR treatment! So many WOW moments...easy to follow along with the main character's POV. Great chapter length.. Mouth drops aplenty! Love this author! So many books sort off 'dwindle down and lose steam' in the middle....THIS book does none of that..",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Creevy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 27, 2023",
                "reviewTitle": "Good thriller",
                "reviewText": "This is a fast paced story that keeps you guessing til the end. I really became engrossed in the world of Nina and Lucy and thought the characters were really well written. I was disappointed with the conclusion, I thought it was a bit rushed, but overall a really good read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "GG Padmashree",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 26, 2023",
                "reviewTitle": "Worth buying",
                "reviewText": "Very well written. Engrossing till the end. Read it in one sitting.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ana Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on April 1, 2023",
                "reviewTitle": "Livro interessante",
                "reviewText": "ESTE livro vale a pena ler, pois não podia parar de ler para saber o final.Recomendo 5*",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M Sochi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 1, 2024",
                "reviewTitle": "This is sooo addictive!!!!!!",
                "reviewText": "This is the first book I’ve read from this author. And I really enjoyed this book!!!! It kept me up all night!! I loved this!! I can’t wait to read more books by Mary Kubica",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}