{
    "remaining_requests": 1230,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/No-Exit-TV-Tie-Novel/dp/0063254476",
    "body": {
        "name": "No Exit [TV Tie-in]: A Novel",
        "price": "$10.99$10.99$4.19$4.19",
        "originalPrice": "$18.99",
        "rawPrice": 10.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/No-Exit-TV-Tie-Novel/dp/0063254476",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71cQFlcRZKL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Taylor Adams",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_book_1?ie=UTF8&field-author=Taylor+Adams&text=Taylor+Adams&sort=relevancerank&search-alias=books"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by Goodwill Minnesota.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 28845,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review “The carefully layered drawing-room psychology of Agatha Christie cross-pollinated with the pure squishy terror of Stephen King . . . . [Taylor Adams] nails his setup and builds some truly distinctive characters.” — Entertainment Weekly“There’s a cinematic propulsion to No Exit that commands the reader’s attention, and Mr. Adams times his shocks with a sure hand.” — Wall Street Journal“What a box of tricks! This full-throttle thriller, dark and driving, rivals Agatha Christie for sheer ingenuity and James Patterson for flat-out speed. Swift, sharp, and relentless.” — A. J. Finn, #1 New York Times bestselling author of The Woman in the Window“No Exit is everything I want in a thriller: ingeniously crafted, unapologetically relentless, and shamelessly suspenseful. The twists go off like a series of expertly planted detonations and the tension never lets up. I was blown away. No Exit is a damn good time.” — Joe Hill, #1 New York Times bestselling author of The Fireman“No Exit opens with an ingenious, chilling setup and then delivers a wicked ride of psychological tension. Taylor Adams is a master of suspense. I’m already impatient to see what he does next.” — Michael Koryta, New York Times bestselling author of How It Happened“[A]n intense, brutal, no-holds-barred thriller dripping with adrenaline; a heart-pounding story of courage and sacrifice featuring a heroine unlike any you’ve ever seen. Don’t start unless you’re prepared to read straight through, because I guarantee you will not be able to stop turning the pages.” — Karen Dionne, author of the international bestseller The Marsh King’s Daughter“[A]n enthralling tale that features a wonderfully relatable and gutsy heroine. Give it to readers looking for a female-led drama in the mode of The Girl with the Dragon Tattoo and its sibling works.” — Booklist“[A] nail-biting thriller. . . . The action drives to a climactic and emotionally charged ending.” — Publishers Weekly“This well-written, fast-paced thriller . . . has enough twists to ensure an enjoyable read for even the most seasoned suspense fans.” — Library Journal“If you love a good twist ending, you’ll love this psychological thriller that’s snapping up comparisons to suspense masters from Agatha Christie and Stephen King.” — Parade“This gripping thriller with a young, witty female protagonist will keep even the most experienced readers guessing until the end.” — Shelf Awareness“One of the year’s most unforgettable reads. . . . Adams does for highway rest stops what Stephen King did for shuttered resort hotels, psychotic nurses and clowns under bridges.” — Bookreporter.com“This nail-biting thriller will have you guessing at each twist of thesurprising and complicated plot as its smart and gutsy protagonist fights to outwit a psychopath, rescue a girl, and make it home alive.” — Mystery Scene“A tight and rapid fire novel . . . Sit up and read from midnight till dawn. You won’t miss the sleep.” — Florida Times-Union About the Author Taylor Adams is the author of several acclaimed thrillers including Hairpin Bridge and No Exit. No Exit has been published in 32 languages and was recently released as a Hulu Original film. Adams lives in Washington State."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 15 hrs 29 mins",
            "$3.99 delivery February 29 - March 1.",
            "Or fastest delivery February 23 - 28."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Soon to be a Hulu original film: a fast-paced, edge-of-your-seat thriller about a determined young woman who struggles to save a kidnapped child while trapped in a blizzard—and who must unmask and outwit a deviously twisted psychopath before it’s too late.A kidnapped little girl locked in a stranger’s van. No help for miles. What would you do?On her way to Utah to see her dying mother, college student Darby Thorne gets caught in a fierce blizzard in the mountains of Colorado. With the roads impassable, she’s forced to wait out the storm at a remote highway rest stop. Inside are some vending machines, a coffee maker, and four complete strangers.Desperate to find a signal to call home, Darby goes back out into the storm . . . and makes a horrifying discovery. In the back of the van parked next to her car, a little girl is locked in an animal crate.Who is the child? Why has she been taken? And how can Darby save her?There is no cell phone reception, no telephone, and no way out. One of her fellow travelers is a kidnapper. But which one?Trapped in an increasingly dangerous situation, with a child’s life and her own on the line, Darby must find a way to break the girl out of the van and escape.But who can she trust?With exquisitely controlled pacing, Taylor Adams diabolically ratchets up the tension with every page. Full of terrifying twists and hairpin turns, No Exit will have you on the edge of your seat and leave you breathless. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ William Morrow Paperbacks; Media tie-in edition (February 22, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0063254476"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0063254473"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 0.79 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#8,177 in Books (See Top 100 in Books) #362 in Murder Thrillers #799 in Psychological Thrillers (Books) #1,461 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 28,845 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Last Word No Exit Hairpin Bridge",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/6a8bef44-594a-48b3-87e2-fa174fd0e0b1.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a79bafec-a287-4da8-a77a-20479ce6a280.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/972e1998-5166-46aa-adc4-aae7d46054d7.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/12481750-e869-4b0a-9ed0-434c6b2dfe1c.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3WMKDLPF6SIM5STQPYMHKCKZVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PC624MRFKS6N?ASIN=0063254476",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Great suspense novel",
                "reviewText": "Book condition: The book arrived new as ordered. There were no miss prints or damage to the book.Book review: This is the second book I’ve read by Taylor Adams and I am just as impressed as I was the first time around. This is one of those that I literally had to put down and take a break from because there was so much suspense and anticipation that I couldn’t handle it! Just when you think things are about to be settled, you notice that the number of pages you still have left in the book and know it can’t possibly be over quite yet. One thing Adams knows how to do is have you sitting on the edge of your seat waiting to see what the hell could possibly happen next. I did see two of the big reveals coming, but when it came to the actual action side of it I was never quite sure what to expect. Some of the more violent or slightly gruesome scenes were a little hard to get through because it was so easy to imagine it happening to you, but they weren’t so bloody and gory that you wanted to throw up. I did like that the author gave multiple point of views also because it made it easier to connect with the story and understand just how sick and twisted the villain was. There was quite a bit of sadness to this book as well on top of the action. I honestly couldn’t even imagine what I would do if I was Darby and trying to process what was happening at the rest stop and what was happening in her personal life all at the same time. I will say I was getting a little too angry and hype in some of the final chapters, but I was pleased by the end of it. If you enjoyed his book The Last Word, then I have no doubt you’ll enjoy this. Or if you are someone looking for a book full of action and suspense that’ll have you hooked, I would highly recommend this novel. ⭐️⭐️⭐️⭐️⭐️",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Emmy B",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHWHPU5C266QFKSRSBI23UHHZNTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2UX3GFTN38K1G?ASIN=0063254476",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2023",
                "reviewTitle": "4.0 out of 5 stars 4 1/2 stars! What a ride! An action packed thriller that was done so good!",
                "reviewText": "This was actually my second attempt with this book, I tried the audio version and lasted only a few chapters as I couldn’t get into it. I’ve read so many great reviews of this book (and the plot intrigued me) so I gave it a second go with reading it. I’m so pleased that I gave it a second chance! I love how descriptive the characters and snowy scenes were in this. This played out like a movie in my mind and with the twists …I was on the edge of my seat! The action kept going and I was so invested in the main character- I was rooting for her hard. Great book to read for cold weather season, It was so delightfully thrillingly Wintery. I highly recommend this book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nk22",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA2LAG6XWW7CAXGESZ4ZCNK2UBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3H5UDMWNIM8EF?ASIN=0063254476",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars WOW",
                "reviewText": "Just wow! I first heard about this book while listening to a podcast and I thought it sounded interesting. Months later I randomly remembered it and decided to give it a read since it's a kindle unlimited book and boy am I glad I did!! This book was chalk full of plot twists, action, and suspense! I love how the people were layered with depth making them feel more real than just characters on a page. And the main character Darby is certainly one to root for! As soon as I finished the book (which I read in one day, it was that good!) I decided to give the movie a try since they have it on Hulu. The movie could not even compare to how amazingly the book captured everything! Hours later and I'm still thinking about it truly. I even ordered a paperback of the book for my bookshelf in case I want to reread it again in the future (which I will for sure). Definitely read this book!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Merry Marquand",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGM2MX2ADFM3QM5LMHZMGQ2ZGUSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU4MG40OHJWHR?ASIN=0063254476",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "3.0 out of 5 stars violent",
                "reviewText": "Thought there was too much violence and very predictable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antonio Jacobs",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGGFWTGMOUXDFBUOQXFTNWMKXBNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RPDDGOZ997DX7?ASIN=0063254476",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Solid",
                "reviewText": "This is the first word that comes to mind and the best word to describe this book “SOLID”A Great straight forward thriller is what it was meant to be and Taylor done it with excellence. No real twists but then again it is so well written you didn’t note. You are so well entertained it’s forgiven.The last 30% was especially fast and riveting.plays out like a movie. I highly recommend to read this book in one or two sittings if possible to the the maximum thrills.Thank you Mr. Adams for the ride",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Barbara",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFHQTPVOR2KD42IMBC5TQISBMOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10GUEOX3UMF4R?ASIN=0063254476",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Excellent thriller",
                "reviewText": "Caution--violence This is very exciting. If you have time, you'll want to read it in one sitting. I just took off one star for the violence .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Haley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH67OBJSEQRUU4YESWAMS3SPXGNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3FUKFTHUPYEPI?ASIN=0063254476",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars What a ride…",
                "reviewText": "I thought I wouldn’t like this…only because I don’t prefer when books aren’t written in first person - not anymore anyway. Such a good read. Darby was a badass and brave in ways I hope I’ll never have to be. The book filled me with so much anxiety and left me feeling satisfied and fulfilled.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MrsSpj",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFK4ALWFAYIVFXDTE5L7ONLAJFDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3HQEE5YMC2ETO?ASIN=0063254476",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Page Turner, Couldn't put it down!",
                "reviewText": "This book hooked me from the beginning! Yes this is a show you can watch on TV, but the book is by far better! I love that we get to see Darby transform and take charge (Don't want to give anything away) This book has so much suspense in it, you will not want to put it down. There are some parts that will make you squirm but trust me, you will want to keep reading. Incredible plot, amazing characters, and an all around great book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doreen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 28, 2024",
                "reviewTitle": "Wow!",
                "reviewText": "Ummmm ....bought this book yesterday & finished it today. It was a great thriller that I found hard to put down. There were so many twists and turns with a miraculous ending. You have to love a great ending ❤️",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on July 18, 2023",
                "reviewTitle": "Varios Poot twists",
                "reviewText": "Muy buen libro, te mantiene pegado de principio a fin, tiene varios Plot twists a lo largo de la trama.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anavana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 14, 2024",
                "reviewTitle": "Prenant",
                "reviewText": "J’ai beaucoup aimé l’histoire :) si vous aimez les retournements de situation ce livre vous plaira",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alina",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 25, 2022",
                "reviewTitle": "Good",
                "reviewText": "Good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 14, 2021",
                "reviewTitle": "Must read. Great book",
                "reviewText": "Best book EVER.You are in for a thrilling read.I could not put this book down. I would read it again and again. They should make it a movie it's so good.Love it. Its suspenseful, tons of plot twists and a satisfying ending.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}