{
    "remaining_requests": 1232,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/House-Pines-Novel-Ana-Reyes-ebook/dp/B09X51M1NK",
    "body": {
        "name": "The House in the Pines: Reese's Book Club (A Novel)",
        "price": "$12.99",
        "originalPrice": "",
        "rawPrice": 12.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/House-Pines-Novel-Ana-Reyes-ebook/dp/B09X51M1NK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91ANpTfXOqL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ana Reyes",
            "link": "https://www.amazon.com/Ana-Reyes/e/B0BNL9N6RJ/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.6 out of 5 stars",
        "customerReviewCount": 16423,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "An instant New York Times bestseller!“This is an absolute, can’t-put-it-down thriller. . . . It’s truly a wild ride that had me flying through chapter after chapter—which I think is the perfect way to kick off your year of reading.”—Reese Witherspoon (Reese’s Book Club Pick January 2023)Armed with only hazy memories, a woman who long ago witnessed her friend’s sudden, mysterious death, and has since spent her life trying to forget, sets out to track down answers. What she uncovers, deep in the woods, is hardly to be believed. . . .Maya was a high school senior when her best friend, Aubrey, dropped dead in front of the enigmatic man named Frank whom they’d been spending time with all summer. Seven years later, Maya lives in Boston with a loving boyfriend and is kicking the secret addiction that has allowed her to cope with what happened years ago, the gaps in her memories, and the lost time that she can’t account for. But her past comes rushing back when she comes across a recent YouTube video in which a young woman suddenly keels over and dies in a diner while sitting across from none other than Frank. Plunged into the trauma that has defined her life, Maya heads to her Berkshires hometown to relive that fateful summer—the influence Frank once had on her and the obsessive jealousy that nearly destroyed her friendship with Aubrey. At her mother’s house, she excavates fragments of her past and notices hidden messages in her deceased Guatemalan father’s book that didn’t stand out to her earlier. To save herself, she must understand a story written before she was born, but time keeps running out, and soon, all roads are leading back to Frank’s cabin. . . . Utterly unique and captivating, The House in the Pines keeps you guessing about whether we can ever fully confront the past and return home.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09X51M1NK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Dutton (January 3, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 3, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3514 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 330 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ B0BSSCTXC8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#4,175 in Kindle Store (See Top 100 in Kindle Store) #30 in Women's Psychological Fiction #160 in Women's Mystery, Thriller & Suspense Fiction #230 in Psychological Thrillers (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "3.6 3.6 out of 5 stars 16,423 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Stacia Levy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGVBKVRXS5G4FTHGUPXOIMN6U4VA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2PKUMERY5Z86K?ASIN=B09X51M1NK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "4.0 out of 5 stars Magical and Mysterious",
                "reviewText": "In this mystery, protagonist Maya pursues answers to the question of what happened to her best friend, Aubrey, back in their senior year in high school. Maya is now a grown woman, living with Dan, her law school student boyfriend, but the question of Aubrey’s death has haunted Maya for seven years. The inability to process Aubrey’s death has propelled Maya into therapy and use and misuse of various medications. And Maya even really knows what happened to Aubrey: she dropped dead one summer day while talking to Maya’s boyfriend at the time, Frank Bellamy. Maya is convinced Frank somehow caused the death, despite a police investigation that determines he did not. Aubrey simply suffered “sudden death,” an event in which a person expires from an unknown cause. Nevertheless, Maya has never let go of the conviction, and fear, that it was Frank. Her suspicion causes her to lead her life “off the radar” to not attract Frank’s attention. People in Maya’s life have dismissed her fear as paranoia. However, her convictions are validated when Maya views on social media a video that has gone viral. In the video, Frank Bellamy is sitting with a woman who collapses and dies in much the same way as Aubrey did. Maya is propelled on a quest to find out, once and for all, what really happened to Aubrey and Cristina, the woman in the video, and what Frank’s power is. The book is well-written, with sufficient suspense to keep the reader turning pages to figure out, along with Maya, the fates of Aubrey and Cristina. The author freely plays with time, moving back and forth between the past and present. Dreams and symbols are incorporated into the narrative as well. This gives the story a somewhat mystical quality, like the magical realism that Maya’s late father Jairo wrote. In the end, Maya is able to unravel the mystery of Aubrey and Cristina’s deaths, at least to a degree.The narrative at times needs better transitions as it moves between past and present—but the jarring effect due to their lack may be deliberate, demonstrating the number of consequences the past can have on the present. In addition, although some questions about Aubrey and Cristina’s deaths, along with Frank’s involvement, are clarified, the explanation still seems incomplete and unclear. But that, too, may be a deliberate authorial choice. A lot of life is incomplete and unclear—like the nightmares that haunt Maya.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angie Price",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQGKKTIQ6NYS5FJ46W3LNH3W4CQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1WABE4QBR7MJE?ASIN=B09X51M1NK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 5, 2023",
                "reviewTitle": "3.0 out of 5 stars The House in the Pines",
                "reviewText": "Spoilers!A girl with a drug addiction turned alcohol dependent refocuses on a trauma (her best friend dying) that happened when she was 17 after seeing a video of a girl dying. She then goes on a journey to confront the man she believes is responsible for the deaths of both women.While I didn’t guess the manner of which the guy was killing the women, there were a couple things that would’ve made this a more enjoyable read.The story jumps from past and present with no notification of which time period you’re reading. You are left to guess based on what is happening in the story (the girl’s relationship with the accused man; her best friend still alive; talking about leaving for college; etc). It would’ve been helpful for the chapters to be labeled as such.Secondly, she is in a long term relationship and no one, including her live in boyfriend, knows she’s addicted to pills. She is able to secure pills for a long time, go to work, and no one is none the wiser.There were just a lot of loose ends or things added that weren’t ever cleared up or didn’t need to be there. At one point her long term boyfriend won’t return her calls but it seen by her on social media with another woman. It’s never addressed and really doesn’t add anything to the plot. There’s things like this throughout the story.It was a slow read for me and then felt rushed at the end with a lot of details left out.",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Captain Mitch",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOZ44HPWQAIUN4JRBM52F6XGAUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1STYH9Y06LYQB?ASIN=B09X51M1NK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Great fun, well told!",
                "reviewText": "Excellent, I we should enjoy much more from t ihis author! Not easy to put down once started and well worth the read. Plot just deep enough to keep you going. Tells a story, not just a pile of scenes.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L.M. Hosler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEGBGHHTIJ7CNJQBHL6452HGZE3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2IG1FPY95TNU8?ASIN=B09X51M1NK",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "2.0 out of 5 stars Weird",
                "reviewText": "I did not care for this book. It sounded really good but it sort of drug on without any real answers about the killing of the two girls. But then I am not into science fiction and maybe that was what the book was intended to be. Just disappointed in the book and it was for my book club.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ashley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGK43E7FVX2GBKCE4VLJSO3FQ7ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EJXOLCXWXCTK?ASIN=B09X51M1NK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Surprising",
                "reviewText": "The book really drew me in and made me want resolution for the main character. I would have liked a more detailed ending and I thought some of the characters could have been developed more fully but it is worth a read. It was a unique story line and I enjoyed it.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grace Vincent",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6KA65D3N26OWMC7ACYHZ3AGLKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AEIRR1KVF27U?ASIN=B09X51M1NK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "3.0 out of 5 stars Good read, but timeline jumps are not very smooth",
                "reviewText": "It is an interesting read. The story is wonderful and the connection of the different pieces keeps you engaged. I will note that I did not like jumping around timelines so frequently and suddenly. I wish there were a way to indicate a timeline jump better because at times I would be several paragraphs into a chapter before realizing I was in a different time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jessica",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3OKAFNMAN4IPMFX7CBABEDLOVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R7GSMCB8U148T?ASIN=B09X51M1NK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Interesting read",
                "reviewText": "The details were impeccable. The story line was great. Enough of a thrill, without being scary. It was a great read.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J. R. SOUTH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFX4HO7FS5DNL4RC4CROWLLAWTOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R112RXWZO8BH2L?ASIN=B09X51M1NK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Riveting Mystery Thrller With No Ending",
                "reviewText": "\"The House in the Pines\" is Ana Reyes first novel and I hope there will be a whole lot more to follow. She is one of those remarkable writers who views the story from the inside-out rather than observing it from the outside-in. This is a visceral reading experience & each character is distinctly created with their own thoughts & their own clear voice. That is a gift & it is immersive. It's exactly what I look for in a reading experience, and it's unfortunately very rare in books today. And now for the story, which is an inventive, winding pathway that consistently morphs in and out of a dreamlike weirdness. There are times when I thought it could be just a very real and bad dream. The plot is discomfortingly believable, and that is all I will say about that. There are times when the tension becomes so heightened, you are afraid to keep reading but you can't stop. Unfortunately, the ending just felt like it evaporated. What should have been a climactic humdinger was too easy a wrap-up. B+.",
                "reviewVotes": "12 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gurleen Kaur",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 11, 2023",
                "reviewTitle": "Chills",
                "reviewText": "This book was for my book club. It was different from the books I normally read but totally worth it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonymous ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on June 7, 2023",
                "reviewTitle": "Basic and predictable",
                "reviewText": "I held hope during the whole book that I would be surprised and a unseen twist was coming, however I was unfortunately disappointed. The protagonist is hard to connect with and I felt overall it left a lot to be desired...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rebecca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 24, 2023",
                "reviewTitle": "A little on the weird side...",
                "reviewText": "A little on the weird side...Overall, I'm struggling to know exactly how I feel about this book. I found the whole concept of the book to be a little weird and I just don't know what to make of it. The ending was a bit of a let-down and did not wow me in the way that I had hoped or expected from a psychological thriller.The book from quite early on develops an almost dreamlike or supernatural feel and we meet Maya, who is clearly struggling with a drug addiction and its subsequent withdrawal. For a long time Maya has been struggling to process and come to terms with the death of her best friend, Aubrey, in their last year of school. Aubrey suddenly drops dead in front of Maya and Frank with no apparent cause or explanation.Frank is a bit of an enigma throughout, a strange character with very little background. He is someone that Maya has been spending a lot of time with over the summer and is who Maya believes has something to do with the death of her best friend. When Maya views a YouTube video years later of Frank in a diner with another girl, who also appears just to drop dead, Maya is more convinced than not that he is involved somehow and begins her search for answers.The story overall felt a little bit dry and lacked an element of shock and surprise. A feeling of suspense also felt like it was missing throughout the book. There were many moments where the author could have upped the tension and caused the reader to feel breathless in anticipation of what was going to happen. Following on from this, I felt the conclusion and reasons to be a little on the implausible side and slightly unfathomable.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anonimo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 4, 2023",
                "reviewTitle": "Easy read",
                "reviewText": "Easy read, interesting comcept, the plot loses direction and interest in the middle.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dikshita Damodaran",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in India on January 19, 2023",
                "reviewTitle": "Meh 🫤",
                "reviewText": "Read this book as a part of Reese’s book club and it just didn’t work for me. It is a perfect example of how a book can start on such a high note and turn so disappointing by the end.So many gaps in the plot line, such an abrupt ending, unanswered questions.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}