{
    "remaining_requests": 1033,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Horrorstor-Novel-Grady-Hendrix/dp/1594745269",
    "body": {
        "name": "Horrorstor: A Novel",
        "price": "$13.19$13.19",
        "originalPrice": "",
        "rawPrice": 13.19,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Horrorstor-Novel-Grady-Hendrix/dp/1594745269",
        "soldBy": {
            "sellerID": "A29G165BTNNM2Z",
            "name": "Jenson Books Inc",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A29G165BTNNM2Z&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/5137wm8f76L.jpg",
        "images": [
            "https://m.media-amazon.com/images/I/312ZHfKwsQL._SX35_SY46.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Grady Hendrix",
            "link": "https://www.amazon.com/Grady-Hendrix/e/B005806RT0/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Jenson Books Inc",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 8257,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 8 mins",
            "FREE delivery February 28 - March 1 on orders shipped by Amazon over $35",
            "Or fastest delivery February 26 - 28"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 1594745269"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Quirk Books; Illustrated edition (September 23, 2014)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 240 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9781594745263"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1594745263"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.09 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 7.36 x 0.6 x 8.73 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#18,126 in Books (See Top 100 in Books) #47 in Ghost Thrillers #1,387 in Paranormal & Urban Fantasy (Books) #2,763 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 8,257 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/532be762-85bd-4fd6-bd36-93e4e2198418.__CR0,0,4042,1250_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/710dbd50-2d49-4985-8a50-a2701d419913.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/91271694-c7fc-4c1b-8176-f39f929c1cd4.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b21933a3-2e54-42bd-9803-c754796b9503.__CR0,0,220,220_PT0_SX220_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/b0fad607-8ec2-4fb6-8687-71b15a398a38.__CR0,0,220,220_PT0_SX220_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "ChristineChristine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFZI4BMXJGMAF66JRHRYXLPUO2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3DF9AKJWEVG85?ASIN=1594745269",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 14, 2020",
                "reviewTitle": "5.0 out of 5 stars As imaginative as it is immersive, and as dark as it is funny!",
                "reviewText": "Wow. Just wow.I feel like I can’t say it enough, but I thoroughly enjoyed Horrorstör and highly recommend it. I think the audiences that would get the most of this book would obviously be fans of horror and darker comedy, but also those who have had to work in the soul-sucking world of mainstream retail.I still shudder when I think about my experiences working in retail. Ugh.The world that Hendrix builds in this novel accurately depicts the real-life hell that working in retail usually is. From the absolutely atrocious customers to the sense that loyalty means taking one for the team (only for the good of the company), to the disconnect between corporate ideals and the reality of the sales floor…you’ll have disturbing flashbacks of your worst retail employee experiences. I especially liked how each of the characters felt real and entirely plausible, and could easily compare each one to a past or present coworker of my own.However, what I enjoyed most about this book was its design - which was not only insanely smart but works really well to create an immersive reading experience rather than just be exist as an attractive piece of cover art. Upon first glance, I mistook this book for an actual furniture catalog! Taking a closer look, I began to notice dark oddities - clawing hands, trapped faces, rats, ominous scratches, etc. The design continues within the cover pages, further resembling a furniture catalog with a detailed store map, index, ads, and even an Orsk order form! You can literally map out the characters’ journeys through the Orsk showroom and the Beehive as you read the story.My favorite design element can be found at the beginning of every chapter. Each chapter starts with what appears to be your standard furniture ad for a variety of Swedish themed furniture pieces. Upon closer inspection, the captions reveal the darker nature of each featured piece. As the story continues, the ads become increasingly dark as they’re reinvented into torture devices that foreshadow the fates of the characters. See a spoiler-free example below:“Boasting several advantages over traditional forms of restraint, BODAVEST confines the penitent and opposes the agitated movement of blood toward the brain, forcing the subject into a state of total immobility, conducive to self-reflection and free of stressful outside stimuli.”Yeah, not quite what you’ll find in your average Ikea catalog.Even though this was a quick and fun read, it was as creepy as it was entertaining. Not only did the story progress at an appropriate pace, but the building tension and gross imagery had me truly immersed in the Orsk showroom. In fact, this was the first book I’ve ever read that physically disturbed me (refer to the Hügga and Bodavest chapters for some skin-crawling horror scenes). I had to frequently put this book down to take breaks after some of the more gory scenes.Lesson learned: don’t mix shrink wrap with an office chair…Overall, I loved this fun horror read because of how imaginative, witty, and captivating it was. Rumor has it, a film adaptation may be in the works!",
                "reviewVotes": "25 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/91HECVHAN8L.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Scott Slemmons",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFNNA6PWC526R4M5PMM72PZCPX2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X0OGBDU7F5NJ?ASIN=1594745269",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 25, 2017",
                "reviewTitle": "4.0 out of 5 stars Shopping for Terror",
                "reviewText": "I love a classic haunted house as much as anyone. There’s something wonderful about an old abandoned house (or mansion or castle or hotel or insane asylum), dilapidated, decaying, overgrown, crumbling, filled with creaking doors, dark shadows, creepy dolls, and something sinister that whispers from the attic.But there’s also a place in my heart for a modern, clean, brightly-lit building that’s nevertheless crawling with the unquiet spirits of the dead. The suburban home built over an Indian graveyard, the supermarket with bloody handprints appearing mysteriously on the freezer cases, the trendy nightclub plagued by unusual deaths and fashionable vampires. Horror writers love this stuff, too — you can find horror wrapped around modern suburban and retail settings in films like “Poltergeist” and “Dawn of the Dead” (and many other early-outbreak zombie movies) and in books and stories like Stephen King’s “The Mist,” Anne Rivers Siddons’ “The House Next Door,” and Mark Z. Danielewski’s “House of Leaves.”And there’s also this book, “Horrorstör,” a short horror novel (with strong humor elements) written by Grady Hendrix. Its focus is on a haunting at an IKEA-style big box retail store.The lead character in the story is Amy, a slacker in a thoroughly dead-end job working retail at ORSK, a furniture and housewares store designed from the ground up to look and feel like an IKEA store. It has the same winding pathway through the store, the same “Magic Tool” required to put every piece of furniture together, the same style of faux-Scandinavian names for all the products. Amy wants to transfer back to the ORSK store she used to work at, mainly because she thinks she’s about to get fired by Basil, an assistant manager and gung-ho ORSK fanboy. But as it turns out, Basil actually wants to ask Amy and another co-worker, Ruth Anne, an older long-term employee who lives for her job, loves stuffed animals, and is adored by everyone on the staff, to take on a special duty — patrolling the store at night.You see, the store has been suffering unusual vandalism. Some of the glassware has been broken, furniture has been soiled, and there are odd smells in the building. Basil wants Amy and Ruth Anne to join him on a secret late-night patrol, after everyone has gone home, to see if anyone is breaking into the building. They soon find some interesting problems. There are rats in the kitchen showcases, even though there’s no food there and no water hookups. Everyone keeps getting lost, which might make sense if they were just customers and not employees trained to find their way around the store quickly. And the mysterious grafitti messages in the restrooms referring ominously to “the Beehive” are multiplying rapidly.And they do find some unexpected interlopers. Matt and Trinity are a couple of fellow co-workers at ORSK who have sneaked into the store because they thinks there are ghosts in the building and want to make a reality-TV ghost hunter show. And there’s also a homeless man, Carl, who has been secretly living in the store for a few weeks.Trinity has an idea. She still thinks there are ghosts in the building, and what’s the best way to contact ghosts? Let’s everyone hold a seance!And then everything goes straight to hell.Can Amy and her coworkers survive the night shift at ORSK? Can they escape the store? Or are they doomed to toil forever in the stone walls and iron restraints of the Beehive?I really enjoyed this book. I burned my way through it as quickly as I could, and a couple nights, where I made the mistake of reading it too close to bedtime, it actually kept me up late. I did think that the very best parts of the novel were fairly early on, when the scares were subtle and more creepy than heart-stopping. The seasoned employees getting lost in their own store? That was weirdly realistic — you could imagine it happening, but you could also see why it would be really unnerving. The odd sounds after the store closes, combined with the sudden unfamiliarity of the environment of the store was also spooky — and definitely familiar for anyone who’s ever had to work late in their office, where darkness and emptiness make the comfortable surroundings feel strange and dangerous.Even better than that was the graffiti in the restroom. The dozens of scrawled names and scratched-out years, all referencing the mysterious Beehive, feel intensely eerie, a perfect element to place in a modern retail ghost story. There are also some very effective moments when the employees discover that the purely decorative doors in the showcases now open into dank, cavernous hallways leading deep into the earth.And the seance may have been a monumentally stupid move on the part of the characters, but the way they did it was an original and wonderful thing to have in a horror novel. It’s simultaneously terrifying — because you know what’s going to happen — and hilarious — because you know what’s going to happen.Once the Big Bad makes his appearance, and especially when he captures Amy for the first time, the story starts moving away from being a ghost story and edging more into torture porn. The story shows some serious cracks in this section, in part because it’s too long — I just don’t enjoy reading multiple pages about someone being strapped into a torture chair that tightens to the point where she loses sensation in her limbs and can barely draw a breath. (This may also indicate that I have never enjoyed torture porn.) But it’s also a bit too short — we’re told that Amy’s mind breaks almost entirely not long after she’s strapped in, to the point where Stockholm Syndrome sets in and she starts worshiping her captor. And then, when she’s released from confinement, it’s not too many more pages before her mind has completely recovered to its previously healthy state — and even improved, as she’s much braver and more resourceful for the rest of the novel.One of the real selling points of this novel is the fantastic graphic design by Andie Reid and illustrations by Michael Rogalski. The book cover looks like one of the big, glossy IKEA design catalogs — with a few subtle and not-so-subtle differences to give some visual cues to the horrors within — and each chapter opens with a page from the fictional ORSK catalog spotlighting one of their products, complete with IKEA-style art, a faux-Scandinavian name, and upbeat flavor text. But after the supernatural terrors start climbing out of the woodwork after the seance, all the featured furniture gets replaced with medieval torture devices. It makes the story a lot more fun and a lot funnier, while still giving a nice dose of the chills to readers.",
                "reviewVotes": "97 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Karla Pugh",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 21, 2022",
                "reviewTitle": "A good read",
                "reviewText": "This book is awesome!! I couldn't put it down. I read the first 11 chapters in one night and that's a lot for me to read!!! I wish there would be a Horrorstor 2!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thiago Sardenberg",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on July 12, 2022",
                "reviewTitle": "\"Havia uma prisão aqui... e construímos uma nova sobre suas ruínas\"",
                "reviewText": "Inicialmente, Horrorstor parece uma mistura da divertida série \"Superstore\" com uma narrativa sobre lugares mal-assombrados. Não deixa de ser, de certa forma, mas é bem mais que isso; o tom mais leve da narrativa vai progressivamente sendo \"contaminado\" pela escuridão que habita o lugar e os horrores que descreve - sempre envoltos em trevas - são realmente perturbadores.Mais além, o romance ganha força ao comparar essa loja - a Orsk, uma espécie de Ikea, ou Etna, Leroy Merlin etc. - à prisão panóptica que havia naquele mesmo lugar, séculos antes: o trabalho repetitivo, sempre sob supervisão, análogo à escravidão, apagando individualidades, sobre diferentes pretextos - no caso da prisão, os \"penitentes\" precisavam ser curados de seus pecados; no caso da loja, os funcionários se submetiam à máquina capitalista pois precisavam sobreviver. E mal conseguiam, como no caso da protagonista (que curiosamente (?) se chama Amy, mesmo nome da protagonista de Superstore), sempre individada.Esse foi meu terceiro livro do Hendrix (gostei dos 3) e cada vez mais creio que ele - que por alguma razão ainda não é tão reconhecido (talvez após um de seus romances ser inevitavelmente adaptado, isso mude) - é um dos grandes nomes da literatura de terror contemporânea.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "nohemi",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on January 31, 2024",
                "reviewTitle": "Te atrapa desde el primer momento",
                "reviewText": "Simplemente espectacular. Una historia muy bien creada y muy original.La edición es una pasada,parece un catálogo en vez de un libro.100% recomendable.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "T. Wilson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 3, 2024",
                "reviewTitle": "A great Haunted house book with a twist!",
                "reviewText": "I couldn’t put this book down once I’d started. Grady Hendrix has a way of drawing you in and feeling like you can’t escape the books clutches just like the plot! Highly recommended!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eshwanth K.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 9, 2022",
                "reviewTitle": "Nice!",
                "reviewText": "This book is a serious page turner, got me out of my reading slump. The story moves fast and it’s interesting.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}