{
    "remaining_requests": 1083,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dark-Man-Graveyard-Classified-Paranormal-ebook/dp/B077C9DSMG",
    "body": {
        "name": "The Dark Man: A Paranormal Thriller Novel (The Graveyard: Classified Paranormal Thriller Series Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dark-Man-Graveyard-Classified-Paranormal-ebook/dp/B077C9DSMG",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/816EcxndwSL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Desmond Doane",
            "link": "https://www.amazon.com/Desmond-Doane/e/B0108U4YTO/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 1998,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B077C9DSMG"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ JCL Publishing Paranormal Thriller Novels (November 10, 2017)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 10, 2017"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1268 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 265 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,522 Free in Kindle Store (See Top 100 in Kindle Store) #4 in U.S. Horror Fiction #19 in Ghost Suspense #25 in Horror Suspense"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 1,998 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer  R Wes M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHEA7HXVSWHFRHSURBGWL7QSD5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R31KAOR0B424WU?ASIN=B077C9DSMG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 20, 2015",
                "reviewTitle": "5.0 out of 5 stars Darkman, Great ghost story and wonderful insights into ghost hunters. Desmond Doane aka Ernie Lindsey strikes a hit.",
                "reviewText": "Darkman by Desmond Doane! I was immediately taken in by the story. I watch just about all the ghost hunting and paranormal shows out there and I could swear Desmond Doane was more than a pen name for an author but rather for someone who actually worked on one of those shows as I marveled at his expertise at the back of the scene dynamics of these shows. I'm still not sure he doesn't. If not he has great insight, research skills or just like me after viewing so many a keen imagination on the dynamics of these shows behind the scenes. What Desmond does definitely have is a way of scaring the reader senseless at times, while inserting self deprecating humor into his characters, which is much needed given the tenseness. In Darkman, Ford Atticus Ford is a paranormal investigator who can seek out demons. Once the star of one of the most popular paranormal shows on television, \"Graveyard: Classified\", Ford's star burned out like a meteor after he makes a decision to let a four year old girl, Chelsea Hopper confront her own demon on live t.v. with disastrous results. Now still albeit financially fixed, he is chasing his own demons. To ease his guilt, he still feels the need to help people working through law enforcement agencies stumped in various murder cases and the bizarre who call on his psychic skills. This time he's in Virginia helping Detective Thomas deal with a years old case involving a Dave Craghorn whose wife was murdered. Craghorn is now haunted by possibly his wife's ghost and worst of all, brutalized constantly by a right-hander. What Ford calls a powerful demon. In over his head this time he takes a chance to make amends by calling in the co-star of his show, Mike Long. Surprised by Mike's agreeing, after the Hopper debacle, this pair starts off like oil and water. But it soon becomes apparent Mike who has pretty much retired is anxious to get back into ghost and demon hunting as well, especially if it helps people. They see Dave Craghorn to safety and after a very shaky start realize they have to put their differences aside if they are going to fight whatever is assaulting him, Detective Thomas and now them. Striking them with a vengeance! This is a very stressful twenty four hours. Trying to figure out what it is that makes this house an icebox during 80 degree weather. An entity taunting them verbally and more terrifying, physically. Desmond Doane knows how to expertly pace this story interposing Ford talking to the reader his thoughts, quips, reminisces about his old show. Ford also regales us with his constant regrets not only about how they handled the Chelsea Hopper case but his relationships or lack of. Mike is also candid in confronting Ford about the same. But Mike is also full of self doubt and missing his wife even for this short stint. We really learn a lot about these men, their ill fated show, their feelings as an odd couple once friends. Now, well, there are no enemies in foxholes, I'll say. Nice insight and very welcome respites from the true horror in the house and the mystery of a murder unsolved. Ford and Mike are flawed characters as we both see and they readily admit. Despite these flaws they sift through so many twists and turns to this story. Desmond Doane does what could be dangerous for authors, he leaves some loose ends. After finishing this book I saw that he already had a second series in the Ghost Classified stories. I had that bought right then and there. Those loose ends garnered him another book sale from this now fan. And I can't wait to start reading it. Ever here of Black Eyed Children? I've read a few stories on this urban legend. Well, that awaits. But for now that's irrelevant. Darkman awaits you, now!! Enjoy as I did.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKJO2KLTCOIOCK2MMIGBJMPTZDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2429PLIUW6AXJ?ASIN=B077C9DSMG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "4.0 out of 5 stars Enjoyable",
                "reviewText": "The author has done a good job of taking on the persona and actions of a ghost researcher. The inclusion of the backstory helps with the present portion of the storyline. The characters are believable and have depth.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Floyd Brigdon",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7ZNF5OTHV2LLNQWDSBHZ4XL3DQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1DB67VHK1D233?ASIN=B077C9DSMG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 16, 2016",
                "reviewTitle": "5.0 out of 5 stars A real surprise!!",
                "reviewText": "This novel is an example of exactly why I LOVE Kindle Unlimited. I saw an ad for this book and was interested enough in its premise to go check it out on Amazon. When I saw it offered there as part of Amazon's Unlimited program, that sealed the deal. I downloaded it immediately and started reading.And, boy, am I glad I did!Though I did not know it at the time, Desmond Doane is the pen name of writer Ernie Lindsey who normally writes mystery and suspense novels.The Dark Man focuses on Ford Atticus Ford and Mike Long, two men who used to have a ghost-hunting TV series but lost everything when they were airing a live episode in which a little girl, Chelsea, was attacked by a demon. The novel starts several years later when Ford, now a disgraced celebrity who is estranged from just about everyone who knew him in his heyday, is now working with various police departments to help them on those \"special\" cases and winds up taking a case that leads him to believe that he may in fact, not be done with Chelsea quite yet.There is so much to recommend this novel that I don't quite know where to start.Interesting characters? Yes, very developed, very believable and complex.Interesting story? You bet. Doan/Lindsey lays in the backstory of what happened to Chelsea seamlessly, never letting it get in the way of telling the story that is happening in the \"now\", something which authors often have trouble accomplishing.OK, but how about the pacing and the suspense? No need to worry about that. There are moments in this novel that will have you on the edge of your seat. Descriptions are well written and the action is very cinematic (when it most needs to be).The narrative aspects of this work really made me happy that I had \"discovered\" it, enough so that the day I finished it, I bought the sequel (and went and paid for this as well, so that I did not have to return it).One of the other things that really made me happy about this novel is that is clear that the author is very familiar with how paranormal investigations happen in the \"real world\". Now I know that a lot of people disbelieve in the paranormal but those who DO believe and investigate it have certain methods, procedures, and theories/beliefs and you can see those clearly reflected here. Now, admittedly there are lots of places where these elements are made to be more dramatic than realistic (I mean, he DOES have to tell an engaging story and who wants pages and pages of the protagonist sitting around a silent room?) but it is refreshing to find this story reflecting genuine methodology and beliefs.I think that many different kinds of people would enjoy reading this novel: people who are interested in the paranormal people who love suspense or horror novels, and even just people who enjoy a finely crafted novel. ALL of these people and more would enjoy Desmand Doane's The Dark Man and would be glad they picked it up.I know that I am......",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "WildAboutBones",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXLLBFLOYC5EGY6XFHI5SFZA5SQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LYLW85RC7E0A?ASIN=B077C9DSMG",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 10, 2017",
                "reviewTitle": "3.0 out of 5 stars Paranormal investigators get more than they bargained for",
                "reviewText": "There are parts of the story that keep your eyes glued to the page but...The way this story bounces back and forth between the recent past (a past investigation) and the present is rather irritating, especially when the past is just plopped in the story line at seemingly random places. The jolting back and forth takes the reader out of the story as does all the talking to the reader.The first person present tense (ack!) doesn't help.This could have been such a great story if placed in the appropriate sequence so the suspense and story are allowed to unfold, and of course third person would make it rock.The smattering of humor is at times used well but at others, not so much.Overall, while there is a lot of room for improvement, this isn't bad.I will be interested to see how book two comes out and may check out this author's other works under his other pen name.I received this book from the Kindle Scout program.",
                "reviewVotes": "15 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "susan sparey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 10, 2023",
                "reviewTitle": "Dark man",
                "reviewText": "A gripping read for paranormal fans,with a who done it twist and an unexpected out come looking forward to reading the next in the series.🤔",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vijay",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 17, 2021",
                "reviewTitle": "OK",
                "reviewText": "OK",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 11, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Chilling and interesting...kept me hooked.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Antoinette piercy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 18, 2020",
                "reviewTitle": "The dark man",
                "reviewText": "Enjoyed this investigative ghost book and will be downloading the sequels and reading with enthusiasm will look into what the next books are like",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter McLoughlin",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 17, 2016",
                "reviewTitle": "Four Stars",
                "reviewText": "Great book !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}