{
    "remaining_requests": 1099,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Under-Siege-Jake-Grafton-Novel-ebook/dp/B0048EKJMS",
    "body": {
        "name": "Under Siege: A Jake Grafton Novel (Jake Grafton Series)",
        "price": "$8.99",
        "originalPrice": "",
        "rawPrice": 8.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Under-Siege-Jake-Grafton-Novel-ebook/dp/B0048EKJMS",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71UqmkwcH2L._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephen Coonts",
            "link": "https://www.amazon.com/Stephen-Coonts/e/B000AP701W/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1717,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A fighter pilot races to stop a terrorist plot in Washington, DC, in this thriller by a New York Times–bestselling author hailed as “brilliant” by Tom Clancy.When the psychotic Colombian drug lord Chano Aldana is extradited to the United States for trial, he brings his army of vicious mercenaries with him. And as Aldana’s hit men target the President of the United States, the capital is plunged into chaos that only veteran fighter pilot Jake Grafton can stop. With the help of an investigative journalist and an undercover agent, Grafton must find the deadly assassins before they can strike again. But time is running out, and the future of the country hangs in the balance. This ebook features an illustrated biography of Stephen Coonts, including rare photos from the author’s personal collection.",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0048EKJMS"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Open Road Media Mystery & Thriller (November 30, 2010)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 30, 2010"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5382 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 548 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#84,049 in Kindle Store (See Top 100 in Kindle Store) #116 in Add Audiobook for $3.99 or Less #361 in Terrorism Thrillers (Kindle Store) #487 in Terrorism Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,717 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Mr D.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPQREI2ZDAOOHPDQJ77ASEUIDYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BHIYMRQBIWHX?ASIN=B0048EKJMS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 17, 2005",
                "reviewTitle": "5.0 out of 5 stars Narco-terrorists - Islama-terrorists, What's the Difference?",
                "reviewText": "First, the President's helicopter is shot down by two missiles on the way back from Camp David, killing four including the Secretary of State and putting President George H.W. Bush into a coma. Next eight or ten heavily armed terrorists break into the Capitol Building killing or wounding everything in sight in one bold suicide attempt, until they are finally suppressed. Then, acting President Dan Quayle, after viewing the damage at the Capitol Building, while giving a short press conference on the Capitol steps is apparently shot at. He isn't hit but the Attorney General is. But this was just a prelude. Things get so bad that the National Guard and Army is called in and then the riots start.It seemed to start when, in an effort to show that we were winning the War on Drugs, the United States extradited Columbian drug kingpin, Chano Aldana, for trial. Aldana, probably insane but a truly scary and evil individual man gave an interview to two Washington Post reporters saying in essence that he was Satan incarnate and that the streets of Washington were going to be awash in blood if he wasn't released.So begins a story of violence and terror in the streets of Washington that was written fifteen years ago but seems right at home in this age of terrorism and terrorist threats.I never read a book by Stephen Coonts where Navy Captain (in this book) Jake Grafton wasn't in and this is no exception. He, along with his sidekick Toad Tarkington is currently attached to a terrorism unit of the Pentagon, working directly for the Joint Chief of Staff. He and FBI agent Tom Hooper wind up trying to track down Henry Charon, a rancher/hunter/poacher/hunting guide/hit man from New Mexico. The main plot is interesting enough but Coonts adds some subplots involving Post reporter Jack Yocke, Aldana's lawyer Thanis Liarakos, attorney/fixer/lobbyist T. Jefferson Body, smarmy senator Cherry and last but not least, my favorite, undercover agent Harrison Ronald Ford, who was trying to get the goods on Washington's number one drug dealer Freeman McNally.If the main story was engrossing, Coonts' method of weaving these sub-plots made a good book great. Each sub-plot was separate but they all had a thread that tied them together. The story involving Ford was most compelling and almost took away from the main story.The AuthorI don't read many of Coonts' books even though he's an excellent writer because his subject matter is usually militarily oriented a genre I do not gravitate to but this book was the exception. Although the military is involved, it deals more with law enforcement and government..Coonts is really a talented writer. His writing is fluid and compelling. It's easy to follow and in the case of this book kept me turning them pages. His character development is just right, making you feel things with the characters but not going overboard. Of course repeat character Jake Grafton is Mr goody two shoes, almost too perfect with no vices and the perfect family but that's the way Coonts chooses to portray him. You could compare him to Clancy's Jack Ryan.Other characters in this book however are another matter. We have unethical to sociopath to truly evil behavior. Our assassin looks at his work as a game - the only thing worth living for. The drug dealers as you might expect are brutal. And of course there are frailties such as the irony of Aldana's attorney, Liarakos' position comes out, defending the number one drug dealer in the world while his wife is a crack addict.ConclusionWhen I first read this book, some ten years before September 11th I found it to be a well written, very interesting story containing three or four interesting subplots but there was no way I thought something this horrible could be perpetrated on the American people. Well things have changed and as I read this for the second time, I kept feeling similarities to the atrocities that were being committed in the book and what's going on in Baghdad and throughout Iraq. It's eerie.It seems to me that if we ever capture the likes of Osama bin Laden or Abu Musab al Zarqawi we certainly don't want to bring them to the United States. Better a bullet hole to their head and an unmarked grave.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "usmc-mike",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOIIMLDCPK47UXVJNGDSG256DDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VPRAV6VM62XQ?ASIN=B0048EKJMS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 3, 2018",
                "reviewTitle": "4.0 out of 5 stars An Older Jake Grafton",
                "reviewText": "An exciting book that ended up being read in one sitting (it's 1:00 AM). The usual adventure and twists and turns, however Jake Grafton doesn't really become the focus of the story until after the first 20% of the story has gone by.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "James Vickrey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFQZLJC2MGPUV7B5K36VE3MOREVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3N2PZ7QEM92ZN?ASIN=B0048EKJMS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 2, 2023",
                "reviewTitle": "5.0 out of 5 stars Great book.",
                "reviewText": "A good read! Keeps you entertained throughout. Fun to connect with other characters in other novels by the same author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Starcore",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEKEK5FRXAVWWFHAOCFWCVS6INPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1SOVXZFY5DIPQ?ASIN=B0048EKJMS",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "3.0 out of 5 stars Disappointing",
                "reviewText": "Although sold as Grafton series number 5, Grafton has little serious role for the first 60% of it. Most of the book instead concerns a journalist and an undercover agent.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "james grady white",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AENXDW35CO4PZ5Y5IIRBY3ODGMPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R152RRHNOZOX46?ASIN=B0048EKJMS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 7, 2022",
                "reviewTitle": "5.0 out of 5 stars A true thriller",
                "reviewText": "I have read several of Coonts books and this one is the best one yet. He writes in such a way that it is difficult to put the book down. I recommend this book if you like thrillers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Fred B. Retter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEHAGCERKPQXALBU2SJ5RIW4OAKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK7DRRY8F3G1E?ASIN=B0048EKJMS",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2014",
                "reviewTitle": "4.0 out of 5 stars Politics,Murder & Meyhem",
                "reviewText": "This is a typical Coonts thriller as far as plot,action,political entrique go. I wasn't pleased with the violence dealt the Good Guys in the climax, but that said, enjoyed the story very much. I have read all Coonts' follow-on novels and must say he is a master in the thriller diller type of novel. Wish he would resume writing them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. GLASGOW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF7FDSU3WODHR4EGB6BD5NE5Z2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D1VIH2F71QBW?ASIN=B0048EKJMS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 23, 2022",
                "reviewTitle": "5.0 out of 5 stars Story was a great read and you feel like you are there with the characters",
                "reviewText": "Another great read with larger than life characters and plenty of nonstop action. Hopefully this story never becomes real. Thanks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teamjj",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAUMXUTX35XUYU7LBCXPXSWF5ZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R28Q4MSDKKU9ER?ASIN=B0048EKJMS",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2014",
                "reviewTitle": "5.0 out of 5 stars Oldie but a Goodie",
                "reviewText": "I bought this because I didn't recall if I'd read it or not. Its set in DC in a time before 911. Drug wars in the nation's capital. Lots of inner city bad guys and a few good cops and newspaper guys. And Jake and Toad of course. Good story but a bit dated now. After reading it, I still can't recall if I've already done so but seems like I did but it was over 15 years ago when I did. Hard to believe Jake Grafton and Stephen Coonts have been writing that long! Anyway, I highly recommend this as the good guys come out on top of course.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 10, 2022",
                "reviewTitle": "Thriller",
                "reviewText": "Jake Grafton who wouldn’t want to read - Stephen Coonts fantastic .",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C F",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 8, 2017",
                "reviewTitle": "Five Stars",
                "reviewText": "Excellent, I am a big fan of Stephen Coonts.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dr. Gary W Reid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on May 3, 2015",
                "reviewTitle": "Under Siege, a good read.",
                "reviewText": "Very, very enjoyable as always. Good plot and well developed characterizations -really, can we the reader ask for anything else, an easy chair (anything will do for a Jake Grafton Novel), a good drink, soft music, and away we go into Cootsland!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donald",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 18, 2013",
                "reviewTitle": "An enjoyable read",
                "reviewText": "I first read this book years ago, and found the paperback recently, this prompted me to buy the Kindle version, this is the first book I have read in the series, or by the author and enjoyed it so much I am planning to purchase his other books soon.The story was enjoyable and the main characters were well developed, some of the secondary characters did feel a bit flat, but it never distracted from the book.Having not read the rest I was not able to follow some of the small plot points, but again it was secondary info and points so it never distracted from the novel.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Anthony J. Cokes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 17, 2014",
                "reviewTitle": "As a 'fan' of Stephen Coonts I would recommend all his books to anyone looking for a good ...",
                "reviewText": "As a 'fan' of Stephen Coonts I would recommend all his books to anyone looking for a good read. I have all his books in hard back and am now re-reading on Kindle. Start from the first book is best",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}