{
    "remaining_requests": 1180,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Robert-Ludlums-The-Treadstone-Resurrection/dp/B07QTCQRKM",
    "body": {
        "name": "Robert Ludlum's The Treadstone Resurrection",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Robert-Ludlums-The-Treadstone-Resurrection/dp/B07QTCQRKM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41coXhg10BL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Joshua Hood",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Joshua+Hood"
        },
        "brand": "Joshua Hood",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 5415,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The first novel in an explosive new series inspired by Robert Ludlum's Bourne universe, The Treadstone Resurrection introduces an unforgettable hero and the shadowy world that forged him....Treadstone made Jason Bourne an unstoppable force, but he's not the only one.Operation Treadstone has nearly ruined Adam Hayes. The top-secret CIA Black Ops program trained him to be an all but invincible assassin, but it also cost him his family and any chance at a normal life. Which is why he was determined to get out. Working as a carpenter in rural Washington state, Adam thinks he has left Treadstone in the past, until he receives a mysterious email from a former colleague, and soon after is attacked by an unknown hit team at his job site. Adam must regain the skills that Treadstone taught him - lightning reflexes and a cold conscience - in order to discover who the would-be killers are and why they have come after him now. Are his pursuers enemies from a long-ago mission? Rival intelligence agents? Or, perhaps, forces inside Treadstone? His search will unearth secrets in the highest levels of government and pull him back into the shadowy world he worked so hard to forget. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            },
            {
                "name": "Spies & Politics",
                "link": "https://www.amazon.com/Spy-Stories-Tales-Intrigue-Books/b?ie=UTF8&node=10493"
            },
            {
                "name": "Political",
                "link": "https://www.amazon.com/Political-Thrillers/b?ie=UTF8&node=7538395011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 40 minutes"
            },
            {
                "name": "Author",
                "value": "Joshua Hood"
            },
            {
                "name": "Narrator",
                "value": "Ron Butler"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 25, 2020"
            },
            {
                "name": "Publisher",
                "value": "Penguin Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B07QTCQRKM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#13,047 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #122 in Political Thrillers (Audible Books & Originals) #167 in Espionage Thrillers (Audible Books & Originals) #303 in Espionage Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "claudette valliere",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKCJXG2UQWWIRS6VYEJF2OOFCFQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2X1MQS5B3PQI1?ASIN=B07QTCQRKM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 3, 2020",
                "reviewTitle": "5.0 out of 5 stars All it needed was Jason Bourne",
                "reviewText": "One damned fine read. Hood doesn't disappoint. Spoiler alert.This one starts Nick Ford. He's in Venezuela on a mission. His whole team had been wiped out and he's being hunted and he knows it. Nick is half Native American and a member of Treadstone. He's one very capable guy. He has the goods on a man and needs to get that info to someone he knows will do something with it. That someone was also a member of Treadstone. That someone had walked away from Treadstone and never looked back. That man is Adam Hayes. He and Ford were in Special Forces together and were plucked out by the CIA and sent to Treadstone.Ford makes it to the hotel and gets a room. Ford manages to send his info out. He also sends a message. \"By the time you get this. I'll be dead.He sets his last claymore and cameras to let him know when the enemy gets there. He knows they are coming and come they do. Fords life ends with a bullet to the head in the bathtub. His claymore does take out two of the enemy though. A fact the enemy commander, Felix Black, a mercenary, is not happy with. He also doesn't know if Ford got the info out or not. The man he works for knows Ford worked for Treadstone and he also knows who Ford sent the info to. He sends killers that way.Adam Hayes is in La Conner, Washington. He's working on a house. Once he's done the remodeled house will be his nest egg to get his wife Annabelle and son Jack back.Right now he's at home and gets a call from his realtor Sally Colvin. She tells him that there is someone interested in the house and he's flying in today. Hayes had tickets to Florida in his luggage. He was headed out to see Annabelle and Jack but decides getting the house sold so he can get the money is more important right now. He heads out to the house.The house is built on an island that has a bridge connecting it to the main land. The huge manor house that dominates the island is called Cliffside Manor. The owner had the island ready for the rich. The only reason he was allowed among the rich was because he had bought the Smith house. The house he was fixing to sell.Hayes has a few things he needs to do before the buyer gets there so he gets to it. He has half of the sub floor laid when there is a knock at his door. He'd already left his gun on the counter so he's unarmed as he answers the door. He sees a man he thinks is a Jehovah's witness. He's seen this man and another when he pulled in. He tells the man to wait so he can shut his radio off. He completely misses the second man going by the window. He had just stepped back into the kitchen when he hears the back door opening. This triggers every instinct he has but his gun is on the counter. He hits the ground as the man fires.Hayes ducks into the living room. These two think they have him. Far from it. They are dealing with a Treadstone operator. Well trained, ruthless and deadly.These two even know his name and they are pro's. They had never fought anyone like Hayes though and he is the winner. Both are dead and Hayes figures that his realtor is dead as well and of course the guard he met at the gate is dead as well. One thing he did learn is that these two knew who he is and the mentioned Ford. Ford his old teammate. He's wondering what's going on and what he will need to do to stay alive.Jefferson Grey is in Venezuela and he's the man who wants Hayes dead. He thinks Hayes is the man Ford sent the info to. Info that could ruin his sweet Venezuelan deal with Vega. Grey is with the CIA and is one crooked rich man. All he has to do is make sure his man Black kills Hayes and he and his plans and money are safe along with his deal with Vega. Vega who runs the entire area.Levi Shaw is the last director of Treadstone. A Treadstone that is on the back burner. Most think the way to kill the bad guys is by using drones. Levi knows nothing works better than humans. His office is in the lowest level of the Pentagon. Where the Treadstone offices used to be big he's now in a shoe box. He's about to get the surprise of his life.So begins one damned fine read.This one has Hayes, Grey, Black, a Black who does his best to kill Hayes but just doesn't have the know how, Vega, allies, enemies a trip the Venezuela, a driven Hayes, a Hayes who has the capability and training to take the fight to all his enemies, Senator Mendez, millions of dollars and Adam Hayes doing what he was trained to do so he can survive and stay alive.Five Stars.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ormbeach",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE54IIPQXGCJOWYUOXB55XLFIMSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NFFPT9WX13EQ?ASIN=B07QTCQRKM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 20, 2023",
                "reviewTitle": "4.0 out of 5 stars enjoyable",
                "reviewText": "I enjoy the details presented in the novel. Like the shirt stuck to him like a second skin. Enjoyable rapid reading for the summer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J1948",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR56YPSPMCVGMQQHJZGFYK7IJRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUY7B6SPVW820?ASIN=B07QTCQRKM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Fast paced action",
                "reviewText": "Lots of fast paced action keeps the reader engaged.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESIYV4CIS3A3IW43XMXNXHZG7LQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2G9HMF1YAYDV7?ASIN=B07QTCQRKM",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 9, 2023",
                "reviewTitle": "3.0 out of 5 stars Average, not the Grey Man",
                "reviewText": "Wanders all over the place. Not a page turner.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SlavenSlaven",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHI6IHHKCLXUOGN6IJGOMEY2F5OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EZ3FHFDQ213D?ASIN=B07QTCQRKM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 29, 2020",
                "reviewTitle": "5.0 out of 5 stars All killer. No Filler. From Veteran author in this Jason Bourne Universe!",
                "reviewText": "Veteran author Joshua Hood is back with a Jason Bourne spin-off series, The Treadstone Resurrection. The Jason Bourne Series was originally created by Robert Ludlum in 1980 with The Bourne Identity, followed by The Bourne Supremacy (1986), and The Bourne Ultimatum (1990). Joshua is an Army veteran, while assigned to the famous 82nd Airborne Division, he served in Operation Iraqi Freedom (OIF) and Operation Enduring Freedom (OEF) in Afghanistan. Upon returning to civilian life, Hood continued to serve his community as a sniper team leader on a full time SWAT team in Memphis. Currently, he spends his time writing, hunting, and generally being a BAMF.Jason Bourne could be considered lucky, having been shot in the head on an operation and losing his memory, what about the Treadstone operatives that can’t forget what they’ve done? These operatives are trained to be the perfect killing machine, ignoring pain and pushing forward no matter what. Killing America’s enemies and disappearing without a trace. Among these is Adam Hayes, a former Army Special Operator, he had lost men on a mission while fighting the war on terror and the CIA came calling with promises of retribution. They trained him well, used him for years until he had enough. Deciding to call it quits, he went off the grid and was attempting to piece his life back together. He was doing a pretty good job until his past came calling in the form of an old war buddy that was being hunted. His friend reached out to Hayes for help, but by the time Hayes got the message the enemy already had their sights on Hayes, not really knowing who they were dealing with, they tracked Hayes and were in a world of hurt.Hayes escaped with his life and goes on the hunt, not really knowing who is after him. Could it be an old mission with some loose-end, a hostile foreign government, his own government? Targeting Hayes and pulling him into this conspiracy turns out to be a bad call, dusting off his skills and killing bad guys is something Hayes is very good at. He quickly learns what is at play and people in power at the highest echelons of multiple governments are plotting to seize control and the only thing standing in their way is Adam Hayes.Joshua Hood brings us a page turning novel, filled with action, including detailed descriptions of all weapons utilized, descriptive enough that only someone that has been there and done that can achieve. The tone of this novel is serious, as many scenes are life and death. However, Hood does a fantastic job interjecting humor at very appropriate times. Making this novel a fun read that is difficult to put down. Earning itself a Blast Radius of a Dirty Bomb, a 9.25 Lima Charlie Rating. This new series from veteran author Joshua Hood is going to be an annual must read, I can’t wait for the follow up. Furthermore, making this book into a movie should happen ASAP.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/51Ik5zx5ilL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "bob f",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH37ZRGVPGWYCWIJLWIJGMGIRDWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3IJ7C7BPZ1OGR?ASIN=B07QTCQRKM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 15, 2021",
                "reviewTitle": "4.0 out of 5 stars A good read",
                "reviewText": "I don't really get the low review of this novel. It's a good book. The story is easy to follow and entertaining. It's not a Jason Bourne novel nor was it billed to be one.Someone mentioned poor editing, don't quite get that. Only issue with the story I had was the often mentioned names of the equipment used, like a pistol or night site like a advertisement for that product. A sign of the times maybe. A little overpriced too. Might wait to read the next two when the price is that of a paper back. It won't ever be a classic like a Ludlem or Clancy maybe, but I enjoyed it.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. GLASGOW",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF7FDSU3WODHR4EGB6BD5NE5Z2A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QEFQ6HU9KB4W?ASIN=B07QTCQRKM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 30, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent story with plenty of nonstop action",
                "reviewText": "Really enjoyed a great story with plenty of action and suspense. Twists and turns with plenty of surprises along the way. Thanks",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendyl Leslie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFCDWI7VVRBAYMMKTRUIUVSQVKHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RFO5WKQUAUE1W?ASIN=B07QTCQRKM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2021",
                "reviewTitle": "4.0 out of 5 stars Liked the story, but . . .",
                "reviewText": "This was the first time I've read this author and the title of the book intrigued me. I did like the story and found it to be engaging and fast-paced. But there was one, IMHO, very annoying thing: flashbacks. I thought there was way too many of them. It's okay to have a couple of flashbacks to get the reader up to speed on what's going on, but there were at least a dozen of them in this story. Each time, it stopped the flow of the action. Very irritating. I may take a look at one of his other writings, but if I find he uses flashbacks like he's done here, he's lost a potential fan.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SH55",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 4, 2023",
                "reviewTitle": "My first of the Treadstone stories and it was better than ANY FILM I've watched.",
                "reviewText": "This is a true thriller from start to finish. I can't wait to read Ludlum's books and compare them but either way this is a brilliant piece of writing that never slows its pace. Never mind 5 stars this is easily 9/10. The part with the drunk DEA agent and the jeep is hilarious and definitely for the movies.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 25, 2020",
                "reviewTitle": "Classic thriller in the Ludlum style.",
                "reviewText": "Great book. Classic thriller.Rreal page turner. If you like action novels you well love this book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Deep Ranjan",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on August 9, 2020",
                "reviewTitle": "TreadstoneResurrection is lightning-fast action thriller with multilayered character development.",
                "reviewText": "The #TheTreadstoneResurrection by Mr. @JoshuaHood is lightning-fast paced and explosive all out authentic action thriller with multilayered character development.Here's my Bullet Review👇* Simple Plot👉7🌟* Lightning-fast Narrative👉9🌟* Settings👉8🌟* Gritty Characters👉8🌟* Character Development 👉8.5🌟* Dialogues/Interactions👉10🌟* Authentic Action Sequencs👉10🌟* Armaments Descriptions👉10🌟* Climax👉9🌟What I loved👍* Authentic Action sequences* Character Development of protagonist* Lightning Fast NarrativeWhat could've been better🤞* Character Development of other characters* Simple Plot* Bit rushed climaxMy Overall DeepRating👉9🌟",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim Sheather",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 15, 2022",
                "reviewTitle": "great read",
                "reviewText": "I really enjoyed the book, however it’s hard to relate to a new Treadstone character. Even so, I loved the action and Hayes is fascinating because unlike Bourne, he was given a drug regime.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Derek B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 3, 2021",
                "reviewTitle": "Treadstone series continues its fast paced action",
                "reviewText": "Joshua Hood did a great job of continuing the tread stone series really enjoyed it, and looking forward to the next book in the series",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}