{
    "remaining_requests": 1084,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Birnam-Wood-Novel-Eleanor-Catton-ebook/dp/B09Y46DSD7",
    "body": {
        "name": "Birnam Wood: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Birnam-Wood-Novel-Eleanor-Catton-ebook/dp/B09Y46DSD7",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/91K0kCCRUyL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Eleanor Catton",
            "link": "https://www.amazon.com/Eleanor-Catton/e/B0034O4XWA/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 5171,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "INTERNATIONAL BESTSELLERA Best Book of the Year: The New York Times Book Review, NPR, The New Yorker, The Washington Post, The Atlantic, Time, Financial Times, Slate, The Chicago Public Library, Kirkus, The TelegraphA Barack Obama Summer Reading Pick“[A] savagely satirical thriller.” —PeopleThe Booker Prize–winning author of The Luminaries brings us Birnam Wood, a gripping thriller of high drama and kaleidoscopic insight into what drives us to survive.Birnam Wood is on the move . . . A landslide has closed the Korowai Pass on New Zealand’s South Island, cutting oﬀ the town of Thorndike and leaving a sizable farm abandoned. The disaster presents an opportunity for Birnam Wood, an undeclared, unregulated, sometimes-criminal, sometimes-philanthropic guerrilla gardening collective that plants crops wherever no one will notice. For years, the group has struggled to break even. To occupy the farm at Thorndike would mean a shot at solvency at last. But the enigmatic American billionaire Robert Lemoine also has an interest in the place: he has snatched it up to build his end-times bunker, or so he tells Birnam’s founder, Mira, when he catches her on the property. He’s intrigued by Mira, and by Birnam Wood; although they’re poles apart politically, it seems Lemoine and the group might have enemies in common. But can Birnam trust him? And, as their ideals and ideologies are tested, can they trust one another?A gripping psychological thriller from the Booker Prize–winning author of The Luminaries, Eleanor Catton’s Birnam Wood is Shakespearean in its drama, Austenian in its wit, and, like both inﬂuences, fascinated by what makes us who we are. A brilliantly constructed study of intentions, actions, and consequences, it is a mesmerizing, unﬂinching consideration of the human impulse to ensure our own survival. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B09Y46DSD7"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Farrar, Straus and Giroux (March 7, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ March 7, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 21037 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 426 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0374110336"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#7,284 in Kindle Store (See Top 100 in Kindle Store) #11 in Psychological Literary Fiction #39 in Mystery, Thriller & Suspense Literary Fiction #129 in Political Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 5,171 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/3a9ee551-32dd-4010-8f68-222d572c71c1.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62e93c78-8e0c-4f18-bc51-04111cc047e6.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c0d2db26-9d5b-4154-942f-e5159b94fa97.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/2c6b3bda-265c-40cb-86cf-c1bd99458989.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bbb68409-f73c-401f-a42e-2c05ef92f652.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/01f1685e-9d4f-46eb-869f-0bfa8db3ca3f.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/928fc940-a3bd-4ff7-8dba-e03b65948fc7.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7d4bb5f7-760c-47bd-be17-bfe7158ad8bb.__CR0,0,300,300_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/c4a73c5d-1185-4027-bb0b-cc8dcf6980c1.__CR0,0,300,300_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "switterbug/Betsey Van Horn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC4L6YCFUMKPSTZP4E4DS6E2PPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RRQ12YWPY5UTU?ASIN=B09Y46DSD7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Intrepid, compelling, never lags",
                "reviewText": "Of the three novels written by Kiwi author Eleanor Catton, no two are alike, and her doorstopper, THE LUMINARIES, won the Booker prize in 2013. I’ve had a “reader’s crush” on Catton since her first novel, The Rehearsal—about the nexus of theatre and reality. BIRNAM WOOD reinforces my adoration of her writing. She doesn’t use her narrative as a mouthpiece for her stance or posture. Her characters are precise and complex; the pace and tempo are immaculate and powerful, and the plot is exciting, exacting, intrepid, and compelling. And satirical!It’s an ensemble cast, with arguably Mira Bunting as the main protagonist, a 30-something woman who began a volunteer collective gardening group, Birnam Wood, planting sustainable crops in neglected spaces (usually without owners’ permission). It hasn’t evolved much in the five years it has been around; money is tight and it’s a lot of work for people who have other jobs and considerations. But what would happen if an enigmatic billionaire businessman offered to lift them out of their idle state and into a thriving enterprise? How would the power dynamics play out, what are the stakes?Mira’s friend and Birnam partner, Shelley, has one foot out the door—she’s weary of being taken for granted. And adventurer Anthony Gallo has romantic designs on Mira, even though he’s been overseas for four years, and has returned with his own rigid ideology, and is suspicious of the deal blooming with the billionaire, Robert Lemoine, and Birnam Wood. Lemoine is the surveilling shapeshifter,, piloting a plane when he wants to look in on his assets. He’s also building a Doomsday bunker, a luxe underground dominion.Then there is recently knighted Sir Owen Darvish and his wife, Lady Darvish, who own the land near Korowai National Park and Korowai Pass, in Thorndike, where there was a deadly landslide, and near where Birnam Wood would plant. Sir Owen had other designs until the landslide happened, and now Lemoine wants to buy it, and they are at the tip of making agreements. Dark deals and secret agendas simmer, and you’ll be admitted to the furtive world of drones, surveillance, and other murky activities afforded the obscenely rich.I admit to my preference for the third person pov. The plot opens up, is more expansive, and you can get behind all the characters. We know the stakes, most of the veiled plans and covert motivations. Our insight into the cast is uninhibited. The pages will burn as they turn, never a dull moment or a pretentious passage, the characters drive the satire of the story. It all builds to a riveting denouement—I uttered a few loud expletives along the way. The first sixty or so pages ride the runway and shape select characters-- plot ready at the gate, and then it's wheels up, liftoff, and you realize—anything can happen, and you know you don’t have control. You just have to be there.I honestly did not want this unputdownable book to end, I wasn't ready to say goodbye.Be ready! And the ending----",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John C Holbert",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRV43762YQCQZC3J27UVYVY524Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R17JZYOBVLPGZT?ASIN=B09Y46DSD7",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "4.0 out of 5 stars Two books in one?",
                "reviewText": "I admit at the beginning that I approached this book with brain not fully engaged. I found it quite slow in the first 250 pages, focusing, as it does, on the relationships between and among characters that I found hard to like or identify with. It appeared to be about the environmental crisis--the reason I selected the book--but turned out to be something rather different. Suddenly, it became in my limited mind something altogether different, a sort of apocalyptic and chaotic murder fest. As I reflect further, I think I can now see just how the first book leads to the second, but Catton uses a good bit of sleight of hand to make the connections. So, I urge you to pay attention to the opening gambits, because clues are being strewn as you read that might help you make the shift that the plot makes later. Perhaps one might ask, \"Just who is Macbeth here?\" After all, \"Birnam Wood\" surely conjures the Scottish play in any literary brain. And is there a Lady Macbeth lurking among the New Zealand back country? I enjoyed the read, however much I did not \"cotton\" on to Cottan's game as quickly as I might have.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John J. DeVine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7QXAVQ2UPI7W5RKNVFADIOIOOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R317JZZDZZJL9Q?ASIN=B09Y46DSD7",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "3.0 out of 5 stars Bored me to tears",
                "reviewText": "I just couldn’t get invested in the story or the characters. It became an actual chore to sit down and read this. No, I did not finish it. I read about halfway and then figured why bother…",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leslie Bialler",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHYYKXVAU6T3HZMH3AQ7GR7USIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LS8S2D9997HE?ASIN=B09Y46DSD7",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 3, 2023",
                "reviewTitle": "5.0 out of 5 stars If Jane Austen had read Patricia Highsmith and . . .",
                "reviewText": "\"Birnam Wood\" is New Zealander Eleanor Catton’s third novel, and it’s the least serious. Her first, “The Rehearsal” was a dry solemn study of, among other things, the performance of a High School drama. Then came “The Luminaries,” which was released in 2013, at a time when the absolutely dreadful but much praised “The Goldfinch” was sucking up all the air in literary salons and snagged a Pulitzer Prize somehow, while “Luminaries” was busy winning the Booker Prize.And now ten years after, we celebrate the arrival of something completely different. This is a genre thriller mixed with social satire (imagine if Jane Austen had still been around when Patricia Highsmith birthed “The Talented Mr. Ripley” and said, “I can do that!”). After a slow start it makes its intentions clear. You will encounter some mockery of socialist twits who run around New Zealand planting guerrilla vegetable gardens while arguing with each other using potted Marxist terminology. They are led by Mira, who is rather more of a capitalist than she’d like to admit, and Shelly, who wants to go but is always being pulled back in.And then we have a stock figure: the smarmy but charming American billionaire, Lemoine, who has made his money in drones, and his chum a local businessman, Owen Darwish, who has made his money in pest control. He’s been newly knighted. But stock figure the billionaire may be, there is nothing ordinary about the book. It’s beautifully written. Catton never loses control, and her dazzling writing should be intriguing enough to keep readers with ADHD from departing early. You can certainly enjoy it on the beach, if you want. But it’s hardly what I’d call a beach read.The menace rears its head in the third of the three chapters (they’re so long the author might as well have called them parts, not chapters--if, that is, there WERE anything other than an occasional section break within the chapters). But the novel, told in third-person (with occasional mockery) from multiple points of view, moves along smoothly, and Catton surely does stick the landing. Or drops the mic.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Len",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 4, 2023",
                "reviewTitle": "An excellent thriller that explores the dynamics of economic disparity and greed.",
                "reviewText": "Young idealists have created this organization called Birnam Wood. (Recall the warning to Macbeth that he “shall never vanquished be until Great Birnam Wood to high Dunsinane Hill shall come against him.”) The young people of Birnam Wood plant gardens in abandoned properties whose care requires stealth as these properties are often owned.Mira is the creator and the idea person for Birnam Wood while her friend Shelly works quietly behind the scenes to make Mira’s ideas happen. Tony was one of those involved in its creation of Birnam Wood but he had a falling out with Mira and has been absent from the organization for about four years.Mira hears about Thorndike, a town that’s been isolated from the rest of the world by a landslide that’s cut off an important access point through the town. Prior to this happening, property in the town was valuable as it bordered New Zealand’s Korowai National Park. Now, parts of the town are abandoned. One of those parts is owned by Sir Owen Darvish and his wife, Lady Darvish. They had originally planned to subdivide it but, with the landslide, that dream was discarded.And then, a saviour arrives in the form of Robert Lamoine, an American billionaire who’s made his fortune designing drones. (Yes, the same drones used by the military for weapons and surveillance.) He will buy the property but first they must sign a non-disclosure agreement as to the sale and his identity.Mira hears of Thorndike and explores possible locations for their garden. Of course, she discovers the Darvish’s property and immediately goes to work with the plan of bringing in help from the others.Themes explored in this novel include hubris, greed, love, and ambition but it’s still a thriller that will keep you on edge to the end.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Liam A Haslam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "Excellent read",
                "reviewText": "First book of the year. A thought provoking page turner. Explores left perspectives amidst an ecological crime. I would highly recommend.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nura",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 23, 2023",
                "reviewTitle": "We'll produced book",
                "reviewText": "Sturdy for a paperback, cover art is striking.. as for the novel itself.. this is one of a kind, never read anything like this before, deep character studies cum break neck thriller ?!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kim Macrae",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on March 31, 2023",
                "reviewTitle": "A great read,",
                "reviewText": "I'd recommend this book to anyone who enjoys plenty of action, tight plotting and great writing.Although it starts a little slowly with perhaps a bit too much detail about characters' motives and personalities in one go, it does set up the plot well and makes the characters relatable and believable once things start to move.And move they do.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ted Gregory",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 5, 2023",
                "reviewTitle": "Was totally committed and then...",
                "reviewText": "Stunning ending in the true thriller style and yet....I closed the book an empty shell of a reader. Prior to that I thought Catton had found her mojo as a writer who gives me what I want. The character arcs were well done and there were lots of chances to both love and hate the multiple characters Catton created. I raced towards what I expected to be my ending and then BAM - it wasn't. That should have been just what everyone wants, right? But it wasn't. I had to ask myself - what's the takeaway? I felt like phoning and saying, \"Eleanor, who talked you into doing it that way?\"",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}