{
    "remaining_requests": 1321,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Dont-Open-Door-Unputdownable-Psychological-ebook/dp/B0CR2PQM4J",
    "body": {
        "name": "Don't Open The Door: An Unputdownable Gripping Psychological Thriller With A Breathtaking Twist",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Dont-Open-Door-Unputdownable-Psychological-ebook/dp/B0CR2PQM4J",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81YsVOV2ouL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Cole Baxter",
            "link": "https://www.amazon.com/Cole-Baxter/e/B07CJ4PCP4/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 1057,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Be careful when you open the door to strangers...Successful, happily married former military contractor Samson Chase is spending his time alone while his wife Teresa is on a business trip enjoying beer, takeout, and terrible movies while he works on his latest psychological horror novel.But things take an unexpected turn when a knock on the door brings two beautiful young women to his doorstep, claiming to be stranded after a double date gone wrong.He lets them in to use his phone...not realizing that he’s just made a terrible mistake.Samson wakes up with no memory of the night before and into a nightmare. Not only have the women destroyed his house and stolen from him, but they blackmail him with a video of an inappropriate encounter he can’t even remember.Months later, abandoned by his furious wife, on the hook for the house repairs, and in trouble with his publisher, he is back on his feet and ready to seek his revenge. The two girls have made two mistakes: targeting a man of his talents, and stealing a phone with a tracker in it.It’s time for some payback...and nobody is more creative at revenge than a man who scares people for a living, and has absolutely nothing left to lose.Don't Open The Door – the gripping psychological thriller perfect for fans of Freida McFadden, Daniel Hurst, and K L Slater. Read more",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b/ref=dp_bc_aui_C_1?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b/ref=dp_bc_aui_C_2?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b/ref=dp_bc_aui_C_3?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CR2PQM4J"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 1, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 5024 KB"
            },
            {
                "name": "Simultaneous device usage ‏",
                "value": "‎ Unlimited"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 397 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,122 in Kindle Store (See Top 100 in Kindle Store) #40 in Domestic Thrillers (Books) #42 in Domestic Thrillers (Kindle Store) #43 in Psychological Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 1,057 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Robin O.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEOZALXXVSECGBU6UAYBG3N5ZMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R242X46EN9DK9N?ASIN=B0CR2PQM4J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 29, 2024",
                "reviewTitle": "5.0 out of 5 stars Best Book Ever",
                "reviewText": "How could you not feel sorry for Samson? Lissie and Candi were viscous rich girls who knew daddy could buy their way out of any situation they put themselves in. And Teresa, Samson's wife, don't even get me started on her.Men being raped is just as wrong as women being raped. It can destroy a person. It destroyed 6 men and trying to get justice from the legal system is a slap in the face.Read the book and don't judge Samson like I did for his faults at the beginning, try to see it through his eyes!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "VJWHITT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLTUKQ4VB76NNWS64WKLRQNX6JA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZASMXJMZKK7D?ASIN=B0CR2PQM4J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Fairly Good Story ~ Bad Grammar/Sentence Structure",
                "reviewText": "This was my first book by Cole Baxter but may give him another try…it had a good story line (didn’t really consider it a psychological thriller…) but the sentencing/wording/structure wasn’t the best!! I’m not an English major but it was a bit distracting to quite often have to stop and rearrange the words in a sentence for it to make sense. I can’t put all the blame on him (aren’t there editors, etc. for that???), which is why I’m going to download another of his books!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "LC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQAYBWXETTI6GE56QYFZMIHNURA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2HI0GHITBI9VX?ASIN=B0CR2PQM4J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Oh No!",
                "reviewText": "I was seriously considering ending my reading & removing this book from my carousel. I was shocked at the abuse the main character received. But I'm not a quitter so continued to the end to learn that justice would prevail through many setbacks. If you can stomach the abuse then more power to you but if not, keep reading to the end where the book becomes tamer & ends on with a lesson.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sherri Smith",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6SJZD77TCFY6XK42MSJLCRNLSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R358IO2J25J2IO?ASIN=B0CR2PQM4J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Cole Baxter doesn’t disappoint!",
                "reviewText": "I couldn’t read this book fast enough! This was a great book and it felt good to cheer on the six guys who were abused in this story. What a twist on a recurring theme but turned around. I cheered when the girls got what they deserved!! Really recommend this book!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mnmloveli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCTV7IKYZWBT7ILD5IGDKAVHTAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R16M493B0SA54W?ASIN=B0CR2PQM4J",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "3.0 out of 5 stars Unbelievable but liked the writing style !",
                "reviewText": "‘24 - 3 STARSDESCRIPTION : Successful, happily married former military contractor Samson Chase is spending his time alone while his wife Teresa is on a business trip enjoying beer, takeout, and terrible movies while he works on his latest psychological horror novel.But things take an unexpected turn when a knock on the door brings two beautiful young women to his doorstep, claiming to be stranded after a double date gone wrong. He lets them in to use his phone...not realizing that he’s just made a terrible mistake. Samson wakes up with no memory of the night before and into a nightmare. Not only have the women destroyed his house and stolen from him, but they blackmail him with a video of an inappropriate encounter he can’t even remember. Months later, abandoned by his furious wife, on the hook for the house repairs, and in trouble with his publisher, he is back on his feet and ready to seek his revenge. The two girls have made two mistakes: targeting a man of his talents, and stealing a phone with a tracker in it. It’s time for some payback...and nobody is more creative at revenge than a man who scares people for a living, and has absolutely nothing left to lose.REVIEW :First book by this author for me. My bestie Joanne found this book and it reminded me of the 2015 Keanu Reeves movie called Knock Knock.Earned Double Kindle Rewards on this purchase.The first half of the book was way too unbelievable, even for a fiction thriller. A former military killer can’t escape 2, seemingly average, unarmed, untrained women. I almost gave up. I’m hoping the second half of this book will redeem itself. The second half was better; mental health/PTSD treatment, a committed lawyer and final payback. Could have received a higher rating if the first half of this 400 page book was cut by 100 pages. I would try another read by this author.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benita Hyder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUFKPQLTPF46IVIGXKMBRSAHBNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCPVP0H3QFXQD?ASIN=B0CR2PQM4J",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "4.0 out of 5 stars Almost didn’t read.",
                "reviewText": "I have to say this book had me skimming pages at times. Too graphic for me. I was well into almost half the book before I decided to finish it. I really couldn’t predict how it could possibly end. Sampson seemed like a wimp that was making too many bad choices. Once I passed that point it was hard to put down. It is a disturbing book that finally sheds light on how men might feel if they were treated the way women have been treated for centuries.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cindy Dutton",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE55VF5SBLXMVRHFUCJ3REMY4LJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35N6HTA0EX7LX?ASIN=B0CR2PQM4J",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars WOW",
                "reviewText": "I almost gave up reading this book. It got to a point were I wanted Sampson to kill the girls so badly that I was mad that he didn't. I am so glad I finished reading the rest of it. The twists and turns, I was so mad on his behalf that I forgot I was reading a story. It was that real.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Penny Dreadful",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4WIKPUMD6BQ7XLX5ZF7XMRKJBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JFVT8CEGPQV0?ASIN=B0CR2PQM4J",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "1.0 out of 5 stars SORRY NEITHER",
                "reviewText": "I knew right from the beginning of the book what was going to happen as soon as the protagonist opened the door to the two girls. Not only was I right, but the whole premise was ridiculous. I have no patience with someone who makes so many stupid mistakes while trying to escape a situation and this guy made plenty! There is fairly graphic sex which I don’t have much of a problem with, but this just went on and on to the point that I started skipping ahead. I’m sorry to say that I finally gave up and didn’t even finish the book. It was simply too much of a bad thing. I could not tell you how many years it’s been since nice I’ve left a book unfinished. That speaks volumes. I honestly would not recommend this read at all. I want to add that the entire first half reads like a young man’s letter to Penthouse magazine. Just too over the top.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eva Edge",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 8, 2024",
                "reviewTitle": "heavy reading, but worth it",
                "reviewText": "⭐⭐⭐⭐⭐Don't Open The Door by Cole Baxter is a suspenseful psychological thriller that will make you look at some situations differently!Trigger warning: Sexual abuse, torture, mental breakdown.I believe this book is a great example of discrimination based on stereotypes! Example of how authorities tell us one thing but once it becomes reality no one will listen or do anything!This is a book about trust and betrayal! About breaking down and healing. This is a book about true friendship and deep trust. This is a book about how not to give up.Some parts of this book are so descriptive that it will cause distress if you are sensitive but it's possible to skip it without losing the contest of what is happening.Samson is a happily married writer with all his life nicely lined up. It all changes in one evening when he opens the door to two young sisters asking for help.This is the beginning of disaster and losing everything. Sometimes the biggest loss is losing support from those who must be there for us. Once this is gone you are left with the question - where is the point?This is a heavy book, it's not a traditional psychological thriller, there is a good portion of thought process and mental healing through understanding.This definitely is a fast peace thriller at the same time you will need a break to process or to simply breathe!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "vic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on January 19, 2024",
                "reviewTitle": "Hooked from the beginning",
                "reviewText": "I read this book in one night, I couldn't turn the pages fast enough to see what was next, it was nice to see justice was served in the end, people turn a blind eye to men being victims as much as woman can be, this book makes you truly think about what can happen and have nobody believe you, I thoroughly enjoyed this book and cannot recommend it enough, now I'm off to read my new favourite authors next book, 5 stars from me",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Olympia Clark",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 24, 2024",
                "reviewTitle": "The Best!",
                "reviewText": "I could not put this book down, it was different than other thrillers and I commend this author. Excellent, excellent, excellent, now onto his next!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sheena moran",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 10, 2024",
                "reviewTitle": "Surprising story",
                "reviewText": "Started off as a good read then it suddenly turned and was quite disturbing , a few twists and turns not what I was expecting but a very good story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JULes",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "Brilliant",
                "reviewText": "One of the best books I have read in a while. First time reading this author, I will be downloading a lot more great.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}