{
    "remaining_requests": 1187,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Writing-Killer-Thriller-Editors-Compelling/dp/1490389946",
    "body": {
        "name": "Writing a Killer Thriller: - An Editor's Guide to Writing Compelling Fiction",
        "price": "$11.99$11.99",
        "originalPrice": "",
        "rawPrice": 11.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Writing-Killer-Thriller-Editors-Compelling/dp/1490389946",
        "soldBy": {
            "sellerID": "A15N4LPTRHSYRC",
            "name": "Noodle Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A15N4LPTRHSYRC&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71wBpSeHBqL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Jodie Renner",
            "link": "https://www.amazon.com/Jodie-Renner/e/B008H80AIE/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Noodle Books",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 218,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 15 hrs 25 mins",
            "FREE delivery Tuesday, February 27 on orders shipped by Amazon over $35"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Reference",
                "link": "https://www.amazon.com/Education-Reference-Books/b?ie=UTF8&node=21"
            },
            {
                "name": "Writing, Research & Publishing Guides",
                "link": "https://www.amazon.com/Writing-Research-Publishing/b?ie=UTF8&node=5267707011"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ CreateSpace Independent Publishing Platform; 3rd edition (June 17, 2013)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 194 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1490389946"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1490389943"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.98 x 0.42 x 9.02 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#446,221 in Books (See Top 100 in Books) #468 in Words, Language & Grammar Reference #616 in Authorship Reference #4,102 in Writing Reference"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 218 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jim Bessey",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY3YA3I3MLG3PRYY4C44RLBIG6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1W8YXI7IXUK59?ASIN=1490389946",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2013",
                "reviewTitle": "5.0 out of 5 stars Here's a superb resource for writers of thrillers and related genres",
                "reviewText": "For aspiring Thriller writers, here's the definitive guide to putting all the pieces together perfectly. Newly expanded to 23 chapters and three resource sections, \"Writing a Killer Thriller\" covers all the bases. Renner, with years of editing experience, writes succinctly and never fails to credit advice she's gleaned from earlier sources.This book includes everything an author needs to craft a potential bestseller. Key sections cover plot foundation, story structure (\"arc\"), twists and revelations, use of foreshadowing and other plot devices, as well as a list of structural no-no's and how to fix them. Renner devotes substantial portions to character development, too. She stresses the classic requirements for a sympathetic protagonist (or hero), and contrasts those traits to best practices for introducing a worthy villain. Also well-explained are best practices for using point of view (POV) in the thriller genre.Chapters devoted to style and tone cover everything from that all-important first paragraph to methods for inducing tension page after page. Renner reinforces traditional advice to \"show\" rather than \"tell\" with emphasis on the writer's use of all five senses in the narrative. One of her most powerful sections, appropriately enough, focuses on creating powerful story endings (\"kick-ass climax\"), along with satisfying resolutions. These are the things readers remember as they close a just-finished book. Fail there, and a writer won't have many repeat readers.While Renner quotes several reputable writing sources, she also offers great \"before and after\" examples from her own book editing. Those are fun because we get a behind-the-curtain glimpse at the editing process. I find it much easier to absorb lessons presented by example rather than rule, too.An accomplished book editor, Renner sprinkles sound advice for making critical edits and revisions throughout the guide. She offers useful pointers for tightening sentence structure and increasing tension via chapter design. Writers making their first forays into this genre should pay close attention to these strategies, especially if those writers will self-publish without consulting a developmental editor.I've been reading thrillers since I graduated from the skull and crossbones Young Adult section in my small-town library. After a few hundred novels, I know what I like. But I wasn't sure why I liked some books much more than others. Renner's guide gave me a few \"aha!\" moments along the way, so I decided to put her advice to the test.I picked up a contemporary thriller by one of my favorite authors: Jon Hart's \"The Last Child.\" This is a book I've recommended to friends and family from the moment I read the final page. So I decided to re-read it, paying close attention to whether or not this award-winning author used much of Renner's offered writing advice. I lost count of how many times a smile came to my face as I identified Hart's outstanding use of one key technique after another. None of these tactics seemed forced or contrived, either. I only noticed them because I was looking for specific plot and character points, based on Renner's chapters.Of course, we don't usually want to read books while casting a critical eye on structural elements. What fun would that be? But for those of us who hope to write a successful thriller one day, it's very good to know what works and to see how bestselling authors make the most of their story and characters. Follow the advice Jodie Renner presents in \"Writing a Killer Thriller\" to greatly improve your own odds of achieving success as a kick-butt thriller writer. Highly recommended.Disclaimer: I purchased my copy during a discounted promotional period. I also own the original edition of this guide.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BobBlacka",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGSYXGTWFFLN5Y27KJQXFIWHQVSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RB35I9P1CUOQ8?ASIN=1490389946",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2015",
                "reviewTitle": "5.0 out of 5 stars A Guide Every Writer Should Have.",
                "reviewText": "Although I consider myself an experienced writer, I bought this anyway, even though some of the reviewers criticized it for being basic and drawing information from outside sources. Quite frankly, I don't give a damn where the information comes from as long as it is useful, well organized, and the author gives credit where credit is due. And this book does all three.What I really like about this book is it goes right to the meat and doesn't embellish it with a lot of superfluous fill. It's an easy and entertaining read and gives out information in a way it will be remembered. There are many reference books out there that are boring and difficult to read and it takes a special person to persist all the way through to the end. My bookshelf is laced with books just like that.But this book is a joy to read and the information is solid. Once started, I couldn't put it down. Each chapter is arranged so it naturally flows from the previous one and effectively answers questions that arise during the read. Even though parts of this book are indeed gleaned from other sources, the way it is presented is its real strength. And because the information is universally espoused, you can have confidence it has withstood the test of time and works!In my opinion, the best way to utilize this book is to read it once before you start your novel and then read it again when you are one-third and two-thirds through it. That way you can reassess your creative effort to make sure you are hitting all the goal posts.Sadly, I read a lot of books from independent authors which have absolutely exquisite writing but fall short in terms of story line. Having wonderful writing skills is not the same as writing a good story. Generally, it's the story that sells books; the writing is only the medium that gets the ideas across.If the information contained in this book is rigorously adhered to, I'm certain it will bring life and recognition to your novel. I highly recommend it!",
                "reviewVotes": "20 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeff ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGG7SGAFJNTME5HN2ZPDZET6PJCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RMHPN2PM9J9E7?ASIN=1490389946",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Great resource",
                "reviewText": "A detailed resource for current and future thriller writers to add tension to their writing and grab the attention of their fans. Well worth the time and investment.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Experten5",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG65IDLOOR3FUD4AFH3POITBAPXQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2FYAAK1RSAMAZ?ASIN=1490389946",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 8, 2023",
                "reviewTitle": "5.0 out of 5 stars Excellent Source Book for Aspiring Thriller Authors",
                "reviewText": "Well-structured, easy to read, full of useful information on writing a hit thriller. I've read a number of books on the subject, and just completed my first two manuscripts. This is the best book on the topic that I've found! I recommend that you start with this book if you are embarking on the journey of writing thrillers.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rakesh Aggarwal",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 27, 2021",
                "reviewTitle": "One of the most useful books I have ever read",
                "reviewText": "Jodie's pithy, easy to read style is backed up with lots of useful advice and examples. I have come across many overly academic books which I have quickly abandoned. However, this book is what any book on writing should be: a page turner. In other words, it practices what it preaches!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mahrie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 22, 2015",
                "reviewTitle": "LIsts and check lists... love it.",
                "reviewText": "Clear, to the point, complete: After 30 years of studying the craft of writing, very few-how to books offer me an abundance of new ideas. It is the new spin on the tried and true ideas that can make the difference. Ms. Renner's book assumes the reader knows the basics and goes on to present a collection of ideas in a progressive, logical format. I netted a dozen new scene ideas, a new subplot and an opening idea for my WIP as I read. She uses steps and lists - and I love lists. As they say, when the student is ready, the teacher will appear. Worked for me this time.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Thrill Junkie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 27, 2013",
                "reviewTitle": "Little Gem",
                "reviewText": "`Writing a Killer Thriller' is a little gem, crammed with excellent info on writing a thriller that will sell.I like how the advice is laid out in an easily skimmable format, with subheadings and lists.The tips are great so that even published thriller writers may find this short book very useful for ideas to add tension, intrigue and suspense.This author specializes in editing thrillers, and definitely seems to know her stuff.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "maureen turner-books by maureen",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 2, 2013",
                "reviewTitle": "Unseful tips for the Indie Author.",
                "reviewText": "Another book that I picked up through Facebook/Twitter. I am still reading it as it is one of those books that you can pick up and down at any time. I have found the sensible tips very informative and will act on many of them. Well done Ms Renner.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S.Write",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on March 7, 2016",
                "reviewTitle": "Fantastic! A very modest author too.",
                "reviewText": "This book is amazing not just for people who want to learn how to write thrillers, but for anyone who wants to learn the craft of writing. And the author does not stop there! Just when you think she has finished covering all areas of writing, there is a glossary right the end which lists alot of commonly used story terms and definitions. Many authors would shy away from doing that since they are scared of competition but Jodie Renner is someone who actually wants to help. Thanks!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$13.32",
                "sellerName": "SuperBookDeals--",
                "sellerRating": "4.5"
            },
            {
                "price": "$14.00",
                "sellerName": "311dvds",
                "sellerRating": "4.5"
            }
        ]
    }
}