{
    "remaining_requests": 1205,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/We-Are-All-Same-Dark/dp/B0876GWCL2",
    "body": {
        "name": "We Are All the Same in the Dark: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/We-Are-All-Same-Dark/dp/B0876GWCL2",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51wF-dTsoXL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Julia Heaberlin",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Julia+Heaberlin"
        },
        "brand": "Julia Heaberlin",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 6691,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            },
            {
                "name": "Police Procedurals",
                "link": "https://www.amazon.com/Police-Procedurals-Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10482"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 34 minutes"
            },
            {
                "name": "Author",
                "value": "Julia Heaberlin"
            },
            {
                "name": "Narrator",
                "value": "Jenna Lamia, Catherine Taber, MacLeod Andrews, Kirby Heyborne"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "August 11, 2020"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0876GWCL2"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,978 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #160 in Psychological Thrillers (Audible Books & Originals) #234 in Women's Fiction (Audible Books & Originals) #399 in Police Procedurals (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "switterbug/Betsey Van Horn",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFC4L6YCFUMKPSTZP4E4DS6E2PPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYB1L54PRY71V?ASIN=B0876GWCL2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 8, 2020",
                "reviewTitle": "5.0 out of 5 stars A Texas tragedy, with levity",
                "reviewText": "I have lived in Austin, Texas for decades but I plead innocent to previous knowledge of Texas author, Julia Haeberlin. Now that I have read this latest novel of hers, I’ve ordered three more of her books! That is how impressed I am her latest psychological suspense thriller. If you’re hankering for a mystery studded in rural Texas grit with an urban savvy and snaky plot, you’ve come to the right book.There’s desert and desert mythology, the wide and starry sky, Texas wildflowers, small town suspicions, and the unsolved ten year disappearance of a nineteen-year-old girl, Trumanell Branson, and her father. Her brother, Wyatt, is a Boo Radleyesque character who has always been the primary (but unproven) suspect. There’s a lot more in here to compel the reader; I was hooked from page one.Haeberlin captured my interest with her palpable humanity and atmospheric writing. This may be a police procedural, but it is also a character-driven portrait of a community still in pain. Odette, a police officer, is the protagonist with a personal stake in finding Trumanell, as she was her friend, and Wyatt was her first and longterm boyfriend and lover. They grew up together. Odette’s father was the town’s top cop at the time, but he’s dead now for five years.At the moment of Trumanell’s disappearance, Odette was trapped under her car after an accident, losing a leg in the process. Much is focused on the symbolism of her prosthesis and her missing leg becomes a kind of motif of loss, pain, and strength. Odette is married now to a successful Chicago attorney, but made a mistake by returning to Texas with him and falling backward into Wyatt again in a weak moment. Can you love two men? Finn, her husband, and a dead ringer for “Emily Blunt’s husband,” isn’t going to tolerate that.There are several mysteries in this small town. Wyatt finds a young, mute girl with a missing eye outside on the baked ground in the hot sun, barefoot. He names her Angel. A runaway? Abandoned? Odette has a covert group with her cousin, Maggie, daughter of the town preacher. They help these unmoored children by arranging escape from whatever danger they are in. And she relates to Angel’s loss—Odette’s leg, Angel’s eye. It is reminiscent of some of John Irving’s themes (Haeberlin even includes a nod to Irving within the story)--abandoned children, missing body parts, and a touch of a dreamlike quality at times within the narrative.Told in first person from various characters’ perspectives, the story advances with a thrum and well-paced rhythm, misted with levity and pop culture references. I was turning the pages with anticipation and suspense, but at intervals I enjoyed slowing down to enjoy interior moments, the characters’ imaginations and poetic observations. These emotionally tortured characters are relatable and sympathetic, often with a warm and mordant wit. Carefully mapped and executed, it would take a really sullen and cynical reader to not embrace this southern, tragic, and hopeful story. It may leave dust in your mouth but it’s also a breath of fresh air.",
                "reviewVotes": "78 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Social Workin Mom",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHK7AZK5VAQRKEOXE3QZLNPUQLVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5JKXAJRZ9EUA?ASIN=B0876GWCL2",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars It feels real",
                "reviewText": "This story felt like it could have been a true one. I was intrigued by the title and read it without having read the description, so I didn't know what to expect, or if it was even the kind of book I'd want to finish. I looked forward to reading it daily, it kept me hooked until the end. I normally don't like Whodunnit stories. I am more interested in character development and relationships than solving a mystery. This story had me wanting the mystery solved because it mattered so much to the characters. The research was thorough enough to give me a new understanding of some different walks of life than my own.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eden Barlow",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEO7GVYYXOX2FP25V3GLWUVXTRAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVATEKT2V4B5V?ASIN=B0876GWCL2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 7, 2023",
                "reviewTitle": "5.0 out of 5 stars A wonderfully intricate storyline!",
                "reviewText": "I really enjoyed this book. I had to make myself stop reading it so that I wouldn’t finish it in one sitting. It’s suspenseful, interesting, and very well-written. There are twists and turns at every corner and a shocking cliff hanger in the middle of the story that only feeds curiosity. I never got suspicious of any character for a second! 10/10 highly recommend (Planning to read Black-Eyed Susans next!)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Keila",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZ6RTF4DRYI4AVIK77YJ5DDZN4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVIO4PTXEOPYF?ASIN=B0876GWCL2",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 1, 2023",
                "reviewTitle": "3.0 out of 5 stars Interesting",
                "reviewText": "att has always been the prime suspect in Trumanell, his sisters, death. All that was left behind was her bloody handprint and she was never to be seen or heard from again. One afternoon Wyatt finds a girl near death in a field of dandelions.Odette is the towns youngest police officer and has always had a special spot for Wyatt. She does, however, believe he is the catalyst to solving the case of Tru. Odette is determined to solve not only Tru’s case, but the current case. Will she be able to do so? Or is she placing herself in harm’s way?I saw this book a while ago and added it to my list because it sounded right up my alley. I was lucky and able to get a copy from the library right away. As soon as I started reading, I was worried. The book was rather slow, but I checked some reviews and they mentioned that it picked up after a while, so I kept reading. For me the book never picked up and overall, I found it rather confusing. I went back and read the ending a few times just to see if I missed something, but I remain confused with how things turned out. I would have enjoyed reading this one with a friend so we could chat and work things out. I did enjoy the story through different points of view, they are usually fun and this one was no different.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Winter Morgan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2PIQ4UXXMPQQQ6IXKMRUCMDN4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ETTQHLOTD2IJ?ASIN=B0876GWCL2",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 10, 2023",
                "reviewTitle": "5.0 out of 5 stars Freaky and fun read",
                "reviewText": "Parts I liked and parts that were so so but overall really fun and freaky listening to this . I read most books but wanted to listen to this on audio and it was freaky and well read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christina McDonald",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on June 28, 2021",
                "reviewTitle": "Lyrically beautiful and emotionally astute",
                "reviewText": "Lyrically beautiful and emotionally astute, We Are All The Same In The Dark is raw, stunning, and darkly twisted. Rather than being a frenetic page turner, it is one of those books you want to sip rather than gulp; you want to enjoy curled up with your cat while relaxing with a cup of tea at your side.We have three POVs, all of which are equally wonderful, and a midpoint that genuinely shocked me. The story is at once a slow-burn mystery and a mystery wound so incredibly taut you won’t be able to put the book down.Absorbingly atmospheric with a brooding presence, I highly recommend.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "husband",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 25, 2020",
                "reviewTitle": "book",
                "reviewText": "husband read it said it was alright",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tianna",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2023",
                "reviewTitle": "Didn't Finish",
                "reviewText": "I hate to say it but I didn't read this book. I bought it as a thriller novel reader and I felt it was quite boring. I got about half way through and gave up to move onto something I would enjoy.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Judy Samuels",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 10, 2022",
                "reviewTitle": "Meandering Storyline",
                "reviewText": "The story never reached it's climax. It seemed to meander from one character to the next and none of them were explored in enough depth to feel any connection to them. I didn't care at all what had happened to Trumanell, and in fact, the repeated use of her name was irritating. The story didn't let us get to know her, or understand her and her brother's intense relationship. Odette's obsession with Trumanell was inexplicable and the whole story was confused and lacking pace. Disappointing read.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}