{
    "remaining_requests": 1215,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Random-Death-Eve-Dallas-Novel-ebook/dp/B0C1X8GDPV",
    "body": {
        "name": "Random in Death: An Eve Dallas Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Random-Death-Eve-Dallas-Novel-ebook/dp/B0C1X8GDPV",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81vjoJNbK4L._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "J. D. Robb",
            "link": "https://www.amazon.com/J-D-Robb/e/B000APT7Y0/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.8 out of 5 stars",
        "customerReviewCount": 10078,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C1X8GDPV"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ St. Martin's Press (January 23, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 23, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4180 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 362 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1250289548"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#291 in Kindle Store (See Top 100 in Kindle Store) #1 in Police Procedurals (Books) #5 in Police Procedurals (Kindle Store) #8 in Women Sleuths (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.8 4.8 out of 5 stars 10,078 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Faithless in Death Forgotten in Death Abandoned in Death Desperation in Death Encore in Death Payback in Death Find out what makes Eve Dallas America’s #1 cop “High-octane pacing, memorable characterization, and ingenious plotting.\" —Booklist “Shows how a pro does it.\" —NPR “Chilling and thrilling.\" —Booklist “Completely gripping . . . Nerve-shredding twists and turns.” –Booklist \"Classic crime fiction at its best.” —New York Journal of Books “Ingeniously plotted…propulsively paced entry in this endlessly entertaining.” —Booklist",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/f129cf34-60aa-4bfb-819e-2c4dd671cf68.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/62c75064-541a-4de7-b2e3-0018de6ad175.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/753f6b42-bda7-41e0-97fb-c85f01736de2.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a3ca3c01-3990-4759-bc83-7d4bb01746fe.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ef698f3f-3951-4da0-ac3e-3a947b64279a.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/dabb10c8-3680-4dc8-b8ef-125c0e8ddf44.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/9ec79cc2-18a6-487b-b57c-5b048c66ed86.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8f528af3-0353-4482-9da5-748fb1f33604.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "K. M. Martin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7ZN4BYCYU7OQEOAGRGEC4YNQRA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37P1WGXRNORV3?ASIN=B0C1X8GDPV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Addition to Long-Running Series",
                "reviewText": "Eve was hoping for a quiet weekend off to spend with her husband Roarke when a call comes in taking her to Club Rock It where Avenue A is performing as they do each year to remember where they all started. The club is open that night to teens who pack the place.One of the teens is Jenna Harbough who is a 16-year-old aspiring songwriter and performer who is hoping to get a chance to slip lead singer Jake Kincaid a copy of her demo. She isn't expecting to feel a poke in her arm and to die just minutes later in Jake's arms.It looks like Jenna died of a drug overdose and it soon becomes apparent that the drugs were injected in her without her knowledge or consent. Investigations into her life don't reveal anyone known to her who might want her dead. The only clues on scene are some threads of fiber on a window in the mens' room and some scuff marks on the wall below the window.The next night 17-year-old Arlie Dillon is at an open-air battle of the bands when she feels what she things is a bee sting on her arm. She dies just a few minutes later despite attempts from her friends and the MTs to save her. It is the same poison mix as killed Jenna. And Eve has a serial killer who is picking his victims randomly to find and stop before he can kill again.Kiki Hernandez is almost the third victim when she feels an injection while she's at the premier of the latest blockbuster. But layers on her arms and a massive bruise where the killer tries to inject his poison causes her to make a commotion and send the killer running.This case is a definite police procedural. Eve and her team have to gather the tiny clues left behind and many eyewitness accounts from people who didn't really look at the killer before she can find him and stop him.This was another excellent episode in the long-running Eve Dallas series. I like the way she works with her team including especially Peabody and Jenkinson in this episode. I also like how characters from earlier series - Charles and Louise, Nadine Furst and Jake Kincaid, and Jamie and Quilla make important appearances in this episode.I love her relationship with Roarke. This time their conflict centers around him giving her some pocket money when she forgets to visit an ATM. It hurts her pride to accept and his pride when she tries to pay him back.Fans of the series won't want to miss this episode. I loved it so much I read it twice with just a few hours in between readings.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Truani1",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJQPXKJB4T6DCTRZEP5W6ZR6KOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1A88OLJA3QSYR?ASIN=B0C1X8GDPV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent",
                "reviewText": "As always, JD Robb (Nora Roberts) does it best. Characters who, by now, need no introduction or description, are still described well enough for the first time \"In Death\" reader to see them in her (or his) mind's eye. The plot, while obvious, is nonetheless intriguing, as is the way Dallas works through it, and draws the reader in. Dallas is, without doubt, the star of the series, but her billionaire bad-boy turned good man husband Roarke, her trusty sidekick Peabody, and the rest of the cast, right down to Roarke's majordormo and thorn in Eve Dallas' side, Summerset, come to life. The cast of main characters has grown over time, and pop up occasionally, like Louise and Charles do in this installment. This is one of the draws of this series. One I believe keeps it fresh and entertaining for the fans of Eve Dallas. Especially given that she never planned to have all these people in her life. All this \"family\". Her early childhood a nightmare. Her teen years driven with one goal in mind. Become a cop. Not just any cop. An NYPSD cop. And though she achieved that, and more as she'd moved up the ranks to Lieutenant, fate had, and has, much, much more, in store for Eve Dallas. Which, at times alternately amazes, and frustrates her. But never prevents her from doing her job. A job she does, better than anyone else. So beware. One book, and you'll be hooked.I never used to reread books. But I find myself rereading this series while waiting on the next installment. Why? Because much like an action film, there are little things that don't really click at first. In order to get the full affect, you'll often want to go back, and find those nuggets that didn't seem to be all that important at the time. And experience that ah-ha! moment. Every book is an excellent read as a stand alone. But the series is, as Mavis Freestone, Eve's oldest, and for years only friend would say, the mega-ult!",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Laura Stephenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMMHK3EOHBFEUQHOWP2YFRSEQAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8H5HNUU8HW0B?ASIN=B0C1X8GDPV",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Yet another amazing In Death book",
                "reviewText": "If you haven't started with the first book in the series, I suggest you begin there. This is a series about a cop named Eve Dallas in New York about 100 and some odd years from now. It is still very much in New York cop story, along with the romance of Roarke and a group of wonderful friends and their increasing number of offspring. There is a lot of humor, and except for the occasional flying car, this series could take place right now. I have no idea why this hasn't been made into a TV series. It's a truly wonderful series with a lot of humor and heart, along with some very twisty cases. The only thing I find wrong with the book is that I can't put it down, so unfortunately I finish it in a day. I wish I had a series I can watch for years. For now, I guess I'll just have to reread the series in order to get the same punch. I will definitely read the next book in the series.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KFloves2read",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGRYQEONBDGVA2HMRNFOVIWQVE3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AA39L342QYXB?ASIN=B0C1X8GDPV",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "4.0 out of 5 stars Good, but not!.",
                "reviewText": "I love JD Roberts, a.k.a. Nora Roberts. And I love the JD Robert books,vall of them. This one was OK. Wasn’t as good as some in the past. But I do want to put a shout out to Susan Ericksen!She did a great job as always on the audible book👍🏻👍🏻🤗The book was good, just not up to the norma, as it has been in the past. I’m glad the Jake and Nadine got through this OK. Although I think they might have been able to make it more interesting had it gone a different way. Not to have anything happen to them just a different way. Looking forward to the next, and if it takes a little bit longer for it to be a little bit more interesting, I’ll go with that. I always look forward to your books with this series. I love Dallas & Rourke and their group of friends. Thanks. 👍🏻🤗😎💜",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol Shetler History Devotee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Random in Death is a worthy addition to the In Death series",
                "reviewText": "J.D. Robb's newest installment, Random in Death (#58 in the In Death series) is a crisper, more focused story than a few of the most recent novels in the series. I got tired of waiting for these sequels to arrive at the library, so I bought this one as soon as it came out.Robb (pseudonym of Nora Roberts) took great care to keep the plot focused on the victims and on Lt. Eve Dallas's pursuit of the murderer. The killer's motive was timely and believable - but elicits no sympathy.The tension of the high-pressure storyline is relieved when Dallas and Roarke pay a visit to the marvelous house being built by Peabody and Eve's longtime musical friend, Mavis. When Bella, Mavis' daughter, yells, \"Das! Das!\" and flings herself at the stoic, kid-averse Lieutenant as always, everyone reading Random in Death will smile. The plot wrap-up is as enjoyable as the story overall.My only issue with the In Death series is that I'd like to learn more about the Urban Wars, with a plotline connecting that past conflict with the present day. A little more detail could be added to make us feel that we are nearly 40 years in the future, rather than just a decade or so. I'm a science fiction lover and with a History B.A., so I'd like more stories that hit both these notes. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Kindle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 25, 2024",
                "reviewTitle": "Random in death",
                "reviewText": "Gostei. Livro bom. Recomendo. No mesmo padrão do restante da série. Muita pena das vítimas e muito ódio do assassino.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mrs. S. Swann",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 23, 2024",
                "reviewTitle": "One of her best",
                "reviewText": "I will not say anything about the plot, read and discover for yourself!I started reading this book just after midnight and finished it this afternoon. Great way to spend the day. I will just say that many of the non-major characters are part of the cast and the murderer is a repulsive character. Twists and turns in the story and a furthering of the romance between two of my favourite people in the series.Looking forward to the next one from J D Robb in September!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aussie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 11, 2024",
                "reviewTitle": "Good Mystery",
                "reviewText": "Another entertaining read. Have to say, Eve Dallas did admit her tiredness in this book more than in previous books ! Maybe, like so many of us in the real world, she's feeling the effects of aging and working ROTFL. So interesting to see her character grow and evolve. She's a lot less prickly compared to the first book (and I liked her character back then too). Looking forward to the next story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sandra Ediger",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 10, 2024",
                "reviewTitle": "Another amazing in death",
                "reviewText": "JD Robb hits it out of the park with another amazing in death book. She always keeps you on the edge of your seat. She adds in humour and romance. If your looking for an exciting who done it with romance and humour you will love the in death series. They can be read stand alone but you will enjoy them more reading the series!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}