{
    "remaining_requests": 1045,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/The-Bandit-Queens-A-Novel/dp/B09YKSR6DG",
    "body": {
        "name": "The Bandit Queens: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/The-Bandit-Queens-A-Novel/dp/B09YKSR6DG",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41jUNomqjzL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Parini Shroff",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Parini+Shroff"
        },
        "brand": "Parini Shroff",
        "merchantInfo": "",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 3845,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "NATIONAL BESTSELLER GOOD MORNING AMERICA BUZZ PICK A young Indian woman finds the false rumors that she killed her husband surprisingly useful—until other women in the village start asking for her help getting rid of their own husbands—in this razor-sharp debut.\"A radically feel-good story about the murder of no-good husbands by a cast of unsinkable women.”—The New York Times Book Review (Editors’ Choice)Longlisted for the Andrew Carnegie Medal A BEST BOOK OF THE YEAR: Shondaland, She Reads, CrimeReadsFive years ago, Geeta lost her no-good husband. As in, she actually lost him—he walked out on her and she has no idea where he is. But in her remote village in India, rumor has it that Geeta killed him. And it’s a rumor that just won’t die.It turns out that being known as a “self-made” widow comes with some perks. No one messes with her, harasses her, or tries to control (ahem, marry) her. It’s even been good for business; no one dares to not buy her jewelry.Freedom must look good on Geeta, because now other women are asking for her“expertise,” making her an unwitting consultant for husband disposal.And not all of them are asking nicely.With Geeta’s dangerous reputation becoming a double-edged sword, she has to find a way to protect the life she’s built—but even the best-laid plans of would-be widows tend to go awry. What happens next sets in motion a chain of events that will change everything, not just for Geeta, but for all the women in their village.Filled with clever criminals, second chances, and wry and witty women, Parini Shroff’s The Bandit Queens is a razor-sharp debut of humor and heart that readers won’t soon forget. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Family Life",
                "link": "https://www.amazon.com/Family-Life-Fiction/b/ref=dp_bc_aui_C_4?ie=UTF8&node=11047977011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 14 minutes"
            },
            {
                "name": "Author",
                "value": "Parini Shroff"
            },
            {
                "name": "Narrator",
                "value": "Soneela Nankani"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "January 03, 2023"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09YKSR6DG"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,110 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #173 in Family Life Fiction (Audible Books & Originals) #220 in Crime Thrillers (Audible Books & Originals) #324 in Women's Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Sheila Gallagher",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKYSHFK55HR2DUBR4E2JZFIVHLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RNYN8ZC0G0ITT?ASIN=B09YKSR6DG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 24, 2023",
                "reviewTitle": "5.0 out of 5 stars Funny",
                "reviewText": "Geeta's husband has been gone 5 years. Everyone thinks she has killed him. She tells them she did not kill him, but they don't believe her. They come to her for advice and help on how to kill their husbands. She helps Farah kill Samir, her husband. She also helps the twins get rid of one of their husbands. She and Karem, the local barkeep, start to keep company with each other. But what would happen if the village found out Geeta was telling the truth?I found this slow starting but once I got into it, I howled it was so funny. These ladies lay down the truth left and right. Geeta was probably the most serious one of the group. She is an idealist. When she learns the truth of her wedding, she loses it big time. She does not trust herself but reigns it in. She knew something was wrong. When it all comes to a head at the end, the last big scene is farcical. I laughed so hard. Everyone got what they deserved. I loved that the women banded together. It was great watching them become one unit.This is a keeper. It so much fun by the end.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kari L.Kari L.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG666QKQBY26Y7CSQ5RPTLSTZFQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PR6LABSWOLPE?ASIN=B09YKSR6DG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 8, 2024",
                "reviewTitle": "4.0 out of 5 stars Great read",
                "reviewText": "“This was the version of her who had survived and there was no sense in apologizing for being a survivor.”✨✨Everyone believes Geeta killed her husband when he disappeared years ago. After realizing the benefits that come along with people believing you killed your husband, Geeta stopped trying to convince the town of her innocence instead taking advantage of the offered perks. That is until other women in the village come to Geeta to take care of their problems too. How far will Geeta go to protect her secret and the life she’s built?✨✨Shroff has written an entertaining and insightful novel. I was surprised at how well Shroff balanced dark humor with the heavier topics surrounding women’s lives discussed in The Bandit Queens. It was done in such a way that the book overall didn’t veer to far toward either direction. Although, I do feel that the ending sequence went a little too far into the humor side of things. It was interesting to see how the women in the loan group interacted with each other and how their relationships changed throughout the course of the story particularly between Geeta, Farrah, and Saloni. The different circumstances they found themselves in forced the women to reevaluate their relationships and the difficulties that lead them to where they were in life. One of the more poignant elements of the story came when Geeta had to learn that the consequences of her taking a stand fall on the individual she’s advocating for rather than herself. Overall, the story was well worth the read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71DuxxvjKML.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kat",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHO4UMFFH2374CAV7MP3HNZKO3EQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QYIPDH9R9IDK?ASIN=B09YKSR6DG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Parini Shroff is a writer to follow!",
                "reviewText": "I was so sad when this novel ended! The Bandit Queens is beautifully-written, witty, and insightful. I learned a lot about Indian culture and the oppression of women through Shroff's carefully crafted characters and descriptive scenes. There were a lot of Indian words I didn't know, but Shroff strategically uses context to bring the reader into the Bandit Queens world. Plus, because I read on my tablet, I was able to use the look up feature, which was helpful - most of the time. I was so enthralled with the women characters in this book that I couldn't wait to get to the point in my day when I could read more. Their nuanced friendships and support for one another was inspiring. I can't wait for anther book from Parini Shroff!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "tricia lea",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGA4ERTSEOM63TFGB54MXGUOTAVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SKE2IF6UKHY3?ASIN=B09YKSR6DG",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2023",
                "reviewTitle": "3.0 out of 5 stars A lot to consider",
                "reviewText": "I struggled with this zany, dark humor, novel that brings light to many cruelly staggering truths about the women of India. But I'm glad to have read it. At times, especially in the middle, the book dragged for me and I considered it for DNF. But I carried on because Geeta, the protagonist, was evolving as a woman becoming enlightened and powerful in a culture that denies women the basic rights of humanity. That a legend of a woman was her strength; Phoolan, inspired me as well.I stumbled with language, Farsi? terms, Hindu Rites & Celebrations, and caste culture specifics. But pushed on again because of Geeta.I also read this during Diwali, so that enhanced my interest.I will be in the lookout for this author's next book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ginger Russell",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFYETZTNENW7TJP4IUJ4VSI6NQEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYJV4CX0MQ37X?ASIN=B09YKSR6DG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2023",
                "reviewTitle": "4.0 out of 5 stars OK",
                "reviewText": "This is mostly about the maltreatment of women in India by their husbands and their bid for a better life. It takes place in a small village, where several women belong to a \"microloan\" group. They mostly use the money to finance their cottage industry type work, but in making payments on the loan, they use up most of the money they make and remain under their abusive husbands' control. The husband of the main character, Geeta, disappeared five years ago, and the rumor is that she killed him. She did not, but based on the rumor, her friends ask for help with their husbands. I thought the story was intriguing and a good insight into life for women in India. I guess my main problem with it is that some of the story is sort of unbelievable. There is a lot of profanity in the book, which is o.k., and also a lot of Hindi words which are not explained or defined by context in some cases.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer Cindy Lou You Know Who",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAMICAHSGS6TUEVJ25TPIK7ARJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32PLDR65XKAB1?ASIN=B09YKSR6DG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 17, 2024",
                "reviewTitle": "5.0 out of 5 stars Murder",
                "reviewText": "Such an interesting look at married life in a small town in India. The womens’ loan group learns to work together to succeed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Voracious Reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMYWI6ZOV2XA5NIVMU2L2BNUYBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DDC4QWHGPQHZ?ASIN=B09YKSR6DG",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on June 17, 2023",
                "reviewTitle": "4.0 out of 5 stars Great characters!",
                "reviewText": "The characters, the bandit queens, are amazing! Even the minor characters are well developed. I really felt for each of them as I read. Sometimes they elicited exasperation, sometimes sympathy, but they felt very real at all times. The only reason I gave four stars instead of five is that a few scenes toward the climax were a bit too busy, tried a little too hard, but the book is so wonderful I love it anyway! Read it for humor, empathy, good writing!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Terry ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2EJXESQCM7LUF745YCGLIGKBQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1NHKJCPO0OMA5?ASIN=B09YKSR6DG",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved this book!",
                "reviewText": "Dark and funny! This was a book club read for me and I'm so glad someone suggested it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Donna (G)",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 19, 2023",
                "reviewTitle": "Memorable laugh out loud book!",
                "reviewText": "Very enjoyable read, serious, laughable totally entertaining! I have so much to learn about the caste system in India. A book about sister hood at its best!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Corinne04",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on January 21, 2024",
                "reviewTitle": "An insightful & entertaining book",
                "reviewText": "I liked everything in this book: the characters, the plot, and the honest writing. I strongly recommend it. And the best aspect: the unfailing felling of hope.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazonian Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 10, 2023",
                "reviewTitle": "Dark humour and great characters",
                "reviewText": "The Bandit Queens is a darkly comic tale of women getting the upper hand over their useless, and often abusive husbands.Geeta's husband Ramesh disappeared five years ago. Gossip has it that Geeta did away with him, a rumour she doesn't deny as a fearsome reputation is useful to keep her safe in rural India. It does also means she is generally ostracised, until that is, one of the women in her loan group approaches Geeta for help in getting rid of her own husband.It's a pretty dark tale, set in a place where women are second class citizens, effectively the property of the men they marry, mere baby-making machines and servants to be beaten into submission. The humour is black as night and lifts the story when its very real themes of subjugation and powerlessness get heavy, transforming it into a page turning feminist revenge thriller.That isn't to say that all the men are bad and all the women are saints though. The characterisation is far more realistic than that. The women are often judgemental, bitchy and cliquey, although there is a sisterhood that bonds them. And yes, most of the men are violent or drunkards or both, but they aren't all depicted as feckless and evil, although the best that can be said of one of the better husbands is the dismissive comment \"I mean, Zubin snores, but you learn to live with it.”The Bandit Queens is a fabulous debut, that makes you rage and laugh and above all, root for this remarkable group of women.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mandy Reid",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on April 10, 2023",
                "reviewTitle": "Five Stars for The Bandit Queens!",
                "reviewText": "Bandit Queens was a fantastic read. One of my favorite reads this year. Entertaining, but also eye opening on issues of feminism, caste, and abusive relationships. The character development is fantastic, and each character has complexities which makes the story all the more interesting. Keeping this book forever!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah Gruber",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 18, 2023",
                "reviewTitle": "Anspruchsvoll und unterhaltsam!",
                "reviewText": "Der Schreibstil der Autorin ist anspruchsvoll - ich habe gut 50 Seiten gebraucht um mich an die komplexe englische Syntax und den feinen, trockenen Humor zu gewöhnen. Dann habe ich das Buch in einem Rutsch regelrecht verschlungen!!Nicht nur für Krimi-Fans, auch für jeden der sich für Gender-Studies oder Cultural Studies interessiert.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}