{
    "remaining_requests": 1305,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Jurassic-Park-Michael-Crichton-audiobook/dp/B00U7TZZRM",
    "body": {
        "name": "Jurassic Park: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Jurassic-Park-Michael-Crichton-audiobook/dp/B00U7TZZRM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51CPc-I0 vL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michael Crichton",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Michael+Crichton&search-alias=audible"
        },
        "brand": "Michael Crichton&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 25199,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 NEW YORK TIMES BESTSELLER From the author of Timeline, Sphere, and Congo, this is the classic thriller of science run amok that took the world by storm.Nominated as one of America’s best-loved novels by PBS’s The Great American Read“[Michael] Crichton’s dinosaurs are genuinely frightening.” - Chicago Sun-TimesAn astonishing technique for recovering and cloning dinosaur DNA has been discovered. Now humankind’s most thrilling fantasies have come true. Creatures extinct for eons roam Jurassic Park with their awesome presence and profound mystery, and all the world can visit them - for a price.Until something goes wrong...In Jurassic Park, Michael Crichton taps all his mesmerizing talent and scientific brilliance to create his most electrifying technothriller.Praise for Jurassic Park“Wonderful... powerful.” - The Washington Post Book World“Frighteningly real...compelling... It’ll keep you riveted.” - The Detroit News“Full of suspense.” - The New York Times Book Review Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b?ie=UTF8&node=720360"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thriller-Suspense-Action-Fiction/b?ie=UTF8&node=10159268011"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Action-Adventure/b?ie=UTF8&node=10159270011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "15 hours and 10 minutes"
            },
            {
                "name": "Author",
                "value": "Michael Crichton"
            },
            {
                "name": "Narrator",
                "value": "Scott Brick"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 12, 2015"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00U7TZZRM"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#551 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #5 in Movie, TV & Video Game Tie-In Fiction #10 in Action Thriller & Suspense Fiction #15 in Adventure Science Fiction"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Katie Dietrich",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEOCIIUVHC7G6YD5L7NXH3E7CYNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1EA134UWOWTK1?ASIN=B00U7TZZRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars Easily my favorite book",
                "reviewText": "A re-purchase since my old book fell apart due to reading it so much - that’s how much I love it! It’s great read that I pick up over and over again.Even though I watched the movie, there will still so many times I had no idea what was going to happen next due to how much the movie left out. In my opinion, the book is 100% better than the movie.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Summer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4V544CZ4LM3UEP5VXOWT4L3YBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RDF8DBSRUJXYV?ASIN=B00U7TZZRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars My Nephew loved it",
                "reviewText": "Purchased this as a gift for my teenage nephew. He loved the movies but he is also an avid reader and he was excited to learn That this Novel and The Lost world were the original basis for the first few films in the franchise. I enjoyed discussing the differences between the novels and films with him. It made for a great bonding experience.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Spinneretta",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEPBAFBVKOIYW2MKRQBEDBTB6QKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK79RTIJ2MNM6?ASIN=B00U7TZZRM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Good",
                "reviewText": "WARNING! Cliffhanger! This rated about a 4/5 on my trauma scale, because while it’s a good place to leave off, the ending really has you wondering.Scientists have done it, they’ve managed to clone dinosaurs from the Jurassic Era, and with the backing of some important people, John Hammond has managed to create his own park full of them.When concerns are raised, Dr. Alan Grant and Dr. Ian Malcolm are brought in to assess the situation, only they find way more than they bargained for.Ok this gets a 4/5 stars for two reasons: 1. The beginning. It started off quite slowly, introduced a lot of people and places, and was not nearly as gripping as when they finally reached the island because of it. I will say, however, that parts of the beginning are actually quite creepy, which made it interesting in between the introductions, but those first one hundred pages or so were less evenly paced than the rest. 2. The cliffhanger ending. Somehow I thought it’d actually have an ending, but it didn’t, so you’ll want to have the Lost World lined up.Now, this is actually quite different from the film. Hammond is a far more detestable figure, the kids are reversed in age, and a few characters are far more/less important than they were in the movie.That being said, the book’s pace picks up the minute they reach the island, and suddenly there is action- and a whole lot more adventures than were in the movie.It’s a gripping tale of scientific conceit, and the sheer ego that one man has (actually, more than one) in the belief that they can control nature.Ian Malcolm, was definitely the mouthpiece of the book, with numerous keeper quotes about the audacity of the scientists, while Alan Grant was the physical hero of the piece.Hammond, is the villain, and obnoxiously so; while the little girl Lexie, is the most frustrating and annoying character in the book (I was definitely wanting the T-Rex to eat her at times). I kind of liked the dinosaurs though!Apart from some strong language (understandably), and of course the situations, this is a book that will appeal to those who love a scientific thriller; I’d put it in the PG13 and advanced reader category if you’re wondering if it’s good for kids.A gripping thriller, that has withstood the tests of time quite well, and is a fascinating read for fans of the films.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Elie Roland LeMieux",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3M7G73QPQA7HJWIV7IKHZAXM5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R20IMWNE4AYPB2?ASIN=B00U7TZZRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars worth a read!",
                "reviewText": "This is so very different from the movie! The first few chapters were slow, but the book quickly became exciting and kept me wanting to read more.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael McDonald",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHFZXYRLGYB24XUVX4CTNJ6NAPQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3I463R99570E3?ASIN=B00U7TZZRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars excellent customer service",
                "reviewText": "The book arrived later than expected by over a month. The customer service rep was very pleasant and easy to work with. The book when it arrived was as described. We would definitely order from them again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra M.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELZPMCQ2TT6K4WQGG2ZLI72BDCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2A3KQUTMSH36?ASIN=B00U7TZZRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Jurassic Park the book",
                "reviewText": "Enjoyed the read. It was different enough from the movie that I found it interesting. It had a different twist to the characters.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sarah T",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH7CUNMAM4M5A6CJOFICF62YE6OQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2VDHK2C2BXKZ8?ASIN=B00U7TZZRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2020",
                "reviewTitle": "5.0 out of 5 stars Great for escapism",
                "reviewText": "The first time I read this book was somewhere around 1993-1995, when I was a teenager and well before I had taken any biochemistry or genetics classes. That was a very long time ago, and my memory of this book was probably warped by seeing the movie quite a few times in the years in between.Reading it through for the second time, as an adult, I find this book immensely fun, but there are some problems.The dinosaurs are genetically engineered to need L-lysine, so that if they leave the island, they won’t die. For them, it is an essential amino acid, so it is added to their foods. Guess who also must consume L-lysine because we can’t make it ourselves! That’s right, humans. All essential amino acids are readily available in meat, poultry, eggs, and dairy. Lysine is available in soy, black beans, quinoa, and pumpkin seeds, and chances are many more plants available to dinosaurs that made it off island. But, for the meat eaters, all meat has lysine in it… so I’m not really sure why this was ever thought to be a “good idea”. Michael Crichton with his medical school background surely must have known that lysine was an essential amino acid for humans, and while difficult, it isn’t top of the list for vegans to supplement like Vitamin B12.How DNA is talked about…. as a piece of DNA. Presumably, dinosaur genomes comprised a certain number of chromosomes, each species may have had different numbers, such as humans have 46, chimpanzees have 48, it is mostly the same stuff but split up on the different chromosomes. In order to “make a dinosaur”, or anything from a starting genome, you must have a way for that genetic material to replicate once you inject a genome into an egg that has had the original genetic material blasted out. You can’t just put in one long piece of DNA, you need sites to initiate chromosome replication, you need centrosomes and telomeres. A lot of times, these are very similar on different chromosomes, and assembling a whole genome takes a lot more effort than what was described here.Ugh... the thriller trope with a very young, attractive female scientist (24?) who is an expert in her field, while the male scientists are all mid to late 30s or 40s. And… she is given absolutely nothing to do. She is the only adult woman for almost the entire book (there are some adult women at the beginning). I know this was written at a different time, but geez this could have been better.“When you compared the DNA of man to the DNA of a lowly bacterium, you found that only about 10 percent of the strands were different.” Um nope. This isn’t true now, this wasn’t true in 1990 when this book was published, this has never been true. Some genes overlap, some DNA bounces back and forth between human (or animals) and bacteria, but the genetic material is VERY DIFFERENT in prokaryotes versus eukaryotes. Humans have close to 50% genes in common with a banana, last common ancestor 2 Billion years ago. Humans share around 80% of DNA with fish (last common ancestor 375 Million years ago), and humans share 98% DNA with chimpanzees (last common ancestor ). So… this 10 percent “different strands” is way out there, even if we were living in a world where dinosaur DNA could be obtained and then used to make some dinos. (This stuff erks me, just like typos in books.)All the computer charts and navigating menus… which makes up a big part of the book and hasn’t aged well. Velociraptors are attacking and a kid is trying to figure out what buttons to push to turn on the electric fences. I know this was supposed to be riveting climactic stuff, but pushing buttons on a computer just doesn’t get me on the edge of my seat these days.Anyway, I’ve decided to rate it 5 stars, because I read this during the coronavirus pandemic, at a time when I was feeling very nervous about an upcoming surgery, so I needed some escapism and this was a great book for that.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MDWG",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG74YYMUX4LYU3IRPESOR5OH5APQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3188J2JRYZ5EC?ASIN=B00U7TZZRM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Much better than the movie",
                "reviewText": "No dig at Spielberg, as much of a cinematic genius as he is he can’t capture the awesomeness of this novel. A classic of literature that definitely deserved a movie.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Willie G.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 30, 2023",
                "reviewTitle": "Best story ever",
                "reviewText": "Best!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Benjamin Sommer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 2, 2024",
                "reviewTitle": "Wunderschön und qualitativ perfekt",
                "reviewText": "Ein unfassbar schönes Buch. Die Seiten sind veredelt (Silber schnitt) und die allgemeine Qualität ist ein Wahnsinn. Ich kann es nur empfehlen",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tommy L-B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on January 19, 2024",
                "reviewTitle": "Ett måste för alla fans av filmen",
                "reviewText": "En riktigt bra bok som bör läsas av fans till filmen eller gillar dinosaurier.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "MaurícioMaurício",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 29, 2021",
                "reviewTitle": "Livro mais do que espetacular! nota 10000",
                "reviewText": "Eu amei esse livro! É espetacular e a entrega foi super rapida. Eu recomemdo, nota 1000.Ele tem muitas coisas diferentes do filme, óbvio né. É muito melhor que o filme, e olha q o filme ja é ótimo. O livro é bem mais \"sombrio\", o movie porém é bem mais \"family friends\".Estou maravilhado com ele e o disign é muito bonito.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/C1B6rkLsUbS.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Giorgia MerraGiorgia Merra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on December 21, 2023",
                "reviewTitle": "Jurassic Park Novel",
                "reviewText": "Il libro è arrivato senza alcun difetto di trasporto e secondo i tempi stabiliti, non vedo l'ora di leggerlo! (Lingua inglese).",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/713tdxf-AAL.jpg"
                    ],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}