{
    "remaining_requests": 1283,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Yacht-psychological-thriller-twists-perfect-ebook/dp/B0CDZS7C9K",
    "body": {
        "name": "The Yacht: The best new psychological thriller novel of 2024 with twists that will stun you, perfect for fans of The White Lotus and Lucy Clarke",
        "price": "$0.99",
        "originalPrice": "",
        "rawPrice": 0.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Yacht-psychological-thriller-twists-perfect-ebook/dp/B0CDZS7C9K",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/815gMvD34QL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Sarah Goodwin",
            "link": "https://www.amazon.com/Sarah-Goodwin/e/B092W4TMY3/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 351,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0CDZS7C9K"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Avon (January 4, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 4, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 1867 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 323 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#57 in Kindle Store (See Top 100 in Kindle Store) #2 in Crime Thrillers (Kindle Store) #2 in Vigilante Justice Thrillers #7 in Psychological Fiction (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 351 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Karen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQYGENLETUF7OG67JDTFZ4COT4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R290IHL5W8DEWJ?ASIN=B0CDZS7C9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars Mind blowing!",
                "reviewText": "Wow! This book had all the feels, the highs and lows. I felt I got to know very well the six people on the yacht. My hero was Hannah. She is the epitome of a very strong woman. She stood by and helped friends even though they laughed in her face. I read this book in two days! Could not put it down! This is the second book of Sarah Goodwin's I have read and it won't be my last!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RedRedtheycallmeRed",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNTJQIYP4XURO6VI6UK6ISNZAAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RU555VYWO9CA2?ASIN=B0CDZS7C9K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Who needs enemies when you have friends like this?",
                "reviewText": "I really enjoyed The Resort and Stranded from this author, so I was excited for this one and it didn't disappoint. Hannah has been friends with Libby and Mags since she was four, and it colors her view of them, she has a hard time seeing them for the shallow mean girls that they are. But once the yacht is set adrift, Hannah's blinders come off, and she's constantly trying to evade danger. The women are bad enough, but their husbands are even worse, the only ally Hannah has is her old friend Harry.Goodwin seems to like the theme of the everywoman fighting for survival. Part of me wished Hannah would have been a bit more ruthless, but realistically would she be so quick to turn on her friends or shut off her humanity? I love stories that make me ponder these questions.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Molly Georges",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDQEORW3XABCEV2OYKSHLXYXKLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36ZYEF7GEO40X?ASIN=B0CDZS7C9K",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "3.0 out of 5 stars Not a psychological thriller but good book",
                "reviewText": "Ok, only giving 3 stars because this is just a thriller, absolutely NOT a psychological thriller. It is a story of friendship, betrayal, classism, self acceptance, and survival. All good things but not as described above. Whoever wrote the description should switch departments. Aside from that it is a vivid story and fun read. It would make a great movie!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "glenda l.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGELPAVFVULF6L45CA5EWTELYEDA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RYXPFL5WV1PT4?ASIN=B0CDZS7C9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "5.0 out of 5 stars It's been a long time since an author got a 5 star review from me",
                "reviewText": "No time for boredom in this book, no need for skimming in this book. Half way through this book I was looking for her next book. Can't wait!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gali",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJF22KPY44WZGR5IIPXPAMMY5LA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Y39A1LNJ5D0T?ASIN=B0CDZS7C9K",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 5, 2024",
                "reviewTitle": "5.0 out of 5 stars A great read!",
                "reviewText": "\"The Yacht\" by Sarah Goodwin revolves around a group of uni friends who find themselves stranded at sea. I am a sucker for locked-room mysteries and books that take place on a boat, so I grabbed the book once I read the blurb. And, boy, what a ride!A group of friends from England, consisting of Maggie and her fiance Leon, Harry, and Hannah, come to celebrate New Year's Eve on Libby and her husband Olly's yacht, which is anchored at the Italian marina. All of them have made it big and are rich, except Hannah, who is stuck in a dead-end job and single due to unresolved issues. Maggie, Libby, and their partners look down on Hannah, the poor one in their midst.At first, the party is going relatively well, aside from some snide comments toward Hannah. The atmosphere becomes tense the more they drink and do drugs, and masks are removed. The plot takes a turn the next morning when they find themselves stranded at sea with no Wi-Fi, no food, and no fuel. While they try to figure out what happened and what to do, tensions rise, and secrets are revealed, tearing them apart. As they lurch from one disaster to another, \"Swim or sink\" becomes their new reality.I loved the book and couldn't stop reading. Sure, the premise isn't original; this trope has been done many times, but its execution makes it shine. The book is written in the first person from Hannah's perspective. She was a great character, one I could relate to and root for, which is more than I can say for the other characters. The other characters, with the exception of Harry, were insufferable and thought themselves superior to less fortunate people. I was glad when Hannah finally grew a backbone and didn't bow to her friends.I appreciate the writing and the way the story unfolded before my very eyes. The author made the characters and scenes come to life. There were surprising developments and turns, and although there were some scenes that required a suspension of disbelief, I could live with it.The setting was great, and I could feel the atmosphere as conditions deteriorated. The descriptions of the storm, the cold, and the despair were very realistic. The book explores various themes like bullying, toxic relationships, loss, and fear of getting close to someone and getting hurt in the process. The book is exceptionally well-crafted and compelling, and I found myself thoroughly caught up in the tale. Readers will be hooked until the very end, wondering where all of this is going. Full stars from me!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Debra C",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLFIFS7AXKE4ZUNSJ6G6NP2YE3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1TX2UD87RW1O0?ASIN=B0CDZS7C9K",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "4.0 out of 5 stars Well written, gripping, dramatic and hard to put down!",
                "reviewText": "With friends like these.....Hannah's friends are having a New Years Eve party upon a luxurious yacht in an Italian marina. Hannah is looking forward to partying with her friends, but upon arrival gets a frosty reception from some. As the night goes on, they drink, they argue, they strut their stuff, many show off their money, and Hannah feels out of place as she is struggling to get by while they are rolling in money.Money can't buy everything. Not when you are trapped and lost at sea.But not everything is as it seems. When they wake up the next day, they find that they are not still moored in the marina but lost at sea. Someone has cut them loose and none of them know how to pilot the ship.I loved the trapped feeling in this book. I also loved the drama. As they become worried about their situation, they begin to argue, place blame, secrets see the light of day, and some bully others. I loved the tension and the mounting sense of danger. Who will find them? Will their supplies run out?This was a juicy, gripping, and hard to put down mystery. I enjoyed the writing and how things played out. I thought Goodwin did a great job showing the anxiety in some of the characters, the arrogance in others, and how it dawned on each of them that they were in over their heads.This was a captivating and gripping tale of survival. Goodwin had me from the first chapter and my attention never wavered. I loved the pacing. There are no slow parts or anything that feels drawn out. This book also has a nice number of twists and turns and a reveal which I did not see coming!Well written, gripping, dramatic and hard to put down!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John or Rosemary",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Not my type of book.",
                "reviewText": "Did not enjoy the type of story line. But did finish the story",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RaeRae Kinsella Chippendale",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 10, 2024",
                "reviewTitle": "Superbly crafted story and a timely moral fable for these times of inequality",
                "reviewText": "Hannah had dreams, and an innate creative talent. As a little girl and an only child, she was thrown by chance two best friends who she would grow up with like sisters, Libby and Maggie. Sharing primary school, then all the growing pains and excitement of periods, boys, dreams of the future and university.But while little 4 years olds know only the equality, wonder and play of their friends, as the grew older, the stark contrast of opportunity between Libby and Maggies families wealth and status, and Hannah’s very ordinary parents and background would begin to bite. Hannah, through talent and hard work gained scholarships which, along with the other girls underachievement, complacency, and expectation of what their family position would naturally gift them , saw them still together at university. Harry, another ordinary background kid, started with them, but due to financial pressure, dropped out to work something practical in engineering & metalwork. As his rented house share was near the girls party grounds, he was still, as an ex boyfriend (of a week) of Libby’s, always a core part of the group.After that, well….. it’s a £250,000 inheritance and an aristocratic marriage for Libby, a director position in Daddy’s fashion empire for Maggie and…..Managing a call centre for Hannah to make ends meet as her great creative talent won’t pay the bills now her parents are gone (no big inheritance for Hannah)Even 10 years later, every New Years Eve, Libby throws an outrageously extravagant event for her childhood friends.This year it’s a super yacht! Hannah has to drive 12 hours to Italy straight from work to get there, stopping to catch a few hours sleep at a campsite in France. Now even Harry has hit the “big time” as a metal sculptor. Hannah has always held a torch for Harry as the only other member of the group who understands real life and struggle. Has he changed?She’s bought a designer dress from Oxfam not wanting to be looked down on and pitied. She at least wants to feel nice and a bit special for one night within her budget. Libby sent her a gift of new Dior shoes, so she already feels like a charity case.As soon as she steps up the gangplank, something is really “off”?",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "katie",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 13, 2024",
                "reviewTitle": "An enjoyable read",
                "reviewText": "I thought this story would be relatively light weight with its obnoxious characters showing off their shallow lifestyle but it builds into an interesting and twisted tale of misplaced values and trust.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John-PaulSanders",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 12, 2024",
                "reviewTitle": "Get that sinking feeling …..",
                "reviewText": "Another fantastic, gripping, thrilling read from Sarah Goodwin - in fact i preferred the pace and tautness of this book to the previous one “the blackout” and is one to add to the list of this authors fantastic reads. Recommend it to anyone, and looking forward to this summers release of “the festival”. Thanks sarah for another great story",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nick Goddard",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 12, 2024",
                "reviewTitle": "The latest of Sarah’s books…",
                "reviewText": "As always, Sarah leaves you thinking you know the outcome… but there is always a twist. This time, I guessed at about Chapter 13…She is brilliant… not sure where she gets her inspiration from… but it works. Keep it going, Sarah.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}