{
    "remaining_requests": 1159,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Finders-Keepers-Stephen-King-audiobook/dp/B00U7U0CJW",
    "body": {
        "name": "Finders Keepers: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Finders-Keepers-Stephen-King-audiobook/dp/B00U7U0CJW",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61AVVMPqnJL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Stephen King",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Stephen+King&search-alias=audible"
        },
        "brand": "Stephen King&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 38099,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "2016 Audie Award Finalist for Best Male NarratorA masterful, intensely suspenseful novel about a reader whose obsession with a reclusive writer goes far too far - a book about the power of storytelling, starring the same trio of unlikely and winning heroes King introduced in Mr. Mercedes. \"Wake up, genius.\" So begins King's instantly riveting story about a vengeful reader. The genius is John Rothstein, an iconic author who created a famous character, Jimmy Gold, but who hasn't published a book for decades. Morris Bellamy is livid, not just because Rothstein has stopped providing books but because the nonconformist Jimmy Gold has sold out for a career in advertising. Morris kills Rothstein and empties his safe of cash, yes, but the real treasure is a trove of notebooks containing at least one more Gold novel. Morris hides the money and the notebooks, and then he is locked away for another crime. Decades later a boy named Pete Saubers finds the treasure, and now it is Pete and his family that Bill Hodges, Holly Gibney, and Jerome Robinson must rescue from the ever-more deranged and vengeful Morris when he's released from prison after 35 years. Not since Misery has King played with the notion of a reader whose obsession with a writer gets dangerous. Finders Keepers is spectacular, heart-pounding suspense, but it is also King writing about how literature shapes a life - for good, for bad, forever. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Horror",
                "link": "https://www.amazon.com/Horror-Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=49"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 5 minutes"
            },
            {
                "name": "Author",
                "value": "Stephen King"
            },
            {
                "name": "Narrator",
                "value": "Will Patton"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 02, 2015"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B00U7U0CJW"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,009 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #34 in Crime Thrillers (Audible Books & Originals) #55 in Police Procedurals (Books) #63 in Literary Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Derek Valenti",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOWQRTQTAY6DO7T4Z54TX3NQN3A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3SSRN0BWVSK0M?ASIN=B00U7U0CJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 21, 2023",
                "reviewTitle": "5.0 out of 5 stars Good book!",
                "reviewText": "Good story line, about a man Morris who is absolutely obsessed with John Rothstein novels- especially his Jimmy Gold trilogy!! But Morris absolutely HATES the way he ended the trilogy…. With Jimmy selling out!This author has since retired and lives with his wife, writing in his journals.. But in these journals are actually sequels to this trilogy, unpublished and for HIS eyes only! What would have been books 4 and 5 of the series, along with about $20,000 cash is stolen from Mr. Rothstein in a home burglary, which turns deadly for him. Who killed him? you guessed it, Morris! So now he has his money, but that $20,000 is nothing compared to what these hidden journals are worth (to the right man willing to buy them on the black market). A friend of his, Andy, tells him that when things die down after this man’s death, then he surely can find someone to purchase these gems!! Only problem is, Morris is now going away for many years, due to convicted rape! So now he must hide his trunk full of journals (and cash ) under a near dead tree behind his old house!Hoping that it’s still there when he gets out…Enter Peter Saubers, teenager in high school, main character of the story. He moves into Morrises old house, and guess what he stumbled upon? You guessed it, The trunk! And he has actually heard of Rothstein, is a huge fan of his work, and happened to love the trilogy! But when he reads these last 2 books, he’s even more amazed ! He now realizes what literal GOLD he has on his hands!Also during all of this his parents are having financial (even some marital) problems, and so Pete starts anonymously sending random letters to his house addressed to his father, with mystery money in it, and does so for almost 2 years… until, one day…… it runs out and he sends his last envelope!Well it certainly did help his parents get back on their feet, and almost certainly saved their marriage! Which is good, but what kind of sucks, is now Morris is out of prison, and will be looking for all his things, but Peter doesn’t know this…… yet..Now he is looking for more money (not so much for his parents now) but for his younger sister he wants to be able to help put her into this nice school, but it’s a bit expensive. So he decides to do the unthinkable- part with some of his journals- and he KNOWS what he has, could potentially be looking at a million dollars!So he goes to the shadiest Rare Books Dealer in town, Andy Halliday! (Yep, Morrises old pal from right after the heist, who most certainly knows people who can afford so buy these VERY RARE finds). Peter knows he cannot go to just anyone- most people who knows what he has is Stolen property from a murder case, and will think Peter had something to do with it! So no police! So it’s Andy, or nobody!Except Andy was wandering where these journals went after Morris went into prison, and now he knows where they are! He attempts to blackmail Pete into either lowballing him EXTREMELY, or getting the police on the phone!But before he can continue with his plan, Morris comes in to save the day- and KILL Andy. Hey, what are friends for, right? So now all Morris has to do is rid himself of Peter, but not a second before he knows where these journals are ! Will he eventually come back into possession of these last 2 Jimmy Gold Novels? Or will he die trying?Tune in next week, for the conclusion of :FINDERS KEEPERS!…he dies…. Peter burns the books while Morris stands aflame burning together with his one true love: Jimmy Gold at last !Great storyline, a bit of a jump from the Brady Hartsfield from the First book, but Brady certainly doesn’t disappoint in the third!9.5/10 stars for me!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHRBBGX4JTC2UORGPD3NEY6AKBLQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZR3MKCVEGYYK?ASIN=B00U7U0CJW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2024",
                "reviewTitle": "4.0 out of 5 stars It's great.",
                "reviewText": "I wish Bill Hodges was more of a central character. Other than that, it is a great book. King gives a wonderful insight into the dark side of literary fiction.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Blue Eyes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFDVOUXEKZNRWDTH456RX7BXWJWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BMC3XYUZPGVE?ASIN=B00U7U0CJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 22, 2024",
                "reviewTitle": "5.0 out of 5 stars Pete Sauber’s father was injured when a Mercedes driven by Brady Hartsfield ran him over",
                "reviewText": "He was standing in line at a job fair, now he is hooked on pain pills and his family has had to move and his wife, a teacher, has had her hours cut. The family is in deep financial trouble and it is causing a lot of fights. Then Pete finds a trunk that was buried under a tree. The trunk contained cash and moleskin notebooks with unpublished works by John Rothstein, 2 of which continue his trilogy of books starring Jimmy Gold. He keeps the moleskin notebooks, reading them in secret, and mails his parents potions of the money every month or so, anonymously, until the money finally runs out.This “haul” was stolen and John Rothstein was murdered by petty criminal Morris Bellamy. Morris has been incarcerated since the robbery for a drunken rape after he had tried to approach his “friend” Andrew, to sell the notebooks and was rejected and was advised by him to hide them.37 years later, the money is gone and Peter’s sister wants to attend a private school, and Morris is out of prison. Peter chooses the wrong bookseller to approach to sell the notebooks, Morris’s friend Andrew. And Morris finding the notebooks missing from his hiding place, seeks out Andrew as the only person who knew he was hiding them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dori Owen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGMX5WO4KWOKAP6MXXUZ5IDAKABQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1IS4TR89BFLSX?ASIN=B00U7U0CJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "5.0 out of 5 stars The gang is back in Finders Keepers",
                "reviewText": "After reading Holly, I’ve gone back to read the Bill Hodges trilogy. I’ve just finished book two, Finders Keepers. I’m binge reading them so it’s been a seamless time spent with Bill, Holly, Jerome and his sister Barb, and now introducing Peter and his sister Tina who is Barb’s BFF. Creepily, Brady Hartsfield, Mr. Mercedes, makes a comeback role as well—but more on him later. Pete is the main deal in Finders Keepers, as he finds buried treasure (literally) behind his house in the form of a trunk filled with random moleskin journals of unpublished stories written by John Rothstein about the fictional adventures of Jimmy Gold, his award-winning character introduced in several books met with high praise and literary criticism decades earlier. After publication of these early books Rothstein disappeared in J.D. Salinger fashion, making his books cult favorites and Jimmy Gold a cult hero. There were rumors of more manuscripts stolen in a break-in at Rothstein’s home in the 1970s, where he was also murdered, but none appeared. The murderer and thief, Morris Bellamy, buried the manuscripts and some cash in a trunk behind a home in which he lived and promptly landed himself in prison in a blackout fueled life sentence. Such irony, but not, because this is the house Peter lives in today. And so the story begins. One great phrase (and there are many) King introduces in Peter’s house is “arkie-barkie” what the kids call it when their parents argue. Perfect. I mentioned Mr. Mercedes, Brady Hartsfield, comes back in Finders Keepers. When we left him in Mr. Mercedes, Holly had rendered him into a coma with Hodges’ Happy Slapper, another one of my favorites —a sock knotted with ball bearings at the bottom. But in King-like fashion, oh no, Brady makes awake type moves when Hodges visits someone at the hospital and looks in on him. A photo of Brady and his mother moves and Hodges is convinced Brady is faking. But, oh wait until the end and you get treated to some real Stephen King horror when Brady shows Hodges, and the reader, what’s really going on. Please, oh please, let it continue to End of Watch where I travel to next!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "KT",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3I4XU6BFK2WG4X3I2BIGWKYTTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R10D38PGUDBLJN?ASIN=B00U7U0CJW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 11, 2023",
                "reviewTitle": "4.0 out of 5 stars Another excellent book",
                "reviewText": "Wish we had more time with Hodges. Holly and Jerome are developing delightfullyStayed up late reading and immediately bought the next one which I am hoping is not supernatural as I feel SK is foreshadowing",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMQGH3FEYU7QDCPMFBQRKM43MPQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R34Z6V3R43X1UQ?ASIN=B00U7U0CJW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Unpopular opinion",
                "reviewText": "Reading the reviews I was expecting this book to be the worst of this great trilogy. Well I disagree! It was fantastic and my favorite!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "petra a",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 26, 2023",
                "reviewTitle": "loved it",
                "reviewText": "Enjoyed it more than the first, and so i know I’ll read the third and then after that his new one, Holly. Good character development between Hodges, Holly and Tyrone without being too campy. Loved the references to some literary classics and some that are fictional, to blend the two worlds and give the plot some relevance. It sets up well for the third in the series without too much foreshadowing!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 29, 2024",
                "reviewTitle": "Very quick delivery",
                "reviewText": "Book is brand new, looks great",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ravic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on September 2, 2023",
                "reviewTitle": "worth reading",
                "reviewText": "Not as thrilling as the first book, but absolutely worth reading and highly entertaining. I’m looking forward to End of watch",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Whoa Stop",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 15, 2022",
                "reviewTitle": "très bon polar - du Stephen King mais pas dans son genre habituel.",
                "reviewText": "fait partie d'une très bonne mini-série de 3 livres, qui peuvent se lire séparément. Mais c'est toujours mieux dans l'ordre : mr Mercedes, finders keepers, End of Watch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Italy on April 30, 2021",
                "reviewTitle": "Disponibile subito dopo il click",
                "reviewText": "Racconto avvincente, come spesso capita con S. King. Anche utile: si imparano molte espressioni in slang americano (in questo racconto ce ne sono tantissime). Alcune, non trovate sul dizionario disponibile con Kindle, bisogna dedurle dal contesto o da una ricerca sul web. Impressione comunque ottima.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}