{
    "remaining_requests": 1310,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-All-Little-Raindrops-Novel/dp/B0C3DZB8PZ",
    "body": {
        "name": "All the Little Raindrops: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-All-Little-Raindrops-Novel/dp/B0C3DZB8PZ",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/517nzNyK-fL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Mia Sheridan",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Mia+Sheridan"
        },
        "brand": "Mia Sheridan",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 17695,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "The chilling story of the abduction of two teenagers, their escape, and the dark secrets that, years later, bring them back to the scene of the crime.It’s senior-year spring break, and Noelle Meyer and Evan Sinclair have been kidnapped. Neither knows why they were chosen, only that they share a tragic past: Evan’s father got away with killing Noelle’s mother, effectively ruining her family when the death was ruled an accident.Despite the connection that should have made them enemies, the teens instead unite to face their other common denominator—their abductors. Noelle and Evan survive one sadistic circumstance after another, eventually making a harrowing escape. But every happy ending comes at a price…Years later, Evan, now a private investigator, revisits the crime when he learns it may be ongoing. He reaches out to Noelle for help, and they discover that the answers lie with a man known only as the Collector. To close their case and solve the ones that followed, Noelle and Evan must unmask this mysterious spectator—the only man who knows enough secrets to take their captors down. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Psychological Thrillers",
                "link": "https://www.amazon.com/Psychological-Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10491"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 51 minutes"
            },
            {
                "name": "Author",
                "value": "Mia Sheridan"
            },
            {
                "name": "Narrator",
                "value": "Jesse Vilinsky, Aaron Shedlock, Christopher Lane, Thom Rivera, Andre Santana"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 01, 2023"
            },
            {
                "name": "Publisher",
                "value": "Brilliance Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0C3DZB8PZ"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,659 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #84 in Crime Thrillers (Audible Books & Originals) #116 in Psychological Thrillers (Audible Books & Originals) #291 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "GraceGrace",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEYFFAS23EVFHC2JWJ75PPJVCUZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK9IQG481OICY?ASIN=B0C3DZB8PZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 15, 2024",
                "reviewTitle": "5.0 out of 5 stars An intense story from beginning to end",
                "reviewText": "A harrowing story about surviving trauma, moving forward to a new normal, and gaining closure.We first meet Noelle Meyer trapped in a cage, scared, starving, and weak. Shortly thereafter, she learns she is not alone. There is another person locked up in another cage, Evan Sinclair, someone her family knows too well - Noelle's father holds Evan's dad responsible for her mother's death. YIKES!! Is it a coincidence that they are caged together, or was there a specific intent behind it?Then there is the Collector. It isn't clear if he is the mastermind behind their capture, or if he has another role, but he seems to revel in the partnership the two form, and how they plot their escape.The plotline of this story is wild and so much more complex than just some sick men who get off harming others for their viewing pleasure. I won't even begin to get into it all, but all the side plots in this story - an affair, a pawn shop, a therapist - all eventually come together, and it is even more disturbing than what you may have thought.There is also a bit of a romance angle to the story - it is not flowery, more raw. The initial connection and how each character handled things made sense given their circumstances. Things are forced or rushed, but it all felt real.Overall, this dark thriller has plenty to keep the reader engaged. A real page turner and worth checking out if you are a fan of the genre.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71YXsBrvSYL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Buzy_reading",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3BVTC6JBRNVN6ERT4RQN5O3CZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BF9P6XBY255Q?ASIN=B0C3DZB8PZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 10, 2023",
                "reviewTitle": "4.0 out of 5 stars The sins of there fathers",
                "reviewText": "Someone is collecting people and putting them in cages. Taken from their homes and rented by wealthy men. Noelle and Evan were eighteen years old when they found themselves in a dark room living inside a cage. Caged next to the enemy. They knew each other. His father killed her mother. Rather than suffer for the crimes of his father they worked together. They found themselves part of organized crime.…The first part of the story is dark and twisted focusing on the survival of Noelle and Evan. It was an interesting read. There’s fear and uncertainty about why they were taken. It’s creepy and horrifying given they don’t understand what is happening. To call this a dark story requires digging deep into the psychological depths of what is happening to each of them and the toll it’s taking on there bodies. There’s more at play than just two people connecting by trauma.…It’s designed to read as a puzzle to solve. This read gave me Saw movie vibes. The Collector, The Players, and The Viewers. The unknown has become a deliciously wicked game. This was a puzzle worth completing. The tangled clues were difficult to decipher. It’s a tongue twister.…The story takes a turn in part two after they escape and try to rebuild their lives as free people. As was stated before more is at stake than them being abducted to live in cages and rented. Something far more sinister is at play. It’s a multilayered story embodying romance, mystery, trauma bond, secrets, and crime of passion. I enjoy blended stories combining various genres into one especially uniting the dark thriller genre with a lighter softer romance. Mia Sheridan writes a compelling dark story about two eighteen year old bonded together by trauma. That link ties them back to their fathers.…The narrators is comprised of multiple voice actors all bringing this story to life in a way that had me pleased. I’m an eyes and ears person who enjoys following along with the ebook. Having these talented voices in my ears was a great experience. I’ve grown to appreciate audiobooks especially when it’s a thriller or mystery. It’s second best to watching a movie.",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amends",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE5567PJCFXYHDB3CBLLVH3XQ2GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2Y3YIH2MGIN66?ASIN=B0C3DZB8PZ",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 1, 2024",
                "reviewTitle": "5.0 out of 5 stars amazing psychological thriller",
                "reviewText": "Even though as you read this book you thought how sick and twisted the tail was, it was impossible to put the book down. The twists and turns of the human brain and how people react to trauma is amazingly portrayed in this psychological thriller. I really was enthralled in the storyline as a whole and trying to put the pieces together all the way through. Some parts of the book were hard to read but in the end the pull of the thrill kept you going. This five star rating is well deserved and anyone who enjoys psychological thrillers and trying to solve the sickness of the human mind will love this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy LeGrand",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHDIMDJGE35DEPXUUVZDUICVNK5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4RU2EERYJYTI?ASIN=B0C3DZB8PZ",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 31, 2023",
                "reviewTitle": "4.0 out of 5 stars Mia really has found her niche with these thrillers!",
                "reviewText": "Mia's thrillers are quickly becoming some of my favorite works from her. The thriller trope is what I'm currently obsessed with, and this book kept me glued to the pages from start to finish.Noelle and Evan find themselves locked in cages, forced to do unspeakable things as part of some sick and twisted game. Who is holding them hostage, and why? Does it have anything to do with the fact that Evan's father killed Noelle's mother? Can they find a way to work together to escape this nightmare?Mia really has found her niche with these thrillers. Such a complex story with so many moving parts. I love trying to figure out the little clues layered in the story, who is behind the game, and why. For being teenagers, Noelle and Evan did a great job of figuring things out and secretly working toward a way to escape.Years later, they come back together to try once again to figure out who is continuing these sick games. That connection they had all those years ago is still there, but revelations rock Evan's world with something I did not see coming. There is some romance in this story, but it didn't feel like it was a central focal point, and I wish it had been expanded on a bit more, especially at the end.I admit I started getting a tad confused towards the end, because a central character's name changed a few times, or I should say it was revealed they had several names they went by, so I had to read parts over again slowly to fully grasp what I was reading. The pace really ramped up at the end and I was holding my breath, hoping everything worked out.I was happy with how it all turned out, although I do wish we got to see more of Noelle and Evan together at the end. Perhaps Mia will give us a bonus scene, or maybe these characters will pop up in her next thriller, that would be great!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dani Guerra",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 25, 2024",
                "reviewTitle": "What a good plot this book has",
                "reviewText": "This book was a great surprise this yes. I love Mia Sheridan's books but this I was not expecting anything from the story.The plot is interesting and has great surprises.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TheMummaStartup",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on December 18, 2023",
                "reviewTitle": "An absolutely poignant tale of human grit & courage interspersed with the dark alleys of human mind",
                "reviewText": "Sometimes you read books and sometimes you read a story that intrigues you from the start and connects its characters to your heart. The book is a dark thriller that shakes your core taking you through the dark alleys of human mind. Mia’s protagonists Novelle and Evan are both vulnerable and courageous, scared yet hopeful and must come together to confront the events from their past.Novelle and Evan are teenagers, poles apart from each other with a past that has shattered their respective families. But when Novelle finds herself caged, little did she know that Evan will be placed beside her in a cage. Together, they must endure to protect each other and escape as a whole! Year later when Evan finds about a similar crime, he reaches out to Novelle in investigating their abduction and escape.Emotions are unveiled, the scars are revisited and a twisted, dark side of the world we live in is revealed.This story is about the enduring power of human spirit while showcasing plunging into a horrific-expectations and emotions of human mind.The author Mia Sheridan has come strong with her writing, with a tight-captivating plot, brilliant characters each having their moments to shine through the book. By far, this is one of the most unique and gripping plot I have read in 2023 and any amount of appreciation can fall short for this book!!!I absolutely loved it!!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Christopher Hood",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 20, 2023",
                "reviewTitle": "Disturbing but ultimately a good read",
                "reviewText": "I got this book as part of Amazon Firsts, where you get a free book a month or so before the main release. For the second book in a row, compared to many books that I read, I didn’t highlight many parts of the text as standing out for any particular reason. In many ways I am pleased that I didn’t have much to highlight as relatable for the content is dealing with some truly awful behaviour and events.I think Sheridan handles the subject matter well, and it is generally not overly graphic. It tells you enough, while leaving the rest to your own imagination. But for anyone who has ever suffered any personal physical attacks, (I suspect that) this book should be avoided. You can read more about what the book is about from the blurb that appears with the book at retail sites.Here are just a few of the lines that stood out to me, he’d hoped to have a few more minutes to talk about mundane things. Sad things. Because it felt like they mattered too little now. And it felt like they were everything. Life had become a circle of conundrums, and he didn’t know how to make it make sense .I think we often overlook the small, mundane things in our lives and the valuable role they play in grounding us in some form of normality. He’d thought her plain at first, but that was before he’d seen the fire that made her glow from the inside. The one that made her beautiful .I love this description and the way that it emphasizes that what’s on the inside is such a key element of beauty. I also like the following description of the situation one of the protagonists finds themselves in; he remembered wondering if she would call him or email him. He wanted it, God, he did, and yet . . . at the same time, whenever he opened his inbox and realized she hadn’t, he breathed a small breath of relief. It’d been confusing as hell .The final quotation I have pulled out is one that probably sums up the book and what the protagonists go through as a whole, The things you could learn about yourself under circumstances you never imagined .Overall, I liked ‘All The Little Raindrops’. I’m not sure that I ever really figured out the relevance of the title to the contents and think that there were other titles that were more clearly linked to the storyline that could have worked better. When giving a star-review, I was on the edge between giving it 4 or 5 stars. In the end, I have to admit that reading that the author lives in Cincinnati, home of the American Football team that I support, helped persuade me to give 5 stars (although I have no idea what team, if any, the author supports).",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tracey",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 13, 2024",
                "reviewTitle": "WOW 🤯🤔😢🖤",
                "reviewText": "This book is amazing full of twists and turns and sadness but also of hope, when the truth comes out just WOW, but not everyone is who you think they are? Which keeps the book interesting a,oypt of sick f....... but with determination and a little help you truly can be set free.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Caila P.",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 2, 2023",
                "reviewTitle": "so beautifully sick and twisted",
                "reviewText": "Rating: 4.5Genre: Thriller, Dark mystery, romantic suspenseTwo things before the review: One, thanks to Amazon First Reads for this amazing title. I didn't get to finish it before it was published but I am still so glad to have been introduced to it. Second, please consider/read all the trigger warnings for this book!I don't have much to say because I think everyone should just read it and experience it for themselves, but seriously this book was sooooo sick and twisted and I can't even say in a really good way. It was more of in a really real way (which sometimes caused my heart to hurt) and the story was so intriguing through every moment.Well maybe not actually, because the only reason I docked it by 0.5 is because there was a little chunk in the middle where both the MCs were really recovering and healing and it was absolutely necessary to the story but compared to the rest of the action based story, it felt dull.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}