{
    "remaining_requests": 1050,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-The-Teacher/dp/B0CPTDJLYK",
    "body": {
        "name": "The Teacher",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-The-Teacher/dp/B0CPTDJLYK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41OYUFufbzL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Freida McFadden",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Freida+McFadden"
        },
        "brand": "Freida McFadden",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 13886,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Lesson #1: Trust no one.Eve has a good life. She wakes up each day, kisses her husband Nate, and heads off to teach math at the local high school. All is as it should be. Except…Last year, Caseham High was rocked by a scandal involving a student-teacher affair, with one student, Addie, at its center. But Eve knows there is far more to these ugly rumors than meets the eye.Addie can’t be trusted. She lies. She hurts people. She destroys lives. At least, that’s what everyone says.But nobody knows the real Addie. Nobody knows the secrets that could destroy her. And Addie will do anything to keep it quiet…From the New York Times bestselling author Freida McFadden comes a chilling story of twisted secrets and long-awaited revenge. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            },
            {
                "name": "Psychological",
                "link": "https://www.amazon.com/b/ref=dp_bc_aui_C_4?ie=UTF8&node=18289232011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 35 minutes"
            },
            {
                "name": "Author",
                "value": "Freida McFadden"
            },
            {
                "name": "Narrator",
                "value": "Leslie Howard, Danny Montooth"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 06, 2024"
            },
            {
                "name": "Publisher",
                "value": "Hollywood Upstairs Press"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0CPTDJLYK"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #1 in Psychological Thrillers (Audible Books & Originals) #1 in Domestic Thrillers (Audible Books & Originals) #1 in Psychological Fiction (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Buzy_reading",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3BVTC6JBRNVN6ERT4RQN5O3CZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA07RWH1DQ7YN?ASIN=B0CPTDJLYK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars Doing whatever you want",
                "reviewText": "At first it doesn’t come across as a student-teacher relationship. Freida McFadden slowly works her way to that point by introducing Addie a student who came back to high school after a scandal with her previous English teacher. Her return to school has been difficult. Her classmates have ostracized her and Kenzie has started bullying her. Addie doesn’t stand-up to Kenzie or tell the Principal. Nate her English notices and takes the initiative to make her feel special. He encouraged her to join the school newspaper. Addie wishes his wife was as nice as Nate since she’s in her math class. Eve isn’t nice like Nate in fact Eve doesn’t like her very much.…Freida McFadden tells the story from Addie and Eve’s perspective. It’s interesting that she chose those two characters one being a teacher and the other a student. Remember when I mentioned this is a student/teacher relationship? Let’s refresh. Nate and Eve are married. Both are teachers at the same high school. Addie is in Nate’s English class and in Eve’s math class.It’s freakin fantastic how Freida McFadden wrote this story into three parts. These parts helped move the story along. Excellent execution. When the story finally reaches the scandalous part I think finally something juicy to bite into. Usually I like to figure out the next move, but not in this case. I’m letting Freida McFadden tell her story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Marcy Sorenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW4MOTNLP5IDAACEQNJY5KVO5NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RK3WAYYIO5DSY?ASIN=B0CPTDJLYK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "4.0 out of 5 stars medium paced, twists and turns",
                "reviewText": "𝐓𝐡𝐞 𝐓𝐞𝐚𝐜𝐡𝐞𝐫 𝐛𝐲 𝐅𝐫𝐞𝐢𝐝𝐚 𝐌𝐜𝐅𝐚𝐝𝐝𝐞𝐧⭐️⭐️⭐️⭐️ 4/5Eve is married to Nate, and both are teachers at their local high school. Eve teaches math, where Nate teaches English. Eve is known for being a strict teacher, who not to many students like. Nate is the opposite, he’s loved by all the students, and is known for being the most attractive teacher. Eve and Nate’s marriage has been struggling for a while, and has become very routine.Addie is a trouble high school junior. She’s been ostracized and is being bullied by her classmates for an alleged affair that got a teacher fired. When Nate starts to be nice to Addie because he can see she’s really having a hard time, Addie develops a crush on him, then she starts to do things she shouldn’t do, until one time she goes too far.I enjoyed this, but I didn’t find myself at the edge of my seat like I typically do when reading one of Freida’s books.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cheryl E",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPJ5J2ZQY4FQK2N2W4PE3UTTZJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PTRECMT26SHA?ASIN=B0CPTDJLYK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2024",
                "reviewTitle": "5.0 out of 5 stars What a turn of events",
                "reviewText": "Like Wow, just WOW! The twist and turns involved in this book are outrageous. First Addie and Nathaniel have an affair.. his wife catches them kissing in his classroom. Then Nathaniel tries to kill his wife and bury her alive. Mrs. Bennett is a math teacher at the high school. She was obsessed with shoes.. high heel shoes. She keeps going to the store and buying shoes. Jay is the one that keeps waiting on her.. She has an affair with Jay. Now back to Nathaniel trying to kill is wife. That’s not enough. He talks Addie into helping him bury his wife. I won’t spoil the end. You’ll just have to read it yourself. Frida does such a great job and there’s more than one turn of events. Like I said, read it for yourself. You won’t regret it I read this book less than four days. That’s with two special kids trying to take care of them. If I can read it, so can you. HAPPY READING!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "NaturalScribe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHVFC72R3HFUYQPDS6WWF4T3R2MA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R219D3SC8J0FIR?ASIN=B0CPTDJLYK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Big Freida Does it Again",
                "reviewText": "I was not really sure what to expect from this book. I mean it’s Freida, so you already know she’s going to take you on a mind trip – you just never know which way the trip is going to go. The “not truly a twist” twist that everyone could see coming in the early part of the book was, as I say, expected; however, the things that happened after were not. The twist happened so quickly that I thought maybe I missed a couple of pages, —it felt like it was just thrown in there randomly. But as I scrolled back on my Kindle app, I realized I had not missed any pages. It just happened a lot quicker than I thought it would. Everything that happened after was really the impetus to continue reading something that I was initially ready to dismiss as wildly predictable. I’m glad it went the way that it did, and as usual with Big Freida, as she is affectionately known in some of the online book groups I’m in, you end the book thinking “wow she did it again.”",
                "reviewVotes": "10 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kaylee Conterez",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEBJUX6JJCD4FU2ECQJGKDNAJSPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OOA3Q5KB2X3B?ASIN=B0CPTDJLYK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "4.0 out of 5 stars so different from other fmf books!",
                "reviewText": "spoilers aheadi liked that the chapters were super short, i feel like even shorter than other books by fmf. made it really easy to read. i wasnt a fan of the fact that 100 pages in i didnt have much backstory on the characters which is a third of the book. i think that may be on purpose now after reading the rest for suspense but i feel like we barely know the characters.one thing i loved was that the MC actually found out about the people in her life betraying her BEFORE the last chapter of the book. i love a good revenge plot.the only thing that made me give the book 4 stars was the ending. i feel like it came too quickly & wrapped up and entire story in one chapter. then i feel like the epilogue i guess makes sense, but kind of stupid and makes the story pointless. so i just spent the whole book hating the man but shes just as bad? i mean yay for jaw dropping ending i guess but couldve done without that tidbit i think, personally",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "HeatherC",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH3543ASA7IRMGHS4I5YNTXO76Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2SMM92YAMEZ45?ASIN=B0CPTDJLYK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars When the twist has a twist….",
                "reviewText": "I discovered Freida’s books in 2023, and she became one of my few go-to authors — those you automatically buy and read when a new release comes out without even reading the premise.After finishing THE TEACHER in less than 24 hours, it shot to the #1 position as my favorite of her novels.Just as I was nearing the end, mentally preparing my review, a twist so unexpected grabbed me, and I had to back up a few pages to make sure I’d read correctly.Needless to say, I was left speechless and had to walk around for awhile just to begin processing it all.If you like your thrillers not-so-scary, with just a soupçon of suspense and a dash of WTF, I can’t recommend this book enough.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jade Crosby",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 9, 2024",
                "reviewTitle": "The Queen of twists",
                "reviewText": "I was so excited to download McFadden’s newest book and it did not disappoint. Definitely gave me some cringy vibes at first but the ending was on point. I love the twists and the characters and she never fails to connect everything and more. Can’t wait for the next one!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on February 15, 2024",
                "reviewTitle": "Didn't see it coming at the ending",
                "reviewText": "I have read each one of her novels and the author Freida does it always. Love her writing style and this story is no exception. From the beginning, I was hooked and couldn't put down the book. The story flowed really well. Definitely an amazing thriller!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Manu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 14, 2024",
                "reviewTitle": "Wild",
                "reviewText": "Anfangs dachte ich echt - puh das ist etwas vorhersehbar und zäh. Oh Herr lag ich falsch. Man braucht hier etwas Geduld, aber der Schluss ist wie immer eine 10 von 10. Habe das Buch in ca 2 Tagen (Trotz einem Vollzeitjob) Durchgelesen. Vielleicht schreibe ich deswegen diese Rezession nachts um halb zwei. Werde ich es morgen bereuen? Vielleicht, würde ich es für dieses Buch wieder tun? Auf jeden Fall!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Toon Fam!! 🤍🖤🤍🖤🤍",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "Another great read!",
                "reviewText": "I love Freida Mcfadden she's the queen of plot twists and psychological thrillers, head and shoulders above everyone in my opinion. This book was one I very impatiently waited for being released. I was not disappointed, the story runs smoothly as always then the cracks appear and suddenly there's chaos and you can't put it down because you need to know what's going to happen next. I always love the little plot twists as much as the big ones and that's why she's in a league of her own!! The characters were the usual mix of love them and love to hate them and the story was amazing and actually got pretty creepy at the end but I loved it",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Celine",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 7, 2024",
                "reviewTitle": "HOOKED",
                "reviewText": "This book had me totally hooked! If I didn't have mom duties, I would've finished it in a few hours, but two days isn't bad, right? It's an absolute page-turner from start to finish. The author had me gripped from the beginning, and the ending totally surprised me. Definitely a worthy 5-star read!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}