{
    "remaining_requests": 1042,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Survive-Night-Novel-Riley-Sager/dp/0593183185",
    "body": {
        "name": "Survive the Night: A Novel",
        "price": "$9.99$9.99",
        "originalPrice": "",
        "rawPrice": 9.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Survive-Night-Novel-Riley-Sager/dp/0593183185",
        "soldBy": {
            "sellerID": "A20CNJ5YMEEB6I",
            "name": "Prime 1 Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A20CNJ5YMEEB6I&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/4120mVtteHL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31Qv0dpb0XL.jpg",
            "https://m.media-amazon.com/images/I/51xaaJu497L._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Riley Sager",
            "link": "https://www.amazon.com/Riley-Sager/e/B071D6HYJK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Prime 1 Books",
        "customerReview": "4.0 out of 5 stars",
        "customerReviewCount": 8606,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 15 hrs 9 mins",
            "FREE delivery February 28 - March 1 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Dutton (August 30, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 352 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0593183185"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0593183182"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 9.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.39 x 0.73 x 8.24 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,503 in Books (See Top 100 in Books) #426 in Murder Thrillers #870 in Psychological Thrillers (Books) #1,643 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.0 4.0 out of 5 stars 8,606 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Jennifer Finken",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQLFZPZFGFTRM7OSGEAJCRDMJ4Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1UTW4YR33VJPR?ASIN=0593183185",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Really good book",
                "reviewText": "I loved this book! It was so good for being something supposed to be set all in car. Not so and there was so much depth for the characters and some insane, unexpected twists and turns. Omg so good!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gabrielle Grosbety",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE7SSTEEZR2FASCUQT3DFUUOUAQQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R19BORXMWNBG4J?ASIN=0593183185",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 18, 2022",
                "reviewTitle": "4.0 out of 5 stars Brimming with neon-tinted, 90s nostalgia and a good old-fashioned unreliable narrator",
                "reviewText": "3.5 stars rounded up ☆“Charlie’s tempted to tell him everything. The darkness, the close quarters, the warmth—all of it sustains her confessional mood.”The lights go down to reveal a night plunged in darkness and nervous, charged expectancy for what is to come. Perhaps a cinematic night is about to unfold with the potent color, music, and nostalgia of the 90s, which Riley Sager captures moodily and richly in all its overwhelmingly neon-tinted, climactic glory. Once the scene is set, Charlie, our protagonist and certified movie aficionado, is looking for a ride back to Ohio where she can escape the suffocation of the past and her guilt that haunts her like a persistent ghost always waiting in the wings to attack. Her best friend, Maddy, has recently been killed by the Campus Killer, and she shoulders a majority of the blame for throwing out words she doesn’t mean in a heated moment of no-return and leaving her in a time of need.So, not being able to wait a second more, she ventures to the ride-share board in hopes of finding someone to take her home to where Nana Norma waits and they can get lost in a movie-induced haze to forget their troubles. Enter in Josh Baxter, with his mega-watt, killer (could this be literal or figurative?!) smile and Olyphant Sweatshirt, which must promise safety if he’s associated with Charlie’s university, right? As luck would have it, he’s headed in the same direction and is willing to drive her to her destination, but, you guessed it, their trip predictably gets madly side-tracked along the way as we’re led to question if Josh is truly who he says he is or in fact the infamous killer on the loose? Will either he or Charlie see the light of day? The darkness holds you captive as spectator, as it houses secrets and encourages confessional outpourings.“That’s the best way to describe daily existence, with its endless parade of drudgeries and disappointments. In real life, people don’t break into song. They don’t battle space monsters. And they certainly don’t unwittingly get into the car with serial killers.”And throw in the fact that Charlie becomes an unreliable narrator who can’t tell the fiction of the movie scenes she creates in her mind, blacking out à la Norman Bates, and reality apart. This part for me got muddled because it felt maddening rather than an added interesting layer to the story because of how wildly it swung in many different directions that felt too self-referential and frustrating to decode as reality completely folded in on itself. I lost truth where I needed it, which perhaps was part of the point, but, at moments, it went a smidge too far. There were also unbelievable tonal shifts in certain scenes that made it hard to understand why certain characters acted in certain ways or made certain decisions in specific moments, specifically Josh and Charlie. However, I didn’t find Charlie nearly as gullible and insufferable as Lora, the narrator of Cover Story, the last novel I read, even if she naively still stumbles into a stranger’s car when the Campus Killer is in their midst. She does question and second guess for longer periods of time, unlike Lora, who just accepted and trusted pretty mindlessly.“And if Charlie’s learned anything from the movies, it’s that few things are more dangerous than someone with nothing to lose.”All in all, it was still a thrilling ride of cat-and-mouse, menacing predator and challenged prey, gaslighter and gaslightee, even if the latter half of the story lost some of the momentum that the exciting beginning had promised. I just wonder who you’ll wind up trusting. When trust can be few and far between in these loaded moments and ongoing swells of emotions that have the ammunition of Josh’s car speeding recklessly through the night, threatening, in reverse fashion of the usual expression, that the devil you do know, contrarily, may be worse than the devil you don’t.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Edward",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZ5IYXXO2TYP25TNGCBBUJLQSNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZYOLVZQLY3PP?ASIN=0593183185",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 9, 2021",
                "reviewTitle": "3.0 out of 5 stars Review of survive the night, spoiler alert!",
                "reviewText": "This was my first book by this author, which I came across looking for a slasher/psycho horror story. The promised plot sounded intriguing: a young woman takes a ride on a 6hour trip with a stranger who might possibly be a serial killer. In the early 90s, when cellphones weren't popular with the masses and smartphones that could receive and send texts, photos, and share location didn't exist. Stop reading here if you don't want spoilers.I have to say, the book did deliver on that promise, at least until the diner plot twist. I could excuse Charlie willingly going with Josh to the car despite the presence of a police officer in the diner, because she was afraid for Marge and wasn't exactly the best decision maker in the story. Taking dumb decisions was already in character for Charlie. What I can't excuse is the plot twist the author added once Charlie went back to the diner.When Marge tied up Charlie, I was excited. I thought, either Charlie is the unluckiest woman in the world to come across two different psychopaths, or Marge is the aunt Josh briefly mentioned in the car ride. The latter would have been a great twist. Instead, it turns out Josh was just a bounty hunter hired by the grandmother of Charlie's dead best friend. Couldn't Marge just have gone to the Olyphant dorms herself and question Charlie? That would have been simpler, less psychotic, and less risky than hiring some guy who WORKS FOR THE POLICE AS A FREELANCER!The reveal of the actual killer didn't make any sense either, it felt too convenient to tie the story in a neat little bow. The story would have flowed better if Josh had remained as the killer-he certainly acted like one the entire ride.To add insult to injury, Charlie marries the guy who kidnapped her in the first place. Talk about sending a bad message. I was going to buy a copy for my sister as a warning of being careful with strangers, but I changed my mind.3 out of 5. Solid start, but the story took a wrong turn halfway through that made me shake my head in disappoinment.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doc",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAHAOPOXICL4RNTMVHJ4NL5C24Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RO5W9BR01TGR7?ASIN=0593183185",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 10, 2024",
                "reviewTitle": "5.0 out of 5 stars Intense page turner",
                "reviewText": "You think you know what's happening but you have no idea up until the very last page.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEQG5UHXCETVRKQVYHZ6GP745K4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN7MPJO3X51V0?ASIN=0593183185",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 15, 2023",
                "reviewTitle": "4.0 out of 5 stars Great start, so so ending.",
                "reviewText": "This was my third book by Sager so by now I knew what to expect. Great story, great scenery, good characters, twists galore and so so endings. I want to say that I did enjoy this book for the most part. I was about 90 percent of the way through before I got disappointed.The story is that a movie obsessed college student, named Charlie, is leaving her college due to a string of murders that have occurred. She takes a ride home from a stranger. Over the course of the ride she becomes more and more suspicious of the drivers true nature.As I said in the beginning, Sager knows how to set a scene. So many times while reading it felt like I was actually there. Like every Sager novel, there are twists. A few that I could spot from the beginning and a few that surprised me. Overall it’s a solid 4/5. Maybe not as strong as “the last one left”, but still good. The reveal of the killer seemed a little too convenient but overall I enjoyed the book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jayme Brown",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAAB4SXQOBW5ZNZFNRAPPYBJM3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R193LL4NLSO8Q?ASIN=0593183185",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Sooo good!",
                "reviewText": "This is one of the best books I’ve ever read. So gripping and it felt like I was literally in the passenger seat it seemed so realistic. I’ve gifted this a few times as I enjoyed it so much.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hilary",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 26, 2023",
                "reviewTitle": "Amazing",
                "reviewText": "I have yet to be disappointed with any of Riley Sagers novels! I bought one, read it in 2 days then bought every single other one of his books! If you like mystery thrillers that have a great plot twist at the end then you will enjoy all of his reads! Highly recommend!!!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cliente Amazon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on March 20, 2022",
                "reviewTitle": "Unputdownable. Page-turner. For film buff.",
                "reviewText": "What a ride. It kept on the edge of my seat the entire reading. I kept guessing who was the killer, although I found out before the end, this is one of my favorite from Riley. One of my favorite parts about this book was the mentions of the movies and its dialogues as well as the actors. I really felt like I was in 1991, even though I was born in 1997. Anyway, this is a book for fans of film noir.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "TRACY",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 1, 2024",
                "reviewTitle": "Overall",
                "reviewText": "Product was as described. In perfect condition and on time. Excellent",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kirsty Carson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 7, 2023",
                "reviewTitle": "Twists and turns you’ll never believe",
                "reviewText": "Well this was a rollercoaster of a read. One minute I liked it, next minute I hated it, then I loved it! Sager definitely knows how to pack a punch when it comes to creating unease, tension and suspense. I hated the main character but to a certain extent Charlie wasn’t written to be loved… and this book isn’t your average thriller! I will be thinking about this story long after I finished the last page and that in itself is why I think it was a great read.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Patrícia Contreiras",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 22, 2023",
                "reviewTitle": "Eh",
                "reviewText": "Not the best.I’ve read other books from the same author, which was the reason I bought this one. However, the more I read this title, the more I noticed the similarities between the main characters - always a woman, always naive, always a victim in every way.It made me see the author in a different light and now I’m not sure I can’t bear the book (or him. And yes, it’s a he and not a she, the author). I stopped half-way and I’m trying to get back to it just to finish it and properly complain haha. Pardon me.There are also a lot of moments when the female character digresses and just trips hardcore in her unusual “movie blackouts” condition. That gets very boring after the first time.My opinion is: if you’ve read two books from Riley, that’s enough. (Read the haunted house one, it’s by far the best and the one with best reviews anyway.)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}