{
    "remaining_requests": 1234,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Spy-Coast-Thriller-Martini-Club-ebook/dp/B0C2F4V6BM",
    "body": {
        "name": "The Spy Coast: A Thriller (The Martini Club Book 1)",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Spy-Coast-Thriller-Martini-Club-ebook/dp/B0C2F4V6BM",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/916AUySylhL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Tess Gerritsen",
            "link": "https://www.amazon.com/Tess-Gerritsen/e/B000AQ4IHU/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 53895,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C2F4V6BM"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Thomas & Mercer (November 1, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 1, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4646 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 341 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 0857505203"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#92 in Kindle Store (See Top 100 in Kindle Store) #1 in Espionage Thrillers (Kindle Store) #1 in Espionage Thrillers (Books) #2 in Murder Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 53,895 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/sota/ae0481a9-5250-4045-8898-4f9f797d3c39.__CR0,0,970,300_PT0_SX970_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6J3DEQUBKMTGQP625DYJQ2ABZQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R21UHG9BJ2OSO0?ASIN=B0C2F4V6BM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 5, 2023",
                "reviewTitle": "5.0 out of 5 stars 5 STARS, INTENSE DRAMA, MURDER, KIDNAP",
                "reviewText": "Tess Gerritsen definitely earned all 5 STARS for this fast paced well written nail bitter storyline. This is my first time I have read this author but I eagerly look towards March 2024, when Book 2 of Series: The Martini Club is scheduled. This book has a good BLURB.We find ourselves in Purity, Maine with Maggie Bird out chasing down a fox who has killed several of her prize blue egg laying chickens. In just a short time she gets a strange woman who breaks into her home, which is covered in high def security cameras in all directions and her home is located in a place on a hill where one can see in all directions. To add to this stranger's visit, someone tries to shoot Maggie while out at her chickens & shatters her farm vehicle's windshield & flattens the tires with some high powered shots as Maggie hit the wet ground laying in some where her bucket had been shot full of holes. Further, her stranger had been returned, but had been obviously tortured & was shot in the head with 2 bullet holes and had been delivered to Maggie's driveway and deliberately put on her back, so she would be found that way.You would say to the average person, my god, what on earth have you been into? Then we come to find out that Maggie Bird is retired 16 years from that good old friendly American Agency the CIA. Going on there are 4 more retirees of that agency albeit from different years & departments in the same town. Needless to say they are looking at each incident with all their expertise which is confusing the police chief, acting officially Jo. She is 34 years old, single, a native of the town for generations, & her father is waiting for her to get married. (No prospects in sight, yet!) cAll of this is interesting & exciting! The places around the world that are described are wonderful; but things get complicated, emotional, conflicted, & sad. There is murder, travel, kidnapping, friendship, laughter, cooking & dining, making love, and coming to know one's self. Intense drama.I agree with some of the reviews I have read the characters need to be fleshed out more. Maybe let Jo take that night off to camp out in the snow with her dog up in the mountains & maybe she will meet a love interest in some way. Hint hint Tess. Hahaha Although I am sure These already has that under control & doesn't need my hints.So, if you are looking for an unusual page turning mystery this is it. I opened it up and haven't stopped because I'm writing the review. I cheered some characters on & hope for good things maybe to develop between them in Book 2 and others like the detective from the state police, please, yes, met my share of him. Then I didn't hate all the so called bad people.Maggie Bird & The Martini Club, I look forward to seeing them again in March to see what trouble they might have found themselves into.RECOMMEND",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Greg Barlin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFI2W7BQ6OCK26MJFZPU6FNYJG5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1BXCT93JDUF83?ASIN=B0C2F4V6BM",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 8, 2023",
                "reviewTitle": "4.0 out of 5 stars If you liked Killers of a Certain Age...",
                "reviewText": "You know that thing that seems to happen every few years in Hollywood, where in the span of a few months 2 or 3 movies come out with almost identical themes? I'm thinking Deep Impact and Armageddon, for example. Well, the world of books is having an \"Armageddon Moment\" when it comes to spy/detective novels featuring retirement-age main characters. The runaway success of The Thursday Murder Club probably helped plant the seed that badasses in their 60s and 70s make for compelling main characters. That, in turn, probably helped get Killers of a Certain Age off the ground. I liked both of those quite a bit, and so when I read that the plot of The Spy Coast was about \"a retired CIA operative in small-town Maine (who) tackles the ghosts of her past in this fresh take on the spy thriller\", I couldn't resist seeing how it would compare, even if I rolled my eyes at the \"fresh take\" characterization.Our main character in The Spy Coast is Maggie Bird, who has settled down in the small town of Purity, Maine. After an operation went south with devastating consequences for Maggie, she left the CIA and wandered for years, trying to put the pieces of her life back together. When old agency friends reached out to tell her about the small off-the-radar collective they had started -- a group of 4 of them had settled in Maine, and there was a farm on the market that would be the perfect opportunity to make it a quintet of ex-spies -- Maggie decided it might be time to settle.She's established herself in Maine and grown accustomed to her farm-first life, tending chickens and living quietly, when she returns home one day to find a woman waiting in her kitchen. The woman is with the CIA (ostensibly), but not someone Maggie knows or has heard of. And she has a chilling message: Diana Ward, a former colleague of Maggie's, has lost contact with everyone, and they need Maggie's help finding her. There are two problems: the first is that Maggie hasn't seen Diana in sixteen years, when the last op they worked drove both from the agency; the second is that Maggie would be more than happy if Diana simply turned up dead.Unfortunately for Maggie, a simple \"no\" will not suffice, and through a series of events she gets coerced into locating Diana (of course -- otherwise this would be a pretty dull book about chicken farming in Maine). Interspersed with the present day plot are also a series of flashbacks to Maggie's time with the CIA, and specifically to her involvement with what was known as Operation Cyrano, the \"op gone bad\" that forced her out of the agency.The story moves along at a steady pace, and while the plot is not a barnburner that will keep you up until the wee hours, it is consistently compelling. The flashbacks are important to set the table for the current conflict, but I actually thought they dominated too much of the story. I'd estimate that fully half of the chapters are flashbacks, which is fine, but they caused too much disruption in the main story and plot for my taste. On a positive note, they did allow Maggie to become a more fully realized character, one who we could see at different stages in her life.Inevitably, I have to compare this to Killers of a Certain Age, the novel I read this year that it most closely resembles. Given the subject matter (and title), The Spy Coast is surprisingly light on spying. It's more of a mystery with a sprinkling of spycraft versus a story in which a series of spy-related ops are executed, which was more the approach taken in Killers. I preferred the pacing of Killers, but the focus on plot left too many of the characters underdeveloped in that novel; conversely, the multi-stage look at Maggie in the past and present created a more fully realized character in The Spy Coast. If I had to only recommend one, my vote goes to Killers of a Certain Age, but it's pretty close, and I liked The Spy Coast enough that I will likely read the sequel once it's published.",
                "reviewVotes": "35 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hillel Kaminsky",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFAFKB6VOWV5JYAZO77MTFCYOBDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R5FS4Q36EHZ1I?ASIN=B0C2F4V6BM",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars Retired Spies are Still Deadly",
                "reviewText": "Maggie, a retired CIA operative, moved to a small, quiet town in Maine where some of her retired agency friends live. Out of the blue, a woman shows up at Maggie’s chicken farm and requests her aid locating someone that Maggie does not like. Maggie has no clue where this woman is but the dead, tortured body of the woman who requested her aid shows up one night in Maggie’s driveway.Maggie is haunted with the memory of a mission that went wrong and over the course of the story we learn about the events leading up to it, and how profoundly it has affected her. Together with her friends the retired intelligence agents, she pieces together the reason why this old mission is suddenly so important and travels far and wide to learn the truth. Along the way, she and her friends are in danger, but they seem to meet it with tremendous aplomb. Maggie’s enemies will learn that a retired spy is still a dangerous foe.This is one of the first book by Tess Gerritsen that I have read but it will certainly not be my last. I loved her writing style and the characters were top-notch.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "canadianreader",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on November 11, 2023",
                "reviewTitle": "SPECTACULAR! Worthy of all the stars!",
                "reviewText": "“No matter how old we are, there are always adventures ahead for us.” —Tess GerritsenI was initially drawn to the idyllic, peaceful, crisp, and clean recent snowfall depicted on the cover, hooked immediately by the engaging characters, and then stayed for the addictive tension and suspense that played out to the last page. I want to stand on a street corner on a box with a loudspeaker in my hand and tell everyone about this book!Synopsis:“Maggie Bird has lived many lives and many lies, right across the globe. Finally, she gets to hunker down in the bucolic town of Purity, with nothing but her chickens and her ‘Martini Club’ friends to keep her company. But her past is about to come back to haunt her when someone delivers a dead body to her door.Maggie and her ‘book club’ swiftly revert to espionage mode, burning a trail from London to Bangkok to Milan to stay one step ahead of those who want former agent Bird dead. Maggie knows that some parts of the past refuse to stay buried. And that sometimes an old spy must give up her ghosts.”Why I ABSOLUTELY LOVED this introduction to a new series:The peaceful shore of Purity, Maine is the perfect 𝘀𝗲𝘁𝘁𝗶𝗻𝗴 as it provides a stark contrast for the upcoming chaos. The village is a “personal DMZ” for a certain group of retirees who just want to be left alone. They have an ordinary life, doing ordinary things and that’s why they chose to live here. This quietness and ordinary life also lulled me into a false sense of relaxation, making the ‘driveway event’ and the ‘RTV’ event at Blackberry Farm that much more powerful. The traveller and amateur foodie within was excited at all the globe-hopping and food references, too. We just never know who is living on our quiet, residential street!I loved the 𝘀𝘁𝗿𝘂𝗰𝘁𝘂𝗿𝗲; the story wasn’t told in a linear fashion. The flashbacks revealed a little more of the characters at just the right time. Doling out the information this way kept me interested. I always needed to know more and it kept me invested in the story.The 𝗰𝗵𝗮𝗿𝗮𝗰𝘁𝗲𝗿𝘀 are phenomenal. Every. Single. One. Of. Them! Perfectly crafted. Margaret ‘Maggie’ Porter’s story is the only one told in first person POV and it’s easy to see why I immediately connected with her - I was able to get inside the mind of a CIA operative. The other silver-haired members of ‘The Martini Club’ are just as interesting; they’re all running away from something and they’re all unassuming retirees with secret past lives. I can’t wait to hear more of their background in future installments.“That’s what we must learn to deal with: Our place in a world that sees us as used up and irrelevant.”The 𝘁𝗵𝗿𝗶𝗹𝗹𝘀 provided by the foreign operatives, elusive Russian sleeper cells, intercepted messages, and the mysterious Operation Cyrano backstory were a perfect blend of paranoia-inducing drama and secrets. Gerritsen skillfully crafted layers of suspense, conspiracy, twists, betrayals, manipulations, moles, and snitches - it was PHENOMENAL. She kept me guessing, wanting to uncover the truth and get to the bottom of what happened during Operation Cyrano, but I couldn’t pull ahead of Maggie!I loved the messages about trust and honesty and appreciated the breaks in the tension to laugh at references to tourist t-shirts or revel in a wonderfully crafted romance.You may remember her from her books to TV series, Rizzoli and Isles - she’s upped her game and the suspense, intrigue and double-crossing in this book is exciting. Her investigation into the dark side of intelligence work is wonderful, making it a series you’ll want on your radar.I was gifted this copy by Thomas & Mercer and NetGalley and was under no obligation to provide a review.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Hilary Duerr",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 8, 2024",
                "reviewTitle": "excellent beginning to the series",
                "reviewText": "Really compelling reading with twists and turns. I hope the next book will be just as exciting",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2024",
                "reviewTitle": "What a great read",
                "reviewText": "I have read most of Tess Gerritsen books especially the Rizzoli and Isles books which were amazing. However the books after that definitely lost the plot and I decided not to read any more. But and this was a big but I thought ok just one more and thank goodness I did. What an amazing book. Normally I do not like books that flip back and forth but this somehow worked and I could have sat and read this without moving it was so readable. Everyone who has commented have played out the plot for anyone to read so I will just say judge for yourself but I really really recommend this fantastic book.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "preeta chagpreeta chag",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 17, 2023",
                "reviewTitle": "Highly recommended and a super page-turner",
                "reviewText": "Rating: 5 starsHighly RecommendedTess Gerritsen has penned a super page-turner. The first chapter pull you in; by the second, one is completely hooked.‘The Spy Coast’ is the first in the Martini Club series featuring a former spy and ex-CIA agents.Former spy Maggie Bird is residing in the seaside village of Purity, Maine, the past behind her, a mission which was successful but tragic. She is living the life of a resident on a chicken farm, but is always apprehensive of the former years coming back to haunt. A history which forced her to an early retirement to this discreet life.But the past always catches on. Comes back to haunt and terrorise. Opening up the not-so-healed wounds and memories creating an intense drama of suspense, fear, thrill and action.A woman, possibly CIA, comes to question her one fine day and is found dead the next day in Maggie Bird’s driveway. And the drama unfolds. She is aware that the enemies of yesterday are back for vengeance, and begins a series of events propelling a chilling escape, and the past confronting the present.In Purity, Maine, Maggie Bird is surrounded by her four former friends (all ex-CIA), who are out to prove their relevance and determined to protect their friend, Maggie from murder.The book begins in Paris and travels to Maine, London and Bangkok in pursuance of life and death. Maggie Bird’s yester life of Danny, Philippe and Diana and Bella is engrossing.Purity’s acting police chief, Jo Thibodeau is showing promises of being a smart one in the sequels to follow. Only used to dealing with accidents and known mishaps and tragedies, the discovery of a body in Maggie Bird’s driveway arouses her sixth sense and her ability to try and ferret further.The book’s narrative easily flits between the past and the present creating a web of intrigue, secrecy, and suspense.‘The Spy Coast’ is born from the author’s discovery of being surrounded by ex-CIA people in Maine where she currently resides. ”I wanted to wrote about spies who don’t look like James Bond, but instead are like my neighbours……..until the past comes back to haunt them,” she writes in the author’s note and which she has repeatedly emphasised in interview’s post the book release.But as the book is about spies and secrets, it throws up an interesting angle- of leading double lives. Of secrets stored. Of secrets unshared. Of the fear of revelations. And finally, the revealed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/41CAlupSVtL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ellen Jacover",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 4, 2023",
                "reviewTitle": "very nice read!",
                "reviewText": "I really enjoyed this book and hope there will be more of the Marini ClubLove Maggie and her gang",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}