{
    "remaining_requests": 1085,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Kill-Shot-Vince-Flynn-audiobook/dp/B0076G1V1S",
    "body": {
        "name": "Kill Shot: An American Assassin Thriller",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Kill-Shot-Vince-Flynn-audiobook/dp/B0076G1V1S",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61JswQpd-WL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Vince Flynn",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Vince+Flynn&search-alias=audible"
        },
        "brand": "Vince Flynn&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 14730,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "#1 New York Times best-selling author Vince Flynn is back with another nail-biting political thriller that follows the young Mitch Rapp on a deadly mission to hunt down the men responsible for the Pan Am Lockerbie terrorist attack. For months, Mitch Rapp has been steadily working his way through a list of men, bullet by bullet. With each kill, the tangled network of monsters responsible for the slaughter of 270 civilians becomes increasingly clear. He is given his next target: a plump Libyan diplomat who is prone to drink and is currently in Paris without a single bodyguard. Rapp finds him completely unprotected and asleep in his bed. With confidence in his well-honed skills and conviction of the man’s guilt, he easily sends a bullet into the man’s skull. But in the split second it takes the bullet to leave the silenced pistol, everything changes. The door to the hotel room is kicked open and gunfire erupts all around Rapp. In an instant the hunter has become the hunted. Rapp is left wounded and must flee for his life. The next morning, the news breaks in Washington that Libya’s Oil Minister has been killed along with three innocent civilians and four unidentified men. The French authorities are certain that the gunman is wounded and on the loose in Paris. As the finger pointing begins, Rapp’s handlers have only one choice - deny any responsibility for the incident and pray that their newest secret weapon stays that way, avoiding capture and dying quietly. One person in the group, however, is not prone to leaving things to chance. Rapp has become a liability, and he absolutely cannot be allowed to be taken alive by the French authorities. But it will soon become clear that nothing is more dangerous than a wounded and cornered Mitch Rapp. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Spies & Politics",
                "link": "https://www.amazon.com/Spy-Stories-Tales-Intrigue-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10493"
            },
            {
                "name": "Political",
                "link": "https://www.amazon.com/Political-Thrillers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7538395011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "10 hours and 48 minutes"
            },
            {
                "name": "Author",
                "value": "Vince Flynn"
            },
            {
                "name": "Narrator",
                "value": "George Guidall"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "February 07, 2012"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0076G1V1S"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,808 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #7 in Political Fiction (Audible Books & Originals) #31 in Political Thrillers (Audible Books & Originals) #71 in Terrorism Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "phillip l counts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJA2L3NN6O53HOFFRF2BWPRSUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3JCE2JH9LW7IR?ASIN=B0076G1V1S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars just great",
                "reviewText": "great read",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Steve P Beckett",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLVDQEZSDDZIPHEIDJRVE65DSSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RA2AAG8DAVALE?ASIN=B0076G1V1S",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 20, 2012",
                "reviewTitle": "4.0 out of 5 stars Not bad but not great",
                "reviewText": "I bought this after seeing Flynn on Imus a couple of time and since I'm into this type of novel I thought I would give it a look. The story is okay. In fact it's very good in places but Flynn violates two of Elmore Leonard's \"10 Rules of Writing.\"Rule 8. Avoid detailed descriptions of characters. His description of Kennedy goes into detail about her (lack of a) relationship with her husband, someone who is never again mentioned in the story. That was two or three pages wasted on nothing. Flynn also goes into detail into the background and upbringing of one of Rapp's major antagonists. This character could have been summed up in one paragraph describing his sociopathic tendencies brought on by a less than ideal childhood. Who cares that he grew up a bully. It becomes quite evident very quickly that he is a sociopath. How he got that way doesn't matter.Rule 10. Try to leave out the part that readers tend to skip. Refer to Rule 8.I'm reading Flynn's American Assassin now and in it he details the backgrounds of all of the main characters who will be prominent in his Mitch Rapp books. So far it's been better reading and puts a lot of what I read in this book into context. Flynn said on Imus the other morning that there was no chronological order to his books and that they can be read in no specific order. That's fine but he should have pointed out that American Assassin established the main characters. Had I known that I would have started with it and then gone on to the other books as I found them available.I will find and read another Flynn novel when I find it. If he continues violating Leonard's rules noted above then I will find another author who doesn't write page skippers.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph J. Truncale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRLKD4CWAO43F4EEM6RKZM6BPCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R349AOT3R7AT8N?ASIN=B0076G1V1S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 14, 2023",
                "reviewTitle": "5.0 out of 5 stars A fantastic action-packed spy assassin novel you should check out.",
                "reviewText": "Since I had already read American Assassin and loved it, I decided to purchase this 385-page soft cover (Kill Shot: An American Assassin by Vince Flynn). This book continues the saga of Mitch Rapp as he is still hunting for terrorists and is becoming better and more efficient with every job; however, as careful as he has been on his assassin assignments his enemies have set a trap for him. They still do not know who he is or who he works for, but they just know that he has killed many of their colleagues over the year, and now they are planning to kill him. They are determined to kill Rapp and have plenty of fire power. Will they succeed?I never give away too much information in writing my novel reviews because it spoils it for the reader, but if you are into the Vince Flynn’s Mitch Rapp assassin series do not pass this one up.Like the first book in this series, I really enjoyed this action-packed tale. It keeps you turning the pages.Rating: 5 Stars. Joseph J. Truncale (Author: Karate Self-Defense Techniques: Combat Karate for the street).",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard D",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTWVZJH2ESTPOH5TZNHAOTA5CBQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18RTPGVWEFUTL?ASIN=B0076G1V1S",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 25, 2012",
                "reviewTitle": "5.0 out of 5 stars MITCH RAPP - THE EARLY YEARS",
                "reviewText": "As a long-time reader of the Mitch Rapp series and a Vince Flynn fan I was more than looking forward to the release of \"Kill Shot\" and I wasn't disappointed. Mr. Flynn has a writing style that is engaging and knows just how much detail to provide for you to enjoy the ride.This book picks up where \"American Assassin\" left off; exploring the recruitment and early career of Mitch Rapp. In \"Kill Shot\" we learn that Mitch has been eliminating a long list of terrorists and their supporters in short order. His reputation has preceded him, literally, as his current target, a Libyan oil minister with ties to terrorists, is being used as a pawn by others higher in the terrorist food chain to lure this very effective assassin into a trap. Things go terribly wrong and a blood-bath massacre threatens to destroy CIA anti-terror operations and irreparably damage U.S./French relations. Obviously this all points to Mitch, who was shot during the ambush and must figure out how he was compromised and who he can trust. Not making this any easier, his trainer from The Farm, Stan Hurley, who has no love for the cocky new recruit even though Mitch saved his life in \"American Assassin,\" believes this blood-bath was Mitch going over the edge. When the DDO, Thomas Stansfield, orders him to send over a group of operatives to find and if necessary, neutralize Mitch, he chooses \"Victor\" to lead the group - a goon of a trainer to whom we were introduced in \"American Assassin.\" Aside from being a narcissistic sadist, Victor also has a personal score to settle with Mitch, who turned the tables on him, broke his arm, and made a complete fool of him during his training - something no one has ever done to Victor. The cat and mouse game that ensues, including treason and collusion by some in the U.S. and French intelligence agencies, makes for a great read.There have been several negative reviews of this book based on the lack of action. While I wouldn't consider this the most action-packed of the Mitch Rapp novels nor suggest this as a starting point for anyone not familiar with the series, there was more than enough suspense to make it very interesting and entertaining. As someone who has read the whole series, I found \"American Assassin\" and \"Kill Shot\" to be interesting back-stories providing additional character development. Since these are prequels and we know where certain individuals end up and the relationships that have formed from the earlier (chronologically later) books, we're given more character depth.As to the book ending at the 71% mark on Kindle, Mr. Flynn has addressed this in an e-mail to his readers and has already worked with those involved to correct it. They included free excerpts from his previous books in the e-book format which, because it's considered content, was included in the percentage calculation. I seriously doubt Mr. Flynn or anyone else was trying to cheat the readers. Even without the content, it's not that short of a book. The hard-back, which doesn't have the excerpts, is 385 pages, so the criticism that this seemed more like a short story is, in my opinion, unfounded.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 20, 2023",
                "reviewTitle": "Good story line",
                "reviewText": "Kept moving and plot changes were good",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Railman",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on June 18, 2020",
                "reviewTitle": "Amazing!!",
                "reviewText": "This book was fantastic! If you're looking for a good spy Thriller with lots of action, then this is the book for you. This is the second book in the American Assassin series. I found this one much more exciting than the first book, not to say that the first one wasn't good but this one grabs your attention right from the beginning and just keeps going. Definitely an excellent read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Marinucci",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on June 21, 2021",
                "reviewTitle": "Easy to read - very entertaining",
                "reviewText": "Im only new to Vince Flynn (last few months) but have purchased 6 book sso far off Amazon, Kill Shot is the second I have read. Been a huge fan of Lee Childs Jack Reacher series - think I am actually enjoying this more. (nothing in it) Cant put it down, great author, knows his stuff. Just love it. What a legacy he left behind",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "BJarugumilli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on October 8, 2016",
                "reviewTitle": "Phenomenal writing!",
                "reviewText": "Hooks you on to finish all Vince's books. A brilliant writer churned out page turners till his untimely death. Mitch Rapp is action personified- no nonsense, don't waste time kinda guy !",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CF",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 5, 2012",
                "reviewTitle": "Mitch Rapp like we know him...",
                "reviewText": "That's a usual Mitch Rapp-Story. So I can't follow the bad reviews to this writing. Everything what you expect and accustomed to is put together in this book.This is a story about the younger Mitch Rapp. Just 25 and just one year as an operative in the agency he is in Paris just to murder another nameless terrorist. But something went terrible wrong. He was expected and so he ends up with a serious wound in his shoulder. Someone betrayed him... but who? His handler Irene, her boss or his trainer Stan? But Mitch Rapp would not be Mitch Rapp if he packs his things and fly back to the states. No, someone have to pay. With his trainer Stan Hurley on his feet and an obscure french intelligence officer this book has a thrilling story.Nearly in every triller are some parts, that are not as thrilling than the rest of the book. But this is no circumstance for a bad review. Especially when Vince Flynn wrote something about a rival of Rapp or about the life of Irene Kennedy, the handler of Rapp. These scenes are naturally not as thrilling as the parts, when Rapp goes to „work“, but they tell us something about the background of Rapps life. And so, these parts are interesting and very useful to understand the protagonists of the books. And don't follow other reviews and belive this book contains only one shooting at the beginning... there are other scenes with a lot of slugs, blood and violence.Noteable is, that Mitch Rapp is not the only center of the book... there is another one... a she. Perhaps this is a style, which not every reader is accostumed to. Two lines of action.And so this book is as fast-paced, thrilling and interesting as every book from Vince Flynn about Mitch Rapp. I would say, Vince Flynn is one of the few writers – like Lee Child – who is able to write a #1 thriller after another. And this book is no exception. I refuse to reduce Mitch Rapp, Irene Kennedy and all the other figures in the Rapp-Series to blind killing-machines. And thanks to Flynn, we will learn something about the protagonists.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}