{
    "remaining_requests": 1237,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Anna-Novel-Matthew-Blake-ebook/dp/B0C2Q5H3YK",
    "body": {
        "name": "Anna O: A Today Show and GMA Buzz Pick",
        "price": "$6.99",
        "originalPrice": "",
        "rawPrice": 6.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Anna-Novel-Matthew-Blake-ebook/dp/B0C2Q5H3YK",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71Noy3EpcQL._SY342_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Matthew Blake",
            "link": "https://www.amazon.com/Matthew-Blake/e/B0CB4PWTN1/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "3.9 out of 5 stars",
        "customerReviewCount": 679,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C2Q5H3YK"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Harper (January 2, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 2, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 3765 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 432 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,431 in Kindle Store (See Top 100 in Kindle Store) #8 in Medical Thrillers (Books) #8 in Medical Thrillers (Kindle Store) #41 in Murder Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "3.9 3.9 out of 5 stars 679 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "AJ Holmes",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPEBMFK7ERTSWVHX6XFMLQAVICQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R35CV5FFHMYZAU?ASIN=B0C2Q5H3YK",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars This was an incredible debut novel!!!",
                "reviewText": "This is truly one of those books that will steal you away from the world around you. Once you begin reading, it will be hard to pull yourself away as you are pulled into the world of Patient X, Dr. Benedict Prince, Dr. Virginia Bloom, Anna O, and others. It's been four years, and Anna remains asleep, waiting to be held accountable for her alleged crimes. Will she ever wake to face what was done?Dr. Prince has spent his life studying the ins and outs of the effects of sleep and the crimes committed by people while asleep. Now, he's being trusted to assist with the care and waking of the infamous Anna O, which could propel his career forward like never before. Dr. Bloom has treated patients of many various diagnosises, but none stand out quite like the mysterious Patient X, who has intrigued her in a way no patient before or after ever has. As they work the case of Anna O., the novel vollies back and forth from the past to the present, and things are slowly revealed, but if you aren't paying attention, you will surely miss out.",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Linzie H.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFPDN4FGIR3BK2GBD7RYOB3QLOLA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1S1JIDQ3SNKGG?ASIN=B0C2Q5H3YK",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "4.0 out of 5 stars An ingenious mix of psychological suspense and mild crime fiction (4.5 stars)!",
                "reviewText": "Oh. My. Freaking. God. What a true mind-bender of a book. An ingenious mix of psychological suspense and mild crime fiction, Anna O is sure to be lauded as one of the best books of next year. From the carefully crafted characters to the riveting premise, my mind is well and truly blown to minuscule little bits. Want to know exactly why? Read on for more of my reasons…First off, this plot was Hitchcockian to the extreme. Finely layered and peppered with deftly hidden clues, I didn’t have a chance to guess what was to come before even one of the jaw-dropping reveals. Told through multiple POVs and Anna’s own journal entries, the onion-like buildup to this dynamite plot was truly sublime. I do have to say, however, that the twists were the ultimate stamp of perfection. Actually causing me to shout “WHAT?!?” as my jaw quite literally dropped more than once, they were clever and cunning in a way few authors can muster.Then there were the sharp characters who felt wholly true-to-life in a book that had a ripped-from-the-headlines appeal. With believable behaviors and equally realistic thoughts, they were used by Blake to con and misdirect yours truly over and over again. Take it from me, I fell in love with them all. Well, until the truth was revealed in all of its glory, of course. After that, some got my sympathy and others my happily doled out disdain.I do have to say, however, that <b>the middle was rather obscure and long-winded. Diving deeply into the psychology of the case, I have to admit that I felt lost multiple times. Pile on the fact that it was a complex and intricate plot, and it was inevitable that I’d lose my way here and there. By the end, though, the blindingly brilliant climax and shock-inducing conclusion were sure to leave a s*** eating grin on my face just the same.As I walk away from this novel, I can’t help but wonder what kind of crazy, virtuoso-like mind came up with this plot. Detailed and utterly awe-inspiring, it seriously reminded me of The Silent Patient in all of its mind-blowing intensity. Was it just a bit too long and perhaps somewhat overly convoluted? Yes, maybe a tad. All in all, however, I highly recommend giving this book a shot despite its early mixed reviews. Just don’t go in expecting an adrenaline-fueled storyline dripping in suspense. After all, the slow rollout of this groundbreaking mystery was just another one of its charms. Rating of 4.5 stars.Thank you to Matthew Blake and HarperCollins for my complimentary copy. All opinions are my own.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mnmloveli",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGCTV7IKYZWBT7ILD5IGDKAVHTAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RCAY5KAZ64W2F?ASIN=B0C2Q5H3YK",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "3.0 out of 5 stars Deep, difficult read",
                "reviewText": "‘24 - 3 STARSDESCRIPTION : What if your nightmares weren’t really nightmares at all? We spend an average of 33 years of our lives asleep. But what really happens, and what are we capable of, when we sleep?Anna Ogilvy was a budding twenty-five-year-old writer with a bright future. Then, one night, she stabbed two people to death with no apparent motive—and hasn’t woken up since. Dubbed “Sleeping Beauty” by the tabloids, Anna’s condition is a rare psychosomatic disorder known to neurologists as “resignation syndrome.” Dr. Benedict Prince is a forensic psychologist and an expert in the field of sleep-related homicides. His methods are the last hope of solving the infamous “Anna O’”case and waking Anna up so she can stand trial. But he must be careful treating such a high-profile suspect—he’s got career secrets and a complicated personal life of his own.As Anna shows the first signs of stirring, Benedict must determine what really happened and whether Anna should be held responsible for her crimes. Only Anna knows the truth about that night, but only Benedict knows how to discover it. And they’re both in danger from what they find out.REVIEW :Debut book by this author. Recommended by JD Barker who I love and on the NBC Morning Show.Sale $11.99; reg 14.99 less 3.00 Kindle Rewards.I read the first few pages of the sample before going to bed one night. After trying to sleep, I couldn’t get the book out of my head and got up and continued reading for the next two hours. This book and the writing grabbed me instantly. As I continued reading at about 40% I was getting confused with the depth of information; started to lose me. I’m trying to read-on. By 60% got way too technical for me concerning Resignation Syndrome not being recognized as a valid psychiatric condition by the WHO. Definitely a little too deep for me; maybe others will like it better.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 16, 2024",
                "reviewTitle": "Really original",
                "reviewText": "I couldn't put this down! Fantastic to read something completely and utterly different. And he's clearly done his research too on psychology and sleep. Looking forward to his next book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nilton C. Teixeira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Very interesting premises",
                "reviewText": "3.5 starsSometimes advertisements works.This book has been showing up in my feeds since last July and it got my immediate attention.And that simple cover was good enough to win my curiosity.Highly praised/endorsed (assuming it’s true) by Lee Child, Jeffery Deaver, David Baldacci (authors that I must confess I have never read a single book), A.J, Finn (I read one of his works, which I rated 2 stars) and Nita Prose.The blurb promises that it’s going to be one of the best thrillers of the year!Anyways… yes, I purchased a paperback on its release date (January 2, 2024), as if I had nothing else to read. Then I downloaded the ebook (because it’s a lot more convenient to read while commuting to work in the public transport).When I was at 20% I discovered that Dan Stevens is one of the narrators in the audiobook, so I had to have the audio, which I immediately obtained, then I went back to the beginning.I was delighted with the simple writing and I felt completely engaged (thanks to Dan Stevens?).The topic around sleeping disorder was quite thought provoking and I enjoyed the development of the story, although a bit repetitive in some parts. But the chapters were too short to give a sense of depth.I thought that I was given a draft to read, because it felt incomplete.I liked the multiple POV, including Anna’s journal.Was this groundbreaking? I don’t think so.But it was very entertaining (especially the audiobook), hence my ratings.Paperback (Harper Collins): 424 pages (82!!! chapters), 5 partse-book (Kobo): 326 pages (default), 101k wordsAudiobook narrated by Dan Stevens, Hannah Curtis, Sarah Cullum, Christine Rendel: 12.1 hours (normal speed)",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Lucy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 4, 2024",
                "reviewTitle": "Not as enjoyable as I was expecting",
                "reviewText": "I loved the premise of this book but if I'm honest I found it really hard going. It felt like it could have been told in a lot less chapter and less to-ing and fro-ing . I figured out who Patient X was fairly early on but was hoping I was wrong.I understand that there needed to be meat on the bones of the book but I'm sorry to say it felt rather too fleshed out and drawn out to me. I admit I found myself skim reading a lot of it.I'm fully prepared to admit that it was perhaps my issue and I wasn't able to connect with the authors writing style but I just wasn't drawn into it. I wasn't captivated and I kept putting it down . If I'd not bought it as a hardback copy I don't think I'd have finished it unfortunately.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Budbeerboy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 2, 2024",
                "reviewTitle": "Great Read!",
                "reviewText": "Suspenseful reading. A page turner",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "david coaton",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 14, 2024",
                "reviewTitle": "Masterpiece",
                "reviewText": "Simply brilliant , makes you think and keeps you guessing a must read if there was one more please more",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}