{
    "remaining_requests": 1075,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/You-Novel-Caroline-Kepnes/dp/1476785600",
    "body": {
        "name": "You: A Novel (1) (The You Series)",
        "price": "$11.87$11.87",
        "originalPrice": "",
        "rawPrice": 11.87,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/You-Novel-Caroline-Kepnes/dp/1476785600",
        "soldBy": {
            "sellerID": "A25H6JFKDMQ758",
            "name": "-OnTimeBooks-",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A25H6JFKDMQ758&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "30",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Igvyh38AL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51axXdWjcML.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Caroline Kepnes",
            "link": "https://www.amazon.com/Caroline-Kepnes/e/B001K8I774/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "-OnTimeBooks-",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 23716,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 16 hrs 13 mins",
            "FREE delivery March 1 - 7 on orders shipped by Amazon over $35",
            "Or fastest delivery February 29 - March 4"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ 1476785600"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Atria/Emily Bestler Books; Reprint edition (June 16, 2015)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 448 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 9781476785608"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1476785608"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.7 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1.2 x 8.25 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#15,444 in Books (See Top 100 in Books) #418 in Psychological Fiction (Books) #1,163 in Psychological Thrillers (Books) #2,419 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 23,716 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Courtney~MustReadBooksOrDie",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXXJTRIJUKOEELYREGVRAZTD5PQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15ESQ59MA04XL?ASIN=1476785600",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 17, 2015",
                "reviewTitle": "5.0 out of 5 stars Loved this brand of storytelling",
                "reviewText": "Shel: You know what? It's been days since I read You and I'm still thinking about it. It feels like an epic fail to even try to articulate all of the things that I'm thinking about this novel because they're all twisted and knotted on each other. But, for you, I will try. Court: As you can see, I took a million days after Shelley to finish this one. Not for lack of love though, but for surplus of procrastination in other life affairs. BUT...You. Holy (edit). I am so in love with this author, and I absolutely adored the second person POV. I think it added a huge spice to the dynamic of the story, and I can just gush and gush from there.Shel: Joe is...well...I have conflicted emotions about good ol' Joe. Some of the observations he makes about our culture--the digital age/social media--are so interesting to me. They're perceptive and disdainful and cynical and amusing and as I'm thinking this, I'm also thinking that for someone who looks down on it all, he sure does know his way around them. Even with his ornery self, I liked him. And then I didn't like myself for liking him..for reasons. When you read, you'll see. For instance, he has boundary issues. Serious boundary issues. And just like with the characters in You, he repels me as he draws me in. Maybe it's because I know people like him in real life--fascinating even as they creep me out. He does this--creeps me out because he's a stalker extraordinaire but then I'm fascinated by his obsession and his justification for his obsession--Beck. Court: I...I just...I can't even describe how I feel about myself liking Joe out of almost every other character in this book. Every single person had a purpose, and to what end with 'ole Joe...but...yeah. He's absolutely psychotic, but again like Shel said his observations are (flawed) but accurate. He has a way about him that makes him endearing. It could be the long soliloquy about Stephen King (which had me rolling...especially knowing Mr. King read the book!) that makes me think..yes, he is a book person I could get along with. And then I remembered...oh yes! He's (edit) stalking this person! Like. Whoa. Heady thing, this book.Shel: Beck is not my favorite which sucks; I don't like her because of her flaws and, honestly, her flaws are magnified realism and I shouldn't be annoyed by her for them, but I am. (Wow..that was a really long and really awful sentence. Keeping it anyway). She strikes me as manipulative from the start (and it doesn't help that we KNOW that she is because of Joe's masterful stalking) and I'm not a huge fan of manipulators, so you can imagine how I feel about her. Also? Her weaknesses make me annoyed with her even as I want to like her and isn't this the way with REAL people? We dislike them because they're human, with human frailty, and we want them to be better. Well, that exactly my problem with Beck--I disliked her for being too close to reality. What's interesting, I think, is that while I didn't really like her, I liked the way she was characterized; I didn't like her precisely because of the way she was written--Caroline Kepnes wanted us to not like her, and I didn't. Court: Honestly, I really kind of hated her too. She is the ultimate frenemy surrounded by other frenemies...and I just couldn't even begin to fathom the way she treated Joe. And...yes. I KNOW he was stalking her, but some of the things she does and says and then does again and again and again. She was difficult for me. She is the ultimate anti-heroine though, so there are some more conflicted feelings in my head right now that I can't even formulate a coherent thought about. Every one in this story is so very anti-everything, but their observations and way about them was special. I agree too, Shel that our feelings end up being purposeful. So, we feel conflicted for hours, and probably days afterward. Well played, Caroline, well played. We heart ya.Shel: The secondary characters add annoyance to Joe and therefore add much comedy for me. His snarking comments about them are so perfectly nasty and jealousy filled and just as I'd find myself disliking him, I'd like him again. Sigh. Court: I know, right? Joe has an opinion about just about everything. Whew. It must be exhausting to be him. But...if it came to Benji, Curtis, Beck, Peach, or any other character we met...he did indeed have an opinion in which in impart with us.Shel: So, the moral to this story, for me, is that I was thoroughly engaged in the running commentary Joe made about our society's obsession with all things technology; his elitist, cynicism struck a chord with me and I found myself nodding my head in agreement with many Joe-isms. And, I was also conflicted with how I felt how about Joe..perhaps because I liked him when I didn't want to and at other times I wanted to throttle him and other times hug him and other times murder him. (another stellar sentence, there. Not). And Beck was just, well, Beck. Court: I have thought about this a lot since finishing the book, and the way that he was just so...on his path...has to be admired. But...obviously this is surreal fantasy, and I hope that you give it a go anyways...We like the dark and twisty an insurmountable quantity, and all of the book references, and the book store, and the writing made me so happy I couldn't help but shout from everywhere (ask my Dad...he had to hear all about Joe while chained to his hospital bed today...). I can't wait to see this turned into a sitcom.Shel: I saw today that Kepnes is writing a sequel; this should be interesting. I'm thinking I know where this one may pick up..but who knows? I could be very surprised. Court: Yes, this now even has a blurb. And it looks so freaking intriguing. Hhhmmm, I say. I can't wait!",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSZOIF6FHQZ4JTNTDR3EDWY6UWA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RUL2YZIXSPSTL?ASIN=1476785600",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2019",
                "reviewTitle": "4.0 out of 5 stars It's good and it's great and it's creepy and it's stalkerish and you should read it",
                "reviewText": "Wow this book was really good and it got into my bones and it really reeled me in and now I am typing in compound compound sentences so great was its effect.Lol.I came to this book via the Netflix (via Lifetime) show. Late in season 1, I discovered the show was based on this book. To my very pleasant surprise, I discovered I own this book on my Kindle (gasp). Kindles are so noveau and fashion forward and snotty and snooty and books should be touched and caressed and creased and written in. Books transfer germs.Don't mind if I reminisce a moment. I bought this Kindle book when it came out. I don't remember doing so. I had only owned my Kindle for 1 month. How did I find it? This author had just written short stories before. My Kindle was VIRTUALLY BRAND NEW and I was mostly using a site to find free books at that time. I just don't know. But I own it and so I finished episode 9 and before watching the finale, I read this book.It is difficult and frankly much less fun reading the book AFTER seeing the show/movie. In fact, I hate it. Had I planned my life more carefully, I would've checked to see if there was a book. But how to do that? Bored one night, I just semi-randomly picked this show on Netflix. What am I supposed to do, research every show on Netflix to see if there's a book, and if so, read the book? How do I know whether the show will be any good? I already read a lot of books. Watching shows is my non-book veg out time. Can these worlds actually coexist? I need some ice cream.Well, once the genie is out of the bottle, you cannot put her back. Unless she is Barbara Eden. And even that is difficult. She puts herself back. When she wants.So I know what Joe looks and acts like and I know what Beck looks and act like and how can I enjoy this book with the MENTAL IMAGES ALREADY IN MY HEAD???? Developing mental images (after all, life is really just a series of visuals, words mean nothing without visuals) while reading a book is really what it's all about. And I couldn't do that because FREAKING NETFLIX ALREADY DID IT FOR ME.So as I began I was perturbed and not a little disturbed and somewhat consternated but thank god not constipated and on my merry way I went, though not merrily.The book is a bit choppy and things skip forward and you get a feel for that but I was not ready for that because the TV show seems more linear and connected. So my first thought was that I didn't like the book that much and THANK GOD FOR THE SHOW.But around 25% the book really dug its claws in and I began analyzing various things, like why did they change certain characters' names and races? Why does the show have a whole set of key characters (Joe's neighbors) that are not in the book? Why do TV writers feel the need to change so many things? I get that TV is different than books and some changes are helpful but anytime I compare a book and a show i ALWAYS see unnecessary TV changes. Alas, alas.Read the book. It's interesting and it's fascinating and it's not the greatest book ever written but it's pretty darn good and I gave it 4 stars and not many books get 5 stars from me.This is a very very long review for me but I broke out my laptop and I'm having fun, even if you're not. Get some ice cream. Normally I write reviews on my phone and the PRIMARY if not ONLY point of writing them is to create a record of the books I've read (which Alex Cross did I read last?) and to record a quick snapshot of how I felt about the book, for posterity, if not posteriors. Now that we have lovely Goodreads (whose reviews don't link to Amazon unless you write them ON YOUR KINDLE, even though Amazon owns Goodreads, shut down its discussion board and pushed us to Goodreads, GRRR), I don't need to write a review on Amazon to remember that I read a book. Goodreads does it for me and I like that very much. But I've been doing it this way for 5 years and i'm just going to keep on doing it. And now I'm copying and pasting my reviews to Goodreads since that is now where I manage my reading habits and what are our kids going to do with our digital products and our digital footprint when we die? All this becomes nothingness but who gets all the Kindle books? Should I include that in my will? And the URLs of all my online accounts and the related user IDs and passwords so they can stop all online subscriptions and get whatever music, books and other content I own???Why does Amazon give us a small box to type reviews in? This box holds about 5 lines and it's not convenient and maybe Amazon is encouraging short reviews but it seems every Amazon box to type in is too small and in fact it seems that's a phenomenon across the whole WWW. Come on, when is Generation Z or whoever is in charge now going to RISE UP and MAKE TECHNOLOGY BETTER??? So many advances to be made.I liked the book.The end.",
                "reviewVotes": "51 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexanne Beaulieu",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 3, 2022",
                "reviewTitle": "Absolutely loved it!",
                "reviewText": "I have seen (and been obsessed) with the series on Netflix and honestly the book is ten time better!The writing is incredible and the author makes us hate Joe, not like the série where you can kind of like him sometimes (I mean, Penn Badgley is gorgeous so that helps on liking the character!)I really like the character coming to life in the book!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ante Nakic",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 10, 2024",
                "reviewTitle": "liebe beck lololol",
                "reviewText": "beck😩",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Rishabh kumarRishabh kumar",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on April 23, 2023",
                "reviewTitle": "Loved this book!!!!",
                "reviewText": "I came across the show of YOU in 2020 and fell in love with the character of Joe (A Manipulative Psycho), I don't know why but characters like Joe Goldberg always fascinate me and make me feel the urge to know about them more. FINALLY after years of starting and watching the three seasons of the web series I bought this book, and yes I am glad that I read it. This book provides more depth to the character of Joe Goldberg who wants people to grow out of the habits and nature which he considers to be bad and therefore puts them in the cage, but things never workout as they had worked out earlier when he had been put into the cage by the bookshop's owner and he always ends up murdering them. This book is different from the show in many ways so be ready for some surprises, you might not see some of the characters of the show in this book at all. If you enjoy reading psychological thrillers with a touch of romantic smut, this book would be perfect for you.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+uSsPF1AL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alisson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on December 20, 2020",
                "reviewTitle": "More disturbing than the Netflix series",
                "reviewText": "I am almost finished reading the book and, having watched the series before, I can say that the book is more disturbing, but worth reading.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diana Kosenko",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Sweden on September 5, 2022",
                "reviewTitle": "Love it",
                "reviewText": "Amazing book that catches your attention completely. I wasn't able to stop reading it, and it doesn't happen to me too often. Starting the second part right now, and I really hope that the author has much more to add to this story. I watched the series, and the book is definitely better, but the actors did great job too.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}