{
    "remaining_requests": 1218,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Desert-Star/dp/B09X295Y68",
    "body": {
        "name": "Desert Star",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Desert-Star/dp/B09X295Y68",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/519MvVXgk0L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Michael Connelly",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Michael+Connelly&search-alias=audible"
        },
        "brand": "Michael Connelly&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.7 out of 5 stars",
        "customerReviewCount": 64172,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "LAPD detective Renée Ballard and Harry Bosch team up to hunt the brutal killer who is Bosch’s “white whale”—a man responsible for the murder of an entire family.A year has passed since LAPD detective Renée Ballard quit the force in the face of misogyny, demoralization, and endless red tape. But after the chief of police himself tells her she can write her own ticket within the department, Ballard takes back her badge, leaving “the Late Show” to rebuild and lead the cold case unit at the elite Robbery-Homicide Division.For years, Harry Bosch has been working a case that haunts him—the murder of an entire family by a psychopath who still walks free. Ballard makes Bosch an offer: come volunteer as an investigator in her new Open-Unsolved Unit, and he can pursue his “white whale” with the resources of the LAPD behind him.First priority for Ballard is to clear the unsolved rape and murder of a sixteen-year-old girl. The decades-old case is essential to the councilman who supported re-forming the unit, and who could shutter it again—the victim was his sister. When Ballard gets a “cold hit” connecting the killing to a similar crime, proving that a serial predator has been at work in the city for years, the political pressure has never been higher. To keep momentum going, she has to pull Bosch off his own investigation, the case that is the consummation of his lifelong mission.The two must put aside old resentments and new tensions to run to ground not one but two dangerous killers who have operated with brash impunity. In what may be his most gripping and profoundly moving book yet, Michael Connelly shows once again why he has been dubbed “one of the greatest crime writers of all time” (Ryan Steck, Crimereads). Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b?ie=UTF8&node=17"
            },
            {
                "name": "Action & Adventure",
                "link": "https://www.amazon.com/Action-Adventure-Genre-Fiction-Books/b?ie=UTF8&node=720360"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thriller-Suspense-Action-Fiction/b?ie=UTF8&node=10159268011"
            },
            {
                "name": "Crime",
                "link": "https://www.amazon.com/Crime-Action-Adventure/b?ie=UTF8&node=10159269011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "9 hours and 37 minutes"
            },
            {
                "name": "Author",
                "value": "Michael Connelly"
            },
            {
                "name": "Narrator",
                "value": "Titus Welliver, Christine Lakin, Peter Giles"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "November 08, 2022"
            },
            {
                "name": "Publisher",
                "value": "Little, Brown & Company"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B09X295Y68"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#1,619 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Crime Action Fiction (Audible Books & Originals) #3 in Mystery Action Fiction (Audible Books & Originals) #14 in Police Procedural Mysteries"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Missouri Tiger",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE753FNKJFFDBKXA5442PNADWJMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R4PSBRK6YMJJ0?ASIN=B09X295Y68",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Great older Bosch",
                "reviewText": "Not sure yet what is his future. Ending was worth the read. Interesting seeing Harry as a vulnerable cop. Another series......",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "P Clay Carter",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELLH2KPROWHKF2HVZVRZRNAWZOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RE5WFCMG74JXC?ASIN=B09X295Y68",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 2, 2024",
                "reviewTitle": "5.0 out of 5 stars The Durability of Essence",
                "reviewText": "Harry is 70 and maintains the values and patterns that have defined his career. For an old fan, this story shows respect for the person Harry has been and continues to be in spite of age.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Josh Mauthe",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESESBLLG3ZZISQONG5SOAEUGC3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1ZEDA2SVTB14R?ASIN=B09X295Y68",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 21, 2023",
                "reviewTitle": "4.0 out of 5 stars Bosch and Ballard join forces in a cold cases unit - but it's clear where Connelly's affections lay",
                "reviewText": "I realized about halfway through Desert Star that I've been reading books about Harry Bosch for more than 25 years at this point, and it's to Michael Connelly's credit that I still enjoy the newest ones as much as ever, and that somehow, he's largely avoided falling into the kind of ruts that you would think would be an issue with that. No small part of that boils down to the way that Connelly has let Bosch age and the world evolve, to the point that, when Desert Star begins, Harry has been enlisted to help with a cold cases unit run by Renée Ballard, Bosch's friend (and sort of protege, though neither might admit that). In theory, Desert Star is the story of Bosch's efforts to get justice for a murdered family whose case stalled out, but that's almost a bait and switch, as the politically necessary case of discovering the murderer of a councilman's young sister comes to take up the majority of the book. This is now the fourth book where Bosch and Ballard have been allowed to co-star, so to speak, and Connelly has found the necessary rhythms pretty nicely, letting the two trade beats back and forth, allowing Bosch to still be the prickly loner that he always has been while finding in Ballard someone who marries Bosch's desire to find justice with someone who also knows how to live within the system. That doesn't keep Bosch from still being Connelly's real love here, and that's okay; while the plot of the book makes it clear that Connelly knows that Bosch's time needs to come to a close soon, it's hard to begrudge him spending time with a character who we've known for this long (more than a quarter century!). If all of this sounds like I'm talking a bit more about the big structure of the book than the plotting, don't let that sound like I'm dodging the subject; suffice to say, Desert Star is typically interesting and well-paced Connelly plotting, with a couple of great reveals and some nice beats that allow the characters to breathe and the world to still spin outside them. (There's a brief moment with Bosch in a bar towards the end of the book that's about as good of a chapter as Connelly ever wrote, all the more because of how simple it is.) Connelly still sometimes has a tendency to go for the big theatrical showdown and climax, but heck, that's part of what makes the books fun. I haven't read a bad Connelly in many years, and Desert Star keeps that streak alive, giving you an enjoyable mystery and, more importantly, a chance to hang out in Connelly's rich, observed world.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "RanBart",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHXYPSJP3QKKE4KCEZP3KYR5FXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3K9A36PI6ZDLM?ASIN=B09X295Y68",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars another great Connelly book",
                "reviewText": "Ballard and Bosch awesome in this book. I hope you continue to write Bosch books in the future loved it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Travvaller",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEMLGX7XZ6IVDRJW637XCXKWIHSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LFGJX6PTPPCM?ASIN=B09X295Y68",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 3, 2024",
                "reviewTitle": "5.0 out of 5 stars When u want to read about justice seved",
                "reviewText": "As usual, Connelly delivers in an unflinching prosaic manner about the darkest reaches nesting in the souls of the wicked. About a 3rd of the way in, u r totally invested in it and u want to jump into the pages and take over n get the bastards who killed our innocence. The innocent belong to us all, to protect and help it propser and grow. Read this installment, be rewarded.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "George P. Wood",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHQESZRWRQOXPCCSW5M4OG6FQ34A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RQ9XUHOYWHEW6?ASIN=B09X295Y68",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2022",
                "reviewTitle": "5.0 out of 5 stars End of the Line for Harry Bosch?",
                "reviewText": "Harry Bosch is getting old. To be precise, he is 72 years old in 2022, when the events in Desert Star take place. His motto has always been, “Everybody counts or nobody counts. This is the driving force in his pursuit of justice for victims. But how long can he keep going?That’s the question I had in mind when I cracked open the latest installment in Michael Connelly’s long-running series of crime novels featuring Bosch. Connelly debuted the character in 1992’s The Black Echo, I discovered the Bosch series in 2015, and I have been a huge fan ever since. (The television show is also very good.)With Bosch, Connelly has created a Los Angeles-centric universe of characters who interact with one another, such as Mickey Haller (the “Lincoln lawyer” and Bosch’s half-brother) and Renee Ballard (Bosh’s erstwhile partner). As Bosch ages, Connelly is able to shift the focus from him to these other characters. Because fans are already invested in them, they find it—I find it—easy to pick up the new books.This is especially true as some of the protagonists in my other favorite series age. Jack Reacher is too old to be homeless in America. Walt Longmire—who’s older than Bosch—is too old to be running around the Rez. And Gabriel Allon—who’s contemporary to Bosch—has retired from Mossad. What do you do with these beloved characters?Connelly has solved that problem by moving Bosch into a secondary position as a supporting character to LAPD Detective Renee Ballard. In Desert Star, she runs the reconstituted Open-Unsolved Unit that tries to close cold cases. With Bosch as her first choice, she has created a volunteer group to sift through cold cases and use DNA or other new developments solve old murders. The team includes another retired (but lazy) LAPD officer, a retired deputy DA, a retired FBI agent, and an investigative genetic genealogist with a penchant for the psychic realm.Desert Star focuses on two cases. The first is the 1994 murder of Sarah Pearlman, sister of LA City Councilman Jake Pearlman, who has been instrumental in restarting the Open-Unsolved Unit, and who expects his sister’s case to be prioritized.The second is the Gallagher Family case, the 2013 murder of Dad, Mom, and two kids. Bosch worked the case and identified a suspect, Finbar McShane, but the case went cold long before he retired. It’s the one that got away.Connelly’s plot is a slow burn, with the major action reserved for near the end of the book. It’s a classic police procedural. The plot twists and turns as new evidence and new insights about old evidence lead readers to the book’s denouement, which hits close to home.Bosch has often been in perilous, even life-threatening situations, but this is the first time I genuinely worried for him in the years I’ve been reading the series. Is this the end of the line for Harry Bosch? You’ll have to read the book for yourself to find out.Whether or not it is, however, I’m glad that Connelly had the foresight to introduce Renee Ballard in the Bosch literary universe several years ago. She’ll carry on when Harry can’t. I enjoyed Desert Star, and I’m looking forward to the next novel.",
                "reviewVotes": "65 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Grandmama23",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMACQQKXUI2QCK3UDXHOACASMQA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1PWBOAG1SXMGM?ASIN=B09X295Y68",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 6, 2024",
                "reviewTitle": "5.0 out of 5 stars Another excellent book!",
                "reviewText": "Another great read. I love these two working together so the end is sad if it stays as it is in next book.This book will keep you intrigued all the way through. An emotional roller coaster but totally worth it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "M. Slack ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFJTMKSQ24ETNFT5IYR7FBXEIJNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R32UJNT90GJOGX?ASIN=B09X295Y68",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "4.0 out of 5 stars Great read",
                "reviewText": "Classic who done it with one of my favorite detectives. This is a hand-off novel of one protagonist to another, I'm going to miss Bosch.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Philip Patrick Walker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on April 27, 2023",
                "reviewTitle": "Quality writting",
                "reviewText": "I love the consistency in the quality of his writing. You can feel yourself in the story and the emotions of the main characters. I could read this type of novel all my life.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "José Tadeu Picolo Zanoni",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on January 5, 2023",
                "reviewTitle": "Great book",
                "reviewText": "One more book with Harry Bosch. We will miss him. As usual, he works two cases until the final solution. Works hard with Renné Ballard, the new chief. We know that chiefs don't are always obeyed, but, that is Bosch. Good reading, as always. Keep this way Michael.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Stephen Ellis",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 9, 2024",
                "reviewTitle": "Brilliant thriller, utterly captivating and absorbing!",
                "reviewText": "Michael Connolly is a gifted brilliant writer, who just gets better. Utterly captivating and absorbing thriller which engages the reader from start to finish.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "john bush",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 26, 2024",
                "reviewTitle": "Great author",
                "reviewText": "Always good novels",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "\"winder06\"",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on December 22, 2023",
                "reviewTitle": "Palpitant",
                "reviewText": "Très bien et Harry Bosch prend enfin la place qu'il mérite.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}