{
    "remaining_requests": 1162,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/First-Strike-Ben-Coes-audiobook/dp/B01FKIGLF4",
    "body": {
        "name": "First Strike: A Thriller",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/First-Strike-Ben-Coes-audiobook/dp/B01FKIGLF4",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51zo43fbCBL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Ben Coes",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Ben+Coes"
        },
        "brand": "Ben Coes",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 5720,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Deep within the Pentagon, a covert multibillion arms-for-influence program was created. The objective was to protect the United States and its allies from terrorist acts by secretly enabling a handpicked man to emerge as the most powerful leader in the Middle East. But the charismatic Tristan Nazir double-crosses America, twisting the program for his own violent ends to create ISIS. Now America is at great risk. Elite operative Dewey Andreas is sent to Syria to retrieve details about the source of ISIS' funding, but his cover is blown midoperation, and chaos erupts in the streets of Damascus. Trapped and outnumbered, Dewey manages to send proof of the awful truth - unknown at even the highest levels in the government - that ISIS' munitions were indeed provided by America itself. This information arrives in time to for the US to cut off a final arms shipment before it reaches ISIS. But the vicious Nazir is far from finished. He launches a bold strike into the heart of America, sending a terrorist cell to take over a dorm at Columbia University, capturing hundreds of college students as hostages. For every hour that the shipment of weapons is withheld, the terrorists will publicly execute one student. The potential loss of life is intolerable. A frontal assault is impossible. Releasing the shipment is unthinkable. There is nowhere to turn. In a situation with no solutions, there remains only one option: Dewey Andreas. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Spies & Politics",
                "link": "https://www.amazon.com/Spy-Stories-Tales-Intrigue-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10493"
            },
            {
                "name": "Political",
                "link": "https://www.amazon.com/Political-Thrillers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7538395011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 7 minutes"
            },
            {
                "name": "Author",
                "value": "Ben Coes"
            },
            {
                "name": "Narrator",
                "value": "Peter Hermann"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "June 28, 2016"
            },
            {
                "name": "Publisher",
                "value": "Macmillan Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B01FKIGLF4"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#41,180 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #256 in Political Thrillers (Audible Books & Originals) #734 in Terrorism Thrillers (Books) #1,901 in Political Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Adam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEFTL2BUQZXBMQS76EED4IFAAHSQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NP0ONEP7CM8S?ASIN=B01FKIGLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "5.0 out of 5 stars Another Classic",
                "reviewText": "Ben Coes never disappoints. Another epic tale for Dewey. Each book is better than the last. This is my second time reading the series and I like it even better the second time through.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Mondschein",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPGKOJ4LVLO63WC6AAOBX6PVRDQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R322HVIBSYORLJ?ASIN=B01FKIGLF4",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 11, 2016",
                "reviewTitle": "4.0 out of 5 stars Slow beginning but really picks up",
                "reviewText": "Starts off slowly trying to set up the reason for the rest of the book. The plot was not very believable and illogical. After the plot was established the rest was unleashed Dewey and thrilling. During a particularly harrowing scene, I found myself gritting my teeth and feeling my heart pounding. Although the first part was stretching credibility, the action that occurred as a result was frighteningly realistic. Not to be a spoiler,so I'll just say my valedictorian and perfect ACT son (pardon the brag) is strongly considering going to the college mentioned in the story. Kind of a bummer actually. You'll enjoy this yarn, just give Mr. Coes a little warm up and you'll be glad to see Dewey on the case again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Richard B.  Schwartz",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHW3DUWSCRVG5OG6WYOZSID2GB7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36RU6105UH654?ASIN=B01FKIGLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2016",
                "reviewTitle": "5.0 out of 5 stars The Summer Book of 2016",
                "reviewText": "First off, this is Ben Coes’s best book to date. It is also his most ambitious. The subject is nothing less than the unwitting American subsidization of ISIS. (Lots of SPOILERS to follow, but they’re all revealed on the dust jacket and in the Amazon description.) A Pentagon bigwig has had the bright idea of picking the right team in the Middle East and supplying them with weapons—a group that will take down the local baddies but never mess with us. Good luck with that. The bigwig discovers that the person he’s dealing with—Tristan Nazir of ISIS—is anything but a reliable partner. He’s a ruthless, barbaric monster who, of course, studied at Oxford.Dewey is dispatched to Syria to pick up the goods on the deal and identify the American who went off the reservation. He ends up in a captured hospital in Aleppo where the ISIS nasties intend to behead him for international internet consumption. Fortunately, Dewey is not without resources, including a set of Israeli commandos lead by his old pal, Kohl Meir.When the second tranche of arms is interdicted, Tristan counterattacks, sending a terrorist cell to the campus of Columbia University on move-in day. Trapping hundreds of parents and new students in Carman Hall (an actual Columbia dorm) the terrorists plan to throw one student per hour for a ten-story drop until the arms are released and delivered. That means that Dewey will have to somehow get into the building, be very, very careful not to set off any of the Semtex IED’s (which will level the building and all inside), take down the terrorists and restore truth, justice and the American way. Fortunately, he will be accompanied by a skilled FBI agent (and former Ranger from Dewey’s class) and his old comrades Katie Foxx and Rob Tacoma, operators of a security consulting firm whose principal client is the CIA and whose arsenal and skills would make S.P.E.C.T.R.E. drool. And yes, of course, the collection of Columbia dorm potential victims includes the daughter of the director of the CIA, Dewey’s close friend. Fortunately, Dewey also has the POTUS on speed-dial. Literally.The action/adventure is delicious, the ending a veritable feast. Making his way through the sewers and water pipes under NYC Dewey reminds us of some riveting scenes from wet, underground London in the fiction of Michael Robotham—a lovely bit of homage. As always, Ben Coes takes us to multiple international sites, each of which he appears to know intimately. He depicts the armament in exquisite detail, down to the last full-auto setting, and delivers a techno-thriller with the hand of a master. And no, you will not be able to put it down, so plan ahead or prepare for sleepless nights.This may just be the book of the summer of 2016.",
                "reviewVotes": "13 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "W. D. Barnum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFNWLAN7XVFFQEUOG32CPTCSKWQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R37Z8JP9AJ62ZH?ASIN=B01FKIGLF4",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 6, 2018",
                "reviewTitle": "5.0 out of 5 stars Great Plot Line",
                "reviewText": "A great plot - plenty of twists and surprises. I read the eighth book in this series by Ben Coes first. I was impressed and went back, bought the other seven books and have been reading them in order of publication. That is the order in which these books should be read, as the characters and story line link together as the series progresses.When one is reading one of the Dewey Andreas series the reader must always remember that Dewey is for all intents and purposes indestructible. He can be shot, stabbed, and thrown from tall buildings, and he will get up and still perform at the highest levels possible for a human. Just accept that, put your brain on hold in that regard, and you will find the books enjoyable.In this case Dewey takes on ISIS - so, there is plenty of Middle East action, as well as action that ends up in New York City.As in prior books in this series, the author has Arab terrorists using UZI sub-machine guns. They would never use the UZI, an Israeli weapon. Also, as in prior books, the author needs to learn that a hijab is only worn by women, and that Dewey would not be wearing one as he ran from the firefight. The author does not know weapons, but, in this book he has avoided many of the errors he had in prior books in the series - however, at one point he has Dewey move the fire selector on his weapon to \"auto-hail\". There is no such setting on any full auto firearm. It may not sound as dramatic, but the normal settings would be \"semi\", \"burst\" and \"full\".As to grammar, page 90 the author ends a sentence with a preposition, and on page 341, he again shows that he does not understand the difference between the words \"bring\" and \"take\" - he seems to most always use the word \"bring\" when he should be using \"take\". In another case, page 380, he has Dewey say \"What do you got?\" - Just bad grammar.To me these things are annoying as I read, as I am sure they are to other readers. But, not enough to take away from the overall enjoyment of the book.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paul RochonPaul Rochon",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 13, 2023",
                "reviewTitle": "Good read.",
                "reviewText": "First time reading this author. Good book. Will look for more of his books.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71iIv3ghsfL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Koch12",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 8, 2018",
                "reviewTitle": "Top thriller",
                "reviewText": "A true page turner to read through in a night. Waiting for the next set up or scenario to be solved by Bens protagonists.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Huw",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 3, 2017",
                "reviewTitle": "President Dellenbaugh in a situation with no easy solutions turns to Dewey Andreas to kill the terrorists",
                "reviewText": "First Strike – Ben Coes.When deputy of defence Mark Radiz started a multimillion dollar arms for influence programme, to get American forces out of the middle east once and for all, he had little idea that the charismatic and brutal leader Tristan Nazir would double cross Radiz and Washington to use the weapons to create ISIS and grab large chunks of Syria and Iraq.When the Milan station chief Mallory gets a phone call from someone in Nazir’s inner circle claiming to have explosive evidence about the origins of ISIS, Dewey Andreas is despatched to help Mallory retrieve the information from a café in Damascus Syria. After ISIS terrorists kill both Mallory and the source he was meeting, Dewey escapes long enough to send via mobile phone the proof that ISIS’s original munitions were provided by a black ops programme run by a person deep within the pentagon.With ISIS running low on munitions as they scorch earth across Iraq and Syria, Tristan Nazir needing one more shipment of arms has, one major last card to play kidnapping Radiz’s ex wife and daughter to create enough leverage for Radiz to send another shipment of arms to Syria.When CIA director Hector Calibrisi, finds Radiz who was trying to flee from Mexico City, and under interrogation gives up the fact another shipment of munitions is on its way to ISIS, he unravels the programme just in time for Navy Seals to stop the shipment in the Mediterranean before it reaches its destination. Nazir phones President Dellenbaugh to threaten that if the shipment isn’t allowed to continue to Syria something will happen to make him change his mind.Nazir sends ISIS operatives to takeover a student dormitory at Columbia university capturing almost 500 students and parents as hostages, unknown to him CIA director Hector Calibrisi’s daughter Daisy is one of them, pushing a hostage out of a window for every hour the ship is delayed in reaching its destination. An assault on the dorm would result in an unknown number of dead hostages, but allowing the shipment to proceed will give Nazir and his ISIS thugs enough munitions to capture Iraq and Syria their resources, creating a terrorist nation and strengthening the caliphate.With the dormitory wired with enough improvised IED’s to level it, President Dellenbaugh in a situation with no easy solutions turns to Dewey Andreas to kill the terrorists, free the hostages so that Navy Seals can go after Tristan Nazir when the ship docks in Syria.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Martin J. Hart",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on June 6, 2017",
                "reviewTitle": "Best Dewey Andreas book to date",
                "reviewText": "This is a really enjoyable book, great plot and a very plausible plot.The usual cast of characters just keep getting better, and their characters keep growing.Can't wait for more installments!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John Percival",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on August 31, 2021",
                "reviewTitle": "Action filled",
                "reviewText": "Full of action and interest",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}