{
    "remaining_requests": 1142,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Song-You-Novel-Megan-Abbott/dp/0743291727",
    "body": {
        "name": "The Song Is You: A Novel",
        "price": "$11.69 $6.76",
        "originalPrice": "$17.99",
        "rawPrice": 11.69,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Song-You-Novel-Megan-Abbott/dp/0743291727",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71qMA6y8UWL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Megan Abbott",
            "link": "https://www.amazon.com/Megan-Abbott/e/B001IODO2S/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Sold by Jenson Books Inc and Fulfilled by Amazon.",
        "customerReview": "4.1 out of 5 stars",
        "customerReviewCount": 226,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 20 mins",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 15 hrs 20 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Simon & Schuster; Reprint edition (February 19, 2008)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 256 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0743291727"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0743291729"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 8.1 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.5 x 0.64 x 8.44 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#193,445 in Books (See Top 100 in Books) #1,051 in Hard-Boiled Mystery #14,085 in American Literature (Books) #15,275 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.1 4.1 out of 5 stars 226 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Katherine Y",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2BP5YW62ZB3VR3NHPHEUNIZ2EA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3NDERG7AF0BDT?ASIN=0743291727",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Gripping noir novel about a Hollywood starlet who goes missing after a wild night",
                "reviewText": "When you read this novel, it’s as if you’ve walked into the world of late 40s Hollywood: you meet the aspiring starlets, soulless reporters, seedy hangers-on, and the whitewashing publicity machine of the film studios. Gil Hopkins, “Hop” to his friends, works for a film studio trying to keep a lid on the scandals of its roster of stars. He is visited by a woman from his past, Iolene, who reminds him of an episode two years previously. It was a night that he was out with a buddy, drinking and hitting the bars. He and his friend joined an up-and-coming starlet at her table. Jean Spangler was envied by women and wanted by men. She had Iolene and another friend with her, one that Hop was interested in. As the night progressed, two major film stars, Merv Sutton and Gene Merrel came into the club. They began to focus on Jean. Hop left with Jean’s friend after his drinking buddy left. This meant that an inebriated Jean was left with Merrel, Sutton, and Iolene. Iolene became separated from the trio. All Hop knew was that Jean Spangler had gone missing the next morning and was never seen again.Hop did his best to forget about that night. He did his best to downplay any connection he had to Jean Spangler. So, when Iolene shows up in his office, his memories are triggered, as is a dormant conscience. He starts going back to talk to all the people around Jean that night. What bothers him are two things, one: Sutton and Merrel, despite their squeaky clean image, were in private little more than degenerate thugs, and two: Iolene disappears. Hop gets in way over his head and finds there are very few people he can trust.I have to rate this novel as one of the top noir books I have ever read. The characters are believable, desperate to grasp their chances at fame and money. No one’s motives are pure, and everyone has an angle. The author’s writing places the reader in old Hollywood with the atmosphere and the sense of desperation of the once was and might be again. I was so absorbed in the story I took with me when I had to stand in line and wait for take-out. The twist at the end was brilliant. I recommend this read to anyone who reads crime fiction, especially the noir variety, and is interested in the 40s and 50s Hollywood scene.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Constant Weeder",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGFU4A7PVDXNMQDXODQM6XWFDYIA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R479AEJRSHVYM?ASIN=0743291727",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 10, 2011",
                "reviewTitle": "4.0 out of 5 stars I Wish She'd Have Gotten It Right",
                "reviewText": "I suppose that it's unfair to critique an author writing about events in 1951 when she was not present, but I insist that historical fiction should at least attempt to be accurate. I found several anachronisms that bothered me, because I was and always have been, a resident of Los Angeles. In 1951 I was a freshman at UCLA. The author refers to \"one of the sparkling pink and grey high-rises in Westwood,\" when in fact Westwood Village was exactly that in 1951, a group of small wooden buildings. She refers to the Queen Mary, but that ship wasn't retired and moved to Long Beach until 1967. She mentions Slapsy Maxie's night club, but it became Billy Gray's Band Box in 1946. One of her characters is cautioned about being arrested and sent to County Jail, when in fact he would have been sent to the City Jail which at that time was in Lincoln Heights. More care, please, author!The writing is of the Mickey Spillane school of violence and hard drinking. I did enjoy the story, though at times it seemed over the top and labored. Close but no cigar.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael G.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFGS2ZZ3V5Y75OVFQXIUFV6FPWSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RY7EXOP5MAC9K?ASIN=0743291727",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 26, 2013",
                "reviewTitle": "3.0 out of 5 stars Among the missing.",
                "reviewText": "Megan Abbott's second novel, The Song Is You, takes place in Hollywood and was inspired by the case of Jean Spangler, a bit player whose 1949 disappearance occurred at a time the infamous Black Dahlia murder was still fresh in the public consciousness. It's now 1951 and PR man Gil Hopkins finds himself compelled to find out what really happened to the troubled Miss Spangler.Wise-cracking Gil Hopkins is a rather unlikely and reluctant investigator whose search takes him into some very sordid places. Abbott pulls few punches as she describes a Hollywood rife with depravity. The fictitious plot makes little sense. Though here the author is in good company. After all, the legendary Raymond Chandler's novels only sporadically demonstrate coherency of plot.The Song Is You is latter day noir, gritty and hardboiled. An okay read, not nearly as good as Abbott's third novel, Queenpin.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "CLynn",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on May 29, 2008",
                "reviewTitle": "A Noir Masterpiece!",
                "reviewText": "This is the haunting tale told by a superb author.Megan Abbott has captured the mystery and heartache surrounding the tragic disappearance of Jean Spangler.Although fiction, it is based on the real case of this young actresses's disappearance.It is beautifully written. It's vivid and wonderfully told.It will leave you thinking about it long after you finish it.The publishing world is lucky to have found this talented writer and we are all fortunate to be able to read her wonderful books.I've read and enjoyed all of them!",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "sally",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 1, 2017",
                "reviewTitle": "the usual Megan Abbott standard",
                "reviewText": "dark and gripping. i haven't read a book of hers that i couldn't put down. would definitely recommend to anyone who enjoys noir fiction.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ldnsara",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on September 2, 2014",
                "reviewTitle": "Great noir",
                "reviewText": "Incredibly descriptive (in the vein of the old greats), full of memorable characters (both male and female, none two-dimensional) and pulsing with intrigue. I'm becoming very fond of Abbott's distinctive writing style.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "V.C. Lancaster",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on July 31, 2015",
                "reviewTitle": "I found this one a little disappointing as I read ...",
                "reviewText": "I found this one a little disappointing as I read Megan Abbott for her monumental female voices and this has a male protagonist, which drops it from her usual lofty heights to a more mundane, run of the mill noir story. Can't hold a candle to Queenpin or Die A Little, I'm afraid.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "G. Jones",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 27, 2014",
                "reviewTitle": "Atmospheric Throwback",
                "reviewText": "I have to admit I found it difficult to get into the style and the dialogue but I stuck with it and after a few chapters I was engrossed.I really enjoyed the feel of the book, the author creates a vivid set of characters and places. While they are not always sympathetic I always enjoyed following their journey.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}