{
    "remaining_requests": 1091,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hero-Novel-Thomas-Perry-ebook/dp/B0C8XK5GKN",
    "body": {
        "name": "Hero: A Novel",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hero-Novel-Thomas-Perry-ebook/dp/B0C8XK5GKN",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81eisOhJSsL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Thomas Perry",
            "link": "https://www.amazon.com/Thomas-Perry/e/B000AP7K94/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 787,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A private security agent finds that being branded as the City of Angels’ latest hero could also make her its next victim.…Justine Poole provides security for wealthy and high-profile Hollywood stars, but that all changes when a job puts her in the limelight. When she prevents a brazen robbery at the Beverly Hills home of two of her clients—killing two of the five armed robbers in the process—she is initially lauded in the media as a local hero. But the spotlight soon puts her in the crosshairs of the crime kingpin behind the burglaries.Unable to stand the embarrassment of his lackeys having been defeated by a lone woman, Mr. Conger puts in a call to the one man who can make his problems disappear. Known for his swiftness and subtlety, Leo Sealy will kill anyone for a price. All he needs is a name and a face, any starting point to pick up his victim’s trail. Luckily for him, the local news is as eager as he is for any information about the heroic bodyguard—and quick to broadcast their findings, regardless of what it might mean for her safety. But Sealy isn’t prepared for just how quick and resourceful Justine can be...So begins a cat and mouse game that only Thomas Perry—“master of nail-biting suspense” (Los Angeles Times)—could devise, featuring two characters who know more about deadly pursuit than anyone else in the business. As the hardened killer stalks her, Justine learns that the fickle media landscape can turn its celebration into condemnation at a moment’s notice, and soon finds that public opinion can be every bit as fatal as organized crime.",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C8XK5GKN"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Mysterious Press (January 16, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 16, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 4111 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 277 pages"
            },
            {
                "name": "Page numbers source ISBN ‏",
                "value": "‎ 1613164777"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,127 in Kindle Store (See Top 100 in Kindle Store) #108 in Organized Crime Thrillers #268 in Crime Thrillers (Kindle Store) #486 in Suspense (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 787 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/59813d60-8c74-41c5-86d5-45fa276d3c6e.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b5332d1d-c631-44ec-8cf9-44a45e9764ca.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/a814af30-4f95-41c8-ba88-5dd6dacffffa.__CR0,0,300,300_PT0_SX300_V1___.png",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d8f344b8-5db9-4a90-9e75-78c15f6c8db6.__CR0,0,970,300_PT0_SX970_V1___.png"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Fred H. Dimond",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF7I3ITPFV7VYFIGEGSHPWATF7UA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AQOX93NQNUY1?ASIN=B0C8XK5GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "5.0 out of 5 stars HERO - do you really fancy being one ?",
                "reviewText": "Whenever I read a Thomas Perry novel I am reminded just how good he is. The mostrecent example of this is HERO. Imagine you are a young, female personal security specialist [ aka body guard ] with aSouthern California firm. You protect high profile entertainers, business people andthe wealthy. In one instance you detect and anticipate a “ follow - home “ plot by 5 thugs who intend to assault and rob an elderly couple who have made money producing tv shows and films. You engage the thugs; they fire guns at you; you kill 2 and alert the police who capture the other 3. You are a HERO right ? Not so fast. The HERO is Justine Poole. The man who employed those involved in the “ follow - home “caper is Mr Conger, a crime boss who runs crews like the “ follow - home “ thugs. He feelshis aura of evil invincibility has been jeopardized by Justine’s remarkable feat ofsingle - handed bravery. He sends his best assassin, Leo Sealey, to destroy her. Justine’s mentor, Ben Spengler, is the owner of her firm who got her started. Sealymistakenly assumes Justine is staying at his house to elude Conger’s evil intentions .Spengler gets the drop on Sealy, but in order to make his actions look above reproachto the police, he tries to capture him without shooting him. Sealy is too quick and kills Spengler. Spengler’s siblings take over the security firm and get rid of Justine to avoid any blowback fromthe unsavory episode. The police, who are definitely behind the curve and try tomake it look like they are doing something, interrogate Justine and turn her into a suspect.They take her phone, her car and her gun. They isolate and endanger her. The pressin callous pursuit of a story publish her picture and where she lives, thereby threatening her life.Is this what it means to be a HERO ? Spengler lost his life being too careful trying to subdue a desperate killer so he wouldn’t run afoul of picky questions by the police. Justine is forced into a desperate cat and mouse gamewith Leo Sealy while the police flounder around and do nothing to help her. This is shades ofreal life, where good people often end up at odds with police while attempting to save their own lives orthe lives of others. Perry has written many books, both series and one - offs. If you haven’t ready any, getstarted. He is a great entertainer.Fred Dimond",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "B. Salinas",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUTPOB5IWS3Z7BWHGBRASZOEEAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1FEY7UM40ZGSB?ASIN=B0C8XK5GKN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 31, 2024",
                "reviewTitle": "4.0 out of 5 stars Better Than Last Book",
                "reviewText": "Have been a fan of Perry's books for years, own all. This book for me ended two pages too soon. The ending was too abrupt.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David W Putnam",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGH4D2GCO5G55APFYVOU34JRWWTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R18GGSS3MFWW7V?ASIN=B0C8XK5GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "t's difficult not to give a Thomas Perry book five stars. He's one of my go-to authors. I always pre-order his novels and this one was no different. I loved it.The writing craft is outstanding, (although, at time the distant third voice did intrude and detract a smidgen)There are two main points of view the strong female protagonist and the bad guy chasing and trying to kill her. This is a chase novel with great motivation and well drawn characters. The story is set in Los Angeles and I was familiar with many of the streets and locations which added to the enjoyment. The story is short and terse, the ending quick and deadly. If you are a Thomas Perry fan you won't be disappointed. I'm already in line for the next one.David Putnam author of the Bruno Johnson novels.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jeffrey Cochrane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLI5ODPPBEQQGJLCK7SBTTYQJCQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RW1FRYF1I0IY5?ASIN=B0C8XK5GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars Hero",
                "reviewText": "Thomas Perry is one of my favorite authors. I have read and read all his books. This one doesn’t disappoint. More than just a thriller but a sharp look at society today and how out of control parts of it are. The main character is a hero who saved a couple of lives. But the news people run with the story, and run with the story putting her in danger. Then the thriller part really kicks in. Great story. Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ignacio f.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH4GLZ6R27YASGUIX43CO42UGJHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2BM51VI3PGQF0?ASIN=B0C8XK5GKN",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "3.0 out of 5 stars Borrows a lot from the Jane Whitefield series, but generally works",
                "reviewText": "The narrative bounces back and forth between Justine Poole, the protagonist, and Leo Sealy, the hitman assigned to kill her. Both of them seemed somewhat robotic to me, although I certainly wanted to keep reading to find out how it all worked out. But \"Justine Poole\" (early on we're told that this is a phony name Anna Kepka employs for her work in security, yet Justine Poole is the only name used from then on) has a lot in common with Perry's earlier protagoniste, Jane Whitefield, a Native American who starred in five books or so that were his most popular creations. However, Jane had more personality; Justine seemed rather robotic to me as we're made privy to her detailed calculations. The killer seemed robotic as well, unfortunately, and we spend a lot of time in his head. But we never find out, for instance, if he feels differently about murdering a woman (or a child) versus killing a man. Has he ever turned a killing for hire of a female into a seeming fatal sex crime, for example, in order to make it look like the work of some active serial killer? Also, how did he get into this line of work? How many has he killed? Does he hire escorts for sexyal satisfaction, or does he have a wife or lover somewhere? None of this is covered -- but we spend a great deal of time allegedly inside his head. Now, Thomas Perry has written a lot of books, and he more or less knows how to make a certain formula work. And this one sort of works. I've read every Thomas Perry and will probably continue to do so. John Sandford's \"Prey\" novels are better, and don't have this feel of dueling robots -- though dueling robots is not all bad. If you haven't read Perry before, I would recommend going back to his Jane Whitefield novels, when he was really at the top of his game.But this book does its job. It works.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Wendy Kinney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXPG4X4B4YDCQNLMK6GQ2LIAUJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2RTC35E7IMKHM?ASIN=B0C8XK5GKN",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 25, 2024",
                "reviewTitle": "4.0 out of 5 stars Fast, funny, fresh",
                "reviewText": "Thoughtful activity told from several perspectives. Purpose and understanding, friendship and bureaucracy, preparation by memory. And in the end ...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "William",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGUV5S4L6GGAJL3ZYXKS5PDHMKGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GCD8S9RWLMDW?ASIN=B0C8XK5GKN",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 18, 2024",
                "reviewTitle": "5.0 out of 5 stars Gritty Survivalist fights back",
                "reviewText": "I cannot get enough of Thomas Perry’s genius. I read this book in two sittings over two days. Justine Poole is only doing her job when she finds herself in a shoot-or-die situation. She shoots and kills two of five attackers (three of them run away). It is a righteous shooting but things escalate out of control when the attackers’ handlers seek revenge on Justine. As her situation – and safety become badly compromised, she must use her training to stay alive as a hit man seeks her life. A total thrill ride. Hero was published on January 16th and I finished it on January 17th. Thomas Perry is near the top of my list of favorite writers.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "easyreader",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 17, 2024",
                "reviewTitle": "Big bucks No bang",
                "reviewText": "Given that he's one of my favourite authors I shelled out nearly as much for a digital read as I would for a hardcover book--and it wasn't worth it. I get the cost of producing a book, past the effort of the author, as I'm an author and a ghostwriter. Editors, proofreaders, cover artists, etc. are required. But still... Many of the main character's moves/way of thinking were lifted straight from the Jane Whitefield works and the antagonist wasn't engaging. The book felt nonsensical and vague and might have been improved by incorporating the reporter on a larger scale. Or by leaning harder on the MC's background. I blew through this in less than a day, contrary to several of Mr. Perry's other efforts.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter Hambly",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "2.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 17, 2024",
                "reviewTitle": "Not his best work",
                "reviewText": "Basically a chase story. A light, easy read. Not much to it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}