{
    "remaining_requests": 1126,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Home-Before-Dark-Riley-Sager/dp/1524745197",
    "body": {
        "name": "Home Before Dark",
        "price": "$10.83$10.83",
        "originalPrice": "",
        "rawPrice": 10.83,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Home-Before-Dark-Riley-Sager/dp/1524745197",
        "soldBy": {
            "sellerID": "A15SB3XUXOLO10",
            "name": "NWFL Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A15SB3XUXOLO10&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41Fu t9FYYL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/31RhNW6a4lL.jpg",
            "https://m.media-amazon.com/images/I/51vF32PjbeL._SX35_SY46.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Riley Sager",
            "link": "https://www.amazon.com/Riley-Sager/e/B071D6HYJK/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "NWFL Books",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 16317,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35. Order within 14 hrs 18 mins",
            "Or fastest delivery Tuesday, February 20",
            "FREE delivery Friday, February 23 on orders shipped by Amazon over $35. Order within 14 hrs 18 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Dutton (August 31, 2021)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 416 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1524745197"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1524745196"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 2.31 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.44 x 0.86 x 8.2 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,812 in Books (See Top 100 in Books) #151 in Murder Thrillers #387 in Psychological Thrillers (Books) #619 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 16,317 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ahygeetee",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG7E5R6O77JGJKF7DF6LXGIALPNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1OMDBUJG4UHB0?ASIN=1524745197",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars A chiller from start to finish",
                "reviewText": "This book made me question my own house and the stories it could tell. Let’s just say for the first 2/3 of the book I could only read it during the daytime.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "FaithOryx",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFHQSN42GQNQBS2UM3FXBCC6ZT7Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3OFOP6UIK8007?ASIN=1524745197",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 4, 2020",
                "reviewTitle": "4.0 out of 5 stars Highly Enjoyable and Lots of Bumps in the Night",
                "reviewText": "I've read all four of Riley Sager's novels. I've liked them all and thought all four would make fantastic movies. But I think Home Before Dark is his best work to date. It's not as throwback or fun as Final Girls and it didn't have the same romantic ambiance of Lock Every Door, but this one was really balanced and well crafted. There's something about Sager's work I've realized the fourth time in. His work always seems \"familiar\" to me, as though I've read or seen the concept before. But I actually had a realization in this book that this style may actually be on purpose. I actually love a homage and, in this book, it's just too obvious to miss. So yes, it's like an idea you've seen, but a completely fresh angle.In this one we have Maggie, a thirty year old interior designer, who is famous for being the surviving child/victim in a non-fiction book written by her father about a haunting they experience in a rambling Victorian home they lived in 25 years prior. The book has defined her and she despises it. She has no memory of the actual events and is convinced her dad made the whole thing up just to profit. And profit they have. The money has paid for her education and their lives and she's just inherited the entire share after her father's death.... including the house itself.She makes the decision to go back to the house, despite a death bed promise to her father that she won't, and her mother's insistence as well (who offers to buy the house off her, as she's now remarried to a realtor). There was a tiny lapse in logic here. It was clear her parents are desperate for her to NOT return to the house. So I found it amazing they left it to her in the estate. But lapse of logic aside, and putting myself in Maggie's shoes, I would ABSOLUTELY go back to the house to see if I could figure out what happened. Especially to see if the memories would come back from living in the house.So off she goes with a double agenda. To realize the mysteries of her past while being productive and renovate the house to sell. The cast of characters from her perspective is largely limited to the people from the book itself, people her family knew as a child... neighbors, police, locals, etc. She has a female friend and business partner but that interaction is limited to cell phone communications. The friend, Allie, was the weakest link character as she only serves as a plot device to give updates and is not a realized character.Another Riley Sager style is the flashbacks. I did not like the device in Lock Every Door (the story is told from the same character's POV but from a future self and a current self told side by side). But in this book, it really worked. As Maggie is going through the motions of the current day mystery, etc., we get to read portions of her father's book in which she is the main character. So her father, in present day deceased, is the other main character and his story of the haunting is told from his perspective. There was only one moment I lost track of the POVs but, overall, Sager did a great job of giving both characters a unique voice.I had a small issue with the ending simply because it was super rushed. Just BAM, BAM, BAM. That being said, Sager pulls off the difficulty of giving us a satisfying ending in a horror novel. And, yes, I've seen the other reviews in which it's questioned if this is a horror novel. I say, yes, absolutely. It's more horror than any other genre. I would not expect to be \"scared\" as it's not that type of novel. It's more like atmospheric horror with a mystery at the center. And it leaves enough open that we are left to wonder and question, while still being given a very solid conclusion.Overall highly recommended if you love all the stuff I love... old Victorian houses, trips to libraries to do research, mysteries and investigations, old love letters, family and town folklore, ghosts, etc. I think this book is a real treat and absolutely to be enjoyed.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEUUYICDZSPXV2XRF7Z65N5BU4CA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2TCZX243XUWGO?ASIN=1524745197",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Story telling is stellar and so are the unending twists!",
                "reviewText": "My first read from this author was “The only one left” and it was a five star for me so I purposely checked out other novels from him and I was happy I did! This book is another 5 star! I love the story-telling, love the plot and twists! I have never ever guessed the ending. I highly recommend this book!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DoomKittieKhanDoomKittieKhan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF3KFCH2SB5WE3C5IZDGA2SH3EYA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1RFXLEJPB89RO?ASIN=1524745197",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 23, 2020",
                "reviewTitle": "3.0 out of 5 stars I was dragging my feet to finish one of my most anticipated books of 2020...",
                "reviewText": "** spoiler alert ** Riley Sager is an author that I will automatically buy. I remember reading Final Girls when it first came out and throwing it across the room when it got to the climax, not because I was frustrated, but because I was excited for the story that Sager was spinning. I am a devoted fan, and while I acknowledge that Sager's writing leans toward reboots of horror tropes, I still seek out the thrill I get from reading his books. All this to say that I was incredibly surprised to find that I was dragging my feet to finish one of my most anticipated books of 2020 - Home Before Dark.In Home Before Dark, Sager plays to his strengths of reconfiguring one of our canon works in the horror genre, The Amityville Horror. This is familiar territory for Sager. Each of his previous books stands as a tribute to similar horror sub-genres or a specific work. Final Girls was a slasher throwback reminiscent of the movie Scream, The Last Time I Lied can be tied to Friday the 13th and Sleepaway Camp, and Lock Every Door was a clear love letter to Ira Levin and Rosemary's Baby - in a fitting tribute, the book is even dedicated to him.I've seen other reviews compare this book to The Haunting of Hill House, and I think that is an apt comparison. It is worth noting though that, if we are using the show as our example, the first episode lays out exactly what the older brother experienced and then wrote about that made the estate - and his family - famous. As the show reveals through all the following episodes is what the rest of the family experienced that was left out of his book. In Home Before Dark, we do see a similar play between constructed truth, the faultiness of memory, and the apparently supernatural.Maggie Holt is the daughter of Ewan Holt who wrote 'House of Horrors', the book that has plagued her life since she was a child. In 'House of Horrors', Holt explains why his family fled in the middle of the night from their recently purchased home in rural Vermont - Baneberry Hall. Holt weaves a story of a haunted house that is doomed to repeat its tragic past with each family that occupies its walls. The problem is, while Maggie is a starring character in her father's book, she remembers next to nothing about when her family lived at Baneberry Hall. Convinced her parents lied about the contents of the book, she has grown-up frustrated and hurt by their chicanery.The book opens when we learn that Maggie's father has recently died and she discovers that Baneberry Hall now belongs to her. Determined to uncover any repressed memories she has of her time at the house, Maggie decides to return to Baneberry Hall to not only flip the house for resale, but to do some much needed soul-searching. Once back at Baneberry Hall, Maggie connects with the locals who remember when the Holts lived there and help Maggie put some of the pieces of her memories back into place. Consequently, Maggie learns what parts of 'House of Horrors' were fictions and which hold up as truth.Following the pattern of Sager's previous works, Home Before Dark jumps between the present day and flashback scenes. However, unlike the previous novels, Home Before Dark exercises this plot device to excess. The structure of the book is arranged so that nearly every other chapter is from Maggie's present day perspective punctuated by Holt's original text - 'House of Horrors'. While this effectively syncs up the events and peculiar happenings we experience with Maggie, with her foreknowledge of her father's book, it ultimately leaves readers deflated and following irrelevant and unnecessary red herrings. In fact, it isn't until the last 20 pages of the book that \"all becomes clear\" in an almost too tidy fashion that left me incredibly unsatisfied while Maggie is finally at peace with her past.An added frustration I noticed with this plot structure was that, if the fonts had not changed to indicate to me whose story I was readying - Maggie's or Ewan's - their 'writing' voices were exactly the same. It's not clear if this was intentional because Maggie had internalized her father's book, or just a bad choice on Sager's part. Either way, I would have liked to see more distinct characters emerge from these pages.Near the end of the book, when Maggie does finally learn the full truth of her past, what does she decide to do with that knowledge and her newfound sense of agency? She writes a sequel to 'House of Horrors', and in a bait and switch ending, we realize that we've been reading Maggie's book ' House of Secrets' alongside the text of 'House of Horrors'. I cannot decide if this was a brilliant literary move on Sager's part...or manipulative. Yet again reinforcing that information has been withheld from the reader all along. Regardless, there might have been a more engaging ways to have set up this frame narrative more along the lines of The Golden Notebook or even an interactive approach like in S..Lost somewhere between uninspiring character development, withheld information, the split timelines, whiplash frame stories, and the grand reveal, Sager didn't leave much for readers to hold onto. However, Home Before Dark is still an enjoyable read for what it is. It still has many of the typical Sager marks of excellence, but I nearly DNF'd this book and only my loyalty to the author kept me going.",
                "reviewVotes": "23 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://images-na.ssl-images-amazon.com/images/I/518TtUAHolL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "HuskyPup840",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFN2C36NTX2EPJMODPYQPYYQBU3Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3TQYSSDR6GYFF?ASIN=1524745197",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Amazing book",
                "reviewText": "Great book! I’m not normally a reader, but I couldn’t put this book down - great story!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jan Bromagen",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGOPHTC3MAQRSVJL4QLQGJUXOWMA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2OEPK130OAVLD?ASIN=1524745197",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "4.0 out of 5 stars Not My Favorite of His",
                "reviewText": "I have read several of Riley Sager’s books. This was not my favorite but it did keep me interested until the end. It had some twists and turns that kept you guessing until the end. I really enjoy that in the books I read. It was a quick read and pulls you into it right out of the gate.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bekah Guntrum",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEF3SV353FU2OKSCBYSKCYKW7EGA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R113CSQKFU06Z?ASIN=1524745197",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2024",
                "reviewTitle": "5.0 out of 5 stars Kept me on the edge of my seat!",
                "reviewText": "This book had me hooked from beginning to end! Every time I thought I’d had it figured out there was a new twist, with an ending I didn’t see coming. Very exciting read and can’t wait to read more from this author!",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Mike 27",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHTSLW6NZ4GXQPYNKOOTLJNPHIPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GUZRASS0GSJ0?ASIN=1524745197",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Solid four and a half stars!",
                "reviewText": "Really enjoyed this book, not my first Riley Sager experience.I have been craving a good \"haunted house\" tale for awhile and this satisfied that craving. Very good backstory and interesting setup. Add in a few twists and one or two \"oh Hell no\" and you get a very good tale. Stick with it and I think you will enjoy it as well...It's not what you think.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 16, 2024",
                "reviewTitle": "Woahh",
                "reviewText": "This was my first Riley Sager read- I absolutely loved it. What a crazy messed up ending. The paranormal activities and the deaths entwined.. also, there weren't dozens of characters so it was easy to follow. I definitely want to try another from Riley Sager. I didn't mind the two naratarors. One being Maggie and the other being Ewan, her father. It all flowed together smoothly.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelly Rabelo Tranalli",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on August 1, 2021",
                "reviewTitle": "Uma leitura muito boa!!!",
                "reviewText": "No começo achei um pouco arrastado, mas tudo se fez necessário para a história e seu desfecho!!! A cada momento a gente acha que está conseguindo solucionar, descobrir os entraves, mas é instigante até a última página!!!! Adorei e recomendo!!! Para quem lê em inglês o vocabulário é tranquilo!!!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Angel79",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 3, 2024",
                "reviewTitle": "Super",
                "reviewText": "Mein erstes Buch von Riley Sager.Die Story ist fesselnd und gut geschrieben.Mit dem plottwist habe ich überhaupt nicht gerechnet.Ein gelungenes Buch.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "victoria ferguson",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on January 20, 2024",
                "reviewTitle": "One of the best books I’ve read",
                "reviewText": "Riley sagers best book in my opinion, I thought I kne where this book was going and it threw me through several loops. Major twists!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "kollin marc",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Belgium on November 23, 2023",
                "reviewTitle": "okidoki",
                "reviewText": "alles ok",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}