{
    "remaining_requests": 1312,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Cruel-Logic-Brian-James-Godawa/dp/1942858914",
    "body": {
        "name": "Cruel Logic: The Philosopher Killer (Theological Thriller Novels)",
        "price": "$15.26",
        "originalPrice": "",
        "rawPrice": 15.26,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Cruel-Logic-Brian-James-Godawa/dp/1942858914",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "2",
        "stockDetail": "Only 2 left in stock - order soon.",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41G6F1kL5NL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51LFpmZZ8SL.jpg"
        ],
        "imagesCount": 2,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Brian James Godawa",
            "link": "https://www.amazon.com/Brian-James-Godawa/e/B082T3J3PL/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.4 out of 5 stars",
        "customerReviewCount": 238,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 17 hrs 38 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tuesday, February 20. Order within 17 hrs 38 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Warrior Poet Publishing (July 31, 2023)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 408 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1942858914"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1942858911"
            },
            {
                "name": "Reading age ‏",
                "value": "‎ 17 - 18 years"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 1.2 pounds"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 6 x 0.92 x 9 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#57,835 in Books (See Top 100 in Books) #587 in Christian Mystery & Suspense #2,649 in Psychological Thrillers (Books) #6,383 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.4 4.4 out of 5 stars 238 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "LoveToRead",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGHWFDM6XAPNRAMKTDDEHGTJLKBA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R22UL13YIFBV5I?ASIN=1942858914",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellent Illustration of Apologetics and the Folly of Unbelief",
                "reviewText": "Cruel Logic is not for the faint of heart or those with a thin stomach lining. This is a horror/thriller novel. It is graphic in terms of violence, murder, sexual licensiousness, and profanity. HOWEVER, this content is precisely what enables this novel to expose the folly of unbelief; showing the reader a glimpse of the futility of life without the Triune God of Scripture.For one who is watching what is going on around us today--Critical Race Theory, pervasive LGBTQ+ ideology and other sexual pervions, neo-Marxism's \"long march\" through the University, etc.--the graphic and explicit content is precisely what we see around us. For those who want to believe that progressive sexual ideology and BLM activism are just nice, \"peaceful,\" wholesome expressions of human sexuality or pursuits of justice, these very features of Brian Godawa's Cruel Logic will be a needed wake-up call to the very real challange before us today. Several of the characters in Cruel Logic swear and commit heinus sexual deviations because that is par for the course in Antifa circles andsexual-revolution-praising progressive culture making headlines. A novel where protesters shout \"O fiddlesticks\" or where free-sex activists practice side-hugs during university \"sex week\" would not be painting a true picture of what is happening on campuses throughout the USA!I begin this review this way because some one-star reviewers have critiqued this as somehow not really a Christian novel due to these graphic features. They have described it as \"pornographic.\" Some even say it mocks Christianity and Christian belief. The type of reader who prefers to read Amish Christian romance novels or \"white hat vs. black hat\" style good and evil novels where the \"white hat\" cowboys always come away the winner will probably feel this way about Cruel Logic. But I pray that faithful Christian readers will have more discernment than these reviewers.The real people who should be critiquing Cruel Logic are those liberals, secularists, and neo-pagans whose wordviews are exposed via the dialogues and lecture snippets of this novel. If you are pro-LGBT+, you will be infuriated to see the instability of that worldview exposed and critiqued in Cruel Logic. If you are pro-Abortion-up-to-the-point-of-birth, you will be infuriated to see that worldview exposed and critiqued. If you are pro-CRT, you will be infuriated to see that worldview exposed and critiqued.Who should find Cruel Logic fascinating and thrilling? Several kinds of people should. Those who want more than just the rage-inducing soundbytes from the conservative media sources (even if they agree with those sources)--who actually want help defending the truth of Christianity against the progressive insanity that is everywhere today. Those who want to learn about the philosophical presuppositions of progressivism. Those who feel that they learn best from hearing stories. (It's no accident that God has chosen to reveal his truth in a Scriptural form that is highly narratival!)Contrary to some of the claims of the one-star reviewers, this book is HIGHLY VALUABLE as a resource for learning the centrality of the self-attesting Christ of Scripture for making sense of life and giving an account for the reliability. Yes it exposes the weaknesses of pietistic Christianity which lacks depth of doctrine, lack of catechesis, and anemic exegesis and exposition. But that does not make it a book that is contrary to Christianity, Christ's church, or the infallible/inerrant Word of God. It was not an evangelistic tract, though detective Van Til does actually share the main elements of the gospel with the main character, Joseph.This novel isn't the only way to expose the godlessness of the secuar and neo-pagan west, but it is one effective way. If you're wanting to read a clever story with plot twists, cliffhangers, and a compelling setting and plot arc, Cruel Logic is worth your time. But don't just plan to breeze through a story, plan to learn from these characters. You will be entertained, yes, but you will also be better equipped to contend for the Christian faith in a godless age.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ninecuritiba",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH2BUDAXEOPCVZTVQORG367MFPFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CK06SJZWDV0U?ASIN=1942858914",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 21, 2023",
                "reviewTitle": "5.0 out of 5 stars A Thought Provoking Psychological Crime Thriller Masterpiece",
                "reviewText": "I am genuinely enthusiastic to write a book review for Brian Godawa’s new novel Cruel Logic. It is definitely one of the best novels that I have read in a long time.Cruel Logic is a psychological crime thriller and fictitious religious deconversion story woven into one book. It is about a professor who is a psychopathic murderer who likes to engage his victims in philosophical debate about why he should not kill them and a freshman in college whose Christian faith slowly unravels. The author Brian Godawa masterfully weaves their stories together in his narrative by showing how certain philosophical ideas influence both characters’ actions. The main protagonist in the novel is a psychologist who constantly wrestles with his own philosophical convictions while trying to help track down the psychopathic murderer. Storywise, the novel is very suspenseful. It is full of many surprising plot twists and turns. It definitely keeps the reader guessing about the story’s outcome until the very end. That is why I found the book very engaging and hard to put down. What also made the book very engaging to me are the various philosophical debates that the murderer has with his victims throughout the story. In each debate ideas from famous Western intellectuals such as Plato, Aristotle, Kant, Marx, Nietzsche, Darwin, and Freud are debated and argued to their logical conclusions. Each of these debates are mini masterpieces of dialogue. Whether you have a philosophical background or not they are rather easy to follow and they concisely summarize different schools of thought. Indeed, I believe that this book can serve as an introduction to Western philosophy for anyone who has never studied it before. For those who have studied Western philosophy before like me, it is able to serve as a good refresher reference. depiction of modern campus cultureWhile I found Cruel Logic to be very engaging because of its suspenseful storyline and insightful philosophical dialogues, I also found the novel extremely intriguing due its very realistic depiction of modern campus culture. As the story about the freshman’s faltering Christian faith unfolds, the reader is exposed more and more to the ideological indoctrination going on in higher education that is part of almost every college and university today. In my opinion, this realistic exposure is a feature of the book that makes it very interesting to read apart from its other good qualities.Stylistically, Cruel Logic is written in a very lucid and terse prose that allows the reader to read rather smoothly and quickly. I hardly ever found myself slowed down in my reading by any cumbersome passages. While some of the strong language used in some of the dialogues might be unsettling to certain readers, it is never used gratuitously. It is always used to make conversations between certain characters realistic.While Cruel Logic is technically a hybrid psychological crime thriller/faith deconversion novel, it also is somewhat of an ingenious satire of contemporary, secular Western culture. It truly does a great job of subtly ridiculing the ideas that are driving our contemporary society. By the end of the book, I cannot help but think that any thoughtful reader will not see the absurdity that results from people’s commitments to certain contemporary secular ideas.As I stated in the beginning of my review of this book, this is one of the best novels that I have read in a long time. I sincerely believe that it is a fictional masterpiece that will engage all kinds of readers. On its surface level the novel is just a great thriller that will keep anyone who likes a good suspenseful story turning the pages. In fact, I was often afraid to turn the page. But I couldn’t stop. On a deeper level it is a great critique of contemporary secular culture that will give philosophically inclined readers much to think about. It is for these reasons that I think a wide spectrum of readers will enjoy reading this book. So, I encourage anyone who reads this review to buy the book and read it. It definitely will be worth your money and time.",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael F. ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 8, 2024",
                "reviewTitle": "Absolutely relevant today!",
                "reviewText": "After a slow start, this book takes us on a rollercoaster ride through modern philosophy from Marxism to feminism, gender theory and critical race theory.Godawa resists straw-manning them, but has his characters debate from their standpoints as if their lives depended on it. No holds barred. A surprise twist ending.The parallel plot of the University students also taking their beliefs to their logical conclusions and how these interlock with other groups who may or may not be allies is also very instructive. Once again Godawa footnotes his novel, to show that some things too extreme to be believed are taken from real world sources.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SFW",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 11, 2023",
                "reviewTitle": "A TIMELY DEPARTURE.",
                "reviewText": "Cruel Logic is a new and timely departure for Brian Godawa who gives us a hard-boiled novel about a serial killer, at a Woke controlled university. Professor Charles Cullen seizes other university professors and engages them in a debate about his moral right to kill them. He will spare their lives if they give him a moral reason not kill them.In portraying Cullen, Brian engages our attention on an investigation into the ultimate and fundamental nature of reality. Tried for murder, in the dimension of our Space/Time reality, Psychology and Psychiatry has ensured for Cullen a diagnosis of Antisocial Personality Disorder and a verdict of Guilty but Mentally Ill that, with cruel logic, Cullen sets out to overturn and to show that he is sanely justified in his right to kill, and was locked up in a psychiatric ward (from which he escaped) because of human social constructs.All his captive professors are evolutionists, feminists, biologists, gender theorists and he debates with them according to their philosophies, psychologies, social constructs, and World Views, about the universe and humanity’s place in it. None give a solid foundation for morality, and face the consequences of their own beliefs.Brian holds our interest using two stories. One: the tracking down of the killer, the other about a young evangelical Christian who, in university for the first time, loses his faith and becomes Woke. His Christian faith is deconstructed by his being seduced physically, psychologically and spiritually, by those intent upon de-christianizing his faith.None of the Humanist World Views debated seem to understand that if there is no God then life in this world is meaningless, and there is no good, no evil and therefore any behaviour is permissible. To allay this, Humanists borrow the good practices they have from a world with God, and then deny there is a God, to become Homo Deus on earth, depriving themselves of a moral foundation for what they create and believe in.The psychologist, Joseph, and the policeman, Van Til, fight against Woke to defend Western Civilization and the teaching of its history and its moral foundation in Christian belief.Brian combines in an interesting way, the intellectual ideas of philosophy, psychology, theology, and metaphysics, and takes readers on a dramatic exploration of what is lacking in his characters beliefs and philosophies, hoping his readers will think about their lives, beliefs and World Views in an existential way. And so, we meet along the way the ideas of Marx, Nietzsche, Derrida, Freud, Jung Lacan, Kristeva, Cameron and the “performative” Butler.The reader encounters many surprises in Cruel Logic which leave him or her with a choice of realities: a reality created by humans in our dimension, which more and more is calling good evil, and evil good, or, a God-created reality of dimensions which astrophysicists tell us exist, (at least of ten dimensions) that we cannot see or experience with our senses, and which came into and joined with our dimension when, to use a Hebrew word, yeshua meaning salvation was born into our world as Yeshua.Brian deals with evil in a hard-boiled realistic way, and as things progress there is a degradation of behaviour and language which becomes ugly, vulgar, nasty and profane, in keeping with the premise showing the debased practices stemming from Modern, and Post-Modern philosophies: the un-natural behaviours of homosexuality, abortion on demand, and corruption of Children, as the Christian family is deconstructed, along with the belief that God, who made the world in the first place, is remaking it through Yeshua and His Spirit, and that humanity is called upon not to become less human, but to celebrate its rescue, redemption and remaking, and to become truly more human.Brian in Cruel Logic shows us a devastating, harrowing, dystopia, where minds are devoid of love, emphasising the point that without God and His Messiah, there is hatred, chaos, anarchy, carnage, and death.George Washington in his first inaugural address on Thursday April 30th 1789 said: “The propitious smiles of Heaven can never be expected on a nation that disregards the eternal rules of order and right which Heaven itself hath ordained.”Thank you Brian for Cruel Logic at this time in the history of Western Society.If after reading Cruel Logic you would like to read the other side of the coin, also hard boiled and without sugar coating, which deals with crime and evil, but shows the true stature of what human beings, made in the image of God, can become, check out “Breath of God,” by Stanley Oliver, on Amazon.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Shaz Ginns",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on September 28, 2023",
                "reviewTitle": "Frighteningly timely, shows the destructive practices currently employed by ‘higher learning’",
                "reviewText": "A truly engrossing read, you don’t support the villain but can’t help but be impressed as he deconstructs the ‘arguments’ of his victims. Great Christian fiction but more than that a great thriller that should cross all barriers. Looking forward to more books like this that don’t pulled their punches.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "yolf04",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 12, 2023",
                "reviewTitle": "There's a murderer loose and he wants to know why each victim should allowed to live!",
                "reviewText": "Where to begin! The writer takes you on a roller coaster ride weaving through some very dark twists and turns. A must read on many counts but also to get an understanding as to what really is taking place under the guise of a liberal progressive culture and how education has been hijacked. This is a psychological thriller that has no holds barred, the characters are well developed, and it takes you into situations that are based on many real-life scenarios. It also gives you the opportunity to be a ‘fly on the wall’ in various situations whereby you can pause and reflect on how you would respond to various ideologies / belief systems. The challenge is do you just believe what you’re told via the media (tv, social etc) or are you prepared to do your own research into a pursuit of truth.We are now in a world that seems to promote that good is evil and evil is good. Indeed, is there even a difference? Is it just a figment of the imagination whereby you have your truth and I have mine? Can order come out of chaos or does it just promote a greater degree of lawlessness whereby the survival of the fittest ultimately overcome? And at what cost? You get to choose but beware your actions (or inactions) have consequences! Read this book and be prepared to take the challenge!I thoroughly enjoyed the ride and look forward to the next book in this series.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kate Matos",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on September 12, 2023",
                "reviewTitle": "Ideas have consequences, and some are deadly.",
                "reviewText": "‘Give me one good reason why I shouldn’t kill you?’ Is Culler really insane or just a pure evil? Who determines what is moral? Why is there so much evil in the world? A masterful plot with unexpected twists, answers to hard questions and challenges of postmodern higher education system.A real page turner for me and a great narrative. I enjoyed this book a lot. I’m a mum, so Danny’s story especially touched my heart.Highly recommended.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}