{
    "remaining_requests": 1302,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Sharp-Objects-Gillian-Flynn/dp/0307341550",
    "body": {
        "name": "Sharp Objects (Sharp Objects: A Novel)",
        "price": "$10.87$10.87",
        "originalPrice": "",
        "rawPrice": 10.87,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Sharp-Objects-Gillian-Flynn/dp/0307341550",
        "soldBy": {
            "sellerID": "A25H6JFKDMQ758",
            "name": "-OnTimeBooks-",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A25H6JFKDMQ758&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "80",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/71-JO+PSPwL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Gillian Flynn",
            "link": "https://www.amazon.com/Gillian-Flynn/e/B001JP3W46/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "-OnTimeBooks-",
        "customerReview": "4.2 out of 5 stars",
        "customerReviewCount": 63417,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 37 mins",
            "FREE delivery February 29 - March 4 on orders shipped by Amazon over $35",
            "Or fastest delivery February 27 - 29"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b?ie=UTF8&node=10457"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Crown; Reprint edition (July 31, 2007)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 254 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0307341550"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0307341556"
            },
            {
                "name": "Lexile measure ‏",
                "value": "‎ HL770L"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 7.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.19 x 0.58 x 7.98 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#3,781 in Books (See Top 100 in Books) #192 in Murder Thrillers #476 in Psychological Thrillers (Books) #795 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.2 4.2 out of 5 stars 63,417 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Ricci",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEDYPCB3FK7DHQNU7YW6RPZY6AAQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RZ0SLT4L939NT?ASIN=0307341550",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars love everything about it",
                "reviewText": "Twisted, raw and pain filled honesty. Clear picture of how we can love someone but also hurt them at the same time. Great book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dino Parenti",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEQY4KKHSM4OXPR3CUAKSQGN34Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3PPFE3O7LTMBI?ASIN=0307341550",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 14, 2014",
                "reviewTitle": "4.0 out of 5 stars Women at war",
                "reviewText": "(Original review appears in Pantheon Magazine at http://pantheonmag.com/book-review-sharp-objects-by-gillian-flynn/)At some point in most novels, a paragraph or single sentence, cleverly situated in a way that isn’t expository, etches in thumbnail the major theme of a work. The better ones find ways to incorporate it as direct function of character, as in the following:\"I felt no particular allegiance to this town. This was the place my sister died, the place I started cutting myself. A town so suffocating and small, you tripped over people you hated every day. People who knew things about you. It’s the kind of place that leaves a mark.\"So muses Camille Preaker, Gillian Flynn’s restless reporter and sardonic anti-heroine from her debut novel, Sharp Objects. With the current buzz still humming over her latest book, Gone Girl—with film adaptation by David Fincher slated for October of 2014—revisiting her first book seems an apropos primer of this dark and penetrating author.Camille’s a journalist for The Daily Post, the “fourth largest in Chicago,” a newspaper with its head barely above water, and whose editor, Frank Curry, mines the cold-case files for the next human interest tale sure to snag a Pulitzer. When the disappearance of a second girl occurs in the town of Wind Gap, Missouri, he dispatches the reluctant Camille at once to get the scoop.There’s only one problem: Wind Gap is Camille’s home town. Wind Gap hasn’t been good to Camille, a place she has shunned for eight years. A place she describes as “One of those crummy towns prone to misery.” She says this not from dread, but from a quietly haunting intimacy with torment. At the start of the novel, we learn that Camille’s been freshly released into the world after spending several months under psychiatric care. She’s a cutter, specifically of words. Her body is a monument to insecurity and anger, starting at the age of thirteen with Wicked carved into her left hip, and stopping at twenty-nine with Vanish. The only unmarred spot on her body is a circle of perfect skin the size of a fist, on the small of her back which she could never reach.As with most any self-mutilation, it’s but the physical manifestation of deeper emotional traumas, in Camille’s case prompted by the death of her younger sister, Marian, from an ambiguous illness. The tension surrounding this mysterious passing serves as lynchpin for her strained relationship with her mother, Adora, Wind Gap’s unspoken matriarch. Wealthy, priggish, steeped in passive-aggressiveness and secrets, Adora is never sparing of her disdain for Camille, telling her in a casual manner: “You remind me of my mother. Joya. Cold and distant and so, so smug. My mother never loved me either. And if you girls won’t love me, I won’t love you.”The other of the girls she refers to is Camille’s half-sister, Amma, a sexually hyper-developed thirteen year-old who heads a clique of equally spiteful girls, and who in many ways is her mother’s equal in cruelty and malice.Rattling between the warring factions of her mother and step-sister, Camille attempts to investigate the abduction-murders in Wind Gap. When the missing girl, Ann Nash, turns up dead not long after her arrival in town—found strangled within a cleft between two buildings, her teeth yanked out (a virtual carbon-copy of the first victim, Natalie Keen)—Camille finds little help from the male authorities. Men view her as suspicious, an outsider with a dubious agenda, yet the scorn doesn’t surprise or upset Camille. She’s used to it. Other than her boss, Frank, who’s a well-meaning but scattershot father-figure, men are often portrayed as dichotomies rather than with any subtlety or depth. They’re afterthoughts, fleeting, a part of the scenery. This isn’t a detriment to the book; they are as Camille sees them based on her experiences. Bill Vickery, the police chief, is an all-business cipher, dismissive of theories that don’t fit his own. The fathers in the book, namely those of the two victims, as well as her own step-father, Alan, are ineffectual and milquetoast. Even one of the chief suspects, the second victim’s father, Bob Nash, is such a laconic wallflower that even Camille’s suspicion of him is passive.Her impulse is to be drawn towards the damaged sorts. The dark and the indifferent. She says of some teenage boys preening on the street: \"Those kids, cocky and pissed and smelling like sweat, aggressively oblivious of our existence, always compelled me.\"Two men eventually serve this function for Camille. The first is a cocksure detective visiting from Kansas City, Richard Willis. His interest in Camille is obvious to her from the start, and though attracted to him as well, she’s apprehensive. She keeps him at arm’s length, at first engaging in a mutual pact of information gathering from his end in exchange for company and candor from hers. But the dearth of intimacy in her life eventually topples the pact into the sexual, albeit mostly clothed in Camille’s case, as she’s reluctant to let any man know that she’s a cutter.That revelation is ultimately bestowed upon John Keen, the second victim’s older brother and on-again, off-again murder suspect in what passes for the book’s most tender, affectionate scene in a roadside motel.It isn’t long though before Camille realizes that her best chance to secure clues or leads resides within the secretive cliques of female enmity prevalent in Wind Gap. It is a private world where women hurt each other both overtly and passively, even at funerals. Where gossip is both weapon and shield, wielded for social advancement. This antagonism lies at the core of Sharp Objects. The book is less murder mystery and more an exploration of the cruelty that women inflict upon one another, be it friend to friend, classmate to classmate, sister to sister, or mother to daughter—all of which play a role, often spanning multiple generations.Not even the two murder victims are immune from this hostility, as it is gradually learned through Camille’s piecemeal interrogations of witnesses and suspects. The first victim, Natalie, had assaulted a female classmate back in Philadelphia; “They saved her left eye,” is all we’re left to know. The second victim, Natalie, is a chronic biter, one of her victims being Adora who used to watch over both girls at different points, thus relegating her eventually to the suspect list.But the cruelty isn’t limited to others. They’re just as adept in dispensing it upon themselves. Self-abuse runs rampant, from Adora’s intractable plucking out of her eyebrows while tending to her dying daughter, Marian, to Camille’s equally impulsive drinking and cutting, the latter acting as a coping refrain throughout.Number of synonyms for “anxious” carved in my skin: eleven, she ponders at one point. Later on it’s, Unworthy flared up in my leg, followed by, Belittle burned on my right hip, and so the scoring goes.At the heart of it all burns a generational war over control, status, and vanity. Camille and Adora’s relationship, cleaved forever with the death of Marian, is in a persistent state of escalation, even in absentia. Upon Camille’s return to Wind Gap, Adora wastes no time exercising all the petty cruelties and power-plays while shamelessly utilizing the plausible deniability of victimhood, all of which Camille is privy to from the get go.Every tragedy that happens in the world happens to my mother, and this more than anything about her turns my stomach.Adora’s grief at having lost Marian has become a virtual hobby, one that she attempts to relive again through her two other daughters. Camille soon realizes that the milk and pills Adora’s been giving them both as “relaxants,” are in actuality making them sicker by the day, especially Amma who’s been subjected to it longer. This prompts Camille to track down the nurse that ministered to Marian during her final days, and through the rediscovering of original medical files that had been tampered with, it is learned that Adora had been slowly poisoning her first daughter for years.Much of this serves the logistical and procedural facets of the book however, which in many respects is the least important aspect of an otherwise compelling but ruthless character study of a woman at war to wrest her identity from history and genetics. When the killer of the two girls is eventually “revealed,” you’re more beleaguered by the inevitability of it than you are shocked. But it’s only because Flynn has artfully played with genre expectations and structures to lead one to such a conclusion. A twist is added near the end that upends the original reveal, and it’s a shocking revelation if unexpected, a sad one if anticipated. A kind of perverse circle has closed, and in the middle sits Camille, perhaps finally with the determination to pierce through it.",
                "reviewVotes": "16 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "L A S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEXIVEZN7FHNFSC3O4ABU2S2HLNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R198VJOYU2OAMA?ASIN=0307341550",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars Would read again",
                "reviewText": "Book in great condition!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Cat Daddy",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGEJFSB3KPUEXS7AWHCRQG4JHRNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZQ82AEDAALIL?ASIN=0307341550",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 2, 2024",
                "reviewTitle": "3.0 out of 5 stars TV show was better in my opinion",
                "reviewText": "And that is very rare. I really like the idea but don’t think that it was executed very well. I feel that so many instances and conversations were unnecessary in the story telling, and this really could have been wrapped up sooner. Gillian really gave bone work where it wasn’t needed and skimmed where it was.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Harlequin",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEJPWLS2KTKV4DUC4MFQJUYT2SCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KNH42ODCZ0SI?ASIN=0307341550",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 28, 2023",
                "reviewTitle": "4.0 out of 5 stars I have some thoughts",
                "reviewText": "Camille is a messed up character. I’m gonna be honest, I totally watched the HBO remake before reading the book so I had expectations, I expected a gothic murder mystery. What I got was a incredibly flawed broken character that was too damaged for relatability. With the cutting, sexual trauma, and her need for intimacy so tied to parental love that it was off putting - I get the desire of children who never experienced love to what to replace their parents, but this takes it to a whole new level.You reading this book and you realize that this person is mentally coming of a child without any real understanding of what adult relationships should be or how families should interact with each other and it is really hard to get past the damage that has already been done to truly enjoy the story.Another reviewer commented on the male characters basically being window dressing, presented as one dimension props for the story. Which aside from John, the only male character who acted with any form of agency of his own, that’s something I found to be true. I feel like if your gonna have characters present for the large majority of the story, have the be secondary characters that drive the plot forward, they need to be more the 1 dimensional troupes.Light spoilers about the ending ahead:I feel like the main Camille needed to be less outside of the norm to be relatable, is it common for a child who was never allowed to be one to assign other adults parental roles, sure. But this takes that to the extreme, making it a unsatisfying ending to what is a roller coaster of trauma. It just doesn’t feel like a win or a loss, just more of the same.I wouldn’t say I enjoyed this book, but I am glad I read it. Generally this is outside of my normal horror genre preferences and I really may have come to this book expecting a lot more from Flynn then she had the ability to give. It is something I do with dramas, reading more into them then was what intended. I just see a bunch of different ways this could have been a more put together story, all of them small tweaks that would have left me more satisfied with the resolution then I was. It’s worth the read, I’m not unset I bought it, I just don’t see a re-read happening.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice L. Peterson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEONUGTBB67JSKGQQKAOULBBYROQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ID8TYQL6ESL4?ASIN=0307341550",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 19, 2023",
                "reviewTitle": "5.0 out of 5 stars another page-turner",
                "reviewText": "Flynn has done it again. Page after page keeps turning. It’s 3:00am! When will I learn. Sharp Objects is a bit dark at times but continues to come up with the unexpected.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Bento Jose Pereira Lira",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 17, 2023",
                "reviewTitle": "excelente. recomendo",
                "reviewText": "excelente. recomendo",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Skuam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on August 27, 2023",
                "reviewTitle": "Heartbreaking",
                "reviewText": "First I saw the series and they traumatized me. A couple of years later I decided to read the book because I am a Gillian Flynn's fan. I made me more sad than traumatized, but I have to say I still enjoy reading her books, they are real page turners and I like how her characters are flawed but still endearing.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amber D",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 18, 2023",
                "reviewTitle": "Outstanding / deserves 6 stars",
                "reviewText": "I think I am genuinely addicted to reading, I read such a lot- like ‘200 books a year ‘lot’’. Some weeks I can read a book almost daily- much rarer are the weeks when I have read maybe only one or two books. This one I devoured in around 24 hours (a long train journey carved out some guilt free reading time yesterday- and I had to take the afternoon off work today to read some more of this book. Some time after midnight, I had finished it). It was incredibly good- and a long time since I’ve read a book this good. I don’t want to spoil it for the next reader so will just say that I found this book absolutely outstanding- an incredible piece of writing that is still affecting me long after I have read the last word. Parts of it were so well written that I read them twice - just for pleasure- before moving on in the story. That never happens! The character descriptions were so well written and the depiction of the small town American society so beautifully drawn- I felt like these people were real. (It always astounds me when I am so into a book and I look up from the pages- I am shocked to find myself back in my own life.). It was such a great read. I can’t recommend this book enough. In fact - I may have to go back and read it again- I am such a saddo I am missing Camille.I have read the author’s more famous work (Gone Girl) previously but some years ago. I might have to start reading that again.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "YB",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on February 12, 2023",
                "reviewTitle": "Deeply disturbing but brilliant",
                "reviewText": "For context, I had already seen the TV serie (with Amy Adams), so knew what to expect. As I had found it very interesting, I went back to \"the source\", and it was definitly worth it.The characters are really well described, with Camille's trauma emerging little by little in very clear images (or should I say words on her skin ?) ; Adora's and Amma's troubles are presented step by step, with clues clearly present so the end is definitly well prepared. If Adora's trouble is fairly clear from the beginning (though the scope remains to be revealed), Amma playing on her double image - and some of her words to her sister, reveal only progressively the damage.You may sometimes want to shake some \"sense\" into Camille (specially a later chapter), but with her issues her behavior is largely explainable.The last chapters particularly I could not put down, even knowing the end, as the author really made you feel this sickness, this urgency, this decay. I felt torn between deep sadness and disgust for these sick mother/daughter relationships, and the fascination of the excellent description of these relationship.Definitly a book well written and worth reading because of the psychology, just expect to get out of there quite shaken (and in my case, thankful for a healthy relationship with my mother!)“Lately, I've been leaning towards kindness.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A.C.P",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on October 18, 2022",
                "reviewTitle": "Nice suspense triller",
                "reviewText": "The book came correctly and really fast. The book itself is awesome, a very good thriller.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$6.54",
                "sellerName": "InfiniteWares",
                "sellerRating": "4.5"
            },
            {
                "price": "$10.54",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            }
        ]
    }
}