{
    "remaining_requests": 1092,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Audible-Butcher-Wren-Novel/dp/B0B7CNX5BW",
    "body": {
        "name": "The Butcher and the Wren: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Audible-Butcher-Wren-Novel/dp/B0B7CNX5BW",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41AVp7zzGkL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Alaina Urquhart",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&field-keywords=Alaina+Urquhart&search-alias=audible"
        },
        "brand": "Alaina Urquhart&search-alias=audible",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 10913,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "From the co-host of chart-topping true crime podcast Morbid, a thrilling debut novel told from the dueling perspectives of a notorious serial killer and the medical examiner following where his trail of victims leads Something dark is lurking in the Louisiana bayou: a methodical killer with a penchant for medical experimentation is hard at work completing his most harrowing crime yet, taunting the authorities who desperately try to catch up. But forensic pathologist Dr. Wren Muller is the best there is. Armed with an encyclopedic knowledge of historical crimes, and years of experience working in the Medical Examiner's office, she's never encountered a case she couldn't solve. Until now. Case after case is piling up on Wren's examination table, and soon she is sucked into an all-consuming cat-and-mouse chase with a brutal murderer getting more brazen by the day. An addictive listen with straight-from-the-morgue details only an autopsy technician could provide, The Butcher and the Wren promises to ensnare all who enter. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "6 hours and 23 minutes"
            },
            {
                "name": "Author",
                "value": "Alaina Urquhart"
            },
            {
                "name": "Narrator",
                "value": "Sophie Amoss, Joe Knezevich"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 13, 2022"
            },
            {
                "name": "Publisher",
                "value": "Zando"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0B7CNX5BW"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,155 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #70 in Crime Thrillers (Audible Books & Originals) #243 in Suspense (Audible Books & Originals) #678 in Crime Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "M",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHPLDRJ6TLGZTXQHG57FVP2R5Z4A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBWEBK5QEWCW6?ASIN=B0B7CNX5BW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "5.0 out of 5 stars wow!",
                "reviewText": "Wow, is all i have to say. This book was nothing shy of great. I didn’t know what i was getting into reading it at all. I was very confused by the title just knowing it was about a murder based in New Orleans. Here i was thinking i had it figured out, get to the second part and realize i didn’t. However, this book was very beautiful, and written in such detail. I listen to her podcast so i can hear her reading the book to me, and i placed her in the book as Wren, knowing that she wrote that character based on herself. This book really reminds me of “Where the Crawdads Sing” meets Criminal mMinds. Highly recommend this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "shay sweet",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG6ZKMWA2T3IDKBGZARXIX36B55Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1LOIFQRUCSA9R?ASIN=B0B7CNX5BW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 14, 2024",
                "reviewTitle": "5.0 out of 5 stars Jaw Dropping",
                "reviewText": "1st this book is a MUST read if you are into mystery, crime and murder. 2nd .... I read the book in ONE day, its that good! I could not put it down and the ending .... well it leaves you saying WTH !?!? .... but luckily she is writing a second book and it's a continuation of this. Do yourself a favor and BUY IT NOW",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Maddy I.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AESST6DMEALPEOQZE6ZEWXETHQKA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2LDG2OOEGKADW?ASIN=B0B7CNX5BW",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 16, 2022",
                "reviewTitle": "4.0 out of 5 stars A Book You Don’t Want to Read at Night!",
                "reviewText": "The Butcher and the Wren is a fast paced, thrilling novel written from the point of view of a medical examiner and the point of view of a serial killer. Probably mostly in part due to the authors background as an autopsy tech, this book is very dark and descriptive with some of the bone-chilling events. For that reason, it’s not for the faint of heart. However, this book is perfect for fans of true crime, horror novels, Dexter, etc. that don’t mind a little gore and some solid creepiness.This novel was enthralling from start to finish. The mystery and excitement pulls you in — and you will not want to put it down until it is done. And then you will think about it for hours afterward. It’s a relatively short read (coming in at 256 pages) and I was able to finish it in one day.There were multiple times while reading that I broke out in goosebumps while reading, or that I had to look up and take a deep breath to decompress because I was so entranced by the happenings that I needed to physically ground myself again.For a serial killer thriller junkie looking for a quick read, this book will be IT for you!The biggest fault that I find with this story is that I needed MORE.I especially needed more Wren. It’s really hard to get a clear picture of Wren because there are very few descriptors for her character. She has very few defining moments and few memorable qualities. For example, the author does not give her any hobbies, goals, or interests outside of work. Because I am a Morbid fan and have listened to and looked at Alaina through the podcast for years, I obviously saw and heard her in Wren. This may have been intentionally on Alaina’s part, which we can infer from the many similarities between the character and the author. However, I wish that Alaina had gone deeper and really committed to this character. With more background on Wren, it would have taken the book to a whole other level because we could have empathized with the main character more easily.I needed more details about the killings. The investigation into the serial killer was relatively lacking. We got to see the descriptions of each individual killing and of the bodies as Wren examines them, but not much of the in between and the crime side of things. It very well may be that the author purposely did not include this, but I found that I may have been a little more invested in it if there had been a deeper dive into it.I also needed more from the end. I love that she left the novel somewhat unresolved — in true crime and horror, things are often not wrapped up in a nice little bow at the end. However, I felt like we never got to the point. What was the point of the killings? We figured out why he was targeting one particular person. But why do this in the first place? His method of hunting and killing is extremely elaborate and I just felt that Alaina needed to provide more background or explanation as to WHY he was this way. We get a little dip into his childhood but no where near enough of his psychological profile. Was he a true psychopath? Was he a sadist? Why target the group of people he did? What was his first kill, leading him into this point?Clearly he is an evil m*****f*****. But why?The best part of this story is Jeremy’s. It is absolutely fascinating to read from a serial killer’s point of view. There were many times that I marveled over how well Alaina writes Jeremy’s thoughts and actions in a clinical, cold way. She manages to convey his character as being both very haunting and very real. It is no easy feat to ask someone to put themselves into the mind of someone that could do something like this but Alaina flawlessly brings this depravity to life for readers.I would 100% pick up this book to devour all over again and I strongly recommend it to all of you weirdos out there looking for something to give you a little spook tonight.",
                "reviewVotes": "67 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDZDCGNURKJHRVZFX5XV7B5VBTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R39JLU8P5GQAE1?ASIN=B0B7CNX5BW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars Excellently Terrifying!",
                "reviewText": "This book has it all for fans of true crime and horror. The story line is intriguing, the detailed descriptions of the scenes and what the people are feeling is done so well you feel like you’re experiencing the terror with them. The title alone is so catchy. A definite must read! I love listening to Alaina and Ash on their pod cast Morbid, so anyone else who does will love diving into this one head first!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tanya",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGQIHPO2MJZYLM7LNC5PCL7QOBTA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2YLM6F3UMLK1U?ASIN=B0B7CNX5BW",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "3.0 out of 5 stars It has the potential.",
                "reviewText": "Okay, so I am a big fan of the Morbid podcast. I love the banter and how things are explained by Alaina on there, but that won’t be clouding my judgement or opinion on this book.For me, this book was just sort of… meh. I didn’t hate it completely, but I didn’t love it either. There were aspects of it that I enjoyed, but aspects of it that I didn’t. Nothing really stood out to me overly, though I wasn’t expecting the twist in there, so good job on that one. The flow of the book was a little awkward at times. It felt like the sentences didn’t flow together very well. It seemed choppy and like it started and stopped a lot. Nothing really flowed together seamlessly.Using it is instead of it’s or he is instead of he’s was a little daunting as well. It just flows smoother (In my opinion) when you conjugate the word. I don’t know if it was a style choice or something she did unconsciously, but it was a little odd to me. Didn’t detract from the story too much though. I’m a well-versed reader as well, but there were some words in there (not counting the medical ones) that I had no idea what they were. It made me have to stop and look up the words quite a few times. Not saying that learning new words is a bad thing, but sometimes just use a simple word.The characters were there. Nothing mean or nice to say about them, really. For me, they didn’t have much of a chance to grow or shine. I didn’t hate Wren, but I also didn’t connect to her right away. I did enjoy John for some reason, though I couldn’t tell you why. Just did. Jeremy was appropriately creepy and weird. I liked the dual perspectives. It was very easy to follow which perspective you were in, even if they weren’t labelled.Overall, the book was okay for me. Is it one that I would pick up again to read? Probably not. Is it one that I would read the next in a series of? Oddly enough, yes. The preview at the back of the book was interesting and caught my attention. I, also, think that it would be interesting to see how her writing develops as she finds her voice in her writing and finds where she’s comfortable at. For a debut novel, it was good. Better than some books by highly popular authors that I’ve read.P.S. – I love you Alaina, but please cut back on the number of sentences that start with he. It was driving me insane the entire time.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kelly F.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF2GZUIUXUVCGMLQXKZZ4J7BC2TA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MUMCA633N8JL?ASIN=B0B7CNX5BW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 8, 2024",
                "reviewTitle": "5.0 out of 5 stars thrilling and exciting",
                "reviewText": "The Butcher and the Wren kept me on the edge of my seat, had me audibly gasping, and left me craving more. I truly hope for a part 2!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Newman",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG2ZGMQKANRBTRRN4CVSCLGC2BOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHSFZMW83E9YH?ASIN=B0B7CNX5BW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 3, 2024",
                "reviewTitle": "5.0 out of 5 stars Great!",
                "reviewText": "I love mysteries! I love listening to the ladies from Morbid on the radio while I am driving.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Poni B.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGINZHCYNAYG4WFVOVTB6SM6DWOQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBRUEPQX2R44?ASIN=B0B7CNX5BW",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 7, 2024",
                "reviewTitle": "5.0 out of 5 stars Loved it",
                "reviewText": "Found this because of Morbid, definitely not disappointed!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jo",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on February 12, 2024",
                "reviewTitle": "Great read",
                "reviewText": "I totally enjoyed this book. Close to one of the cases covered on the podcast. So much knowledge and detail built in. Can’t wait for the next release!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "ANA MARIA LIMA SARAIVA ARAUJO",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on November 8, 2022",
                "reviewTitle": "Perfeito",
                "reviewText": "O livro é ótimo.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Isabella",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on October 19, 2023",
                "reviewTitle": "Incredible",
                "reviewText": "I will just say it takes the edge of your seat a bit further and has your butt floating mid-air in an awkward squat until you inhale all the pages in this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Sam Nicol",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on October 4, 2023",
                "reviewTitle": "Really enjoyed",
                "reviewText": "I enjoyed this book even though I felt it ended quite abruptly so I’m hoping for a follow up 😉",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Dharini Dilip Kumar ",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on May 11, 2023",
                "reviewTitle": "A gripping story. Incredible writing.",
                "reviewText": "As a fellow weirdo (Morbid reference), I am familiar with Alaina’s ability to transport you into a story. But nothing prepared me for The Butcher and The Wren.Gripping from the start, the back and forth between the Bayou Butcher and Wren Muller is the perfect device to hold on to the readers attention.From the start, I found myself anxiously rooting for Wren Muller while wondering what makes our Butcher how he is.My fastest read this year, this book brings together blood curdling murder, a strong protagonist and a contemporary story of horror and thrill all in a tight 240+ pages.I can’t wait for the sequel. I’m sure its going to be just as incredible.10/10 highly recommend.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}