{
    "remaining_requests": 1111,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/One-Second-After-audiobook/dp/B001WYVAJ8",
    "body": {
        "name": "One Second After",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/One-Second-After-audiobook/dp/B001WYVAJ8",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/61KD3U9J4yL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "William R. Forstchen",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=William+R.+Forstchen"
        },
        "brand": "William R. Forstchen",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 26824,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "A post-apocalyptic thriller of the after effects in the United States after a terrifying terrorist attack using electromagnetic pulse weapons.In a small North Carolina town, one man struggles to save his family after America loses a war that will send it back to the Dark Ages.Already cited on the floor of Congress and discussed in the corridors of the Pentagon as a book all Americans should read, One Second After is the story of a war scenario that could become all too terrifyingly real. Based on a real weapon—the electromagnetic pulse (EMP)—which may already be in the hands of our enemies, it is a truly realistic look at the awesome power of a weapon that can destroy the entire United States, literally within one second.In the tradition of On the Beach, Fail Safe, and Testament, this book, set in a typical American town, is a dire warning of what might be our future and our end. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Suspense",
                "link": "https://www.amazon.com/Suspense-Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10495"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "13 hours and 17 minutes"
            },
            {
                "name": "Author",
                "value": "William R. Forstchen"
            },
            {
                "name": "Narrator",
                "value": "Joe Barrett"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "March 17, 2009"
            },
            {
                "name": "Publisher",
                "value": "Blackstone Audio, Inc."
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B001WYVAJ8"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#666 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #4 in Technothrillers (Audible Books & Originals) #9 in Post-Apocalyptic Science Fiction (Audible Books & Originals) #34 in Supernatural Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Fredrick P. Wilson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHR4LY4ANE74H4WNKR5V5VY4JM7A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MKSEPMK0FM8C?ASIN=B001WYVAJ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2012",
                "reviewTitle": "5.0 out of 5 stars Permanent Civilization Killer",
                "reviewText": "This is an important book to read and understand. as well as a vital subject for the continuation of Western Civilization. Bold statements. This is not for survivalists, this is for national defense and civil preparedness. This is to keep 280 million Americans from being killed. This is to stop the single largest genocide in human history - us. This is also about kicks and grins for the liberals that think this is about conservative politics, rather than their survival, for they will be the first ones to disappear from America after a successful EMP attack. This tome is a fictional attempt to describe the horrors of an EMP attack on the USA, for a real attack has not occurred (yet), and there will, almost certainly, be no one left that will either be able to write such history, or that will be an American that will mourn our passing. As a fictional account it is far too optimistic, but still a compelling story. It is written in a colloquial manner, almost as if it was dictated into a recorder. That type of writing apparently doesn't appeal to a variety of readers, but I believe most of them are opposed to Newt Gingrich and conservative politics, and can't see past their politics to see the appropriateness, and beauty, of this type of writing. Not every book can be written within the rules of incomprehensible dribble, such as Orientalism (by Edward Said) and Profits Over People (by Noam Chomsky) are. The story is that an EMP attack occurs, although that is not known immediately, and the protagonist, a college professor with a military background in a small college town in the Appalachian foothills, bands together with his family and town leaders to survive the crisis. Various horrid effects of an EMP attack are evidenced both personally and societally, with some violence included. Overall, I believe this is an irrationally positive story of the aftermath of such an EMP attack, but the author had to put together a story that covered the basics, and allowed someone to survive to be the protagonist. The United States House of Representatives Anti-Terrorism Caucus, approximately 122 members, including 40 Democrats, understands that an EMP attack on the USA is a clear and present threat once Iran acquires nuclear weapons: that a false flag attack, such as one by China disguised to be one from Iran, is also possible with a probably higher than one. If indeed this is a silly conservative political book, than there are lot of serious Democrats that understand the mortal danger the USA is in. There will be no electricity for many years. No electronics. No Computers. No internet. No phones or cell phones. No TV. No Post Office. No telegraph. No airplanes or airlines. No trains. No busses or trucks or cars unless they are old (pre 1975) points ignition cars or old diesels. No gasoline. No water. No medicine. No hospitals. No food. No heat. Modern water supply is via big pumps and purification plants that run off of electricity. After an EMP, the only water will come from rivers, lakes, and shallow, manually powered wells. If you live far from a river, and many stories up in a major city, life will become impossible in less than one week. For safe water, boiling is the only option. No refrigeration, so no food storage. Grocery stores only have about one day of food in them. No transportation of food. No production of food, other than gardens and small farms that have real, horse pie producing, horse power available. Starvation will start within a couple of weeks. How far can you walk each day for water and food, and return to your shelter (house, apartment), without having anyone else steel whatever you have? If you have a generator, how much fuel do you have? There won't be any more fuel for many years. Everyone of your neighbors will know you have a generator, and you will have more friends that you ever imagined, until the hospitality and the generator run out of fuel. No heat in winter, unless you have a wood stove/heater, and the wood (and tools - no chain saws) to keep it stocked through winter. No medicine, as there is no refrigeration, which many anti-biotics need, and there will be no new production or transportation. Hospitals will shut down as their generators run out of fuel. No operating rooms or fancy equipment. A small cut, with no treatment (no water for cleaning or ointment) may kill you. First responders will be in deep trouble just like everyone else, for their equipment won't work either, and their families will be in deep trouble as will everyone else. The military used to be hardened against EMP effects back in the cold war days. No more, as most new equipment is no longer hardened, for, obviously, after the end of the cold war there are no nuclear problems, or threats, anywhere else in the world. Right! As civilisation starts breaking down, each family will be on its own, and violence will break out as everyone fights over the few remaining resources. Whether there will be some small towns that hang together as this book states is highly unlikely. The House of Representatives estimates that nine out of 10 of us will die within the first year due to thirst, starvation, exposure, disease, and violence. That is the death of 280 million Americans within the first year. No country in the world has any significant capability to come to our aid. They don't have the airplanes, helicopters, supplies in storage, or ships. They don't have the military capability. Europe, Canada, Russia, China, South America, will all be unable to provide anything more than token assistance that will save a few thousands, but not even one million. It will be the single largest genocide in human history, by a landslide. Per the House of Representatives Anti-Terrorism Caucus, Iran has launched advanced scuds straight up for 30 miles, from barges off their coast. Why would they do that, other than to practice for an EMP attack? EMP effects were discovered after some US atmospheric nuclear tests in the early `60s wiped out half of Hawaii's electrical grid. An EMP attack requires a nuclear fission bomb, like the Hiroshima bomb. A hydrogen bomb will not produce an EMP effect other than locally. The bomb must go off between 30 miles up and 100 miles up in order to interact with the earth's magnetic field. So that the Compton effect will occur, which means the effects of the bomb will be magnified and focused back towards the earth. Because no one dies immediately and there is no significant radiation effect, it is easy for those with little knowledge and less sense to deride this type of attack. The science behind an EMP attack is sound. It has been verified by experimentation. It is not a theory, it is a scientific fact. Iran has said that one nuclear bomb would destroy Israel, but that no retaliatory attack could kill most Iranians, so that see no problem with such an exchange. \"Moderate\" President Rafsanjani said that in 2001. We, the USA, are the Great Satan, is the mantra of the late, unlamented, Ayatollah Khomeini. President Ahmadinejad has stated on numerous occasions that he imagines a world without the USA with pleasure. He doesn't say anything major such as that without the approval and concurrence of Ayatollah Khamenei and the Revolutionary Council. It would be simple to eliminate the USA, via an EMP attack, and then the Little Satan, Israel, could be dealt with easily.. MAD, Mutually Assured Destruction, as Ayatollah Rafsanjani stated above, will not deter these religious fanatics. So what if we turn Iran into a radioactive glassine parking lot? 280 million of us will still die. Revenge is worthless if the USA no longer exists. Enough Hezbollah and Shia Islamists will still exist, along with Sunni Islamists, to applaud our eradication, although, officially, numerous crocodile tears will be wept. Forstchen, in this novel, promotes the type of attack that is the most likely, and the safest from a retaliatory attack. Three container ships, one each off the Atlantic, Pacific, and Gulf coasts, outside of USA territorial waters, all open up one special container lid. One advanced scud with a Hiroshima style and size nuke warhead, is launched straight up from each ship. Thirty seconds after launch, 30 miles up, the warheads explode, and America goes dark. Forstchen has all three ships immolate themselves in their own nuclear explosions so that there is no evidence left behind as to whom launched the attack. We retaliate and wipe Iran and North Korea off of the map. And 280 million Americans die. A possible scenario is three nukes launched by submarines. We are rapidly losing our anti-submarine capabilities that we developed so highly during the cold war, such that this will become more likely as time goes by. Iran has launched satellites into orbit. They can launch one with a nuke on it, . brake it such that it re-enters over St. Louis, and explode it 100 miles up. 280 million Americans die. A conventional ICBM attack with the missile and warhead exploding over St. Louis, 100 miles up, can't happen until Iran has ICBM's capable of doing that. If we are still around in 4 or 5 years, they will have them, as will North Korea. As do Russia and China. In a military scenario, which this is, one has to protect against what can happen, not what one thinks will happen, for as soon as one does that, the enemy will do something different, and you are dead. Sun Tsu taught this over 2,000 years ago. We have no defenses against an EMP attack. We need a perfect missile defense system that can react to anything within a few seconds so that a scud launch off our coast can be intercepted and destroyed before it reaches 30 miles up and explodes, ie within 30 seconds.. We have no missile defense against an ICBM. The technology works. We can not only hit a bullet (missile) with a bullet (missile), we can hit a spot on that bullet (missile). We need the anti-satellite capability. The technology exists, but we haven't built or deployed it. Obama cut the missile defense system that was to be deployed in Eastern Europe. Russia laughed and screwed us. Obama has cut missile defense funding and projects. Obama and Hillary believe a couple of short range Aegis anti-ballistic missile cruisers off of the coast of Iran can protect us. Dumbest, most ignorant statement, and policy, I have ever heard. Obama has stated that he will not allow Iran to acquire nuclear weapons. When Pakistan notified the world that they had nukes, they exploded 6 of them in one day in May, 1998. No one knew anything before then about Pakistan. At lease, we know Iran is working on nuclear weapons. Iran will do something similar to Pakistan, and I believe the Israelis, who have far better intelligence capabilities in the Middle East than we do, that Iran will have nuclear weapons and capabilities before the end of 2012, plus that their weapons and capabilities will be buried so deep even we won't be able to do anything. Israel doesn't have the military capability unless they use their own nukes. Sanctions are not working, and will never work. Anybody that believes Obama will do anything to stop Iran should bid on the slightly used US embassy available in Tehran. I have put together over 380 pages of documentation to substantiate what is stated herein, spent over 100 hours studying this threat, and spoken with members of Congress. This is a vital book, I am glad Forstchen wrote it, and there should be more, more realistic, novels written on this subject. Remember, your life, and the lives of 279, 999,999 other Americans depend on your beliefs and actions.",
                "reviewVotes": "229 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SavedByGrace",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMCDAKP7PWGH7HJAMFNEFGJEKOA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2AGP6KLG0B224?ASIN=B001WYVAJ8",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 1, 2023",
                "reviewTitle": "5.0 out of 5 stars Astounding Book that everyone should read",
                "reviewText": "I have been waiting on a book like this to come out. I hate that it took me so long to find it! This book was a real eye opener as to what \"could\" actually happen after an EMP. The first time I heard about an EMP was on Jack Van Impe's program as he tried to warn others. From then on, I made it my mission to try and get people to prepare not just for something like this, but any disaster. People simply go on with life, thinking nothing is ever going to happen, or they either don't understand the ramification of it. They think you are one of those doomsday preppers when you tell them that they should have some supplies on hand...for ANY emergency.We weren't prepared for Hurricane Hugo in NC, but it sure came inland and wreaked havoc like we've never seen. People were without power for weeks, and the shelves were bare of necessities, and what's more, you couldn't even drive to the store due to damage from the storm. for the damage. We didn't think the shelves would be empty at the grocery store when Covid first came on the scene. You just never know. Cyber attacks are happening all over the place. Power stations have been vandalized. Natural disasters are occurring. It's a simple thing to take the time to store food, water and supplies just in case. The bible says that we have a duty to be prepared. \"Go to the ant O sluggard; consider her ways, and be wise.\" ...\"She prepares her bread in summer and gathers her food in harvest\" Don't be one of the foolish virgins with no oil as referenced in Matthew 25, and expect others to supply you with theirs because you did not prepare! Besides, what harm could it do if you ARE prepared?? One second after would be too late, my friends. Better heed the warning! It certainly pays to be safe than sorry.",
                "reviewVotes": "7 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carpe Diem",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH3O5EVKTGDWIQJRQ4VPFDMO44IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CR4568B3YOI9?ASIN=B001WYVAJ8",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 29, 2013",
                "reviewTitle": "4.0 out of 5 stars Is it time to stock up on guns, ammo, stored food, and prescription meds?",
                "reviewText": "I understand very little about the science of EMPs and why there is a lack of vigorous political attention given to this topic ( at least as much as is given to global warming) , and I am relatively new to the genre of post-apocalyptic science fiction books and movies. But so far this book has been the most compelling read in my new \"collapse of society\" collection. I could not put it down, did not leave the house, and read into the wee hours of the morning. The 4 stars instead of 5 are due to the well-discussed editing problems, which bothered me only slightly.Other reviewers have described the essence of the basic story so I will skip the factual synopsis. For comparison, I have read Lights Out and Patriots, and found that those books not only lack realistic characters, as does Going Home, but have way too many gratuitous action sequence chapters, inane dialogue, and technical details about survivalist equipment and procedures that are best left to non-fiction formats. Serious ethical dilemmas are not faced, as the characters are either black or white, good or bad, and the choices made are generally morally simple in those other books.SPOILER ALERT:What I liked best about this book are the specific discussions relating to the ethical dilemmas the characters must confront when resources are scarce and constitutional rights are, sadly but by necessity, suspended: who lives, who dies, who decides, and when, when there is not enough to go around for everyone to survive, much less be comfortable. Who gets to play God, and why? Why would a democracy or majority vote or a constitutional republic not work here?I know we like to believe that we presently live in a generally moral and justice-oriented, though flawed, society replete with basic civil rights and fine sensibilities that will go on forever, subject to heated debate and modifications . We think we will be able to fine-tune issues around the edges for decades to come, with our stomachs generally very full and basic existence needs gratified (even amongst what we call \"poor\" people in the U.S) until we eventually die of dementia in nursing homes in our 80's or 90's, or perhaps on million-dollar life support or dialysis in hospitals. Politicians and the public debate seemingly important issues such as marijuana legalization, school vouchers, gay marriage, hate speech laws, government health care funding , pension plans, and any number of topics that we think are very important, all of which become suddenly irrelevant when, due to a catastrophic and theoretically possible event, (in theory due to lack of adequate advance planning for defenses against EMP ) there is not enough to eat or drink and someone is trying to kill you so as to take what you have and need to survive. This book illustrates how rapidly we could turn into a dog-eat-dog (or, later, human-eat-dog) world when times get life-threateningly difficult. I am not sure that it would devolve within one week to the level of sanctioning public martial law executions for looting, but it is possible. I was happy to see the author take on the emotional issue of eating pets, which is usually avoided, but he should also have more dispassionately addressed the cannibalism, rather than immediately condemning it. I doubt people would NOT have accepted cannibalism of their dead, at least to feed their children (as happened not just in the siege of Leningrad, but also during the deliberate Stalinist Ukrainian famines, which my father's family did not resort to, but had been contemplating when things were horrible and the cats and dogs and rats had already been eaten). There could have been more discussion about why cannibalism of the dead would be worse than deliberate \"triaging\" to certain death people who were not likely to survive or who added little skills or benefit to the community's survival.Also, as an experienced high level health care professional, I found the factual discussions in the book about who dies first, who next, and of what, and who survives, particularly compelling factually and brutally descriptive. The description of the deterioration in the behavior of those dependent on psychotropic meds and narcotics when they run out is chilling. No other book I have read, or movie I have seen, outlines the physiologic processes in health care medication withdrawal or starvation, as well, if at all.Having seen how even in today's civilized world people have an understandable \"me first\" , or \"I need or want mine now\" attitude and how they are often angry and disgruntled at the slightest discomfort or bodily needs inconvenience (e.g., grumbling and sometimes belligerent airline passengers stuck on the tarmac for 4 hours who feel a little hungry, or a patient demanding immediate attention for his chronic back pain in an emergency room), it is not hard to believe that the collapse of civil order would occur very rapidly when people's real and perceived medical or comfort needs or wants are not immediately met.What I take as an unarticulated message from this fascinating story (fiction based on unlikely but possible events) is that people need to be way more prepared for disasters than they are (not just an EMP, but other causes of collapse of electrical grids, water, and food supplies), and should not totally rely on others (government or otherwise) to necessarily be available to timely help them out. Perhaps there should be national PR campaigns (by citizens, schools, churches, and both local and federal government) , for the following (these are my views and not spelled out, though strongly implied, in the book):1. At a minimum, people should stock up on a LOT of well-preserved food and have a plan RE how they are going to get long-term potable water, and fuel, if there is a prolonged disaster. Food can be rotated, to avoid waste. Even people who live in small apartments can find space to store some things (the internet has many links), and how to afford some purchases and storage (e.g., skip the next electronic gizmo upgrade and buy some MRE to store, or a water filter, to start, if you're on a budget)2. Figure out a way to stock up on essential truly life-saving medications as best you can (there are legal and realistic limits to how much your doctor will prescribe at one time, but the limits can be expanded with planning , e.g., do not wait until the last minute to refill, refill for at least 90 days, stock up on long-lived vitamins that can boost your nutritional status in a crisis, buy late expiration non-prescription meds, etc.). As we learn in the book, insulin is tricky as it has to be kept cool or the half-life goes off, in which case power sources for cooling (solar or extra stored fuels) would be a priority. Antibiotics are also difficult to store long-term, and most last only a year or two. Admittedly, there is only so much you can do to store long-term meds, and if there is a prolonged crisis, well, then the older and sicker and frailer (myself included) will just die even with the best preparations, but shorter severe crises could be survived.3. Stop making fun of or caricaturizing \"preppers\", and read up on the topic (my words, not the author's). These are not all tinfoil hat people, e.g., Mormons are known to encourage storage of one year's worth of food supplies, which likely would have made a huge difference in this fictional scenario (or storms, earthquakes, hurricanes, etc.)If most citizens made reasonable preparations, odds would improve for longer survival of more people. Even if you think you have no interest in surviving very long in a post-apocalyptic world, you might change your mind when you get real hungry, or you might be able to help friends and family or others who do, with your stores, thus decreasing the overall needs.Finally,4. Last but not least -- though for some it sounds scary and gets back to one of the hotly debated topics in the news, you may wish to provide increased support for the right for law-abiding citizens to bear arms (and you may wish to bear a variety of them yourself and the relevant ammo, just in case -- that is if you can still find these items given recent shortages), or #1-#3 will be irrelevant as food, water and meds would likely be forcefully taken away by looters in a crisis (or by less benevolent or less wise authorities than in the book).The author is a bit inconsistent on the rights of civilians who are not \"militia\" to handle firearms during the crisis and does not address this issue as well as he does the medical and food rationing decisions. On the one hand there is concern that if civilian people have guns they will loot and hurt people (outsiders have to surrender their guns while traversing near town), but on the other hand, armed civilians are favorably shown going around hunting game, bartering for bullets, and emerging with life-saving \"illegal\" weapons during the showdown survival battle near the end of the book. I realize this is a politically sensitive topic, e.g., pro-gun control people argue you do not need an M16 or AR15 rifle to defend yourself from a burglar or rapist, so therefore they should just be banned -- but what if there is civil disorder?In sum, this is a very good book overall, and intellectually stimulating on many levels.",
                "reviewVotes": "57 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 21, 2024",
                "reviewTitle": "Good read",
                "reviewText": "I enjoyed this book..at the same time I was reading about frightening and entirely plausible scenarios. I’m happy to live in the middle of nowhere 😂",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Juan E. Sandoval",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 1, 2023",
                "reviewTitle": "Novelita interesante",
                "reviewText": "Buen libro, no es un nobel de literatura, peron os muestra como puede ser fatal la dependencia que tenemos sde los microchips y microcircuitos. Muy interesante, rápida, algo predecible, pero entretenido.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "DMC",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on November 3, 2023",
                "reviewTitle": "Good product.",
                "reviewText": "Good.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carlos A. V. Silva",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 9, 2018",
                "reviewTitle": "Boa leitura",
                "reviewText": "O apelo do livro é \"plausibilidade\". O que aconteceria se a rede elétrica (na verdade, todos os dispositivos elétricos) parassem de funcionar de um momento para o outro? O quão dependente é nossa civilização da eletricidade? O que aconteceria com as pessoas de uma cidade interiorana? Eis o plot. A leitura é fluída, agradável. Em alguns momentos se torna um tanto cansativo, mas nada que comprometa a qualidade a escrita. Há pouca ação no livro, mas esse pouco convence. Como dito antes, o livro busca uma atmosfera realista. Quando a **** bate no ventilador, é para valer.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Beck",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on October 11, 2023",
                "reviewTitle": "wow",
                "reviewText": "This was one of the most realistic, gritty, and harrowing post apocalyptic books I've ever read. I was hooked and read it in a few hours. In the Regan era I wrote a short story about the decision to either kill my dog to spare her a death by radiation or take her into a shelter with the knowledge she'd probably be eaten. After 9/11 I told my husband that if a war was triggered is take all the risk as I am dependent on daily medication to live and he would be better able to keep our children alive. This book explored those dark musings and took them to their harrowing conclusion. Not an easy read but a brilliant one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}