{
    "remaining_requests": 1262,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Missing-Witness-Quinn-Costa-Thriller-ebook/dp/B0C4FL9R86",
    "body": {
        "name": "The Missing Witness: A Quinn & Costa Novel (A Quinn & Costa Thriller Book 5)",
        "price": "$14.99",
        "originalPrice": "",
        "rawPrice": 14.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Missing-Witness-Quinn-Costa-Thriller-ebook/dp/B0C4FL9R86",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81RBxdALSiL._SY385_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Allison Brennan",
            "link": "https://www.amazon.com/Allison-Brennan/e/B001IGV6FI/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.6 out of 5 stars",
        "customerReviewCount": 642,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C4FL9R86"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ MIRA (January 23, 2024)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ January 23, 2024"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2524 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 402 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#6,246 in Kindle Store (See Top 100 in Kindle Store) #168 in Police Procedurals (Books) #171 in Murder Thrillers #182 in Police Procedurals (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.6 4.6 out of 5 stars 642 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "Third to Die Tell No Lies The Wrong Victim Seven Girls Gone Missing Witness Quinn & Costa Series Book 1 Book 2 Book 3 Book 4 Book 5 A notorious serial killer is back Quinn & Costa work to uncover possible ties to a high-stakes cartel in the Southwest desert. A lethal attack with no clear motive…and a killer dead-set on keeping the truth buried. When nobody will talk and corruption runs deep, turning to outsiders is the only way to make sure women stop disappearing… When a key witness goes missing, Quinn and Costa must find her before a killer silences her for good…",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/1d157479-193e-443c-a162-5017cba918f6.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a15bb175-861e-44a9-8058-c181f4b983cd.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5043f867-e29a-4524-9c6b-999809df2a1c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/96d377f4-3c90-42ec-b52a-3869503f701c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b8a1e7cd-e74d-467e-b748-ba2df00db2ad.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/bf61eced-dd28-417e-b9e4-5c4826d947f0.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/ea444555-0493-4eb3-afc3-1a9615691930.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Love2read",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSLSUMDXSNDWEJRPFQ5WNAQ3PCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RLFCUQTBK28R?ASIN=B0C4FL9R86",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 23, 2024",
                "reviewTitle": "5.0 out of 5 stars Another Great Addition to the series",
                "reviewText": "For Detective Kara Quinn, going back to Los Angeles was her goal, to pick up her life working under LAPD. But when a case she was working undercover went sideways and her partner died, she needed to get out of town quick as a hit was placed on her. Working for the FBI Mobile Response unit was good for her, but she always held onto the dream of going back to her life in California. But now her case against a known human trafficker goes to court, she is thrust back into the world there she left behind and now a missing witness is key to everything that has happened.As Kara tries to find answers, she finds secrets and lies all around her as the twists and turns have her scrambling as well as everything, she knows is now different with the truth coming out. With FBI Agent Matt Costa and her team trying to help her find the truth, the race to find the missing witness turns deadly as more people are hurt. Kara must use all her tricks and experience to find the truth and stay alive in the process.The Missing Witness is the fifth installment in the wonderful Quinn and Costa series that just keeps getting better and better with each book. Allison Brennan’s storytelling is phenomenal and I know I can’t get enough of this series and this author’s books. The reader has been waiting since book one, The Third to Die, when we got introduced to Kara, Matt and the rest of the Mobile Response team. It’s been leading up to this particular case of Kara’s and I know I am not the only one who was on teeter hooks to see how it would end up for her as well as for the FBI team she has been on loan with. The writing is top notch with so many twists and turns I really didn’t see them coming as I flipped the pages to see what is next. This is testament to the author’s wonderful storytelling. This is an author who knows how to craft a story filled with twists that will draw the reader in until the very last page.We met Kara Quinn in the first book, The Third to Doe and I know I wasn’t the only one who found the prickly detective compelling and intriguing. I enjoyed each of the series books, but THE MISSING WITNESS puts them on Kara’s turf in Los Angeles and we finally see what happens when the trafficker is determined to see pay for his crimes finally face justice when it all goes sideways. The characters are what make this series such a wonderful entertaining read. They are flawed, complex people and the reader can’t help but find yourself rooting for them. I really enjoy Kara’s relationship with the FBI team as each book in the series kept it growing between them and the reader is shown how Kara is and why she is the way she was.The Missing Witness is one wild ride right from the beginning to the last page. I am really hoping the author continues this series as it really is quite different from other FBI series I have read, and the characters continue to grow and learn with each book. If you are looking for an action-packed ride with compelling characters and a fast-paced storyline, then I highly recommend this series as a whole. I do recommend reading from the beginning as each book builds upon the end and we get to see the growth of the main characters with each book.This is an objective review and not an endorsement",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SusanH",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AELCU37YSYQ3ZPCERMGUAC7BV4TQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2W3B90B3BH49A?ASIN=B0C4FL9R86",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 24, 2024",
                "reviewTitle": "5.0 out of 5 stars Interesting and thrilling",
                "reviewText": "The Missing Witness is the fifth book in the Quinn and Costa series, and they are all five star reads! LAPD Detective Kate Quinn is brought back to LA to testify against a corrupt businessman known for human trafficking who is then gunned down right near the courthouse. In a parallel storyline, a whistleblower helping the homeless who witnessed the shooting disappears. It is clear that corruption is rampant in the city government, with the wrong people making all the money instead of the grants going towards the homeless. In addition, someone in the police or FBI is going after Kara. Strong willed and independent, she only trusts Special Agent Matt Costa. There are a strong set of well defined characters in this fascinating book. Allison Brennan did a phenomenal job researching, explaining and detailing the homeless crisis. I highly recommend this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Diane",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP3LSTXZ4EKWZIGMKWKSQN4ZHPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R14KBEVY9OFAU9?ASIN=B0C4FL9R86",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "4.0 out of 5 stars Kara Quinn is a badass",
                "reviewText": "I have always wanted to read one of Allison Brennan's novels so I jumped into the fifth book in her Quinn & Costa series, The Missing Witness. While it can be difficult to join an established series without having read the previous books, I was able to catch up, though it did take awhile to place all the characters relationships.The book begins with LAPD Detective Kara Quinn returning to Los Angeles to testify against a dangerous human trafficker she went undercover to catch. Kara Quinn has been on loan to the FBI in Washington DC where she works closely with Agent Matt Costa, and with whom she has a more than collegial relationship.Kara is eager to testify, and threats against her life by the trafficker's people have given her LAPD and FBI colleagues concerns about her safety. When the trafficker is shot and killed on his way into the courthouse, there is one witness to the killing- Amy, a civilian IT consultant who has been working undercover to get information on white collar financial crimes that may implicate people high up in the city government as well as the trafficker.Amy disappears following the killing, and there are questions as to whether she is a witness or the killer. Quinn and Costa and Quinn's former unit in the LAPD have to work together to find Amy and unravel the white crime syndicate that has now turned to murder to protect their secrets.Brennan does a good job explaining the complicated scheme that involves nonprofit organizations that have contracts with the city to build housing for unhoused people, and the web of deceit that has created millionaires out of people high up in the government and their family members.There are some truly tense scenes in this fast-paced novel, including a few shoot-outs, a rooftop chase, and Kara racing away on a motorcycle from killers on her trail. I was biting my nails on these scenes.I found it interesting how Brennan built her story around a real world problem, the homeless issue, and dealt with it from the perspective of people living in the middle of it. She clearly did her research on it. (Here is a link to an essay Allison Brennan wrote about this.)For people who have read the previous Quinn & Costa novels, they will no doubt enjoy seeing what their favorite characters have been up to in the interim, and there are a few surprises for them. After reading The Missing Witness, I will be looking the first four books in the series- Kara Quinn is a badass.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "C. Llana",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHYQWUYV5GS37YWCCRCK2RIERB6A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3EU9WVL1BWMQG?ASIN=B0C4FL9R86",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 30, 2024",
                "reviewTitle": "5.0 out of 5 stars Such a satisfying and amazing book",
                "reviewText": "As someone who works with the homeless population in Las Vegas….I feel that Brennan did a commendable job of pointing out the problems, what they are, and the ways to solve them. The bureaucracy and politicians play games with people’s lives and they don’t care because it’s all about money and power. I like this little spotlight (albeit told in a fiction setting) and hope that more people become aware of the issues at play.Quinn and Costa…..this is THE dynamic duo and I hope I get to see more stories with them.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janice Dorris",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGB5RZ6RPWAY7HF5AFVVHLO3ZAKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1JUW85DEH3SI5?ASIN=B0C4FL9R86",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 27, 2024",
                "reviewTitle": "5.0 out of 5 stars Timely, thought provoking, suspenseful, and heart breaking",
                "reviewText": "I love all of Allison Brennan's books. This one stirred the heart both with the plight of homelessness and the callous disregard by some people in positions to help. I love the deepening of personal relationships between her recurring characters. This series is truly one of my favorites. I finish one and can hardly wait for the next. A truly gifted writer.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Ulrike Uhlig",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 9, 2024",
                "reviewTitle": "perfect read!",
                "reviewText": "Bewährter Brennan-Stil, insgesamt perfekter Spannungsbogen über die 4 Bücher! Authentische Charaktere und gute Story…. Schade, das es nicht weiter geht!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "redangel",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on February 5, 2024",
                "reviewTitle": "well written",
                "reviewText": "There was so many side stories it was hard to keep up with what was going on, having said that it all came together well, and the book kept me reading to see who did what, well written and very enjoyable",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}