{
    "remaining_requests": 1039,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Hour-Witch-Novel/dp/B08B6GHDRF",
    "body": {
        "name": "Hour of the Witch: A Novel",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Hour-Witch-Novel/dp/B08B6GHDRF",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/41X2AU5f98L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Chris Bohjalian",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Chris+Bohjalian"
        },
        "brand": "Chris Bohjalian",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 9230,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "New York Times Best Seller From the acclaimed author of The Flight Attendant: “Historical fiction at its best…. The book is a thriller in structure, and a real page-turner, the ending both unexpected and satisfying” (Diana Gabaldon, best-selling author of the Outlander series, The Washington Post).A young Puritan woman - faithful, resourceful, but afraid of the demons that dog her soul - plots her escape from a violent marriage in this riveting and propulsive novel of historical suspense.Boston, 1662. Mary Deerfield is 24 years old. Her skin is porcelain, her eyes delft blue, and in England she might have had many suitors. But here in the New World, amid this community of saints, Mary is the second wife of Thomas Deerfield, a man as cruel as he is powerful. When Thomas, prone to drunken rage, drives a three-tined fork into the back of Mary's hand, she resolves that she must divorce him to save her life. But in a world where every neighbor is watching for signs of the devil, a woman like Mary - a woman who harbors secret desires and finds it difficult to tolerate the brazen hypocrisy of so many men in the colony - soon becomes herself the object of suspicion and rumor. When tainted objects are discovered buried in Mary's garden, when a boy she has treated with herbs and simples dies, and when their servant girl runs screaming in fright from her home, Mary must fight to not only escape her marriage, but also the gallows. A twisting, tightly plotted novel of historical suspense from one of our greatest storytellers, Hour of the Witch is a timely and terrifying story of socially sanctioned brutality and the original American witch hunt. Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            },
            {
                "name": "Historical",
                "link": "https://www.amazon.com/Historical-Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10470"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "14 hours and 8 minutes"
            },
            {
                "name": "Author",
                "value": "Chris Bohjalian"
            },
            {
                "name": "Narrator",
                "value": "Grace Experience, Saskia Maarleveld, Danny Campbell, Cassandra Campbell, Arthur Morey, Mark Deakins, Julia Whelan, Kaleo Griffith, Kirby Heyborne, Rebecca Lowman, Mark Bramhall"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "May 04, 2021"
            },
            {
                "name": "Publisher",
                "value": "Random House Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B08B6GHDRF"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#26,798 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #62 in Historical Thrillers (Audible Books & Originals) #277 in Historical Mysteries (Audible Books & Originals) #981 in Historical Thrillers (Books)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Nomz Bielefeldt-Schenk",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFBD46HJ52YRICN2IMMO4BHHGAYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2F0SXZ1KQJWY0?ASIN=B08B6GHDRF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Amazing!!!",
                "reviewText": "Best book I've read in awhile. Politically, conceptually, dramatically and artistically an amazing piece of art. The character of Mary is so well written and three dimensional. All the characters are brilliantly written. The ending has just the right amount of surprise elements.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "John B. Sinclair",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF4CKFW7IUP6EHLSYOPOZ3WH6XXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R13VQGICA5W8YO?ASIN=B08B6GHDRF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on August 25, 2021",
                "reviewTitle": "4.0 out of 5 stars Intense Read But Rushed Ending",
                "reviewText": "I read mostly non-fiction history but like a break with a novel. I have read a number of Chris Bohjalian’s novels and have enjoyed each one. As with Hour of the Witch, his novels are intense and suspenseful. I find myself putting aside other responsibilities to finish his books.Set in 1662 Boston, a city still in its infancy, Bohjalian establishes a somber atmosphere and convincing period dialogue. Mary Deerfield seeks a divorce against her cruel husband and finds herself accused of many sordid activities, including witchcraft. Of course, in this day and age, one wonders how could so many people believed in such ludicrous and bizarre fantasies. Of course, given today’s political climate (perhaps the book was subtly meant as a metaphor?), I can easily imagine future generations looking back to 2021 and wondering the same about us! The reader watches with horror as to how Mary is treated in the courtroom and by others in the community. Fortunately, she has family and others for support.Bohjalian’s prose is lean and tight. Rarely were there passages where my attention flagged. I proverbially held my breath during some of the courtroom scenes, tense as they were.My one significant complaint is that I felt the final scenes were rushed. Whenever I see a book ending on such a precise page number as 400 (the text of the last book I finished was exactly 500 pages and it has similar problems), I have difficulty imaging it is mere coincidence. My suspicion is that the publisher set a firm page limit. When this happens, a reader can often find something is missing or feel the book could have been more completely formed. While I had a strong suspicion that a certain character would reemerge near the end, I thought it would be handled in quite a different way than occurred. Given what happens to him/her during these passages, I also found it hard to believe this character retained the physical strength needed for a certain action. Likewise, the epilogue is a bit conventional and seems shoe-horned into the 400-page limit.Nevertheless, I still very much enjoyed the book, recommend it, and look forward to the author’s next novel. This book also prompts me to now read about the treatment of women as witches in early colonial America. I plan to read Stacy Schiff’s The Witches: Salem, 1692. I will report back with a review!",
                "reviewVotes": "28 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Norge",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHKILBVAR3QVVYEBGYXSDRCZYQ5Q",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R8CU52SN5EO2P?ASIN=B08B6GHDRF",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 17, 2023",
                "reviewTitle": "5.0 out of 5 stars Great read",
                "reviewText": "A peek into the lives of a Boston family in 1662, at a time when women were being accused of being witches and the beginning of the vastly unfair judicial system. But this book is also a mystery with some unexpected twists and turns. This reader found it fascinating and it was hard to put down b",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Courtney A.",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGXXYNHPJCRMNWB2YHFPUBBA7DVA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RKKBMWWIR8ASC?ASIN=B08B6GHDRF",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 12, 2022",
                "reviewTitle": "3.0 out of 5 stars Interesting and enjoyable read.",
                "reviewText": "I wish I could give Hour of the Witch three and a half stars, but since that isn't an option, I'm going with three.This novel was my first encounter with Chris Bohjalian's work. The prose is smooth, readable, and engaging, so it is easy to become absorbed in the novel without being distracted by the writing style or quality. This is a huge plus for me, as I frequently encounter novels with interesting premises rendered in clunky, distracting writing. The novel also seems faithful to the period and place in which it is set. Seventeenth century Massachusetts isn't one of my particular specialties, so I may have missed details that an expert would notice, but I am familiar enough with Puritan New England and fussy enough about historical accuracy that I would have noticed any glaring errors.The protagonist is interesting, likable, and relatable. Her circumstances are appalling, especially to a woman who lives in the twenty-first century and isn't subject to the same restrictions, so it feels natural to cheer for her as she fights for her freedom. The first half of the book is extremely compelling; I found myself staying up way too late into the night because I wanted to learn what would happen next. The events in the second half of the book become gradually more outrageous and suspending disbelief became gradually more and more difficult for me. The plot never goes entirely off the rails, but the sense I had during the first half of the novel, of the author being in tight control of his story, doesn't quite carry through the second half.Overall, I very much enjoyed Hour of the Witch and it was an entertaining distraction when I wanted to escape the stress of my day-to-day life (pandemic, work, bleak Ohio winter weather). I recommend it to anyone who enjoys historical fiction and/or a fast-moving, suspenseful story. I reserve four- and five-star reviews for outstanding literature that leaves a lasting impression on me, and this one isn't quite in that category - but it's still a fun and interesting read.",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Carol S",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHOZ4RKXK4KARVCRQVFJL66TZITQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RVD5RZO7YQ1BT?ASIN=B08B6GHDRF",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 12, 2023",
                "reviewTitle": "4.0 out of 5 stars Friendship and hardship characterized this story",
                "reviewText": "Mary was at the mercy of Puritanical religious men who believed more in evil than justice. Tortured brutally by her husband Thomas, she bravely tried to end her marriage but was forced to stay with him and continuedto endure punishment. When she was convicted of witchcraft and sentenced to death, she realized that a true friendship could alter history.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michelle",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 5, 2021",
                "reviewTitle": "Could not put this book down!",
                "reviewText": "Loved this book.Lots of twists and turns.Really enjoyed reading this book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "D. A",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "1.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 19, 2023",
                "reviewTitle": "Best Avoided",
                "reviewText": "This book purports to deal with serious subjects through the medium of fiction. Such as the abuse of women (much in the current news, eg, the #metoo movement); distortion of faith by men determined to maintain a superiority; inequalities within the legal system. Unfortunately it is written by an author who doesn't trust his readers to join the dots without having their hand firmly guided, as a result I felt so patronised that at a third of the way through this turgid, poorly imagined self-indulgence I finally gave up and went to the bookshelves for something that didn't bore me into losing the will to live. The characters are badly drawn, the dialogue is bad enough without including a smattering of \"doest\", \"seemest\" and \"thee\" in a vain attempt to suggest authenticity (incidentally, as a Yorkshire man, I still use \"thee\" fairly regularly in day-to-day conversation). I rarely regret buying a book, but this is without any merit.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "lefG",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on November 15, 2022",
                "reviewTitle": "Highly recommendable",
                "reviewText": "A well written and active book on historical fiction. Situated in puritan Boston around 1660's. The characters were well developed and the ending, although not particularly surprising, left me wondering. I did find a few gaps in the story which mainly takes place in a courtroom although it didn't bore me...to the contrary.I must emphasise one negative point .... the book states that the first Protestant martyr to be executed under the reign of Mary Tudor..John Rogers..was put to the stake and all his family wife and children too...I've looked in all sources and he died whilst his family watched...they were not put to the stake. It was mentioned quite a few times...and I think it's a real faux pas ...one thing Is to fictionalize and quite another to distort facts...IMHO.All in all a recommendable read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Zangiku",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Japan on July 22, 2022",
                "reviewTitle": "could have been great",
                "reviewText": "This is a fine, rollicking read until about 3/4 in, when the story starts to unravel in strange ways and gradually becomes unconvincing. A major character disappears from the discussion. The ending comes off all four walls and quite ruined an otherwise excellent reading experience.I grew up in Essex County, Massachusetts, where 19 witches were hanged in 1692, and I did lots of research on it in my younger days. The author has done good research and has created an educational story as well as believable characters who think & behave as Boston Puritans would have done, so far as we know. I was looking forward to a satisfying conclusion but was disappointed.There is also a problem with the spoken language. He has chosen to use thou/thee forms but there are many grammatical errors. The MS needed a careful read by a scholar or linguist before going to press. Such a waste after so much work!The heroine was sympathetic and the atmosphere excellent, and this could have been a perfect book. But alas.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Gill",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 23, 2022",
                "reviewTitle": "Excellent look at a woman's plight",
                "reviewText": "The story is a little slow to get going but is overall a great read, especially if you enjoy witches, witch lore and women's rights stories",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}