{
    "remaining_requests": 1209,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Spy-Alone-compelling-espionage-operative-ebook/dp/B0C7BSPBC1",
    "body": {
        "name": "A Spy Alone: For fans of Damascus Station and Slow Horses",
        "price": "$5.99",
        "originalPrice": "",
        "rawPrice": 5.99,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Spy-Alone-compelling-espionage-operative-ebook/dp/B0C7BSPBC1",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81p2zHc3wSL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Charles Beaumont",
            "link": "https://www.amazon.com/Charles-Beaumont/e/B0CLHK3PB9/ref=dp_byline_cont_ebooks_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 1602,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Kindle Store",
                "link": "https://www.amazon.com/Kindle-Store/b?ie=UTF8&node=133140011"
            },
            {
                "name": "Kindle eBooks",
                "link": "https://www.amazon.com/Kindle-eBooks/b?ie=UTF8&node=154606011"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Kindle-eBooks/b?ie=UTF8&node=157028011"
            }
        ],
        "productInformation": [
            {
                "name": "ASIN ‏",
                "value": "‎ B0C7BSPBC1"
            },
            {
                "name": "Publisher ‏",
                "value": "‎ Canelo Action (November 16, 2023)"
            },
            {
                "name": "Publication date ‏",
                "value": "‎ November 16, 2023"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "File size ‏",
                "value": "‎ 2322 KB"
            },
            {
                "name": "Text-to-Speech ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Screen Reader ‏",
                "value": "‎ Supported"
            },
            {
                "name": "Enhanced typesetting ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "X-Ray ‏",
                "value": "‎ Not Enabled"
            },
            {
                "name": "Word Wise ‏",
                "value": "‎ Enabled"
            },
            {
                "name": "Sticky notes ‏",
                "value": "‎ On Kindle Scribe"
            },
            {
                "name": "Print length ‏",
                "value": "‎ 366 pages"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#5,823 in Kindle Store (See Top 100 in Kindle Store) #17 in War & Military Action Fiction (Kindle Store) #19 in Crime Action & Adventure #45 in Espionage Thrillers (Kindle Store)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 1,602 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Shane Whaley",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AG3USBOPGN5R363G4AEQDDWEGWUQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R36JE8S0SBMYC?ASIN=B0C7BSPBC1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 29, 2023",
                "reviewTitle": "5.0 out of 5 stars Fans of the more realistic yet thrilling spy novels will love this one!",
                "reviewText": "2023 is a banner year for spy novels, with big names like Charles Cumming, Paul Vidich, and Mick Herron gracing the shelves with their latest espionage thrillers. In such a crowded field, you might be hesitant to take a chance on a debut novelist. But let me assure you, venturing into Charles Beaumont's work with his first novel, A Spy Alone is a risk well worth taking.Firstly, Charles Beaumont, a pseudonym cloaking a real-life former MI6 operative, brings a wealth of personal experience to the table. His two decades of undercover work in war zones, diplomatic missions, and international business across four continents lend a striking authenticity to his writing. The burning question, of course, is whether Beaumont can transition from living the life of a spy to writing about it.A Spy Alone treads the more nuanced, realistic path of espionage that most of us Spybrarians love to read. It is not a slow burn though, there are thrills and spills, and a sprinkling of shootouts, read on to learn more.In his debut novel, Charles Beaumont, a former undercover MI6 operative, introduces us to A Spy Alone, an espionage thriller that delves deep into the world of intelligence, betrayal, and authentic espionage tradecraft.Set against the backdrop of modern-day Britain, A Spy Alone sparks intrigue right from the start with a thought-provoking premise: why was there a Cambridge spy ring and no Oxford equivalent?The story revolves around Simon Sharman, a former spy who stumbles upon a potential Russian spy ring nestled within the prestigious halls of Oxford. Beaumont masterfully weaves a story that keeps us guessing, filled with twists and turns that lead Sharman into a dangerous cat-and-mouse game with unseen enemies.Sharman's journey is not a solitary one; he is joined by Sarah Du Cane, a brilliant professor and intelligence strategist, adding depth and intellectual fervor to the narrative. Sharman's side kick Evie brings this spy novel into modern times, introduciing us to the world of OSINT – open-source intelligence. ‘A loose global network of ethical hackers, transparency campaigners and freelance investigators, these anarchic youngsters had shed more light on the murkier corners of international finance than years of effort by state intelligence agencies.'One of the novel's standout features is its authenticity in portraying the spy world. Unlike the flamboyance of James Bond, Beaumont's depiction of espionage is grounded in realism, making the story all the more compelling to those of us who prefer a thrilling but realistic spy read. The tradecraft described throughout the book is detailed and convincing, leaving readers to wonder where fiction meets the author's real-life experiences.'It is their shoes that give them away. As a lifelong fieldman, Simon Sharman hasn’t forgotten the lesson: walkers might change their jackets, pull on a pair of glasses, even a wig. But nobody changes their shoes on a job. Look at their shoes.'Beaumont's writing style is engaging and well-paced, striking the right balance between action and narrative development. His portrayal of characters, especially Sharman, is nuanced, making them relatable and their actions believable. The supporting characters, including Evie, an OSINT activist, and Professor Peter Mackenzie, add layers to the plot, each playing their crucial roles in the unfolding drama.'Human intelligence, for that was my trade, is about what one person says to another. An intelligence source is someone who knows something and who is willing to share that knowledge with someone who doesn’t know it. But all human relationships are full of lies: we lie to our loved ones to make them feel better, we lie to our enemies to scare them, to our friends to impress them and to our colleagues to get them off our backs. In the intelligence world you persuade someone to tell you things that they shouldn’t; so you’re asking that person to lie to someone else about what they’re doing with you. It’s a bit like an extra-marital affair. Sometimes, it is an extra-marital affair, but that’s another matter.'The book's climax is as satisfying as it is thrilling, avoiding the trap of a rushed finale that plagues many thrillers. It leaves this reader longing for more of Sharman's adventures and Beaumont's storytelling. The historical references and the author's clear stance on contemporary geopolitical issues, such as the Ukrainian crisis, lend the story an added layer of relevance.In conclusion, A Spy Alone is not just a spy thriller; it's a journey into the heart of modern espionage, told with an authenticity that only someone like Beaumont could deliver. It's a must-read for anyone who loves a good spy story, steeped in reality and rich with intrigue. Beaumont's talent for storytelling is evident, and readers will undoubtedly be left eagerly awaiting his next work. More please Charles!!",
                "reviewVotes": "5 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Southern reader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AERNZBO5V7OAVO44DBBHIBBGTNUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2KEBVNA7N8JLV?ASIN=B0C7BSPBC1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 12, 2024",
                "reviewTitle": "4.0 out of 5 stars Having a hard time getting into this",
                "reviewText": "I love a good spy novel and really miss the ones of old. But I am having a really hard time getting in to this one and can’t quite put my finger on why. I might pick it back up at some point.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGY7BUNQRPO6V3UIA3XPH7BRCEHA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R319YXGEDNP6RF?ASIN=B0C7BSPBC1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars new to Charles B",
                "reviewText": "When you first start reading, it’s a bit like other British writers who use the English language in such a creative way that it’s difficult to follow but don’t worry, eventually you’ll get into a rhythm that keeps you interested and captivates your imagination for spy novels, please read this book!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGAHFQJNHWNWFTOAQAP2AKY5TVNQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2XADYKWX1RXUN?ASIN=B0C7BSPBC1",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 1, 2024",
                "reviewTitle": "3.0 out of 5 stars Bit long winded",
                "reviewText": "Good enough story but too much jumping around in time and detail. I knew there was going to be another book for that reason, dont know if i can be bothered reading it though.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "42south",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRXF4LN2WBAI5XT3ZG4B6BBN74A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSGFJH2097C5Y?ASIN=B0C7BSPBC1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "4.0 out of 5 stars top read",
                "reviewText": "What I liked about this book was its authenticity. The author has obviously got access to deep insider knowledge of the British secret service.I am waiting for the sequel.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFLYIMS2SOEQWHS4SIAOFWOV5HKQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3D7AFVZRL6ZL0?ASIN=B0C7BSPBC1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "5.0 out of 5 stars This novel brings the spy novel into the 21st century world with a deliciously intriguing plot.",
                "reviewText": "How traditional Russian imperialism, stripped of Communism , shows itself using KGB sophistication is explored in this novel. Intriguing and frightening, this novel is both an exciting read and a thoughtful examination of how basic human greed inspired by modern libertarian thinking can be used as a tool by a powerful imperialistic government to achieve long term goals. Useful idiots or useful psychopaths can still serve important tasks to insure a resurgence of nationalist power with deadly consequences.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "K. Dekleva",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AF6S2G7OS3W42VSLK6M6VPYGNQJA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R24JM31ZZSA296?ASIN=B0C7BSPBC1",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 22, 2023",
                "reviewTitle": "5.0 out of 5 stars An intriguing post-Cold War thriller",
                "reviewText": "Beaumont is the pseudonym of a former MI6 officer, who has written a first-rate, intricate spy novel, set mostly in England but including other spy haunts such as Prague and Vienna. While parts of the novel go back to the protagonist’s youth at Oxford, much of it takes place in the present, where he, a retired spy, attempts to uncover a Russian spy ring at the heart of the British government. The moral of this tale, a cynical view, is that such things no longer matter in a post-Cold War, globalized world. But for the protagonist, there are personal demons, losses, and betrayals which draw him into the undertow of the dark matter of the world of espionage. A terrific debut, 5 stars ⭐️",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Frank's Kindle",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFOEIK43AAYMF7TOWGS6MU7WHUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2QENU5K70T9UF?ASIN=B0C7BSPBC1",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 21, 2024",
                "reviewTitle": "4.0 out of 5 stars good spy thriller",
                "reviewText": "I really enjoyed this book. Reminds me a lot of John le carre with more action. Would have rated it more like a 4.25 or 4.5 if that was a option. Ending to me was the small let down. Otherwise a very good story.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jürgen Stil",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on December 16, 2023",
                "reviewTitle": "Well constructed",
                "reviewText": "Coldly intelligent. The one weakness is the unlikely romantic theme. This might have been one of the deceptions. Also, borrowing the Maserati of someone known to the bad guys in order to flee inconspicuously is not an option.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nicole Froemer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on January 30, 2024",
                "reviewTitle": "Great book by author unknown",
                "reviewText": "Charles Beaumont has been dead for decades. Who wrote \"A Spy Alone\"?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Imker",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the Netherlands on January 19, 2024",
                "reviewTitle": "An absorbing book, it really makes you think.",
                "reviewText": "A very good book, written by someone who clearly knows what he’s talking about. There are too many authors of spy stories who are given the label “The next John le Carre”, and it is too early to burden this author with that phrase. However they share a similar background and it shows.I’ve read a lot of spy stories, many of them forgettable, but this is one I will happily pick up again at some point and reread.I hope this will be the first of many books by Mr Beaumont (if that really is his name?) and I would love to read the next instalment of the Simon Sharman saga ?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Man on the Green",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on December 9, 2023",
                "reviewTitle": "A stunningly accomplished début",
                "reviewText": "This is a remarkable achievement on so many levels. A taut and compelling spy novel. An only slightly fictionalised account of 21stC geopolitical intrigue, and the stranglehold on British democracy. A true thriller in its ability to ensnare and carry along its readers. And a landmark account of the Brexit era.Beautifully written, with powerful prose, this is a truly satisfying read. It treats its readers as adults, but provides carefully composed hints to aid comprehension of some of the less well-known twists in post-Soviet era politics. Although these don’t always come off 100% (the awkward exchange about FIMACO is a telling, but extraordinarily rare, example of the author’s narrative inexperience), the novel is brilliantly composed, and provides enough explanation to ensure that the story is carried forward under its own steam as the loose threads of the “Oxford Spy Ring” are gradually disentangled to reveal a much bigger web of conspiracy and intrigue.Whilst it plays on insider knowledge of the British establishment, it does so in a surprisingly sensitive and self-aware manner. The Oxford setting is a necessary backdrop to the story, and the author cleverly weaves in enough detail to satisfy those who revel in authenticity and to make the narrative itself both plausible to the sceptical and engrossing to the previously ‘uninitiated’, even as he avoids the trap of exclusivity.I am thrilled to see that this is announced as Book 1 in the Oxford Spy Ring series, which means that I am already eagerly awaiting the next in the run (which I hope will be long and live up to the enormous expectations created by this stunning début).I have no doubt that we have seen the arrival of a major force on the thriller scene, and if he is able to continue to contain and direct the explosive power of his first offering, Mr Beaumont could well step up to the plate vacated by the late, great David Cornwell (the author perhaps better known under his pen name John le Carré). I am left wondering just how much of his own past the author has drawn on, and whether David Beaumont is even his real name!",
                "reviewVotes": "11 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kindle Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Australia on December 26, 2023",
                "reviewTitle": "contemporary geopolitik with credible past. great novel.",
                "reviewText": "Unsure if debut but excellent.Easy to speculate on past Oxford spies but brilliant way of weaving into very current Russian/British relation.Follow up won’t be easy but I eagerly anticipate it.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}