{
    "remaining_requests": 1241,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/American-Assassin-Vince-Flynn-audiobook/dp/B0046XYGIO",
    "body": {
        "name": "American Assassin",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/American-Assassin-Vince-Flynn-audiobook/dp/B0046XYGIO",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51RxBQyxQ1L.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Vince Flynn",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Vince+Flynn"
        },
        "brand": "Vince Flynn",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 19289,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Before he was considered a CIA superagent, before he was thought of as a terrorist's worst nightmare, and before he was both loathed and admired by the politicians on Capitol Hill, Mitch Rapp was a gifted college athlete without a care in the world...and then tragedy struck. Two decades of cutthroat partisan politics has left the CIA and the country in an increasingly vulnerable position. Cold War veteran and CIA operations director Thomas Stansfield knows he must prepare his people for the next war. The rise of Islamic terrorism is coming, and it needs to be met abroad before it reaches America's shores. Stansfield directs his protégé, Irene Kennedy, and his old Cold War colleague Stan Hurley to form a new group of clandestine operatives who will work outside the normal chain of command - men who do not exist. What type of man is willing to kill for his country without putting on a uniform? Kennedy finds him in the wake of the Pan Am Lockerbie terrorist attack. Two-hundred and seventy souls perished that cold December night, and thousands of family and friends were left searching for comfort. Mitch Rapp was one of them, but he was not interested in comfort. He wanted retribution. Six months of intense training has prepared him to bring the war to the enemy's doorstep, and he does so with brutal efficiency. Rapp starts in Istanbul, where he assassinates the Turkish arms dealer who sold the explosives used in the Pan Am attack. Rapp then moves on to Hamburg with his team and across Europe, leaving a trail of bodies. All roads lead to Beirut, though, and what Rapp doesn't know is that the enemy is aware of his existence and has prepared a trap. The hunter is about to become the hunted, and Rapp will need every ounce of skill and cunning if he is to survive the war-ravaged city and its various terrorist factions. Includes the first chapter from Vince Flynn and Kyle Mills' latest thriller, Enemy of the State! Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            },
            {
                "name": "Spies & Politics",
                "link": "https://www.amazon.com/Spy-Stories-Tales-Intrigue-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10493"
            },
            {
                "name": "Political",
                "link": "https://www.amazon.com/Political-Thrillers/b/ref=dp_bc_aui_C_5?ie=UTF8&node=7538395011"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "11 hours and 44 minutes"
            },
            {
                "name": "Author",
                "value": "Vince Flynn"
            },
            {
                "name": "Narrator",
                "value": "George Guidall"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "October 12, 2010"
            },
            {
                "name": "Publisher",
                "value": "Simon & Schuster Audio"
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0046XYGIO"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#2,029 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #11 in Political Fiction (Books) #18 in Political Thrillers (Audible Books & Originals) #29 in Espionage Thrillers (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "phillip l counts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHJA2L3NN6O53HOFFRF2BWPRSUNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1Z1B4IC3US14M?ASIN=B0046XYGIO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 9, 2024",
                "reviewTitle": "5.0 out of 5 stars excellent",
                "reviewText": "one of the best books in this type of story , I have ever read",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "cbard101",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKVTNIM66V4DF4K3UOWAMWJT6KQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2CQRUSAO5ZD50?ASIN=B0046XYGIO",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 16, 2013",
                "reviewTitle": "4.0 out of 5 stars Must Read",
                "reviewText": "American Assassin is another must read by Vince Flynn. This latest edition to the Mitch Rapp series will help you put two and two together on the Mitch Rapp history that was never covered. Not only does this clear up a fuzzy history of Mitch but also some of the other players in the series such as Irene Kennedy and Thomas Stansfield as well. It is not the non-stop action you may be accustomed to with Vince Flynn but this is still a much-needed addition to the series. The beginning of the story is about how Irene recruits Mitch from college vs. being from a more operational background. Which doesn't set to well with the trainer Stan Hurley, who will do everything possible to stop Mitch from finishing his training. Right from the start you can see the competition and building friendship between these two that will continue to grow throughout the series. You could tell from the first meeting in the barn that Mitch had a raw talent for the Clandestine service that others had to be taught. We know Mitch as a killing machine that needs no backup, but in this story we get to walk through his first engagements with Islamic radicals and Russians. Even from these first engagements you can see what a natural Mitch is at this line of work. Reading this book after already feeling you know Mitch helps to clear up some confusion I had while reading the others. I would sometimes feel that I was missing some part of the story and since I started reading the series 2009 I always thought I had missed a book. Turns out I did not miss a book it just didn't start from the beginning. This was not the page-turner that the majority of series seems to be but it was a very necessary book, which I think wrote very well. A vast majority of his audience may expect more action out of a Mitch Rapp book, but this one incorporates more of the back-story along with the normal action. It was like finding the missing piece of a puzzle hiding under the couch. The biggest drawback to American Assassin was the editing. It seems to be rushed to make a due date or some other glitch. It's hard to believe that they went ahead with releasing it with so many spelling errors and missing words. But these are the only drawbacks to the book that I found. To sum the book up I would say that this is not Vince's best work but he has set the bar so high its hard to keep it that way for every book. Other than the spelling errors I think that overall this is still a great book and a must read for anyone that has read about Mitch Rapp. You get to go back in time to the beginning of a great character in Mitch Rapp and tie together the missing pieces from so many books.",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Joseph J. Truncale",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFRLKD4CWAO43F4EEM6RKZM6BPCA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2MSRD17FS2K7Y?ASIN=B0046XYGIO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 11, 2023",
                "reviewTitle": "5.0 out of 5 stars A fantastic action-packed novel about a trained assassin named Mitch Rapp.",
                "reviewText": "As a person who loves well-written spy and assassin fiction novels while I was browsing on Amazon, I came across a series of novels written by Vince Flynn, which surprisingly I had never heard of and never read any of his novels in the past.After doing a little research of my own I decided to read this book (American assassin: A thriller by Vince Flynn) first (even though it is actually the 11th book in his series) and move on to the others he has written in the order they were presented. As soon as I received the book and began reading it, I could not put it down for very long because I could not wait to get back to the novel.The main character in this book is Mitch Rapp, who while in college was recruited to join the CIA, after the Pam AM Lockerbie terrorist attack. At 23 years old he is the youngest to have been recruited for this special secret assassin unit. He is constantly under supervision, and they are suspicious of his abilities and skills. Some think he is not who he claims to be, and he is constantly being tested at every turn. There is no question he is physically in fantastic shape, and he catches on very quick to anything he is taught like shooting skills. I really enjoyed this book from the very first action-packed page. If you are a fan of spy assassin type novels that are well-written and great reads you should check out this series by Vince Flynn.Rating: 5 Stars. Joseph J. Truncale (Author: Tactical Principles of the most effective Combative Systems).",
                "reviewVotes": "9 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SpeedReader",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCKL4T4OM63G4T3MSCQ5H4G2WYQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2H47L67TKMM3H?ASIN=B0046XYGIO",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 26, 2023",
                "reviewTitle": "5.0 out of 5 stars A great spy thriller",
                "reviewText": "This book is the origin story of the character of Mitch Rapp, created by Novelist Vince Flynn. For those who are familiar with Flynn's work, he started writing a series of novels, starting with the novel Transfer of Power, which was set around a spy (Rapp) in the prime of his career who took down terrorists in off-the-books missions for the CIA. As Flynn wrote more Mitch Rapp stories, fans clamored for an origin story for the character, and American Assassin was created. So, if you read the books in chronological order, this is Book 1. If you read them in release/publication order, this is Book 11.The basic storyline is that Rapp's girlfriend was killed in the Pan Am 103 bombing over Lockerbie Scottland. He is subsequently recruited into the CIA by Irene Kennedy, and trained (reluctantly), by an aging CIA Agent Stan Hurley. Rapp's skills are beyond his years and beyond his lack of conventional training. The last third of the book involves a mission to save Hurley from kidnappers and at the end, Rapp decides to go on a revenge mission to find the members of the terror cell behind the bombing of Pan Am 103.The book is well-written and the story flows very well. It does jump back and forth in the timeline of events a little, but not so much that it makes following the story hard. In fact, the book is a pretty easy read, even being about 430 pages long, and can be read in a day or two depending on how fast you read and how much time you have to read. The chapters are fairly short so there are a lot of natural stopping points, which is definitely helpful for longer novels. So, if you are a fan of spy novels, this is a very good one to check out.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Tricky Dicky",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on August 10, 2023",
                "reviewTitle": "A cracking read",
                "reviewText": "Enjoyed the film a few years ago and finally got around to reading the book.What a great storyline and thoroughly believable with an all-action lead character who’s a combination of Jason Bourne and Jack Reacher.About to start the second book in the series and really looking forward to another,hopefully great read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Peter",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 16, 2023",
                "reviewTitle": "Spannend bis zum Schluß",
                "reviewText": "\"American Assassin\" ist ein fesselnder und packender Thriller, der den Leser in eine Welt voller Action, Intrigen und Geheimdienstoperationen entführt. Die Handlung dreht sich um Mitch Rapp, einen jungen Mann, der von der CIA rekrutiert wird, um Terroristen zu bekämpfen. Die Charaktere sind gut entwickelt und der Autor hat eine großartige Arbeit geleistet, um Mitch Rapp als eine vielschichtige Figur zu gestalten, die überzeugend und realistisch wirkt.Die Handlung ist gut durchdacht und lässt den Leser bis zum Ende im Dunkeln, was die Entwicklungen und die Wendungen der Geschichte angeht. Die Beschreibungen der Orte und Ereignisse sind detailliert und gut recherchiert, was dem Buch eine authentische Note verleiht. Der Schreibstil ist flüssig und die Spannung wird von Kapitel zu Kapitel gesteigert, so dass man das Buch nicht mehr aus der Hand legen möchte.\"American Assassin\" ist ein Buch, das man nicht nur wegen der Spannung und der Action lesen wird, sondern auch wegen seiner tiefgründigen Botschaft. Der Autor spricht einige wichtige Themen an, wie zum Beispiel den Terrorismus und seine Ursachen. Das Buch ist nicht nur ein Thriller, sondern auch eine Reflexion darüber, wie unsere Welt und ihre Politik funktionieren.Insgesamt ist \"American Assassin\" ein großartiges Buch, das man jedem empfehlen kann, der Thriller mag. Es ist ein Buch, das man einfach nicht aus der Hand legen kann, und das man bis zum Schluss in seinen Bann zieht. Eine absolute Leseempfehlung!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "J M Furzer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on April 9, 2020",
                "reviewTitle": "Genesis of Mitch Rapp",
                "reviewText": "A fan of this genre I read other authors for years, did some review research and read Red War, really enjoyed that so much decided to start at the beginning of the series. Since this prequel is the beginning, the novel cleverly dates technology and current affairs and to understand the genesis of Mitch Rapp it is worth the read.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Alexiane VeysAlexiane Veys",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in France on November 21, 2020",
                "reviewTitle": "Excellent",
                "reviewText": "Reçu en excellent état le jour indiqué.J'ai adoré le film avec Dylan O'Brien et amatrice de lecture j'ai décidé d'entamer l'histoire originale.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71+qe16VorL.jpg",
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/71mrkUu2PjL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "Andrés Rivas",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on October 16, 2018",
                "reviewTitle": "Excelente servicio",
                "reviewText": "Me encantó el libro,es una gran historia,todo muy bien con el servicio y atención que la proveedora me proporcionó, aunque haya tardado un poco en llegar estoy muy satisfecho con mi producto y con la calidad que me ofrecieron lo recomiendo al 100%",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}