{
    "remaining_requests": 1255,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Woman-Window-Novel-Finn/dp/0062678426",
    "body": {
        "name": "The Woman in the Window: A Novel",
        "price": "$10.63$10.63",
        "originalPrice": "",
        "rawPrice": 10.63,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Woman-Window-Novel-Finn/dp/0062678426",
        "soldBy": {
            "sellerID": "A1Q6WF7F63WIXG",
            "name": "OneEarth Books",
            "link": "https://www.amazon.com/gp/help/seller/at-a-glance.html?ie=UTF8&seller=A1Q6WF7F63WIXG&isAmazonFulfilled=1"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51Q0ZA4gmBL.jpg",
        "images": [
            "https://images-na.ssl-images-amazon.com/images/I/51srL7RzhhL.jpg",
            "https://images-na.ssl-images-amazon.com/images/I/51KHrsSEzkL.jpg"
        ],
        "imagesCount": 3,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "A. J Finn",
            "link": "https://www.amazon.com/A-J-Finn/e/B074BPQ4X3/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "OneEarth Books",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 131275,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tomorrow, February 18. Order within 4 hrs 47 mins",
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Monday, February 19. Order within 11 hrs 32 mins",
            "FREE pickup Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest pickup Tomorrow, February 18. Order within 15 hrs 17 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ William Morrow Paperbacks; Reprint edition (March 5, 2019)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 464 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 0062678426"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-0062678423"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 12.4 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.31 x 1.05 x 8 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#9,309 in Books (See Top 100 in Books) #494 in Women Sleuths (Books) #859 in Psychological Thrillers (Books) #1,612 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 131,275 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "End of Story The Woman in the Window",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media/vc/9968df63-4424-4cd3-8c5c-3ecccbb7d95a.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/1d5d38b4-189b-40e4-ba63-84e66e165eb7.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/c1cdaa21-af4e-42d4-9614-45d7debdbd33.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/a0fde7af-de71-475d-acfa-564418e64fb3.__CR0,0,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/7fcca1b0-f4ed-4177-a23d-a0b37586c33c.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media/vc/e3ca0262-b9db-43e4-81fb-b1abef387ad5.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Judith D. Collins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFVSBBLRMF77R3DTS4IX5J5FA6ZA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2NFWJR54QL3XG?ASIN=0062678426",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 4, 2018",
                "reviewTitle": "5.0 out of 5 stars Enthralling! Top Thrillers of 2018. The next Gone Girl.",
                "reviewText": "5 Stars + + A.J. Finn’s most talked about (highly anticipated) psychological thriller THE WOMAN IN THE WINDOW, most definitely lives up to the hype! A B S O R B I N G.Just when you think you have attained your answers and you have reached the top of the mountain— think again. The climb has only begun. It is just gaining speed. From here on out, it is non-stop action, suspense —unputdownable. There are many more twists to follow before reaching the explosive ending— making this an \"engrossing\" 5 stars “must read” and Top Thrillers of 2018.Audiobook Not sure I have ever been this immersed in an audiobook previously. Cannot stress enough, Ann Marie Lee (narrator) rocks! Her performance is award-winning. I was hanging on every word. Generally, with audio, I am distracted by other work and continuously rewinding. Not the case with THE WOMAN IN THE WINDOW. BTW, I purchased the Kindle format, hardcover (which has not arrived from Amazon), and the audiobook.Anna, age 38 agoraphobic, cat owner, fond of wine drinking wine and pill popping to ease her fears. She likes old classic black-and-white movie classics — and she spies on her neighbors.“Everything goes down better with a glass of smooth merlot.”When Anna views the woman in the window: \"I noticed she liked a drink in the morning, as do I.\"The narrator: again, off-the-charts bloody-good. The author: So many delicious witty one-liners.Anna is a child psychologist and often advises a few patients by email. “The doctor is in.”She does not venture into the outside world; however, she does have phone conversations with her husband (ex) and her eight-year-old daughter.Readers are unsure what happened to her family and why she is in this state. However, she is in constant contact with her husband and daughter even though they live apart. We suspect something dreadful, painful, and tragic occurred.She resides in a beautiful large home in Manhattan and has a handsome tenant, who is a carpenter. He lives in her basement. Her latest highlight a new form of entertainment happens to be her new neighbors. They do not seem to have any window dressing, and she enjoys observing. (spying). Trying to figure out their life from her eyes.Ethan Russell, the son (age sixteen) lives across the street. He is a pleasant enough young man, and Anna seems to connect with him. She also meets the parents: Paul and Jane (from the window). Then one night, after watching her usual noir films, she witnesses a crime. She is frantic! She sees a woman murdered. She immediately calls the police.However, she is not a credible witness. After all, she comes across as crazy, paranoid, unstable. Pretty much an alcoholic buzzed out on pills, and an agoraphobic. She is beyond puzzled and begins her own investigation. The wife is OK and alive, says the cops. However, the wife is not the one she saw that night. Therefore, Anna thinks she is an imposter. However, what is the motive? What happened to the woman in the window?She immediately begins suspecting everyone. She becomes obsessed. Picking up clues any way she can. The also has a feeling Ethan is scared of his parents and offers him friendship. Cleverly, the author unravels the reasoning behind Anna becoming an alcoholic and an agoraphobic. However, again, this is NOT the end. Do not let your guard down. Keep your spy hat in place.Anna continues to watch her Hitchcockian movies (the titles relate to parts of her investigation) and speaks to her family. Slowly she begins suspecting she is not crazy like everyone thinks she is. However, she needs to seek solid answers before she gets the police involved again. She must find clues and confront the problem. It is not paranoia or is it?The cops think with the constant viewing of late night crime movies, in combination with her alcohol and medication she sees things that are not there. However, Anna is more than determined to find answers to prove to herself and everyone there is something more sinister at play. In doing so, then she may be able to face her demons to begin to live a somewhat healthy life.What a fantastic book! Brilliantly written and plotted, psychologically rich, characters well-drawn, highly emotional —From love, loss, to complete madness. Anna is a woman you can sympathize with, no matter your gender or age. I listened/read in one sitting.Once you reach the 50-75% mark, you will understand why the movie rights. As mentioned in my review of The Wives Between Us (coming Jan 9, 2018) , another huge hit 5 Stars ++ with film rights; why these two books will be on the bestseller list for some time to come: Readers are getting the “best” of the literary world (expertise) with the two author's background in journalism, and the publishing world, plus Pekkannen is a well established best-selling author. These guys know what they are doing and do it well. What a way to kick off 2018!Back to TWITW: I enjoyed the second half of the book, more than the first part. The first part is a slow-burning set up for the fast-paced, intense second half. If you have read, The Ghostwriter by Alessandra Torre Top Books of 2017 you will note some similarities when reading between the lines of the main character. (both of course with different outcomes). Fans of each- will enjoy the other.Both involve an unreliable narrator, with a mystery surrounding husband and child, and agoraphobic. Ironically, A. J. Finn’s THE WOMAN IN THE WINDOW also reminds me strongly of A. R. Torre (Alessandra Torre)’s Deanna Madden Series The Girl in 6E (A Deanna Madden Novel Book 1) (minus the erotica, UPS man, and internet sex); however, the box cutter, agoraphobic, family tragic past, and a strong pull to save someone beyond the reaches of her home, while putting herself in harm’s way.Highly Recommend for fans of well-written strong, and intelligent psychological suspense thrillers. Heavy on the old movie classics, literary flair, and less on the blood and gore, which works for me. Enthralling, and all-consuming are words which quickly come to mind. To summarize, Finn brilliantly explores the mind of Anna. Her anxiety, fears, insanity, depression, mental illness, paranoia, panic attacks, agoraphobia; love, loss, grief, and guilt —hitting all cylinders.The next Gone Girl? I would say \"Yes,\" to that question. Looking forward to the small/or big screen and can imagine its cast of stars. I loved Anna! I hope we see more of her in future books. JDCMustReadBooks",
                "reviewVotes": "27 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "A lover of books",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AE6MFCCWBCTEV7X2PGKSA5373RIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3KVBDDHVA2DSI?ASIN=0062678426",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Really creepy",
                "reviewText": "This was a really creepy great story. It's the kind of book you can't put down. The characters are so believable and well written.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Charles Scott",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AFMSFDF4URKWUW4KYCOGURAQ2VJQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2ZSNQLEHSOF70?ASIN=0062678426",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on March 21, 2021",
                "reviewTitle": "5.0 out of 5 stars \"Do you see what I see? Do you hear what I hear?\"",
                "reviewText": "I don't believe I have ever encountered a character quite like her in any other novel. She's not like anyone I've ever met in person, either. Generally, I've heard tell of the lady at the local tavern who may cry in her beer, once in a while; but she is, clearly not, this woman. The friendly, effervescent Roger Dodger would naturally want to try and cheer her up as best as he can, by singing her his latest little ditty: \"McDonald's is my kind of place. It's where I go to eat and wash my face. McDonald's is my kind of place. I know it's time to hit the brakes, When I get the urge for happy meals & shakes. McDonald's is my kind of place.\" Such a song and dance would obviously be a drastic oversimplification of characterization and plot of the actual story involved in real time. The \"Woman in the Window\" novel operates on a different level of intelligence altogether. Her life becomes a whole new playing field. She's boarded a supersonic plane from another dimension, if you will. She recognizes her short-comings and-- come Hell or high-water, you know that she has the potential to catapult over any and all defects and deficiencies in the factory-made machinery. If only she possesses the requisite accompanying will-power. Suddenly venting, she soars off into the wild blue yonder like a fully-fueled rocket. Obviously, we're dealing with an exceptionally brilliant, highly educated professional here, who has accumulated years of technical experience in her field of endeavor on the job, and received all of the corresponding highly specialized training to match in academic circles. We can't argue this point. She knows all the answers, reacts instantly, or in any case, rapidly to the difficult situations she encounters. She has the wherewithal to resolve any potential emergency. She has the means to find the cure, resolve the matter, remedy the situation. If only she would come down out of her ivory tower. Initially, what we do not know is why she behaves in the jerky, sluggish, stroboscopic, potentially schizoid manner that she does, at least initially, until the plot begins to thicken and reveal itself, little by little, and as current events gradually unfold. I, for one, do love a good mystery, and view her story as being among the best of the genre. The novel offers a great deal of suspense, too, by the way, as the reader attempts to unravel the truth and figure out what exactly has been going on in her life. A fascinating life it is, too. You can easily identify with her and naturally want to know more about her in greater depth. You are so inclined to want to dig deeper-- being the thoughtful, curious individuals that we are. Hence, true to her word, she proves to be a very interesting character, indeed. As you learn more about the woman, you begin to think that you know how you yourself would react to her ever changing set of circumstances, but do you really? The mere thought of putting yourself in her shoes drives you on to even greater, frenzied heights. You begin to study the situation from every imaginable angle, while spiraling totally out of control. It's a fast-reading book and you want answers fast. You enter her home and business unannounced, and wonder, \"Who has gone and ransacked the castle?\" \"Why has she suddenly burned out, like some candle flame on a desktop?\" Or, \"From whence did the smoking gun come hence?\" Somebody has got to give up the ghost, you think. You desperately want to find the skeletons in the closet. Solve the enigma. Have all of your burning questions answered. Her fortune told. You won't be able to just \"Google\" this one and generate any fully-satisfying results. Then, just when you think one mystery has been resolved, another one crops up. Superlative reading for those who dare to tempt fate!",
                "reviewVotes": "4 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Paty",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on February 1, 2023",
                "reviewTitle": "Un libro que sí o sí debes leer.",
                "reviewText": "Compré el libro porque vi que había una película protagonizada por Amy Adams basada en este libro, y me llevé una sorpresa. Desde el comienzo te atrapa y llegas a encariñarte mucho con la protagonista y los giros en la trama son espectaculares.",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Urbashi Roy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on November 1, 2023",
                "reviewTitle": "Very nice book.",
                "reviewText": "Very nice book. Value for money.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Janet B",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on August 5, 2018",
                "reviewTitle": "A GRIPPING, MESMERIZING AND ORIGINAL STORY THAT TAKES YOU ON A ROLLER COASTER RIDE!",
                "reviewText": "Anna Fox lives alone with her cat named Punch in a large house in New York City. She has not been outside for the last ten months. You see, she suffers with Agoraphobia, since a traumatic incident occurred. She spends her time watching black and white Alfred Hitchcock movies, counselling clients online with the same problem and looking out the window and spying on her neighbours with her telescopic camera lens.She is advised to get a tenant to live in the basement to help her if she needs something done. His name is David. Anna has a Ph.D. in psychology. She sees a psychiatrist, Dr. Julian Fielding, regularly and he has added psychotropics, eg. Xanax, Ativan, Prozac, Zoloft, to name a few, to her medications and warns her not to take them with alcohol. She also sees a therapist, who makes home visits once a week. Anna is a boozer. Her preference is Merlot, which she drinks heavily and mixes with her medications. She was warned not to do that and pays no attention.Anna knows everything going on with her neighbours. One day, new neighbours move in across the road. They are the Russells. There is Alistair, his wife Jane and his son named Ethan. Ethan comes over to Anna and gives her a candle as a neighbourly gesture from his family. He and Anna soon become friends.One night, Anna is looking out the window and sees something she shouldn't. She calls the police and then, decides she'll go out to help. She has not been outside for ten months, but she opens the door and does her paced breathing 1-2-3-4 and goes outside with difficulty. She has been drinking and passes out. She is helped up by a Police Officer and brought to her home. She tries to tell the Officer what she thinks she saw, but she is so full of booze mixed with medications that who could believe her? Is she imagining things?What masterful writing! A. J. Finn has written a gasp-for-breath psychological thriller, which is filled with mezmerizing characters, stunning twists and is totally original.This has got to be my favourite book of the year. It is that good. The Woman in the Window is a must read and not to be missed.I highly recommend it and give it 5+ stars.",
                "reviewVotes": "6 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Henrique P. Pacca",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on May 3, 2018",
                "reviewTitle": "História incrível",
                "reviewText": "O livro prende você do início ao fim. No início você até pensa que se enganou e que em vez de um thriller trata-se de um drama com nuance psicológicas. Mas ao longo da leitura tudo evolui para um mistério muito bem montado e que leva a um final surpreendente.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "janzenssss gäng",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on August 23, 2019",
                "reviewTitle": "Spannend und überzeugend",
                "reviewText": "Richtig guter Thriller, der eine sehr liebenswerte Protagonistin hat, deren Gefühle und Handlungen ich so gut nachvollziehen konnte. Das macht das Buch so lesenwert: Es geht nicht (nur) um's \"Whodunnit\", sondern viel mehr um die Biographie und das aktuelle Leben der Hauptperson. Und obwohl ich bei vielen Krimis schnell eine Ahnung davon hab, wer's war, hab ich's in dem Fall erst ganz kurz vor der Auflösung kapiert, es gibt also eine echt überraschende Wendung...",
                "reviewVotes": "One person found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$10.62",
                "sellerName": "Book's Bar & Beyond",
                "sellerRating": "4.5"
            },
            {
                "price": "$6.04",
                "sellerName": "Yournewstuff",
                "sellerRating": "4.5"
            }
        ]
    }
}