{
    "remaining_requests": 1344,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Housemaid-Freida-McFadden/dp/1538742578",
    "body": {
        "name": "The Housemaid",
        "price": "$8.11",
        "originalPrice": "$12.99",
        "rawPrice": 8.11,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Housemaid-Freida-McFadden/dp/1538742578",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81AHTyq2wVL._SY466_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Freida McFadden",
            "link": "https://www.amazon.com/Freida-McFadden/e/B00ELQLN2I/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "",
        "customerReview": "4.5 out of 5 stars",
        "customerReviewCount": 252510,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews Review \"A twisted, unpredictable story.\"―HerCampus.com About the Author New York Times, USA Today, and #1 Amazon bestselling author Freida McFadden is a practicing physician specializing in brain injury who has penned multiple Kindle bestselling psychological thrillers and medical humor novels. She lives with her family and black cat in a centuries-old three-story home overlooking the ocean, with staircases that creak and moan with each step, and nobody could hear you if you scream. Unless you scream really loudly, maybe."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Tuesday, February 20. Order within 14 hrs 41 mins"
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Don't miss the New York Times and USA Today bestseller and addictive psychological thriller with a jaw-dropping twist that’s burning up Instagram and TikTok--Freida McFadden’s The Housemaid is perfect for fans of Ruth Ware, Lisa Jewell, and Verity. Every day I clean the Winchesters’ beautiful house top to bottom. I collect their daughter from school. And I cook a delicious meal for the whole family before heading up to eat alone in my tiny room on the top floor. I try to ignore how Nina makes a mess just to watch me clean it up. How she tells strange lies about her own daughter. And how her husband Andrew seems more broken every day. But as I look into Andrew’s handsome brown eyes, so full of pain, it’s hard not to imagine what it would be like to live Nina’s life. The walk-in closet, the fancy car, the perfect husband. I only try on one of Nina’s pristine white dresses once. Just to see what it’s like. But she soon finds out… and by the time I realize my attic bedroom door only locks from the outside, it’s far too late. But I reassure myself: the Winchesters don’t know who I really am. They don’t know what I’m capable of… Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Literature & Fiction",
                "link": "https://www.amazon.com/Literature-Fiction-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=17"
            },
            {
                "name": "Genre Fiction",
                "link": "https://www.amazon.com/Genre-Fiction-Literature-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10134"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Grand Central Publishing (August 23, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 336 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1538742578"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1538742570"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 11.2 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 5.2 x 0.85 x 7.95 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#14 in Books (See Top 100 in Books) #8 in Psychological Fiction (Books) #15 in Suspense Thrillers #16 in Psychological Thrillers (Books)"
            },
            {
                "name": "Customer Reviews",
                "value": "4.5 4.5 out of 5 stars 252,510 ratings"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/5c5ba91a-2825-42b3-a56b-53477a6e7660.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/46e7dbfc-d6fe-4bcc-b4ae-4512229a491c.__CR0,0,1940,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/b6a7f07c-90aa-42aa-829d-07c832bf3757.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/987dfe1a-83b9-4d7c-8726-0e53f4215897.__CR0,0,1080,1080_PT0_SX300_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/8ef5d9cc-3041-4fc1-8a08-df2e28ba8020.__CR0,0,1080,1080_PT0_SX300_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Marcy Sorenson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGW4MOTNLP5IDAACEQNJY5KVO5NA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R2DHGM0RUHN4XT?ASIN=1538742578",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 11, 2024",
                "reviewTitle": "5.0 out of 5 stars so many twists I didn’t see coming",
                "reviewText": "𝙏𝙝𝙚 𝙃𝙤𝙪𝙨𝙚𝙢𝙖𝙞𝙙 𝙗𝙮 𝙁𝙧𝙞𝙚𝙙𝙖 𝙈𝙘𝙁𝙖𝙙𝙙𝙚𝙣⭐️⭐️⭐️⭐️⭐️ 5/5This book was so much more than I had it expected it to be. Millie was recently let go from her job, and was forced to live in her car. Desperate to find a job with room and board included, she applies for a live in maid/nanny position. Millie doesn’t expect to get the job, but a week after interviewing for the job she gets a call asking if she wants it.Millie sees instantly why the Winchesters needed help, their place is a mess. Nina Winchester is rude to Millie from day one. Nina will purposely tell Millie one thing, to turn around and say she never asked her to do it to begin with. Andrew Winchester is the complete opposite, he’s kind, and understanding.Millie is forced to live in their attic, on a small cot, with a door that only locks from the outside, but it’s better than living in her car. After working for the Winchester’s for a while, she can’t understand how Andrew is married to such an awful woman as Nina. Millie and Andrew start to get close, maybe too close. Millie thinks she understands what’s happening at the Winchester’s, but by the time she realizes she was wrong, it’s already too late.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Robert T. Borremans",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGYNFDQY2KETHWZTP635KWN37BEA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1CVPX5376U2K4?ASIN=1538742578",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 19, 2024",
                "reviewTitle": "4.0 out of 5 stars Interesting Story of Deception But Not as Addictive as Advertised",
                "reviewText": "The Housemaid by Frieda McFadden is basically a story about two women - Millie Galloway and Nina Winchester. Millie is a prison parolee who is down on her luck and living out of her car. Nina is the wife of a successful businessman living a life of leisure and luxury. She hires Millie to be the family maid.Millie soon learns that Nina is a bit eccentric if not outright crazy. Millie begins to despise her shortly after she begins the job. She also develops an attraction to Nina’s “hunky” husband Andy who also is attracted to Millie. During a weekend when Nina is away, Millie and Andy, of course, attend a Broadway show and spend the night together. Millie secretly wishes that Nina would leave so she can have Andy to herself and become “queen of the house.” Eventually, following a heated vocal argument, Andy tells Nina to “get out” because he does not love her anymore. Millie appears to have gotten her wish - or does she? Every story has two sides. Once the other side becomes known the reader learns the jaw-dropping twist.I found The Housemaid a little befuddling. They story is well written and the author cleverly disguises the actual events. But, the first half of the book goes on and on over the same territory - Millie dislikes Nina and has fantasies of winning her husband. The the next 25% the story is Nina’s version of the same situations. It gets to the point of OK, I get it already! Finally, the surprises begin to occur and things get more interesting. But, by then, you almost do not care anymore.There is not a lot of character development and the situations are all too reminiscent to so may of a cheap romance novel. I did not find The Housemaid to be “addictive psychological thriller” rather it is an entangled mess of psychotic characters. The 3 main characters all seem unstable and delusional with no redeeming traits, although Nina, surprisingly, comes closest to being likable.",
                "reviewVotes": "39 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "JasmineJasmine",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHCW5HOUANRJIAQC47U2RZ6XELUA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R26F728P7US2TL?ASIN=1538742578",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 15, 2024",
                "reviewTitle": "5.0 out of 5 stars First Time Freida McFadden Reader",
                "reviewText": "Someone I follow on Instagram posted this book and I had been looking for a new read and once I read the summary I ordered it . I received the book yesterday and I’m already half way through I can barely put it down! I’m trying to get into reading for leisure and I love how quick the book moves. It keeps you on your toes from the very first page. It’s not bogged down with too much detail which I can really appreciate. I’m going to purchase the next book in the series at target because I don’t even think I can wait for Amazon to deliver! So thankful for a new author with an ample selection to follow.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [
                        "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif.jpg",
                        "https://m.media-amazon.com/images/I/61n0VOXE4bL.jpg"
                    ],
                    "video": ""
                }
            },
            {
                "reviewerName": "McMahons ",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEZDF33ANLLNGII5MVPHE632GKIQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GTPT85BHH5WV?ASIN=1538742578",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 13, 2024",
                "reviewTitle": "5.0 out of 5 stars How to avoid sleep 101",
                "reviewText": "Do you feel like not sleeping? Do you need a reason to stay awake?Well, search no more because this book is the only thing you need (and a few cans of monster).When I tell you I couldn’t put it down, I mean it LITERALLYYYY.1000000 / 10Easily one of the best books I’ve ever read.I have an obsession with murder - mystery books and this one is in my top 5.The author has a magnificent way of captivating your attention THE ENTIRE TIME.So well written, so many twists, characters fit in the story perfectly.Anyways, yeah. BUY IT.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "AmzCusto",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMNFJOGR3RPX2ZVVER2FYNS3FFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RBJDFHC5U7IZ7?ASIN=1538742578",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 12, 2023",
                "reviewTitle": "4.0 out of 5 stars It was just okay… mini spoiler in my review",
                "reviewText": "This was the first book I brought when I got my Kindle. I put it off for so long and finally started to read it TWO WEEKS AGO! This is my first book read from this author even though I brought four of her books. It was a simple enough writing style that it made for an “easy” read. This story follows Millie, an ex-con who’s living in her car and looking for work. Nina hires her to help clean and watch her bratty daughter. This book is suppose to be a psychological thriller, but it was more of a contemporary thriller. This is about an abused wife trying to escape and getting some revenge. The way it was tickled in I disliked. I was easily put off by Nina’s mistreatment of Millie and that led to me putting the book down for over a week . I guess I finally found a “trigger”. Wealthy people getting off on mistreating their workers burned me deep in my soul. No matter what the intent was , her turning cruel to someone else and setting them up for it is a terrible thing. I get the author’s intent was to take you to that place and bring you back with shock, but I don’t forget and I rarely forgive so I disliked Nina and never felt for her even after so finished the book. When they switched to Nina’s pov, I put the book down again. I tried each day to read but didn’t get past more than one page . Tonight I forced myself to finish this book. I will say when they switched back to Millie’s pov it picked back up and I started enjoying it again. I didn’t like how choppy the storylines were and the way they lingered the mistreatment of Millie for most of the book while giving us rushed events throughout wasn’t planned well. I’d still recommend this to someone who is looking for a domestic violence story where the ex gets her revenge. I like where the author is taking Millie’s storyline though.",
                "reviewVotes": "47 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Leticia",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Brazil on February 1, 2024",
                "reviewTitle": "Para os amantes de um bom suspense",
                "reviewText": "Uma leitura que só te permite parar quando termina. Várias reviravoltas incríveis. Amei demais!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "adam",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on January 18, 2024",
                "reviewTitle": "Unexpected twist",
                "reviewText": "Absolutely loved this book! And the second one The Housemaids Secret. Haven't been able to get into a book for months now, just couldn't find something that grasped my attention. Bought the second one first, didn't know there was a first, and couldn't put it down. Snatched the first one on Amazon a couple days later and same thing, couldn't put it down! Read both books in under 2 weeks because I was so into it, would have been sooner if I didn't have stuff to do, or work lol! Definitely recommend! Cannot wait for the third one! Preordered and I'm just sitting here looking out the window until it arrives in June!",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Iris",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Mexico on January 1, 2024",
                "reviewTitle": "Te atrapa",
                "reviewText": "Un thriller que va de giro en giro, muy natural como se expresan Los personajes y como lo que creias no lo es .... no diré mas...",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jana",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on February 13, 2024",
                "reviewTitle": "Super spannend",
                "reviewText": "Ich habe mein neues Lieblingsbuch gefunden. Super spannende und fesselnde Handlungen. Das Buch ist im britischen Englisch geschrieben, kann für manche eine Umstellung sein.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Nuria",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on February 12, 2024",
                "reviewTitle": "Adictivo y con giros inesperados",
                "reviewText": "Hacía mucho que no me leía un libro que me cautivaba tanto desde el inicio. De ese estilo de libros que no puedes dejar de leer.Muy intrigante y con giros que no dejan indiferente al lector.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": [
            {
                "price": "$7.86",
                "sellerName": "Shakespeare Book House",
                "sellerRating": "5"
            }
        ]
    }
}