{
    "remaining_requests": 1338,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Pretty-Girls-Karin-Slaughter-audiobook/dp/B0149GV4KU",
    "body": {
        "name": "Pretty Girls",
        "price": "$0.00",
        "originalPrice": "",
        "rawPrice": 0.0,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Pretty-Girls-Karin-Slaughter-audiobook/dp/B0149GV4KU",
        "soldBy": null,
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": false,
        "maximumQuantity": "",
        "stockDetail": "",
        "couponInfo": "",
        "mainImage": "https://images-na.ssl-images-amazon.com/images/I/51aGJMG5snL.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Karin Slaughter",
            "link": "https://www.amazon.com/s/ref=dp_byline_sr_audible_1?ie=UTF8&search-alias=audible&field-keywords=Karin+Slaughter"
        },
        "brand": "Karin Slaughter",
        "merchantInfo": "",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 76104,
        "answeredQuestionsCount": 0,
        "editorialReviews": [],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Lee Child says it’s “stunning… certain to be a book of the year.” Kathy Reichs calls it “extraordinary… a major achievement.”Jeffery Deaver says that “fiction doesn’t get any better than this.” Gillian Flynn says of Karin Slaughter: “I’d follow her anywhere.” See for yourself what these #1 New York Times-bestselling authors are talking about.Sisters. Strangers. Survivors.More than twenty years ago, Claire and Lydia’s teenaged sister Julia vanished without a trace. The two women have not spoken since, and now their lives could not be more different. Claire is the glamorous trophy wife of an Atlanta millionaire. Lydia, a single mother, dates an ex-con and struggles to make ends meet. But neither has recovered from the horror and heartbreak of their shared loss—a devastating wound that’s cruelly ripped open when Claire’s husband is killed.The disappearance of a teenage girl and the murder of a middle-aged man, almost a quarter-century apart: What could connect them? Forming a wary truce, the surviving sisters look to the past to find the truth, unearthing the secrets that destroyed their family all those years ago … and uncovering the possibility of redemption, and revenge, where they least expect it.Powerful, poignant, and utterly gripping, packed with indelible characters and unforgettable twists, Pretty Girls is a masterful novel from one of the finest writers working today.Included with this gripping thriller is Karin Slaughter’s chilling short story “Blonde Hair, Blue Eyes.” Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Mystery",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10457"
            },
            {
                "name": "Women Sleuths",
                "link": "https://www.amazon.com/Women-Sleuths-Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_4?ie=UTF8&node=10480"
            }
        ],
        "productInformation": [
            {
                "name": "Listening Length",
                "value": "20 hours"
            },
            {
                "name": "Author",
                "value": "Karin Slaughter"
            },
            {
                "name": "Narrator",
                "value": "Kathleen Early"
            },
            {
                "name": "Whispersync for Voice",
                "value": "Ready"
            },
            {
                "name": "Audible.com Release Date",
                "value": "September 29, 2015"
            },
            {
                "name": "Publisher",
                "value": "Blackstone Audio, Inc."
            },
            {
                "name": "Program Type",
                "value": "Audiobook"
            },
            {
                "name": "Version",
                "value": "Unabridged"
            },
            {
                "name": "Language",
                "value": "English"
            },
            {
                "name": "ASIN",
                "value": "B0149GV4KU"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#50 in Audible Books & Originals (See Top 100 in Audible Books & Originals) #2 in Women Sleuth Mysteries #5 in Psychological Thrillers (Audible Books & Originals) #6 in Suspense (Audible Books & Originals)"
            }
        ],
        "manufacturerProductDescription": [],
        "manufacturerProductImages": [],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "Samantha Miskowic",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH5JLV7UXWLPQX2N7Q3TSYBBRKVQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RJSE3VLNVJT13?ASIN=B0149GV4KU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 4, 2024",
                "reviewTitle": "5.0 out of 5 stars Wow!",
                "reviewText": "I went into this book blind. I think I saw it on tiktok a little while ago and added it to my kindle and was like aww I’ll get around to it. I’m kind of upset I waited so long to read it! This book was HEAVY. I wasn’t prepared for the rawness of the emotions I would feel. I have a sister and I can’t imagine something like this happening to my family. I try to be spoiler free in my reviews so I just want to say the villain is as sick as they come, the healing the families have to go through is inevitable, and the corruption of people who are supposed to protect us just rage inducing. I know things in real life probably happen like this and it’s just incredibly sad to think about. I would definitely recommend this book, I would probably read it again.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Melissa",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AH244QKMDUJNUFPGV54NKXZV6JNA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R15VHBI0J72SX0?ASIN=B0149GV4KU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 13, 2024",
                "reviewTitle": "4.0 out of 5 stars Captivatingly Twisted and the SAT words!",
                "reviewText": "(4.5) I have never read something with so many twists and possible directions. While extremely disturbing at certain points, the author takes you on a journey you want to see through the end. I’ll need at least 3 simple, sweet beach reads to cleanse the images from this book’s story from my memory. Part thriller, part family drama, and ultimately just disturbing. I haven’t read a book like this, ever. Not to mention, I have never used the dictionary tool as many times as I did while reading this book.While I feel like I would have loved some better monologues and details of the psyche and emotions of Claire and Lydia at times—Paul is an extremely interesting character and doesn’t seem to far off from people lurking in the IRL. At points it felt drawn out and at times vignettes moved too much at surface-level.Recommend this but prepare yourself to not know how to feel and to be captivated by such disturbing imagery and plot. Your mouth will hang open at times.",
                "reviewVotes": "8 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Pisces51",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHXYPVRGP5MKCYIYCQR34SOLNGHQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1GR8A60RMZ9IJ?ASIN=B0149GV4KU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on July 7, 2021",
                "reviewTitle": "5.0 out of 5 stars STANDALONE BESTSELLING PSYCHOLOGICAL THRILLER FROM SLAUGHTER A HOME RUN!!!",
                "reviewText": "PRETTY GIRLS [2015] By Karin SlaughterMy Review Five Stars*****I was already a fan of Karin Slaughter's novels two decades ago when I was renting books on tape to “read” during the extensive driving that was required by my job at the time. It was more recently (2018) that I decided to read both her GRANT COUNTY and WILL TRENT series in chronological order. A few were re-reads but even those were exceptionally entertaining. Slaughter quickly ascended to the list of my top five authors on the planet Earth. I was “blown away” by the sheer power of Slaughter’s works, and as I commented in a review of her debut novel BLINDSIGHTED [2001] she is the author that set the new gold standard for excellence. I had already read the entire WILL TRENT series before I began the earlier GRANT COUNTY books. She did not stop writing after half a dozen novels, or continue to write but with diminishing returns. We refer to \"Early Cornwell\", \"Early Patterson\", \"Early Koontz\".. and at least in my case \"Early Stephen King\" for a reason.The NYT Bestseller PRETTY GIRLS was released six years ago but it was the first standalone novel I’ve read by Karin Slaughter. It was so riveting that I would have stayed up all night to finish it if I hadn’t had commitments. Even so, I finished it in two sittings. I absolutely LOVED it. That was hardly a surprise to me. I have commented in the past that I become so completely mesmerized by her novels that I become almost oblivious to my immediate environment. I think there could be a tornado roaring like a train, a home invasion in progress, or a house fire blazing and I would still be holding my Kindle in a death grip reading her words and turning pages. She has the power to invoke what I like to refer to as “immediacy”. As a reader I feel like I am right there in the moment.This doesn’t need to be a long or wordy review. Amazon has logged 8642 ratings so heaven only knows how many readers rated this bestseller on Goodreads. I just looked it up and the answer is a whopping 205,017 (to include 18,548 reviews)! Tess Gerritsen, also among my top five favorite writers, commented that Slaughter is “One of the boldest thriller writers working today”. Translated that means that Slaughter does in fact “write with a razor” and her characters and scenes cut to the quick. If a reader doesn’t want to encounter raw realism and brutal reality, then stay away from Slaughter. Her works slice to the bone and deliver a visceral punch to the gut and a precordial thump to the heart that sends our emotions in freefall. Like Gillian Flynn has been quoted so often “I’d follow her anywhere”. I have to read the rest of her standalone works on my Kindle. I intentionally wanted to parse them out to prolong the thrill, but PRETTY GIRLS was so d--- great I’m not sure I can wait.The most impressive characteristic of Karin Slaughter’s works IMO is that the creative genius she possesses does not seem to give any indication of waning. Her ability to take the reader into the darkest most depraved minds and acts of sadistic predation on women sets her apart from anyone writing today. She doesn’t hesitate to “pull the trigger” on the sickest and most shocking scenes with forensic details that are not for everyone. Slaughter’s peers are writing crime fiction that tackles the same underlying theme of violent crimes against women, and their works include riveting thrillers that knock my socks off. It isn’t that the works of giants like Gerritsen and prolific authors like Hoag cannot deliver the goods on this theme. There is just “something” about Slaughter that goes where no mainstream crime fiction queen has gone before. Gerritsen called it “bold” and I think that’s putting it mildly.I have to say as I am ready to post my own “two cents worth” that I am surprised by not only the number of negative reviews I see but also by their relevant fervor about the visceral impact and graphic depiction of violence in PRETTY GIRLS. This is a small percentage of readers when you consider the whole of course. In any case, I find it annoying those readers post reviews saying they cannot bear to finish the book…that there ought to be warnings about the content, and so on. Good heavens. If you don’t want your emotions and your sensibilities to be stripped raw then don’t read Karin Slaughter’s works.",
                "reviewVotes": "38 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jordan",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEI6NO3XZJ3YFW2PNB3OMK4WOUTQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RSTQQ8IA0SQC1?ASIN=B0149GV4KU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on February 5, 2024",
                "reviewTitle": "5.0 out of 5 stars punch to the gut",
                "reviewText": "This book was a tad confusing for the first while but once I hit chapter 4 or so it took off like a freight train. This book is gripping, twisty, devastating, and will make you hate men more than you already might. Most of my highlights and annotations are some variation of “what the hell is happening”, “JFC”, or “wtf”. It almost never lets up, but keeps you captivated.As an Atlanta native, the references to the city were a fun nod even if they did feel a bit crammed in there at times (i mean seriously, she practically does an unrealistic tour of the perimeter the entire book). Loved this, will definitely read more from Karin Slaughter.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Jiliana Dulaney",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AEM274ONI75CKNT5EIQKDGGUOTEQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3Q3VEUL6RIRQ5?ASIN=B0149GV4KU",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2024",
                "reviewTitle": "5.0 out of 5 stars WOOOOOOW what a book.",
                "reviewText": "I just read this entire book in the span of an afternoon. It’s now 3am. I couldn’t put it down when my phone is now at 6% to review it either.Honestly, this book was one of the most devastating, gut wrenching, absolutely horrific things I’ve ever read in my life. I didn’t see any of it coming. If I could give it more than 5 stars I would because it absolutely deserves it. I cried at so many points in this book and I can count on less than one hand the amount of times a book has moved me to tears. I’ve been estranged from my family. I know what those complicated feelings are like. It felt like my family was getting closure from fictional characters. It broke me. I think I may need a day or two between books to fully decompress from this one.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "S. Thompson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHLK6SPZR55LPIJK6E7HHAHD54GQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3QL22GFGFXCM6?ASIN=B0149GV4KU",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 16, 2024",
                "reviewTitle": "4.0 out of 5 stars Wow! What a thriller!",
                "reviewText": "Okay so check your trigger warnings. This book if graphic with some serious subjects. I think some of it didn't have to be so graphic and it made me uncomfortable.The characters Claire and Lydia are great! There are twists and turns in this psychological thriller. Again the material is very graphic and can be disturbing.The father and his letter to his daughter were gut wrenching. It brought tears to my eyes and broke my heart.I have never rad a keen Slaughter book until this INE and I will say it wad very very good. I will certainly look at her other books in the future.I do need a break after thus book so it will be a while before I choose another.",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Kala",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Canada on July 27, 2023",
                "reviewTitle": "Prepare to be captivated, shocked, and utterly enthralled by Karin Slaughter's masterful thriller.",
                "reviewText": "Before you read this book, PLEASE check the trigger warnings. If you are ok with graphic themes and enjoy a twisted thriller, this book is incredible, however it is not for everyone and please proceed with caution if you are not ok with any of the themes depicted.Prepare to be captivated, shocked, and utterly enthralled by Karin Slaughter's masterful thriller. This dark and haunting tale will leave you breathless as you navigate the treacherous depths of human depravity and uncover secrets that will send shivers down your spine. I do not suggest reading this book while you are home alone as I did, it had me jumping at every little noise!Karin Slaughter's writing style is nothing short of brilliant. She weaves a complex web of suspense and intrigue, drawing you in from the very first page and refusing to let go until the final shocking revelation. Her ability to create vivid, gritty and realistic characters is astounding, making you feel as though you are intimately acquainted with every twist and turn of their lives.The story follows the lives of two sisters, Claire and Lydia, whose lives were shattered by the mysterious disappearance of their beloved sister, Julia, over twenty years ago. Slaughter paints a harrowing picture of their pain and grief, taking us on an emotional rollercoaster as we witness their desperate quest for answers and justice. The raw emotions portrayed in their journeys are palpable, tugging at your heartstrings with every revelation and setback.One of the most remarkable aspects of this book is Karin Slaughter's ability to delve deep into the darkest recesses of the human psyche. She fearlessly explores themes of violence, trauma, and the sinister underbelly of society, leaving you with a sense of unease long after you've turned the final page. The author's unflinching portrayal of evil and its consequences is chilling, reminding us that monsters can lurk in even the most ordinary of places.Throughout the narrative, Karin Slaughter expertly builds suspense, planting seeds of doubt and suspicion that keep you on the edge of your seat. The pacing is flawless, with each chapter unveiling new layers of the twisted puzzle, leaving you guessing and second-guessing until the shocking climax. The tension is palpable, and you'll find yourself rapidly flipping pages, unable to tear yourself away from the relentless suspense.While this book delves into the depths of darkness, Slaughter also injects moments of levity and wit that provide a much-needed respite from the intense atmosphere. Her skillful use of dark humor and sarcasm adds a layer of complexity to the narrative, making it all the more engaging and realistic. These moments of lightness serve as a stark contrast to the grim reality of the story, reminding us that even in the face of unimaginable horror, humanity can still find strength and resilience.Karin Slaughter's ability to create compelling characters, craft a chilling and suspenseful plot, and explore the depths of human darkness is unparalleled. With its gripping narrative, emotional depth, and expertly executed twists, this book will leave you both shaken and exhilarated. Brace yourself for an unforgettable journey into the heart of darkness.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Eddy",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United Kingdom on February 3, 2024",
                "reviewTitle": "Gripping",
                "reviewText": "First Karin Slaughter book I've read - I read a short story collaboration with Lee Child with Will Trent & Jack Reacher which I enjoyed so thought I'd try it. Gripping from the beginning. Writing style is fast paced & characters draw you in. Some scenes are quite graphic but leads to more suspense & reveals the horror of such attacks and the story is better for it.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Aishwarya Banerjee",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in India on July 4, 2023",
                "reviewTitle": "Amazing thriller, rivetting!!",
                "reviewText": "Loved it",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "David",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Germany on November 6, 2022",
                "reviewTitle": "I have read most all of Karin Slaughter‘s books and this one is one of the best",
                "reviewText": "I have read most all of Karin Slaughter‘s books and this one is one of the best, riveting and with many unexpected twists and turns. A true page turner!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "",
                "reviewLink": "",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in Spain on October 28, 2022",
                "reviewTitle": "Will make a hell of a blockbuster",
                "reviewText": "Not for the faint hearted. Get past the first two setting the scene, slow paced chapters and then the action just whacks you in the face and the book becomes an obsession.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}