{
    "remaining_requests": 1275,
    "original_status": 200,
    "pc_status": 200,
    "url": "https://www.amazon.com/Missing-Bane-Island-Novel/dp/1420154583",
    "body": {
        "name": "The Missing: A Chilling Novel of Suspense (A Bane Island Novel)",
        "price": "$6.79 $1.09",
        "originalPrice": "$8.99",
        "rawPrice": 6.79,
        "currency": "$",
        "canonicalUrl": "https://www.amazon.com/Missing-Bane-Island-Novel/dp/1420154583",
        "soldBy": {
            "sellerID": "",
            "name": "Amazon.com",
            "link": "https://www.amazon.com"
        },
        "deliveredBy": "",
        "parentAsin": "",
        "asinVariationValues": [],
        "isPrime": true,
        "inStock": true,
        "maximumQuantity": "100",
        "stockDetail": "In Stock",
        "couponInfo": "",
        "mainImage": "https://m.media-amazon.com/images/I/81JSPISARDL._SY425_.jpg",
        "images": [],
        "imagesCount": 1,
        "highResolutionImages": [],
        "videos": [],
        "videosCount": 0,
        "productGuidesAndDocuments": {
            "productDocumentationLink": "",
            "userManualLink": ""
        },
        "byLineInfo": {
            "name": "Lisa Childs",
            "link": "https://www.amazon.com/Lisa-Childs/e/B004MXDTOA/ref=dp_byline_cont_book_1"
        },
        "brand": "",
        "merchantInfo": "Ships from and sold by glenthebookseller.",
        "customerReview": "4.3 out of 5 stars",
        "customerReviewCount": 125,
        "answeredQuestionsCount": 0,
        "editorialReviews": [
            "Editorial Reviews About the Author Lisa Childs is an award-winning, New York Times and USA Today bestselling author of over eighty-five novels. She was born on Halloween, which may have fated her predilection for spinning dark and twisty stories. In addition to romantic suspense, she also writes women’s fiction, paranormal and contemporary romance. Lisa loves to hear from readers who can contact her on Facebook, and through her website LisaChilds.com."
        ],
        "warrantyMessage": "",
        "shippingMessage": "",
        "deliveryMessages": [
            "FREE delivery Thursday, February 22 on orders shipped by Amazon over $35",
            "Or fastest delivery Wednesday, February 21. Order within 15 hrs 33 mins",
            "$3.98 delivery Friday, March 1."
        ],
        "climatePledgeFriendly": {
            "present": false,
            "details": ""
        },
        "features": "",
        "description": "Fans of Lisa Regan and Mary Burton will be riveted by the latest in the award-winning author’s dark thriller series. Laden with Gothic atmosphere and brilliantly plotted twists and turns, Halcyon Hall, a former insane asylum-turned-luxury resort on a remote island off the coast of Maine, becomes the setting for a rash of grisly crimes… “Grips you from the beginning and refuses to let you go until the very end.” —Elle James, New York Times bestselling authorDrawn to the former Bainesworth Manor in the wake of a murder, reporter Edie Stone wants answers. It’s been over forty years since the psychiatric hospital on Bane Island shut down, and the mystery of women vanishing there remains unsolved. But the exclusive retreat isn’t just protected by the dark pine forests and crashing waves of Maine’s rocky coast—it’s surrounded with silence. Everyone on the island is keeping secrets.Especially Dr. Elijah Cooke, grandson of the man who headed Bainesworth Manor and the psychiatrist-proprietor of a new wellness resort on the same premises. His desire to help people seems at war with his fierce loyalty to his family. He’s sure the world is out to get him. And as the accidents and coincidences pile up, Edie becomes convinced someone is trying to kill them both. But if she’s close enough to be a threat, she must be close to the truth . . .PRAISE FOR LISA CHILDS “Atmospheric, emotional, and well-told.” —New York Times bestselling author Lori Wilde on The Runaway “Grabs you from page one . . . Lisa Childs paints an eerie, haunting suspense that will keep you riveted until the very last page!” —Rita Herron, USA Today bestselling author on The Runaway“Page-turning…Bane Island may be a dangerous place, but readers will look forward to coming back.” —Publishers Weekly on The Hunted Read more",
        "breadCrumbs": [
            {
                "name": "Books",
                "link": "https://www.amazon.com/books-used-books-textbooks/b/ref=dp_bc_aui_C_1?ie=UTF8&node=283155"
            },
            {
                "name": "Mystery, Thriller & Suspense",
                "link": "https://www.amazon.com/Mystery-Thrillers-Books/b/ref=dp_bc_aui_C_2?ie=UTF8&node=18"
            },
            {
                "name": "Thrillers & Suspense",
                "link": "https://www.amazon.com/Thrillers-Mystery-Books/b/ref=dp_bc_aui_C_3?ie=UTF8&node=10484"
            }
        ],
        "productInformation": [
            {
                "name": "Publisher ‏",
                "value": "‎ Kensington (October 25, 2022)"
            },
            {
                "name": "Language ‏",
                "value": "‎ English"
            },
            {
                "name": "Paperback ‏",
                "value": "‎ 320 pages"
            },
            {
                "name": "ISBN-10 ‏",
                "value": "‎ 1420154583"
            },
            {
                "name": "ISBN-13 ‏",
                "value": "‎ 978-1420154580"
            },
            {
                "name": "Item Weight ‏",
                "value": "‎ 5.6 ounces"
            },
            {
                "name": "Dimensions ‏",
                "value": "‎ 4.13 x 0.73 x 6.75 inches"
            },
            {
                "name": "Best Sellers Rank",
                "value": "#171,923 in Books (See Top 100 in Books) #4,160 in Murder Thrillers #5,245 in Psychological Thrillers (Books) #14,209 in Suspense Thrillers"
            },
            {
                "name": "Customer Reviews",
                "value": "4.3 4.3 out of 5 stars 125 ratings"
            }
        ],
        "manufacturerProductDescription": [
            {
                "media_text": "The Hunted The Runaway Afraid A Bane Island Novel #2 A Bane Island Novel #1 Three Riveting Stories of Suspense",
                "media_link": []
            }
        ],
        "manufacturerProductImages": [
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/7e303b17-b4f1-44e4-8eec-8e502a5b154c.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/306d8491-14e9-4a0b-91bc-6a27e9fd466e.__CR0,0,970,600_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/4180bd5f-5fd9-4e3d-a3f1-db6472463ac7.__CR0,3,970,300_PT0_SX970_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/70acd831-6783-4561-b43f-924ec59c1564.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/d46c0354-49e4-4bb0-8dc9-fe6c9c304fb5.__CR0,0,150,300_PT0_SX150_V1___.jpg",
            "https://m.media-amazon.com/images/S/aplus-media-library-service-media/25ba774b-c16d-41ea-85c1-6f9090a78af9.__CR0,0,150,300_PT0_SX150_V1___.jpg"
        ],
        "sponsoredAds": [],
        "productReviewBottom": [],
        "reviews": [
            {
                "reviewerName": "David S. Johnson",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGBCHQBGSJJ63K6QHJQID2WDV7WA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RGLUE4GUQWLBZ?ASIN=1420154583",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on September 13, 2023",
                "reviewTitle": "5.0 out of 5 stars Build up to a great ending",
                "reviewText": "It started a little jumbled for me but once I got it figured out it was a good read. Looking forward to next one.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Amazon Customer",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGZDZDPA4AFLXYXZTIMBWPPFHYPA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3728EJ4JZBL0K?ASIN=1420154583",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on April 9, 2023",
                "reviewTitle": "5.0 out of 5 stars Awesome",
                "reviewText": "Oh my goodness!!! This book is absolutely awesome! Get ready for a fast paced, action packed, thrill ride! You will NOT be able to put it down! The characters, storyline, the ending is movie worthy!! More please!!",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "SKTRL",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGDAMGFT74SXDMFQD7NDYI4EOTFA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RHEFNN19O7WIM?ASIN=1420154583",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on January 28, 2023",
                "reviewTitle": "4.0 out of 5 stars Couldn't put it down!",
                "reviewText": "The Missing intrigued me from the start. I kept reading to see if reporter Edie Stone was going to get all the answers to her questions. I did enjoy the book but don't feel like I understand the whole Bane Island mystery yet. The Missing is Book 3 of the series and I hadn't read book 1 or 2 yet. I will now be reading the rest of the books in the series to get answers to my questions. I would suggest starting at Book 1. The missing had suspense, mystery, romance, intrigue and more.",
                "reviewVotes": "2 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Doris Jenkins",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHSCDYRJ2ZJMDULRAWDRLOOY4KXA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R1QZVJIPS38SFV?ASIN=1420154583",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on November 18, 2022",
                "reviewTitle": "5.0 out of 5 stars excellent book",
                "reviewText": "This is a good story but takes a while to understand what is happening",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Michael Youens",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHMOPGMT3NEYYAJZJY3G3Q7LFF5A",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3CR1K4IBKY54V?ASIN=1420154583",
                "reviewRating": "3.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 6, 2022",
                "reviewTitle": "3.0 out of 5 stars Romantical",
                "reviewText": "The third book in the Bane Island series felt more romantic to me. It was nice to see the lighter side of some of the main characters. There are still some mysteries that are still unsolved. I’m guessing there will be another book. What happened to those babies?",
                "reviewVotes": "",
                "reviewVerifiedPurchase": true,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Vickie Watts",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHP3QLR76ONZXMJBEA5RHAKYU3IQ",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/RN5764BO1EAW5?ASIN=1420154583",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on October 26, 2022",
                "reviewTitle": "5.0 out of 5 stars Deception and Past Secrets Lead to Danger in the Present",
                "reviewText": "This is a gothic mystery with an creepy atmosphere and some very secretive characters. Baineworth Manor is the perfect setting for this book, on an island that is accessible only by one bridge that may or may not be safe to cross depending on the weather. The sheriff, a man named Deacon, who was featured prominently in a previous book, becomes almost a secondary character in this one as Dr. Elijah Cooke, the manager of the manor, and Edie Stone, a determined reporter, come front and center in this third book of the trilogy. After reading the first two books, I had no idea that there were so many secrets left to be revealed, but there were a multitude of them. Dr. Cooke is protecting his own reputation and that of the manor by refusing to cooperate with Edie but as she begins to unravel the truth, both of their lives are endangered. There is a touch of romance here but most of the book is centered around Edie’s quest for the truth about the young women who disappeared at the manor, their horrific treatment that bordered on Nazi tactics of mind control and the babies that they supposedly had who also disappeared. I did not feel close to any of the characters but I did feel empathy for Edie and for the ladies at the B & B, one of whom was a “guest” at the manor and her mind was irrevocably damaged because of her stay there and the loss of her baby. There are a lot of twists and turns, several switchbacks and more than a few red herrings thrown out there to keep me engaged and interested in finishing the book. I enjoyed the methodical and persuasive way that Edie went about her investigation, but I must say that I was a little disappointed that everything was not totally explained by the end of the book. However, I am delighted that another book is coming, so I look forward to more revelations in that one. The thrills were real, the chills were uncomfortably realistic and the characters were so well portrayed that I found myself giving them advice based on the clues that I was following as I read. This book can be read as a standalone but I think the entire trilogy should be enjoyed as they all tell one fantastic story of a man and his experiments that went out of control and affected an entire community. I will warn other readers that there are some disturbing scenes as well as references to abuse and violence against women, so if that is a trigger for you, then this book may not be for you. Since I have no such triggers, I thoroughly enjoyed every minute that I spent with this dynamic and brilliantly written novel.DisclaimerDisclosure of Material Connection: I received a complimentary copy of this book from Kensington via Netgalley and also an autographed copy from the author via KBS Consultant. I was not required to write a positive review. All opinions expressed are my own. I am disclosing this in accordance with the Federal Trade Commission’s 16 CFR, Part 255, “Guidelines Concerning the Use of Testimonials and Endorsements in Advertising.”",
                "reviewVotes": "3 people found this helpful",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "Teri",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AHNTOSQFPX55GDMKJ4JROB46WLAA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R25M6O6MRJSXGU?ASIN=1420154583",
                "reviewRating": "5.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on May 19, 2023",
                "reviewTitle": "5.0 out of 5 stars Well written and entertaining",
                "reviewText": "Third book in the Bane Island saga. Well written with great scenic descriptors and amazing characters which could be more developed. Quick and easy, suspenseful read. Looking forward to the next book.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            },
            {
                "reviewerName": "mom2o2272",
                "reviewerLink": "https://www.amazon.com/gp/profile/amzn1.account.AGKTZFXAFAOYQ75LKHICVLOAEVSA",
                "reviewLink": "https://www.amazon.com/gp/customer-reviews/R3ROQNCC1A80LE?ASIN=1420154583",
                "reviewRating": "4.0 out of 5 stars",
                "reviewDate": "Reviewed in the United States on December 21, 2022",
                "reviewTitle": "4.0 out of 5 stars Suspense and Mystery",
                "reviewText": "What more could you ask for. Was a little hesitant at the beginning but warmed up pretty fast to the story line. Have not read the first two in this series but intend to do so in short order. Won the book but unfortunately cannot post a photo as requested, do not have that capability. Not a subscriber to most social media platforms which is my own choosing. Did enjoy even though this was not my normal preference in reading material. Give it a try, you won't be disappointed.",
                "reviewVotes": "",
                "reviewVerifiedPurchase": false,
                "reviewCommentCount": 0,
                "media": {
                    "images": [],
                    "video": ""
                }
            }
        ],
        "otherSellers": []
    }
}